{"rank":"577","title":"Tradition","id":"8ftqi6","url":"/r/nosleep/comments/8ftqi6/tradition/","time":"1525031007000","body":"<div class=\"md\"><p>Every first born child of a Walter woman was a daughter, with soft honey colored skin, wild dark hair, and penetrating amber eyes. Didn&#39;t matter who her daddy was, she was always the spitting image of her mother. And every first born daughter ended up married and expecting (though not always in that order) by the age of 18, and divorced by 23. Tradition had yet to be broken for at least a century, and the vast majority of Walter women had no interest in seeing it die.</p>\n\n<p>But there&#39;s always a rebel. A girl who knows there has to be more to life than dealing with some no-account man and spitting out babies. A girl who&#39;s focused on being better than some stupid tradition that her mama, granny, and great granny never questioned. The girl damn near did it too, made it to college in the big city and everything...only to end up on her mama&#39;s doorstep 6 months before her 19th birthday, defeat in her eyes and belly already starting to swell.  Her boyfriend stuck by her and within a few weeks they were officially husband and wife; a few months later little Loribeth made her entrance into the world. </p>\n\n<p>Things hadn&#39;t gone exactly as Loribeth&#39;s mama had hoped, but she did manage to buck Tradition in one way: her marriage remained intact, and all her children had the same father, from Loribeth right on down to me, the youngest. I doubt any of us were meticulously planned, but I was definitely an &quot;oops&quot; baby, born a full 18 years after my big sister. Mama always said she fully expected Lor to come bounding in any day that year, announcing ecstatically that she was pregnant and gonna marry that fool boy who followed her around like a love sick puppy...but she was definitely not prepared to find out that very same day she herself was pregnant with me. </p>\n\n<p>My niece Kimmy and I were born minutes apart, and grew up as close as if we&#39;d been sisters. Besides our own mothers, no one could even tell us apart; we wore matching dresses to school, matching bows on our thick black braids, and claimed proudly to anyone that asked that, yes, we were twins. Lor was content with her lot in life; Kimmy&#39;s inevitable fate and my luck in avoiding it didn&#39;t bother her at all. Mama was always quick to remind me that I had an opportunity most women in our family couldn&#39;t even imagine, and I would never forgive myself if I wasted it. So I kept my head in the books, my grades near perfect, and my social circle down to just Kimmy. No late night parties, no vying for high school popularity, hell, I even promised myself I wouldn&#39;t so much as kiss a boy until I&#39;d finished college and gotten a real job; Tradition was not to be underestimated.</p>\n\n<p>But sometimes, no matter how careful you are, how ambitious, how determined, the train hits a bump and gets a bit off track. Other times, the train hits a much larger bump and goes careening off the track into a bottomless chasm with the screaming passengers trapped inside, hurtling towards their doom. </p>\n\n<p>I sat hunched over the tiny desk in my dorm room that night, putting the final touches on my Russian Lit essay when my phone buzzed urgently on the nightstand. </p>\n\n<p>&quot;Hi Mama. Kinda late for a check in, isn&#39;t it?&quot; &quot;Honey...can you come home? It&#39;s...&quot; Mama choked up; a dread that had begun quietly welling in my gut rose up to my throat. &quot;Is Daddy okay? What happened?&quot; &quot;It&#39;s...it&#39;s Kimmy...baby, Kimmy&#39;s dead.&quot; A car accident...damn truck didn&#39;t even slow down...thrown right through the windshield...</p>\n\n<p>Hard as I try to remember the details between that moment and now - Mama&#39;s grief-filled rambling, me hurriedly packing and driving all night, Lor&#39;s anguished wail that only broke when she fell asleep from exhaustion - everything&#39;s fuzzy and distorted. The funeral sticks out though; Lor sat down next to me and we held each other close, weeping for our beautiful Kimmy. My sister wouldn&#39;t leave my side the entire day, and more than once I caught her staring at me from my periphery. I&#39;m almost positive I even glimpsed a smile though her tears as she gazed at me, and for the first time in my life my strong resemblance to Kimmy made me uneasy. But I figured Lor would need to find comfort wherever she could right now, and that dread rising up in me again was just my own grief. Mama asked me to stay with Lor for a bit afterwards, hoping it might help her through the loss. </p>\n\n<p>Now I hate to think my own mother - the woman who made sure that the bright lights of the big city and the promise of a life beyond motherhood and marriage were my nightly lullabies, and who was absolutely hellbent on giving Tradition the finger in memory of her own lost future – set me up, but every day this goes on I can&#39;t help but feel she knew full well what would happen. It&#39;s been two weeks since the funeral, and I haven&#39;t left my sister&#39;s house. In fact, I haven&#39;t left Kimmy&#39;s room...Lor won&#39;t let me. I&#39;ve screamed, cried, threatened, begged, all for nothing. Mama hasn&#39;t tried to visit or call the house once since I&#39;ve been locked in here. I know Lor&#39;s putting something in my food; I&#39;m always too tired to fight and too dazed to think of a way to  escape. And every night, I have the same horrible dream...shadows grinning, grunting, sweating over me for hours on end. When the first light of dawn filtering through the blinds chases them away, a satisfied whisper floats above me:</p>\n\n<p>&quot;See Kimmy? Tradition always finds a way.&quot;</p>\n</div>\n","author":"elhiyacho"}