{"rank":"4172","title":"The streetlight out my window keeps turning off","id":"8gipfz","url":"/r/nosleep/comments/8gipfz/the_streetlight_out_my_window_keeps_turning_off/","time":"1525278284000","body":"<div class=\"md\"><p>Some kids have teddy bears. Others have blankets, dolls, or stuffed animals they fall asleep with.</p>\n\n<p>I had something a bit different: a light.</p>\n\n<p>My window faced a hill. And on that hill was a lone streetlamp, shining down on the road beneath it. Now, I <em>knew</em> that it was just some normal, boring old road. But in the minutes between sleep and wake, where my mind grew fuzzy and dreams started to thread into my consciousness, I imagined it as something more.</p>\n\n<p>The streetlamp in Narnia, against falling snow. The lights of a mermaid colony, shimmering through ocean depths. The glow of a fairy, sitting on a rose petal in a deep forest.</p>\n\n<p>But, one night –</p>\n\n<p>The light was off.</p>\n\n<p>“Mommy! Daddy!” I yelled down the hall, stomping my little feet across the carpet. “The light is gone!”</p>\n\n<p>“What, your night-light?” Dad asked, setting his book on the couch. Mom was slumped on the other side, snoring lightly.</p>\n\n<p>“Not <em>that</em> light! The light up on the hill!”</p>\n\n<p>He followed me back into my bedroom, where I pointed wildly out the window. Through the sheer curtains, there was pitch black beyond. “Why is it gone, Daddy?”</p>\n\n<p>“I don’t know why, Caroline,” he said, scooping me back into bed. “Maybe the lightbulb is out. Remember a week ago, when Mommy changed the lightbulb in the kitchen? Sometimes that happens to lights, and they need to be fixed.”</p>\n\n<p>I nodded.</p>\n\n<p>After another bedtime story, I drifted off into sleep. And when I woke up a few hours later, in the middle of the night –</p>\n\n<p>The light was back on.</p>\n\n<p>I smiled, snuggled against my pillow, and closed my eyes.</p>\n\n<hr/>\n\n<p>But the next night, the light was out again. And the next, and the next. I grew crankier, my sleep got worse. My parents, for the most part, ignored it.</p>\n\n<p>But then something wonderful happened.</p>\n\n<p>On Tuesday night, Mom had to go to the cell phone store over the hill. “Mommy! Let me come!” I begged, clawing at her shirt. “Please?”</p>\n\n<p>“It’s almost your bedtime,” Mom said, shooting a look at Dad. He shrugged.</p>\n\n<p>“Okay, you can come. But then you go <em>right</em> into bed, okay?”</p>\n\n<p>I nodded.</p>\n\n<p>And soon, we were driving up that familiar road, towards the streetlamp. I wanted to see what was wrong with it – was the lightbulb busted? Or some wires frayed? Then, I thought in my little kid brain, I could tell Mom how to fix it.</p>\n\n<p>As we rounded the bend, though, I was in for a surprise.</p>\n\n<p>The streetlamp was on.</p>\n\n<p>Shining brightly like a beacon, its light glistening over the wet road. “It’s on, it’s on!” I cried, so loudly that the windows rattled. “See, Mommy?”</p>\n\n<p>“Yes, honey,” she said, distractedly.</p>\n\n<p>And it was still on when we made our way back. I was so excited, I was jumping up and down in my seat. Narnia, mermaids, and fairies all came rushing back into my head. When we got home, I ran down the hall, jumped into bed, and turned to the window.</p>\n\n<p><em>No.</em></p>\n\n<p>It was out.</p>\n\n<p>I shot out of bed. <em>How?</em> I thought. <em>We just saw it five minutes ago! It was on! Shining bright!</em></p>\n\n<p>I ran over to the window. I grabbed a fistful of curtain and yanked it back. <em>Where is it?</em> I thought, glancing around wildly. <em>It</em> has <em>to be here!</em></p>\n\n<p>My eyes adjusted to the darkness.</p>\n\n<p>Shadows faded into view. Gray against black, bulky and large.</p>\n\n<p>Not the shape of a road and trees.</p>\n\n<p>I pulled the curtain further, curious now.</p>\n\n<p>And then I leapt back.</p>\n\n<p>Two hands, cupped against the window.</p>\n\n<p>Attached to the hulking shadow of a man.</p>\n\n<p>I screamed.</p>\n\n<p>No, there was nothing wrong with the streetlamp – nothing at all.</p>\n\n<p><em>He</em> was just blocking its <a href=\"https://www.facebook.com/scaryblair\">light.</a></p>\n</div>\n","author":"BlairDaniels"}