{"rank":"681","title":"I think my grandfather might be a serial killer. Part 9.","id":"8ivfxi","url":"/r/nosleep/comments/8ivfxi/i_think_my_grandfather_might_be_a_serial_killer/","time":"1526124450000","body":"<div class=\"md\"><p><a href=\"https://redd.it/8epbdy\">Part One</a>   </p>\n\n<p><a href=\"https://redd.it/8fg0wx\">Part Two</a>   </p>\n\n<p><a href=\"https://redd.it/8g3t9k\">Part Three</a>   </p>\n\n<p><a href=\"https://redd.it/8gmv5o\">Part Four</a>   </p>\n\n<p><a href=\"https://redd.it/8h7vaz\">Part Five</a></p>\n\n<p><a href=\"https://redd.it/8hjvu5\">Part Six</a></p>\n\n<p><a href=\"https://redd.it/8htpr5\">Part Seven</a></p>\n\n<p><a href=\"https://redd.it/8i5k72\">Part Eight</a></p>\n\n<p>&nbsp;</p>\n\n<hr/>\n\n<p>&nbsp;</p>\n\n<p>We headed to the kitchen, my grandfather gesturing for me to keep low.  Flinging open the exterior door, he glanced outside and then beckoned for me to follow.  We weren’t very far from his SUV, but we still had to round the corner of the house and I could hear the pick-up sliding to a halt in the front yard.  We moved to the corner of the house and stopped, my grandfather turning to whisper to me.\n&nbsp;</p>\n\n<p>“Here’s the key fob.  When I say ‘go’, you do three things.  First, you unlock the doors with the fob.  Second, you count to two.  Third, you run to the passenger side and get in and down.  Got it?”\n&nbsp;</p>\n\n<p>I nodded, my hands trembling as I took the fob from him.\n&nbsp; </p>\n\n<p>“Good.  Go!”\n&nbsp;</p>\n\n<p>I unlocked the car, wincing internally at the loud honk it gave as the locks disengaged.  But then I realized no one was going to pay much attention to it with my grandfather shooting at them.  It occurred to me that I wasn’t counting, so I bolted after what felt like two seconds and made it around to the passenger side.  I felt a moment of sharp panic as my hand fumbled at the door latch before getting the door open.  Once inside, I tried to ball into the floorboard as much as possible.  I had just enough time to take in the smells of the SUV—a mixture of my grandfather, some kind of oil and a metallic scent—before he was opening the driver’s door and getting in.\n&nbsp;</p>\n\n<p>Without saying anything he punched the ignition button and threw the SUV into gear.  I heard two more gunshots and something make a loud pinging on the outside of the car, but we kept going, and as I eased up into the seat I saw that we were clear of the yard and headed down the road.  Looking back, I saw three of the four men clustered around a fourth that was on the ground but still moving.\n&nbsp;</p>\n\n<p>My grandfather looked over at me.  “You hurt?”\n&nbsp;</p>\n\n<p>I shook my head.  “I’m fine.  What about you?  What happened?”\n  &nbsp; </p>\n\n<p>“Nah, I’m fine.  I think I got a couple of pellets of buckshot in my leg, but it was from a ricochet.  Nothing major.”  He gave me a tight smile.  “As for what happened, I shot two of them.  One in the arm and one in the leg.  Can’t risk killing them at your parents’ house or anywhere they can be linked back to us.”\n&nbsp; </p>\n\n<p>“What?  Why?  They already know who we are.”\n&nbsp;</p>\n\n<p>He took a turn down a sandy dirt road and gave a shrug.  “They do, but they’re likely the only ones that do.”  Turning to glance behind my seat, he nodded to himself.  “Look, while we talk I need you to do a couple of things.  Grab the box of stuff behind your seat.  You should also see a small blue bag behind mine.  Get both of them up here with you if you can.”\n&nbsp;</p>\n\n<p>I did as he asked, pulling a medium sized cardboard box up to find it contained six glass jars with sealable lids.  The jars were all full of nails and ball bearings.  I thought about asking questions, but I knew there was no time.  He’d tell me what I needed to know.  I found the blue bag where he said it would be.  It contained a variety of items, and as I looked through them, he told me what to use.\n&nbsp;</p>\n\n<p>There were little rolls of taped up facetowels in the bag, and following his instructions, I unwrapped three of them to find small glass vials with rubber stoppers in the middle.  The vials contained some kind of fluid, but he told me to be careful not to open the vials.  Instead, I was to slide them gently into the middle of the nails and bearings in three of the jars.  After I did so, he told me to take a specific plastic bottle from the blue bag and squirt it on the metal in the jar until the three prepped jars were two-thirds full of the liquid too.  Then I had to screw the sealed lids back on.\n&nbsp;</p>\n\n<p>When I was done, he gave me a grin.  “Congratulations.  You’ve just made nail bombs.  Now be very careful with them.  Don’t drop one and try not to tip them over.  We’ll need them in a few minutes.”\n&nbsp;</p>\n\n<p>His cautions made me feel queasy.  “Why will we need them?  Because you think they’re going to track us down?”\n&nbsp;</p>\n\n<p>He nodded.  “Oh yeah.  They better.  That’s why I didn’t try to kill any of them.  These cultists…they are very dangerous but sometimes they lose their stomach when they see a buddy get killed.  Weekend warrior types I guess.  And we need them to follow us.”  He looked at the odometer.  “We’re about ten miles away now, need to be at least ten more.”\n&nbsp; </p>\n\n<p>“Anyway, back to what I was explaining earlier.  This cult, the House of the Claw.  I didn’t know they existed at first.  Looking back on it, there were signs of their influence.  That little boy that Salk picked up and killed for instance.  What was he doing out that late?  And I had learned later that he lived with his parents over fifty miles from where Salk snatched him.  What are the odds of that happening?  I can’t prove it, but I suspect the House dropped him back there and had tipped Salk off as to where to look.\n&nbsp;</p>\n\n<p>His expression was growing angrier as he talked.  “That’s what those crazy bastards do.  They help the outsiders.  Facilitate their plans.  Worship them.  Not every outsider has any cultists around them—in fact only about one in three or four do, as best as I can tell.  But where the House does exist, they operate like some terrorist cells.  There’s usually four or five working together, and they don’t know the identity of anyone else in the cult outside their cell.”\n&nbsp;</p>\n\n<p>“Of course, those higher up in the chain know who are in the cells, so they can send directives down as needed.  But if a cell member gets caught, they can’t give up their bosses or details about the larger organization.  It’s clever in some ways, but it has flaws too.”  He looked over at me, his face stony.  “For instance, these men that are after us.  They have no way of telling people outside of their group who we are unless they get contacted by their bosses.  That does happen periodically, but not often.  So as long as the entire cell dies, our identities are safe.”\n&nbsp;</p>\n\n<p>I felt my skin going cold.  “Even if we kill them, how will we know we got them all?”\n&nbsp;</p>\n\n<p>He nodded.  “It’s always a risk.  But the most likely source of them finding out is a House member in the Sheriff’s office.  If that person isn’t among this group, we know there’s likely another person.  If they are, odds are good this is all of them, as they tend to do things as a full unit most of the time.  There are no sure answers though.  We just have to do the best we can.  Be smarter and better than them.”\n&nbsp;</p>\n\n<p>We drove on for a couple of minutes in silence and then he spoke again.  “Put your seatbelt on if you would.”  After I clicked it on, he continued.  “You good with all this?  I know it’s a lot.  And I hate you’re at risk, especially having not signed up for it.  Believe me, I know this is hard to adjust to.  But this is as serious as it gets.”  He turned, studying me for a moment.  “Life or death.  Good and evil, even.  These are bad people that do terrible things, and they will torture and murder us if we don’t get them first.”\n&nbsp;</p>\n\n<p>I met his eyes.  “I believe you.  I get it.  I’m freaked out, but I get it and I’m with you.”\n&nbsp; </p>\n\n<p>“Good.  Because I think this is a good spot.  Hold onto those bombs, it’s going to be bumpy.”  With that, he yanked the wheel to the left, then back to the right, sending us down the sandy shoulder and into a stand of bushes.  I held the box containing the jars in a death grip, my muscles tensing at every clink of glass.  When we came to a stop, he smiled at me.  “Good job.  Okay, let’s go.  Get out, come around so I can show you something on this side, and then you’ll come back and grab the three jars you prepped.”\n&nbsp;</p>\n\n<p>I did as he asked, and when I reached his side of the SUV, I saw he had a long-bladed hunting knife in his hand.  He pointed it at the tire as he talked.  “Now, as you may have figured out, we’re trying to make it look like we wrecked.  We took this sandy road because even if they’re idiots they should be able to track us on it.  But just because they aren’t all brilliant doesn’t mean you should underestimate the least of them, and some of them are very capable.  Either way, we need a visible reason why we would have wrecked here.”\n&nbsp;</p>\n\n<p>He took the knife and slammed it into the crevice between two tire treads.  When he pulled it free, I could immediately hear the angry hiss of air escaping.  My grandfather tapped the outer wall of the tire.  “It’s easier to flatten a tire on the side.  The rubber is weaker.  But it’s also very obvious that it was cut, so when you need it to look like a blowout instead of a cut tire, you have to hide the cut in the treads.  If they saw a cut tire, they might suspect an ambush.  Now hopefully they’ll just think we had bad luck.”  He patted my shoulder and laughed.  “Lots of teachable moments today I guess.  Now go get those bombs.”\n&nbsp;</p>\n\n<p>He guessed we had about three minutes left before they should be on us.  In that time he grabbed a scoped rifle out of the back of the SUV and got me into a position across the road with my three nail bombs and some final advice.\n&nbsp;</p>\n\n<p>“The way these things work is that they have to hit something hard enough that the vial inside breaks.  When its contents mix with what’s in the outer part of the jar, you get an explosion filled with metal and glass shrapnel.  So, what that means is this.  First, you throw it against something hard or high enough it will break on landing.  The jars at this point should weigh about 7 or 8 pounds, so if they land on asphalt from more than 10 feet up they should break.  Throwing it hard at the road or the truck will work too.  But try not to directly hit a person or you run the risk of it bouncing off and not breaking.  And above all else, do not throw it where it goes off close to you, or you’ll be caught in the shrapnel too.”<br/>\n&nbsp;</p>\n\n<p>He had me positioned in an elevated spot behind some bushes about twenty feet from the road.  “You are far enough away here and in a good position.  And hopefully they will be focused on the wrecked SUV for a bit.  But wait until they start to get out or the pick-up will protect them a good bit.  Take your time and aim, and when your third one is thrown, you slowly work your way further into the woods.  Do not wait for me and keep going straight back from the road.  I’ll find you when I’m done with them.”  He seemed to be debating something internally, and after a moment he pulled out the semi-automatic and handed it to me.  “Have you fired one of these before?”\n&nbsp;</p>\n\n<p>I nodded.  “A couple of times in college.  I know how to shoot, and this is the safety, right?”\n&nbsp;</p>\n\n<p>He looked grave.  “Yes.  Keep it off, but keep your finger away from the trigger unless you mean to fire.  There is one in the chamber, and it will keep feeding them in unless it jams, which it shouldn’t.  You have 13 shots.  Do not lock your arms, do not pull the trigger, squeeze it.  Hold it tightly when you fire and remember it will recoil.  For both the gun and the grenades, accuracy is always better than speed.  Slow is fast and fast is slow.  And do not fire this at all unless you have no alternative.  My goal is that they never see you at all.  Okay?”  I could see by his expression he was scared, and I realized it was fear for me.  I felt a wave of love for him and guilt at how I’d treated him.\n&nbsp;</p>\n\n<p>“I’ll be okay.  I’ll play it safe and do what you told me.”\n&nbsp;</p>\n\n<p>He gave me a half-smile and reached forward to pat the side of my head affectionately.  “Got to go.  See you in a few minutes.”\n&nbsp;</p>\n\n<p>With the ease and agility of someone half his age, my grandfather moved down the embankment and back across the road before disappearing into the woods on the other side.  Less than a minute later I saw a cloud of dust as the cultists’ truck made its way towards us.\n&nbsp;</p>\n\n<p>As they approached I felt anxiety gripping my stomach and I fought it down.  I was worried I’d make a mistake, but I still had to try.  I would do what he had told me and trust that it would work out.  As they approached the “wreck”, they slowed to a crawl and then stopped.  From my vantage I could see one of the men was stretched out in the bed and I guessed that was the one he had shot in the leg.  His companion and the passenger in the cab got out to investigate the SUV.  I hesitated, wanting the driver out as well, but he wasn’t budging.  Time to do it.\n&nbsp;</p>\n\n<p>The first jar hit the top of the truck, and while the explosion wasn’t as loud as I had expected, the carnage was impressive.  One of the cultists was still high enough up the shoulder that a wave of shrapnel slammed into the back of his head, shooting up a bloody mist and sending him sprawling forward.  The driver was looking around terrified but seemed unharmed, and I couldn’t see the third person any longer, as he had dove down after the first bomb went off.<br/>\n&nbsp;</p>\n\n<p>Not sure of my next best target, I ultimately aimed one for the bed of the truck.  My aim was off but lucky—it hit the driver’s side window and shattered the glass, detonating as it did so.  I heard the driver scream, but he wasn’t dead from it.  Instead, he was frantically putting the truck in drive and trying to get away.  I felt a thrill of panic, but then I heard my grandfather’s rifle.\n&nbsp;</p>\n\n<p>One crack, and I saw the cultist who had dove for cover near the SUV lose half his skull as the truck pulled away.  A second crack, and the one I had knocked down with the first bomb flinched as the bullet went into his torso.  Fifty yards down the road, I saw my grandfather step out onto the road and line up another shot.  The truck had surged past me now, and any idea of using the third bomb seemed fruitless.  I was worried he was going to get away, but then a third crack came.\n&nbsp;</p>\n\n<p>I saw the back windshield break and suddenly the truck veered from the road as though swept aside by some invisible giant’s hand.  It crashed into a small culvert on the left side of the road, and what I could see of the driver’s head through the broken side window was a ruined mess.  I was about to stand up and say something to my grandfather when I heard another gunshot.\n&nbsp;</p>\n\n<p>The man in the back of the bed had either been flung out or crawled out as soon as the truck came to a halt.  He was down on his belly in the culvert, some kind of revolver in his hand.  The gunshot had come from him, aimed at my grandfather.  I glanced back at him and saw he seemed okay and was taking cover down the opposite shoulder.  Still, I felt anger welling up inside of me.  These fucking people, trying to kill us, helping whatever these things were that were hurting people, what the actual fuck?  How could that be allowed to go on?  And now this piece of shit was shooting at Grandpa?\n&nbsp;</p>\n\n<p>“No.  Fuck no.”  I stood up, throwing the remaining bomb at him.  My aim was too good that time, and it pelted him in the shoulder, bouncing off without detonating.  I kept moving towards him, shifting the pistol to my dominant hand and taking aim.  The first shot went wide.  So did the next two, and by then he had gotten over being struck and figured out where the new shots were coming from.\n&nbsp;</p>\n\n<p>I saw him turning and aiming towards me and forced myself to slow down.  I lined up a shot on his chest and squeezed the trigger.  He fired a second before me, but it went wide.  Mine didn’t, and I saw him jerk as the shot took him in the shoulder close to where the jar had struck.  He dropped the gun with a shriek, but I kept firing, emptying the clip into him.  I looked around to see my grandfather approaching.\n&nbsp;</p>\n\n<p>He looked at the bullet-riddled body and then at me.  “Looks like you got him.  You okay?”  I nodded silently, trying to keep my hands from shaking in front of him.  My grandfather moved past to check the driver before coming back to me.\n&nbsp;</p>\n\n<p>“They’re all dead.  I don’t know if any of them are tied to the sheriff’s office or not, but we may get lucky and be able to find that out.  Believe it or not, these guys carry their wallets on them most of the time when they do this stuff.  I guess they’re worried about getting a ticket.”  He gave me a serious smile and squeezed my shoulder.  “I know what we just did wasn’t easy, and you’re still in shock now.  That’s okay, but I need you with me.  Can you change out our flat tire for the spare while I check their bodies, get rid of that last bomb and get our shell casings?”\n&nbsp;</p>\n\n<p>I smiled weakly back and said I could.  Twenty minutes later we were back on the road and headed away from the carnage.  My grandfather had found wallets on three of the four men, and one of those men had an ID card identifying him as a dispatcher for the sheriff’s office.  It was a small comfort, and it wasn’t a guarantee that the House of the Claw wouldn’t still be after us, but it was something.\n&nbsp;</p>\n\n<p>I asked him where we were going, and he hesitated.  “It’s time I take you to where I do my real work.  I need to tell you more and there are things you need to see.”  He paused as though picking his next words carefully.  “Some of it is going to be hard to hear and to look at.  I think we may be past you not believing me or trusting me, and that’s great.  But it also makes it harder when I have to show you things you aren’t going to want to believe.”\n&nbsp;</p>\n\n<p>I felt fear creeping back in past the staticky shell of shock and adrenaline.  “What do you mean?”<br/>\n&nbsp;</p>\n\n<p>“Just that there’s more to all of this, and it’s a lot worse than just some random monsters occasionally killing people for fun, as though that wasn’t bad enough.  I’m not trying to spook you, just prepare you.  For now, try to rest some.  We’ve got a ways to go.”\n&nbsp;</p>\n\n<p>What troubled me more than his words was the way he said them and the haunted look in his eyes as he studied the road.  For all that had happened, he had never really seemed rattled or afraid aside from worrying about me.  But whatever he was thinking about now, I could tell he was shaken.\n&nbsp;</p>\n\n<p>I don’t know my grandfather well, but I know him much better now than I did just a day ago.  And whatever is able to truly worry or scare that man—well, it terrifies me.</p>\n\n<p>&nbsp;\n<a href=\"https://redd.it/8jnl02\">Part Ten</a></p>\n</div>\n","author":"Verastahl"}