{"rank":"148","title":"Don't forget me.","id":"8iwh49","url":"/r/nosleep/comments/8iwh49/dont_forget_me/","time":"1526136466000","body":"<div class=\"md\"><p>Okay sure, so yeah.  I got a story I can share, and you can call bullshit on it if you want to, what’s real is real, and denial doesn’t really change that.  I’ve tried…</p>\n\n<p>Anyway…</p>\n\n<p>Last year I moved into an apartment in West Ridge; Chicago.  My whole game-plan was to lay low for a bit and get my shit together so I could get established again.  My last line of jobs gave me a figurative ass-kicking which forced me to go underground for a while.\nSo it was kinda like a square-one situation for me.  Start anew in a new city and work your way up.</p>\n\n<p>A few months into living here and I’ve got pretty much the basics nailed.  I’ve got stable wi-fi and lots of signals I can leech off of.  I’ve managed to snag a computer and a few phones for work and a few for burning.  And I found a good place for takeout, everything I really need.</p>\n\n<p>But one evening, I’m just scanning through to find some private servers and sites to sift through and I find this stereotypical bullshit creepypasta one.\nIt’s got like a basic black background with plain white courier-font, it’s got all these cliché code messages written in ASCII graphics and it looks exactly like every fake-ass Deep-web spook story you’ve read about in those shitty creepypastas.</p>\n\n<p>Now to put it into perspective, it’s the middle of October at this point and Halloween is like my favourite day of the year, I adore that shit more than Christmas.  So I’m browsing the pages and to my pleasant surprise, it’s full of gore pictures, snuff movies, creepy videos of bizarre shit; like some fat dude sitting in a blank room with a traffic-cone on his head while he’s cradling a stuffed doll like it’s his baby.  It’s all just stupid shit like that.</p>\n\n<p>And I’m all over it.  It’s dumb, it’s creepy and gory and all of it is just scratching that itch for spooks on the spookiest month of the year.  I know it’s all crap, and I love it.</p>\n\n<p>But up in the top right of the website, there’s like a little mIRC chat-box for all the users to bullshit each other with. \nAnd every person who logged onto the site gets tagged with a user name, mine was like ‘user#04567’ or something like that, just rando numbers at the end tagline.</p>\n\n<p>Anyway, after a while of browsing some of the vids, I notice that people are trying to message me.  The chat-box is filling up with stuff like:</p>\n\n<p>‘Welcome aboard 4567’ \n‘Good to see you’ \n‘Like whatcha see?’ </p>\n\n<p>All the messages came from lots of different users, all just giving me like a standard greeting.  Oddly cordial for a place that has pictures of dead stuff all over it.</p>\n\n<p>But yeah, I respond back.  Not committing to anything fancy, just an ‘o7’ to salute them off as a reply, and then I get another message back a few moments later.</p>\n\n<p>‘If you’ve got any requests just let us know.’</p>\n\n<p>I admit, I was curious, but I wasn’t stupid.  I wasn’t about to start downloading whatever bullshit they were gonna send me, but I thought I’d bait them a little.  Just to poke around and fuck with them a little bit, make them think that I’d buy into their bullshit.</p>\n\n<p>So, fuck-it...  I asked them what they had in their trove.</p>\n\n<p>And they said, ‘Whatever you’d like I’m sure we can throw it on the site to watch.’</p>\n\n<p>So I asked, ‘Show me the scariest shit you’ve got’.</p>\n\n<p>‘Okay’ </p>\n\n<p>That was their only reply, so I waited for like ten minutes with no real update to site or even any messages from the chat-box, and I asked them when they were gonna upload?</p>\n\n<p>‘When it’s ready’ They said.</p>\n\n<p>Well, I got bored waiting and just resumed watching some of the other vids on the site.  Eventually I got bored of that and started playing some Horror games before 6am hit and I went to bed.</p>\n\n<p>So months later, sometime into early February of the following year, I come home one day after picking up some food and stuff for the apartment, and I’m not sure when exactly it first showed up, I mean I didn’t initially notice it that when I woke up that day.\nBut yeah, there was a flash drive sitting on my nightstand, next to my bed.</p>\n\n<p>It sure as hell wasn’t one of mine, and nothing fancy about it either.  Just a cheap, store-bought USB drive, like the ones you get out of the multi-packs for like ten bucks.</p>\n\n<p>Someone was in my apartment.  Or at least, had been in my apartment…</p>\n\n<p>I started looking around the place, checking windows and the main door for damage or signs of a break-in.  I checked my bathroom and my cupboards; I looked in every conceivable hiding spot I could think of as I wandered around my home with a kitchen knife in my hand, just in case some asshole crept up on me.\nI wasn’t gonna take any chances.</p>\n\n<p>Everything looked okay as far as I could tell, nothing seemed busted up and I was pretty sure nothing was stolen.  Nothing seemed out of the ordinary as far as I could figure, at least besides that flash drive...</p>\n\n<p>So I booted up one of my old throwaway laptops that I use for burning and I took a look at the drive, and all that’s on there is a single video file.  </p>\n\n<p>Untitled.avi</p>\n\n<p>The video plays, and it’s from a camcorder.  Everything’s all in like a monotone low-light vision sorta deal to see in the dark.  And all I can see is me.  The camera’s just watching me sleep, or more specifically, the dude who is holding the camera up to my face, is filming me sleep.</p>\n\n<p>I felt fucking sick.  That kinda anxiety that makes you feel nauseous?  Well I’m feeling it pretty strong as this guy moves the camera around my bed and then starts to take a walk around my apartment.\nHe starts going into my fridge and starts checking out some leftovers I had in there, and then he’s looking through the kitchen cupboards and poking around the garbage bin.\nHe combs though my whole apartment, never really taking anything or doing anything besides looking at stuff.  And after around forty minutes of all of this bullshit, the camera kinda just slowly pans towards my bathroom door, and then the feed cuts out.</p>\n\n<p>I searched everywhere again.  Going through all the shit he touched on the video and checking to see if it had been moved or taken.  I rechecked the doors and windows.  I was freaking the fuck out.</p>\n\n<p>At the time I didn’t even link any of this bullshit back to that site yet.  I was just mind-fucked that some creepy asshole managed to get into my apartment and film me while I was asleep and go through all my shit while I was just blissfully unaware.</p>\n\n<p>I didn’t sleep that night.  Or day I should say…  I’m practically nocturnal with my sleeping habits.\nBut yeah, I didn’t know what the fuck to do.</p>\n\n<p>I couldn’t go to the cops.  I’d have to give a statement, they’d likely check my details, and then I’d be in for some shit.<br/>\nThere was nobody back home I could call, that shit was completely off-limits.\nI could ask my landlord about it, but he’d just call the cops if he saw the video, and I’d be back to shit-creek with no paddle again.</p>\n\n<p>After seeing that video, I stayed awake as long as I could.  I fucking nailed the windows shut, drew the curtains and planted a chair up against the main door.  And I don’t think I left the apartment for like two whole days.\nAnd in those two days I tried to practically deconstruct that whole fucking video.  I was trying to analyse every inch of the shots, zooming into the windows to see if I could catch any reflections or look at anything that would give me any hint or clue as to who this guy was.\nThe only thing I could see of his, were his hands, and they were covered in brown leather gloves with black sleeves of his coat covering his wrists.  I couldn’t see any skin, tattoos, jewellery or anything to distinguish him.  Hell I didn’t even know if it even WAS a guy.  It could have been a girl for all I know…</p>\n\n<p>But after a while of freaking out and boxing myself in my place, I fell asleep, I think I passed out at my desk because that’s where I woke up, with my computer monitor staring back at me.<br/>\nAnd as I made my way to the kitchen to brew some coffee, I flip the curtains back to let the light in and I see it near my window by the fire escape.  A small brown package, just a little rectangle box wrapped up in brown packing paper, with a little yellow bow on it, like those cheap Christmas ones you just stick onto the presents.</p>\n\n<p>Took me a while to yank out the nails and open my window again, but I managed to get out onto the fire escape and snag the box, and yeah.  It had my name on it.  My real name…\nInside was a bottle of perfume, and not cheap shit either, Gabrielle Chanel; like easily a hundred bucks a bottle for this stuff.  Next to that were some white silk underwear, lingerie-level stuff, and a bottle of lube...    And in the midst of this creep-show was another flash drive.</p>\n\n<p>This new drive had another video on it, and it took me a second to figure out what was going on.  It was all shaky and clearly filmed through a camcorder, the background noise was really fucking loud and from what I could see, the guy was on a bus as it was rumbling through the streets.  He wasn’t driving it; he was just a passenger, like some of the other people the camera picked up.\nBut it was focused mainly on the person sitting in the row in front of him.</p>\n\n<p>It was me.</p>\n\n<p>This asshole had been sitting right behind me on the bus, and I didn’t even notice.\nI tried hard thinking about faces I’d seen on the bus in the past, but hell you might as well asked me what I ate for dinner on the 18th of March six years ago…  There’s no way I could remember who exactly was sitting behind me whenever I got on the bus.  I used it often, but not habitually at specific times or anything, and I had no idea when this video was shot.  It could have been days or weeks ago.</p>\n\n<p>Around this time as I got to analysing the second video, I realised I had got an email today from someone called user#1201 and it was titled ‘the scariest shit you’ve ever seen.’ And obviously yeah, I immediately connected the dots back to that site again.</p>\n\n<p>On the email was a message and a link.</p>\n\n<p>The message read ‘How much do you think you’re worth?’</p>\n\n<p>The link took me to a private auction listing.\nThere were pictures of me posted all over it.\nThere were tonnes more videos of me being followed all over town.  Some of them were watching me from my windows in my apartment.\nA lot of stuff about me was also listed on there.  My real name, my date-of-birth, my blood type, my bust size and even some stupid made up shit about my kinks and preferences.</p>\n\n<p>And then of course there were people placing bids on me.  Current highest bidder was listed at $16,100.</p>\n\n<p>They were bidding on getting to pick how I’d die.</p>\n\n<p>It was a snuff auction site.</p>\n\n<p>They knew practically everything they needed to know about me.  They had been following me everywhere and I had no idea.  I didn’t know what they looked like or when they’d be watching.  They could have been watching me even that minute.\nI felt like crying as I watched two so called ‘clients’ try to outbid one another to decide whether I should die by being suffocated or beaten to death.  Others chimed in with bids to see me stabbed in the throat or have my feet sawn off, which they then wanted to keep…</p>\n\n<p>I closed the browser and shut everything off.  Including the lights in my apartment and I just sat in silence in the dark for a while.  I don’t know for how long exactly, I just kinda spaced out in panic, wondering what the fuck to do. </p>\n\n<p>I then started packing my stuff.  Throwing some clothes and phones into a backpack along with some cards and anything else I thought I’d need.</p>\n\n<p>And once I got all that stuff together, I just stopped.</p>\n\n<p>I didn’t know where to go…</p>\n\n<p>I didn’t know anyone who could take me in.</p>\n\n<p>I had never felt more alone in my life than I did at that point.</p>\n\n<p>My life is online.  I meet people there, I make money there, I practically live, work and play there in my every waking hour.  But in reality, I’m a nobody and I’ve got nobody to help me, and nowhere to really go.</p>\n\n<p>If I die?  If whoever these people are come and get me, nobody is gonna notice.  Nobody will report me missing.</p>\n\n<p>Shit, even if my Landlord realises I’m gone he’s not gonna say anything; he’ll just post the eviction notice and lay claim to any contents in this shithole.</p>\n\n<p>My life is online, so I guess I’m posting my last words online too…</p>\n\n<p>I practically lived on a network, anonymously communicating with anonymous people, just a collection of usernames and avatars, but you, any of you reading this might as well be the only family I have.  The only people worth saying goodbye to.</p>\n\n<p>So just in case I disappear one day, and nobody out there notices.</p>\n\n<p>I’ll say it here.</p>\n\n<p>Goodbye.</p>\n</div>\n","author":"Sundaysmiles1"}