{"rank":"425","title":"A Letter to my Father.","id":"8iwlla","url":"/r/nosleep/comments/8iwlla/a_letter_to_my_father/","time":"1526137672000","body":"<div class=\"md\"><p>Dear Dad,</p>\n\n<p>This has to stop. I’ve let it go on for as long as I can, but I’m tired.</p>\n\n<p>My earliest memory is when I was four years old. I made you carry me up the stairs to my room because I was too afraid of the dark. I had my arms hooked around your neck and your shirt bunched in my fists, and I watched as the light from the hallway faded as you ferried me up to my room. You dropped me into bed and turned on the nightlight as I clambered beneath the sheets, and the frame creaked as you sat next to me and ruffled my hair. “Don’t worry, Munchkin. There’s nothing hiding in the dark. There’s no such thing as ghosts.”</p>\n\n<p>I believed you up until three days after your death.</p>\n\n<p>When you first came, it took me back to that fear I had when I was four years old. You quietly climbed the stairs, but I heard the last one creak, as it always has. I strained my ears, but was frozen stiff when you stomped down the hallway to my room. I saw your shadow cross over the gap beneath the door, and then vanish.</p>\n\n<p>The following night, I watched you struggle with the handle until the door edged open and your fingers slowly curled around the wood and dug into the grain. Your decaying skull leaned out from behind the door and you laid dead eyes upon me for the first time.</p>\n\n<p>You opened the door and stood, silhouetted from the hallway light, and I squinted my eyes until they adjusted. Your body was starting to rot, and yellow, leathery skin was sunk in to the bones. Then, the slice along your neck began to ooze. Blood streamed out, covering your shoulders and seeping into mud-caked clothes until they soaked through and began to drip onto the floor. You stood there for a firm five minutes, gushing blood and anchored by the door. Finally, you skulked back into the hallway light and stomped down the hall. I have never been more terrified.</p>\n\n<p>You would hit Mum in places where no one would see. She would tell me that you loved us all so very much. I’d find you the next day, curled in the foetal position on the sofa, your head on her lap. I listened in one day. I heard as you begged your wife for forgiveness, and told her you were sorry, and that it would never happen again.</p>\n\n<p>Not long ago I woke up with your slimy, decaying body next to me in bed, I wanted to kill you all over again. Your laboured breath was hot and sticky in my ear, and your body left yellow mucus in my bed. I leapt out just as maggots wormed out of your eyes, nose, mouth and ears. They covered the bed until your hollow body collapsed around the skeleton that, with no eyes, still watched me back away out of the room, eyes wet with fright.</p>\n\n<p>As I got older, I got the beatings. But unlike Mum, I never got any apology. I was a man, and so I had to take it like a man. I’d anger you on purpose just to save her any more turns as a punching bag. When she got ill, you got worse. When she died, you became something else entirely.</p>\n\n<p>I wanted to kill you. I couldn’t wait until I was eighteen and I could leave you to wallow in your miserable life. But Hatty couldn’t come with me, and I could never leave her alone with you. Social services, the police, any sort of plea for help... the thought of what you would do if you found us was the most horrifying thought of all. So I stayed, and I took the whipping of belts and the broken bottles twisting into my back.</p>\n\n<p>Yesterday, you were violent. I woke up with you latched onto the ceiling. Black pus spilled out from your lungs and onto the bed. Then you fell on your back, and your arms and neck contorted so that everything was backwards. You wrapped your hands around my neck and squeezed tighter and tighter as the last of my air escaped my lungs. Then you let go, and as I was gasping for breath, tears streaming down my face, you leant in and whispered, “There’s no such thing as ghosts.”</p>\n\n<p>The day I found the bruise on Hatty’s left chest was the day you went too far. I found you outside, reclining on a deckchair as I got home from work. Your eyes were wet and red and you’d already drunk a case of beer. You didn’t even turn your head when you heard me slide open the patio door. “I’m sorry.” you wept, knowing it was too late. “I’m...-”</p>\n\n<p>My knife slid along your throat and the satisfaction I got from stopping you mid-sentence will never be matched.</p>\n\n<p>Me and Hatty are selling the house and moving away. As a favour to your children, I ask you to leave. To haunt someone else, someone as evil and horrid as you.</p>\n\n<p>Go and be a monster to a monster, or I’m <a href=\"https://www.facebook.com/inkdrop/\">sending you to hell.</a></p>\n</div>\n","author":"chrisbird93"}