{"rank":"608","title":"The Exorcism of an Angel","id":"8ix8z8","url":"/r/nosleep/comments/8ix8z8/the_exorcism_of_an_angel/","time":"1526143644000","body":"<div class=\"md\"><p>There is no greater curse than the possession of a Demon, nor greater honor than the visitation of an Angel. God has blessed our home with his presence, and I am nothing but grateful for the miracle which has occurred. And yet I tremble as I write this, because through this trial we have learned one lesson most truly of all: </p>\n\n<p><em>“His delight is not in the strength of the horse, nor his pleasure in the legs of a man, but the Lord takes pleasure in those who fear him.”</em> Psalm 147:10-11</p>\n\n<p>To fear God does him as much honor as to love him, for both are equal expressions of belief.  </p>\n\n<p>God does not give us the choice of which laws to follow. The comforts of modern life have seduced men into a pitiful state of moral lassitude, but our family does not compromise on our beliefs. Righteousness can be feigned for the sake of impressing one’s neighbors, but the truth of our souls cannot be hidden from God. </p>\n\n<p><em>“I do not permit a woman to teach or to have authority over a man; she must be silent.”</em> -1 Timothy 2:12</p>\n\n<p>But the insolent girl would not be silent before my husband. Not until I struck her. First she howled, then she whimpered, and then she was still. How beautiful the fear of God had made my child. </p>\n\n<p>Elizabeth was only six years old when she turned from the path. She spoke when she was not addressed. Lies flowed from her mouth as naturally as truth, she refused to pray, and she showed no shame in drawing blasphemous monsters and images which did nothing to glorify God. My husband Luke and I prayed for her every night, but the Lord knows that a child understands the weight of a cane more keenly than any word. </p>\n\n<p><em>“Foolishness is bound in the heart of a child; but the rod of correction shall drive it far from him.”</em> -Prov 22:15</p>\n\n<p>Her high-collared dresses hid the marks, and for a time Elizabeth showed enough respect for her parents not to speak against us. I should have listened to Luke and not sent her to that public school where her mind could be further polluted by the unfaithful. Her rearing was impeccable, so there’s no other way I can explain the filth which began spewing from her mouth. </p>\n\n<p>“I don’t want to go!” she said last Sunday morning while I dressed her for church. “I hate him! I hate God!” </p>\n\n<p>“God loves you,” I tried to explain, but she wouldn’t listen. </p>\n\n<p>“No he doesn’t. God hates me too.” </p>\n\n<p>“Why would you say such a thing?” I asked. </p>\n\n<p>“Because he made you my mom.” </p>\n\n<p>We didn’t go to church that day. After Luke heard what she said, she was in no condition to go anywhere. The Lord knows I wept as much as Elizabeth did. It couldn’t go on like this, I told myself. Luke thought that she would learn in time, but I wasn’t strong enough to endure her lessons. I cleaned my daughter’s wounds and made her comfortable, but her blood was still on my hands when I prayed that night. </p>\n\n<p>“Where did we go wrong?” I begged from the quiet. “Oh God, if you truly love us as we love you, send us an Angel to grant us the happiness we deserve.” </p>\n\n<p>I could see the light through my closed eyes, and I knew the Spirit was with me then. I felt his warmth on my hands and face. I dared not look, or speak, or even breath, afraid to disrupt the miracle in progress. For one divine moment I knew my prayers were answered and I was in heaven. The next moment, I heard Luke shout “Fire!”</p>\n\n<p>Smoke was billowing under our bedroom door. The hallway was an inferno—flames gutting between the floorboards, climbing the walls, igniting the pictures and the wooden crucifixes pounded into the walls. I staggered towards Elizabeth’s room—coughing and falling to my knees to crawl under the smoke. Luke grabbed me under my arms and heaved me toward the front door, but I kicked and fought him the whole way. </p>\n\n<p>“Elizabeth! She’s still in there!” </p>\n\n<p>“The Lord preserve her,” Luke said, uncompromising as always. I was dizzy from the smoke, and I wasn’t strong enough to fight Luke off. Before I knew what was happening, I was panting and heaving on our front lawn while the house burned. </p>\n\n<p>“Elizabeth!” I’d screamed through my ragged throat. “Elizabeth where are you?” </p>\n\n<p>Luke wouldn’t let me go back in. I was screaming and crying hysterically, but he forced me to the ground and held me there until the fire department came. If Elizabeth was crying for us, I couldn’t hear her over the roaring flames. Maybe she stayed quiet though, more afraid of us than the fire. Luke prayed while the firemen battled the blaze. I didn’t, knowing my prayers had already been answered. This is the happiness we deserved. </p>\n\n<p>Three strong men entered the house when the exterior had been doused. Veterans in full gear with masks and oxygen tanks. Elizabeth had nothing, and sore as she was from her punishments, I don’t know if she could have escaped that house even without the fire. Three men exited the house, their arms empty. </p>\n\n<p>Elizabeth was barefoot and walking unassisted between them. Her face was clear, unmarked from soot, her breathing slow and even. Her skin was pure white, unmarked by injury or burn. </p>\n\n<p>“A miracle,” Luke had said.</p>\n\n<p>“A miracle,” the firemen were quick to agree.  </p>\n\n<p>“A curse,” I wasn’t brave enough to reply. </p>\n\n<p>We all stayed in a hotel that night. Luke was so exhausted from the ordeal that he slept soundly, but I couldn’t help but lie awake and listen to Elizabeth whispering to herself. She was traumatized, my reasoning said. She was trying to process what happened and she needed me to hold her and tell her it’s going to be okay. I almost got up a dozen times in the night to comfort her, but each time my muscles locked from some nameless instinct as old as fear itself which begged me not to approach the mumbling girl.   </p>\n\n<p>“Elizabeth is a good girl. A good girl,” I heard her whisper. “Elizabeth will not punish them.” </p>\n\n<p>I pretended to be asleep, trying to match my husband’s deep breathing. I couldn’t get enough air though, and my involuntary gasps must have betrayed me because Elizabeth would sometimes sit rigidly upright to stare at me in the darkness. I watched her through slitted eyes, not daring to move.   </p>\n\n<p>“Elizabeth prayed too, you know,” the girl was obviously speaking to me, but all I could do was lie there and keep breathing. “Do you know what she prayed for?” </p>\n\n<p>I clenched my eyes tight. I felt so stiff that I might as well be dead. I didn’t hear anything else, but I was too scared to look. A full minute before the silence became too loud, and when I opened my eyes again the girl was standing right beside my bed. </p>\n\n<p>I jerked upright, hopelessly tangling the covers in my surprise. Luke woke with a start and flailed around the nightstand until he turned on the lamp. “What is it? What’s going on?”  </p>\n\n<p>Elizabeth was back in her bed, rigidly upright, just staring at me and smiling. I forced a smile in return. </p>\n\n<p>“Nothing’s the matter. We’re all okay now. Get some sleep Elizabeth.” </p>\n\n<p>Luke grunted and turned the lights back off, rolling his back toward me.  </p>\n\n<p>“Goodnight Lady,” Elizabeth said. I don’t know how many hours it took me to fall asleep after that, but I never saw Elizabeth lie down the whole time. </p>\n\n<p>Over the next few days, the insurance inspectors concluded that it was an electrical fire, although there was so little information in their report that it seemed more like speculation to me.    </p>\n\n<p>Elizabeth hasn’t given us any trouble since. She’s mild and dutiful in her behavior and her prayers. She still loves to draw, but the serene passionless faces she repeats over and over are far more disturbing than the monsters she used to decorate the pages with. Luke couldn’t be happier of course—he’s got the perfect little angel he’s always wanted. He doesn’t seem to realize that we’ve always had an angel, or that somehow she didn’t make it out of that fire. </p>\n\n<p>She’s watching me as I write this, smiling and swinging her feet, but I don’t care. She may even read it if she likes—it doesn’t matter. God already knows there is more divinity in an imperfect child than all the angels in heaven. I worship him with my fear now, so if that truly pleases the Lord, let him hear me and send my daughter home. </p>\n\n<p>But she’s giggling now, so perhaps he has other plans in store for me.  </p>\n\n<p><a href=\"http://tobiaswade.com\">more</a></p>\n</div>\n","author":"TobiasWade"}