{"rank":"2674","title":"\"Daddy, there's a man behind you.\"","id":"8ixqlc","url":"/r/nosleep/comments/8ixqlc/daddy_theres_a_man_behind_you/","time":"1526148018000","body":"<div class=\"md\"><p>Right now, I’m sitting in a hotel in NYC. And let me be straight with you guys: I hate it here. There’s a siren every five minutes, a dog barking next door, and some guy on the sidewalk ranting about bedbugs.</p>\n\n<p>That’s why I decided to Skype with my family tonight. After mistyping the WiFi password a hundred times and making the bed again after checking for bedbugs (yeah, that guy got to me,) I finally gave them a call.</p>\n\n<p>Immediately, I felt better. I heard all the sounds of home: our terrier barking, Samantha squealing with delight, and Baby Theo babbling up a storm. Their noise drowned out the cold, crazy sounds of the city, and I smiled.</p>\n\n<p>“Here, let me put Samantha on,” my wife, Ginny, said. “She misses you <em>so</em> much.”</p>\n\n<p>She walked out of frame, and Samantha’s head poked up over the table. “Daddy! Daddy!”</p>\n\n<p>“Hi Sweetheart!” I made a frowny face. “Poor Daddy has to stay alone in a hotel tonight for work.”</p>\n\n<p>“Silly Daddy, you’re not alone,” Samantha said, giving me one of her big, toothy grins. “There’s a man standing right behind you!”</p>\n\n<p>I froze. “What did you say?”</p>\n\n<p>“There’s a man behind you!”</p>\n\n<p>I whipped around. But the hotel room was empty – all I saw was the bright lamp, the empty armchair, the comforter in a tangled lump.</p>\n\n<p>“He’s hiding now,” she giggled.</p>\n\n<p>“Samantha, what are you talking about?”</p>\n\n<p>But she just laughed and smiled. “You’re being silly, Daddy!”</p>\n\n<p>“Put Mom back on.”</p>\n\n<p>Ginny ran back into view, a large glob of spit-up on her T-shirt. “Danny, I’m trying to feed Theo,” she said. “What was so important that –”</p>\n\n<p>“Samantha said she saw someone standing behind me.”</p>\n\n<p>“Oh, dear.” Samantha shook her head, as she bounced Theo on her lap. “Sorry, I forgot to tell you. She’s been going on and on about some imaginary friend recently. I already asked Dr. Marks about it; she says it’s totally normal, just a phase…”</p>\n\n<p>My heart began to slow. “She had me scared there for a second!” I said, starting to laugh.</p>\n\n<p>“Oh, I know. She scares me all the time with it. Talks to herself in the playroom, tells Theo about him… it’s crazy.” She snorted. “Did you ever think kids would be this… weird?”</p>\n\n<p>“No. No, I didn’t.”</p>\n\n<p>“Alright, well, I should get back to it. Talk to you tomorrow?”</p>\n\n<p>“Of course.”</p>\n\n<p>I closed the laptop with a <em>click</em>. Out the window, cars whizzed by, streaks of red and white against the blue of dusk. I looked around the empty room, at the beige carpet and the pulled curtains; it finally looked inviting, now that my heart was full.</p>\n\n<p>I got up and walked towards the bed. The comforter was crumpled in a heap, pushed to the corner of the bed, and the sheets were wrinkled and pushed. <em>What a mess,</em> I thought, reaching for the comforter.</p>\n\n<p>I froze.</p>\n\n<p><em>Wait.</em></p>\n\n<p><em>After I checked for bedbugs…</em></p>\n\n<p><em>I re-made the bed.</em></p>\n\n<p>I took a step back.</p>\n\n<p>And that’s when I noticed – sticking out from the edge of the comforter –</p>\n\n<p>The shiny, black tip of a <a href=\"http://www.facebook.com/scaryblair\">shoe.</a></p>\n</div>\n","author":"BlairDaniels"}