{"rank":"63","title":"Going down","id":"8ixr63","url":"/r/nosleep/comments/8ixr63/going_down/","time":"1526148153000","body":"<div class=\"md\"><p>Someone please tell me what to do—I’m in an elevator that won’t stop going down.</p>\n\n<p>I don’t know how long I’ve been here.  It feels like days, but I know that can’t be.  My lips are chapped, my throat is on fire, and my stomach feels like the shot elastic band of an old pair of underwear—I’ve never known hunger like this; it’s so. . .  Achey.  But I haven’t passed out or anything—is that what happens?  How long does it take before you die of dehydration? </p>\n\n<p>Wait, but maybe I have passed out.  That would make a lot of sense, because that means this some sort of comatose fever dream, or, like, a final hallucination before my death.  I’ve heard DMT fucks up your sense of time.</p>\n\n<p>Wow, I’m comforting myself with the thought of death. . .</p>\n\n<p>Honestly, if I was dying, I wish it would just happen.  I thought you were supposed to hallucinate about loved ones and the afterlife you believe in, or. . .  Something that makes sense—I don’t know.  For some reason I just get an elevator.</p>\n\n<p>Okay, so maybe not death.  That doesn’t help me think this through; it doesn’t help me cope with the pain (Christ almighty I am so thirsty).  What’s more realistic?  Let’s see. . .</p>\n\n<p>OH!  Carbon monoxide!  The poltergeist gas—the silent killer—the odorless evil.  No, really, how would I know if I’m breathing in lethal doses of carbon monoxide right this very moment?  It’s not like they put carbon monoxide detectors in elevators, right?</p>\n\n<p>Then again, how would it get in?  Has it filled the shaft?  If I’m moving, where’s the source?</p>\n\n<p>But I am moving.  I’m going down.</p>\n\n<p>Well, it <em>feels</em> like I’m going down.  Honestly, I could be going sideways now, or round and round in loops.   Wonka’s elevator, heh heh, that’s what this is.  I don’t really “know” if I’m going down.</p>\n\n<p>. . .</p>\n\n<p>That’s a lie.</p>\n\n<p>See, my girlfriend was so scared.  She found this (I don’t know what to call it—mass?) she found a mass on her lower back, right on her spine, and I was trying to tell her it’s fine, probably just a cyst, but she was freaking out.  So we went to the doctor.</p>\n\n<p>No answers.  Doctor sent us to the ultrasound clinic.  No answers.  Ultrasound clinic sent us to X-ray.  No answers.  Finally we get sent to this specialist who looked at all the images and shit and says, “We’re going to need to do a biopsy”.</p>\n\n<p>My girlfriend was in tears immediately; she hates needles.  Didn’t help that the dude’s bedside manner was shit—I was inches from punching him in his disinterested, Warren Buffet-looking face.</p>\n\n<p>But then I remembered when we entered the building, there was one of those depressing medical office gift shops, right?\nAurora goes over and she’s browsing, passively, but lights up with a huge childlike grin when she sees this silly stuffed animal.  It’s a plush seal, holding a big red heart with white embroidering: <em>Give yourself time to seal!</em></p>\n\n<p>“This is beyond adorable!”\nShe loves everything related to marine biology.  I used to hate the ocean before I met her.\n“Ha!” I say, “That’s. . .  Pretty stupid.”</p>\n\n<p>All I could think about was that dumb seal and how much I hated seeing her cry.  So, when she was going into the back to get another X-ray, I went downstairs and bought it for her.</p>\n\n<p>Yes, yes, it was overpriced and I could’ve gotten it on Amazon later, but it’s things like that that show you care—but not just some of the time—all the time.  Maybe that doesn’t make sense, maybe it was all a mistake.</p>\n\n<p>But I got back in the elevator, on autopilot, and I press the third floor button.  The door closes.</p>\n\n<p><em>D I N G</em></p>\n\n<p>The arrow’s pointing down—what the fuck?</p>\n\n<p>I chuckle as the light on the panel indicates that I’m at the parking sub-level.  This must be one old-ass elevator.</p>\n\n<p>But then it says I’m on the maintenance level.</p>\n\n<p>I feel my first twinge of panic—not very justified.  It’s that childhood panic that stems from the fear of being locked in a store after it closes, or stuck on a theme park ride because you can’t get your restraint unbuckled.  How would I explain to everyone why I’m down in maintenance?</p>\n\n<p>Still going down.</p>\n\n<p>Now the maintenance level light has blinked out.  Just the down arrow and that grinding, creaking rumble of an elevator going downwards.</p>\n\n<p>“Okay, what the fuck.”</p>\n\n<p>I think of that Mythbusters episode about how you can’t survive a falling elevator by jumping—and I feel like I’m going to hit the bumper at the bottom of the shaft any second now.</p>\n\n<p>But I’m not falling, I’m just going down.  Still.</p>\n\n<p>The low-fidelity, knockoff Phillip Glass music stopped hours (a day?) ago.  It’s just that awful grinding of metal and stone and the creaking of cable.  Even those disgusting fluorescent bulbs stopped buzzing.</p>\n\n<p>I’m not proud to admit it, but I tried to break one of them about. . .  Fifteen hours ago?  My phone’s clock doesn’t seem to work and I don’t wear a watch, so I can’t be certain.  I tried to break the bulbs because I was thinking about using the shards to slit my wrists.  I was going to slit my fucking wrists to get out of this elevator.</p>\n\n<p>Yet nothing would break.</p>\n\n<p>The maintenance panel won’t open, the emergency call button doesn’t do anything—not even make that crass buzzing sound it used to—none of the buttons do anything.</p>\n\n<p>Please, I know, I know it sounds crazy, I know that’s what it sounds like, but. . .  It’s like the elevator keeps. . .  <em>Taking</em> things from me.</p>\n\n<p>The music is gone.  The lights behind the buttons are gone.  The buzzing is gone.  My bag is gone—and I know for a fucking fact I had it with me.</p>\n\n<p>Worst of all, Aurora’s plush seal is gone.  I was using it as a pillow, and I woke up and. . .  It just wasn’t there.  It’s going to take my phone next, I guarantee it.  I’m praying to every god that ever was to let this message send before I go; I want my family to know I love them, and I want Aurora to know that I didn’t abandon her and that she means everything to me—she’ll blame herself but, it’s not her fault.  There’s nothing anyone could do.</p>\n\n<p>So I guess it’s taken my hope, too.</p>\n\n<p>What am I saying?  It’s an elevator!  Just a normal elevator.  Average.  Uninteresting.  No carpeting like hotel elevators, no glass walls like mall elevators, no mirrored surfaces or touch screens like downtown parking structure elevators, no doors on either side like hospital elevators…. Just brown tile and dull brass.</p>\n\n<p>But I swear on my life that it feels smaller.</p>\n\n<p>Not like it’s just shrinking or anything.  It feels like, no matter how much I press myself against the far wall, that door is so close.  Too close.</p>\n\n<p>Yes, I tried opening it at first—of course it didn’t open—you try and pry open the door of a moving elevator!  That’s not the point, though, because after forty-five minutes of straining with pure adrenaline—raw muscles soaking with the sweat of stale, unfiltered humidity—I realized I didn’t want to open the door.</p>\n\n<p>I don’t want the door to open—please, God, don’t let that door open.</p>\n\n<p>I once read on here that: if the Earth was the size of an apple, the deepest manmade hole wouldn’t even even penetrate the skin.  So, how fast am I going?  How deep am I—why am I still alive?</p>\n\n<p>Maybe I’m not even going into the Earth itself.  Maybe I’m just going. . .  <em>Down</em>.  Deeper and deeper INTO the down—like I’m being swallowed and digested.</p>\n\n<p>Or. . .  Prepared.</p>\n\n<p>Like I’m being prepared for whatever is going to be on the other side of the door.</p>\n\n<p>I have these dreams of <em>things</em> in a dark hallway beyond those mechanical doors.  It’s so. . .  So dark and so <em>dense</em>—I don’t have the words for it, I don’t know.  I can never remember it well-enough.  When I wake up, it’s just that terror—that skin-freezing terror.</p>\n\n<p>And that sound echoing in my mind. . .</p>\n\n<p><em>D I N G</em></p>\n</div>\n","author":"InkRunner_Official"}