{"rank":"35","title":"#4521 Herringbone Street","id":"8iy3st","url":"/r/nosleep/comments/8iy3st/4521_herringbone_street/","time":"1526151334000","body":"<div class=\"md\"><p><em>Thud</em> \n<em>Thud</em></p>\n\n<p>The closet door has been going like that for a good minute or so now. It might be the rats inside the wall but this situation has got me nervous since I noticed the weird couple who followed ever since I left the apartment.</p>\n\n<p>I&#39;ve been grieving the death of my brother for a while now. He went missing on a cruise last month, and they never found any traces of the ship anywhere, and as much as I hope that he&#39;s alive out there somewhere, I just braced myself for the harsh truth and accepted it.</p>\n\n<p>Not to mention the news of a serial killer&#39;s murder spree spreading terror in the whole city, the latest news being a 20 year old woman going missing after a night out in the bar.</p>\n\n<p>I&#39;ve been hiding in this rusty old house for an hour now, unsure if it&#39;s safe already to go outside. </p>\n\n<p><em>Thud</em>\n<em>Thud</em>\n<em>Thud</em></p>\n\n<p>I would appreciate it if these thuds would just stop before that couple gets in here. </p>\n\n<p>I hazard a look out the broken window, checking each side of the street. Nothing. I guess it would be safe to go now.</p>\n\n<p>I was about to pull my head back when I notice a movement from the end of the street. A vehicle. Although it&#39;s hard to make out its appearance under the dark night sky, something in my gut knew that it was that dark gray sedan that the couple was driving. </p>\n\n<p><em>Okay, calm down.</em> I tell myself. I can get out of this situation without actually getting hurt. </p>\n\n<p>Then suddenly, I hear footsteps outside the room. </p>\n\n<p><em>Footsteps?</em>, I thought. In this abandoned house? Impossible. I walk quietly to the door and put my ear against it.</p>\n\n<p>Those are indeed footsteps, and whispers. Is there some kind of a spirit in this house?</p>\n\n<p><em>Thud</em> <em>Thud</em></p>\n\n<p>Everything&#39;s falling apart. I start having second thoughts about this plan working.</p>\n\n<p>Suddenly, the sound of a vehicle stopping and car doors opening from outside caught my attention.</p>\n\n<p>There&#39;s no way that they know I&#39;m here. I look out the window and see the couple from earlier get out of the car and shine their flashlights into the house. I quickly duck to avoid getting spotted.</p>\n\n<p>Once the lights have passed the room&#39;s windows, I take a peek again. </p>\n\n<p>&quot;--think they&#39;re in there. &quot; the woman says.</p>\n\n<p>&quot;You sure?&quot; her male companion replies. There&#39;s something authoritative in their tones.</p>\n\n<p>&quot;I did see some movement in the ground floor of the house.&quot; the woman says.</p>\n\n<p>&quot;A&#39;ight. Let&#39;s go in and check.&quot; he says to his companion, taking something out from his side.</p>\n\n<p>I take a deep breath upon realizing what he was holding. <em>A gun.</em></p>\n\n<p>His companion does the same. They both walk towards the house until they were out of my sight. Seconds later, I hear the front door creaking open.</p>\n\n<p>&quot;Freeze!&quot; the man shouts. </p>\n\n<p><em>Huh?</em> Is there someone else in here?</p>\n\n<p>A deep husky voice then says, &quot;Damned demons plague my head fuck off pigs&quot;</p>\n\n<p>&quot;Get out of here you damn hobo junkie fuck.&quot; the woman says.</p>\n\n<p>I have to make this quick. I peek out the window and see the junkie running away. </p>\n\n<p>Good. They might leave now. </p>\n\n<p>&quot;Fucking hell, Ortega. Just a damn junkie.&quot; the man says.</p>\n\n<p>&quot;Well, Henry, I didn&#39;t know that it was just gonna be a false alarm.&quot; Ortega replies.</p>\n\n<p>&quot;Let&#39;s just get out of here and canvass the rest of the neighborhood, there are some still occupied houses here anyway.&quot; Henry says. </p>\n\n<p><em>THUD</em> \n<em>THUD</em>\n<em>THUD</em></p>\n\n<p>&quot;What the fuck?&quot; Henry says.</p>\n\n<p>&quot;Upstairs.&quot; Ortega replies.</p>\n\n<p>Luckily, the walls have deteriorated to the point where every noise can be heard from all corners of the house. Unfortunately, they also heard the thuds from the closet.</p>\n\n<p>I hide behind the door so as soon as they open it, I could get out of this situation quick and without any hassles.</p>\n\n<p>Each step they take can be heard by the floor squeaking, no matter how carefully or slowly they tread the old house&#39;s floors. </p>\n\n<p>They&#39;re right outside the room now. I hear the doorknob turning and take a deep breath.</p>\n\n<p><em>Screech</em></p>\n\n<p>The beam from their flashlights suddenly illuminate the room as the thuds grow more consistent when finally: &quot;HELP!&quot; a woman&#39;s voice echoes throughout the house, coming from the closet itself.</p>\n\n<p>This gave me the perfect opportunity to finally take my blade out and stab the male detective in the side and in the neck. His partner was taken aback when I pushed the man&#39;s still gurgling body into her, crashing onto the floor and sending her gun scuttling away to the other side of the room. </p>\n\n<p>She struggled to push the big man on top of her but this gave me the time I needed to knock her out with the hilt of the knife.</p>\n\n<p>Fortunately, the closet remained unopened during the commotion or the lady inside would&#39;ve been screaming her lungs out.</p>\n\n<p>As I make my way to the closet, the man grabs my ankle on a futile attempt to stop me. I smile down at him and kick him in the face, knocking him out.</p>\n\n<p>I open the closet door and meet the woman&#39;s wide eyed gaze at me. I cover her mouth before she was able to scream and whisper, &quot;You just made this harder on yourself.&quot;</p>\n\n<p>The whole closet smelled like piss and shit. It&#39;s not uncommon for me though, it&#39;s a common risk in this type of situation. What I like is the smell of fear from every victim, making sure that they know that they&#39;ll soon receive their punishments for their crimes.</p>\n\n<p>I knock her out and drag her out the closet, down the stairs, out the house, and stuff her in the detective&#39;s car trunk. There&#39;s gonna be a lot of work to be done tomorrow.</p>\n\n<p>I proceed to get back in the house and drag the female detective outside and stuff her in the trunk after tying her up.</p>\n\n<p>I smile as I think of the new headlines tomorrow.</p>\n\n<p><em>Detective killed by serial killer, partner missing.</em>\n<em>Missing woman found dead</em>\n<em>Serial Killer strikes again</em></p>\n</div>\n","author":"AugustPetrarch"}