{"rank":"25","title":"They Came From the Sky and Stayed in the Sea (Part 2)","id":"8iz8dg","url":"/r/nosleep/comments/8iz8dg/they_came_from_the_sky_and_stayed_in_the_sea_part/","time":"1526162033000","body":"<div class=\"md\"><p><a href=\"https://redd.it/8ha5ac\">Part 1</a></p>\n\n<p>Last week I shared the contents of a journal that I had discovered amongst my grandparents’ books. It had been hidden away and once I asked my mother about the author of the journal, she explained to me that I have an aunt previously never mentioned to me. Tucked away in a mental facility, this aunt had lived most of my life in a family-kept secret. They thought that she was crazy. I’m beginning to wonder if she, in fact, is saner than most people out there. Or, perhaps, I’m beginning to go crazy as well. </p>\n\n<p>After sharing the contents of Aunt Sophia’s dreams with the internet, I shared them with my husband as well, along with my mom’s version of the story. He agreed that it was very strange and off-putting, mostly that she was shut away and kept a secret. He asked if we or any of my family had ever lived in Georgia and I told him that none had, at least to my knowledge. I’m not sure if I mentioned it before but my family is from Texas. It’s still in the southern United States but I can’t say that any of my family has ever had ties to Georgia and I, myself, can only remember driving through the state on a trip to North Carolina once. </p>\n\n<p>We decided to look up the cove that Sophia had mentioned and thanks to the vast reach of the internet, unlike in Sophia’s search, it was easy to locate. It still seems to be a rather small area with the closest town being almost ten miles away from it. I even found a small article done by a tourism website local to the area that mentioned History Look Cove and its, well, history. From what the author explained, the crater was indeed previously mentioned Crater Look Cove but no one could recall why. As far as anyone could assume, it was due to the strange underwater crater-like formation that could be seen best from the cliffs above. In the late 1800’s, it was decided to officially rename the cove to History Look in an effort to make it seem more appealing. </p>\n\n<p>When I viewed the photo along with the short information on the cove, I felt an involuntary shiver run down the length of my back. It was beautiful, no doubt, but I felt as if the beauty was hiding something more. I couldn’t quite determine why I felt the place was strange and ominous, but I also couldn’t deny the slight dread it instilled in my heart. </p>\n\n<p>That night is when the dreams began. At first, it was a peaceful dream. I was looking out on the ocean and enjoying the warm salty breeze that blew gently through the night air around me. The crescent moon hanging low in the sky reflected brilliantly on the water’s surface and things felt calm and relaxing. It wasn’t until I looked above me at the cliffs that stood tall to my right and left that I began to feel uneasy. High above where I sat on the beach, animals chittered and chirped before falling completely silent. </p>\n\n<p>The ground rumbled beneath me and I turned my focus from the trees that loomed over my little sanctuary to the ocean water before me. I jumped to my feet so rapidly that I almost lost my balance on the soft sand and tumbled back down. Thankfully, I was able to right myself before my face collided with the grains beneath me. Towards the edge of the cove, where the open ocean spread itself in an endless vastness, bubbles rose to the surface. Vaguely aware of my thought process on the matter, I determined that the pockets of air rising to break open on top of the water had to be large, as I could see them from where I stood.</p>\n\n<p>I stood, transfixed, and watched the bubbles increase to a constant stream and then a churning. It wasn’t unlike how a pot of water boils on the stove. I was terrified of what might break the surface once the bubbles ceased but I also found that I couldn’t look away or move. Any thought I had to run away from that place resulted in a stronger feeling of my legs being rooted where they stood, as if I was becoming a tree, doomed to stay in one single place while whatever monstrosity that lied beneath the surf approached. </p>\n\n<p>In my mind, I conjured up various horrifying creatures in an attempt to prepare myself for whatever would soon be upon me. My ideas varied between giant sharks, the mythical Kraken, ghostly deep sea divers with glowing, rotting corpses of sailors lost at sea, giant fish-like creatures that fed on flesh with their protruding sword-like teeth, something akin to the Loch Ness Monster or the Flathead Lake Monster, monstrous frog-people with bulging eyes and sagging skin, and of course, swirling masses of sparkling dust that would reach inside me and freeze me to my very core. </p>\n\n<p>What rose from the depths, however, was none of those. I’m not sure what terrified me more: the sight itself or the lack of knowledge about what the thing might be hiding. It wasn’t a creature, but a sort of natural structure. Stretching the entire length of the cove’s opening was a massive coral formation that I knew immediately was unnatural. Unlike the vibrant colors I had seen in photos, this coral was dark in color and brought with it an awful stench of rotting seaweed and decaying fish. I couldn’t tell how far into the open sea it extended but from what I could see on the beach, this thing was absolutely massive, with holes that looked as if the edges were sharp and jagged maws full of teeth that were ready to crunch any creature that passed too close. There were flattened areas like platforms that appeared disturbingly smooth in comparison to the rough vertical walls. Whatever this mass was, it was wrong and I knew it.</p>\n\n<p>From one of the platforms barely uncovered by the water, I noticed movement. From the distance, I couldn’t tell yet what it was that had slipped into the disturbed waves but I could see that it was headed towards the shore, towards where I stood, unable to move or look away. I watched as part of the creature bobbed above the water for a moment then sank back beneath the surface that was working to calm itself once more. It moved steadily in my direction, breaching every so often to look at me and possibly replenish its air supply. I still couldn’t figure out just what it was and I lost the ability to tell if the loud noise resonating in my head was that of my own heartbeat or the waves as they crash against the faces of the cliffs around me or even something from the watery demon that was headed for me.</p>\n\n<p>When it was almost close enough to walk on the submerged sand instead of swim, I awoke. My eyes opened and took a moment to focus on the dark room around me. I found comfort in knowing I was still in my own bed with my husband sleeping next to me. I thought about waking him up then decided against it and just tell him about the strange dream in the morning. It took me a bit longer than I would have liked, but I eventually fell back to sleep. There were no more dreams that night.</p>\n\n<p>My husband, Charles or Chuck for short, agreed with my theory that the dream was merely a side effect of the journal that I read and the strange situation that was putting some unfamiliar stress on my mind. We both brushed it off that day and continued on with our lives as if nothing was different. That was until the dreams continued for a few more nights. Now, typically, I have issues sleeping and have been known to have odd nightmares. I say &#39;odd&#39; because the ones that terrify me the most and cause me to awaken in the midst of a panic attack are the ones that simulate something going wrong in everyday life. Where most people would describe nightmares as something dealing with monsters or villains, my ‘nightmares’ generally entail any situation in which my world would be completely shattered. The dreams that mirror horror movies and stories actually intrigue and invigorate me. That being said, the recurring dreams of the cove quickly became nothing more than a nightly nuisance that I grew accustomed to after the first three nights. </p>\n\n<p>I would go to bed, dream of the creature approaching me while I stood unable to move, wake up before I could see what it was, sit up in bed, take a moment to ground myself, and then go back to sleep. I believe the repetition of this for the past week is why when the dream changed last night, I found myself shooting straight up in bed, trembling and frantic to make sure I was no longer in that place.</p>\n\n<p>As my aunt’s journal described, the dream began the same and was expounded on, continuing past the point it had previously reached. </p>\n\n<p>I stood with my bare toes dug into the sand as the creature in the water kept its steady pace towards me. When it could stand, I saw it slowly rise out of the water as it neared where I was frozen. It was repulsive and unnatural, so much so that I thought my stomach would empty its contents all over the sand and my own feet. </p>\n\n<p>What strode towards me, parting the water with four legs, was something that looked like several animals or organisms stitched or mashed together without care. From the head protruded a thick set of antlers, one set looking full and almost completely normal aside from a few of the tips dulled and chipped. The other side looked like it once resembled its twin but was now mangled and twisted, covered in a thick layer of sea moss. The base extended from the skull and glided backward before sharply jutting to the side and bending down then twisting so that the sharpened points jutted out in different directions, one even coming dangerously close to the animal’s thick neck.</p>\n\n<p>The head itself looked as if it belonged to a decomposing abomination. I couldn’t tell if it contained the skull of a deer, horse, moose, or something altogether unknown to mankind. Unlike any of the aforementioned beasts, this monstrosity had tusks that extended from its mouth straight outwards for five or six inches before sloping upwards. One of the tusks again curved down, creating a smooth looking ivory wave of a tooth. The neck, although broad, was shorter than that of any hoofed animal that I had ever seen, connecting to the body after only a couple of feet. </p>\n\n<p>As the thing was revealed more and more from the water, I saw that the body resembled something more canine in shape with muscular legs that ended in huge paws adorned with claw-like nails. The mottled fur appeared broken in some places all along its body, oozing a strange substance that reminded me of the oil I saw in the water when visiting Pearl Harbor long ago. I began to smell a horrible smell of rotting fish and sewage as it came even closer. </p>\n\n<p>As frightening as this creature was, I found myself still unable to run or move. If not for the stench assaulting my nose and throat, I wouldn’t have been sure I was even still breathing. I was intrigued, though. I was utterly captivated by this horrific beast from the water and could only watch as it completely left the water and walked up to me, stopping only a foot away. From the proximity, I could then see that the neck had something resembling gills along the front, stopping below the breastplate of the thing. The skin around its spine was different, as well. It wasn’t actually skin but seemed to have been replaced with an eight-inch wide strip of overlapping shells that ran from the skull all the way to the tip of the middle tail, of which it had three. Each tail resembled a tentacle that was missing some of the suckers.</p>\n\n<p>I felt my eyes water, whether from the sight or the odor I cannot be certain. </p>\n\n<p>We stood there, staring at each other for what felt like an hour. I studied the eyes of the creature while it studied the whole of me. They were comprised of a shining silver-colored pupil set inside a dark ring, similar to that of the deep sea viperfish. Unlike many aquatic beings, though, they did not bulge from the skull despite the sunken appearance of the skin around them. The metallic sphere moved over my body slowly before finally coming to hold my gaze once more. Feeling bold and finally able to move, I began to stretch out an arm to touch the creature. As my hand neared its snout, it opened its mouth wide and let out a monstrous groan that sounded as if it belonged to an ancient and massive dinosaur. </p>\n\n<p>I clasped my hands over my ears and dropped to my knees in the sand, unable to handle the loud and grating sound. My eyes shut tight and behind them, I saw flashes of another time. There was a forest, a crash that put even the loudest thunderclap to shame, charred trees and ground, boiling water, and finally swirling masses of dark sparkling mist and dust. A sudden icy sensation filled my body and began to burn until the creature stopped its infernal call. </p>\n\n<p>After a moment of what seemed to be silence aside from the ringing in my ears, I opened my eyes and released my grip on the sides of my head. I looked up and saw that the creature was no longer standing in front of me. In its place was a writhing and wriggling mass of living seaweed that moved like a fistful of worms. There was a flash on the distant, darkened horizon, and I looked to the demonic coral that had risen from the sea floor. My eyes seemed to sharpen more with each second I stared at it, trying to understand what was happening. Then I was able to see it. There were dozens of creatures weaving in and out of the holes and jagged edges of the once-submerged reef. They were all different, disgusting versions of animals that didn’t make sense and I knew were not meant to be that way. </p>\n\n<p>Shadowy forms began to join the beasts and a cacophony of screeches, yelps, howls, and chirps began to rise. Those things, the animals and the figures that I was certain would resemble clouds of space dust if I had been close enough to see them, were calling out to me. They were yelling and imploring me to do something. My eyes began to water once more and I looked up to the trees on top of the cliffs to my left, unsure of what made me do so. There, I saw the form of a decaying horse looking down on me. Whether a ghost or cursed spirit, I didn’t know, but it didn’t matter. I felt the tears begin to fall as I looked away.</p>\n\n<p>And then I awoke. I sat up in bed with a start, my skin drenched in sweat that was quickly cooling and making me shiver. I was crying. The sudden movement woke Chuck up and he wrapped his arms around me, asking if I was alright. All I could do was shake my head and cry into his chest. We laid back down after a few minutes and although he was able to fall back to sleep, I was not. I felt so much despair and terror for whatever had happened to those creatures and whatever was going to happen because of those things that came from the sky. I’m afraid to go to sleep tonight and even more, I’m afraid of what tomorrow will bring. </p>\n\n<p>I received a call from my mother a few hours ago. Everything is set up for me to go meet my Aunt Sophia on Monday. I want to know what she knows and if she has still been plagued with the nightly visions. But I’m also afraid of what she might tell me and I’m afraid that she might not be able to tell me anything. </p>\n</div>\n","author":"boewhiskey"}