{"rank":"21","title":"The Little Girl In The Underpass","id":"8iz9gb","url":"/r/nosleep/comments/8iz9gb/the_little_girl_in_the_underpass/","time":"1526162329000","body":"<div class=\"md\"><p>I never believed in ghosts. I don’t know even now if I do, what would you even classify as a ghost? A spirit? A demon? A strange, glowing blanket, floating in mid-air down a dusty corridor?</p>\n\n<p>Aliens took my fancy as a child. I think, statistically speaking, there has to be life somewhere else in the universe. It’s impossible for there not to be, right? But beasts in the dark…shadows that move…things that take people in the night and never return. They could be human, or they could be something else.</p>\n\n<p>Either way, I hope you will at least agree with me that what I saw that night, February 2016, at about 4am…I hope you’ll agree that it isn’t normal. Nor is it natural.</p>\n\n<p>I used to go out drinking with friends. I’d walk the 45 minute walk into town by myself, smoke about three cigarettes during the trip, breathing acrid smoke out of my lungs. I’d walk with a rhythm, I was always a fast walker, to music busting out of earbuds shoved in my ears. In the summer I’d take a thin jacket, sling it over my shoulder, with just a t-shirt and jeans to cover myself up. In the winter months, it would be a thick jumper, black denim on top of a dark hoodie. I was never much for extravagant fashion.</p>\n\n<p>I’d sink down as much alcohol as I could, move my feet in an awkward fashion on the dance floor, stave off the anxiety induced panic attack at the back of my head whilst waiting to order a drink from the bar…the normal night out stuff.</p>\n\n<p>But I’m getting carried away with the small details. I’m just trying to set the scene I suppose. The February night when it happened, I left the club about 3am, drunk off my arse of course and staggering home on the verge of tears and puking from an overflow of emotion. Not exactly a reliable source, I hear you cry! Well…are any of these things ever clear cut? That’s part of their allure.</p>\n\n<p>My town was part of a bigger cluster of towns, not big enough to be a city, but not small enough to class as ‘quiet country life’. Each town had its own buffet of activity to offer, with long winding roads in between the several hubs of activity. Two minutes by car to get between, but half an hour on foot. The street lamps needed replacing badly, always fucking flickering and giving me a migraine. The longest road back was barely lit at all.</p>\n\n<p>Down that long and winding road was a long, wide underpass. A steep slope leading down into a strange, manmade cavern. Whoever designed it was clearly a fan of heroin and knife crime, as the guttering on either side was littered with bright, luminescent orange needle caps, and there was a mugging there late at night at least once every couple of weeks. The walls were white tiled on top, with a blue, kind of linoleum material blue strip dividing the white tiles from the red brick that joined the wall with the asphalt pavement at the bottom. The white tiles were decorated with all sorts of graffiti from wannabe Banksy street artists. ‘Shanice &amp; Tom 4ever’, ‘G4EV’, Pac-Man having explicit sex with one of the ghosts…probably Blinky, for some unknown reason.</p>\n\n<p>Why not go around? It would add an hour onto the journey back, and as I’ve already said…I was very eager to get home and collapse into bed.</p>\n\n<p>The night was cold, but not a normal kind of cold. You know how people always say they feel a chill whenever ghosts are close by? Well, tonight was almost as if the world was alive with the supernatural. I didn’t feel it at the time, but looking back it was a piercing cold. The type that seems to grip your bones and rattle you from the inside, making your teeth chatter and your breath crystallise as soon as it leaves the chamber of your mouth.</p>\n\n<p>It was pitch black. There were no cars. I hadn’t passed another pedestrian for about twenty minutes beforehand, and the only people who were out would have been other patrons of the night.</p>\n\n<p>I walked along the path, taking care to walk in a straight line, with the hood of my jacket pulled up and the zip fastened all the way up to my chin to keep out the biting cold.</p>\n\n<p>As soon as I saw that long, vacant, dark underpass, I felt an urge to turn around and run. I can’t really explain why, but it was like a small, instinctive part of my psyche was kicking in, urging me to go the long way around and survive the night.</p>\n\n<p>But like I said, that would mean an extra hour out in the cold, and the rest of my body did not want that in any way, shape or form. So I kept going. Towards the dark, into the urban cavern down that paved slope.</p>\n\n<p>The caged lights that were dotted along the ceiling of the tunnel were barely functioning. They bathed the underpass in a piss-stain colour of dreary yellow, swathing light like unpleasant liquid onto the tiles and brickwork. I approached the threshold of the entrance, and thought nothing of it as I plunged myself under the ceiling, into that shadowy yellow mess of a place.</p>\n\n<p>The next part happened quickly. Like how you catch something out of the corner of your eye, or how in those strange videos posted online, you only see the strange, unexplained object for a few frames of screentime. You’ll have to excuse how fleeting and…odd it sounds. But just trust me, that’s the reason I am writing this down, to help myself believe as well.</p>\n\n<p>At the other end of the underpass, about two hundred feet in front of me, I saw a shape. A kind of, light green ember that was just floating in the darkness of the exit. I stopped walking as I noticed it, and I took one of my earbuds out, to listen out for anything from the other side of the tunnel, or behind me. All that I heard was a kind of dull, shrill sound, like a distant dog whistle or the whine of an out of date motor, spinning too fast for its own good. The green ember was flowing left and right at the end of the tunnel, not coming any closer, but not drifting any further away.</p>\n\n<p>I took a step backwards, crunching an unseen piece of broken glass under my boot. The sound echoed around the underpass, and seemed to catch the attention of the green light. The ember faded for a second, and stood perfectly still at the other end of the tunnel. Almost as if it was watching me.</p>\n\n<p>For a split second the light disappeared. But then it was back. Only this time it was closer.</p>\n\n<p>I took another step back. The light came closer again, only it no longer looked like a light; it was beginning to take shape, a form that became more like a silhouette the longer I stared.</p>\n\n<p>I closed my eyes for a moment, hoping that when I opened them again that the light would be gone; that I’d find myself alone in that vacant, empty space underneath the road above. But I wasn’t alone when I opened my eyes.</p>\n\n<p>There was a small, little girl stood in front of me. No older than five or six, dressed in a button up cardigan, light coloured blouse, baggy trousers and wellington boots on her feet. She was devoid of colour, save for the strange, mint green glow that shone from her body. She stared straight at me with white, vacant eyes, the pupils misted over by a blue haze. She almost looked blind, but the little girl was definitely looking up at me. In her hand she fiddled with a tattered hair scrunchie, most likely used to tie up her flowing, dark hair that hung from her head in damp strands. </p>\n\n<p>That was the other thing. She was soaking wet.</p>\n\n<p>I stared back at her with wide eyes, not able to take them off of this strange, tiny human that stood in front of me. It looked as if she was trapped in the same situation, looking up at me in wonder, as if I was some form of giant being from another planet or another universe.</p>\n\n<p>“Have you seen my mum?” The little girl suddenly asked me, through her visibly trembling mouth.</p>\n\n<p>I blinked rapidly for a moment, “Excuse me?” I asked.</p>\n\n<p>“My mum.” The girl repeated, “Have you seen her? I haven’t been able to find her for so long now, and it’s dark out here…and so cold.” She was scared, but I didn’t know why.</p>\n\n<p>“Your mum?” I asked, dumbfounded.</p>\n\n<p>The little girl nodded and feigned a weak smile, and then her eyes darted quickly past mine…towards something behind me. </p>\n\n<p>I turned around and saw what the girl was seeing. The little girl was screaming now. The little girl was screaming for her mum, for someone to come and help her. I was stood between the girl and a large, shapeless, maroon coloured shadow that drifted from the other end of the underpass towards us. </p>\n\n<p>I tried to position myself between the girl and the smoke…but the thing just passed right through me, filling me with an immense sense of dread, fear, horrible pain. As if every bad memory I’d ever had during my short time on earth had suddenly come back to haunt me.</p>\n\n<p>I turned quickly to see the shadow circle behind the little girl. She was crying now. A long, black arm reached from the shadow and placed four clawed fingers on her shoulder, gripping her firmly. The little girl looked at me, through me this time.</p>\n\n<p>“Where’s my mum?” She yelled.</p>\n\n<p>The maroon shadow suddenly lit up in a ball of heat, exuding flame into the tunnel, knocking me backwards and onto the ground with a shockwave of force that felt like I’d been hit by a truck. There was a cacophony of noise and a bright, red light in front of me. I shielded my eyes from the sudden flash. In between the hellish noise I could make out the little, crying girl screaming again. There was another voice, talking in a language I did not understand, low in pitch and almost snarling the words out from wherever it was talking within the light.</p>\n\n<p>As quickly as the flash had started, it was gone. As was the little girl.</p>\n\n<p>I must have sat there on the ground for half an hour afterwards, stunned from what I had seen. The only reason I was able to get to my feet was after I heard the noise behind me of approaching people. Chatting and laughing on their way back from a night of heavy drinking. I quickly got to my feet and threw my hood up…I don’t think I’ve ever walked so fast as I did that night to get out of the underpass.</p>\n\n<p>As I left the tunnel I looked over my shoulder to see if the girl was there again, but there was nothing. Only the yellow light of the bulbs in the ceiling, the graffiti on the walls, the black pavement. The cold chill of the air was gone now, and the only sign of anything was the empty pit I felt in my stomach, filled with dread that seemed to flow forth from that red, horrible shape. The shape which grabbed the little girl who wanted to find her mum.</p>\n\n<p>Maybe I’m crazy. Maybe someone spiked me. Maybe I was dreaming after I felt like napping in an underpass on a Winter’s night…but I like to think I know real from fake.</p>\n\n<p>So you tell me, what did I see in that dark tunnel, at 4am, on that cold February night?</p>\n</div>\n","author":"PixelState"}