{"rank":"834","title":"[Part 4] The Office I Worked In for a Year Never Existed","id":"8izawn","url":"/r/nosleep/comments/8izawn/part_4_the_office_i_worked_in_for_a_year_never/","time":"1526162707000","body":"<div class=\"md\"><p><a href=\"https://www.reddit.com/r/nosleep/comments/8i840m/the_office_i_worked_in_for_a_year_never_existed/dysrqh4/?context=3\">Part 1</a></p>\n\n<p><a href=\"https://www.reddit.com/r/nosleep/comments/8igyq4/part_2_the_office_i_worked_in_for_a_year_never/\">Part 2</a></p>\n\n<p><a href=\"https://www.reddit.com/r/nosleep/comments/8irdid/part_3_the_office_i_worked_in_for_a_year_never/\">Part 3</a></p>\n\n<p>We watched the monitor inside the van. Johnny was asleep on the ground just outside it. It was way past his bedtime. Kev pulled out a pad of paper and a pencil from his back pocket, and had begun tallying the number of suited men went into the smaller tent, and how many came out. After an hour we felt like we had conclusive information.</p>\n\n<p>27 in, 11 out. </p>\n\n<p>There was obviously something else going on in this inner tent. Four of them would have fit in there uncomfortably. Sixteen would be impossible. I pulled out my phone and tried to call Jim again, but he still wasn’t answering.</p>\n\n<p>Kev getting out of the van drew my attention away from my phone, and the screens. </p>\n\n<p>“Where are you going?!”</p>\n\n<p>“What d’you mean? We can’t just sit here. I’m going to check them other vans for suits.” He rounded the corner of the van out of sight. I scurried to the end of the van. </p>\n\n<p>“Kev, wait!” I jumped to the ground, and Johnny picked up his head with pricked ears.</p>\n\n<p>He was already halfway to the next closest van, and not being nearly as sneaky as I felt he should have been. I whisper-yelled at him. “Dude! You’re going to get us caught!”</p>\n\n<p>He replied at a normal volume. “We been in that van for an hour not even tryin’ to be quiet. They probably already know we here, and if they ain’t done nothing about us now they probably don’t wanna waste their time with us.” </p>\n\n<p>I gave him an incredulous look. “Weren’t you the one all concerned about these guys in the first place?”</p>\n\n<p>He gestured vaguely at the tent. “I’m not saying we walk in the front door, but they don’t want nothing to do with us.”</p>\n\n<p>I looked around, and he seemed right. The suited men were really only active around the entrance to the quarantine tent, and in the three vans that were parked immediately next to it. Johnny had gotten up from his napping spot and lumbered tiredly over to me, plopping his butt heavily on the ground. Meanwhile Kev had opened another van, but it looked as if it was full of various electrical equipment. He picked up a device closest to him. It looked like a tablet. He hit a few buttons, but nothing on the device registered. He held it out to me.</p>\n\n<p>When I took it from him and inspected it, it looked like a normal iPad; complete with the Apple logo on the back. I held the power button, and the screen flashed to life. Kev stared at me like I was wizard. “It wasn’t on. I turned it on. Ridiculous.” The screen displayed a simple black wallpaper with the time and date like any other iPad. I pressed the home button, and it prompted me to enter the password. I set it back in the van. “Not much we can do with that if it’s password-protected. Anything else useful in here?” </p>\n\n<p>Kev handed me a flashlight. “Just this. Most of everything else in here is more of them tablets, and some spare parts.” I flicked the light on, and shined it at the other nearby vans. </p>\n\n<p>“I guess we need to go check the others.” </p>\n\n<p>Kev was already walking towards the next one.</p>\n\n<p>It tooks three more vans of electrical doodads for us to find one full of hazmat suits. There were dozens of them folded neatly and stacked up to the roof of the van. Kev pulled two from the pile, and handed me one. I shook it out to its full length.</p>\n\n<p>“Okay. How do we get in?”</p>\n\n<p>“We go around the back, and cut our way in.” He pulled a pocket knife from his pocket.</p>\n\n<p>So the three of us made our way around the tent, careful to avoid any contact with the suited men. None of them paid us any attention, but we still tried to stay as far away as possible. When we were clear of sight from them Kev stepped up to the tent and put a hand on it. </p>\n\n<p>“It feels like normal canvas.” He pulled out his pocket knife and plunged it into the fabric. I flinched. I don’t know why, but I was expecting something awful to happen, but everything seemed fine. Kev tore a human-sized hole in the tent, and started to put on his hazmat suit. Once he had it on he stood with his arms out in a T-pose. </p>\n\n<p>“How do I look?”</p>\n\n<p>I couldn’t see his face at all through the helmet. I stepped up closer to him to inspect it, and he stepped back. “What?”</p>\n\n<p>“I just can’t see your face. Can you see out okay?”</p>\n\n<p>“I mean, it looks like I’m looking through a tinted window, but otherwise yeah.” </p>\n\n<p>I tore tore two strips of fabric from my t-shirt, tied one to his bicep, and handed him the second one.</p>\n\n<p>“So we can identify each other.” He did the same once I got my suit on, then held the flap open.</p>\n\n<p>“Ladies first.”</p>\n\n<p>I scowled at him before remembering he couldn’t see my face, and stepped into the tent. He followed me through. I crouched to look out the hole and called to Johnny.</p>\n\n<p>“C’mon, bud.” He sat just outside the tent and tilted his head at me as if to say “I am not going in there”, then lied on the ground. </p>\n\n<p>I waved a dismissive hand at him, and stood up. “Well you stay there, then. Watch our backs!”</p>\n\n<p>Kev was looking into the forest on the inside of the tent, flashlight in hand. It looked just like the forest on the outside. We made our way toward what we thought was the center of the quarantine tent. Every dozen steps or so we’d hear a rustle, and whip our flashlights towards the sound, only to see a squirrel or a chipmunk scurrying by. They hadn’t even bothered to clear out the local wildlife. How many birds were trapped in this dome? </p>\n\n<p>We tried to stay in the thicket parts of the trees, and after a few minutes of walking we saw the smaller tent. It looked as if the hazmat men had made a trail of lights from the entrance of the quarantine tent to the smaller tent. We’d come in almost on the opposite side of the lights. There was a small clearing that held the small tent, and we crouched behind some trees on the edge to watch. </p>\n\n<p>The hazmat men were still going into this tent, iPads in hand, and not coming out. Kev turned to me.</p>\n\n<p>“Are we just going to walk into the tent and hope we blend in?”</p>\n\n<p>“I say we hang tight until the commotion dies down a bit. These guys have to rest at some point, and I’m tired as hell.”</p>\n\n<p>“Same. Alright.”</p>\n\n<p>We backtracked a bit to try and keep ourselves out of sight, and I found a patch of grass that seemed comfortable, and sat leaned against a tree. Kev sat opposite me. We said nothing, and I tried to call Jim again, but of course he didn’t answer. I’m going to try to sleep a bit. It seems we have a busy night ahead of us.</p>\n\n<p><a href=\"https://www.reddit.com/r/nosleep/comments/8i840m/the_office_i_worked_in_for_a_year_never_existed/dysrqh4/?context=3\">Part 1</a></p>\n\n<p><a href=\"https://www.reddit.com/r/nosleep/comments/8igyq4/part_2_the_office_i_worked_in_for_a_year_never/\">Part 2</a></p>\n\n<p><a href=\"https://www.reddit.com/r/nosleep/comments/8irdid/part_3_the_office_i_worked_in_for_a_year_never/\">Part 3</a></p>\n</div>\n","author":"Mymissymoo"}