{"rank":"504","title":"I've found something really weird at the bottom of my grandma's old well","id":"8izkbx","url":"/r/nosleep/comments/8izkbx/ive_found_something_really_weird_at_the_bottom_of/","time":"1526165278000","body":"<div class=\"md\"><p><a href=\"https://www.reddit.com/r/nosleep/comments/8jylii/ive_found_something_really_weird_at_the_bottom_of/?utm_source=reddit-android\">Part 2</a></p>\n\n<p><a href=\"https://www.reddit.com/r/nosleep/comments/8lek1d/ive_found_something_really_weird_at_the_bottom_of/?utm_source=reddit-android\">Part 3</a></p>\n\n<p>So this is a really odd experience for me. I&#39;m a long time lurker of this subreddit, but up until now I&#39;ve never had anything to post. I&#39;m no kind of writer but I&#39;ll try my best to explain the situation.</p>\n\n<p>Two months ago my grandmother passed away. She was always odd and we didn&#39;t visit her much even when grandpa was around. She was the type of old lady you never wanted to serve at a restaurant. You know how there are two kinds of old people, those who have learned to just enjoy life and chill out and those that seem to only exist to hate anyone and everyone? Yeah, she was definitely a member of the latter camp.</p>\n\n<p>Pretty much the only time we&#39;d see grandma June after grandpa died was for thanksgiving, and she&#39;d just sit irritably in the corner next to the window and quietly curse us all.</p>\n\n<p>When she passed away in March no one in the family was wildly put out, we&#39;d seen it coming for a while. My mother had a rough childhood, but never blamed them for anything and respected her parents deeply. It was a moment to bow our heads in remembrance but no one was crying at the funeral. My sister’s specific words were, “I&#39;ll bet she&#39;s out there somewhere, looking up at us right now. And I&#39;ll bet she&#39;s really mad too.”</p>\n\n<p>Then it came time to read the will. Few to none had ever been close to grandma, especially not in her later years so it was anyone&#39;s guess who would get what. It was certainly a surprise to learn that she&#39;d left me the most valuable thing she&#39;d ever owned: the house.</p>\n\n<p>My first visit to the place after hearing the news of my inheritance was certainly eye opening. The old place is battered and on the verge of collapse, it&#39;s going to require a small army to put it back in living condition. The whole thing is encased in dark green ivy, clinging to the windows and walls like it was painted on. It took half an hour of work just to get the back door to open once again. When you step on the floorboards they creak so loudly I get worried I&#39;m going to drop through the floor, that&#39;s where you can actually step on the floor because the roof is so leaky there&#39;s buckets on almost every square foot.</p>\n\n<p>But that&#39;s not what&#39;s interesting about the old place, what&#39;s interesting is down the end of the garden. It&#39;s maybe forty feet or so to this old brick well. The moment I saw it I remembered playing in the yard on our highly occasional visits. If you got within ten feet of the damn thing grandma would lose her shit, I mean she&#39;d fucking lose it. Start screaming out the window at us and waving her cane, doddering after you while angrily swiping like a senile jedi. It was a large part of why we stopped coming to see her, the old bat.</p>\n\n<p>It&#39;s seen better days, the brickwork’s chipped and faded but remembering her reaction got me intrigued to check the thing out. </p>\n\n<p>It&#39;s not got any kind of decorative roof over it, nor any decoration at all, no bucket anywhere nearby either though why would there be in this day and age? Instead there was just a big sheet of mouldy wood on top of it. I slid that off and realised that even when the sun hangs directly over the thing you can&#39;t see the bottom. I tried shining a light down but still, nada. And then there&#39;s the rancid stench, like something&#39;s rotting down there. It&#39;s so bad I&#39;ve started holding my breath whenever I&#39;m investigating it.</p>\n\n<p>I suppose none of that is particularly weird, aside from the smell, which is likely why I forgot about it for a week or so and got on fixing the house up. That is until this morning when I was digging through some of the dusty crap in her basement and I found a rustic camcorder. I threw some double As in, and feeling a need to try it out I was reminded of the misshapen eyesaw at the end of the lawn.</p>\n\n<p>I grabbed a length of string and tied it around the wrist strap along with a flashlight and lowered it down there. It went down a hell of a long way before it eventually hit the bottom, but it was so deep in there I could hardly even make out the faint glow of the flashlight.</p>\n\n<p>When I reviewed the footage I found something really, really eerie. It goes down however many feet and then there&#39;s the bottom, just some damp soil, but it&#39;s not the bottom itself but what&#39;s at the bottom. There&#39;s a tunnel, an offshoot that clearly carries on. It&#39;s all boarded up and I&#39;d have no idea how you might get down to it, but it&#39;s there. Someone has made a tunnel all the way down at the bottom of this thing. For what purpose I just can&#39;t wrap my head around. Why would you need something like that? Did my grandma know it was there? She certainly couldn&#39;t have made it herself, she could hardly stand without help. Even back when grandpa was alive I don&#39;t remember the pair of them being particularly spry.</p>\n\n<p>I&#39;ve tried Googling for anything similar to my situation but I couldn&#39;t find a thing. Does anyone out there have any idea what I might be dealing with here? There&#39;s probably some rational explanation I&#39;m missing but I&#39;ll keep looking into it. </p>\n\n<p>I&#39;ve called my parents and neither of them say they&#39;ve heard grandma talk about anything like that. My grandparents moved there after my mom had left so she had no idea.</p>\n\n<p>The only thing i can think is that one of my cousins is an abseiling instructor so, perhaps I&#39;ll see if he can help me out and see what&#39;s down there. Thanks for any help anyone can give me on this, I&#39;ve got to say I&#39;m stumped.</p>\n</div>\n","author":"Twofailedactors"}