{"rank":"53","title":"Who Is The Man Living Next Door?","id":"8izmgt","url":"/r/nosleep/comments/8izmgt/who_is_the_man_living_next_door/","time":"1526165818000","body":"<div class=\"md\"><p>Last Friday night i decided to get a takeaway. It wasn&#39;t too much effort since i live about 5 minutes away from it in my snug, little apartment in Liverpool, England. It was the usual, egg fried rice with curry and chicken, i thought it would act as a treat since i recently turned 20. before i left, i decided to turn the television on, my two staffy dogs, Wilson and Watson (i know, my mum named them) liked watching the news. so... i grabbed my money and left. I had only left the apartment for 3 minutes until my neighbour, Kate, started to ring me. I wasn&#39;t driving (since i don&#39;t have a license) so i swiftly pulled out my slightly smashed iPhone 6 and answered her call. What followed was the most horrific, blood boiling scream i have ever heard. I just stood there, in the middle of the street, wondering what the fuck was going on. I immediately replied.</p>\n\n<p>&quot;Kate? Are you OK, do you need police?&quot;</p>\n\n<p>oddly enough, she picked up the phone and demanded that i came back to my apartment. i would usually ask why, but something was off. She sounded different, scared yet calm, like when you are lost but you know you&#39;re safe. I used to race in high school so i picked up some speed running home. I must have been going about 12 MPH, at least. I was fucking bucking it. After about 2 minutes i got back up to my apartment and opened up the door. Nothing was wrong.... nothing at all. My dogs where sat on the couch watching the TV, like they normally do. my bedroom and bathroom were untouched and even the birthday cards i had gotten a few days back were all perfectly lined up, one by one. It wasn&#39;t right though. there was something off, and i could put my finger on it. Then i suddenly remembered. My neighbour, Kate. I Immediately went to her apartment, like i should of in the first place. I banged on the door for a good 5 seconds until she opens the door with considerable force. It was a man in her apartment, about 6 foot tall and lanky, kind of handsome but he had a ton of moles, blemishes and spots. he looked at me with a stern look. </p>\n\n<p>&quot;What the hell Lucas? whats up?&quot;</p>\n\n<p>I was confused, and just shrugged off his questions like they meant nothing.</p>\n\n<p>&quot;Wheres Kate? She told me to come round to her house&quot;</p>\n\n<p>He looked at me with pure confusion in his eyes and said</p>\n\n<p>&quot;who? We have been neighbours for 2 years man. i thought that you were off that shit, it sends you loco.&quot;</p>\n\n<p>It was then when i knew something was off. One, i moved in 2 months ago. Two, my dogs had left my room through the open door and barked at him abruptly. I was scared, and quickly backed off before i tripped over Wilson. I must have banged my head on the way down, because now i am currently in a hospital.</p>\n\n<p>&quot;what one is this one? methamphetamine?&quot;</p>\n\n<p>The man in a white lab coat comes behind the voice</p>\n\n<p>&quot;no, serious brain damage. hit by a car running back to his apartment&quot;</p>\n\n<p>another strange man comes up to me, this time in a navy blue uniform. he had a badge and gun.</p>\n\n<p>&quot;Do you know anyone called Kate Wordsworth?&quot; he asked</p>\n\n<p>&quot;Yes, i do&quot; i reply</p>\n\n<p>He looks at the strange men in lab coats and back at me</p>\n\n<p>&quot;She was murdered the night you were hospitalised, the suspect is believed to be a tall, lanky man with acne&quot;</p>\n\n<p>My heart dropped</p>\n\n<p>Nothing Made Sense</p>\n</div>\n","author":"CronicNS"}