{"rank":"9","title":"Swerve","id":"8j0xxg","url":"/r/nosleep/comments/8j0xxg/swerve/","time":"1526178576000","body":"<div class=\"md\"><p>I am a very paranoid person. If something doesn’t feel right then it automatically isn’t.</p>\n\n<p>This obviously doesn’t make me a very fun person to be around because I am the one that makes everyone feel on edge. One time I was with a couple other people on an expedition through the woods behind the school. There were a lot of rumors about them and obviously I was not for it whatsoever. I made everyone turn back early before we die to whatever lies in there.</p>\n\n<p>This story, otherwise known as the “pussy that made us turn back” tale, spread throughout the senior class like wildfire. This caused a lot of humiliation and degradation. Each day people would taunt me with horror stories and scary pictures and life sucked. </p>\n\n<p>One day, my long time friend Jack saw how I felt and thought of taking me on a vacation with him and a few of his friends to his lake house upstate. This was a great idea, I thought. I would take some time away from these assholes and spend it with Jack and some new friends.</p>\n\n<p>A week after he approached me with the idea, I came over to his house and met him with his friends. He had two other friends, Alex and James. Alex was tall and tough looking and James was average sized but scrawny. I introduced myself to both of them and went into the kitchen to get a drink. </p>\n\n<p>When I got back I see Alex and James talking and smirking and Jack’s head is in his hands. That was a little unsettling. Me being myself, I ask if anything is wrong. Jack said not to mind it and Alex pushes off of Jack and steps in front of me. It felt like I was next to a  building.</p>\n\n<p>“It’s nothing, we’re just excited for you to come with us upstate. Jack told us how you are and I think that it’s gonna be perfect for scary story night.” I lurch back and Alex notices. “We should help you get over this, ‘flaw’ you possess, together. What do you say?”</p>\n\n<p>No no no no this is not happening. Why would Jack agree with this? I look at him for solace and he just frowns and mouths the words, I’m sorry. It’s obvious who is in control of this situation, and it’s not me nor Jack. So I look down at the floor and say, “sure, thanks.”</p>\n\n<p>“Excellent,” Alex says too happily, “can’t wait.”</p>\n\n<p>We go outside to Jacks truck. I threw my shit in the back and everyone else followed. I get in the passenger seat, the safest seat, and Alex hops in the drivers. Jack and James fill in the back. Alex sets the navigation to the lake house and it says that we will be there in 2 hours. Great.</p>\n\n<p>About 30 minutes later, I find that I am actually enjoying myself with Jacks friends. We start playing games like FMK and just talk about classic guy banter. While we were talking about the new episode of the show that we all like James taps Alex on the shoulder. A minute later Alex jerks the wheel to the left and I grab the door in fright.</p>\n\n<p>“Oh I’m sorry bro,” Alex says non-apologetically, “just avoiding a pothole.”</p>\n\n<p>I’m still grabbing onto the door and Alex looks back at James and smiles. I stare at Jack and he is looking down. Is this what he means by getting over my paranoia? How could this happen? Why is he doing this? As I am in my own thoughts the car swerves into the wrong lane and back again.</p>\n\n<p>“Whoops we drive on the right side in America, silly me!” Alex says and laughs. I am visibly panicking and fiddling with the handle. He is trying to kill us.</p>\n\n<p>Alex then takes the sharpest turn that throws me into the center console and my head into his seat. There is sweat dripping from my forehead and my hands have white knuckles and are attached to the passenger seat. Alex continues to torment me by turning the wheel back and forth on these straight roads. I can’t take it anymore.</p>\n\n<p>The next time he tries his prank my bodily functions take over. I grab the wheel from the passenger seat and try to knock Alex out of the way. James yells at me and Jack yells at Alex. Alex punches me in the face and says, “get off of me pussy!”</p>\n\n<p>Pussy? I’ll show this asshole who the real pussy is. I take the wheel the second time and turn hard to the right and we swerve right off the road. Me, still in rage mode, punches Alex in the face and knocks him out. 5 seconds later I realize what I’ve done. We go barreling down a hill and into a house at the bottom. My vision goes black.</p>\n\n<p>I wake up after what feels like a day and survey the scene around me. Through my barely open eyes, I see that I am still in the truck and so is Jack and James. However, Jack suffered a blow to the head from the airbag and James’ didn’t go off. James’ body is basically folded in half over the seatbelt, dead. I check Jack’s pulse, dead as well. I’m shaking and I look around for Alex. He’s not here. I unbuckle my seatbelt and push back my airbag. I step out of the truck and onto what looks like tile floor. When I’m fully out of the vehicle I immediately bend over and throw up.</p>\n\n<p>After I get back up I look around, we landed in what seems to be the kitchen of someone’s house. Then as im trying to get my bearings, I notice a broken down table and a couple lying on the floor in front of the car. Right next to the couple I see Alex bending down and checking for breathing. He turns and looks around until his eyes land on me.</p>\n\n<p>“Y-y-you, you did this!” He screams at me. “You killed them! Killed Jack, a-a-and James!”</p>\n\n<p>Me!? I did this? He did this! If it wasn’t for his stupid plan to get me over my paranoia we would’ve been fine inside a cabin but no, he needed to teach me a lesson. “What the hell are you talking about! You tried to scare me and started swerving, I had no choice.” I say back.</p>\n\n<p>“You had no choice?” He retorts, “you had no choice!? Of course you had a choice. You chose to be a bitch and you chose to grab the wheel. You chose to take us off into this house. You chose to kill, not 1, but 4 people! How fucking dare you say it was my fault!”</p>\n\n<p>Maybe he’s right, I think. I took the wheel. If the cops come I’m the one that’s gonna go down in flames, Alex would walk away clean. I killed these people. Oh no, I am a murderer. What will the cops think, I can’t let Alex tell on me, that would be the end of my life forever.</p>\n\n<p>“YOU KILLED THEM!” Alex screams. After he says this he charges towards me with fire in his eyes. Before he reaches me I take a piece of tile and smash him in the head with it. He hits the ground, hard. I check his body for signs of life, there is none. </p>\n\n<p>I killed 5 people. 5 people, in cold blood. In the distance sirens are wailing. I’m a dead man, no trial will be held, I’m gone for sure. As the police roll up I see one of the vehicles approach the wreckage.</p>\n\n<p>When the headlights get closer I jump into the road in front of the car, hoping for the worst.</p>\n</div>\n","author":"nails907"}