{"rank":"9","title":"That's Not My Name [Part 4]","id":"8j0xdt","url":"/r/nosleep/comments/8j0xdt/thats_not_my_name_part_4/","time":"1526178404000","body":"<div class=\"md\"><p><a href=\"https://www.reddit.com/r/nosleep/comments/84duxs/thats_not_my_name_part_one/\">https://www.reddit.com/r/nosleep/comments/84duxs/thats_not_my_name_part_one/</a></p>\n\n<p><a href=\"https://www.reddit.com/r/nosleep/comments/84q452/thats_not_my_name_part_two/\">https://www.reddit.com/r/nosleep/comments/84q452/thats_not_my_name_part_two/</a></p>\n\n<p><a href=\"https://www.reddit.com/r/nosleep/comments/8etl83/thats_not_my_name_part_3/\">https://www.reddit.com/r/nosleep/comments/8etl83/thats_not_my_name_part_3/</a></p>\n\n<p>I spent a couple of days camping in that forest. I did not feel hungry or tired, the strange energy and strength granted to me by the consumed blood seemed to last forever.</p>\n\n<p>After a while though, I knew I needed a plan. I needed to work out what the hell happened and what I had become. I spent a lot of time on the internet, trying to gather as much information about my car accident and life before it as I could. It seems I was someone. I had family, and friends, and girlfriends. None of those things felt like they mattered anymore.</p>\n\n<p>I decided that hiding in the forest wasn&#39;t going to serve me much further and with no better ideas, I went &quot;home&quot;. Once I arrived, the woman who believed herself to be my mother ran outside, crying and clawing at my chest. She had been terrified that she would never see me again and I apologised profusely to her, trying to explain that some strange things had been happening and I had gone to try to work some things out.</p>\n\n<p>As I walked into the house, she touched one of the burn marks on my arm. &quot;Jerry... You wanna tell me what&#39;s really going on here?&quot;</p>\n\n<p>Something broke in me and I sat down at the kitchen table and told her everything that had happened. And her reaction was... Strange. Other than a slight recoil as I described drinking the dead people&#39;s blood, she remained stony faced until I finished speaking. Then much to my confusion, a slow, dark smile began to spread across her face.</p>\n\n<p>&quot;So it worked then. We don&#39;t have much time and so much to do.&quot;</p>\n\n<p>It was my turn to recoil, the confusion and shock almost overwhelming. She told me to get into her car and she would explain on the way. With no more knowledge or other options, I simply followed along and joined her.</p>\n\n<p>&quot; Thankfully, I no longer need to live out this charade as your &quot;Mother&quot;, since you&#39;re not really Jerry anymore are you?&quot; she asked, and i slowly nodded my agreement.</p>\n\n<p>&quot; You may call me Miranda. While I brought your body into this world, I am intended to be your wife. We are going to change this world, you, me and the others. We are going to bring it to its knees. We have a lot of work to do and not a lot of time, so forgive me if explanations are short.&quot;</p>\n\n<p>Intended as my... Wife? What the hell did she mean? I sat in stony silence as we drove through dark streets, heading toward the outer part of town. The roads grew darker and houses fewer until we reached what appeared to be a long unused industrial area. Miranda made a sharp turn, and pulled into a dimly lit warehouse. She motioned for me to exit the car and walked towards a heavy steel door. As we reached it, she took my right hand and placed it upon the door. The area around my hand begun to glow red and the door swung open, like I had managed to unlock it simply by touch.</p>\n\n<p>Inside the door stood a room. The outer walls held rows of computer monitors, all flickering slightly in the darkness. The centre of the room held a table and chairs, at least 20 of them. The walls were covered in lists of names, each list littered with notes and hastily scratched out sections.</p>\n\n<p>Miranda poured herself a coffee from a decanter across the room, then pulled out a strange jar full of dark liquid and filled a glass from it. She handed me the glass and as I lifted it to smell it, I realised it was blood. Thick, dark and fresh. Mildly disgusted, I drank the glass entirely and felt like my bones were on fire as it seeped into my veins.</p>\n\n<p>&quot;Miranda, I don&#39;t understand. What the hell am I?&quot;</p>\n\n<p>&quot;All in good time.&quot; she answered in an almost purr-like voice. &quot;They&#39;ll be here soon and when they arrive, all of your questions will be answered.&quot;</p>\n\n<p>Sure enough I began to hear cars pulling into the warehouse. Strange men, women and even some children began filing into the room and taking seats at the table. None would make eye contact with me and despite my attempts to communicate, none would speak to me. Eventually all the seats were filled. I sat with Miranda near the front of the room, waiting for everyone to settle. Next thing I know a chime is sounding and everyone is staring directly at Miranda and completely silent, like they were longing for her to speak.</p>\n\n<p>&quot;REMOVE THE CHILDREN&quot; she bellowed across the room. Without a word of protest the children left the room and, walking through a door to the right, were quickly gone.</p>\n\n<p>Miranda then raised her hands and with a look I can only describe as both manic and evil, she cried out with glee, &quot;He is here. He is amongst us. How long we waited for a vessel that could hold him. What sheer divine luck that my own child was the perfect candidate, and at the edge of death could not deny him!&quot;</p>\n\n<p>She then walked over to me and cupped my face in her hand.&quot; Jerry no longer. No longer my child. You have already fulfilled the first act with the slaying of those who wish to stop us. You drank of their blood, a worthy sacrifice. The blood you drink tonight will give you the strength, the purity, to fulfil the next act!&quot;</p>\n\n<p>Not understanding what the hell was going on, I heard the voices of the others in the room beginning to chant. Their voices rose slowly and as they did, several women stood and began removing their clothes. They walked to the front of the room and lifted the jug of blood. Miranda walked towards them and with a guttural moan, began to rub the blood over her naked body. The women all took turns doing the same. Meanwhile the men pulled all the tables across the room. The chanting reached a fever pitch and the next thing I knew, my clothes were being pulled off my body. Miranda walked towards me, her naked breasts heaving in ecstacy. &quot;Drink my child. My lover. My God. Drink and tonight we shall begin the task of filling this world with more chosen, more of us!&quot;</p>\n\n<p>I couldn&#39;t fight it. I wasn&#39;t even sure I wanted to. I didn&#39;t know what they were about to do but a fire in my blood grew at the smells and sounds and naked bodies around me.</p>\n\n<p>I drank deeply from the jug. Everything else is a blur.</p>\n\n<p>The next morning I awoke on the floor. My body ached and had a dark mess all over it which I realised was blood. Too much blood, more than what was in that jug. I opened my eyes slowly to a sight I can barely describe.</p>\n\n<p>The mens bodies laid around me, all dead and bleeding from multiple wounds.</p>\n\n<p>The women all laid around the room, some moaning and writhing in pain while others slept quietly. I stood up and began to walk to the nearest woman as she began to scream in pain. I looked down to see she was pregnant. Heavily pregnant and from what I could tell, giving birth.</p>\n\n<p>They all were. None of them were pregnant last night. But here they all were, screaming and crying as they tried to push these children into the world.</p>\n\n<p>And as the horror and shock descended on me, as the truly terrifying scene unravelled itself before my eyes, I realised. I realised what had happened.</p>\n\n<p>As I dropped to my knees, I saw Miranda stand. A bundle in her arms wrapped in dirty rags, she began walking towards me.</p>\n\n<p>&quot;Our child. They are all our children. We will make many, many more. And together, this earth, shall become ours.&quot;</p>\n</div>\n","author":"Silent_nyix94"}