{"rank":"868","title":"facebook stalker","id":"8j0zpb","url":"/r/nosleep/comments/8j0zpb/facebook_stalker/","time":"1526179109000","body":"<div class=\"md\"><p>I grew up extremely privileged. Gated neighborhood, private school, cleaning ladies. The area I lived in had a general ‘ew, poor people’ sort of vibe to it, which is why, when I smiled at the valet, something must have clicked. </p>\n\n<p>I was about fifteen years old when me, my parents, and my older brother were all invited to dinner at a golf club about thirty minutes from where we lived. There was a valet service at the club, which was not out of the ordinary, and since it was raining and my mother couldn’t imagine walking more than a few seconds in the rain, we pulled up to the front to have a valet go and park our car. I remember being in a really good mood that day, so when the valet took the keys from my father and thanked us for coming to the club, I smiled at him and thanked him back. </p>\n\n<p>Dinner was nothing special, and neither was the week or so following dinner. We got our keys and our car back just fine, and we went about business as usual. </p>\n\n<p>One Saturday night, my best friend was throwing a birthday party. It would be my first real party, as boys would be there and her parents would be out of the house. I was, obviously, very excited, and by the end of the night, everyone was tipsy and paired off with someone of the opposite gender, including me. The next morning, I was planning on staying at my friends place until my headache receded, but my mom called me home much earlier than expected. </p>\n\n<p>She had received a Facebook message from what was obviously a throwaway account. The message said that I had attended a house party with alcohol and “lewd behavior” and the messenger wanted my mother to know so she could keep me safe. The message would have been strange to begin with, but the fact that my full name-first, middle, and last- had been included was even creepier. </p>\n\n<p>Regardless of concern over the message, my mom grounded me and volunteered me to babysit for the neighbors. So, instead of spending my Friday night hanging out with my friends, I was over at the neighbor’s house watching their children. Overall, the time I spent with the kids was not terrible. They were good kids and went to bed early, so I had the house to myself until midnight when my dad would pick me up. </p>\n\n<p>I had been trained not to answer doors when I was home alone from a very young age, so when I heard the knock at around 9:30 that night, I didn’t answer it. In fact, I moved a little farther away from the door and turned the volume on the TV down so that whoever it was didn’t know I was there. I can’t remember what justification I gave for someone knocking that late, but whatever it was, it calmed me down when the person left. </p>\n\n<p>And then came the knocking on the glass door in the back of the house. I bolted up, grabbed the house’s cell phone, and booked it up the stairs. I woke the older girl, ushered her into her younger brother’s room, locked the bedroom door, shoved a dresser in front of it, and called my mom. She called the family, who came home immediately. No damage had been done to the house, but there were footsteps outside. The police couldn’t do anything, so I shook it off but vowed I would never babysit again.  </p>\n\n<p>Nothing strange happened for a few months, and at this point I was well into my freshman year. You could say I fell into the wrong crowd, but my mother had no knowledge of this. And then came the second message. It was from a different account, but the person’s name was the same. It contained roughly the same content, saying I was drinking and getting involved with boys, but it also wrongly accused me of being into some hard drugs. I vehemently denied these allegations to my mother, and she believed me. This time, she called the police and told them that someone seemed to be watching her underaged daughter. I was grounded again. </p>\n\n<p>Just a few days after the second Facebook incident occurred, my family went out to dinner. We locked the house up, as usual, and went out. When we arrived back home, the front door was open, moving slightly in the wind. We were absolutely terrified and called police before going inside. The searched the house thoroughly and told us that the good news was that no one was inside. The bad news? My room was absolutely ransacked. </p>\n\n<p>I started crying. To this day, I can’t truly tell you why. The eerie messages combined with the babysitting incident piled on top of a home invasion just left me a wreck. We went through my room, trying to figure out what had gone missing. The list included: my school ID, a picture of my boyfriend at the time, my laptop, and a bottle of alcohol I had kept hidden under my bed. Creepiest of all, though, was that a bra I had bought just the week earlier was also gone. My mom didn’t know about it, because it was something I had bought to impress my boyfriend, but I had to tell both her and the police. And, honestly, any possibility of embarrassment was absolutely gone. I was sufficiently terrified, and so was my mom. </p>\n\n<p>When the responding officers were updated on the overall situation, my family was driven to a friend’s house in unmarked police cars, as these incidents seemed to likely be connected and this person was clearly following me everywhere I went. We were told to call the police anytime something suspicious happened and the officers made a promise that someone would always respond, no matter how minimal it might seem. </p>\n\n<p>Things were okay for a little while. I was still paranoid, never going anywhere alone and refusing to stay at home without someone else with me. </p>\n\n<p>And then everything started up again. </p>\n\n<p>My boyfriend called me, saying that someone had followed him around when he was shopping with his mom. I asked him for a description of the man and gave it to the police. That was step in the right direction, I thought. At least we might be able to visually identify him. Thing was, he seemed to be stalking my boyfriend now. Our families were friends, so we did dinner together and then all the kids (me, my brother, my boyfriend, and his younger sister) decided we would go outside for a walk. It was steadily getting dark out, and we were about five minutes away from the house when it became completely dark outside. Everyone was fairly tired and pretty quiet as we walked toward the house. </p>\n\n<p>My brother stopped dead in his tracks right in front of the driveway and shushed everyone. We listened. There was rustling in the bushes. It was loud enough that it was clear it could only come from a person or a very large animal, and since there were no very large animals in the area, it had to be a person. Slowly, we all turned around and walked quietly back across the street, finally getting far enough away to call the police. We also called our parents, telling them it sounded like someone was outside and to lock all the doors and not leave the house. We were safe in our current location-we were sat next to a street light, so we could see everything around us, and the house was close to a block away. </p>\n\n<p>A lot happened once the police came, so I’m going to do my best to summarize. As soon as the cops flashed their lights toward the house, someone came running out of the hedges. The officers managed to be fast enough to tackle him, wrestling a knife out of his hand. There was a lot of panicking and a lot of crying, most of it on my part, but they got the guy into custody and everyone went home, though I don’t think anyone slept. A few days later, the police got back to us regarding charges and the overall situation. </p>\n\n<p>The man worked as a valet at the golf club we had gone to. In addition to the knife, he had a copy of our house key he had apparently made himself after taking pictures of it from off Dad’s key ring. When questioned, the man told the police that he was in love with me. Somehow, he managed to follow us home from the golf club that first night and watched our family. He decided that my parents weren’t taking good enough care of me, which is why he sent the messages to my mom. He didn’t like the fact that I was left alone in a house I didn’t know, which is why he scared me while I was babysitting. He wanted me to go home. The more he followed me, the more he thought I needed to be “saved.” He hated the fact that I had a boyfriend, and when he broke in, he took everything he thought I could use to do something supposedly bad. </p>\n\n<p>The end game was to kill both my boyfriend and my parents. </p>\n\n<p>I think he’s in a mental hospital now, but I honestly don’t know. The whole ordeal has left me with years of paranoia and fear, and we ended up moving across state lines a few months later. </p>\n\n<p>We haven’t used valet services since.</p>\n</div>\n","author":"anxiousivy"}