{"rank":"337","title":"Acne","id":"8j115h","url":"/r/nosleep/comments/8j115h/acne/","time":"1526179563000","body":"<div class=\"md\"><p>It started late for me. In middle school I was beautiful with skin still blessedly soft and clear like a child’s. My hair, the color of finest gold, complimented my fair complexion and perfect face. Everything seemed to fall into its right place during those years. My fellow students loved me, I was having great experiences in socializing and even some romance. If you can call dating during those years “romance” anyway. It was even great during my freshman year of high school, too. But it changed when I turned 15 and started my sophomore year.</p>\n\n<p>A seemingly-unimposing pimple had sprouted on my left cheek. I remember it was there that it all started, but I couldn’t tell you how long it took to spread. It felt like one day I was my beautiful self, and the next I was a leprous abomination covered in rough bumps and red splotches. I became a hideous monster, the antagonist of a kid’s fairy tale, a disgusting mass of ugliness.</p>\n\n<p>I had no more friends; they dropped like flies. No more suitors; none of the boys wanted to speak or even look at me. My own parents, oblivious to their daughter’s suffering and caring only for the television that ran constantly in the living room, hardly spoke to me. I was lost, dazed, reeling from the deathblow that my horrible, oily skin had given to my social life. Everything ended and it was the fault of my abominable skin condition.</p>\n\n<p>My face was pocked and covered in pimples and zits. Raised, red bumps and cysts molded my face into that of a human strawberry. Even my hair which used to make my confidence soar now only reminded me of the pus that wept from my sore skin. I tried everything. Creams and gels and anything else to get rid of it. But just like the acne, the fact simply remained: I was ugly. I was a monster. I didn’t deserve to be happy. But I didn’t deserve to live like this either.</p>\n\n<p>On any given night, I can’t recall exactly which, I had cried hard enough to decide it was time to do something else. I wanted my beauty back, and the only thing that stopped it was the acne. If it wouldn’t come off with cleansers or other products, surely a blade could do it? I took a pair of scissors from the kitchen drawer and stared at myself in the mirror of my bathroom. I was unsure of this until I looked into my blue eyes. I saw my former self, as well as what I <em>could</em> be if I were successful. With trembling hands, I found the biggest bump on my left temple and raised the scissor’s blades towards it. I looked at the rubbing alcohol and the box of bandages quickly before I closed my eyes and began to dig out the pimple.</p>\n\n<p>My eyes were burning with tears as I carved into my face. I wanted to scream but knew I couldn’t. My parents would find me, and they would stop me from being beautiful again. I bit down and grinded my teeth together as my blood trickled down my hands that held the scissors. It was too much for me to go on, so when I had finished with this one I decided it was enough. At least for one night. I poured some of the rubbing alcohol into my cupped hand and lowered my forehead to it. The excruciating pain that flared in my head only doubled when it reached the isopropyl. My mouth opened in a silent scream and I waited until it numbed.</p>\n\n<p>I poured the now-red alcohol into the sink and quickly slapped the square bandage upon my head. I was still a monstrously ugly creature, my reflection in the mirror definitely proved it. But it was an improvement despite the bloodshot eyes and the streaks of tears trickling down the rocky mountain range of my cheeks. I felt lightheaded as my skull throbbed. But it was a good feeling. It felt like success or real progress. I limped back to my bedroom, hopeful that at school the next day somebody would notice and take the time out of their life to tell me how much less ugly I had become.</p>\n\n<p>But nobody did. I was ignored if not stared at in disgust except for the teachers. They were curious about the bandage. Just an accident, I told them. That pacified them. They were either stupid or they didn’t care enough about a grotesque monster to inquire further. It was probably the latter.</p>\n\n<p>When I came home, I went directly to the bathroom. Before entering, I threw my backpack by the door. I locked the door and took the scissors. The blades were stained. I forgot to clean them the night before, but it didn’t matter. I was about to dirty them again anyway. My body was full of adrenaline when I stared into the mirror and held up the scissors. I smiled. There was so much anger within me because of this damn acne. It infected my face and laughed at me every time I tried to cure it. But I finally found something that could kill it. The pain the scissors would cause me would’ve been nothing compared to the years of torture I would have to endure until the acne finally stopped. And that’s only <em>if</em> it would’ve stopped. It wasn’t guaranteed. But the scissors? Those were guaranteed results. I had isopropyl and I had bandages. I had the solution right there.</p>\n\n<p>So, I cut. I slashed and dug into my face for hours. Sometimes I had to stop just to get used to the pain, and other times to wipe my weeping eyes. Blood leaked from my face to my neck and stained my shirt. By the time the sun set I had cleansed my forehead of all the blackheads and whiteheads. I just had the myriad of zits on my cheeks and the cysts that trailed down my jawlines. Wads of blood-soaked toilet paper littered the bathroom floor next to the toilet. I held the stained and now-dull scissors back up to my left cheek and began to carve as I cried.</p>\n\n<p>Regret mixed with the pain, but that was a weaker side of me. That was the sick side of me that wanted to resign and stay ugly forever. I knew that wasn’t the real me and resisted its cries to stop within my mind. The true me wanted to be beautiful, wanted others to look at me again and not cringe. Scraping off every bit of acne was the only way it would happen again. I was going to be beautiful. I had to continue the mutilation. Near the end, I had chunks of my face dropping into the sink. A hole the size of an ice cream scoop was hacked from my right cheek and jawline. On my left jawline I still had a patch of clear skin left. But that was okay. If it had ever developed a pimple, I knew what to do to it. At some point when dumping the alcohol on my face, I passed out.</p>\n\n<p>But now, the sunrise is lending light to creep into the house. I wake up to look at myself in the mirror. It’s gone. By the grace of the scissors, I’m free. Holes are on my face, yes, but they’re no longer pimples. Oh, dear god, I’m so beautiful! I’m so beautiful, I’m crying! I’m so happy to be beautiful again. <em>I’m so… beautiful…</em></p>\n</div>\n","author":"GoGoSpaceMan"}