{"rank":"31","title":"The Corn Picker","id":"8j12tb","url":"/r/nosleep/comments/8j12tb/the_corn_picker/","time":"1526180052000","body":"<div class=\"md\"><p>This story happened before my time. I’ve heard about it my whole life though, and in some ways it still affects us today. This is my best take on it. I&#39;ve seen that corn picker, aged in the barn and covered with dust. That it might be evil has crossed my mind. </p>\n\n<p>I grew up on a farm in southern Maryland. It&#39;s a quiet part of southeastern metro DC along the Chesapeake Bay to the east, with the Potomac River cutting a western border, and the Patuxent slicing south through the center. </p>\n\n<p>Our farm is reached from Cherry Tree Crossing Road where a quarter-mile of sweet honeysuckle lines the shoulder. The dirt driveway follows the power lines, high metal towers every half mile, northwest. You&#39;ll pass an abandoned trailer before dipping down a steep streambed lined with oak and dogwood and maple. That&#39;s when you&#39;ll find our one hundred thirty acres. </p>\n\n<p>We mostly grew tobacco. A lot of corn too. In the fall, that corn crop needed to be harvested. We did that with a corn picker pulled by a tractor. A corn picker is a metal-jawed monster that draws cornstalks into a maw of grinding rolls. It spits out green cobs into a receiving bin and leaves shredded stalks on the ground. </p>\n\n<p>In the early 70s, my grandpop was out harvesting. A mass of stalks jammed into the picker&#39;s large teeth, which were the size of motorcycle sidecars. He dropped into neutral and set the brake before climbing down to pull them free. </p>\n\n<p>My grandpop was tough as shit. His whole life in the sun, I saw pictures of a man baked so crisp it&#39;s a miracle he didn&#39;t die from melanoma. His face, even at that younger age, had so many wrinkles he looked like the Reaper. There was always a chaw of tobacco in his mouth, which he either spit to the ground, or dribbled the juice into a Styrofoam cup when inside. </p>\n\n<p>When he reached for those stalks, they wouldn&#39;t budge. They choked the entire assembly. The grinding teeth trembled as they tried to break the blockage. So, cursing, he reached his hand to yank the mass free. </p>\n\n<p>A neighbor working his fields saw him looking stone faced into the corn picker&#39;s maw. He waved but got no response and turned for his long return line south. </p>\n\n<p>The conveyor finally released the stalks and clamped on grandpop&#39;s right hand instead. The force bent him so his torso lay over one of the massive teeth, his legs dangled over the side. The grinder clenched on his fingers and started to eat. </p>\n\n<p>You&#39;d have to see one of these things out in the field to understand. It&#39;s not just the monstrous appearance of it, but the sounds as it rumbles and crunches and spits. I once saw a snake get snatched in. Almost five feet long, it coiled frantically, first whipped over the top of the picker, then slowly drawn in by the tail. </p>\n\n<p>By the time half of it was chewed, its insides oozed from the open mouth, which trailed on the ground. Its body churned into a gory mess. </p>\n\n<p>I think about that, how grandpop must have felt as his fingers disappeared, mulched into pulp. But like I said, he was tough as shit. </p>\n\n<p>One other thing you should know is how that corn picker was known for this type of mayhem. There was the snake and grandpop, and before that a rabbit, turtle, and even a crow. (I don&#39;t have the details on that one.) My cousins tell me the picker had a nickname: <em>the Hellion</em>.</p>\n\n<p>Grandpop fought for his life. With his left hand he struggled to get his pocketknife from his right pocket. His body had been pulled face up, teetered on that tooth and faced to the sky. Once the dull, four-inch blade rested in his hand, he reached over his head. By that time, his hand was gone. </p>\n\n<p>The first cut missed and impaled his forearm. With the teeth closing in on his wrist, the second try found his knife slicing flesh and ligament and bone along the wrist. He sawed back and forth, blood in a chaotic spray. The corn picker didn&#39;t release him. The flesh of his outer wrist wouldn&#39;t cut, as it had gotten to close to the teeth for him to reach. </p>\n\n<p>With a heave, that flesh ripped away. Grandpop fell to the ground, his arm spewing blood. The teeth swallowed his hand with a sputtering gulp. </p>\n\n<p>After, he wrapped the stump with his shirt, drove back to the house, found his wife churning butter, and waited for the ambulance. When the EMTs arrived, they found him passed out on the front porch. My grandmother had to be taken too, she was in such a state. </p>\n\n<p>I&#39;ve been told there was so much blood it formed a six-foot pool. Having gone to that porch my entire life, I can&#39;t picture grandpop laid there dying, blood everywhere. A huge hydrangea covers the spot he lay now. My grandmother insisted. </p>\n\n<p>The doctors had an easy time with the stump. The blood loss, though, had been significant. After a week in ICU, he finally woke. He told the nurse he had been dreaming of fighting a monster. </p>\n\n<p>Story goes she said, &quot;I think you won.&quot;</p>\n\n<p>&quot;No,&quot; he said, &quot;only made it mad.&quot;</p>\n\n<p>A few days of delirium followed with more ramblings about the monster. On his twenty-first day, they released him.</p>\n\n<p>When I was young, I remember him waving that two-stumped hump when he was mad. His face turned beet red. </p>\n\n<p>“The land takes back!” grandpop screamed at me once. </p>\n\n<p>Young and stupid, I had jumped from a moving tractor as it pulled a chisel plow behind. It almost got my leg on my tumbled landing.</p>\n\n<p>“Dammit, do you understand that, boy?&quot;</p>\n\n<p>My uncle and cousins laughed. </p>\n\n<p>Grandpop died when I was twelve. He had a heart attack working the fields. They didn&#39;t find him until well after dark. </p>\n\n<p>He was pulling that same corn picker.</p>\n</div>\n","author":"TMM306"}