{"rank":"20","title":"This story is 100% true, but it's taken me a while to organize my thoughts.","id":"8j15s8","url":"/r/nosleep/comments/8j15s8/this_story_is_100_true_but_its_taken_me_a_while/","time":"1526180972000","body":"<div class=\"md\"><p>This happened during my first summer off of college. I live in a city named Melbourne. It’s in Florida and it’s about an hour away from orlando. Orlando is one of the more larger cities and it’s a big touristy area. You know the kind with theme parks and junk like that. </p>\n\n<p>I get out of a relatively successful semester away at university, meaning I didn’t fail anything. Yay me. Semi excited to go back home to see my friends I had left behind, and filled with dread because of my parents pushing me really hard to get a job in the area until the next semester started.</p>\n\n<p>A few days into the break I catch a cough, and I’m all mucusy and gross. The time is around 11:30 or Midnight-ish, and I hit up my friend Kyle to go get food at Denny’s because they are open 24 hours a day and I had been tired of being cooped up. On a side note I’m a typical guy when I get sick I don&#39;t want to do anything, and everything aches, but for the sake of a good time, and to save my friend from his awful home life we go out.</p>\n\n<p>We get to the restaurant and everything up till this point has been normal, and it stays that way for hours. We eat our fill and chat shit with a couple of the waitresses. My friend is a regular there so they knew him better than me. They talked about his nintendo switch that we had brought in order to play mario kart to pass the time whilst we were waiting on our food. Though we never got to it, we simply played on our phones. We eat, pay, and talk shit about how one of our friends has their life flipped and totally together at the same time. </p>\n\n<p>Apparently he’s getting married, but his dad tried to kill someone on the highway while he was drunk driving...My small little town had some shit going on and it was fun to talk about. I ask my friend if he wanted to go chill anywhere for awhile just to talk and listen to music. He agreed and told me to follow him down the road for a bit after we left the diner. </p>\n\n<p>We do stupid shit on the road. Typical teenager stuff, you know racing pass each other and stuff just trying to get a little adrenaline going. Soon enough we get to this strip-mall parking lot that he explains after we park has this abandoned building he’s been confused about.</p>\n\n<p>We don’t think much about it for a while though. I get out of my car and enter his. We greet each other again and start goofing off and just playing on our phones once more. We have the new Post Malone album going and we are picking other songs just to show each other. Even a gem from One Direction...I know, I know don’t judge. </p>\n\n<p>We continue to talk nonsense and go on that dating app tindr. We are both just on it to judge people at this point, well at least I am. This friend of mine he’s kinda hopeless with girls so the best pick up line I heard that night was “Are you African? Because you’re a-freaking babe.” Pitiful I know, but I’m not going to shut down my best friend. But I do tell him that it’s shit, and he just tells me to fuck off and watch the magic.</p>\n\n<p>We get back on to the topic of the building and he starts his car back up. He says that we’ll just take a little look at it from the outside, not that we could get into it. We drive straight at it, and look at the parameter with his brights on. We just sat confused, and I offered that we could try and explore it one morning to find a way in. </p>\n\n<p>I don’t do exploring at night because that is how horror movies start yaknow.\n We start to head back to the parking area that had been my car’s home for a little while and notice some guy sitting on another car that is adjacent to mine, only separated by a couple trees and some empty parking spaces. </p>\n\n<p>My friend pulls in and we whisper to each other about how I plan to get into my car without making too much noise. I&#39;m not trying to get stabbed. This all happens within a minute or two. I get out of his car and quickly shut the door using my hip so that it doesn’t make a lot of noise. I begin to get into my car and pull out. </p>\n\n<p>My friend in front of me immediately calls and asks if I know where the guy went...I trail in my response, and am extremely confused “No I don&#39;t know where he is..” we both begin to freak out a bit because from what we could tell was that he wasn’t in his car. If it was his car. It’s near 3 A.M. in the morning so the fact that there was just some guy in an empty parking lot with us and we had no idea where he was. Was a big concern, luckily though I think we chose a good time to leave because as our separate cars approached the stop sign that led to to the main road I checked my mirror out of habit, and to my surprise I saw a figure emerge with something that shined from the parking lot lights in its hand. </p>\n\n<p>I can only assume it was a knife. I wouldn’t want to know what would have happened if I was even a little slower at pulling my car out, or even getting into my car for that matter. I don’t think it would have been that hard to run out at me with a knife. Regardless I’m safe, but I don’t know if I’ll be going to that parking lot at night just to hang out again...</p>\n\n<p>Part 2: <a href=\"https://www.reddit.com/r/nosleep/comments/8jq5f5/this_is_part_two_of_a_situation_that_ive_gotten/\">https://www.reddit.com/r/nosleep/comments/8jq5f5/this_is_part_two_of_a_situation_that_ive_gotten/</a> </p>\n</div>\n","author":"-MattCrag-"}