{"rank":"2581","title":"It Was Supposed to Be a Routine Medical Procedure","id":"8j167a","url":"/r/nosleep/comments/8j167a/it_was_supposed_to_be_a_routine_medical_procedure/","time":"1526181101000","body":"<div class=\"md\"><p>I do a lot of things I shouldn’t.</p>\n\n<p>Case in point: I kept practicing medicine after I lost my license. Thing is, money’s tight and bankruptcy won’t kill student loans. So I kept working in an unofficial capacity. Nothing major: consultations, minor surgeries and procedures. Eventually I got hired by an organization that pays me a fortune for my skill and silence. </p>\n\n<p>Yesterday, I was granted the extremely dangerous privilege of treating the boss’s daughter. This wasn’t a little girl. This was a fully-grown woman who’d spent her adult life protecting her father’s interests in Croatia. She was tough. The fact that she needed help – especially mine – should have been a clear indicator that something was very wrong.</p>\n\n<p>But her symptoms were pretty mundane. She couldn’t eat, complained of upper abdominal pain, threw up often, had trouble eating, and suffered a constant fever. I told my boss an endoscopy was his best bet. It’s not exactly my specialty, but I know more than enough to get it done.</p>\n\n<p>Or so I thought.</p>\n\n<p>See, routine endoscopies are supposed to take about twenty minutes. We were going on forty-five minutes, with no end in sight.</p>\n\n<p>For the tenth time, my patient moaned through a mouthful of scope and shifted.</p>\n\n<p>My nurse pinned her down. The esophagus is surprisingly delicate. One wrong move, and the scope easily punctures it. I’d already scraped the hell out of her trachea after she started thrashing around two minutes into the procedure. I’d already sedated her past the allowable limit. She shouldn’t have been close to conscious.</p>\n\n<p>After a minute she settled down again, still moaning. The nurse gently squeezed her hand.</p>\n\n<p>I pushed the scope further down. An inflamed nightmare of esophageal tissue filled the display screen. This girl was <em>sick</em>. Every inch of her esophagus was puffy. Pale, blood-rimmed lesions abounded. Some of the tissue looked gouged. Like she had a little lumberjack chopping away inside her.</p>\n\n<p>Toward the end we found a particularly massive lesion. A half-globe the size of a quarter, it leaked pus and runny yellow fluid. No wonder she’d had such trouble. It was an absolute miracle she’d managed to swallow anything solid at all.</p>\n\n<p>The patient jerked to the side. I momentarily lost control of the scope, which punched against the lesion. I froze, fully expecting it to rupture. If that happened, she could die.</p>\n\n<p>And so would I.</p>\n\n<p>But no.</p>\n\n<p>There - in clear view of the scope’s bright light – the lesion rose on several spindly white legs and scurried down the esophagus.</p>\n\n<p>The nurse gasped. I couldn’t even draw breath. </p>\n\n<p>The lesion repunctured inflamed tissue with all eight legs and settled down, leaving a large hole in its wake. That hole was too round, too neat, and far too dark. Blackness radiated from it. Perforations typically have a shallow quality to them. You can see the damage both within and around the perforation.</p>\n\n<p>Here, though? Nothing but an inflamed rim and total darkness. It might was well have been a black hole.</p>\n\n<p>Suddenly that swollen rim shifted, stretching and distorting. A glistening white dome bubbled from the hole.</p>\n\n<p>“Call an ambulance,” I said.  </p>\n\n<p>“We can’t.” The nurse looked incredibly pale under the lights. Sallow, exhausted. </p>\n\n<p>The white dome exited the hole on several legs and scurried up the esophagus. The patient choked and writhed. I held her down with one hand and pulled the scope up with another. “Call a fucking ambulance!”</p>\n\n<p>The girl kept thrashing, causing the camera to hit several lesions. They all got up and moved, revealing more of those terrible holes. </p>\n\n<p>No. Not holes.</p>\n\n<p>Portals.</p>\n\n<p>The scope’s retreating light illuminated dozens of white parasites erupting from the esophagus like termites from wood.</p>\n\n<p>“Call now!” I screamed.</p>\n\n<p>The nurse ran from the room.</p>\n\n<p>Finally the scope came out, long tube coated with a viscous mixture of fluids. The patient gagged up a flood of blood, pus, and watery yellow liquid. </p>\n\n<p>Then came the bugs.</p>\n\n<p>Enormous, white, quivering blobs, cascading over her chin, down the bed, and across the floor. I reared back, accidentally crushing several. They felt like water balloons under my shoes. They popped easily, sending insane geysers of glimmering white fluid over across the room.</p>\n\n<p>The patient’s stomach bulged dangerously. I could just see it: dozens of bugs congesting her tract, forcing each other back into her stomach. She was drenched with sweat and white as a sheet, of course; no doubt she was hemorrhaging internally.</p>\n\n<p>Her eyes drifted to me. Tears squeezed from the corners and dripped into her ears. Through her open mouth I saw a pulsating cluster of glistening bugs.</p>\n\n<p>All at once her jaw broke with a dim, wet crack and they exploded from her mouth, splitting the skin of her cheeks to ribbons. One hit my face and exploded, sending horrifyingly sweet liquid into my mouth.</p>\n\n<p>I ran out of the room and slammed the door.</p>\n\n<p>Long story short, I left town. Maybe I’m not giving my boss enough credit, but honestly I know him pretty well. He trusted me with his daughter, and I let her die. The specifics won’t matter. If he finds me, I’m dead.</p>\n\n<p>It’s all right, really. These are the risks you take when you do what I do. At least I have money. I’m actually looking forward to my freedom. Or would be, if it weren’t for one thing.</p>\n\n<p>My stomach hurts. From gut to shoulder, everything aches. And I can’t keep anything down. I keep thinking of the bug that exploded on my face, of the fluid that got in my mouth.</p>\n\n<p>I already know an endoscopy won’t help. Not like I could get one anyway, given the circumstances. Sometimes chest and stomach pain are delayed stress reactions. I hope that’s the case.</p>\n\n<p>If not, guess I’ll have to content myself with a can of bug spray.</p>\n</div>\n","author":"Dopabeane"}