{"rank":"330","title":"I think I found a warning message being broadcast from deep in outer space","id":"8j1ec8","url":"/r/nosleep/comments/8j1ec8/i_think_i_found_a_warning_message_being_broadcast/","time":"1526183684000","body":"<div class=\"md\"><p>I don’t care if I get fired for this.</p>\n\n<p>My name is Colt Richards, and I work for a sub-company of NASA. Our primary objective is to find signals that emit from different zones in space, track their origin, and evaluate their significance. If whatever we may find is important enough, it’s documented as such and transmitted to NASA for further examination, per our protocol. If not, we document its existence and log the information at our HQ. Regardless of where it goes, we’re tasked with maintaining eyes until it’s no longer deemed worth it to do so. Everything we receive, examine, and vault here or dispatch to NASA is top secret and only ever seen and heard by government officials as well as our team.</p>\n\n<p>That’s always the case. When we follow protocol, that is.</p>\n\n<p>Yesterday at some ungodly hour of the night, me and a member of my team uncovered something, for lack of a better description, pretty fucking significant. However, it’s something we fear will be tucked away and covered up, and we can’t risk this being ignored or let fade into the uncharted corners of space and out of the minds of those it reaches.</p>\n\n<p>So, we won’t. We have archived the information under the table and transposed it to be viewed here. Whether or not you believe us doesn’t matter as even if you did, we have no idea where to go from here.</p>\n\n<p>To provide context, the “signal” itself was a broadcast, and it was extremely weak. It came from the border of our galaxy, a corner of space so dark and out of the way, you wouldn’t know there’s anything there unless you were looking for it. Or got lucky. When we found it and did some things I won’t bother explaining to strengthen the signal and track it, we realized it was on a loop. That’s what inspired us to look further into it, and... I’m not sure if we should regret that decision or not.</p>\n\n<p>I’ll let you read the log, which we have typed up and saved copies of in case this is somehow found and taken down.</p>\n\n<hr/>\n\n<hr/>\n\n<hr/>\n\n<p><strong>&lt;&lt;&lt;&lt; BEGINNING OF TRANSMISSION &gt;&gt;&gt;&gt;</strong></p>\n\n<p>[[ <em>All information below in italics/bold are our own notes taken to explain where the signal is inaudible or what noises are heard in the background. Everything in normal print is verbatim from the broadcast</em> ]]</p>\n\n<p>Mission Report:  Nineteen - Oh-Three - Eighteen.\nSierra-Charlie-Roger 001</p>\n\n<p>Date: Nineteen. Oh-Three. Twenty-Eighteen. \nEstimated based on date displayed whenever the system froze, which was roughly 2-3 days ago. \n<em>(19/03/2018 ; March 19th, 2018.)</em></p>\n\n<p>Time: Unknown. Clock on the HUD in the mainframe frozen on 15:37, and has been since the attack.</p>\n\n<p><em>short pause. Low, labored breathing slightly audible. Signal too weak to separate from background static.</em></p>\n\n<p>I can’t fucking believe this. I’m throwing this into space hoping NASA receives it, but to whoever may catch this metaphorical message in a bottle elsewhere, my name is Axton Drake and I was put in space with a -<strong>static</strong> -eople to research the eff- <strong>weird high pitched whine interfering with the signal</strong> -ndings.\n<em>he begins to speak through sobs/sniffles</em>\nThey’re dead, GC <strong>[Ground Control]</strong>. All 7. I should be too, but I survived when they struck, and not in a way I’m proud of. These things, they don’t belong here. On this trashy shit show of a ship. And certainly not in this WORLD. I don’t know what the fuck we were thinking, or why we e- <strong>garbled</strong> -ith the fucking DNA.\nWhat did we think would happen, huh? Did we think we could just play god? That we could just-</p>\n\n<p><em>signal interference</em></p>\n\n<p>-iens? It fucking- ...\nIt doesn’t matter. Everybody is dead, and by the time somebody finds this broadcast, I will be too. We aren’t to blame, Sarge. You put us up here because you, and your pathetic fucking excuse of a scie- .. st-</p>\n\n<p><em>signal interference ; garbled, fragmented sentences. something about stem cells and mixing and separating DNA ; forced evolution (loose interpretation based on rough pieces)</em></p>\n\n<p>-ime in the limelight with what you branded as the “greatest breakthrough in scientific history” to the government so they’d fund the rest of your unfinished psychotic experiment. You hadn’t even confirmed any numbers you conjured up for these.. these things. Yet you still went and put eight of us on a dinky metal death trap designed for three and shot us into the sky. And now our blood is on your hands. The worlds blood is on your hands.</p>\n\n<p><em>horrible, indistinct, non-human shrieks ? audible in background. Banging begins; starts weak and nearly silent, slowly increases in intensity.</em></p>\n\n<p>They hear me speaking. They can hear my fucking thoughts. Your lovely little fucking chimera things exceeded what your poorly executed calculations and estimations could have ever predicted, and now we have to suffer, but y’know what?</p>\n\n<p><em>the banging almost overpowers Drake’s voice, and you can hear whatever barrier is in place beginning to give with each blow.</em></p>\n\n<p>So will you.</p>\n\n<p>As I finish this and say my goodbyes, I’m programming this piece of shit to use every last bit of its power to perform a charge in Earth’s direction. With what’s left of the control panel, the garbage artificial intelligence you slapped into this rust bucket estimates itll reach the surface in a <strong>static / interference</strong> months. </p>\n\n<p><em>creaks and sudden clarity in the bloodcurdling screams outside the room portray a break through</em></p>\n\n<p>They’ll make it.</p>\n\n<p>Good luck, Sergeant Luther.</p>\n\n<p><em>crash explodes in background ; metal clang as something smashes off a hard surface [possibly a door/air lock of some sort] as footsteps approach</em></p>\n\n<p>You wanted to play God.</p>\n\n<p><em>painfully inhuman noises begin engulfing the room</em></p>\n\n<p>Now he’s your only hope.</p>\n\n<p><em>screaming consumes 5 of the remaining seconds in the transmission. squelching, crunching, and grunts are the only decipherable noises for the final 20.</em></p>\n\n<p><strong>&lt;&lt;&lt;&lt; END OF TRANSMISSION &gt;&gt;&gt;&gt;</strong></p>\n\n<hr/>\n\n<hr/>\n\n<hr/>\n\n<p>Normally within the first few seconds of the message, we would decide to send it straight to NASA and let them hear it and decide what to do with it.</p>\n\n<p>But there’s a problem.</p>\n\n<p>We haven’t found any documentation for Axton Drake, the research or mission he was assigned to, his 7 colleagues, or a Sergeant Luther anywhere in NASA’s database, which, granted, we have limited access to. And we can’t ask them because then we’d have to explain why we know about this, and it would lead to an investigation. But, that’s the least of our worries right now. You see...</p>\n\n<p>Drake says the date at the start of his log. Now, I don’t know if your systems are functioning correctly, but mine are.</p>\n\n<p>And as I’m writing this, today’s date is May 14th, 2018.</p>\n\n<p>I don’t think we have much time.</p>\n</div>\n","author":"rxmarK"}