{"rank":"72","title":"The Changeling","id":"8j1ffv","url":"/r/nosleep/comments/8j1ffv/the_changeling/","time":"1526184025000","body":"<div class=\"md\"><p>We had known, Mama and I, that he was different even before he was born.</p>\n\n<p>First were the convulsions that tugged and ripped at Mama’s stomach. Mama gritted her teeth and told me she was fine, not to worry, and to bide the time she counted prime numbers on a wooden chair, with her spindly-veined arms embracing her abdomen. But I knew better than to believe her, as I did ever since she told me Papa was still alive; I could see the little stretch marks around her belly button and the strange pulses that rippled through her muscles.</p>\n\n<p>I asked if I should go visit the village doctor and tell him to come here, and she grabbed me and hugged me so tight it seemed like my lungs were going to break out of the little cages that surrounded them. Mama said no, the fairy king gives as he will and if the foul-mouthed doctor ever interfered with her home life she would die before his decrepit hands touched her bare skin. I showed her my pearly whites and tried to protest laughingly, but I saw the blood that was stitched in her eyes and heard her ragged gasps for breath and decided not to say anything more.</p>\n\n<p>My Mama was always a bit crazy. She had mild, mousey brown hair and eyes like thunderstorms, crackling fires underneath her irises. She liked to tell me that she was nature, and when I asked her why she would point a swirling fingertip at her skin and show me where the bright green mosses set in, where they faded into barren grape vines, and where life ultimately deserted the stone cold marble in the curves of her shoulders. Ever since I was little she would tell me she fell in love and got cursed by a monster.</p>\n\n<p>Yet when I inquired Papa if he was a scary person, he would laugh a high, shrill sound that pierced through the nine layers of the sky and made its way to nestle among the stars. Although I can’t remember much else about him, Papa had a beard he said was full of speckled cuckoos that would sing for me at six o’clock, earthy clay skin, and sinews that were high-strung and taut, just like the fiddle he’d play for Mama before bedtimes. Mama would laugh and then cry as her little feet took minced steps upon the polished floors, tiny ants that were forced to curve every which way at the prospect of good food. The speed of the fiddle music and the nimbleness of Mama’s feet all amazed me as I enjoyed the thrill of my late night escapades, my bare toes digging into the wooden boards, my wispy nightgown ruffling at the edges.</p>\n\n<p>When she was seven months in, Mama told me about a strange dream she had a couple moons ago. She said that the fairies had come from the other side of the mountain and snuck into our log cabin fleet-footed. She told me that they surrounded her bed, strident laughs reverberating across the ceiling, and ripped a blood-covered fetus out of her belly. Their leers shone in the night as they forced a monster with a tuft of fiery hair into her womb, stitched it back up, and flew out the door. Mama had told me stranger tales before, and I said I wasn’t much scared, but as she weaved my straggly brown hair into a neat braid and clipped one of her best tortoiseshell flower pins on it, I couldn’t help glancing at her bun, at the dull wheat-embellished mane that struggled to come out of the strings binding it, and shiver a bit inside. She didn’t notice my watchful eyes as she mumbled “two, three, five, seven” and told me to tally along with her. I joined in, and she smiled and told me counting was a sort of comfort to her.</p>\n\n<p>What she didn’t tell me was that one summer night many moons ago where the crickets chirped symphonies in the forest, after Papa was drunk lying on the floor, she muttered something like her usual rhyme and brought his tree-cutting axe upon his own red-throttled neck. Too afraid to let her see I was still awake this late, I retreated from my position peeking behind the door. I never knew what happened afterward, and I never asked her about it, either—she liked to dump bits of lies that look like fluffy clouds in my head. After all, when I asked her where he was, she said that Papa was a fairy and went far, far away to visit his kin because he had done something very bad. Burrowing my head into her lap, I told her I didn’t believe in fairies, and she ruffled fingers that grew like cornstalks on her hands over my hair and said that sometimes, the things you don’t believe in are the ones that are the most real.</p>\n\n<p>He was born redheaded. We named him Louis.</p>\n\n<p>When he was three we went out to pluck daisies to give to Mama. I carried a little straw basket and held him by the hand, making sure not to let him step in the muddy waters of winter slush. For the first three years of his life Mama had been scared to let him out of the house. She said the hairy sycophant of a doctor was not going to steal any of her fine silver just for praising the boy over and over, but of course I thought she meant something more, just like she always did. Louis just stared at her with those big moon-shaped eyes of his, little freckled hands turning the ring on her little pinky and trying to pull it off. Mama frowned and slapped his hand gently away. Then she told us to play outside, put her lips to the side of my head and ran her words through my ears like a will-o&#39;-the-wisp: take care of the child. Shocked she would trust his life in my hands, I nodded slightly and threw open the oak door.</p>\n\n<p>He wobbled hesitantly behind as we streaked down the hills and brushed our hands past the wildflowers. Laughing, I grabbed bushels of cornflowers and let the sun wash over my hair. Suddenly, I heard Louis flop down. He had a butterfly cupped in his hands. I breathed a sigh of relief; he wasn’t hurt. Then I heard him speak his first words.</p>\n\n<p>“Two, three, five, seven,” he muttered. Then his lips downed upon the creature and I saw fresh blood gushing out of his teeth.</p>\n\n<p>I never told anyone about it.</p>\n\n<p>When he was five, Mama informed me that all the boys had to go to school and if they didn’t the nearby village would spurn them forever. She asked me in her always quaint little ways to bring a bag of freshly cooked bread down to the elders as a gift. I took Louis by the hand and we walked single-file on the cobblestoned roads that led to the tiny swirls of smoke in the distance.</p>\n\n<p>Although the town was called Cliffsville, nothing lower could be seen in the miles of spiked mountains that surrounded the town. Lush curtains of ivy peeled the mortar off the brick walls, and clumps of morning glories welcomed our new faces as they spilled out from hanging baskets. Several of the older women came over to welcome us, gathering our little bodies into their bulky arms. I couldn’t help but wonder that if Mama could lift such a heavy axe, how many tree cutters could these ladies wield? Louis just smiled a sunny smile at them and trailed trippy-toed behind me, peeking out from my back when the elders came out from their dens. My hands shoved the soft bread at them, and as I stared down I noticed their shriveled hands clawing to wrench it to themselves. I couldn’t help but snicker as a fly landed on one of them and started rubbing its filth on the hairs of his knuckles.</p>\n\n<p>Then, before I could turn around, I heard Louis say “two, three, five, seven” and all hell broke loose.</p>\n\n<p>They banished us from the village with cries of “monster” at Louis. Half crying, he snuggled into my arms and bawled, like an innocent little child, except I knew he was anything but innocent. My own pale fingers swept through his bushy hair and I whistled a little tune to him. Oddly, it sounded a bit like the crickets that one night, trying to stir up a soothing atmosphere in the distance before Mama broke it.</p>\n\n<p>We went home with our heads down that day. I couldn’t explain to her how Louis had pounced upon the villagers like they were vermin, ripping the tendons out of the doctor’s hand—at least I think it was him, with breath smelling like asparagus fern and skin that grew from the ancient tree roots themselves—and hurling his face at the others. Strangely, Mama didn’t ask, and I could only watch as she told Louis he carried in the family’s footsteps and he was truly an apology from Papa.</p>\n\n<p>I also noticed she never looked at him the same afterwards.</p>\n\n<p>When Louis was seven, his teeth began to ache badly, and strands of red fuzz began to appear on his chin. He looked so much like Papa, except his hair was a poppy in our family fields of dried corn. To ease her troubles, sometimes Mama would force us out of the cabin and tell us to run along outside, but as I streaked past her mouth I would hear: don’t follow him, Sarah, if you know what’s best for you. But of course that passed through the other side of my ear because Mama had been pouring gibberish into my head ever since I was little, and of course I couldn’t change my ways. I would grip the waist deep grasses in my calloused hands as I now trailed him from behind, instead of him after me.</p>\n\n<p>First it was the ants and the bees. Then I saw rat entrails bloodying the soil, covered in silvery flecked fly wings that struggled to lay their offspring on the most fertile parts. After were the hares, tufts of white fur and bones that I buried and decorated with the smooth stones from the river. I packed soil over the remains and prayed their souls would find a way out of Louis’s stomach and go to the heavens someday.</p>\n\n<p>After that, there was nothing at all, except for the spring rain that washed over the muted amalgamation of blood red and dirt brown.</p>\n\n<p>To supply our family with nutrients, I planted and grew our potato crops but ate them myself. Mama ate nothing, protesting that plants could gather light just by bathing in the summer sun. Indeed, her skin seemed to leech off the stray rays peeking from behind the curtains and turn into a greenish tint, replenishing what little color she had in the winter. Of course, Louis would eat nothing at the dinner table at all, preferring to sigh longingly at the fields that waved at us beyond our houses. After the village incident, Mama seemed to like Louis much more than before, but when I asked her why, she just smiled mysteriously, the forget-me-nots of her eyes blooming as she told me that Papa’s friends were sorry for his misconduct and they had sent us a present to go along with the main dish. She said “present” slowly, the words leering as they bit through her teeth, almost as if she were saying the word “sacrifice”.</p>\n\n<p>But I never viewed Louis as a present. He was eating foxes now, and he had ditched his habit of swallowing whole for only eating the more satisfying pickings; he would leave tendons scattered around for the crows to pick up, and as they flittered around his meals I didn’t dare to go near them. Mama had once told me a fable about three crows and how they tricked a tree spirit into falling in love with an ogre, just because the spirit crossed their path. I wanted to protest that only black cats did that and I didn’t believe in superstitions, but then I remembered that the things you don’t believe in are the ones that are the most real.</p>\n\n<p>Or was it “the things you don’t want to believe in”?</p>\n\n<p>For some reason my brother’s strange choice of food also extended to the Cliffsville dogs—I guess he was onto canines now. I dropped by one time, careful to veil my face with one of Mama’s cotton kerchiefs, and I heard the stocky women gossiping about a wild animal stealing their guard dogs. And even though years had passes since Louis bit their oh-so-precious village elders, they were still angry at us.</p>\n\n<p>“The little house in by the fields is haunted,” they whispered at the passerby. “Especially the monsters they lock up in there. We had two that escaped into our village, concealing themselves behind the masks of little children.”</p>\n\n<p>I didn’t stand up for Louis. He wasn’t the only strange one in our family. The little ribcages in my body had grown bigger now, to fit the organs that pulsated and squeezed and pushed and tried to get out, but their captors were always one step before them and one size above them. I couldn’t break them by force either, because even though they were so brittle—like bird bones, Mama had said—they were still a part of my body, and my lungs couldn’t swell enough to burst out and shrink enough to slip through.</p>\n\n<p>I wanted to fly.</p>\n\n<p>I remember asking Mama when I was small why the sparrows, flecked with bits of brown and black, could swoop and soar and flap so freely, while I was bound to the ground so unfairly—I didn’t wish to stare longingly at the sky and watch while they, who had done nothing to appease the fairy king, got to touch it every day. Mama chided me, explaining that the roots which let her live in the ground gave her plenty of nutrients, that she was grateful they held her tight and didn’t let her blow away to some foreign country.</p>\n\n<p>“And you, little one,” she grinned at me, but the light made it seem more like a mocking sneer, “should be happy that the little jailhouse in your skin doesn’t let you get away.”</p>\n\n<p>I shiver to remember it all.</p>\n\n<p>Quietly, I make my way up the side walls of the house, my bare feet scraping against the fallen oak boughs, brushing past clumps of wild grapes that swarmed parasitic over dead organic material and gripping any indents that allowed my toes to dig in. The smooth slate tiles on the roof feel warm to the touch, and my cotton dress swirls as I look up towards the clouds.</p>\n\n<p>One bird appears, spreading its brown wings east and west as its long obsidian draped neck points directly south. Then two more flank its sides, then another two. I watch as the whole flock swooshes past the clouds and form a neat arrow. I want to go with them, past the fields of wild grasses, past the village that shuns us, past the glittering seas, south. I want to leave Mama and Louis, to show Mama that I am more useful than Louis when it comes to staying by her side and pleasing her, and try to be a bird. But Mama had once informed me about my chains that bound me to the earth, just like her golden-brown hair struggling to come out of straggly strings in double-knots, and who was I to disbelieve?</p>\n\n<p>Then again, Mama had also filled bunches of clouds into my head, so I should be light enough to make up for the artificial heaviness.</p>\n\n<p>It is autumn, the season where plants die without a shred of former glory, animals hide themselves up, preparing to brace the harsh winter howls, predators suffer as they try to catch the stray tidbit that come their way, and the Aves class ruffle out their feathers, whether real or fake, to go south. And who was to say my feathers weren’t real?</p>\n\n<p>I take a deep breath, spread my arms out, and jump.</p>\n\n<p>All the while counting prime numbers. Mama would’ve been proud of me.</p>\n</div>\n","author":"herpeetyderp"}