{"rank":"11","title":"“Him”","id":"8j1grt","url":"/r/nosleep/comments/8j1grt/him/","time":"1526184460000","body":"<div class=\"md\"><p>So I have a story that my friend has finally let me say</p>\n\n<p>This story starts off 3 years ago with my friend, she is in grade 12 and I’m in the 9th grade. She was dating some guy for about 6 years since middle school. Let’s name this guy Danny. Danny had black hair, brown eyes, and ,essentially, was a bum. </p>\n\n<p>They always hung out with each other during every part of the day, whether it be in the morning, during lunch, and even in each other’s classes, but when she isn’t with him she acts more normal than when she was with her boyfriend.</p>\n\n<p>One day, during lunch, I noticed that she had a cut on her forehead. It was as if someone got a knife and made one complete swipe with a semi deep laceration. I also notice her boyfriend conveniently was not with us. So as a sensible person, I asked “What happened?” The only response she said was “Oh, it’s nothing.” It was so obvious that it was a cut from a knife, but I didn’t know what to do, so I didn’t get involved.</p>\n\n<p>A few days later, she isn’t at school. I asked her boyfriend and he says “She had to go to the hospital.” I become wide eyed and shocked without words for like 5 straight seconds. I finally replied with a tone that could only be described a screaming “WHAT HAPPENED TO HER?!?” He says “She got in a ‘fight’ if you catch what I’m saying.” I once again screech at the top of my lungs “ WHAT THE FUCK DID YOU DO!?!” He tells me to shut the hell up or else. At this point I know something is definitely up, I also know that her parents couldn’t be up to this whatsoever, only for the fact that her parents are business people, and they travel the country everyday. Now, like I said, I was in the 9th grade, and I didn’t don’t know what the hell to do except keep quite.</p>\n\n<p>She comes back in the next two days with cast on her arm. I try to keep cool while asking because her boyfriend was with us. I asked “Hey, what happened to your arm?” She responded in an unsteady voice “I f-fell off of, uh, ladder.” I’m literally shitting myself because her boyfriend started to stare at me with a fiery look that could’ve melt pure tungsten.</p>\n\n<p>She comes to me the next day scared and anxious. She looks around herself in a suspicious manner. She starts to mumble something to me way too fast for me to understand. I tell her to speak slower. “I have something important to tell you!!!” She starts up again “I broke it off with Danny!!!” I replied “That’s fantastic!” She starts to talk once more “I’m not done, he proposed to me! I didn’t want to marry him so I said no to him and he paused for like a few minutes before jumping out of my window!” I paused for the fact that I didn’t process what she said. She starts talking again “I know, right? And when I looked out the window, he disappeared, it’s as if he turned into a ghost!” I’m still appalled that he proposed to her. The bell started to ring so we both went to our classes.</p>\n\n<p>The next 4 days she’s not at school. I start to panic. Neither my friend nor Daniel are at school. I start to think the worst. Like “what if she’s dead?” And “what if she was killed by Daniel?!?”</p>\n\n<p>Eventually, she came back. You wouldn’t know the actual relief I had when she came back. Before I could say anything she starts to talk. “Hey, uh, can you come over my house today?” This is the first time she has invited anyone, besides her now newly ex. I almost said no, but then I thought if she really need to start inviting people to her house, then she must be in some shit. I said I would be there as soon as I could.</p>\n\n<p>After the school day ends, I go home and asked my parents if I could go over her house. My parents, not knowing what was actually going on, started thinking I was dating her. Long story short, they said yes. Before I leave, I pack a few things. Those things being a few water bottles, a bat, my phone, my wallet, a pillow and blanket, extra clothes for the next day, and a flashlight. </p>\n\n<p>I start to walk to her house at 5pm. She lives an hour away. It’s 5:23 and it’s getting dark already, so I start to sprint to her house. I make it around 5:50ish.</p>\n\n<p>I knock on the door and to my surprise, an elderly lady who I can only assume is her grandmother opens the door. I tell her who I am and that my friend invited me. She says “Well, it’s new for her to invite friends from school. Please, make yourself home.” I walk in and the inside of her house is almost pure white. The carpet to the walls to the paintings, everything, except the door and the stairs, both being a dark oak look. The elderly woman also adds that her parents aren’t home, which didn’t surprise me.</p>\n\n<p>The presumed grandmother shows me my friends room. First thing my friend does is she hug me, which is her way of telling people she is terrified. We start talking and this is basically what she said, 1: she feels like she’s being watched and 2: she really only trust me at this point. I unpack my stuff. Thank god she had a mini fridge where I put the water bottles in.</p>\n\n<p>It’s 12am, my friend has finally gone to sleep, I’m in the corner of her room, still awake and drink cold bottles of water to stay awake. I only managed to last up to 2am. I’m as fast asleep as my friend, maybe even more. Suddenly I wake up to find a long and dark figure latches on to the bed frame. I shout out of pure shock and my friend wakes up because of me. The figure scurried out the window. Right before it jumped out, I grabbed my light to see what it was. Nothing. Absolutely nothing. Almost as if it wasn’t there.</p>\n\n<p>Me and my friend are more awake than a gallon of pure caffeine. She’s holding on to me so tightly. Suddenly, a crash of glass breaks, it’s from downstairs. Me and my friend gear up. She grabs my light and I grab my bat. We sneak down the stairs making our footsteps quite.</p>\n\n<p>We make it down the stairs with no noise. Sadly enough, the worst part has yet to come. Everything was silent, we so quite, but suddenly a loud screech occurred. If you have ever heard heard nails and chalk boards, you know what I’m talking about. I tell my friend to give me the light so I can check, so I took the light and she took my bat, but it was much horrific than you’d expect. Her grandmother had been torn up and bloody with an unsteady breath. I find the light switch and turn it on, the lights beaming as bright as an operating room.</p>\n\n<p>My friend starts to cry and call for her grandma, “Grandma? GRANDMA?!? STOP FAKING, PLEASE!!!” Before we knew it, she was dead.</p>\n\n<p>It’s 6am, my friend is weep immensely over her grandmother sudden death. I told her we have to get out of the house. Though she resisted at first, we start to run out towards the front door. I start pulling at the door, not realizing it was locked. Though the door was locked, I broke it open with ease, probably from the adrenaline storming throughout my body.</p>\n\n<p>Outside, we’re greeted with the black figure once more, but this time I was ready, yet I was setback only for the fact of what I saw. It was Daniel, he was coated in a thick black substance later found out as ink. He was completely bare ass. He also had shards of glass in his back and arms. He is clearly on all fours, almost as if he turned full ape mode. He started to screech just like the screeching from before, but this time he started to charge at us. I looked for the bat that I brought, but my friend left it inside when she was grieving.</p>\n\n<p>He charges at the fastest speed I’ve ever seen anything, let alone anyone, sprint, especially since he was on all his limbs. I push my friend to the side as hard as I could while jumping over this newly made animal. He crashed into the wall leaving a giant head sized hole.</p>\n\n<p>I tell my friend to start sprinting towards my house. Now this was difficult only for the fact that she doesn’t know where my house is, and I have to also make sure she isn’t taken by “him”. Now, this was also in Arizona, so instead of low fencing, it’s huge stone fences. We start hopping as fast as we could, but it only slowed us down because of my friend’s arm. I told her to just go on the road, because if someone was to see us they could possibly help us. We on are almost at my house, sadly enough no one was on the roads. We finally to my house, but I soon find out that I forgot my keys. I decided that we try to lose him.</p>\n\n<p>We ran around the whole neighborhood but he still followed us, screeching as he usually was. It’s around 7am and we get cornered, no exits, just a big corner of bricks and stone fencing. I knew this was it, we were screwed. He starts to slowly walk towards us. I was shitting myself once more. Suddenly, multiple bright lights broke the dawn light. It was the police. A police man said “ back away from the kids.” “It” still was facing at us and started charging while giving a screeching of victory, this screech could’ve probably broken plexiglass. This was it, do or die, the beast of nightmares was about to maul us with his teeth and the glass stuck on to him, the police had only one option.</p>\n\n<p>I closed my eyes so I wouldn’t have to see our demise, but all I heard was bullets firing towards us, as if the police wanted us dead. “His” body flew at us but with the exception that he stopped moving. I open my eyes to see a lifeless corpse, laid there, as we clenched our every muscles.</p>\n\n<p>When the hit had settled the police told us “He” is a psychopath, but it was hard to tell. He has apparently killed 20 people already. He apparently lures his victims in a state of insecurity and then abusing and torturing them until he would finally kill them. My friend was a potential victim. She was still grieving her grandmother’s death.</p>\n\n<p>Everyday after that, i supported her until she graduated. And here I am 3 years after, in 12th grade myself.</p>\n</div>\n","author":"Im_Nino"}