{"rank":"440","title":"A Late Night Conversation","id":"8j1kt5","url":"/r/nosleep/comments/8j1kt5/a_late_night_conversation/","time":"1526185815000","body":"<div class=\"md\"><p>It’s been a long day. Midterms are done for the students, which means they’re just starting for me. I only managed to finish grading the papers for my Intro to Archeology class at 9:57 p.m. It was brutal work. I need to remember to add a new section in the syllabus on writing papers: If you are typing up your paper and you see a squiggly red or blue line under a word, <em>please accept your word processor’s help</em>. Those lines appear for a reason.</p>\n\n<p>There is already a very lengthy section about proper citation, so the infamous red pen was just slashing through anything Wikipedia or Yahoo! Answers related.</p>\n\n<p>For a moment I just sit in my silent car, staring at my house with a mix of longing and loathing. Food, shower, and my bed, that’s all I want. But I know he’s waiting inside for me, ready to show me his own special brand of attention. With no other good choice, I sling my bag over my shoulder and slide out of the car. From the box in the backseat I grab a slender gray aerosol can. I untangle my keys as I head for the door. The lock is turned, the can is clutched in one hand, and I take a deep breath before shoving the door open.</p>\n\n<p>Hot, moist air rolls over me, carrying with it a sickening scent of sulfur and dying flowers. My stomach heaves slightly but I manage to control it. I thrust my arm over the threshold and let loose with a heavy spray from the can. For a moment there is a battle between the rancid breath of hell and tropical breeze air freshener. My finger stays firm on the trigger, sending in an ever-greater deluge, and finally pineapple and coconut drive back the reek of hell.</p>\n\n<p>I step inside, kick the door closed, and drop my bag and half-empty can of air freshener onto the table.</p>\n\n<p>“I’m home!”</p>\n\n<p>A hacking cough is my only greeting. He’s curled up on the couch, both hands over his face, and he is letting me know in no uncertain terms that this new brand is not up to his standards. If it weren’t for him I wouldn’t have to use enough aerosol to burn my own personal hole through the ozone layer daily, so screw him. As he puts his head down on his knees for even greater dramatic effect I pick up the shredded remains of today’s mail.</p>\n\n<p>“You better not have destroyed anything important,” I warn him. “Remember when the house was going to be inspected?”</p>\n\n<p>The coughing is giving way to heaving gasps.</p>\n\n<p>“You tore up the notice and left it all over the floor, and I didn’t have the time to put it back together, and we had a stranger show up unannounced to <em>search our house</em>.”</p>\n\n<p>Pathetic wheezing sounds are all I get in return. I roll my eyes as I try to fit three pieces of envelope together. It will take forever to completely recreate the entire thing, but if these go together then I can possibly make out the logo in the corner. Is that for the electric company, or…?</p>\n\n<p>“What would you have done if that woman had managed to get in here? We didn’t have a gas leak, but what was actually giving off that smell was a whole lot weirder. Is a whole lot weirder. She could have called her superiors or the police and we would have had to move house, again. And there would have been days, maybe even weeks, in a <em>hotel</em>. What would you have done if she got in here and saw you?”</p>\n\n<p>“I would have eviscerated her with my teeth, wore her guts for garters, and then danced a cancan on your kitchen table,” he snarls at me, finally abandoning his melodramatic death throes. “In your favorite black high heels.”</p>\n\n<p>“Ass,” I mutter under my breath.</p>\n\n<p>He slumps back onto the couch and proceeds to sulk. When I ignore him and make my way into the kitchen I can hear him clumsily scrambling to his feet to follow me. Everything he does is clumsy, but that can’t be helped. With three inch razor sharp claws on his hands and feet, his body is not made for modern furniture. He’s also hell on hardwood floors.</p>\n\n<p>The refrigerator door is closed, but still I eye it with uncertainty. I have found things in that refrigerator before, things that should not be in a kitchen…at least not in that many pieces. There has also been an unnatural amount of food spoilage, and one particularly exciting evening there was food reanimation. Try explaining to your boss that you can’t teach your 9:00 a.m. class because of a ham related injury.</p>\n\n<p>“Where have you been?” he grumbles behind me. “It’s late.”</p>\n\n<p>Before approaching the refrigerator, I carefully pick up the long carving knife. My other hand dips into the drawer that never closes properly and comes back with a pot lid. Thus armed, I advance on my target.</p>\n\n<p>I can hear his unhappy hissing, then the sound of claws clicking together. “That was not a rhetorical question! It’s rude to blatantly ignore other people!”</p>\n\n<p>The stainless-steel surface is cold to the touch. Good, it’s still running. I manage to maneuver my pot lid so that I can use that hand to open the door. I fling it open and leap backward, my knife at the ready and a wordless shout of defiance echoing through the kitchen.</p>\n\n<p>All is quiet in my refrigerator.</p>\n\n<p>“Feel better?” he asks.</p>\n\n<p>“Considering that I need to sniff everything I take out of here, no, not really,” I tell him. “Normal people don’t have to approach everything in their own house like it’s a potential hazard.”</p>\n\n<p>“What if I promise I didn’t do anything to the food at all?”</p>\n\n<p>Pivoting on my heel, I merely stare at him with one raised eyebrow. He shrugs and folds himself onto one of the kitchen chairs. Arms crossed over his chest, he tries to affect a pose of indifference. But it doesn’t work. It never works when he tries to mimic human stance. It’s not his lack of humanity that makes me turn away so quickly, though. It’s the way he…bends.</p>\n\n<p>Have you ever seen a hypercube?</p>\n\n<p>Of course not, it’s a four-dimensional object that can’t be properly observed by our three-dimensional human brains. But, you might have seen a computer model of it in class or on YouTube. If you haven’t, imagine eight cubes somehow fused together into one single object that looks like cubes within cubes. Now imagine rotating it. As it turns, though, it seems like it’s somehow passing in and out of itself, turning inside out without any kind of possible end. Lines and angles don’t behave the way we think they should. This object is twisting and turning in a way that our minds just aren’t capable of handling.</p>\n\n<p>Now add four limbs, some claws, some big teeth, and what might be hair or tentacles on top of a freakishly round head and you’ll have a very vague idea of what my “roommate” looks like. Staring directly at him for more than a minute gives me headaches, and that’s on a good day. After hours of reading through poorly edited and improperly cited papers, I just can’t handle geometry that extends beyond three dimensions.</p>\n\n<p>Even when I won’t look at him, he won’t be ignored.</p>\n\n<p>“It’s late,” he tells me again. “Where have you been?”</p>\n\n<p>The package of roast beef seems safe, as does the Havarti cheese. I grab these and a loaf of bread and head towards the counter.</p>\n\n<p>“You know we aren’t married, right?” I remind him as I build the sandwich. Both slices of bread are carefully studied. “I don’t have to tell you where I’ve been or what I do. Actually, if we were married I still wouldn’t have to answer questions barked at me like that.”</p>\n\n<p>There is the slight screech of his claws digging into the table in his frustration. He’s been spoiling for a fight for weeks now out of boredom, but I never give it to him. My studied indifference rankles him, and that puts a smile on my face for the first time all day.</p>\n\n<p>“I didn’t ask for this, you know,” he says. “This is not what I wanted when I woke up that morning. You think you’re the only one who didn’t expect their life to turn out different?”</p>\n\n<p>With my back to him, he can’t see me roll my eyes. This is far from the first time he’s given me this diatribe. I could recite it along with him. I did, once, but then he was hell to live with for a week. So I take my first tentative bite of my sandwich and let him continue.</p>\n\n<p>“You get to live where you’re most comfortable,” he continues. “You get to go to work with people like you, and everyone on the street is like you, and even that nosy bitch who thought I smelled gassy is like you! I don’t get to have that. When was the last time you think I saw someone who looks anything like me?”</p>\n\n<p>“Well, there was that thing that came out of the lake and carried off those two frat boys. I know it stopped here when it was dragging them…wherever it was going.”</p>\n\n<p>He shifts behind me, the chair groaning as it tries to support whatever perversions of geometry are happening on its seat.</p>\n\n<p>“You don’t know it stopped here,” he mutters. For an inhuman being of darkness, he is a lousy liar. “Why would it stop here?”</p>\n\n<p>I shrug without turning around. “Maybe our place is just along the way. I don’t know why it was here, but I know that I saw mud and moss and crushed beetles all over the yard and the walkway up to the house, and I know that the neighbors across the street looked out their window and saw some misshapen mass turning out of our driveway and carrying two young men with it. So, unless whatever monster stopped here was just asking directions, I feel secure in my assumption.”</p>\n\n<p>“So I had a friend drop by,” he says. “If you were home more often then I wouldn’t need to talk to a wyrm. As much as they can talk. It’s more of gurgling sound, really, or a groan. The groaning might have been those kids, though.”</p>\n\n<p>“Where was it taking them?” I ask, even though I’m fairly certain I don’t want to know.</p>\n\n<p>“It didn’t know. That’s wyrms for you, though, just doing their jobs. Can’t fault someone for doing their job.”</p>\n\n<p>And we’re back to his favorite topic. I sweep up the crumbs on the counter and toss them into the sink. It’s been years since I bothered using plates. They always wound up smashed somewhere and it was just too expensive. I take longer than I really need to before I turn around and look at the newest claw marks on the kitchen table.</p>\n\n<p>“I was grading papers,” I finally tell him. “I can’t bring them home to grade them, not after what you did last time.”</p>\n\n<p>He throws his hands up in exasperation and I have to close my eyes against the unnatural directions his limbs move.</p>\n\n<p>“I was <em>trying</em> to be helpful,” he insists. “You’re supposed to be imparting knowledge to these kids, and I was adding to that!”</p>\n\n<p>Glaring in his general direction, I snap, “They didn’t need to know how each of them was going to die. You didn’t even put your <em>helpful insight</em> on the right papers! Michelle Harris found out that Jeremiah Carter is supposedly going to die from falling into some kind of pit, and she didn’t even know who Jeremiah Carter was because they weren’t in the same class! Meanwhile Jeremiah is wandering through my East Asian Archeology class looking for Libby Daniels to let her know that she should probably stay away from ski slopes if she doesn’t want to be disemboweled! Oh, and that obnoxious Wickman kid sends Michelle an e-mail asking her if he can visit her parents’ home in Madison to see, quote, ‘that delightful grotesquerie in the basement before you all succumb to the inevitable’. I nearly lost my job, several kids wound up in counseling, and Michelle pepper sprayed Vernon Wickman the next time he got within range.”</p>\n\n<p>“You were never in danger of losing your job,” he says with a dismissive wave. “You have tenure.”</p>\n\n<p>Nowhere is it more important to have tenure than at a school like Fulton University. Once you have that, you can do everything short of calling up one of the Fallen Ones without fear of losing your job. Of course, Professor Moreau had pushed that one boundary and tried to call up something anyway, but when she made a mistranslation the University hadn’t bothered to fire her. It hadn’t been necessary and her widow needed the pension.</p>\n\n<p>“Maybe I couldn’t be fired,” I admit, “but trust me when I say that Dean Vaughan can make my life miserable. That’s what I have you for.”</p>\n\n<p>Risking a glance at his face, I see his mouth do some weird somersault in different directions, a twist that I learned is a smile. I offer him my own flat smile in return, and move to open the refrigerator once more. I don’t hesitate when I pull out the two cans of beer. He never messes with the alcohol.</p>\n\n<p>His fingers, or whatever they are, have difficulty opening cans so I pop the tab before sliding it across the table. It’s somewhat amusing to watch his concentration as he tries to lift a small three-dimensional object towards his yawning maw. What looks like several writhing snakes is actually just his tongue. I can only watch his first two attempts at getting the beer to his mouth before I feel a dull ache beginning behind my eyes. So I close my eyes and let my head fall forward onto my crossed arms in exhaustion.</p>\n\n<p>“I try, you know,” he says.</p>\n\n<p>I frown, but otherwise I stay still as I mumble, “You try what?  To get <em>all</em> the beer into your mouth for once?”</p>\n\n<p>“No. Well, yes, but that’s not what I meant. I really do try to make you miserable. You just make it so damn hard. Nothing bothers you anymore.”</p>\n\n<p>Actually, my poker face has just gotten better. When he first…arrived, every little thing could get a reaction out of me. The destruction of my personal property, the disruption of my social life, the death of my fish, the harsh breathing outside of my bedroom door as I tried to sleep but only an empty hall every time I dared to look…The usual signs of an infernal visitor. But seven years has given me time to build up a level of defense against the unending onslaught of his personal attention.</p>\n\n<p>“You’ve done a great job,” I reassure him. “My family is on the other side of the country and rarely speaks to me, I haven’t had a date in four years, I don’t have a pet, I don’t have dishes, and you are almost the only person I ever talk to about anything other than work. Whoever sent you must be very proud.”</p>\n\n<p>I hear him heave a sigh of frustration, even though I’m not sure he actually needs to breathe. It’s hard enough to comprehend the outside of him. I really don’t want to think about the working of his internal organs. Or if he even has organs…</p>\n\n<p>“I <em>can’t</em> tell you who sent me,” he says yet again. “It’s part of the whole summoning process. I’m not even technically the one they made a pact with. We have a hierarchy, and if you think Dean Vaughan can make your life hell you should see what my masters can do to me.”</p>\n\n<p>My cheek is still pillowed on my arm as I shrug. “Can’t fault me for trying. Someone took the trouble to send a nearly unimaginable horror to torment me; I think that deserves recognition. Something along the lines of fire ants, honey, and zip ties.”</p>\n\n<p>His hand is careful against my head. Those claws can cleave a man’s leg off with one swipe, but they’ve never hurt me. It’s solid and still, without any of the strange bending and twisting I usually associate with his shape. And strangely, his hand is somehow the same temperature as a human’s.</p>\n\n<p>“I can’t tell you who sent me, but if I’m ever free, I’ll hurt him in ways you can’t even comprehend. It will be much more creative than fire ants and honey, and I’ll do it for free,” he promises quietly.</p>\n\n<p>A smile appears against my will. It’s a strange show of affection, but one that means more than flowers or chocolates ever could. I crack one eye open and brave a glance at his face.</p>\n\n<p>“You big softie,” I whisper.</p>\n\n<p>“Don’t let it get out,” he warns me. “If anyone thinks I’m getting soft on you I could lose my position here. Then it’s back to the swirling, shrieking abyss from whence I came.”</p>\n\n<p>I close my eyes again so I don’t have to watch his face ripple and give him a thumbs-up. “Not going to be a problem. I don’t want to have to break in a whole new demon anyway.”</p>\n\n<p>“I’m not a demon,” he reminds me again as his claws toy with my hair. I should pull away, he’s made some truly astounding knots in the past, but I’m just too tired.</p>\n\n<p>And I so desperately miss being touched. Not the kind of touching that generally happens behind closed doors, though I miss that pretty damn bad, but just feeling something else alive making contact with me. He and I have an agreement that as long as I push my family away he will leave them alone. I guess it hurts me enough that he doesn’t feel he needs to “improve” on the situation. The lack of human friends is my own choice, as anyone close to me becomes another tool to torment me. It isn’t a perfect system and sometimes I become so lonely that I’m willing to drive to another town, hit a bar, and completely lose myself in booze and a one night lover.</p>\n\n<p>The morning after, I come rolling in with a hangover and enough self-loathing that he mostly leaves me alone. He’ll still wait until I’m almost asleep and slam a door, or open the blinds in my bedroom, or turn the garbage disposal on and leave it running, but otherwise it’s a fairly quiet day. One Sunday I was <em>serenaded</em> by some kind of thin, shrill piping, but a threat to never bring alcohol home again brought that to a sudden halt.</p>\n\n<p>So now here we are. Two overworked people who just want to get through the day, have a drink, and torture each other a little.</p>\n\n<p>Maybe we are married…</p>\n\n<p>“One of the envelopes came from Hawthorn,” he says suddenly. I raise one eyebrow without moving my head. “A few days ago, in the mail, there was a letter from Hawthorn College.”</p>\n\n<p>“I don’t suppose you bothered to look at it before you shredded it,” I grumble.</p>\n\n<p>“Do you have any idea how hard it is to open something that flat? I can’t even…how can you even move in just three dimensions?”</p>\n\n<p>I interrupt him, asking, “Then how do you know it was from Hawthorn College?”</p>\n\n<p>“The seal was on the envelope, and <em>that</em> I can at least see properly,” he explains. “It has that lion-headed angel. You know what that’s actually a picture of, right?”</p>\n\n<p>“No, and don’t tell me. I still need to be able to get some kind of sleep. Was there just one sheet of paper? This is important,” I tell him, opening my eyes.</p>\n\n<p>His hand stops moving against my hair and withdraws back to his side of the table. He’s strangely still as he watches me. Despite how sickening his geometry can be, when he is not twisting or bending is when he actually unnerves me. I don’t show it, my mask is too good for that, but I sit up and force my eyes to stay on him.</p>\n\n<p>“Who was it from?” he asks me.</p>\n\n<p>“The letter? It’s from a professor at Hawthorn College. I needed his advice on something,” I tell him.</p>\n\n<p>He continues to stare at me, and I try to return it with that same steadiness.</p>\n\n<p>“What is he a professor of?” he continues. </p>\n\n<p>“Archeology,” I say. “Like me. Which is why I e-mailed him.”</p>\n\n<p>There is a slight shift in his form, and I think he is relaxing. He takes a few swipes at his beer can before he can properly pick it up, and then downs whatever is left. I take the opportunity for a long drink of my own. When I set the can back down he is looking at me in that strange way again.</p>\n\n<p>“So this professor isn’t in the library?” he asks slowly, as though to clarify. “He doesn’t work with books, records…texts?”</p>\n\n<p>And the penny drops. I fall back in my chair and groan.</p>\n\n<p>“I’m not trying to exorcize you again,” I reassure him. “Amongst other things, I can’t afford to. Do you have any idea how much those nuts from Connecticut cost me? Plus, I’ll probably just be cursed again, and we’re back to breaking in a new demon!”</p>\n\n<p>“Not. A. Demon.”</p>\n\n<p>I throw up my hands in frustration. “I don’t know what the hell you are! I don’t even know your name!”</p>\n\n<p>“Names have power,” he reminds me once more. “If he hadn’t known your name, he wouldn’t have been able to curse you! You should have been more careful with your name!”</p>\n\n<p>“Anyone can find a full name!” I shout. “This is the age of the internet! Five minutes with Google and you’re lucky if all someone finds is your name!”</p>\n\n<p>“Well, that was a dumb invention then, wasn’t it?” he growls.</p>\n\n<p>Yep. This conversation actually just became that childish. That’s not unusual for us. As long as we’ve been together there are some arguments that just never end. But the crushing weight of futility crashes back down on me and I let it go. I run my hand over my face and drop my head back down to the table.</p>\n\n<p>All I wanted when I came through the door was food, shower, and my bed. I’ve had the food, and I can put off the shower until morning. It’s getting to bed that seems daunting all of a sudden. For a moment I consider slumping down to the floor and just crawling to my bedroom. Walking seems like too much trouble, and it’s not like I can be humiliated in front of my shadow monster any more than I have been. Or maybe I’ll just stay here all night…</p>\n\n<p>There is a sound like a sigh, and then the scrape of a chair and the clacking of claws. I feel his warm hand wrap around my bicep and pull me upright. Then my arm is draped around something, maybe shoulders, and he’s half-leading me, half-carrying me down the hallway.</p>\n\n<p>“What’s waiting for me in my bed?” I ask him without bothering to open my eyes.</p>\n\n<p>“Ah, just some dried leaves,” he says. “I was having a lazy day…you know how sometimes you need to take things easy.”</p>\n\n<p>My bed is, in fact, filled with dry leaves. There are also some pinecones and part of a bird’s nest. We don’t have any pine trees in our neighborhood, but that is not something I feel up to questioning right now. Slipping out of his hold, I gather up the sheet and blankets and toss them into the corner. I can deal with that mess tomorrow. Clean ones are found in the closet, and I barely manage to keep my eyes open long enough to tug the fitted sheet mostly into place. I collapse face down without bothering with pajamas and just lay there.</p>\n\n<p>It is only when my toes get cold that I realize he has pulled off my shoes. I hear my closet door open and the sound of something dropping to the floor. Then there is the sound of claws tapping back and forth, drawers opening and closing, and water running somewhere. I am just awake enough to wonder what surprise he might be preparing for tomorrow morning. His infernal creativity never ceases to amaze me.</p>\n\n<p>“Why didn’t you ask me?”</p>\n\n<p>There was a time when just the sound of his breathing sent me flying out of bed in a panic. Now his voice is almost soothing.</p>\n\n<p>“Ask you what?” I mumble into the mattress without raising my head.</p>\n\n<p>“Whatever you asked the professor,” he says. From whatever angle, or angles, he is looking at me, he can clearly see my confused frown. “If it’s some question about an ancient monument or dead society, don’t you think I might be a better source than some guy you’ve never met?”</p>\n\n<p>I mull that over for a second as one of my hands shuffles across the bed for my quilt. When something soft brushes against the pads of my fingers I pause uncertainly.</p>\n\n<p>“Fur, fungus, or fleece?”</p>\n\n<p>“Fleece,” he tells me. “Like I said, it was a lazy day.”</p>\n\n<p>“Is it <em>my</em> quilt?”</p>\n\n<p>“Yep.”</p>\n\n<p>“Did you do anything weird, disgusting, or unnatural to it?”</p>\n\n<p>“No, already!”</p>\n\n<p>His wounded tone just makes me roll my eyes without even opening them. I drag the quilt over enough of my body for sleep and use my free arm as a pillow under my cheek. Pillows are also something you find that you can do without, especially when you cannot afford to buy yet another because somehow there is now a <em>living squirrel</em> in your expensive memory foam model from that sleep store in the mall.</p>\n\n<p>I still miss that pillow.</p>\n\n<p>“You can’t give me a human perspective,” I remind him in answer to his question. “I need to know the human history of a site to teach my students. Whoever you had stationed in an ancient city to torment someone a thousand years ago really does not help my class.”</p>\n\n<p>He growls slightly, then says, “That’s racist.”</p>\n\n<p>I try to come up with an argument against his claim, and I am alarmed that the only thing that comes to mind is, <em>Wouldn’t it be speciesist?</em></p>\n\n<p>“But Professor Wright knows this Mesopotamian culture like no one else does. I sent him a few pictures of an artifact in…” I pause for a yawn. “Sorry, in one of our e-mails. It’s kind of like a spire…I mean, a spear, and it has a spoke…spike…whatever. It’s a thing that he recognizes.”</p>\n\n<p>“Professor Wright?” I hear him say softly. His hand once again goes to my hair, carding his fingers gently through it. “Mesopotamian culture? How many e-mails have you shared?”</p>\n\n<p>My voice is slurring as I mumble, “I dunno. Bunch. His…hees…he is so interesting. Knows about religion…secrets…pots. Lots about pots.”</p>\n\n<p>“Pots are important,” he whispers, whatever passes for breath moving my hair. “Professor Wright of archeology…Hawthorn College…really.”</p>\n\n<p>Claws are clicking across the floor, and then he closes the door softly behind him. He does not want to wake me back up as he heads for the computer. While I know there is a good chance that tomorrow I will need, at the very least, a new keyboard, I smile.</p>\n\n<p>Robert Wright, professor of archeology with a specialty in ancient languages, is a dick. There is no nicer way to say it. He likes his young students, male and female, and if he can’t get what he wants from them he will go to great lengths to make their lives a living hell. He is pretty good at it, too, driving at least one girl to wash down her anti-anxiety pills with cheap beer.</p>\n\n<p>But he has no idea what hell on earth can really be.</p>\n\n<p>In the first few years of my unorthodox relationship I tried, twice, to date someone without my infernal roommate catching wind of it. It did not work out. I never realized those failed attempts at maintaining some form of happiness in my life could lead to such a moment of satisfaction. My e-mails to Professor Wright started out just the way I said, two professionals exchanging information. He was friendly and interesting, we shared some laughs…And then one of my colleagues mentioned Professor Wright’s issues with his younger students. It didn’t take too much digging to find the rest.</p>\n\n<p>Robert Wright is a white man with a cultured accent, an expensive degree, and a level of arrogance that is just slight enough to seem attractive. The odds of him getting fired on the word of a student, or even a handful of students, are basically zero. A few of his victims have tried, all to no avail. There was an actual “F*ck Robert Wright” Facebook page, but not surprisingly, it got shut down.</p>\n\n<p>Then I read about a student that had tried something else, something that involved an ancient tome “borrowed” from the college library, several different kinds of herbs, and a long knife. She was not as successful as whoever had damned me, and she had ended up half out of her mind and covered in bites. The campus police blamed whatever herbs she had used, which had apparently sent her into fits of “psychedelic psychosis”. There is some debate over whether that is real or not, but I certainly found nothing to support the idea that it might be brought on by mugwort, anise, or rosemary. The student was expelled, spent some time in an overcrowded mental health hospital, and has not been seen for months.</p>\n\n<p>So…I had an idea.</p>\n\n<p>The clattering of claws on keys would usually make me wince or swear or threaten things I cannot actually do. Tonight, it is like a gentle lullaby. My e-mails with Robert Wright have become flirtatious, and I’m even beginning to show a little vulnerability. I’ve mentioned not sleeping well, and that my life has been very unhappy for the last seven years. Professor Wright is sympathetic and consoling, while still being a condescending prick. My oddly protective tormentor <em>hates</em> condescension. </p>\n\n<p>Tomorrow, when Robert Wright calls me before I leave for work, I will be awkward and alarmed. The conversation will be quick, just long enough to plant some seeds of interest into the ever-fertile mind of my bored monstrosity. He might catch onto my lie, in which case I will just try to ruin Professor Wright in some other way, but then again it might work. Or he might be too glad about someone new to torment to care.</p>\n\n<p>There is a snarling sound, and then I can hear my keyboard hit the floor. It’s cheap, just like everything else in our home, so I don’t really begrudge him his frustration. His claws clack and scrabble around on the floor until he picks up the keyboard. He is muttering obscenities in English, French, and a few languages I don’t know. He could be at this for a while.</p>\n\n<p>Sighing softly, already beginning to drift, I find another smile sneaking onto my face. My hellish friend had let something slip. &quot;If he hadn’t known your name, he wouldn’t have been able to curse you.&quot; That is the first time in seven years that he has mentioned one defining attribute of whoever cursed me.</p>\n\n<p><em>He.</em></p>\n\n<p>My list of suspects has been cut almost in half. A few ex-boyfriends and a few jealous colleagues have already made their way to the front of my mind as I begin to drift off. Between this little gem he has let slip, and the knowledge that when <em>I</em> send a demon to torment someone they actually deserve it, this might be the best sleep I’ve had in seven years.</p>\n</div>\n","author":"eliza1227"}