{"rank":"75","title":"I dont know what to do anymore","id":"8j1l3a","url":"/r/nosleep/comments/8j1l3a/i_dont_know_what_to_do_anymore/","time":"1526185913000","body":"<div class=\"md\"><p>I have always been interested in the paranormal. My mom said it’s because I’m my sisters’ sister, if that makes any sense. To further explain, I am basically a carbon copy of one of my older sisters(we’ll call her Winnie). We act the same, sound the same, and I even look a lot like she did when she was my age. My mom always told me we play off of each other emotions, and we’re more connected than any of my other sisters. I think that’s true. </p>\n\n<p>Winnie grew up, and fell into a bad group of friends. In this group is where she met her husband, though, so there’s at least that up-side. Winnie and I have a 9 year age difference, so she met her now-husband when i was young, and he always tried to scare me by saying things like, “did you know someone died in your basement?”. It would scare me a lot, as it did any other kid, so I would run and tattle on him to my sister and get him in trouble. </p>\n\n<p>It wasn’t until I was 7 that I realized what he was saying was true. Only partially, but still true. </p>\n\n<p>It started near my birthday in July. I was 7, but i was alone inside my house. My family was outside and I was inside in the air conditioning, but I decided to turn it off since I was leaving the living room, where the air conditioner was. I unplugged it and went to my room, which is right beside the bathroom(this seems like a rather odd detail to throw in, but I promise it’ll make sense). I began setting up my barbies to play with them, when I heard a familiar click. </p>\n\n<p>I heard the fans inside the air conditioner begin to turn. </p>\n\n<p>I got up, expecting to see my dad there, but he wasn’t there. No one was there. </p>\n\n<p>Although I remembered distinctly turning off the air conditioner and unplugging it, i didn’t let the fact that it had somehow plugged itself in and turned itself on by itself scare me. I went back to play with my dolls. </p>\n\n<p>I have a very creative mind, so when I told my mom what happened, she told me I must have just imagined shutting off the air conditioner. This is a plausible explanation, because I do things like that all the time. I’ll lay in bed and hear my alarm go off, and I’ll see myself, almost as if I’m dreaming, get out of bed and get ready for the day. But it was different than that, because I wasn’t watching myself from the outside. I was in a first person perspective, not third. </p>\n\n<p>I brushed it off, until the next day. It was the day of my birthday, and i was very excited, as most kids are on their birthday. I woke up extra early and sat in my room waiting for my parents to wish me a happy birthday. And that’s when I heard something. </p>\n\n<p>It wasn’t the air conditioner this time. It was closer. </p>\n\n<p>I heard the faucet in my bathroom begin to drip. </p>\n\n<p>I got up and looked outside of my room and into the bathroom. I didn’t see anyone there, so I began to walk down the hallway towards the kitchen, thinking that maybe someone had got up and went to the bathroom, forgot to flush but washed their hands, and went to get food. It’s a silly rationale now that I think about it, but it was the best that my eight year old mind could come up with. </p>\n\n<p>As I approached the middle of the hallway, the faucet turned on. I could hear the sounds of water hitting the sink so vividly, I knew I wasn’t just imagining it. I turned around quickly and ran to the bathroom,\nHoping to see someone there, but no one was there. The faucet was on, but there was no one there to turn it on. </p>\n\n<p>I quickly shut it off and went to shut the door to the bathroom, but it slammed itself shut. I stood there in shock for a moment, before I began to shake. My mom came running out, asking if something was wrong, so I told her. She told me to brush it off, that it was just the wind that shut the door. I decided to not use that bathroom for the rest of the day. </p>\n\n<p>Nothing happened the next couple of days, so I assumed everything was okay. But of course, it wasn’t. This time, though, I wasn’t alone. </p>\n\n<p>Winnie and I sat on the couch watching movies together, as she was babysitting me while my parents were out, and my other sisters were at sleepovers. We watched mainly ghost documentaries, so i was already scared. But when she muted the tv, it scared me even more. </p>\n\n<p>Winnie did it so suddenly that I yelped, but she told me to quiet down. She looked at me and asked, “did you hear the faucet turn on?”</p>\n\n<p>I froze. I hadn’t told her about the incident a couple of days prior, because I thought everything was okay. I shook my head, because this time i evidentially didn’t hear it, but Winnie was convinced she did. She got up and began turning on the lights, and I trailed behind her, scared out of my mind but wanting to see what was going on. As we got closer to the bathroom, the sound of the faucet got louder and louder and louder, as if it was turned on just a little bit more with each and every step we took. </p>\n\n<p>When we arrived at the door, Winnje took a breath and flung it open. She turned the lights on, but they immediately turned themselves off. I began to shake violently out of sheer terror. I looked up and watched as the faucet turn itself off, just as it did the morning of my birthday. Suddenly, though, Winnie fell into me, and we both fell onto the ground. With a loud thud, the door to the bathroom slammed shut. Winnie took me by the arm and ran me to my next door neighbors house without another word. </p>\n\n<p>She called my mom to explain, and I wasn’t quite listening very well, but the words that I did catch will haunt me for the rest of my life. </p>\n\n<p>“There’s someone else in our house.”</p>\n\n<p>My mom allowed us to sleep at our neighbors that night, as we were too scared to sleep at our house, but she picked us up in the morning. Winnie and I sat on the front porch with my mom. She sighed softly and asked, “so, did you see him?”</p>\n\n<p>I was confused, but Winnie looked terrified. I had never seen her face grow so pale. </p>\n\n<p>“There’s something we’ve been hiding from you,” my mom said after a long pause, “we had no idea when we’d tell you, but he leaves us with no other choice than to tell you now.”</p>\n\n<p>I held Winnie’s hand as if my life depended on it. I had no idea what my mom wanted to tell us, but the anticipation shook my little eight year old body. </p>\n\n<p>“A man died in our house before we got it. he died of a heart attack in the bath tub during the summer. He lived alone and no one found him until a relative came to visit. Of course, since then we’ve gotten rid of the bath tub and we re-did the whole bathroom, but I feel like that made him mad. I don’t think he’s dangerous, though, but i feel like he knows how in-tune to the other side that you two are, or how fascinated with it that you are, so he likes to play with you. He won’t hurt you, he’ll just slam a few doors or something of the sort.”</p>\n\n<p>She’s right; he hasn’t hurt me. Not until now. </p>\n</div>\n","author":"nopesara"}