{"rank":"36","title":"Punk's Not Dead, Just Automated","id":"8j1qai","url":"/r/nosleep/comments/8j1qai/punks_not_dead_just_automated/","time":"1526187843000","body":"<div class=\"md\"><p>“Mankind is destroyed</p>\n\n<p>Sprinkled in the void</p>\n\n<p>La la lalala, la la lalalala” Blondie, Attack of the Giant Ants</p>\n\n<p>“Life, although it may only be an accumulation of anguish, is dear to me, and I will defend it.”  Mary Shelley, Frankenstein </p>\n\n<p>I graduated from University High School in Los Angeles in 1986.  In 1985, when we were both juniors, my best friend, Amanda Sedgwick, died horrifically in front of my eyes. </p>\n\n<p>U High is, was, and probably always will be primarily a school for rich kids. It’s a public school, but because of its location it draws mostly the children of entertainment lawyers, accountants, producers, and a smattering of B/B+ list movie actors. It’s been a rich area since developers bought the land out from under a bunch of hicks in the early 20th century, who had stolen it from Native Americans anyway. </p>\n\n<p>Rich kids do the worst shit to themselves, and each other.</p>\n\n<p>Sorry not sorry, as the kids probably don’t say anymore.</p>\n\n<p>The worst thing that ever happened to me happened to me in 1985, when I was a junior. I hung down with all the wrong kids--the wasters and the dopers and the punk rockers and the pushers because I always wanted to see just how bad things could get, just how shit life could turn out for charmed boys and girls like my friends and me. </p>\n\n<p>I got my answer.</p>\n\n<p>Los Angeles was Ground Zero for the punk rock explosion in the US, and the kids I went to school with were always some of the best at riding the wave of any fad. My 14 year old speed dealer, Buzz, had short cropped pink hair and wore Germs and Ramones tee shirts almost every day. My first semester boyfriend, Jayson, had big liberty spikes in his blond hair and wore a motorcycle jacket full of metal studs. Our honors English teacher, Mr. Price, who preferred to be called “Ken” and had questionable boundaries with his surfer boy teacher’s pets, had been in a band at USC who had the B side track on a Flipper single (“Survivors of the Plague”).</p>\n\n<p>My best friend, Amanda, was the bassist in a punk band that year that called itself Defamer and played a lot of house and college frat parties in LA, even though none of them were older than 17 at the time. A lot of times, the band was paid in weed or coke. The band name was a kind of joke on the fact that the parents of the band members were all famous or at least semi-famous and in the entertainment industry. </p>\n\n<p>Amanda was an archetypal hardbody bad girl, and so she got a lot of offers from sleazy dudes to make money on the side, and I don’t think she always said “No.” Sometimes she’d ask me to join her, when a guy was putting money on the barrelhead, as they say, for some girl on girl action on film or whatever, but in these cases I always did say “No”; although I was never exactly sure why. Guess I wanted to see how bad things could get, but not actually factually live through it--call it my “Nihilist Fantasy Camp” phase. </p>\n\n<p>Defamer consisted of Amanda, this kid Greg, a medium hot junior  who played drums, and a senior named Jonathan VanLaningham and who called himself either “Johnny V” or, more often, “Johnny Void.” It probably goes without saying that Johnny Void was a total asshole.</p>\n\n<p>There were a lot of rumors around school about Johnny Void, and he had started most of them himself. Some of them were true--I am sure he really *was* in rehab a record breaking number of times, and I have no problem believing he had really knocked out a dude’s tooth one time in a fight and paid a lot of money to have a hoity toity jeweler on Rodeo Drive  set it in a ring for him (he definitely wore a ring on his left hand with either a human tooth in it or a damned good imitation). </p>\n\n<p>One day, the winter before he started his band, I guess he had been tweaking and reading through his older brother’s college philosophy book and come on a passage from a philosopher from way back before Socrates who had said something like “We pretend there is taste, we pretend there is color, we pretend there is texture, but in reality there is only atoms and void,” and had been so struck by a combination of the profundity of that thought and the uppers psychosis he was suffering from at the time that he’d taken his brother’s razor and carved “Atoms and Void” into his own chest. It stayed on his chest for a pretty long time after that, as it scabbed up and healed (but didn’t actually scar) which at the time I thought was pretty hot. So that’s how he took the name Johnny Void. I suggested once he call himself “Adam Void,” (like atoms and void, get it?) which he had thought was a pretty good idea but he was already locally semi-famous as Johnny Void and a kid whose folks both worked in entertainment understood you didn’t want to change your branding too many times. </p>\n\n<p>Amanda played bass in the band and fucked Johnny. Johnny played guitar and sang and fucked half of Los Angeles. I guess Greg didn’t do much but play drums and shoot H. Johnny used to say a lot “Greg and I have this act we do for weed money where he mumbles half-coherent shit and I drink a can of Guinness and you can’t even see my lips move.”</p>\n\n<p>Amanda used to tell me stories about how Johnny liked when she tied him up and whipped him with his dad’s gator skin Gucci belt. At the time, it all sounded pretty hot.</p>\n\n<p>Even though he was kinky that way, Johnny was also always a creepy control freak in every other part of his life. He wanted to be a musical genius pretty badly, I think, but he just wasn’t born that way. When Amanda was whipping him, he was probably yelling out instructions.</p>\n\n<p>God he was pretty, though, like a filthy, slumming angel--long blond hair and hollow cheeks and haunted green-grey eyes and a wicked smile. He had this big jagged scar that marred an otherwise perfect left cheek--rumors about how he got the scar varied, but my favorite was that he did it to himself. That particular story went that an agent for either Guess Jeans or Armani approached him when he was having drinks with some older dude at the Polo Lounge, and asked him if he had ever thought of modeling. In response, Johnny had grinned at the agent, broken a bottle of Corona he had been drinking against the bar, and scarred his own face. </p>\n\n<p>I did want him.</p>\n\n<p>I also wanted Amanda. Hey, it was the 80s.</p>\n\n<p>But they had each other, and I had enough of an instinct for self-preservation to not want to get involved in a love triangle with my best friend and her dangerous, trustafarian, super self-destructive boyfriend. I was a pretty smart girl, as it turned out,. </p>\n\n<p>I said Johnny wasn’t a musical genius, and that’s true, but holy shit was that kid a genius like, academically. I mean, being a nerd was definitely uncool back then (don’t let Real Genius fool you) so he went out of his way to hide it. Took every pill that guaranteed a thrill and antagonized every teacher we ever had. But the kid was smart. Creepy smart. Especially when it came to mechanical engineering.</p>\n\n<p>Johnny used to brag that his first band, from back when he was in 7th grade, didn’t actually have any human members. He built these foot high, paper mache’, Ramones looking statues and used parts he salvaged from erector sets and whatever other electronic parts he could cannibalize from around his parents’ mansion and stuck them inside the statues to make them move around like creepy, crickety,  super-stiff, jilted punk rockers. Then he stuck a tape recorder under a balsa wood stage he built, and he’d charge other kids like fifty cents or a dollar to watch his animatronic paper mache’ band play “Sheena is a Punk Rocker” or “Beat on the Brat.” </p>\n\n<p>“Did you do any other bands,” I asked him once, “like The Dead Boys? Or the Talking Heads?”</p>\n\n<p>“Naw. Tried Blondie. But you’d have to be a genius to get Debbie Harry’s tits right. Never seen tits like that until I met Mandy here,” he’d added, and then goosed her right nipple and giggled when she slapped him. </p>\n\n<p>You can’t say Johnny wasn’t a whiz kid.</p>\n\n<p>You also can’t say he wasn’t eerily charismatic. Like, cult leader charismatic. That’s why nobody was especially surprised when, one Thursday afternoon, Johnny and Amanda and Greg just dropped off the face of the earth. </p>\n\n<p>I started to worry  when Amanda didn’t show up to cut 6th period French with this girl Kelly Anne, who doesn’t really factor into the story much other than being the girl Amanda always cut French with. They always used to go to the girls’ bathroom on the second floor and smoke, because Kelly was dumb as dirt and because 5th period Calc always stressed Amanda out and her French was basically fluent anyway from a summer living in Paris with her mom. Skipping her standing appointment to blow off class was a definite red flag and I was concerned when Kelly told me about it 7th period. </p>\n\n<p>Nobody had seen either Greg or Johnny since lunch, when they had gone with a bunch of other upperclassmen to Fatburger for burgers and fries, but an abrupt departure from routine for those two was much less worrisome. We all figured they were just off somewhere pulling the legs off of spiders or robbing a Radioshack; but if Amanda had taken off somewhere with them that was cause for concern. What if they had talked her into crossing the border to Tijuana to do porn or something? I mean, Amanda was a sweet but very fucked up girl and these were not guys any of us liked much even if we got obsessed with them. </p>\n\n<p>I drove around that night to all the places I could think Amanda might go on a weeknight, and then when I finally gave up and went home I called her house over and over but her parents were both out of town and Amanda was not home and their mostly Spanish speaking housekeeper was beginning to sound strained and irritated with me. </p>\n\n<p>The one thing that kept me from panicking was the fact that on Friday night the band had a gig at a bar called Buffalo Bill’s, which was a seedy shithole that was super popular among up and coming entertainment types because you could find a lot of very pretty rough trade male hookers there and also because the bar had held on to their mechanical bull for so long that people had started to think of mechanical bull riding as sort of retro and chic again. </p>\n\n<p>I was pretty sure that, one way or another, Johnny would make the gig. It was the best venue Defamer had ever played, and this guy Peter Heuer who owned Triple X Records, the label that put out The Angry Samoans and some of Johnny Void’s other favorite bands, was known to hang out and cruise for a little up and coming talent there, one way or another. </p>\n\n<p>I was standing around with a couple of my friends, Trent and Lois, at about 7:30 nervously waiting to see if the band would make their 8 PM stage time. This super skeezy guy with a butter blonde mohawk and deeply cratered face had come up to Lois and offered her a light for her cigarette, but when Trent had popped one of his own in his mouth and winked and said “What about me, big boy?” the guy had slunk off and it was the first good laugh we’d had all night.</p>\n\n<p>When the band still hadn’t taken the stage at 8:15 according to my white digital Timex watch, I had this icy feeling in my stomach. You may be too young to remember this, but if there were an SAT analogy that went “Violent deaths in shootouts are to gangster rap of the 90s as X is to the punk scene of the 80s” the answer would be “combination murder/suicides.”</p>\n\n<p>At 8:30, as the crowd turned from “restless and buzzing with anticipation” to “bored and restless” like milk turning sour on a hot radiator, the band finally made their way onstage. </p>\n\n<p>I remember that Johnny was lean, lithe, and buzzing with energy, but Amanda and Greg both looked a little stilted. Greg was usually stilted and stiff, but Amanda was typically frenetic and scurrying around the stage like a lizard on a hot rock, and it was disconcerting to see her standing so still, moving only her head. I remember starting to get concerned that maybe Johnny had gotten her hooked on heroin. </p>\n\n<p>Amanda was wearing that “Vultures!” tee shirt that Debbie Harry made famous (Google’s your friend if you don’t know the shirt already) and looked incredibly sexy but so lethargic, so crickety.</p>\n\n<p>Johnny strutted and hopped and screeched his way through their first five songs and even though Amanda and Greb both looked a litlte out of it, I was so relieved to see Amanda alive and well (or at least doing the same kind of imitation of life she had been doing since hooking up with Johnny) that I was having the time of my life. </p>\n\n<p>FInally, Johnny strutted to center stage and stared the crowd down. “Oh look,” he said playfully, “an ocean of fuckin’ poseurs huh?”</p>\n\n<p>People hooted and hollered. A girl near me threw a half-full bottle of Corona at Johnny which he dodged with a giggle. “Well, we’re just about done here but we do have one last song to play. This is a cover song, actually. Blondie, Attack of the Giant Ants!” </p>\n\n<p>For the first time, Greg and Amanda grew really animated.</p>\n\n<p>The cover started off well, even brilliantly. It was one of the few tracks I had noticed in which Johnny let Amanda harmonize with him. I knew that she had told me in rehearsals he sometimes even let her have the entire last verse herself. The crowd was going nuts, and as pissed off and heartsick as I had been earlier, a combination of relief at seeing Amanda up there on stage, okay if weirdly mechanical, and the skill the band was putting into the cover had me really psyched.</p>\n\n<p>For the last verse, Johnny did indeed finally shut his fucking trap and let Amanda take over and sister, at first, she was killing it. </p>\n\n<p>“Mankind is destroyed,” she yelled, “sprinkled in the void! La la lalala! La la lalala!” And she jumped and strutted around like a very sexy robot and she banged her head in time with the guitar and drums. </p>\n\n<p>As Amanda headbanged one last time, her head came all the way forward and then I heard a sick, wet, tearing noise and watched in absolute horror as her head fell completely off her body revealing a large, tightly coiled spring on which her head had been resting. Her head rolled back and forth on the stage and continued to sing the “La la lalala la la lalala” over and over as the spring quivered dumbly where her head had just rested. What looked like a mixture of blood and oil sprayed and seeped out of her neckhole, splatting against her tight yellow Vultures tee shirt </p>\n\n<p>I shrieked and convulsed and as I recall I threw up directly in the face of the hot Japanese  boy in the white jeans and the black English Beat tee shirt who was standing right next to me, who was himself too stunned to notice or care that I had just puked on him because he was screaming too loudly and already starting to run away in a panic.  </p>\n\n<p>Meanwhile Greg had lifted his arms high in the air for a rousing finish on the drums, but the torque was apparently more than his left arm could bear because it also flew off with the same sick, ripping sound revealing nerves and blood vessels and also a lot of springs and wires and sparking circuitry. The smell of Greg’s gushing blood being fried by the sparking circuitry is something I will never entirely be able to forget. Greg’s eyes rolled listlessly to look at the carnage, but his face betrayed nothing more than the same sneer that had been on his lips since the show opened, no doubt the sneer that had been carved and programmed into his face by the peculiar and repugnant of Johnny Void, builder of automatons and animatronic punk rock bands. </p>\n\n<p>The fifty or sixty people in attendance were able to interpret the horror at different rates, but sooner or later even the hardiest or slowest among us had begun to grasp the fact that there was a maniac still screaming lyrics into a microphone while two bandmates he had murdered and turned into robots were literally coming apart before our very eyes on stage. When I had finally finished retching, by now puking all over the very expensive pair of shiny brown  Doc Marten boots the girl immediately in front of me was wearing, </p>\n\n<p>Amanda’s left arm had fallen off, her left hand still dumbly clutching her guitar and her fingers working uselessly at stroking the strings. Her right arm was still attached, flailing around and her head, god help me her head continued to roll around in front of her body chanting “La la la lala” even as Greg’s other arm simply fell away from his body gently and peacefully, like a leper losing a toe in a gushing river. </p>\n\n<p>For his part, once Johnny Void noticed his automatons falling apart, he made a grandiose leap into the stunned crowd and then ran right through the crowd, parting punks to his right and left like Moses parting the sea, and ran right out the front door and into the night. </p>\n\n<p>Ten minutes later, when the LAPD arrived after someone had the presence of mind to find a payphone and make the call, Amanda’s head was still chanting La la la and Greg’s head continued swiveling stupidly around the room, as if he was trying to make sense of it all even though the light and intelligence were completely gone from his blue eyes. </p>\n\n<p>Like any good punk album of the middle of the Reagan era, this story just cuts off abruptly with no closure, no resolution. Johnny Void, as far as I know, was never found. Amdanda and Greg’s families had closed casket funerals for their kids, but would never answer any questions. As far as I know, no one understands exactly what Johnny did to create his animatronic punk band. Like I said, Johnny was a genius and if he isn’t dead by now I would imagine he’s living under an assumed name, working for some tech firm or for some Above Top Secret government agency--ours or somebody else’s, I doubt Johnny would be too particular. </p>\n\n<p>I used to try to call Amanda’s parents, to try to get them to tell me if they knew anything about what happened over that lost weekend; but they eventually changed their phone numbers at all of their houses and back then that was enough to stymy me. I moved East for college, and got into the punk scene out there, although  in no way did it ever compare to the scene I’d grown up in. </p>\n\n<p>I’ve been thinking about these things, lately, because I got a Facebook message from a woman I’d halfway known back at Uni. She went to Stanford, became an entertainment lawyer, never left California. She mentioned that there had been a recent news item that two graves (guess whose) had recently been robbed and that whatever ghoul had done it was still on the loose. It’s made me think maybe Johnny’s back, and getting ready for a reunion tour. Maybe punk’s not dead that can eternal lie (and with strange aeons, even death can die).</p>\n</div>\n","author":"goldvine_throwaway"}