{"rank":"12","title":"Any opinions on what should i do next...","id":"8j1qr9","url":"/r/nosleep/comments/8j1qr9/any_opinions_on_what_should_i_do_next/","time":"1526188012000","body":"<div class=\"md\"><p>Ok... so i have tried basically everything now, i even sat down and talked to it but the thing is that shit keeps getting weirder by the moment.</p>\n\n<p>First you need to understand what happened last year over July, my neighbor (that i never really talked to) killed herself, the problem is that  her room is the only thing you would be able to see trough my window. The first couple of days i had nothing to complain about but then all the sudden i started to hear shit in my window, like something tapping on it, i am not the kind of person who jumps straight into conclusions so i thought it was my mind playing tricks on me.</p>\n\n<p>Then, after no more than three days i was on a phone call with my best friend and i told him about that thing i heard a few days before, and he started to mock at me telling me that something was gonna jump out of the window and snatch me into hell (he is that type of person). Anyway, as soon as he said that we both heard a loud noise that came from his window, it was a bird that happened to fly towards my best friends window, i said nothing but i felt that was not a deliberate like if something was behind it.</p>\n\n<p>Few months went by (nothing out of the regular), but there was this one day when shit hit the fan. You see, i am kind of a paranoid freak so if i am leaving the house i make sure to lock my room which means that if you wanted in you would have to try and climb my window (i live in the fifth floor), so it is impossible to get something in or something out, i was out of the house with my family the entire day, in fact i kind of remember getting home at midnight. When i opened the door my heart sank, there was a balloon floating in the middle of my room, and i felt it was watching me &lt;like that feeling of being in a dream&gt; well it was like that, so i decided to explode the balloon and go to sleep everything fine right? well when i woke up because a nightmare i had (i wrote it down somewhere i will probably send a picture) at 2:00 am i tripped and fell and looked under my bed and guess what, that mother fucking ballon was there but it was without an scratch, i felt a little bit afraid and proceed to take the ballon out of my room and that was the end of it, the next morning there was no ballon</p>\n\n<p>Three days after that, something even bigger strike, it is important to know that i sleep always giving the back to door no matter what, it is a child thing i never stop doing, but that night i regret it, i was dreaming comfortably and then i felt something breathing in my neck, i could almost feel her lips on my neck, that thing whispered my name a lot of times, then she started to whisper something that probably scared the hell out of me because i jumped from the bed turned on the lights and cover my eyes and started to cry. I remember everything that lead me to that point, but what she said to me when i was &quot;sleep&quot; is a blurry memory, since then i decided to have a lamp close by and sleep during the day.</p>\n\n<p>Alright, so a year passed and i almost forgot about it, really i even started to sleep again at night, but i discovered three new things this week that really encourage me to ask for help. The first thing: things around my house sometimes move like closed doors open or things move out of place, you get me, the second thing: even though i am able sleep, it is like only my body felt sleep i am awake all night long hearing the silence of the entire block (it is funny because it remind me about something i read once about humans developing new skill to endure in a hostile environment, like reducing their hunger or their sleep). The last one was the one who made me do this, it started last week i keep feeling something is behind me, but when i look i am always alone, it started to happen just at my apartment, but since Wednesday, i feel it every were to the point i start running like an idiot, i am losing it, I think to talk to it in a dream of mine but i can&#39;t stop thinking that whatever she wants is not with me, but with someone i remind her of. So need an advise, and leaving the apartment is not one because i would not wish this hell to anyone.</p>\n\n<p>*It has been like a week since i wrote everything above</p>\n\n<p>Look, It has been 4 days without any sleep at all. My best friend tried to cheer me up and built something he called &quot;a bodyguard&quot;, he used the lamp that is on my bed, a hoodie, a jacket and a halloween mask he found on my things, the problem now started since he created that monster, i had this strange feeling that he is looking at me as i write this, it is funny you know because i took it down at 5:00 p.m. today and left to dine with my mother (to celebrate mothers day) but when i returned, that shit was there again with a different pose, like if he was waiting for me, i asked my room mate but he was clueless. I swear to god, if this is for real i am burning this building myself.  I would move somewhere else but i feel this ghost or whatever is trying to tell me something, at least i know that if i die i let the world know about this hell hole.</p>\n\n<p>EDIT: Ok, so <a href=\"/u/lilis1997\" rel=\"nofollow\">u/lilis1997</a> asked me if the &quot;bodyguard&quot; scared my neighbors. I just went to talk to them, and they told me that last night their daughter had a weird &quot;episode&quot;  and she started to talk weird things and with that face of &lt;do you know about this?&gt; he said -<em>She said that a the bodyguard help Mr.Noface get here-.</em> Then he told me that her wife screamed because she dreamed with a man named Mr.Noface, i honestly don&#39;t know what to expect anymore, that cannot be a prank i saw the same dude. Anyway, i went to see the bodyguard to take it down and burned the clothing material it was used to build it, but i found something weird in one of his gloves (the gloves had paper on the inside to make it look like a real hand). It was a note and a lot of drawings, i don&#39;t believe my best friend crafted that.</p>\n\n<p>EDIT: Well two things came to attention this afternoon, first, the letter is kind of weird and the drawing is almost no visible, as far for the letter i was able to discover what it says, but the other two are weird so please tell what it says. In the meantime, i am going to try to explain the situation to my room mate, i feel he needs to be as updates as i am. -.... .-.-.- ----. ....- ..... ....- ....- ...-- / .-- .... -.-- .-.-.- / .-- .... -.-- / .-- --- -. .----. - / -.-- --- ..- / -.-. --- -- . / .... . .-. . --..-- / .-- .. - .... / -- . --..-- / .-- .... -.-- / -.-. .- .-.. .-.. / -- . / .. ..-. / -.-- --- ..- / .-- . .-. . / .- ..-. .-. .- .. -.. --..-- / -. --- .-- / .. / .-- --- -. .----. - / .-.. . .- ...- . --..-- / -. --- .-- / .. / .-- .. .-.. .-.. / -.. .-. .- --. / .- .-.. .-.. / --- ..-. / -.-- --- ..- / .... --- -- . --..-- / .-- .. - .... / -- . .-.-.- / -.-- --- ..- .-. / ..-. .- - .... .</p>\n\n<p>EDIT:First, someone already decode the messages so thank you. Second, that same person left me two questions: Who is my father and if the number  6.945443 ring any bells in my head. So really quickly my dad and i have a very close relationship but we kind of came apart after a few discussions we had about one of my friends who got killed in a car accident a few years back and it was revealed by a voice note i got that he wanted to kill himself. And the worst part is that i was doing something else at the time and that i couldn&#39;t answer, also i thought the number was some coordinates and i tried, but it is nothing maybe it is incomplete or it is a code of some sort like numbers to letters. Anyway,  thanks to <a href=\"/u/IronXenix\" rel=\"nofollow\">u/IronXenix</a> for decoding that shit, basically one of the messages says that a demon will try to trick me into killing my dad. The other one is talking about the land of angels and here is were i felt a little scared because my dad lives in L.A the city of fucking angels, and if i am not mistaken the first message says that if i look at the empty eyes of what i could only guess to be Mr.Noface i will try to kill my dad. If that is not the meaning i am not sure, but it did felt like a weird coincidence right? i kept looking for what 19/14 and i did&#39;t get it. Then my friend Alan pointed out that in the text  it talked about a &quot;she&quot; which was punished with water, and the first thing that popped into my head was freaking Elisa Lam who was found <strong>19</strong> days after her alleged death. Is that going to happen to me? i mean, i saw that video and she did&#39;t look well.Whatever it is, it likes fucking with you, my dad said that this morning a scrap of paper came in his mail. I am scared.</p>\n\n<p>EDIT:Ok, this week might have been the weirdest in my life. for starters, i noticed that the entire block is weird, in the sense that people just stare at me for no reason at all, i wanted to ask one thing about the number 19/14  i was told by one of my friends that it was a bible passage i looked for it and... well go take a look and tell me that has nothing to do with the letters.</p>\n\n<p>.-.<a href=\"https://i.redditmedia.com/2Tp5GpmO3r1ygM7hNuPWDKzq61q4ypSZrCJuU8LkTEM.jpg?s=def61f7a0f034996b99062826b1740a5\" rel=\"nofollow\">https://i.redditmedia.com/2Tp5GpmO3r1ygM7hNuPWDKzq61q4ypSZrCJuU8LkTEM.jpg?s=def61f7a0f034996b99062826b1740a5</a> - i had a dream with this man and in a way it has an odd resemblance to that &quot;bodyguard&quot;</p>\n\n<p><a href=\"https://i.redditmedia.com/w_3yPwif3nTmTNBb__3ZQ4O2d9vXF8XrpAF4bYea_LY.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=960&amp;s=62d70e4bba53aaf4ac67c02d7737092b\" rel=\"nofollow\">https://i.redditmedia.com/w_3yPwif3nTmTNBb__3ZQ4O2d9vXF8XrpAF4bYea_LY.jpg?fit=crop&amp;crop=faces&#37;2Centropy&amp;arh=2&amp;w=960&amp;s=62d70e4bba53aaf4ac67c02d7737092b</a>-This is the &quot;Bodyguard&quot; my good friend made</p>\n\n<p><a href=\"https://www.reddit.com/user/IHAVENOIDEA46/comments/8j51jx/letter/\" rel=\"nofollow\">https://www.reddit.com/user/IHAVENOIDEA46/comments/8j51jx/letter/</a> - This is one of the messages the other ones come in other languages and in codes of some kind i guess</p>\n\n<p><a href=\"https://www.reddit.com/user/IHAVENOIDEA46/comments/8j51s4/mrnoface/\" rel=\"nofollow\">https://www.reddit.com/user/IHAVENOIDEA46/comments/8j51s4/mrnoface/</a> - Who is this guy, or who is fucking with me</p>\n\n<p><a href=\"https://www.reddit.com/user/IHAVENOIDEA46/comments/8j79co/text/\" rel=\"nofollow\">https://www.reddit.com/user/IHAVENOIDEA46/comments/8j79co/text/</a></p>\n\n<p><a href=\"https://www.reddit.com/user/IHAVENOIDEA46/comments/8j7afv/text_2/\" rel=\"nofollow\">https://www.reddit.com/user/IHAVENOIDEA46/comments/8j7afv/text_2/</a> - Here as i promised, the two texts</p>\n\n<p><a href=\"https://www.reddit.com/user/IHAVENOIDEA46/comments/8jgkgt/shit/\" rel=\"nofollow\">https://www.reddit.com/user/IHAVENOIDEA46/comments/8jgkgt/shit/</a> - the first part of the message my dad got</p>\n\n<p><a href=\"https://www.reddit.com/user/IHAVENOIDEA46/comments/8jgk85/nope/\" rel=\"nofollow\">https://www.reddit.com/user/IHAVENOIDEA46/comments/8jgk85/nope/</a>-the back part of said message</p>\n</div>\n","author":"IHAVENOIDEA46"}