{"rank":"9","title":"i promise im not lying","id":"8j25wr","url":"/r/nosleep/comments/8j25wr/i_promise_im_not_lying/","time":"1526194113000","body":"<div class=\"md\"><p>I want to start this off by saying that what I’m about to recount is the complete, honest to God truth. I’ve always had a hard time lying, and making up stories, ever since I was a kid. It had gotten to the point where everyone knew that I would be completely honest when they asked me questions, even if that meant I would get in trouble. I’d also like to say that I never used to be afraid of many things. Ghosts never scared me, nor monsters under my bed. I was a fortunate kid, and I grew up in a pretty wealthy house with a good family. An older brother, and two parents that loved me very much, so much so that they tended to shelter me a lot. They never taught me about creepy men that tried to kidnap children, or how to stay safe on the streets. I guess I never needed to know back then, because truthfully I never played outside much. I was a lonely child, and spent most of my time on my own anyway, so it didn’t impact me too much. </p>\n\n<p>Today, at eighteen years old, a lot of that has changed. All because of one fucking incident that happened to me when I was only thirteen. </p>\n\n<p>I know it’s cliche, but it really was a dark and stormy night. It hadn’t rained in weeks in my small city in Georgia, and it was getting unbearably hot, considering it was the middle of August. Thankfully, a storm came by and cooled things down. Lots of loud thunder, and blinding lightening. I enjoyed storms thoroughly, especially at night. Enjoyed being past tense…</p>\n\n<p>This specific day, my brother was away at his friends house. It was his last few weeks at home before he was going to college, and he wanted to spend it by saying goodbye to some of his buds from high school that wouldn’t be joining him in Boston, at MIT, which meant he was gone a lot. My parents had an important meeting to go to for our business, which meant I had to be home by myself. </p>\n\n<p>This wasn’t weird for them, I was home alone often. The thought of it always excited me. I enjoyed having our large house to myself to do whatever I liked. My parents were confident enough in me to keep the house safe that I’d been doing it since I was about ten, and it was never an issue. Around eight, my parents came to my bedroom to tell me that they were heading off, and at the latest they’d be home around twelve in the morning. I agreed, and told them that I might be asleep when they got home, and asked them not to wake me up if I was. They agreed, and left. </p>\n\n<p>At first I did the normal stuff any teenaged girl would do when they were home alone. Blared my music the loudest it could go, sang on the top of my lungs. I made junk food, and drank soda. I was enjoying my freedom. I also noticed that the storm was picking up, and one of my favorite things to do was open all the blinds so I could watch the lightening. I decided to go to the living room, since it gave me a clear view of our backyard, which was vast and had a clear view of the sky. I opened the curtains, and tugged on the blinds, and turned off all the lights except for the small lamp in the corner. I grabbed my snacks and soda and headed back to the couch. </p>\n\n<p>I watched the storm for awhile before getting a bit bored and flicking on the tv to some random channel, then I started texting some friends of mine. This went on for about twenty minutes before I heard a knock at the door. I looked at the clock, it was only nine pm, but still…that was late for visitors in my house. But, then I remembered that my brothers friend had left over something at our house from previously sleeping over the day before. My brother had said he might swing around later, and I should answer the door if he did. I’ll remind you, I was sheltered, so no bad thoughts had crept into my mind. I didn’t really think much of it, and wasn’t very scared. I got up from my spot and walked toward the front door. When I opened it, expecting to see my brothers friend, no one was there. I thought that was a little weird, but again, didn’t think much of it.</p>\n\n<p>“Hello?” I called out. I don’t know why I thought I’d get a response. It was pouring outside, and no one was going to wait there to respond to me if they were in their right mind. I figured someone had the wrong house, and noticed it before I could answer the door. So I shut it and locked it, and went back to the living room to text my friends again. Another thirty minutes went by, and there was another knock at the door. </p>\n\n<p>Again, I wasnt scared. If anything, I was getting annoyed at this point. With a sigh, I walked toward the door and opened it again…no one was there. </p>\n\n<p>“Hello!?” I yelled angrily. “This isn’t funny!” I waited for a response I knew I wouldn’t receive, and I didn’t. So I shut the door. At this point, I was out of my soda so I went to refill my cup in the kitchen. As I was doing so, there was another knock. Except this time, someone was banging. My heart thumped, and the bottle of coke dropped from my hands and onto the tile floor. I was getting scared now, but I was also mad, and being the hot headed girl I was, I stomped to the front door and swung it open. Again, no one was there.</p>\n\n<p>“Connor, if that’s you, I swear to God, you better knock your shit off!” I screamed.</p>\n\n<p>Connor, my brother, enjoyed playing tricks on me. I was hoping this was just another one of them. I slammed the door in anger, and locked it.</p>\n\n<p>That’s when the power went out. I groaned, “Great, just fucking great.”</p>\n\n<p>In the kitchen, I grabbed a flash light, and began cleaning the sticky mess on the floor. It only took me about fifteen minutes in total. That’s when I heard another bang. Except this time, it was on my window, in the living room. The very same one that looked out on my backyard, where the curtains were wide open…</p>\n\n<p>I gulped, and when I walked into the room, the sight I saw terrified me. A man who I didn’t recognize was peering into my window, with a horrible grin on his face. His eyes were dark and wide, with something sinister behind them. I could barely move. He saw me, though, and cackled. Banging on the window once more. I screamed, and darted for my phone, where I hurriedly called 911. The man saw what I was doing, and was noticeably scared by it. He darted away from the window.</p>\n\n<p>The police showed up about five minutes later. I told them exactly what happened, and they looked in the backyard. He left behind foot prints, and the scariest part of it all…a machete. </p>\n\n<p>My parents returned home after I called, letting them know what happened. The next day on the news, we saw that a girl my age, who was also home alone, was murdered in her house. She hadn’t locked her front door…she’d been slaughtered, her limbs cut up, and whatever parts of her body had been distorted. The man was found in the families home, rocking over the dead girls body, cackling to himself. He had used a machete very similar to the one found in my backyard.</p>\n\n<p>To this day, I’m never home alone. I’m scared of storms, and I’m scared of solitude. Most of all, I’m scared of anyone that looks slightly off. The mans haunting smile will never leave my subconscious. I often have nightmares of him laughing over me as he mutilates my body…</p>\n</div>\n","author":"samarahhhhh"}