{"rank":"34","title":"Encounter","id":"8j2brz","url":"/r/nosleep/comments/8j2brz/encounter/","time":"1526196689000","body":"<div class=\"md\"><p>Hi everyone,</p>\n\n<p>I am not sure how to start this post, but I feel like I have to get this off my chest.  The whole encounter just seemed so surreal.  I am not sure if I will even make any sense here.</p>\n\n<p>Here goes nothing.</p>\n\n<p>I am 25 years old.  I have been working for an event coordinating company since graduation.  I get to travel a lot as part of my job.  </p>\n\n<p>Two weeks ago, I went San Francisco for a conference.  Instead of flying back on Friday when the conference ended, I decided to stay in town for an extra day.  I had never been to San Francisco before then, and I really wanted to check out the gay scene.  </p>\n\n<p>I have been questioning my sexuality for quite sometime now.  I guess my last serious relationship was back in college and that did not last very long.  Back then, things with Adam just never seemed right.  I remembered looking at my roommate and her boyfriend, and wondering why I could not feel the same happiness with Adam.  He was handsome, kind, smart and loving.  He really adored me.  But I alway felt guilty for not having strong feelings for him.</p>\n\n<p>One night, my drunk roommate kissed me in front of our boyfriends for show.  That was the first time I felt a spark in a kiss.  Could I be gay?  I was so afraid of that thought.  I was not ready for it.  And not long after that incident, I broke things off with Adam.  I never did talk to my roommate about that kiss.  I just tried very hard not to think about it.  After graduation, I got my own place and I have been single ever since.   </p>\n\n<p>Knowing I was going to San Francisco, I had the intention to finally allow myself to explore my attraction to women.  I found a small lesbian club a few light rail stations away from my hotel.  So I dressed up, put on my courage and out I went.  </p>\n\n<p>The club was smaller than I expected.  It was cozy and everyone seemed quite friendly.  As the night went on, more and more people came in.  The music was good and the dance floor was packed.  I was just dancing on my own when I felt her body behind me.  She traced her fingers down the side of my arms while we stepped to the beat.  I turned around and our eyes met for the first time.  She was gorgeous.  She had long dark hair, deep brown eyes and beautiful smile.  I was stunned to have someone like her next to me.  I blushed.  I was so shy.  </p>\n\n<p>For a while, our bodies moved together to the rhythm as the temperature rose.  I could feel her breath on my neck.  Her scent was so alluring.  I have never felt anything like this before. </p>\n\n<p>“I’m Ally.”  She leaned in, her lips brushed softly against my ear.  </p>\n\n<p>“I...I’m Jenny.” I stuttered.  I could feel my face burning.  It was nerve wrecking.  </p>\n\n<p>She smiled at me.  “Is this your first time here?”</p>\n\n<p>“Yah...It is.  I am not from here.” I shouted over the music.  </p>\n\n<p>“Do you wanna go get a drink?”  </p>\n\n<p>I nodded.  She grabbed my arm and led me to the bar.  </p>\n\n<p>“Where are you from?”</p>\n\n<p>“Calgary, Alberta.  It’s in Canada.”  I answered.  </p>\n\n<p>“Canadian eh?  Me too!” </p>\n\n<p>“No way!” I instantly felt more comfortable.  “Where are you from?”</p>\n\n<p>“Vancouver.” </p>\n\n<p>We talked and danced together for the rest of the night.  She was so friendly and nice.  And, so beautiful that I almost lost track of time.</p>\n\n<p>“Hey Ally.  I’m sorry.  I have to go.  I can’t miss the last train.”  I regretted it the moment I said it.  I did not think I had enough money for the Uber ride home either. </p>\n\n<p>“Aw.  It was so fun.  It was really nice to meet you.  I’ll see you out.”</p>\n\n<p>The air was crisp outside.  It was still a little bit chilly this time of the year.  I shivered.  She put my jacket on my back for me and rubbed down my arms.  I stared into her eyes for a few moments and that was when she leaned into a kiss.  Yup.  I am definitely gay.  No doubts about that anymore.  I kissed her back passionately.  </p>\n\n<p>When we finally paused for air, I wanted to ask her if she would come back to the hotel with me.  But I was too shy.  A one night stand?  I have never done something like that before.  I could not get the words out. </p>\n\n<p>She looked at me intensely and sighed.  I knew I had blown it, I thought to myself.  </p>\n\n<p>“Can we keep in touch?  Text?  Email?”  I blurred out instead.  </p>\n\n<p>She was silent.</p>\n\n<p>“I don’t think that would work.  Good night Jenny.  You take care.  Be safe.”  </p>\n\n<p>I looked down at my feet.  I did not understand why we could not exchange numbers.  I guess she was out of my league anyway.  “Good night.”  I replied and I walked away. </p>\n\n<p>Something did not seem right on my walk back to the station.  I was still puzzled over Ally’s response.  So many thoughts were going through my head.  She was so pretty.  She seemed into me too.  I thought we could at least be friends.  After all, Vancouver and Calgary are not that far way.  We are both Canadians.  We could hang out from time to time.  Who knows.   </p>\n\n<p>As a rounded a corner, I realized I was being followed.  It was like my spidey sense got activated all of a sudden.  </p>\n\n<p>Shit.</p>\n\n<p>I scanned my surrounding, hoping to see others around.  It was pretty late at night and the streets were pretty empty.  I could feel my heart pounding.   I picked up the pace and rushed in the direction of the station. </p>\n\n<p>C’mon.  Faster.  </p>\n\n<p>I thought to myself.  The shadow figure behind me increased its pace as well.  I glanced back.  I could not see his face, but i knew it was a man.  He was dressed in dark clothing.  He was definitely hunting me now. </p>\n\n<p>Fuck.</p>\n\n<p>This was not good.  I started to run.  So did he.  Next thing I knew, he tacked me to the ground.  Pain surged through my body as I landed on concrete.  I scrapped my chin.  I turned around and came face-to-face with my attacker.  He was wearing a balaclava and I could only see his eyes.  He was strong and he was now pinning both my wrists to the ground.  I tried to scream.  I tried fight back.  I tried to kick and buckle my body.  He was too strong.  He hit me in the face and I could taste blood in my mouth.  My vision was blurry and I could feel him rip at my top.  </p>\n\n<p>“Stop fighting, you bitch.  I’m going to kill you if you don’t stop.” </p>\n\n<p>I screamed.  This could not be happening.  How did this happen.  Why!  I was not going give up without a fight.  Suddenly, I felt him roll off of me.  Someone had hit him in the face.  I looked up.  It was Ally.  She was kicking him now.  </p>\n\n<p>“Get up,” she yelled at me.  “Now!”</p>\n\n<p>I crawled backwards a few steps.  </p>\n\n<p>“Fuck you bitch.”  He shouted.  He aimed a punch at Ally.  They were tangled up in a fight. </p>\n\n<p>“Run!  Go get help.  Hurry!”  Ally said. </p>\n\n<p>I stumbled to my feet and ran as fast as I could to the station.  I tried to look back but tears were running down my face.  Shaking, I finally made it to the station.  I grabbed the first person I saw and begged for help.  Soon, a few handful of people gathered around me.  We called the cops.  I told them to go a few blocks up.  I told them Ally was there.  She needed help now.  I tried to get them to go before the cops could get there.  I tried to get them to go save her first.  They would not go.  They were all too afraid.  I was so angry.  </p>\n\n<p>An ambulance showed up not long after.  The responder attended to me.  I was in shock, she said.  My memory of this part is a bit hazy.  I kept asking the cops if they had saved her.  I kept asking the nurses if they saw Ally.  None of them would give me answer. </p>\n\n<p>I was discharged several hours later and taken back to my hotel.  I was exhausted at this point, so I finally gave into sleep.  </p>\n\n<p>The next morning, I had the worst headache.  I thought about Ally.  I was still so worried about her.  I immediately searched the internet for any news about previous night’s incident.  </p>\n\n<p>This is what led me to share my story with you guys here.  I could not believe what I found online.  The police said a man was killed last night in the area where I was attacked. He bleed to death.  His genital was cut to pieces.  The police ID him as a serial killer and rapist based on his finger prints.  When they raided his residence, they found a mutilated body of another victim inside his home.  The victim had been reported missing for over a week.  </p>\n\n<p>It was a photo of Ally.</p>\n</div>\n","author":"FollowGood"}