{"rank":"17","title":"100 years old.","id":"8j2hxk","url":"/r/nosleep/comments/8j2hxk/100_years_old/","time":"1526199515000","body":"<div class=\"md\"><p>This story has been passed down in our family for a while now, and It always kept me up at night, knowing that this has happened to my great grandfather. To give light on the history of my dad&#39;s side of things he is from Russia. His family has been in many wars, from the Crimean War, to the Russo-Japanese War, and up to World War 1 and 2. </p>\n\n<p>Now onto the story that I was told the other day.  </p>\n\n<p>This story takes place during World War 1 on the Eastern Front. It was during summer of 1916, during the Brusilov Offensive. The specific date this took place was on July 26th, a month after the battles started. My great grandfather was a aviator for the 2nd Corps Aviation Detachment, flying a SPAD S.VII French plane. The planes back then were not so safe as the ones during WW2 and the vietnam war, but I digress. My grandfather was tasked to have bomber planes destroy a series of houses containing Ammunition for the German and Austro-Hungarian infantry. The only problem, was that there were a dozen or so 8.8 cm Flak 16 Anti-Air guns surrounding an area that was about 15 km from their front line. After an hour or so of mission briefing, everyone took off to the sky. I must add, that this biplane he was flying has a second seat on it with a Lewis machine gun, so he had a buddy always watching his back during a dogfight. Things were quiet after a while, until one of the bombers was being shot at by enemy plane fire. A dogfight ensued between both sides, and after shooting down two or three planes, my grandfather and his friend were hit, and were going down about 10 km north of where allies or civilization were. The plane fell down a shallow ravine, and they had both landed in a tree close to the ground. </p>\n\n<p>&quot;Thank god, we would have died if not for the sturdiness of the tree&quot; My grandfather said.</p>\n\n<p>&quot;At least we were able to jump before the Aeroplane crashed. Lets just hope the map and the other equipment made it out.&quot; His friend, Mikhail said.</p>\n\n<p>After a while of digging around, they found things they needed: A canteen, two Russian Lever action rifles, two nagant revolvers, knives, a compass, and a map of the area. They had a large bag of ammunition for the both, about 250 rounds for both weapons. The area they landed in was heavily wooded, and the closest city on the map was Riga, which was under German/Prussian control, though there was some allied force there. It was the afternoon, around 6 or 7 PM in the day, and they had started to walk for a good 3 hours or so. While they were on their walk, they kept hearing things around them. </p>\n\n<p>&quot;Mikhail, what is that noise?&quot; My grandpa asked</p>\n\n<p>&quot;Ivan, it could be the enemy. Ready your weapons&quot; Mikhail said. </p>\n\n<p>They had previously heard the forest brimming with life and sounds of birds and deer running around. But this made everything go dead quiet. So quiet. And then, a rock suddenly hit the tree closest to them, being mistaken for gunfire. Both men hit the ground and aimed around for their assailants. They didn&#39;t see anyone, but they could hear loud footsteps across the creek they had crossed. They laid there for almost 10 minutes, when Mikhail suddenly went white at what he saw. </p>\n\n<p>&quot;Mikhail?&quot; </p>\n\n<p>No response, just silence.</p>\n\n<p>&quot;Mikhail. What the hell do you see?&quot; </p>\n\n<p>My Great Grandfather was supposedly a man of steel, afraid of nothing. But what he saw that day made him want to run for his life. Sitting on a rock, about 98 feet away, was something so dark that it was out of place from everything else. This thing, was eating something.</p>\n\n<p>It was eating the corpse of a German soldier who got lost.</p>\n\n<p>Mikhail was so afraid that he started to shake, and accidentally fired his gun. The large figure jumped off of the rock, and looked around. It began walking towards the creek, and once it got closer, it stared both of them dead in the eyes, and made the most horrible noise. Ivan must have shot it somewhere, because the thing recoiled, and held a part of its body. He did see blood on the rocks. Both of them didn&#39;t waste time and ran off, and after a while, they did make it to a small village. About a year after that experience, both men left military service and moved to the bigger cities, though they were caught in the mess of the civil war. </p>\n\n<p>This was one story I will always remember as long as I live.</p>\n\n<p>Edit: I will be posting another story soon, since I have the diary he kept throughout his travels. </p>\n</div>\n","author":"Waterhickory98"}