{"rank":"233","title":"I've been getting a little worried about the house across the street.","id":"8j33oy","url":"/r/nosleep/comments/8j33oy/ive_been_getting_a_little_worried_about_the_house/","time":"1526209586000","body":"<div class=\"md\"><p>So, this is going to be a little long, but I gotta explain some shit. Bear with me. Also, sorry if you&#39;re sensitive to swearing, because I really have a sailor&#39;s mouth. And fingers, I guess.</p>\n\n<p>I&#39;m twenty-five. I live alone, in a small town in Oklahoma (not giving specific details for obvious reasons). The house I live in is on a street corner; across the street to the right (if you were facing the front of the house) is the little shack I grew up in. To the left is my grandparents&#39; old house. My house was my grandma&#39;s new one, built about five years before she died. She left it and her money to me, which before you ask did certainly piss my mom off no end, thankyouverymuch. It wasn&#39;t a lot of money for an inheritance, but, bless her Depression-born self, my grandma saved most every penny she ever made, and I was able to get comfortably through college. And the house, even though it was filled to the top with hoarder crap when I got it, has turned out to be a godsend.</p>\n\n<p>See, I&#39;m agoraphobic. I wasn&#39;t always like this. I mean, sure, I was your typical nerdy kid, didn&#39;t like to go outside to play, preferred video games and books to real life, etc., etc. But I wasn&#39;t, you know, <em>unable</em> to be off my own property or anything. That changed once I left college. I did the thing I usually do when I leave a new place--we moved around a lot when I was a kid so I&#39;m sorta kinda used to it--and deleted all my old friends&#39; numbers, dropped them off my Facebook and stuff. Emotional firebombing. Helps you not be disappointed. Even though, like I said, I had always been a nerdy kind of kid, I always found it pretty easy to make friends. This wasn&#39;t the case when I moved back home.</p>\n\n<p>Sure, family&#39;s still around. They come visit, sometimes, though it&#39;s rarer these days. I have a fiancee, technically. We&#39;re long-distance, she lives in Canada. I know what you&#39;re thinking, but first of all, fuck you, I&#39;m not that much of a liar, and second of all, we met back when I was in high school. We don&#39;t put as much into this anymore. She&#39;s busy with work and I&#39;m busy with jacking off and half-watching dumb shit like Family Guy while I go a-Redditing. I used to have work friends too, back when I could still leave the house for work. We would get high in busted up old parking lots and drop-dead-drunk in the single shitty dive bar in town. But when I stopped being able to visit them, they stopped visiting me. That was cool with me, I thought. Fuck &#39;em, I thought.</p>\n\n<p>Unfortunately, the thing about agoraphobia, or really any kind of mental shit is that it gets worse in isolation. Every damn therapist I&#39;ve ever been to has said that, and for once, they aren&#39;t wrong. I used to be able to walk my dog around the neighborhood, a couple of blocks, before I would hear that quiet internal scream saying &quot;WE HAVE TO GO HOME NOW WE HAVE TO GO WE HAVE TO GO&quot;. Then it got to where I could walk between my family&#39;s old houses. Now I can get about to the driveway and I start to panic. So I get my food and cigarettes and other essentials delivered by a cousin I have a deal with. His kid mows my lawn every two weeks in the summer and spring for ten bucks a pop. I do odd jobs online, you know, MTurk, surveys, writing dumb rich kids&#39; essays for them. I get by.</p>\n\n<p>The one thing I like to do, the one little defiant gesture I give to my agoraphobia, is that when I peruse the internet or whatever, I do it on the porch, at least in the evenings when nobody&#39;s around to give me dirty looks for being that weird homeless-looking guy in ripped-up shorts and a bathrobe who never leaves his property. Occasionally I look up from my work or my laziness and take an admiring look at the house across the street. That was my old great-uncle&#39;s house, back when I was a kid, now owned by some dumbass hipster who lives in Tulsa. He only bought it to win &#39;rustic chic&#39; points with his dumbass hipster friends, and to have brunch every now and again in the backyard. Most of the time, it&#39;s empty.</p>\n\n<p>When I was a kid, I loved that house. I went inside maybe only once or twice. It was like any basic old person house, lots of floral print furniture and that smell like someone took a shit and wrapped it up in fresh linen. But on the outside, that house was and is <em>magnificent.</em> It&#39;s a beautiful callback to the era of plantations, and we&#39;re going to ignore the seriously fucked up shit that was done to afford such beauty. Big faux-Dorian pillars holding up a stately green roof, two spiral towers surveying the whole thing with a regal air, like old kings ruling over a land of white-washed oak and copper inlays. I always call it the Palace of Green Porcelain in my head. It reminded me, and still does, of that place in the Time Machine, although of course it isn&#39;t as big and it&#39;s never been a museum. I always dreamed I would have a place like that, and even though my house is basically the only thing I&#39;ll ever have now, I still imagine it sometime.</p>\n\n<p>Anyway, I&#39;m rambling. To the point. Couple weeks ago, I was working on an essay for another dumb fuck who had waited until the last minute to do his history paper. 120$ for 5000 words? Baby, you fuckin&#39; <em>know</em> I was into that. I was sitting on the porch like usual, Spotify on, dog playing idly in the grass. It was late. Maybe three in the morning, not that it matters with my lifestyle. I happened to glance up at the house, and was surprised to see a light on in the tower nearest me, around midway up. The hipster wasn&#39;t around, never is on weekdays. No cars in the driveway, nothing. I thought at first that it was a thief maybe, but there were no other lights on, and it didn&#39;t seem to make sense that a thief would turn on one light and not the rest, especially up front where there might be shoes and stuff to trip over.</p>\n\n<p>As I watched the light, it turned off, then on again and off again quickly two more times. Then on three times more, longer, before repeating the short lights and going over it all again from the top. I&#39;m not an idiot. I did my boy scout shit and I remember morse code. Whoever was messing with the light was saying SOS. I stayed out there for a bit, then, cause I was getting creeped out, headed inside to finish the work after making sure the dog was alright for the night. I brushed it off as a one-time weird thing and was about to go to sleep when I heard, almost certainly from the direction of the Palace, a series of clattering knocks, like someone was hammering something, and a low, guttural howl.</p>\n\n<p>It was the howl that really bothered me. The rest I could explain via some douche being funny or some guy working on the house late at night for the hipster (unlikely, but possible). But that <em>noise.</em> It wasn&#39;t a dog&#39;s howl, or even a coyote, which we have sometimes around here. It was indescribably angry, articulate in its fury almost, like there were words behind it that couldn&#39;t be spoken. I didn&#39;t sleep that night.</p>\n\n<p>The next night, no problem. Same with the next. I almost forgot about it until, last night, the same thing happened again. SOS, SOS, SOS with the light, again and again, and this time it seemed faster and more frantic, almost desperate. I waited outside until it stopped this time, not because I was feeling brave or anything, but just because I&#39;m a dumb and curious fuck. It stopped at 4:28; I checked. And this time, I could tell that the clattering and the howl were coming from the house. Even worse, there seemed to be another voice this time, much sadder, adding to the noise.</p>\n\n<p>I don&#39;t know what to do. This seems like some freaky shit, if I&#39;m honest, and I&#39;m definitely not equipped to deal with...whatever it is. I&#39;ve been watching out the window all night; no SOS&#39;s, but there was some kind of noise. I don&#39;t know if it&#39;s related, but I&#39;m worried.. Any ideas of what I should do? Can&#39;t think of a whole lot of options, but maybe someone is really actually in trouble.</p>\n\n<p>UPDATE: On the advice of <a href=\"/u/Mommyhita1\">u/Mommyhita1</a>, I&#39;ve decided to call the cops and make up some story about seeing someone climb in. I&#39;m also gonna call my aunt--technically my greataunt, she was my dead greatuncle&#39;s sister--seeing as how she sold it to the hipster guy, and see if maybe she knows something about him I don&#39;t.</p>\n\n<p><a href=\"https://www.reddit.com/r/nosleep/comments/8je8g0/the_house_across_the_street_getting_ready_for/\">Part 2</a></p>\n</div>\n","author":"xnyrax"}