{"rank":"9","title":"On the wings of fate","id":"8j3fu1","url":"/r/nosleep/comments/8j3fu1/on_the_wings_of_fate/","time":"1526214415000","body":"<div class=\"md\"><p>It&#39;s the little things, isn&#39;t it? Those small moments that define our lives, and so often we don&#39;t see them for what they are. I certainly didn&#39;t.  </p>\n\n<p>Two days ago I was helping my brother clear out our grandmothers home after she passed away. No-one knows what happened to her; our mother handled everything after Grandma died, and she&#39;s always been a control freak.  </p>\n\n<p>I&#39;d just finished in the kitchen, and started on the garden shed. I&#39;d swear Grandma hadn&#39;t touched that shed since Grandpa passed. The sole, tiny window that faced the fence let in bleak light, just enough to see the filth covering everything.  </p>\n\n<p>I started with the tools, sorting and packing them into boxes, choking on the plumes of dust every time I moved something. Every so often I could hear a slight &quot;scritch, scratch&quot; coming from somewhere. Rats, probably.  </p>\n\n<p>The drawers in the workbench were next. Still locked. Grandpa never let us play in the shed when we were kids. He always said there was more joy to be had in the sun than in a dusty old shed with a dusty old man.  </p>\n\n<p>I grabbed Gramps old hand drill and started drilling out the locks.  </p>\n\n<p>&quot;Scritch, scratch. <em>Scrabble scrabble.</em>&quot;  </p>\n\n<p>The first drawer had an assortment of screws and nails. The second, nothing but empty jam jars with no lids. The third, well... Much as I hate to besmirch Gramps&#39; memory, there was a bunch of old stick mags in there. Probably for the best that Mum browbeat us into handling the cleanup then.  </p>\n\n<p>The fourth. &quot;Scritch, scratch.&quot;  </p>\n\n<p>The drawer started to shake as I drilled out the lock. What the hell did he have in there? I grabbed a rag, just in case it was a rat. The shaking stopped, and I opened the drawer, nice and slow. Inside was a butterfly. A beautiful monarch, perfectly formed with its antennae and wings intact. It looked odd though, almost metallic.  </p>\n\n<p>I reached out to pick it up, and its wings started to vibrate. I whipped my hand back as it took flight, heading straight for my face. Almost instinctually I tried to throw the rag over it. I hit my mark, but its wings cut through the cloth like it was air.  </p>\n\n<p>Before I knew it, it was on me, burrowing through my lips and down my throat. Blood and pieces of tooth sprayed out onto the bench as it forced its way down, settling somewhere in my sternum. The pain took a moment to register, lancing through me like a shockwave.  </p>\n\n<p>It&#39;s still in there now. Every so often I can feel its wings flutter, abrading my flesh. It only seems to do it when I think about how to remove it.  </p>\n\n<p>In the two nights since this happened I&#39;ve been having the most vivid dreams. Spires of crystalline metal fill my mind, as millions of butterflies flit between them. Each night I get to this place by constructing a living craft, part flesh and part machine. It surrounds me, cosseting and comforting me as I sleep, and it wends me towards my fate in that cold place.  </p>\n\n<p>I can&#39;t ignore it for much longer. I&#39;ve tried to tell my brother and my mother what&#39;s going on, but my passenger won&#39;t let me. I know if don&#39;t start building the craft soon, I&#39;m going to be filleted from the inside out. At least if I take it to the place we dreamed, it can only kill me.  </p>\n\n<p>My family will be safe.  </p>\n</div>\n","author":"ARandomStringOfWords"}