{"rank":"951","title":"On the Inside","id":"8j3pp6","url":"/r/nosleep/comments/8j3pp6/on_the_inside/","time":"1526217498000","body":"<div class=\"md\"><p>I don’t like to be away from home.  I was diagnosed with severe agoraphobia when I was twenty-five, and for years I tried to overcome it.  My father was still alive then, and he would always encourage me to go to therapy and slowly push my boundaries.  My primary triggers are open spaces and crowds of people, so if someone sees my house they often joke about how its in the middle of an open field.</p>\n\n<p>&nbsp;</p>\n\n<p>That’s by design.  My father built this house for me, you see, and it has views to a wide-open world while still having walls to keep me safe.  It has a good-sized back yard and garden, but its all enclosed in a ten-foot wooden fence so I don’t feel so exposed when I’m out in the sunshine.  He always said that he wanted me to have a place I could love now, but when I was ready, I could also use it as a jumping off point to a much wider world.  All I had to do was step out my front door.</p>\n\n<p>&nbsp;</p>\n\n<p>He died two years ago.  For the first six months after his death, I actually went out more, driven by the idea of making him proud.  But over time, any sense of pride or duty were smothered by my fear and grief.  It became easier to just avoid the world and sink into the stillness of my quiet little life.</p>\n\n<p>&nbsp;</p>\n\n<p>Not that my life is bad.  It isn’t, and the point of telling you all of this isn’t to make you feel sorry for me.  My father left me very comfortable financially, and I am lucky enough to have an online document review job I can do from home.  I’m healthy, fairly happy, and I have friends that come and visit me often.  </p>\n\n<p>&nbsp;</p>\n\n<p>I also have a wonderful two-year old cat named Tibbers.  My friend Alicia brought him to me a couple of months after my father passed away, and initially I was resistant to the idea.  I like animals, but I’ve never had a cat before.  It wasn’t until that first night that I knew I was going to keep him.  </p>\n\n<p>&nbsp;</p>\n\n<p>I had set up a box for him in the bathroom with high enough walls and enough weight in the bottom that I thought he couldn’t jump out or tip it over.  He cried for awhile, but I tried to ignore it, figuring it was best to let him tire out and go to sleep.  And it seemed to work.  The pitiful mewling from the bathroom tapered off and I finally felt myself drifting off to sleep.</p>\n\n<p>&nbsp;</p>\n\n<p>I awoke some time later to a warm pressure against my side.  I sleep on my stomach usually, and as I reached back I felt the kitten’s small furry body draped against me, his front paws and head on my back with his bottom half resting on the bed.  As I touched him, I felt a sleepy purr rumble through my fingertips and ribs.  That’s when I knew I loved him.</p>\n\n<p>&nbsp;</p>\n\n<p>Most nights, that’s still how Tibbers sleeps at least part of the night.  He’ll prowl around too, of course, but before the night is over I usually find him propped in that odd half-sitting, half-laying position against me, fast asleep.</p>\n\n<p>&nbsp;</p>\n\n<p>That’s why two nights ago, I didn’t think anything when I felt weight settling against my side.  I drifted back off contentedly, and it was some time later when reached down to pet Tibbers.  Instead of soft fur, I felt something hard and semi-rigid.  I quickly woke up, but in those first couple of seconds of coming out of the fog of sleep, I felt ridges and small, spikey protrusions in spots.  I let out a scream and fumbled for the light on the nightstand, screaming again at what was illuminated.</p>\n\n<p>&nbsp;</p>\n\n<p>My sheets had a small pool of blood on them, and it was easy to see from the wound on my side where it had come from.  Something had been biting me or sucking on my side, and as I jumped up from the bed, I saw it move under the sheets away from me.  Tibbers had come running into the room from some night-time exploration at the commotion I’d made and he saw it too.  The shape darted back and forth as though not sure which way to go, and that hesitation gave Tibbers the time he needed to jump on the bed to try and catch it.</p>\n\n<p>&nbsp;</p>\n\n<p>I felt my heart leap with hope and fear as he swatted at the shape, but it was too fast, shooting off the bed and onto the floor.  I caught a glimpse of it then—mottled brown skin that seemed to glisten and a shape that reminded me of some prehistoric creature.  I looked it up later and from the brief look I got, it is similar to a trilobite.</p>\n\n<p>&nbsp;</p>\n\n<p>But at the time, I was more concerned with killing it.  I keep a baseball bat in the corner of my room, and I reached for it even as I saw with dread where it was heading.  I grabbed the bat and flung it toward the air vent, trying to reroute it, but my aim was bad and the creature was undeterred.  It seemed too wide and thick to fit through the vent slats, but somehow it did, and it was gone.</p>\n\n<p>&nbsp;</p>\n\n<p>Tibbers went to the vent and peered down, giving a frustrated meow before looking back at me.  I  grabbed a flashlight from the kitchen and shined the light down into the vent, but I saw no sign of the thing.  After a few seconds of listening for movement with no results, I gave up and went to the bathroom to look at my wound.</p>\n\n<p>&nbsp;</p>\n\n<p>There was still blood on my side and my pajama shirt, but somehow the wound itself was gone.  I considered if I had just been mistaken in my sleepiness and panic, but I knew I had seen a round bite mark there about the size of a dime.  I shuddered remembering it, and I knew the memory was corroborated by the blood on me and the bed.  Still, there was little more I could do for it now, so I washed off the blood, wiped down my side with antiseptic, and started patrolling the house for other signs of the creature.</p>\n\n<p>&nbsp;</p>\n\n<p>I found none, but there was no way I was going back to sleep, so ultimately I closed all the vents and sat in my living room with the lights on until it was late enough in the morning that I could call a pest control company.  The pest guy came out later that morning, and I described in vague terms seeing some kind of animal, but I wasn’t sure what and it had headed into the vents.  I stressed that I needed them to check everything from top to bottom and get rid of it.  The older man nodded jovially, telling me it was likely a field mouse, and that he would track it down or at least find the way it had gotten in.</p>\n\n<p>&nbsp;</p>\n\n<p>Four hours later and he had patched two holes in my ductwork, but said he saw no sign of any pests other than a few spiders under the house.  He laughed, saying this was one of the cleanest houses he had ever seen, top to bottom, and he had no problem declaring it pest-free.  I knew he was patronizing me, but I think it was well-meant, as he could tell how worried I was.  My hope was that whatever that thing had been, it was gone and couldn’t come back.  After the pest guy was gone, I decided to take a long bath to try and relax.</p>\n\n<p>&nbsp;</p>\n\n<p>I had been in the water only a few minutes when I felt a sharp pain in my side.  It was the same spot where the bite mark had been.  Sitting up in the tub, I felt the spot and the skin was unbroken but it was sore to the touch.  As I ran my fingers over it a second time, I felt something beneath my skin move.  I stifled a scream, feeling sure it was my imagination or a muscle spasm.  I stood up and went dripping to the mirror so I could get a better view of my side.  I rubbed the spot again, but nothing happened.  Again, and still nothing.  I was about to give up when I saw a ripple pass across my flesh as something shifted underneath.</p>\n\n<p>&nbsp;</p>\n\n<p>This time I did scream.</p>\n\n<p>&nbsp;</p>\n\n<p>I called Alicia, frantic and crying, and within an hour she was there and taking me to the doctor’s office.  I kept my eyes closed most of the way there, Alicia rubbing my shoulder and trying to calm me down.  The only benefit to the state I was in was that I couldn’t get in a panic about the traveling or the people when I was in a panic already.  </p>\n\n<p>&nbsp;</p>\n\n<p>My regular general practitioner wasn’t in, so I saw a pleasant-looking woman in her fifties instead.  She listened to what we told her, though Alicia had not seen any sign of it moving herself, so she was having to recount what I’d told her when I got too upset.  Between the two of us, we got enough across for the doctor to look concerned and start physically examining my side.  She gave no indications of what she thought, but said she wanted to get x-rays and blood work.  Two hours later and she said there was no sign of anything showing up in imaging, and initial blood work showed no sign of an infection.  She would call after the more detailed labs came back, and if I continued having problems, she could order an MRI in a few days.</p>\n\n<p>&nbsp;</p>\n\n<p>“But,” she said in measured tones, “Keep in mind that it might be anxiety-related or otherwise psychosomatic.”</p>\n\n<p>&nbsp;</p>\n\n<p>“I’m not crazy.”</p>\n\n<p>&nbsp;</p>\n\n<p>She shook her head.  “I know that.  Not saying you are.  But the mind and the body are connected, and if you had a bad dream that stressed you out, your body can react to it in strange ways.  Just keep it in mind as an option.”</p>\n\n<p>&nbsp;</p>\n\n<p>The ride back to my house was a quiet one.  She would never say it, but I could tell Alicia thought it was in my head.  When she dropped me off, she offered to stay awhile, but I told her I just needed to rest.  In truth, while I was grateful for her help, I was hurt that she didn’t really believe me.  And I did need some peace and quiet after the commotion of the last day.</p>\n\n<p>&nbsp;</p>\n\n<p>The problem is that now I jump at every sound.  I don’t know if the creature is hiding somewhere in the house or is going to come back.  I don’t know what it did to me, but I can still feel something moving on the inside.</p>\n\n<p>&nbsp;</p>\n\n<p>And Tibbers won’t come around me anymore.  When I go near him, he hisses and runs.  The first time it happened, I cried a bit, but now I think I understand.</p>\n\n<p>&nbsp;</p>\n\n<p>This morning when I woke up, I heard soft singing.  At first I thought the radio was accidently playing music, but a glance at my nightstand showed it was inert and silent.  No, the singing was coming from somewhere else.  I stood up slowly, trying to pinpoint it.  After moving around a bit I knew it always stayed with me, that it was coming <em>from</em> me.</p>\n\n<p>&nbsp;</p>\n\n<p>It was my side.  I could hear faint music coming from where that thing attached itself to me.  </p>\n\n<p>&nbsp;</p>\n\n<p>Since I realized that, I’ve mainly been sitting and staring out the window.  I don’t know that there’s a place for me out there, and this house, my world, feels alien and unsafe now.  Even my own body seems foreign and hostile.  But I hear the singing clearer now—from my side, but in my head now too.</p>\n\n<p>&nbsp;</p>\n\n<p>It washes against me like cool waves—calming me, yes—but taking parts of me with it as it rolls away, back into some unknown sea.  I feel like sand crumbling and dissolving against a rising tide.  I’ve written all of this because I can feel myself fading more and more, feel myself caring less that its happening as the music in my head begins to swell.  </p>\n\n<p>&nbsp;</p>\n\n<p>I think I may go outside after all.  In just a little while.  </p>\n\n<p>&nbsp;</p>\n\n<p>After I finish listening to this song.</p>\n\n<p>&nbsp;</p>\n</div>\n","author":"Verastahl"}