{"rank":"10","title":"Re: Mystery of u/Malaykadoesrituals","id":"8j4d51","url":"/r/nosleep/comments/8j4d51/re_mystery_of_umalaykadoesrituals/","time":"1526223828000","body":"<div class=\"md\"><p>Hey. Anyone here remember Malayka Walters? The girl who tried the Hooded Man, Elevator Ritual, and the Midnight man ritual? But sadly, Midnight Man is her last ritual. According to her, &quot;Something&quot; followed her home after her doing the Elevator Ritual. Well, for those who didn&#39;t know the story, here is the exact story posted by her:</p>\n\n<p>----------------------------------------------------------------------------------------------------------------------------------------------------------</p>\n\n<p>Hi NoSleep! Makayla again. The feedback on the hooded man honestly blew me away, thank you for showing such an interest! Glad to see me endangering my sanity is entertaining people. (I’m absolutely joking).</p>\n\n<p>Link to the Hooded Man ritual I did on Wednesday night:<a href=\"http://www.reddit.com/r/nosleep/comments/2mxfmk/so_i_did_the_hooded_man_ritual/\" rel=\"nofollow\">http://www.reddit.com/r/nosleep/comments/2mxfmk/so_i_did_the_hooded_man_ritual/</a></p>\n\n<p>So, like two comments told me to do the elevator ritual, and I’d honestly never heard of it before this, and I was seriously intrigued. Read up on it, and it honestly didn’t need that much preparation so I figured it’d be quick and simple. It was honestly one of the most nerve wracking things I’ve done. (I did on Friday night and had every intention of uploading this on Sunday night, but shit broke loose).</p>\n\n<p>To anyone who isn’t familiar to the game, should probably read this: <a href=\"http://blahknow.blogspot.ca/2013/08/games-you-dont-want-to-play-3.html\" rel=\"nofollow\">http://blahknow.blogspot.ca/2013/08/games-you-dont-want-to-play-3.html</a></p>\n\n<p>There is an apartment building about a five minute walk away from my house and it has 20 floors, so finding a building wasn’t an issue. I started walking there around 4:30am, since I didn’t want anyone to up and around and using the elevator. That would be a bitch to be honest. Everything was dark and silent and getting in wasn’t a problem. There was like one security guard outside the gates, but he didn’t seem to care much since I’m a tame looking 20 year old white girl; probably looked like I was coming back from a late Friday night party. Summonin’ demons n shit in your general vicinity, son.</p>\n\n<p>There were stairs on the right and three elevators on the left, and everything was quiet. I got into one of the elevators (the one in the middle) and did the 4-2-6-2-10-5 combo, I won’t bore you with the details. When the elevator stopped at the 5th floor, I had to hold in a fucking scream because the “girl” was standing there almost in my face, and I had to try really, really hard not to stare her right in the fucking face. She wasn’t even a girl, she was more of a halo of dark energy that glowed really brightly, if that makes sense. I don’t remember much about her which is pretty fucking weird. She was wearing a dress of some sort though and had short dark hair.</p>\n\n<p>I’ve done Ouija boards, I’ve done rituals, hell, I didn’t even panic like this during the Hooded Man, but being in that elevator with that girl made me internally freak out like nothing else. I shakily pressed one, and boom, the elevator started going up to the 10th floor. And instead of being relieved that I was doing it right, it made me panic for no fucking reason. The doors opened, right on the hallway of the 10th floor. I’ve never seen it before, in normal circumstances, but it was so…dark. I couldn’t see the end of the corridor, but right at the very end, I could see this strange dark glowing light. I shakily stepped foot out of the elevator, and in my head, all I could hear was a stupid whiny girl’s voice going, ‘Where are you going, Makayla?’</p>\n\n<p>Of course the ritual said to ignore it, so I did, and leaving the girl standing there, I started walking down the hallway. As I progressed further past, the glowing light at the end of the hallway illuminated the space around me. The apartment doors on either side of me were rusted shut, like they hadn’t been opened in years, and as my eyes focused to the stupid darkness, I figured out that the red light was in fact a glowing cross. Not the Jesus crucification cross, but like, an addition sign if anything.</p>\n\n<p>It was uneventful, for the most part, but the air was heavy with something, and it was making me really fucking antsy. Also, it felt like, the more I walked towards the cross, the more it grew away from me. I was pretty fucking determined to get to it, until those stupid doors started banging and rattling and knocking and it was the most terrifying fucking thing, fuck my life. No ritual has ever made me book it to the elevator like this one. Thank god, I took care to take the one I came in, because I couldn’t think straight at the time. This might even sound rushed because I don’t know what the fuck I was doing, I just wanted out. I don’t even want to write about it. I reached it fairly quickly, and I swear to god, I fucking stabbed that call button like nothing else. It took like ten fucking decades to show up, and those doors didn’t stop rattling until I was inside the elevator and hazily doing the combo.</p>\n\n<p>I have never been more relieved to reach that first fucking floor. Everything looked normal, no more heavy air, no more darkness, security guard was still there, and yet I couldn’t stop fucking panicking. I ran home so fucking fast, and I know it sounds embarrassing now, because I didn’t even do anything, but I could not stop crying. I think the guard thought I was on something.</p>\n\n<p>I got home, I watched a movie to make myself feel better. I even started writing the first part of this post, so if the first part sounds…cheerier than the second, it’s because I wasn’t as terrified then, as I am now. I even remember replying to someone’s reddit comment, saying I had done the ritual and I was alive and well and would write about it the following day.</p>\n\n<p>I think I passed out around 7? Because I don’t remember falling asleep.</p>\n\n<p>I woke up on that floor.</p>\n\n<p>It was so fucking terrifying because I had been on my couch, and the ritual had said that if you made it home you wouldn’t be taken back, but yet there I was, passed out in that stupid carpeted hallway, with the air heavy around me, and no sunlight anywhere. There was no cross, but the panic I felt was like nothing fucking else, and I swear to god I’ve never run home this fast.</p>\n\n<p>I didn’t even want to remember it, I didn’t want to write about it, I didn’t want to do anything, which is why I procrastinated making a post for so long. Something about this ritual fucking unhinged me, and although nothing happened the second time, just waking up there made me fucking nope. Today I finally built up the nerve to write about it, and I feel a bit better now, but I’m so fucking panicky and I feel so followed by something and I have no idea why. There’s nothing THERE. I haven’t slept properly since Sunday night, I feel like there’s someone looking at me all the time, and I want it to STOP.</p>\n\n<p>A lot of people wanted me to do the midnight man, 3 kings and hide and seek alone, and I had plans to do the midnight man tonight, but after how shaken I still am, I think I’ll hold these off until the end of the week.</p>\n\n<p>Thank you for the feedback, thank you for reading.</p>\n\n<p>MAKE IT STOP. MAKE IT STOP. I FEEL LIKE SOMETHING&#39;S GOING TO JUMP ME I FEEL LIKE THERE&#39;S SOMEONE IN MY HOUSE, EVEN THOUGH IM HOME ALONE. STOPSTOSPTOP.</p>\n\n<p>----------------------------------------------------------------------------------------------------------------------------------------------------------</p>\n\n<p>Then after that, she posted another thread named &quot;<strong>My name is Makayla Walters, and my fate is my own fault.&quot;</strong> Link:<a href=\"https://www.reddit.com/r/nosleep/comments/2o9md1/my_name_is_makayla_walters_and_my_fate_is_my_own/\" rel=\"nofollow\">https://www.reddit.com/r/nosleep/comments/2o9md1/my_name_is_makayla_walters_and_my_fate_is_my_own/</a></p>\n\n<p>I was just wondering what happened to her or does anyone have news about her because she claims that she is being &#39;Tortured&#39; in the other life according to her post which was deleted by the mods because it&#39;s a none-story. She even managed to post a thread using &quot;Morse Code&quot; but then it was also deleted. According to those who have seen it, here is what it means when translated:</p>\n\n<p>HEY¿HAVE¿ME¿¿THEY¿HAVE¿ME¿ITS¿BEEN¿DAYS¿ITS¿BEEN¿YEARS¿MY¿HAIR¿IS¿FALLING¿OUT¿I¿NEED¿HELP¿CO¿ME¿GET¿ME¿I¿HAVE¿BEEN¿TORTURED¿THE¿HOUS¿E¿IS¿FALLING¿APART¿THE¿LAPTOP¿HASNT¿DIED¿YET¿IM¿STUCK¿IN¿AN¿ETERNAL¿LOOP¿THEY¿SCREAM¿AT¿ME¿AND¿THEY¿SCRATCH¿ME¿AND¿IC¿ANT¿GET¿OUT¿DONT¿TRY¿TO¿HELP¿ME¿TAKE¿THIS¿AS¿A¿WARNING¿IT¿WONT¿SHOW¿MY¿WORDS¿I¿CAN¿T¿DO¿ANYTHING</p>\n\n<p>It&#39;s a little bit weird haha. And by her next posts, people don&#39;t believe that it was her posting it because the capitalization and grammar is so different. Then, her last post on reddit was entitled &quot;im seriously scared for my safety right now: am i possessed?&quot; is deleted too and no one knows what was written in that thread.</p>\n\n<p>That&#39;s all! I was just wondering if someone have an idea of where she is right now haha. Thank you, reddit! Sorry for my grammar, I&#39;m not fluent in english.</p>\n</div>\n","author":"PRL-ProdigY"}