{"rank":"9","title":"The sibbling","id":"8j4id4","url":"/r/nosleep/comments/8j4id4/the_sibbling/","time":"1526225109000","body":"<div class=\"md\"><p>Nothing happened when I was younger, but in my early teens I started to notice weird occurrences (and since then I&#39;ve read that it&#39;s &quot;common&quot; for things to start around teenage girls&#39; adolescences. . .). The very first thing happened my freshman year of high school when I had a sleepover, and several girls brought cameras and took pictures. When they got their photos back, there were pictures in two separate rolls which seemed to have white vortex shapes swooping across me, obscuring my face and upper body.</p>\n\n<p>Immediately after this, an odd tapping began coming from my bedroom walls. At first I thought nothing of it because it&#39;s obviously a very old house and they creak. But as I heard it more frequently I started realizing that it had some very strange characteristics. First of all, it only ever seemed to happen as I got into bed when I was in that receptive almost-asleep stage. (I had my desk in there, too, where I would spend many long hours doing homework, so I would have noticed if they had come at other times.) Also, they alternated walls; they would rapidly switch from one to another, and sometimes they&#39;d go simultaneously on two opposite walls, then switch suddenly to the other two opposite walls.</p>\n\n<p>Then something even more dramatic happened. In childhood and up until I was 17 I had bunk beds, which were actually great since I was always having friends spend the night (my house was where we all hung out due to size, location, and how well my parents got along with everyone). One night I was had just gotten into bed on the top bunk, when suddenly the sheets were jerked sharply towards the wall, pulling partially off me. It was almost as if someone were in the bottom bunk, playing a trick on me or trying to get my attention. So that was very strange, but felt almost playful, so I didn&#39;t feel too scared by it. But it was VERY odd, nonetheless.</p>\n\n<p>When I was 17 I got a new bed so we started dismantling the bunk bed, and first gave away the top mattress to our neighbors who had a young son, so for a little while I used the top bunk as a sort of shelf (but it still had the solid railing so it was boxed in on all sides). One day I put a pile of textbooks and magazines on the top bunk in some boxes I had sitting there, and was on the computer on the other side of the room typing something up, my back turned. Suddenly there was a loud series of quick crashes and I whirled around just in time to see my last textbook sliding over the side of the top bunk and cascade to the floor on top of the others books. Since the railing is about ten inches high on all sides and the boxes were about the same AND the pile was not that tall, they would have had to have somehow ‘jumped&#39; over the both the side of the box and then the side of the bed!</p>\n\n<p>The creepiest experience was when a friend was spending the night, and we were getting ready for bed, and my cat (who is the most docile, sweet, and gentle cat I&#39;ve ever known), was curled up on my lap purring loudly. My friend switched off the light and he continued to purr warmly, but not ten seconds later he drastically changed on the turn of a dime. His body suddenly stiffened, all his fur rose up completely on end, he dug his claws deep into my thigh (enough to draw blood!), and started to growl loudly. The growls quickly escalated into horrible piercing noises, like shrieks, at the top of his lungs that I have NEVER heard any cat make. The whole time his entire body was rigid and tense also. Even aside from that, there was a general off feeling in the room, and my friend quickly rushed up to turn the light back on. Almost immediately the claws pulled out from my skin, and he relaxed and settled down, but still seemed unsettled. That only happened once in his whole life, but it remains extremely disconcerting to me, to this day.[...]</p>\n\n<p>Then last year, one of the strangest things yet happened to me. I was home from London on break, and though nothing of note had happened for years, that changed. I was alone because my parents were at work, but out of habit I locked the bathroom door anyway when I went to take a shower. Nothing was noticeably amiss in there; everything seemed in order. I laid my clothes down on the floor and stepped straight into the bathtub where I took a really long shower. After a long time I opened the curtain back up and I immediately and strongly felt like someone had been in there unnoticed while I was showering, but I checked the lock (which is an old-fashioned latch on the inside) and it was still fastened. I grabbed a towel, stepped out, then noticed something really strange.</p>\n\n<p>The bottle of baby powder (which we never use, it&#39;s typically on the bottom shelf in a basket) was not only out but lying open right in the very middle of the bathroom floor, with its contents scattered everywhere in the entrance area. Footsteps led through it and onto the dark yellow bathmat, stopping short of the tub. At first I though, &quot;That&#39;s strange, I REALLY don&#39;t remember it being there but I guess I must have walked through it to get here.&quot; I was almost positive that it hadn&#39;t been there since it was so clearly right in the middle of where I would have walked, and such an obvious mess, but it was the only thing I could think of as an explanation. But then I noticed that one of the footsteps was half on the mat, half on my jeans, and that there was another obvious footprint on my jeans after that. Then I thought (though even more skeptically), that I must have stepped ON my jeans somehow before getting in, even though I was convinced that I had stepped straight out of them and gotten directly in. Still, it was the only explanation I could think of. However, when I looked more closely at the prints, I couldn&#39;t convince myself of anything; they were significantly smaller than mine, almost like a child&#39;s.</p>\n\n<p>After that day and in retrospect everything that has happened almost seems like something a child would do; they&#39;re all fairly playful or something your younger sibling would do.</p>\n\n<p>Writer:-UNKNOWN.</p>\n</div>\n","author":"Vibhorthe1st"}