{"rank":"41","title":"Great Cherokee Spirits Linger: They Shouldn't Have Built Will Rogers Turnpike","id":"8j4nkv","url":"/r/nosleep/comments/8j4nkv/great_cherokee_spirits_linger_they_shouldnt_have/","time":"1526226348000","body":"<div class=\"md\"><p><a href=\"https://www.reddit.com/r/nosleep/comments/8hoyfh/great_cherokee_spirits_linger_the_screaming_storm/\">[PT 1]</a> </p>\n\n<p>Will Rogers Turnpike is an abandoned segment of Interstate 44, a road that cuts diagonally across Oklahoma. The reasons for its closing are hard to understand. I’ve witnessed first hand, a potentially massive network of small tunnels, the road slowly becoming swiss cheese. Leaving more entrances. More exits. Exits for the things with the eyes that glow in the dark and hide in the light. They gave me nasty scars. And sometimes I think I can still smell the sulfur. </p>\n\n<p>It was a month after Dusty’s funeral and I’d met up with Kasey, Tom, and Hank twice after that night. I found their company not entirely dissimilar to Dusty’s, and I think it helped all of us with the grief we all felt. Our nights out drinking were a nice enough break from our daily lives. Only Tom and Hank had families at home, kind wives and traces of children who grew up and sometimes visit. </p>\n\n<p>Kasey was different, he was sadder, but he wouldn’t show it until he was really drunk. I think he felt guilty for not seeing his little brother before his passing. He’d asked me what he was like, what he was doing in his last days, nodding as I told him stories. I didn’t expect him to start back where Dusty left off, and neither did he plan to, until he started looking through those same books I delivered to Dusty before, now accompanied by attentive notes only Dusty could’ve written. </p>\n\n<p>I saw all of this when the four of us planned to meet at our new usual place, The Cellar Dweller, a place decorated with tacky velvet and dim lights. The problem came up when Kasey, usually the first there, didn’t show up, we waited for awhile and decided to call. He didn’t pick up and I volunteered to go check up on him while the others got their drinks, but they’re loyal and insisted on coming with me. </p>\n\n<p>When we got to his  it all looked fine enough, the fence was falling apart and the lawn could use some work, but that’s how it always was. No sign of any break in like I feared. I rang the doorbell, remembered it didn’t work and knocked. He came to the door just as I was about to knock again. He had lost track of time; he brought us inside to show us what’d kept him. Pages on pages of symbols, words, and sketches of anatomy. It was Dusty’s stuff.</p>\n\n<p>What he’d been specifically focused on was the last pages of a notebook. Dusty had written all over it, filled every space with details of his craziest thoughts, wild theories about real, mythological monsters in Tulsa County. Flipping through I briefly read, “truth might be stranger than fiction”, a common saying, but one that’s basically taken over my life since that week. </p>\n\n<p>“What is all this?” Hank asked.</p>\n\n<p>“What Dusty’s free time went into,” I answered I’d seen all of this before. Except for one thing. “Where’d you find this, Kasey?” I picked up a segment of a map, a picture from satellite actually, with roads traced in red marker. </p>\n\n<p>“I made it.” </p>\n\n<p>“How’d you do that?”</p>\n\n<p>“I might be old but I figured out how to use a printer.” </p>\n\n<p>“Yeah, ‘cause I taught you.” Tom laughed. “So,” he assessed the pile of books and papers, “what’d you think about this?” </p>\n\n<p>“I’ve got no clue. Did you know about this stuff?” Kasey looked at me. I noticed Hank was taking this in quietly, standing in the doorway awkwardly. </p>\n\n<p>“Yeah… It’s… Not as crazy as it seems. I didn’t always believe him, but he expected that.” I tried to tell the truth, but not disrespect him. I added, “I could respect it.” </p>\n\n<p>“Yeah, yeah… Of course. You believe it?” Kasey looked at the map, scratching his beard.</p>\n\n<p>“Well… I think there’s definitely some truth.” I was hesitant to admit it, but I was fairly sure of at least one small group of Little People existing at some point in the area. So I was relieved when he agreed with me. </p>\n\n<p>“So, we going to the Dweller or what?” Hank fidgeted. Kasey might’ve coped by digging deep into what he missed, but Hank distanced himself. It’s how he dealt with his parents, after all. </p>\n\n<p>“Yeah, yeah… Of course. Sorry, just got caught up…”  Kasey started to pull himself away, his focus peeling from the map to us like velcro. On the way out I got quiet and made silent plans to look into Dusty’s work soon.</p>\n\n<p>The rest of the night went well, they continued to respect my choice not to drink and we stayed until eleven o’clock. Which is an old man’s three AM.</p>\n\n<p>The next evening, Sunday, Kasey and I drove together to Will Rogers Turnpike. The sun painted the sky orange, but it was already getting dark, through the fragmented clouds. The air was hot, a little humid. A good day to search for… Something. </p>\n\n<p>Kasy filled me in, Dusty had been planning to come here and investigate for “entrances to an underworld” just before he passed. </p>\n\n<p>Part of me thought, this is crazy, but the dominant thought was clear. Dusty would’ve wanted this. And besides, we might find something, right?</p>\n\n<p>We started just by walking the road, just generally looking around and talking for an hour. We didn’t find anything, what did we expect? I don’t know. Eventually, we sat, a little defeated, but our hopes weren’t high in the first place. Sitting there I realized we weren’t looking for any little people or networks of tunnels. We were looking for Dusty. Unfortunately, we wouldn&#39;t find Dusty or little people tunnels. Or so I thought.</p>\n\n<p>That’s when I saw the first set of shiny eyes floating in the dark. Red like an animal, but most animal’s eyes shine when hit by light. So, I shined my phone’s flashlight at it. Before the light hit it it was already gone, like it had sensed the light would come.</p>\n\n<p>“You see that?” I tapped Kasey, who was staring off into space. </p>\n\n<p>“What?”</p>\n\n<p>“Something’s over there.”  </p>\n\n<p>“You’re kidding.” </p>\n\n<p>I got up, approaching where I saw the tiny floating orbs. Looking at the ground with my phone’s light. I lightly held my breath. On the edge of the light, something suddenly, silently ran by, I only saw a shadow for a moment, and I quickly felt a cut on my ankle, I yelped.</p>\n\n<p>“Something cut me!” </p>\n\n<p>“Like a thorn?” </p>\n\n<p>“Like a…” I examined the wound. “Like a knife! It’s not very deep.” I sat on the grass, taking a tissue to stop the light bleeding. Kasey came over, looking for what could have cut me. He called me over.</p>\n\n<p>“I’ll be damned.” </p>\n\n<p>It was a hole, a deep tunnel entrance, the perfect size for a large child to stand in, or a grown man to crouch in. It was dug with seemingly no regard for the surface, an edge of the road just missing, a few feet away I saw it buried in the grass like it was thrown aside. The tunnel went down semi-diagonally, quickly leveling out into a straighter line, and from there I couldn’t see. </p>\n\n<p>“Might as well check it out right?” I said, crouching down, my ankles popping. </p>\n\n<p>“Drop something down there, see if anything moves. Don’t want you getting eaten up by a ‘coon or something.” Kasey, almost surprisingly, supported the idea.</p>\n\n<p>I dropped a couple rocks in, waited and watched. Then finally decided it was clear. It wasn’t.</p>\n\n<p>I lowered myself in, feet first, and slid down a few inches into the dirt tunnel. Keeping my phone’s light out I looked down the tunnel.</p>\n\n<p>It was extensive. Several yards long with gangly roots sticking out of the dirty ceiling. I moved deeper and deeper. The first thing I noticed was the smell of rotten eggs, sulfur. It was strongest in the front of the tunnel, and dissipated as I got farther in.</p>\n\n<p>The earth silently shifted around me, I was worried I wouldn’t be able to get out, but a sound drew me in. It should have scared me off, it was meant to. As I crawled closer I began to hear it clearer. A small, angry voice making a chirping sound like “t-sho”.</p>\n\n<p>I couldn’t tell if I was getting closer to it, or if it was getting closer to me. But there was something off about it. Something that I felt was angry, it tried to scare me off, but it wouldn’t hesitate to do… Whatever horrible things it’d do to a trespasser. It strikes me again now, that I had no idea what I was against. I’m still unsure of the extent of the horrors in those tunnels. </p>\n\n<p>“Whatcha’ see?” Kasey called, snapping me out of my curious trance. </p>\n\n<p>“N-nothing!” I stammered back. Abruptly, unsettlingly, the angered chirps stopped. I could hear something moving, what sounded like a dozen pattering footsteps, it was right around the corner. </p>\n\n<p>“Well come on back! Getting me worried… Probably snakes...” </p>\n\n<p>“Yeah..! Yeah!” As fast as I could, I awkwardly turned around and “ran” with my head between my legs. It was gaining up with me fast, the sulfur smell suddenly became so strong I nearly vomited, but I couldn’t stop. Not with that thing at my back.</p>\n\n<p>The exit was close. Adrenaline filled my fear, my head drug against the dirt, desperate to stand straight. My back was stabbed, and whatever pierced me was pulled down, drawing more and more blood by the inch.</p>\n\n<p>So close. I push up, kick at my attacker and hold out my arms for Kasey’s help. </p>\n\n<p>I yelped through clenched teeth when I felt something pierce my shoe, and then my foot. When I got out my shoe was entirely gone, my sock was in shreds, and I was going to have nasty scars. I felt my blood pressure start to decline. </p>\n\n<p>Kasey wasted no time, he saw something in that hole that I didn’t, and he wasn’t going to wait for it to climb out. He pushed me forward as soon as I got on my feet, we stumbled to his car together. And as I looked back, I could see ten pairs of tiny, red orbs rising from the ground. Dirt flew up as a new hole burst open and five other pairs of eyes came scrambling out.</p>\n\n<p>Screaming words I don’t remember in pain, I threw myself into the backseat, the last thing I saw before the door slammed were the orbs getting bigger- no, closer. </p>\n\n<p>“I’m gonna get you to a hospital.” Kasey had never sounded so worried before. “Start damn it, start.” He struggled with the ignition. </p>\n\n<p>“I’m so tired.” I thought. I couldn’t do much else than think, the cut was deep and I bleeding everywhere. My reality became entirely abstract as I quickly entered a form of shock. I turned my head to the side, looking towards Kasey. </p>\n\n<p>Thump. </p>\n\n<p>One of those things was on the fucking car. Kasey screamed and the car started, and the tires screeched out of there. I heard glass shatter, Kasey scream, and whatever broke the window gurgled. We swerved left and right, my blood felt like ice. I realized there were tears rolling down my face, my leg muscles were cramping, I couldn’t move, no matter how hard I tried. My mind was somewhere else. I imagined I was one of the tears, hitting soil, finding a seed, watering it until it blossomed into a beautiful white rose. The Cherokee Rose.</p>\n\n<p>Rosa laevigata… Dusty grew those… </p>\n\n<p>An invasive species.</p>\n\n<p>I was taken to the ER. My eyes were bulging when I got there. Turns out I wasn’t just torn up, I was envenomed. Whatever it was, it was similar to Gila Monster venom, one of the few venomous lizards in the world. Kasey got stitches on his face, the glass cut it up his left cheek real bad. We got out of there alive though. What would the others think, we wondered. </p>\n\n<p>I don’t know what was down there. But I went back two weeks later, in the morning, and found seven more entrances to what I don’t doubt is a massive tunnel system that those things live in. </p>\n\n<p>They shouldn’t have built that road, it pissed something off. And I can’t say if, or for how long, they’re going to stay in those tunnels or not. </p>\n</div>\n","author":"That_Guy_Of_Place"}