{"rank":"3","title":"What Goes On Behind You!","id":"8j55y6","url":"/r/nosleep/comments/8j55y6/what_goes_on_behind_you/","time":"1526230628000","body":"<div class=\"md\"><p>Let me start this off by saying that there will be heavy grammatical errors and run on sentences, for I am no English major or story writer but ive felt the need to share what me and my two cousins experienced when we was in our teens.</p>\n\n<p>It starts off as a typical night. We are all staying over at our Grandmothers house for the night. We do this on occasion as a way to hang out together and spend some time with our family. I was always the one who brought over the Xbox 360 so we could hook it up and play some games. The way my Grandmothers house is constructed is kinda hard to explain, so when you walk up the stairs and enter the first door of the house this is a long almost hallway like area with windows and a way to the laundry room. This is just like a closed porch area of the house for then there is the main door that leads into the house itself. This is where we always play at so they can shut the main house door and drown out some of the noise we make. This makes the room already have a creepy feel because it is always cold and has like an old mildew smell to it.</p>\n\n<p>So I bring over my small LCD tv and Xbox 360 and we start to play some games. Around 1am we are split screening some Black Ops Zombies. My two cousins are playing and im behind them watching. Everything is going good until I get this strange feeling on the back of my neck, as if there is something happening behind me. I brush it off and continue to watch.</p>\n\n<p>About fifteen minutes later I decide to get up and head to the pantry to find a snack since they are still alive on Zombies. When I enter the pantry and start to look around for some food I get that feeling again. The hairs on the back of my neck and arms start to stand up. Its that feeling of someone or something standing behind you, just staring at you giving that feeling of being watched. I quickly leave the pantry and head back out to the porch area. I bring up the feelings I felt to my cousins but they are to into the game to really care what I am saying. So I sit back down and start to think.</p>\n\n<p>I come up with this idea to take pictures with my phone behind my head without looking. It felt like a good idea at the time cause I was thinking that if I turned around and snapped a photo, if there was something there it would hide. Little did I know I was about to see things that still give me chills to this day!</p>\n\n<p>I took about twenty pictures back to back behind my head till I decided to look at them. The first ten were all clear plain images of nothing but the stuff behind me, but then the pictures started to get more out of focus and blurry even though they were all taken back to back and still. Then I saw it, A face in the plants staring directly at the camera. A deep chill came over my body as I reeled in what I just saw. I was frozen in fear and what was happening when I wasnt looking. I finally got up the courage to look at some more pictures. Then in the next photo the face is now facing a bunny statue for a plant and the statue itself is looking back looking like they are yelling at each other. Then it the top left of the photo a tall white figure of a man with a pinhead is visible, Eyes hair and all. At this point I dont know what to do. Im panicking on the inside. So I turn off the 360 while there still playing and yell, YOU GOTTA SEE THIS, TELL ME IM NOT CRAZY! It takes them a couple minutes to realize what they are looking at. Then I can just see the fear taking over there bodies as they finally seen what I was talking about. We run into the main part of the house and lock and barricade the door. We all lay together on the floor untill we finally dozed off into a sleep.</p>\n\n<p>The next morning we all wake up and talk about what we had seen. Since it was daylight outside they all seemed to wanna act tough and just brush it off as being tired and seeing things that were not there. I Know what i saw though, and i will never forget these images for the rest of my life!</p>\n\n<p>Here are the photos of the ghost I took with my old Iphone S3. <a href=\"https://imgur.com/a/4fmAiuK\" rel=\"nofollow\">https://imgur.com/a/4fmAiuK</a></p>\n</div>\n","author":"EarlyPatrick"}