{"rank":"0","title":"I think something is followed me","id":"8j56fy","url":"/r/nosleep/comments/8j56fy/i_think_something_is_followed_me/","time":"1526230735000","body":"<div class=\"md\"><p>Hello everyone,\nfirst off, this is my very first time writing anything like this because usually I just don&#39;t experience paranormal stuff. I also want to mention that this is a real problem I have, but don&#39;t expect me to get thrown against a wall or anything, it isn&#39;t that wild. And lastly, English isn&#39;t my first language and I am writing this in my phone, so if I make any mistakes I am really sorry!</p>\n\n<p>So just a little background info, I am from Estonia and this all takes place in my hometown Pärnu. In Pärnu, we have this work programme thingy that kids can join in the summer (i&#39;m not sure if i am allowed to say their name so i&#39;ll call it M). So last year i decided to join M to earn some extra cash during my summer break. They talk to each kid and give them a suitable job and i was somehow given a graveyard cleaning job. It was very basic and easy, I just had to rake leaves and put up with other kids who didn&#39;t do their jobs. </p>\n\n<p>Everything was totally okay at first but then one day, i saw this one specific grave. Now usually the graves are very well kept and look pleasant but this one hadn&#39;t been tended to for a long while. I felt bad and guessed that maybe the person who used to take care of it passed away aswell or something, because this was VERY old. So out of sympathy I started tending to it. It was about a 2m×2m grave and it was built out of gray bricks. It had a very old and broken plagg and weeds were growing everywhere. I tried my best to rake all of the leaves away and make it somewhat presentable. </p>\n\n<p>Now the reason i bring this up, is because I think this grave was the thing that started all of this for me. The same night I had cleaned it, I had a weird vision type of thing in my bed. I was lying on my side and facing away from the wall and when I tried to close my eyes, I saw a dark shadowy hand reach for me. I got Terrified and of course shot up and looked behind me but there was nothing there. I thought it was just me being tired but when I tried to close my eyes, it happened again. It KEPT happening and i was very confused. Because i am a stupid, i automatically assumed that it was a ghost, because i was always uneasy working at the graveyard. I thought that maybe a ghost had followed me or something. \nIn my tired state, i started talking to it (???) in my head and saying sorry over and over again and the weird part is that after this, it actually went away? I am not joking, this weird shadow hand stopped appearing and i could finally sleep. </p>\n\n<p>After that night and that week long job, things in my house started getting weird aswell.\nMy house isn&#39;t haunted, 100%, but after this grave/job I have seen and heard a few very weird things.\nI think the very first thing that happened was when i was just sitting upstairs and working on something on my desk. Everything was fine and i was home alone except for my cat and dog when i suddenly hear this giant crash, so loud that i physically jumped. My first thought was that maybe my dog had been walking around and knocked something very heavy over so i went downstairs but everything was in it&#39;s place, even my dog was in her bed. I swear on my name i heard it but nothing was out of place. I had a weird gut feeling but went back upstairs.</p>\n\n<p>After this first encounter, I have been hearing sounds, my cat and dog have been staring at nothing, I have woken up with small scratches and I keep seeing shadow people in the corners of my eyes. \nI am paranoid as hell cause this has NEVER happened to me before, I am just asking to see if anyone knows how to send this ghost/spirit thing back to the graveyard. \nI don&#39;t want to keep writing this cause it is long enough already but just please comment on how this can be fixed, i really need help.\nThank you for reading and if want more details or have any questions then just ask, i will try to give as much details as possible.</p>\n</div>\n","author":"KatiOnce"}