{"rank":"16","title":"I am a detective in a child disappearance case","id":"8j57rp","url":"/r/nosleep/comments/8j57rp/i_am_a_detective_in_a_child_disappearance_case/","time":"1526231035000","body":"<div class=\"md\"><p>Okay so to give a brief, I am a detective that is now working on a case of a missing child, and this was what was writen on the last few pages of his diary, we haven&#39;t found the child yet.</p>\n\n<h2></h2>\n\n<p>Monday</p>\n\n<p>We&#39;ve moved into this house a few weeks ago, and the neighborhood doesn&#39;t seem to have the best history, people at my school keep telling stories about things that happened with who lived at their houses before them, and today, my friend, Mike, told me a story about people who used to live at my house.</p>\n\n<p>He told me that our new house is one of the houses with the worst reputation in the area, it is said that once apon a time, a woman and her lonely child used to live in this house, but one day, her husband (who is also said to have tortured her and hated her) claimed that her son was from another father, and because of that, they put the woman in prison, and took her child from her.</p>\n\n<p>Her child was sent to live with some farmers, who made him work as a servant for them, they never fed him well, and they hit him hard everyday, and because of that, the boy died.</p>\n\n<p>When the woman heard about the death of her son, she became extremely depressed, and she started crying and crying everyday, she refused to eat anything, and her eyes became bright red because she cried all the time.</p>\n\n<p>And one day, the guards went to give her the food that she always just refuses, but when they arrived there, they found her dead.</p>\n\n<p>They left her in her cell and called for someone to take her away, and when they brought someone to take her away the next day, they found her body missing, with no traces of anyone taking her away.</p>\n\n<p>Then after all of these events, her husband, who lived in her house, was found dead the next day, as well as the farmers that used her child as a servant.</p>\n\n<p>Now urban legend says, that the &quot;Red eyed woman&quot;, after taking revenge, now is back living in this house.</p>\n\n<p>Some hocus-pocus if you ask me...</p>\n\n<h2></h2>\n\n<p>Wednesday</p>\n\n<p>Okay so, I&#39;m starting to believe the story Mike told me, because when I look across the hallway, I can see something like a laser pointer on the chair, it&#39;s bizarre and it really freaks me out, I&#39;ll keep this updated with anything that happens to me.</p>\n\n<h2></h2>\n\n<p>Thursday</p>\n\n<p>Okay so this is getting out of hand, I saw the pair of laser spots yesterday night as well, and I got up this time and called out if anyone was there, and the chair where the laser pointers seem to land feel down, I sprinted at top speed to get back to my room and I locked the door and stayed awake all night,  I&#39;m going tonight to that chair, and I&#39;ll update this again on what happens.</p>\n\n<h2></h2>\n\n<p>This is where the diary stops, we haven&#39;t found any traces to kidnapping or murder, we don&#39;t know what happened.</p>\n</div>\n","author":"AbdelrahmanAmrDesign"}