{"rank":"8","title":"I don’t feel like myself","id":"8j59oh","url":"/r/nosleep/comments/8j59oh/i_dont_feel_like_myself/","time":"1526231449000","body":"<div class=\"md\"><p>I don’t think I am the same person anymore </p>\n\n<p>Let me clarify; I know physically I am the same person, but I don’t feel like I am ME? Understand? Yes? No? Oh well let me try to tell you... </p>\n\n<p>I am truly alone, i mean I have family, and people around me on a constant basis, but I don’t feel like I do? It’s weird. My life was normal in a sense, but it all seemed to change in December. My fiancé broke up with and kicked me out of our house. She kicked me out after I found out that she was cheating on me with multiple men; including my coworker/ best friend at the time. Since that day, I’ve not felt the same. When I look in the mirror I see myself, but it doesn’t feel like me. </p>\n\n<p>I swear I seen my reflection turn its head while I was looking at it.. I have this sense of dread and now I don’t feel as if I’m alone.. something is not right, I just can’t put my finger on it. Weird noises permeate from the bathroom and I have removed all mirrors from my lowly apartment. The noises have progressed from small scratching to loud banging. The banging is so loud it is making the house shake. Yet no one seems to hear them, or at least no neighbors have reported a noise complaint. </p>\n\n<p>Today I woke up and I have a weird mark on my scalp. It’s in the shape of a Leo sign. You know the zodiac symbol? It’s like a burn, but It doesn’t hurt. How would this happen and more importantly why? My sleep pattern has changed as well. I used to go to bed around 10pm and wake up around 5-6am everyday; regardless of the situation. Now I can’t fall asleep till 5am and I awake at 7, 9, 11, 1, 3, and 5pm. I can’t seem to stay awake, even though I know I have gotten enough rest. My mind is racing and I can’t seem to convey my thoughts accordingly. Everything is random and I don’t know if you can tell by my writing. </p>\n\n<p>I swear I just heard my voice from the bathroom.  What is my voice though? Is it what I really sound like or is it what my mind perceives me to sound like. How is it possible for this happen? I can hear it now as I write. I’m talking about my life, giving a run down of my whole entire history. Everything from the moment I was born, to the time I watched my father rape my mother in front of me in a drunken rage, to the time I won my first golf tournament. I went to look and nothing is there; except a new mirror. </p>\n\n<p>Where did this mirror come from? I know I didn’t purchase one, as I haven’t left my apartment in weeks. Something is truly not right</p>\n\n<p>I will post a update on my situation later, I’m tired and feel as if I need to sleep, but first I need to use the bathroom </p>\n</div>\n","author":"datnative031"}