{"rank":"3329","title":"I’ve Been Saying Happy Mother’s Day to the Wrong Woman My Entire Life","id":"8j5f5o","url":"/r/nosleep/comments/8j5f5o/ive_been_saying_happy_mothers_day_to_the_wrong/","time":"1526232715000","body":"<div class=\"md\"><p>I was born in Austin, Texas in 1989. My mom raised me as a single parent pretty much her entire life. Sure, she’d have boyfriends now and then but it never became anything serious. </p>\n\n<p>“You’re the only man I need in my life, Johnny,” she’d say after every swift breakup. Deep down, I knew that she meant it. </p>\n\n<p>Three years ago I finally moved out of my moms and relocated from Austin to Des Moines, Iowa. I’d found a cushy job as a marketer for a large company. My mom was pretty upset about it considering we’d only had each other our entire lives. </p>\n\n<p>After I moved to Iowa, I’d met my girlfriend, Lee Anne. We started to get serious after a year and I was planning to propose after Mother’s Day and my birthday. You see, my birthday was the day before Mother’s Day and Lee Anne begged me to stay until tomorrow morning. So, I booked my flight for 6 am so I could spend the night with her. </p>\n\n<p>I heard the door opening as Lee Anne had the biggest grin on her face. In one hand she held two blue balloons and in the other, a stack of documents. </p>\n\n<p>“What you got there?” I asked.</p>\n\n<p>“Well, I know how after all these years your mother has refused to talk about your dad but I actually found him. He lives in Kansas and it’s only a two hour flight from us.”</p>\n\n<p>“Oh, wow,” I say sitting down. I hadn’t been prepared for this, especially when I knew I had to leave for a flight the next morning.</p>\n\n<p>“Aren’t you the least bit curious?” She asked, leaning over and handing me the folder. </p>\n\n<p>I could feel her hot breath panting against my cheek. </p>\n\n<p>I exhale deeply and reached for the folder, wiping the sweat from my brow.</p>\n\n<p>“You know that I am,” I say, opening the folder.</p>\n\n<p>My heartbeat intensified as I open the contents of the folder. I see my father and indeed, he’s an exact replica of myself.</p>\n\n<p>“Matthew Miller,” I say examining his bushy eyebrows, deep chocolate eyes, and over-exaggerated jawline.</p>\n\n<p>“Isn’t it amazing? He looks just like you,” Lee Anne squeals. “But that’s not the best part, we’re going to surprise him next week after you get back from seeing your mom!”</p>\n\n<p>“Wait—what? My mom would flip out if she knew,” I said nervously.</p>\n\n<p>“You have a right to meet your dad, Johnny.”</p>\n\n<p>That night I thought long and hard about what Lee Anne had said. Maybe she was right? I had a right to see him but I certainly wasn’t going to tell my mother. </p>\n\n<p>After a night of romance with my woman, I woke up to my alarm clock ringing in my ears. I shut the snooze and quickly got dressed, kissing Lee Anne and heading out the door with my small luggage bag. </p>\n\n<p>When I arrived at Austin, it was no surprise that my mother had wanted to shower me with gifts, despite it being Mother’s Day. She even had a welcome sign specifically bedazzled with my name on it. </p>\n\n<p>“Son! It’s so good to see you,” she says showering me with kisses all over my cheeks until they’re smeared with pink-red lipstick. </p>\n\n<p>“Ma! Ma,” I say trying to calm her down. “Happy Mother’s Day,” I hand her a card and a box of chocolates.</p>\n\n<p>“Russel Stover, my favorite,” she says motioning me to the car. </p>\n\n<p>**The next few days we’re pretty typical. My mom showered me with attention and lavish gifts. On the third day I informed her that I needed to cut my trip short.</p>\n\n<p>“But why?” She asked in despair.</p>\n\n<p>“I need to get back home for work and Lee Anne. I’m sure you understand.”</p>\n\n<p>But she didn’t. She told me how much she gave up for me, how I was un ungrateful swine. She’d never talked to me like that before and I was thrown off guard. I saw the droplets or sweat protruding from her brown as she angrily stood up from her seat. At first, I thought that she was going to hit me but instead me motioned me towards the door.</p>\n\n<p>I quickly called for a taxi and walked a few miles down her street in fear. Once at the airport, I called Lee Anne and told her what happened. She was stunned.</p>\n\n<p>“Take a flight to Kansas, hun. I’ll meet you there,” she said in her worried tone.</p>\n\n<p>I did just that. A million thoughts were running through my mind. Would he enjoy spending time with me? Should I call him first? What if he never wanted to meet me? </p>\n\n<p>As I questioned my motives, I felt myself slowly falling into a deep sleep. I woke up to the sound of the flight attendant telling us that we had just landed in Kansas. Lee Anne had been waiting for me in the airport for a few hours now.</p>\n\n<p>I grabbed my luggage and ran to gate C. I saw Lee Anne sitting by the terminal. She ran up to me and gave me a gentle and caring hug.</p>\n\n<p>“I’m ready,” I say letting go, as we call up a cab.</p>\n\n<p>“How are you feeling?” She asks.</p>\n\n<p>“About what? Surprising my father or my mother going all psychotic on me?”</p>\n\n<p>“I guess about both,” she says squeezing my hand. </p>\n\n<p>“Scared,” I say looking out the window.</p>\n\n<p>The rest of the ride was quiet as we pulled up to a rather large home with a 3 car garage and freshly mowed grass. It was the type of home I only dreamed of living in when I was a child. The white brick matched nicely with the freshly painted green shutters. </p>\n\n<p>“Well, we’re here,” I pay the taxi driver as Lee Anne and I stare in awe. </p>\n\n<p>I take a few steps back as the taxi driver drives away.</p>\n\n<p>“I don’t know if I can do this,” I say.</p>\n\n<p>“No, you can,” she reaches for my hand as we ring the doorbell.”</p>\n\n<p>The door slowly opens as I see a tall, blonde attractive woman. She resembled the opposite of my mother with her plump frame. In  her arm she was cradling a toddler who appeared to be around 3.</p>\n\n<p>“Um, hi. I’m looking for Matthew Miller,” I say shakily.</p>\n\n<p>“If you’re here about the lawnmower it’s already been sold,” she says, starting to close the door.</p>\n\n<p>“No, please,” I say stopping her. “I’m his son.”</p>\n\n<p>“No,” she says taken aback. “That’s impossible.”</p>\n\n<p>“It’s true,” Lee Anne chimes in. “Why don’t they look exactly alike?” She shows the woman my fathers picture from a few years back.</p>\n\n<p>“Please, come inside. Matt should be home in a few moments,” she lets go of her child and motions him to go play.</p>\n\n<p>“Would you like anything to drink?” She asks.</p>\n\n<p>“Some waters would be nice,” I say, as we sit down on their leather couch.</p>\n\n<p>She returns with the waters, a faint smile on her face.</p>\n\n<p>“I’m sorry about your mother,” she says.</p>\n\n<p>“What? No. My mom’s alive. I just saw her,” I say.</p>\n\n<p>She seems puzzled. “I don’t know how to tell you this but—“ she stops as someone walks through the door.</p>\n\n<p>It appears to be Matthew, he looks just the same only slightly older.</p>\n\n<p>“Oh, hello. I didn’t know we had company,” he said putting his briefcase down.”</p>\n\n<p>“Matt, you should sit down,” the woman says.</p>\n\n<p>“What’s going on here?” He asks.</p>\n\n<p>“My name is Johnny and I’m your son,” I say not exactly expecting the words to come out so easily.</p>\n\n<p>“No, that’s impossible. My son is dead,” he says puzzled. </p>\n\n<p>“May 12th, 1989. That’s the day I was born.”</p>\n\n<p>“Look I don’t know what type of trick you’re tying to pull here but you’re not getting any of our money so why don’t you just—“ Lee Anne interrupts him.</p>\n\n<p>“You’re not even going to give your son a chance? What exactly is going on here? He’s waited his entire life to meet you.”</p>\n\n<p>The tall, blonde woman reaches for Matthews shoulder. “Is it really that impossible? He looks so much like you....”</p>\n\n<p>“What’s going on here?” I ask. </p>\n\n<p>“You should sit back down,” he says. I sit parallel from him.</p>\n\n<p>“I did have a son who was due to be born on May 22, 1989. But my wife was brutally murdered. Stabbed to death to someone and left to die. The baby was ripped out of her stomach and never found. I assumed the worst. I remarried Patricia six years later and tried to repair what little was left of my life. So you see, how could you be my son?”</p>\n\n<p>“Oh my God,” Lee Anne said, letting out a howl. “That woman, she’s not your real mother.”</p>\n\n<p>“You mean to tell me that I’d been abducted as a child?”</p>\n\n<p>“Well, it would make sense,” Lee Anne said, sifting through her paperwork. </p>\n\n<p>“Do you have any pictures of your mom?” Matthew asks.</p>\n\n<p>I pull out my phone and show him the picture of her that I took just earlier. </p>\n\n<p>“I recognize that woman—that was one of our housekeepers,” he says covering his mouth. “Ramona,” he places the phone down and stares at me.</p>\n\n<p>He stands up and gives me a hug. “My son,” he says. </p>\n\n<p>As we get settled in, I felt a strangeness overcome me. The one person you’re supposed to trust in your life is your mother. But what happens when you find out that the one person you’re supposed to trust isn’t who they say they are?</p>\n\n<p>Go ahead and wish your mom a happy Mother’s Day but just know that you may be looking into the eyes of a complete stranger. </p>\n</div>\n","author":"relatedtowitches"}