{"rank":"235","title":"A dance for fireflies","id":"8j5lp9","url":"/r/nosleep/comments/8j5lp9/a_dance_for_fireflies/","time":"1526234245000","body":"<div class=\"md\"><p>Man, I fucking love music.</p>\n\n<p>It teaches me things. It helps me see things about myself that I would not otherwise see. It’s moved something in me that has never moved before. Music an all-consuming fixation of mine, and it even influences what and when I write. And so I cycle through hundreds of bands each year, ever-sifting through the granules on an endless beach of shitty music, hunting for my next true love. And when I find it, I obsess.</p>\n\n<p>But it’s rare that I find anything new. So I tend to cling to bands I’ve grown attached to, and wait like an abandoned lover for their next album. In 2000 when I was just entering my teens, I discovered A Perfect Circle, who fast became one of my super-mega-all-time favorite bands. Their work is the soundtrack of my life.</p>\n\n<p>Unsurprisingly, I’m quite ritualistic about how I listen to an important album for the first time. It has to be perfect. And growing up in a noisy house in Southern California, the perfect place to listen was on the nearby golf course. I’d wait until the sun went down and all the golfers went home, then I’d grab my discman and walk on the concrete path that carved through those rolling green fields. I still remember how the moon and stars drenched that place in ghostly silver light. It was hauntingly beautiful. And to me, it was bliss.</p>\n\n<p>But there are a few things you have to look out for if you want to become a creep like me and skulk around on a golf course in the dead of night. First of all, there are skunks and bobcats, and sometimes even mountain lions. Then there are sprinklers that randomly pop up and blast you with a face full of reclaimed water (yum). If the golf course is in a rough area, you might find some dangerous miscreants on your journey. I was once chased by a meth head on a walk up here in Northern California where I live with my wife.</p>\n\n<p>The real problem is the dark. You don’t want to bring a flashlight on your walk because the light gives away your position to security guards, or anybody else lurking around out there. So you have to go when there’s a full moon. But even then, the light is faint, and the shadows that remain beneath trees are <strong>pitch black</strong>. Who knows what they conceal. Because of this, and a litany of other reasons, the only course I actually feel safe on is the one by my parents’ house.</p>\n\n<hr/>\n\n<p>In March of this year, A Perfect Circle announced a new album. I have waited <em>fourteen years</em> for this announcement. And after recovering from the temporary insanity that took me upon reading this news, I called my boss, scheduled a week-long vacation, and heralded my coming to my old friends down south.</p>\n\n<p>Now I’m not normally one to call myself a <em>hero</em>, but I drove <em>six hundred miles</em> with the new APC record on the passenger seat of my car without touching it. All the other music I tried to fill that drive with felt like my ears were being blasted with high-velocity diarrhea. But I made it. I made it back to my hometown, back to my parents’ house on the golf course. I was ready.</p>\n\n<hr/>\n\n<p>The big night finally arrived. My childhood friend <a href=\"https://www.reddit.com/r/nosleep/comments/5alfdd/chuckles/\">Ronnie</a> came over to my place and we loaded the music onto our phones. The plan was for each of us to wear our own earbuds and basically just press Play at the same time. I’d never gone on a tandem first-listen-walk before, but by God, we were innovating like a couple of stoner scientists. </p>\n\n<p>The sun set as we gobbled down some pizza. Then, at the sight of the Evening Star, we set off into the night. </p>\n\n<p>You might not know this, but golf courses are typically comprised of eighteen “holes,” which means eighteen big green fields that all connect to each other. They’re divided into two groups of nine, called the “front nine” and “back nine.” The front nine typically snake between neighborhoods and are less pretty; the back nine are usually out in the woods or on cliffs that overlook some nature scene. </p>\n\n<p>Ronnie and I started on the back nine. On this particular course, the back nine are high up on a hillside, and they are totally surrounded by dense trees. At night, it almost feels like you’re on an island, looking down at the ocean. I swear the wind almost sounds like water out there - if it didn’t also carry the horrifying screams of little animals being picked off by bigger ones. </p>\n\n<p>The walk started off nice. The music was good. Spirits were...high. I took <a href=\"https://imgur.com/a/MoAC18c\">this selfie</a> of us to assure our SO’s we were still alive. If you manage to pry your eyes from my massive forehead, you can see how far we are from civilization: those lights in the distance are separated from us by a canyon full of thick woods.</p>\n\n<p>But as we got farther and farther out, I began to feel a sense of unease. The pale moonlight made the world look like a metallic simulacrum of itself, and the black patches of shadow beneath the trees felt full of watchful eyes. Maybe it had just been too long since I’d walked that loop, but I found myself shocked that I’d had the balls to come out here alone as a teenager. </p>\n\n<hr/>\n\n<p>We arrived at the fifth hole, which is the farthest point before the cart path starts to hook back toward the clubhouse. Out here, no one would ever hear us scream if we got attacked by a mountain lion. The nearest houses were mere twinkles floating in a black abyss, nearly indistinguishable from the stars high above.</p>\n\n<p>Ronnie left the path for a moment to take a piss in some bushes, and I stood there, trying to focus on the music. But something caught my eye up ahead. Something moved at the end of the fairway, fluttering like a bedsheet caught in the wind. Ronnie joined me and noticed what I was looking at.</p>\n\n<p>We snuck forward to get a better look, careful to remain in the shadows of the trees that lined the cart path. In another twenty or so yards, I could clearly make out the figure of a person up ahead. Whoever it was, they were small, and moved erratically. The first thought that came into my mind was, <em>it’s a junky, or a drunk person.</em> I had never seen another soul out here on this particular course, but it wasn’t impossible that some high school kids might come out here to eat shrooms or something.</p>\n\n<p>“Is that...is that a fuckin’ kid?” Ronnie whispered.</p>\n\n<p>As soon as his words hit my ears, my brain put all the fragments of what I was seeing together: It was a little girl. She twirled and danced and swayed in the open field about two hundred feet away from us, her nightgown aglow by the moonlight. Her movements were careful and coordinated, as though she was practicing for some kind of recital, but there was something dreary about the performance. She seemed timid or exhausted. </p>\n\n<p>Ronnie and I stood there in the dark, hypnotized by the absurdity of what we were seeing. It was creepy enough for two adult men to come all the way out here - and I mean we were <em>way</em> out here - but a solitary child? It would have taken her at least an hour to make it this far out. And how the hell could she have left her house without her parents knowing? Nothing about the situation made sense, and it filled me with dread. I don’t know how to explain it, but what I was seeing felt deeply <em>wrong</em>.</p>\n\n<p>I scanned the area to see if she was with anyone, but the field was empty. The only thing that caught my eye was a tiny group of fireflies glimmering and wafting beneath a tree across from us. The girl was alone.</p>\n\n<p>We watched for another minute or so. She never stopped moving. Her feet were pale and bare, and the bottom of her dress looked wet from the filthy sprinkler water that soaked the grass. When she twirled around, I saw her face. She couldn’t have been more than eight or nine years old.</p>\n\n<p>“Dude, what the fuck?” I blurted out. Ronnie hushed me, but my surprise had given us away. The girl stopped dead in her tracks, turned directly toward us, and gazed into the shadows where we stood. Even though I was sure we were hidden, her eyes immediately met mine, and the eerie calmness of her expression set off alarms in my head. After a long moment, her arm shot out toward us, and she pointed a twiggish finger right at me. Over her shoulder, the fireflies vanished in unison.</p>\n\n<p>“Let’s get the fuck out of here,” Ronnie said, and took off running back up the cart path toward the clubhouse. </p>\n\n<p>It took me a few seconds for my brain to find my limbs, but I booked it after him, running faster than I’ve ever run before. In writing this out, it sounds dumb that a child could terrify two grown-ass men like that, but in the moment I absolutely felt like I was in danger. On the run back to my house, all I could think of was, <em>that’s not really a kid.</em> I kept thinking some pallid, gruesome skinwalker was going to come bounding up the path behind me and drag me off into the woods. No one would ever hear my screams.</p>\n\n<hr/>\n\n<p>When Ronnie and I got back to my house, I went to call the police to report the little girl, but my phone wasn’t in my pocket. I realized I must have dropped it somewhere on the golf course. There was no way in hell I was going back out there that night, but I couldn’t afford a new one, so I opted to return during the day, when there would be tons of people and sunlight.</p>\n\n<p>That night, Ronnie and I speculated on what we had actually seen. Was it really a little girl who just needed some time alone to practice her dance moves? Had she somehow sleepwalked her way out there? Was she a ghost, or some other supernatural being? I wasn’t satisfied with any of those possibilities, and my brain kept me awake until dawn trying to come up with a better explanation.</p>\n\n<p>The following day, I spoke with the manager of the golf course, and we hopped in a golf cart and rode out to the fifth hole. We found my phone, but it had been smashed to bits. Someone had stomped on it. I showed the manager where we’d seen the little girl, but he remained skeptical of my claims - until he found a little pair of slippers in the trash can at the end of the hole. While he called the cops, I walked over to the place where I’d seen the fireflies glowing beneath a tree.</p>\n\n<p>There weren’t any fireflies there now.</p>\n\n<p>But I found about a dozen <a href=\"https://www.facebook.com/felixblackwellbooks\">cigarette butts</a>.</p>\n</div>\n","author":"TheColdPeople"}