{"rank":"16","title":"Creeps creeping on me","id":"8j5re9","url":"/r/nosleep/comments/8j5re9/creeps_creeping_on_me/","time":"1526235525000","body":"<div class=\"md\"><p>This story is told from the perspective of a 15- yo male from Serbia.</p>\n\n<p>First off, I want to begin this story by saying that this is not the kind of story that makes you fear for your life, but a story that makes you realize the fact that there are some sick people out there.</p>\n\n<p>This all began in the summer of 2014. when I was only 11. I live in a single story house, in a really peaceful neighborhood in a small town in northern Serbia.</p>\n\n<p>I was playing football(soccer) outside with my friend, at around 10 pm, which was really weird, because our parents were usually really strict about how long we could be outside, and for good reason.</p>\n\n<p>I was facing my house, and my friend was opposite of me, he had a clear view of the rest of the street. We were passing the ball when he suddenly told me &quot;Hey, let&#39;s go to your house, I need to show you something&quot; I looked at him with a confused face. He was looking behind me and said: &quot;You know what, let&#39;s race to your house&quot; ( My house was about 50 meters from where we were standing), at this point I turned around and saw a really strange man approaching us. I said sure and we started running as fast as our 11-year old legs could carry us, we got in my yard safely and locked the gate, which is pretty massive.</p>\n\n<p>This was the begging of a true nerve-wrecking experience that lasted for a year and a half.</p>\n\n<p>One important detail is the fact that my house has no fences around it, meaning that anyone can look through your window, thank god we have blinds.</p>\n\n<p>The picture attached is a picture of my house, feel free to use it in a video.</p>\n\n<p>I was living my life as normal, having fun during the summer. As you might notice, we have 2 cameras in our house, one aimed at the gate, and one at the windows. The first two windows are my sisters and mine, and the camera pointing at the gate is just above my window, which was the only one we had at that time. It never recorded, but we have a little monitor in our hallway that displays what that camera sees, which is useful when someone rings the doorbell.</p>\n\n<p>One day I woke up, went outside, and did what an eleven yo does during summer. I came in for lunch and my parents told my sister and I that we had to talk. At first, I thought that I had done something wrong. We finished lunch and my parents told us that one night, my dad woke up and saw on the monitor that some man was looking through the blinds( which were shut, but they have small gaps between that a curious eye can, unfortunately, look through) The thought of this sickened me, I wanted to cry, but I didn&#39;t. My parents told us that this had been going on for a few weeks and that my dad even confronted the guy one night, he hid in the bushes and waited for the guy to come, when he did my dad jumped out and started asking him what the fuck he thought he was doing. The guy gave my dad some bullshit like &quot;Shut up or I&#39;ll call my brother&quot; and so on.</p>\n\n<p>Our neighbor is a policeman and we asked him to patrol the street one night, but nothing came up. He suggested that we get a camera system that recorded 24/7, which we did do. This is when the second camera comes into place. It recorded in higher quality but it is much much bigger, so the guy noticed it.</p>\n\n<p>One night I was sitting in my living room with my family, and I told them the story about the weird guy my friend and I encountered. My dad appeared to be very very intrigued.I didn&#39;t really know why. When I finished my story, he told me that my description matched the guy he confronted.</p>\n\n<p>The guy kept on coming, and we kept on giving the tapes to the police, nothing could be done.</p>\n\n<p>One night the guy climbed onto his bike, took off his shirt, and put it over the bigger camera, not noticing the smaller one. He basically broke the camera, it was useless after that.</p>\n\n<p>This kept going on until about October-ish 2014. and it suddenly stopped, nothing happened until the summer of 2016. when he came a few times, nothing came of it.</p>\n\n<p>Something terrifying happened to me during the summer of 2017. I just got a new phone and, of course, I had to stay up all night, watching youtube. I have a bunk bed in my room and I sleep on the top one, the bottom one is used for when someone sleeps over. At around 5 am someone banged on my blinds as hard as they could, I was frozen in fear, I was awake until the morning, and I told my parents, and they blamed it on me watching Anabelle 2 that night.</p>\n\n<p>In late November that same year, my blinds were shaking intensively, I once again could not move, I got enough courage to call my parents, they came to my room and saw the state I was in, this time they believed me. The cameras have been turned off, except the little one which is still used to see who is at the door.</p>\n\n<p>Nothing has happened since, and I truly hope that that sick fuck was caught and gets beaten up to death in jail.</p>\n\n<p>I really wish that I had surveillance footage of the happenings, but unfortunately, we deleted them all in hopes we would never bring the incident up again.</p>\n\n<p>Picture: <a href=\"https://imgur.com/a/P85dG\">https://imgur.com/a/P85dG</a></p>\n\n<p>Edit #1 Hello everyone, I have an update for you, as well as some legitimate proof that what I said was happening was not made up. I was recently searching my parent&#39;s computer and came up to a file called &quot;Video Surveillance&quot; and I found the videos of the happenings. Seeing this, the determination in this creep creeps me out to this day. I will be leaving the links to the videos, which I have uploaded. Please keep in mind that this is extremely personal to me and I want this post to make people aware of what could be happening to them and that they do not even realize. The only reason why we noticed this was because of the fact that we had the little monitor that showed what was happening outside. Thank you for your attention, and stay safe friends.</p>\n\n<p><a href=\"https://imgur.com/gallery/Y5VAEb8\">https://imgur.com/gallery/Y5VAEb8</a> - This is the video of the creep covering the camera with his shirt.</p>\n\n<p><a href=\"https://imgur.com/gallery/96ek2X3\">https://imgur.com/gallery/96ek2X3</a> - This is the video of the creep taking his shirt of the camera, breaking it in the process</p>\n\n<p><a href=\"https://imgur.com/gallery/Sg1g9cs\">https://imgur.com/gallery/Sg1g9cs</a> - 19/08/2014.</p>\n\n<p><a href=\"https://imgur.com/gallery/rGij8QO\">https://imgur.com/gallery/rGij8QO</a> - 27/08/2014.</p>\n\n<p><a href=\"https://imgur.com/gallery/nSV1Mim\">https://imgur.com/gallery/nSV1Mim</a> - 27/08/2014.</p>\n</div>\n","author":"GGcorn"}