{"rank":"15","title":"The Skype Call","id":"8j5ydy","url":"/r/nosleep/comments/8j5ydy/the_skype_call/","time":"1526237149000","body":"<div class=\"md\"><p>Skype. Oh man, what an interesting platform. The ability to talk to your friends face to face, without talking with them face to face. I mean, crazy right? Maybe not nowadays but come on, it&#39;s a pretty cool concept. I use Skype a decent amount, especially when bantering with mates and playing games until the early hours of the morning. I probably spend more time talking to my mates on Skype then I do in real life, call me anti-social if you really want to. I don&#39;t really care.</p>\n\n<p>Anyway, I know you guys aren&#39;t really here to listen to me rant about Skype and it&#39;s interesting concept., so lets get down to what everyone wants to hear about. &#39;The Skype Call&#39;, I know, such an original name, but honestly I have no idea what else I would call it. This story happened a year or two back, I don&#39;t really remember and honestly the whole night itself was a blur. So, let me give you all a little bit of context:</p>\n\n<p>I was playing CS:GO with two mates. I&#39;d been friends with both of these idiots for a while at this point, Loui was working at some private forensics business in California whilst myself and my other friend, Ryan, were working at a McDonalds in London. We don&#39;t typically play with &#39;Randos&#39;, a word Loui, Ryan and myself use to describe random people in-game, but tonight we found some girl called Ayi from the Middle-East who was actually really funny.</p>\n\n<p>Ayi had a sweet, high-pitched voice and got along with us and our somewhat dark sense of humour very well. We&#39;d been playing for around 2 hours at this point with Ayi and around 5 hours altogether and I remember the time exactly, 3:47AM. I had just spawned into the CS:GO game when I noticed the familiar camera appear on the Skype call tab that lay in the bottom corner of my screen. </p>\n\n<p>Loui, Ryan and myself typically kept our cameras off, unless we were making a joke and had to project how funny it was with an action of sorts. But at 3:47AM? Seemed a bit late to be making jokes that require taking your attention off of the game and actually using energy to do an action. </p>\n\n<p>Everyone in the call was silent, I guess Ryan and Loui thought that it was one of us turning on the camera, so we all stayed silent. That was when the camera loaded. </p>\n\n<p>It was just darkness. </p>\n\n<p>And then the first scream came. </p>\n\n<p>Myself and Ryan remained silent. The scream definitely belonged to Loui. We both then both burst out laughing. &quot;You little tw-&quot; Ryan was cut off. The same scream echoed again.</p>\n\n<p>&quot;Guys. That isn&#39;t m-&quot; Loui was cut off, the same scream echoed.</p>\n\n<p>I opened up my Skype, Ayi had left the call. The camera must belong to one of us, except it didn&#39;t. We bickered amongst ourselves, being cut off by the scream every five seconds or so. It was impossible to project our voices above it so we began typing in the Skype chat. Loui must&#39;ve been scared as fuck, I mean, I was shitting myself, so he must&#39;ve been paralysed. </p>\n\n<p>Loui kept typing to show us he was ok. Until he stopped. The screams stopped. I spoke for the first time in a solid five minutes, &quot;Lads. What the fuck just happened?&quot; I asked. Ryan began to answer &quot;I have no fu-&quot;, Loui cut him off. Loui&#39;s camera turned on and showed us him sat in the darkness that the camera projected before. He had a grin, laughing. &quot;Goodnight. Sleep tight.&quot; His camera turned off, and there was a final scream before he left the call.</p>\n\n<p>&quot;What the actual fuck?&quot; Ryan asked.</p>\n\n<p>&quot;I have no fucking idea.&quot; I&#39;d reply, &quot;Text him?&quot;</p>\n\n<p>Ryan agreed, he had a full conversation with Loui, sending the screenshots every now and then. It was definitely Loui, but he claimed that he hadn&#39;t Skyped us and hadn&#39;t been on CS:GO for the past 5 days.</p>\n\n<p>That was when Ayi rejoined the call. Myself and Ryan immediately left. That&#39;s when Loui completely vanished. His facebook was gone, he never answered his phone, we phoned his parents and his work but nobody had any idea where he was. We even phoned the police but nobody had seen him in the past 5 days.</p>\n\n<p>Some time passed and you may be wondering, why are you only posting about this now? Well Loui messaged me and Ryan asking &quot;Why didn&#39;t you save me?&quot;. </p>\n\n<p>I&#39;m lost. I have no idea what to do and the police suggest that it was all a prank, but how did Loui end up in the same room as Ayi, considering Ayi lived in the Middle East? In the same Skype call, on the same night. And how was Loui in the Skype call and playing CS:GO if he hadn&#39;t played in the past 5 days? </p>\n\n<p>And the bigger question, where the fuck was Loui?</p>\n</div>\n","author":"InsertNerdyNameHere"}