{"rank":"194","title":"Keep an eye out for my letter. I'm so sorry.","id":"8j64rn","url":"/r/nosleep/comments/8j64rn/keep_an_eye_out_for_my_letter_im_so_sorry/","time":"1526238583000","body":"<div class=\"md\"><p><em>Stop.</em></p>\n\n<p>I <strong>know</strong> that you&#39;re not paying attention properly. I&#39;m going to really, seriously, undeniably need you to start trying. I have literally no other way of warning you other than trying to get your attention here. Please.</p>\n\n<p>Just fucking try.</p>\n\n<p>Just for a few minutes. </p>\n\n<p>It&#39;s for your benefit as much as mine. I just really need to <em>talk</em> to you, okay? </p>\n\n<p>I&#39;ve got this problem. </p>\n\n<p>I&#39;ve always had these... thoughts. </p>\n\n<p>When people had pissed me off, upset me, or done something awful. Maybe not even awful, maybe just a little off. I get these absolutely awful visions about them dying in terrible fashions such as falling in front of a bus, or having a heart-attack, you know. Things like that.</p>\n\n<p>Bad shit. </p>\n\n<p>The more of these visions that I get, the more depraved they get. </p>\n\n<p>I can&#39;t even say it. </p>\n\n<p>I don&#39;t want to tell you some of these things, because they aren&#39;t my thoughts. I mean it. I don&#39;t know <em>where</em> they come from. If they are me - well, fuck. </p>\n\n<p>Anyway.</p>\n\n<p>These visions, or whatever, they stay in me forever once I get them. </p>\n\n<p>They swarm like wasps without a sense of smell. They&#39;ve got no co-ordination, no sense of balance, and they just sort of throw themselves against my skull until I can barely even hold my eyes open.</p>\n\n<p>My senses are completely nullified by that hive of intrusive thinking. At this point in my life, I&#39;ve been on this steady decline for so long that I forgotten where the slope even began. But, man. It suddenly got pretty fucking steep, pretty fucking quickly.</p>\n\n<p>So, here&#39;s the story. I was at a house party last night, pretty out-of-my-fucking-mind on MDMA, and MDMA is pretty great for me because I&#39;d just <em>love</em> everyone. I&#39;d not have to worry about them annoying me, and being added to my collection of people that I&#39;d imagined dying in an extremely horrifying fashion. Pretty foolproof - other than the fact that after a few months of near-constant use, the potency of that love was <em>really</em> starting to wear off. </p>\n\n<p>I&#39;d read somewhere online that the more you use it, the less impact it has. Probably, definitely, maybe true. </p>\n\n<p>My first red flag was the fact that I&#39;d managed to envision this girl dying when I was still off-my-rocker on drugs. </p>\n\n<p>I was literally just past my come-up, and got chatting to this friend-of-a-friend Hayley. She was just launching into a big speech, explaining why she is totally disconnected from her family, and how she <em>finally</em> realises who she really is on the inside. I looked at her eyes, which were usually a gut-piercing blue, but were now completely blacked-out with dilated pupils and an extremely shaky stare.  </p>\n\n<p>That&#39;s when I noticed <em>it.</em> </p>\n\n<p>She was sporting these god-awful eyebrows that seemed to taper to this absolutely <em>minuscule</em> point, and yet  they were COMPLETELY unsymmetrical. I remember thinking, &quot;You&#39;ve clearly spent like a fucking hour on those eyebrows, but you didn&#39;t bother to check if they even matched?&quot; </p>\n\n<p>Like seriously? </p>\n\n<p>Sorry. </p>\n\n<p><em>Deep breath.</em></p>\n\n<p>In through the nose.</p>\n\n<p>Out through the mouth. </p>\n\n<p>When I recall these memories, they still annoy me. Rational or not. That&#39;s because of the <em>thing</em> - the wasps - the memories - the whatever-you-want-to-call-thems. I now had one of Hayley. </p>\n\n<p>I never, ever, wanted that to happen. I quite liked her. </p>\n\n<p>Out of nowhere, I felt this... wave come over me. It started in my toes, this searing pain, as if I had been set alight. It shot up my spine and through to my fingertips.</p>\n\n<p>I was deafened by what must have been the most incredible white noise in the universe - like personified tinnitus screaming through a megaphone. This noise felt like ten-thousand jets crashing through me point-blank. It launched vomit through my nostrils and sent me screaming, crashing to the floor with my hands clutched over my ears.</p>\n\n<p>When I woke up there was something like ten people around me, telling me things like &quot;Dude, you were fucking dead, I swear&quot;, and I overheard a medical student on the phone to the ambulance saying my shaking had lasted &quot;Three minutes, twenty-four seconds.&quot;</p>\n\n<p>Fuck. Jesus. I can&#39;t believe I&#39;m telling you this. I&#39;m so sorry. </p>\n\n<p>When I entered the ambulance they cleaned me off, and the one closest to me raised an eyebrow - it was pretty obvious I was on a high. They laid me down, and Hayley jumped into the back of the vehicle to, keep me company I guess.</p>\n\n<p>She was nice. </p>\n\n<p>I looked up and told her, &quot;I feel fine&quot;, still with vomit stuck to the front of my shirt and lingering in my breath. Her mouth opened and with a furrowed brow, she said -</p>\n\n<p><em>Fuck.</em></p>\n\n<p>This was it.</p>\n\n<p>The. Moment. </p>\n\n<p>I could see her, clear as day, talking, and talking, and <em>talking</em> off her pill-addled brain - but I hear nothing.</p>\n\n<p><em>Nothing.</em></p>\n\n<p>I could not hear Hayley talking whatsoever, </p>\n\n<p>I know you&#39;re probably thinking I&#39;ve gone deaf. Maybe from that noise I told you about, or the fit, or any combination of possible events. But I had heard the medics talking, the students that had surrounded me. I could hear the cars on the road around us, the medics co-ordinating efforts, the repetitive noise of the ECG machine in the back. Just not Hayley talking.</p>\n\n<p>I&#39;m genuinely about to dry-heave, my god, I feel so sick. I&#39;m sorry. </p>\n\n<p>I mouthed to her, &quot;I can&#39;t hear you.&quot; </p>\n\n<p>She relayed something to the staff, and they frowned. </p>\n\n<p>&quot;Huh. He replied to our questions earlier, didn&#39;t he?&quot; The one sitting beside me asked, &quot;Can you hear us?&quot;</p>\n\n<p>I&#39;m terrified. Absolutely fucking terrified.  </p>\n\n<p>I had two options at this point - I could pretend to be completely deaf, or I could say I can hear <em>them</em>, but not <em>her</em>. </p>\n\n<p>Nothing made sense. </p>\n\n<p>Filled with panic I decided to fake deafness. I couldn&#39;t explain what was going on, and felt as if they would think me insane.</p>\n\n<p>In hindsight, that would have been fair enough.</p>\n\n<p>I looked down and saw a very small notepad in the belt of the medic, so I shook my head &#39;no&#39; at her, and gestured for her to pass it to me.</p>\n\n<p>Thankfully, she never really questioned how I managed to answer a question that I allegedly couldn&#39;t hear. </p>\n\n<p>Whoops. </p>\n\n<p>She handed me the pad and a pen whilst we pulled up to the hospital. The staff exited the ambulance, and turned to Hayley:</p>\n\n<p>&quot;We are going to just give him a quick look-over in Triage to assess his symptoms. Of course, we suspect it is drug-induced.&quot;</p>\n\n<p>I watched the medics leave into the door of the hospital, before I put my pen to the pad. </p>\n\n<p>I ran it across. </p>\n\n<p>I saw no ink.</p>\n\n<p>I scribbled, &quot;Hayley&quot;.</p>\n\n<p>I saw no ink.</p>\n\n<p>&quot;Your eyebrows-&quot;</p>\n\n<p>That&#39;s when it came over me. </p>\n\n<p>My hand moved to defy my brain, I couldn&#39;t even catch the words if I tried. With the ink not even appearing, there was no way I could have known what the fuck was going on. </p>\n\n<p>And Hayley is watching. </p>\n\n<p>Poor girl. There was no way I could have known.</p>\n\n<p>My writing got faster, and faster, and I looked up at her. She was all wide-eyed with a mixture of incredible confusion - and almost definitely still drugs. </p>\n\n<p>I finally stopped scribbling and dropped the pen to the ground. I stepped on it and wailed, looking up at Hayley. She took a few steps back and held her hands up to her face.</p>\n\n<p>&quot;I can see my name on there. You have to give it over.&quot;</p>\n\n<p>She quickly came forward and snatched the pad from my hands. She flipped through the seemingly vacant pages, and I watched her expressions change from confused, to upset, to - </p>\n\n<p>Oh my god - I&#39;m going to be sick - fuck. </p>\n\n<p>She had this look on her face that is just fucking <em>burned into me</em>. A contorted, furrowed, ridged look of pure animalistic <em>fear</em>. I could hear my heart bursting through my ears. I realised I was crying.</p>\n\n<p>The first medic came back out to collect us, but not before Hayley had ripped those pages from the notepad. She passed it back, trembling as she folded the pages into her pocket. </p>\n\n<p>I could see ink on her finger. And then I. Heard. Her. </p>\n\n<p>&quot;I have to go.&quot;</p>\n\n<p>She sprinted into the distance like something out of a soap opera, and I realised the stench of vomit was so thick on me. I started to think that the drugs I&#39;d taken were maybe cut with some sort of hallucinogenic. </p>\n\n<p>&quot;I can hear again.&quot;, I told the medic. &quot;I&#39;d like to leave.&quot;</p>\n\n<p>I discharged myself and got a taxi home just as the comedown hit. They must have also thought that Hayley and I were just that much too high - they let me go pretty easily. Realistically, taking bad drugs made the most sense at the time. I was either writing gibberish on a notepad and hallucinating a blank page, or I was actually writing with a pen that didn&#39;t work, and I just kept going and going. Think about it - that, plus the fact I was sick, and that I blacked out.</p>\n\n<p>I sincerely thought it was the drugs. </p>\n\n<p>Alright. Jesus Christ. Are you ready for this?</p>\n\n<p>Please still be here. Listen to what I&#39;m telling you. </p>\n\n<p>I turned on the TV the next morning, and there&#39;s Hayley&#39;s photo on the television.</p>\n\n<p>Pause.</p>\n\n<p>Breathe.</p>\n\n<p>In through the nose.</p>\n\n<p>Out through the mouth.</p>\n\n<p>Hayley&#39;s photo is on the television. &quot;CITY WAKES UP TO FOREST HORROR HANGING.&quot;</p>\n\n<p>I begin to wretch into the sink. Visceral, gutteral wretching, of nothing but bile and the drugs that couldn&#39;t make it past my sinuses. I realised something. </p>\n\n<p>The vision I had of her. </p>\n\n<p>The thing that she&#39;d set off in me because of her eyebrows - the wasp. </p>\n\n<p>I guess it could actually sting. </p>\n\n<p>Hayley passed away in the exact fashion I&#39;d imagined. I&#39;m not going to go into details. I can&#39;t. It was this... can we call it a hybrid suicide. Like multiple methods at once.</p>\n\n<p>Fuck</p>\n\n<p>I ran over to my phone to see 10 missed calls, 13 whatsapps from 4 chats. </p>\n\n<p>And one particular missed conversation.</p>\n\n<p>Hayley. </p>\n\n<p>Hayey.</p>\n\n<p>Hayley. </p>\n\n<p>&quot;did you mean what you wrote&quot;</p>\n\n<p>&quot;how did you find that out. i never told anyone&quot;</p>\n\n<p>&quot;I think that you&#39;re right. There&#39;s only one option.&quot;</p>\n\n<p>and then </p>\n\n<p>and then </p>\n\n<p><strong>and then</strong></p>\n\n<p>&quot;bye.&quot;</p>\n\n<p>I turned my phone off. </p>\n\n<p>I mean, really. Did I even <em>do</em> anything wrong here? </p>\n\n<p>My god. </p>\n\n<p>I went through all of my options in my head. There was nothing I could do, really other than act normal, and when the time came, act sad.</p>\n\n<p>I seriously felt as if I&#39;d committed murder.  </p>\n\n<p>It took me an hour to get showered and dressed between the sporadic crying and the dry-heaving. When I left the house to get to class, I practiced steady breathing. In through the nose. Out through the mouth.</p>\n\n<p>Everything was pissing me off. </p>\n\n<p>The birds were too loud.</p>\n\n<p>In through the nose.</p>\n\n<p>The sun was too bright.</p>\n\n<p>Out through the mouth. </p>\n\n<p>Hayley was too dead. </p>\n\n<p>In through the nose.</p>\n\n<p>That&#39;s when you brushed past me, hitting my shoulder. </p>\n\n<p>Fuck I&#39;m so sorry. </p>\n\n<p>You didn&#39;t turn around.</p>\n\n<p>You were on the phone, and distracted. Would it kill you to even be a bit polite, though?</p>\n\n<p>Fuck. </p>\n\n<p>Sorry it&#39;s still pretty raw. Like I said, that memory just... sits there. Like that. Rotting.</p>\n\n<p>One moment I could hear your conversation.</p>\n\n<p>And then, just like that, I couldn&#39;t.</p>\n\n<p>I watched you walk further and further away until you were... gone. I fell to the ground, blacking out. This time, no fresh drugs in my system - albeit, it&#39;s completely possible I still had some in me from the night before.</p>\n\n<p>When I came to, somebody was calling an ambulance. People were looking at me from the other side of the street.</p>\n\n<p>&quot;I&#39;m fine,&quot; I told them.</p>\n\n<p>I take a left to the post office instead of continuing on my walk to university. I pay for a notepad, paper, and a pen. </p>\n\n<p>&quot;Anything to post?&quot;</p>\n\n<p>It <em>felt</em> like there was something to post. Oh God.</p>\n\n<p>&quot;Yes, give me a minute&quot; I replied.</p>\n\n<p>I watched the ink disappear as I began to write down what you did. </p>\n\n<p><em>Stranger knocks into me.</em></p>\n\n<p><em>Doesn&#39;t say sorry.</em></p>\n\n<p>No ink. </p>\n\n<p>The writing begins again. My hand moves so quickly that the sound of the pen scraping across the paper turns into one. Long. Buzz. </p>\n\n<p>Please tell me you&#39;re still here. </p>\n\n<p>Quick as lightening, the paper goes into the envelope. </p>\n\n<p>I seal it.</p>\n\n<p>In the space where an address should go, I quickly scribe... something.</p>\n\n<p>It was still invisible for me.</p>\n\n<p>The terrified worker looks at me, and asks, &quot;F-first class?&quot; </p>\n\n<p>I nodded.</p>\n\n<p>I fucking nodded.</p>\n\n<p>I&#39;ve just returned home and realised what I did. I can&#39;t take it back.</p>\n\n<p>I mean, like, maybe we just hope I didn&#39;t know your address. How would I even be able to guess that? It doesn&#39;t make sense. </p>\n\n<p>Maybe I&#39;ve really done nothing.</p>\n\n<p>I don&#39;t fucking know.</p>\n\n<p>All I know is, I feel like I&#39;ve got a serious issue. I&#39;ve been going mad for the last hour trying to figure out if you can do anything about it, and I have this theory that maybe if you just, like, chuck it away before opening it you won&#39;t have to read it.</p>\n\n<p>You won&#39;t have to go through it.</p>\n\n<p>I don&#39;t know. You know what I am trying to say, though, right?</p>\n\n<p>I can&#39;t describe what the envelope looks like or anything because I couldn&#39;t fucking see what was on there. It was a white envelope. That&#39;s it, that&#39;s all I can say to help you. </p>\n\n<p>All I know is, if my vision for you comes true.</p>\n\n<p>If what I pictured... happening to you comes true.</p>\n\n<p>If that. </p>\n\n<p>If that happens.</p>\n\n<p>I&#39;m sorry. </p>\n\n<p>I&#39;m so sorry.</p>\n</div>\n","author":"IWriteYouLeft"}