{"rank":"38","title":"Aunt Mary's Farm","id":"8j6gji","url":"/r/nosleep/comments/8j6gji/aunt_marys_farm/","time":"1526241241000","body":"<div class=\"md\"><p>Aunt Mary had a farm. It was a family plot situated in, what was essentially, the middle of nowhere, surrounded by vast, empty fields and a fair sized patch of forestry. The closest neighbouring farm could be seen from her front porch; a tiny speck of a structure situated miles away across the sea of grass and hay. There was a dusty, dirt path that snaked its way up from the main stretch of road; the only way to and from the property save for a potentially rough hike through the encompassing forest.</p>\n\n<p>For as long as I can remember Aunt Mary lived alone on that farm. My grandfather had lived with her until he met his demise by, somewhat cartoonishly, mistaking a box of rat poison for his morning cornflakes – an act of pure senility. Aunt Mary found him curled in a ball on the floor of the kitchen, the mushy kernels of poison scattered around his corpse like a macabre decoration. I think that’s when the anxiety truly started for Aunt Mary. She was a woman who lived in constant fear fuelled, no doubt, by the solitary conditions of the family home she felt duty bound to upkeep. That was why Sam moved in. </p>\n\n<p>My brother was an expert of fear and distress; a quality that seemed to have spawned at his birth. I remember being 6 years old and waking from a particularly upsetting nightmare in which our parents had been sucked out to sea by a monstrous tidal wave. When I opened my eyes I was dishevelled enough to not be too surprised to find Sam standing at the end of my bed. I asked his where our parents were and he looked back at me with a flat, empty expression and told me they had had their throats slit in the night by an intruder. My cries of terror brought our mother to my bedroom door where she scolded us for being up so late and ushered my big brother back to his own room. Believe or not, I adored my brother. He seemed to be privy to an entire world of knowledge that us other kids were woefully oblivious to. He was the one who described our Grandfather’s death to me in all its grisly detail and he was the only one who seemed fearless enough to surround himself in our Aunt Mary’s anxieties. </p>\n\n<p>Our mother had passed by then and dad was feeling the weight of time himself. He still visited Aunt Mary occasionally, offering whatever help he could with upkeep and DIY. He had been sweeping the floor of the old barn when Sam shot him in the head, twice, with one of Grandpa’s old shotguns. Aunt Mary found his cold, empty body the next morning and Sam had vanished, managing to evade the law for a week before being pinned down at a rustic B&amp;B down by the coast. The aura of horror that flooded the property haunted Aunt Mary until she, too, was finally gone. It must have been a blessed relief for her, to finally lay rest from the tireless terror that resided in her head. </p>\n\n<p>The farm was mine now and the memories with it. I tried to attend to it as often as I could, compelled by the same family duty that held Aunt Mary. There was a lot of work to be done though and Aunt Mary’s belongings still dominated the dusty surfaces and storage spaces. I usually took the 3 hour drive straight from work Friday night and stayed over until Monday morning. The isolation didn’t bother me too much; there was so much dusting and mopping and scrubbing and buffing to be done that I rarely had a moment to consider my reclusiveness. I didn’t make friends easily and had little confidence in my skills to do so since I popped little Sally Bradley’s goldfish in the microwave as a joke when we were kids and found that she didn’t quite view the situation with as much glee as I had. Aunt Mary and I had been very similar in that capacity. She had no friends to speak of and a dwindling connection to living relations. I think that’s why she started the diary.</p>\n\n<p>I had been surprised to find it. Aunt Mary’s bedroom was one of four rooms on the second level of the farmhouse and I tended to avoid the creaky climb up the old, uncarpeted staircase. Grandpa’s room was up here, too along with most his belongings and the pale patch of wall at the back of the cupboard were his gun safe had been bolted in before the police removed it all. Somehow the stench was stronger up here; a repulsive concoction of stale air and unwashed bodies. </p>\n\n<p>I had only braved the potentially noxious atmosphere because I had heard, what I expected to be, mice...or rats scampering along the bare wood above where I crouched on the kitchen floor, scrubbing the tiles. My stomach had heaved at the thought and a memory of tortured squeaks and grating of metal filled my head with a sickly ache. I had been contemplating installing traps around the house when the sounds came again, distinctly less rodent like. It was a strange noise, starting in a long scuffle and then a sharp thump. I listened intently, curiously, as the sound repeated itself, over and over. Almost like something was being dragged along the floor.</p>\n\n<p>Fear was not at the front of my mind as I grabbed a gleaming kitchen knife (I had just washed the set earlier today), rather I was slightly confused. I knew there could only be one cause of such an unnatural sound but it made no sense. Nevertheless, the sound had halted by the time I was climbing the stairs, perhaps startled by my existence. I ascended in excruciatingly loud silence, expecting to see the cause of my disturbance as I came round the middle landing. </p>\n\n<p>There was no one.</p>\n\n<p>I continued to the top and stood at the top landing, peering left and right along the narrow hallway; longer to the left than the right as the doors for each room lay in that way and only a small cupboard sat to the right. Silence. Solid and unmoving, almost visible in the murkiness of the hall. I tried the light switch and, of course, it was burnt out. Deciding the cupboard was an unlikely hiding place I made my way towards the first door and slowly opened it, surveying the lavender walls and floors. </p>\n\n<p>Aunt Mary’s room smelled as she had; old and unclean. Dust lay thick on almost every surface buy my eyes were drawn to the large bed in the centre, the bed sheets disturbed atop it. A little, pale moth fluttered by, inches from my face and I swatted it away irritably. I knew if I were to inspect the wide armoire against the right side wall I was likely to find a collection of delicate clothing, decorated with a spattering of little holes.</p>\n\n<p>I didn’t go to the armoire, however. My eyes had found something much more curious and I discarded the knife amongst the bed sheets while I knelt and retrieved the little black book from where it had been wedged between the wall and bed base. My first thought was of confusion; Aunt Mary had never mentioned she was keeping a diary but, then again, I supposed it wasn’t exactly a subject she was likely to broach with others. Then I was overcome with curiosity and felt no qualms, whatsoever, with peeling apart the pages and exploring someone’s most private thoughts:</p>\n\n<p><em>September</em></p>\n\n<p><em>I think I might have slept last night. It’s so difficult to tell as night and day turn over so quickly out here. Morning brought the usual terrors of course and I almost considered burying myself deep under the duvet so I wouldn’t have to face the passing hours. I didn’t have breakfast. Instead I sat up in my wicker chair and listened to the mice in the attic. I didn’t know they could be so active during the day. By lunch I was able to come to terms with the fact that I was all alone.</em></p>\n\n<p>Alone. The word seemed to puncture a critical hole in my defences as pure and simple fear boiled in the depths of my stomach, bubbling up and over until it flooded every part of me, rising to the back of my throat, constricting and burning and leaving a nauseating metallic taste on my tongue. I suddenly felt very vulnerable and I had an inexplicable sense that told me not to look up and into the empty hallway. It might not be all that empty. I swallowed back the acidic bike that threatened to burst forward and forced myself to read on.</p>\n\n<p><em>I had an apple for lunch. It was overly ripe but it was all I could manage. From the kitchen window I can see the barn and I was sure I could see that the doors were ajar but I had to be wrong. After lunch I checked the front and back doors. They were locked, of course. Sometimes I feel like I’m going crazy in here. I can’t remember the last time I stepped foot outside. I’m not sure where I would go if I did. I checked the barn from the kitchen window again. The doors were firmly closed.</em></p>\n\n<p>I had always thought Aunt Mary was becoming more and more detached from reality. It wouldn’t be difficult to understand why, of course. The pressure of my recent panic thumped a steady beat in my ears and I half wondered if craziness was catching. A floorboard creaked somewhere in the depths of the aged home and my head snapped up before I could stop it. From where I knelt on the floor I had a clear view of the gloomy hall and the stair case leading downwards. I studied the scene with such intensity I was sure it would be burned into by retinas forever. There was no one there. But there were shadows, horrible and deathless. Anything could be lurking. Maybe a rat? Or maybe something much larger? Large enough to drag some unknown object across the creaky floorboards. I was not comforted by the silence and imagined that the intruder would fly forward from the darkness as soon as I looked down at the crinkly pages. I let my gaze drop anyway.</p>\n\n<p><em>There wasn’t much to be done today. I tried to distract myself from my worries by going back to my knitting. My fingers are so stiff now that I’m not much good at it anymore but it turned out not to matter. The needles have gone missing. Like so many other things. There will be no convincing me that I misplaced them. I spent the rest of the night searching for them until the night came and it was too hard to see. For a final effort, I managed to bend down far enough to search the kitchen cabinets. I didn’t find the needles but I did find all my framed photographs, tossed together in an unorganised pile. Some had cracks across the glass covers and others were smashed completely. I was horrified. I started to cry while I pulled each frame free and laid it down on the kitchen floor. I hadn’t even noticed they were missing. How is that possible?</em></p>\n\n<p><em>I had wanted to retrieve all of my poor broken pictures and take them upstairs with me to my room. It would take a few journeys but I was determined. And then I discovered the carcass. It was so small and twisted. I guessed it was a mouse or maybe a squirrel? The skin was too rotted to tell but the sight of it was enough to send me into a panic. I would have screamed if I had the strength. Instead I pulled myself away, as fast as I could and kept up a stream of frightened tears as I returned to the safety of my room. I slammed the door closed, tight and crawled into my bed. The mice were scrambling above, disturbed by my noisiness.</em></p>\n\n<p><em>I’ve been crying for a long time. I won’t sleep tonight. I just know it. The nightmares were awful and I hate to think what they’ll be like now. I can’t stop picturing the destruction. The shattered glass, distorted faces that should have been familiar. And the brown rust around the edges that wasn’t really brown rust. I had seen death before. I see it everyday. The place is haunted by it and each shadowy corner is home to terror and cruelty. I’ll never escape its warped grasp. Each day passes, as pointless as the one that comes before it and all it leads to is my death. It’s the only thing I’m really sure of these days. After all, ????? has promised it.</em></p>\n\n<p>I squinted at that last sentence. Aunt Mary’s handwriting had not improved in her old age, still the word didn’t seem to make any sense. I wondered if it was foreign, it certainly didn’t look like any English word that I knew of. I turned the page and found a new entry, written in the same strained lettering. </p>\n\n<p>Thumbing through I found that the diary was almost full, only a few pages towards the back lay bare. I prolonged my inspection as much as I could, trying and failing to convince myself that I wasn’t postponing the moment when I would have to face that hallway with its cruel, deathly, unseen inhabitants. Part of me felt compelled to leave for the city tonight. The drive through the unyielding darkness of the country night would be perilous but I wasn’t sure that staying here would offer much more security. Resigned to the fact that I couldn’t spend the rest of the night crouched on the floor of Aunt Marys bedroom, I forced myself to look up at the <strong>SNAP!</strong> </p>\n\n<p>I was on my feet in an instant, diary clutched in my trembling, sweaty hands. The fear that had gradually reduced to a simmer exploded inside me and my limbs did not seem to know how to cope. I staggered against the bed and reached out for the knife, whimpering as I fumbled with the handle. The house rung with the aftermath of the sudden noise and, somehow, in my terror, I was able to identify it came from downstairs. Far from wary, I threw myself into the landing and tried hard not to trip over my feet as I sped downstairs. </p>\n\n<p>Dusk had come, and the darkness of the hallway had seeped to the rest of the house. I slammed my palm against the downstairs lights witch and the bulbs performed their usual flicker before warming into a much appreciated light. </p>\n\n<p>I found the culprit in the kitchen. The traps had been set for two weeks and this was my first captive. The killing traps had been far more affective but I persisted with the little cages and their crude booby traps. I placed the diary on the counter as I crouched to survey the little beast. It peered back at me with black, empty eyes, it’s whiskers twitching at the thin bars of its prison. </p>\n\n<p>As disgusted as I was, there was an overwhelming sensation of relief to extinguish the burning panic that had violated my body. How silly of me. I laughed, a sharp, mocking laugh that sent my furry prisoner into a desperate restlessness. How silly.</p>\n\n<p>Outside, night had fallen and only the stars offered any glowing penetration through the black shroud that covered the world. I built a fire by the dirt road, as far from the sleepy farmhouse as possible. Aunt Mary had a strange collection of useless waste she had kept in her barn. Amongst it, I had come across three, empty metal bins and had felt some kind of unquestionable premonition that they were likely to come in handy. </p>\n\n<p>There was plenty of odd pieces of wood and paper lying around to encourage an adequate blaze and I stood and watched the flames feed and grow to cast a pleasant warmth over my face. The sudden fear inspired by Aunt Mary’s diary seemed a distant memory now. Replacing it was my prior curiosity which burned as passionately as my little bonfire. I allowed myself a confident smirk as pulled my hands back into the thick leather gloves Grandpa used to use while mucking out the horses. The rat screeched in protest as I lifted the cage, it’s hideous little mouth worked away on the faded material but couldn’t penetrate or get to my skin. In a move that was almost ceremonial, I placed the cage atop the thick wooden beam which spanned the opening of the bin and only encouraged the flames further. The creature’s cries increased in pitch and volume and the ferocity of its movements as it desperately tried to escape the impending heat caused the cage to rock and shudder. </p>\n\n<p>I turned away a moment and looked to the barn across the grass. Shadows from the flames danced across the side of the rotting wood and I had a sudden image of the entire structure engulfed in a consuming blaze. It had been a long time since I had visited the barn. There were a lot of bitter memories there and a different kind of fear that was not so easily sedated. I supposed I should go to it soon enough. He would be wondering where I was after all.</p>\n\n<p>The rat was dead by the time I looked back. Its body no longer writhed but bubbled and burst from the intensity of the heat, a black ooze trickled from the, now empty, eye holes and a satisfying crackling replaced the dying screams. A burning pleasure ignited inside me and burned, pleasantly, up and along my body, spreading my lips into a smile of ecstasy. </p>\n\n<p>Tomorrow I would visit the barn. Tomorrow. </p>\n\n<p><a href=\"https://www.reddit.com/r/nosleep/comments/8jy0pj/aunt_marys_farm_part_2/\">Part 2</a></p>\n</div>\n","author":"LarleneLumpkin"}