{"rank":"39","title":"Heart of Darkness - Even Storms Don't Last Forever","id":"8j6j9o","url":"/r/nosleep/comments/8j6j9o/heart_of_darkness_even_storms_dont_last_forever/","time":"1526241857000","body":"<div class=\"md\"><p>“We have something for you.”</p>\n\n<p>I folded my arms across my chest, one eyebrow rising as I regarded the camera.  “This better be good,” I stated firmly.  “I’m growing tired of being your fucking puppet.”</p>\n\n<p>“Your hostility is unwelcome, Agent.  If you wish to keep working with us, I would suggest you show respect.”</p>\n\n<p><em>We will kill you if you don’t cooperate with us</em>, was the unspoken threat, and I well knew that.  It still rankled me that I was being forced to serve these entities.  </p>\n\n<p>“You will find the file waiting for you at your apartment.  Be very sure that you understand who you’re dealing with.  We do not want mistakes again.”</p>\n\n<p><em>Last time wasn’t my fucking fault, you sons of bitches,</em> I wanted to say.  Instead, I said, “fine.”</p>\n\n<p>“That’s all, Agent.  Have a good day.”</p>\n\n<p>Turning on my heel, I left the darkened room to seek the light of the sun once more.  Three years of working for these mysterious entities, and I had yet to meet them.  Oh, sure, I’d met their goons – when they’d kidnapped me three years ago and took me to them.  I’d been told I was wasting my talent, and if I would work for them, I would be rewarded handsomely.</p>\n\n<p>They hadn’t lied, at least.  I had a pale-grey Ducati, a silver Audi Quattro, and a well-furnished loft apartment in the rich section of town.  I had everything a woman could want – except freedom.  </p>\n\n<p>Pulling on my helmet, I started up the bike and headed for my apartment to see who they wanted me to take care of this time.\nTwenty minutes later, I was wondering if they were trying to kill me.  My target was a woman, but not just any woman.  “Autumn Storme,” I said aloud, looking at her file.  I knew who she was – she was priestess and possibly consort to a very dangerous ancient deity.  She was the only human in a very non-human group of deities who targeted the scum of society to nullify permanently.  “No wonder they told me to make sure I understood who I was dealing with.”</p>\n\n<p>To take her out, I’d have to somehow catch her alone.  Then I’d have to make sure I left nothing behind of myself, so that her deities couldn’t track me down.  Yeah, this was going to be the hardest case I’d ever done for them.  Not impossible, but difficult.</p>\n\n<p>I decided on watching her for a while, to learn her habits.  Everyone had habits, things they did on a regular basis or timeline.  Maybe she went for daily hikes, or maybe she went shopping alone.  Studying the area she and her partner lived in to make sure I knew it, I went to the wall to push a book on the bookcase.  Once the bookcase slid aside, I regarded everything in my arsenal with a critical eye.  Whatever I took would need to fit inside my backpack, because the bike was a better choice than the car for a quick getaway.</p>\n\n<p>My choices made, I packed my bag and gave my apartment one last look.  Hopefully, I’d be seeing it again.</p>\n\n<p>The town on the coast was quaint, but charming.  I found a nice hotel to stay in that was close to the downtown area but still convenient to the highway.  The proprietor tried to flirt with me, but I played it off.  I was accustomed to men hitting on me; my silver-gilt hair and dark-blue eyes combined with my petite frame seemed to just draw them in.  </p>\n\n<p>“You just let me know if you need anything, Miss Frost,” the man said.</p>\n\n<p>“Thank you,” I returned, and left the office to get set up in my room.  I had specifically asked for a room that faced the woods, and I was pleased to see that he had listened to me.  Parking the bike directly in front of my room, I unlocked the door and went inside.</p>\n\n<p>My cell went off while I was setting everything up in the room, and I saw that I had a text when I pulled it out of my pocket.</p>\n\n<p><em>Gift him with her severed head, and you’ll get double the fee.  Find a way to take him out also, and it triples.</em></p>\n\n<p>I blew out a breath.  Sure, I had a long knife sharp enough to do the job in my pack, but sending Autumn’s severed head to a death god just didn’t seem wise.  I’d have to wait and see how things went, first.  If neither of them saw me as any kind of threat, I’d have an edge to use.</p>\n\n<p>As for taking him out … I guess I’d find out how well my specially-blended ammo did.  If I failed, though, that would be that.  My organization would be one less agent.</p>\n\n<p>Somehow, I didn’t think he’d just kill me outright, either.  No, not him.</p>\n\n<p>The first few days of being there, I people-watched.  Everyone in the town knew Autumn and her partner, it seemed, and were fond of them.  I wondered how fond of her partner they would be if they knew him for who and what he was.</p>\n\n<p>Autumn had a book store that she frequented – alone.  Usually she rode into town with her partner in his black Jeep, but on Sundays she went to the book store alone in her black Celica.  Here was my chance.</p>\n\n<p>I loaded up a hypodermic with a blend of methohexital and midazolam, capped it carefully, and slid it into the cargo pocket on my right thigh.  Taking the heavy plastic tarp out, I spread it on the floor of my room, and then left to walk the short distance to the book store to wait.</p>\n\n<p>Autumn showed up right as I was walking down the sidewalk, and I ducked into a doorway to make sure she didn’t see me.  She had her long, thick black hair in a single braid down her back and she was wearing a summer dress in green.  I estimated her at a good fifty pounds heavier than I was, but that wasn’t an issue.  I was a lot stronger than I looked.</p>\n\n<p>Right then, I looked like a twelve-year-old girl.</p>\n\n<p>I sat on the sidewalk just out of sight of the windows of the book store and waited for her to come back out.  Willing forth huge tears, I gazed up at her in fear.</p>\n\n<p>“Oh, honey, what happened to you?” she asked, kneeling down beside me.</p>\n\n<p>“My mommie locked me out of our room,” I lied.  I knew she wouldn’t call the police – no, Autumn liked to handle things personally.  “Why would she do that to me?”</p>\n\n<p>Her face grim, she took my hand and pulled me to my feet.  “The motel up there?” she asked, pointing down the road.  At my nod and sniffle, she began leading me in the direction of the motel.  “Maybe your mama and I need to have a little talk about how to treat your kids.”</p>\n\n<p>I couldn’t believe my luck.  This stupid bitch had actually fallen for my act and was headed straight to her death.  I would have smiled, but I had to stay in my role of abused child.</p>\n\n<p>“Which room, honey?” she asked.</p>\n\n<p>“Around-around back,” I told her, letting her take me around the backside of the motel.  No one was around – the whole backside was empty except for me.  I had made sure of that.  I pointed to my door, and she took me over to it to knock.  That left both my hands free – the last mistake she’d ever make.  Moving swiftly, I drew the hypo, uncapped it, and drove it deep into her neck to depress the plunger.  At her startled cry, I gave her a cruel smile.  “Dumb move, bitch,” I said.  “Too trusting of strangers, well, it’ll be the last time for you.”</p>\n\n<p>“Li will destroy you,” she growled, her eyes going black.</p>\n\n<p>“I’ll kill him too,” I stated, opened my door, and shoved her through.  Just in time, too, she hit the floor as soon as she cleared the doorway.  Picking her up, I put her down in the middle of the tarp and pulled my knife.  Moving the braid out of the way, I took careful aim and brought the knife down as hard as I could, severing her head from her body.</p>\n\n<p>One down, one to go.</p>\n\n<p>Clean-up was relatively easy, since she was on the tarp.  Her head got placed in a bucket I’d picked up at the hardware store, and then I simply wrapped her tight in the tarp and taped it up to shove it under the bed.  I’d be long gone by the time they found what was left of her.</p>\n\n<p>Now to get the head to her precious partner, and see about taking him out, too.</p>\n\n<p>Because I couldn’t carry a bucket and ride my bike, I wound up wrapping her head in several garbage bags and sticking it in my pack.  My firearm went into my holster beneath my shirt, loaded with my special rounds.  As I was headed out, I saw a black Jeep come flying down the road to the book store and smiled.  Good.  I would have enough time to leave the head on the door and then wait for him to come home and find it.</p>\n\n<p>I admit, I didn’t expect to see the black Ducati and green Jeep at their house, but that wasn’t a problem.  Leaving my bike far enough from the house in some bushes, I hiked through the woods to assess how many people were inside. <em>No, those aren’t people</em>, I reminded myself.  Whatever.  If I had to, I’d shoot them, too.  Spotting the door that was used most, I smiled at the lack of windows and deposited her bloody, severed head on the step.  Then I melted back into the undergrowth of the woods to wait.</p>\n\n<p>When he came home, and found his precious girlfriend’s severed head on the door step, I grinned at the look on his face.</p>\n\n<p>That grin quickly left, when he threw his head back and uttered a sound I had never heard before.  I watched in horror as he cast off his human guise and transformed into a fucking <em>dragon</em>.  “You sons of bitches,” I muttered.  “You fucking <em>knew</em> and didn’t fucking tell me.”  Eyeing the massive, green and black dragon, I considered my options.  I could try to kill him, and probably die, or I could make a run for it and hope he didn’t spot me.</p>\n\n<p>I went with the smarter choice.  Money was great, but it wasn’t everything.  Staying alive was more important.  Keeping low to the ground, I began making my way through the undergrowth as quietly as I could, and had to stop in my tracks when another fucking dragon came tearing through the woods.  This one was solid black, scaleless, and had webbed feet.  Hitting the ground, I waited for it to pass me by before continuing to my bike.</p>\n\n<p>What seemed like an eternity later, I reached the Ducati and rolled it out of the bushes.  Strapping the helmet on, I cast one look back at the woods behind me, shuddering at the roars of utter rage from the dragons.  Time to get the hell out of Dodge.  Starting the bike, I pointed it down the road and zoomed off for home.</p>\n\n<p>When I got back, I was going to have a long talk with my organization to find out just how valuable I was to them.</p>\n</div>\n","author":"DanceswithStorms"}