{"rank":"89","title":"My best friend went missing two weeks ago","id":"8j6kwl","url":"/r/nosleep/comments/8j6kwl/my_best_friend_went_missing_two_weeks_ago/","time":"1526242230000","body":"<div class=\"md\"><p>Hi nosleep. I&#39;m going to be honest with you all right now, this is my first time being on reddit, honestly if it weren&#39;t for the strange things that have been happening for the last few months (but especially these past few days) I probably would never ever even thought about getting on this website. It&#39;s just not my scene. But, I think maybe some of you can help me, and I think this may be the only way to reach my best friend. She was obsessed with nosleep.</p>\n\n<p>I&#39;ll keep this short; a few months ago my best friend started acting strangely, she became obsessed with nosleep and any other website for the strange and unbelievable. She was breaking into the town hall and the library, skipping school, reading these weird books. Because we live in such a small town and because everyone knew we were best friends, we were both pretty much shunned for her behavior. Everything went to shit two weeks ago.</p>\n\n<p>I was texting her as usual, we were talking about the homework from one of our classes when things went weird, I&#39;ll transcribe the conversation here.</p>\n\n<p>Monday, April 30th\n5:43 pm</p>\n\n<p>Me: (We&#39;ll call my best friend May) May, did you get the notes from (Teachers name) ? I zoned out in his class and have no idea what to do with the homework lol </p>\n\n<p>May: You always zone out in his class.</p>\n\n<p>May: But yes I got them. I&#39;ll bring them by later.</p>\n\n<p>Me: Thank god </p>\n\n<p>Me: Do you want me to ask mom if you can spend the night ?</p>\n\n<p>(It was at this point May didn&#39;t reply for about 10 minutes, which if you know May you know she ALWAYS has her phone on her)</p>\n\n<p>Me: If you fell asleep I promise I&#39;ll sue</p>\n\n<p>(I then left my room for about seven minutes to make me food, I came back to my phone having 8 missed calls and bunch of texts from May)</p>\n\n<p>(Five missed calls from May) </p>\n\n<p>May: Please answer your phone.</p>\n\n<p>May: Please Kendra</p>\n\n<p>May: I&#39;m sp sorry</p>\n\n<p>(May never made typos, so I&#39;m assuming she was typing in a rush)</p>\n\n<p>May: So so sorry. I hope its not to late. I nevr wanted to involve you</p>\n\n<p>May: You have to understand I did my hardest not to involve you you have to understand its not your fault</p>\n\n<p>(Three more calls from May)</p>\n\n<p>May: You only have two more years. The first chance you get you have to LEAVE. College. Job. Whatever. LEAVE. If you see anything weird IGNORE IT. Don&#39;t get involved. Please Kendra.</p>\n\n<p>(I forgot to say that I didn&#39;t really understand the &quot;You only have two more years&quot; things. I think maybe she meant months as I turn 18 in July. I don&#39;t know. But it was at this point that I heard sirens while reading the messages.)</p>\n\n<p>May: I&#39;m sorry</p>\n\n<p>Me: Wtf ?????</p>\n\n<p>Me: ????????</p>\n\n<p>Me: May what the hell ?</p>\n\n<p>Me: Are you in some kind of trouble ??</p>\n\n<p>Me: MAY </p>\n\n<p>Me: I&#39;m coming over</p>\n\n<p>I grabbed my phone and slipped on some shoes and walked outside, I saw smoke from one of the houses on the next street over. I&#39;m sure you&#39;ve all figured out, it was May&#39;s house that was on fire. I ran through peoples yards and backyards, across the street without looking. I knew as soon as I stepped outside that it was her house, but it didn&#39;t really hit me until I saw it engulfed in flames. I vaguely remember yelling and running towards it, but it&#39;s like remembering a dream. I ran and her mother and older brother saw me and ran towards me(it didn&#39;t occur to me at the time, but it&#39;s weird that her brother was there, he moved out of state when he turned 18, almost two years ago, and hadn&#39;t been back since). Her older brother grabbed me and pulled me to him, either to comfort me or to stop me from running straight into the fire. I remember screaming and crying until my voice was hoarse and fighting against him until my knees buckled and he had to hold me up. His mom came and hugged us both and we all cried. </p>\n\n<p>Here is where it starts to get weird, well weirder. At first it was ruled arson, that someone had doused the house in gasoline and lit it on fire, they told May&#39;s mom that whatever was recovered would be brought back to her after they were cleared for evidence or something, and most importantly they found no trace of a body. Four days later the chief that made this statement skipped town and the case was taken over by the sheriff and a new team of firemen. They released a new statement last week.\nThey say the fire wasn&#39;t arson, that it was caused by some faulty wiring or something like that. They told her mom that nothing was recovered from the fire. \nHow can they just do a complete one-eighty like that? Does that not seem strange? Maybe I&#39;m just looking too far into it, I just don&#39;t know.</p>\n\n<p>And now that&#39;s where I&#39;m left. I know this isn&#39;t some entertaining story, I know people come on here looking for horror stories, but this is my last ditch effort. May, if you&#39;re reading this, please contact me. I have to know if you&#39;re safe, I won&#39;t ask where you are or why you left, I just have to know you&#39;re safe. If any of you could help me even in the slightest. Please. I know she told me to ignore strange things, but I feel like I&#39;m being watched constantly. Yesterday I was followed for a good 10 minutes by a car with a man driving it that I didn&#39;t recognize. They are trying to cover up what the fire really was and whatever they recovered. Or maybe I&#39;m just paranoid. I don&#39;t know what to do.</p>\n\n<p>EDIT: I&#39;m going to talk to the old Chiefs family after school today.</p>\n\n<p>EDIT: Part 2 <a href=\"https://www.reddit.com/r/nosleep/comments/8jrpnz/my_best_friend_missing_two_weeks_ago_update/\">https://www.reddit.com/r/nosleep/comments/8jrpnz/my_best_friend_missing_two_weeks_ago_update/</a></p>\n</div>\n","author":"kendrahargrove"}