{"rank":"28","title":"[part two] If I die before backup arrives","id":"8j6k1p","url":"/r/nosleep/comments/8j6k1p/part_two_if_i_die_before_backup_arrives/","time":"1526242030000","body":"<div class=\"md\"><p><a href=\"https://www.reddit.com/r/nosleep/comments/8iqtwh/if_i_die_before_backup_arrives\">Part one</a> </p>\n\n<p>The shattered window lead us into either a lunchroom or a conference room, maybe both. A long table with chairs on each side covered in dust stood in the middle untouched, perfectly placed. The exit door was in the end of the room, barely lit up from the broken window. «Flashlights on» a flick on the tip of my shotgun and there was light, quickly backed up by two more from behind, uncertain if they heard me or just followed my move. It smelled old fabrics and mold in there, like the basement you where exploring in a friend’s house as a kid.</p>\n\n<p>Mino tapped my shoulder to signal that she was ready to go, and we moved towards the door. Our footsteps was silenced by the carpeted floor. The door opened slowly until I could see most of the hallway to our left, before I quickly took a step out and covered the right. «Clear.» I spoke just loud enough for my mic to pic up my voice. «Max, are you tapping in on my video feed? » I had to wait a couple of seconds before his voice confirmed. Risky move using a pad when he was in cover. The light from the screen could easily become a beacon of light for the enemy, but Max is a pro.</p>\n\n<p>Epic and Mino entered the hallway covering each direction. Both ways had a door at the end and probably five or six on each side before it. The silence didn’t help much with choosing which way we should go, but I quickly started moving left, because the right way isn’t always the right way to go. Door by door we checked and cleared each room that seemed to be smaller storages for office supplies and what not, until we stood in front of the door in the end. Same routine, open and clear. But the door was locked. I moved back letting epic get through to break it up with his axe, but instead he went all in with a powerful kick, splintering the doorframe and cracking the door as it flew up with a loud bang as it hit the wall. Mino chuckled, «show-off» and went past him to clear the room with epic right behind her. I used a moment to envy the strength of that kick as I saw the destruction he left behind. That was when I heard it.</p>\n\n<p>A low gurgling sound behind me sent shivers up my spine. I turned around and raised my shotgun so I could see better. A naked slender white humanlike creature stood in front of the door at the other end of the hallway, crouching its tall body as it’s shoulders reached up to the ceiling as it leaned in forwards. Its arms long enough for it to lean its elbows against the walls at each side of the hallway that was narrow enough for me to touch both sides with my fingertips. Its hands was fading into black from its elbow, covering it’s long fingers. Its face pierced straight through my eyes and down to my stomach, turning it, filling it with ice and froze limb. Its eyes starring with dark red spider web veines covering almost all of the upper face in contrast to its pasty light blue, almost white face. And it had a grim smile not like anything a human could make, almost all the way from ear to ear if that&#39;s what those bleeding wholes on each side of its head was, covering its shoulders in dark almost black substance. The pupils went from black and covering its eyes to small black dots, leaving the eyes almost all white as the flashlight hit it. It stood completely still, starring at me like a deer hit by headlights in the middle of the road. It was like I was the one surprising it, and not the other way around. But the smile... It said the opposite. </p>\n\n<p>A shot went off behind me from the room where Epic and Mino was, making the creature silently crouch backwards in through the door, maintaining eye contact until it disappeared into the darkness the same second the earpiece echoed commands and statuses from the voices behind me, leaving me uncertain what to do. What the fuck was that. «Cole! Target on the move!» Mino’s voice pulled me out of the dreamlike state I entered and I turned around into the room seeing Mino and epic disappear into the next room and behind a corner filling the radio with command and shouts. I tried to get hold on Max and asked if he saw what I did, but I didn’t get through. It had to wait. </p>\n\n<p>My feet moved fast to track down the others, but my mind was stuck on the creature. What could it be? Was it real? What the fuck are we doing here? And again, what was that? It felt surrealistic. I couldn’t even believe it was real myself. It had to be the light playing a trick on me. Maybe the mold here was a funny kind. I could see the flashlight from the others swaying from side to side and their voices become more prominent. I had to tell them, warn them, tell them that we needed to get the fuck out of there. But as I turned around the corner to catch up, only a few steps behind them a figure stepped out from a side door and hit me directly in the head with something hard, knocking me to the floor. All sounds disappeared, and then nothing. Only darkness. </p>\n\n<p>When I came to myself I was alone. Not a sound to be heard. I reached for the radio, but it was smashed to a thousand pieces spread out on the floor. I desperately reached for the camera just to find it missing. My head hurt really bad, and blood had dried in my face and on my jacket. Have I been out? For how long? I reached for my phone in my belt. Still there, good. But as I turned it on a weird feeling run down deep inside of me. Blocked. The only ones who can block the police issued phone, is the... Police. I crawled into the closest office not able to stand up after the blow to the head. I just wanted to sleep, but I had to make contact with someone. An old computer came to life after a couple of shakes, five reboots and what felt like an hour start up. But it worked. It was even online, but with a restricted slow internet connection, and only with a few accounting programs and a browser of the slowest kind. What luck. Every social media was restricted, even emails. What fun workplace this must have been. Every site containing pictures almost froze it, but then, Reddit... Please help me. Please tell me that I’m not crazy. Please stay with me.</p>\n</div>\n","author":"NL_Dale"}