{"rank":"548","title":"Thalassophobia","id":"8j74sk","url":"/r/nosleep/comments/8j74sk/thalassophobia/","time":"1526246884000","body":"<div class=\"md\"><p>Thalassophobia: from the Greek <em>thalassa</em> meaning “ocean” and <em>phobos</em> meaning “fear” -- a pathological fear of the sea. </p>\n\n<p>That’s me, nowadays. Like most phobias, Thalassophobia stems from a fear of the unknown, flavoured with the particulars of one’s terror. If you’re afraid of snakes or spiders, I imagine bites and envenomation are concerns. Crashes for fear of aeroplanes, falls, for heights, all that.</p>\n\n<p>The things that flavour a fear of the ocean are varied: there are antediluvian horrors of a thousand stripes slinking through the sea, all manner of utterly alien life. The ocean is also capricious and deadly, with its rip tides and rogue waves, and then, there’s all that depth below, all that distance to simply sink, slip away, and vanish. Take your pick. </p>\n\n<p>I don’t know where my fear first came from, but it grew steadily throughout my youth. It’s funny: I always loved to fish and swim and for the longest time, I told people I wanted to be a marine biologist, Jaws and lungfulls of water be damned. Practicality, more than my growing disquiet, killed those dreams, and I’d never have called this unease “phobic.” I still paddled around at the beach and went deep-sea fishing with my folks. It never kept me from anything. </p>\n\n<p>So when my in-laws gave me a set of tickets to join them for a cruise, I was merely reluctant, hesitant, to come along. The prospect of spending so much time out to sea made my skin crawl, but with my boyfriend’s eagerness and the sheer generosity of the gift, I couldn’t rightly refuse. Besides, it was the Caribbean, our trip slated for the bleakest months of the Canadian winter, and there would be all the liquor I could drink to calm my nerves. I told myself that we’d be puttering between islands and spending half our time on shore, anyways, that it wouldn’t be that bad. </p>\n\n<p>Well, I’m writing this now, so I suppose that assessment was… half-right. But I’ll never so much as visit the sea again. </p>\n\n<p>We were somewhere off the coast of Jamaica, a bit less than halfway through our trip. I had upgraded to a balcony view, mostly to placate the claustrophobia of those tiny cruiseline cabins. We’d pulled away from shore in the late afternoon, eaten like pigs in the dining hall, and sucked back rum like it was going out of style. My beau and I called it an early night, retiring to our little balcony just after sunset to crack into a couple bottles from the port, and spark some cigars from the last one over. </p>\n\n<p>It was then that I felt, more than heard, this… reverberation. Deep, like a fog-horn, barely audible for all its resonance, it made the hair on the back of my neck stand on end. I’d become acclimatized to the ship’s engines and the ebb of the water, but, being no sailor, I wouldn’t have called myself “familiar.” So I didn’t know, then, if it was just my liquor-fed imagination. Shrugging it off, we played our cards, drank our drinks, and went to bed.  </p>\n\n<p>But when I heard it again, the next night out to sea, I knew I wasn’t hearing things. Something about that sound made my blood run cold, made me want to hide, to flee. I felt dread in my bones. I drank harder to conquer my cowardice, and asked around the next day. </p>\n\n<p>“It was just the ship,” my boyfriend said. The crew echoed his explanation.</p>\n\n<p>“Maybe there was a tremor or an earthquake,” my mother-in-law suggested. </p>\n\n<p>“How much were you drinking?” my father-in-law joked. </p>\n\n<p>Funny how some booze and an idyllic week can engender complacency. But curiosity, straddling paranoia, kept that rumbling, resonant sound on my mind all day. So I was listening for it when it happened the next evening aweigh. </p>\n\n<p>There’s something breathtaking about all that black water at night, something gorgeous in the dark, glassy sea. I’d looked at it almost fondly the past few days, almost enjoyed watching the sunset boil into the ocean. I gazed down, when I felt that rumble, searching. And I wish, in hindsight, that I hadn’t. </p>\n\n<p>It’s near impossible to see a shadow at night, harder still to see a darker patch in inky sea water. But see it I did. No word of a lie, this shadow beneath us, was wide as the boat and trailing behind farther still. I squinted at it through the haze of rum, grabbed my boyfriend and made him look too. But with his cokebottle glasses, his eyes were useless, and he returned to his seat unconcerned and unconvinced. </p>\n\n<p>I may well have joined him in his dismissal had I not watched an eye open up beneath the surface… then another, and another still, raggedly spaced in that undulating shadow below. I’m a shite guess for sizes, but this eye, it must have been six foot across, more. Orange and glowing, staring… alien.</p>\n\n<p>Had I not recently pissed, I’m sure I would have there. Addled with liquor and empty-bladdered, I stumbled instead, mashing our drinks as I leapt back from the rail. Frantically, I bade my beau look again, and, white-knuckling the banister, I looked down with him. But while that rumbling sound still vibrated through the vessel beneath us, while I could still see the shadow pacing our ship, those monstrous fisheyes were nowhere to be seen. </p>\n\n<p>I wouldn’t sleep that night or the next, not until exhaustion and drunkenness tag-teamed me into oblivion. All the prying about my suddenly sullen demeanour, my obvious reluctance to climb back aboard after our island forays wouldn’t make me talk. It sounds insane to pen it all even now, let alone to have spoken it then… but I know beyond a doubt what I saw, what I felt. </p>\n\n<p>There is something very, very big down there. </p>\n\n<p>I never much liked aeroplanes before, but I blew a sigh of relief when we pulled into our final port. I never much liked Canada’s winters, but I nearly wept to be back in our frozen, land-locked province. And I can say with certainty that I was right about the sea. </p>\n\n<p>I’ve read that we know more about outer space than we do the ocean, and that we extinguish new species of life as often as we discover them. With all that water covering the globe, it’s no wonder that there are things out there yet unseen. And with the Precambrian monstrosities we dredge up each day, with that nigh-impenetrable blanket of the unknown across the earth, it’s unsurprising many have a primordial fear of the ocean. </p>\n\n<p>I don’t know what I saw those nights, and truth be told, I don’t want to. But if an anonymous warning is worth anything to you, stranger, please:</p>\n\n<p>Stay on dry land. </p>\n</div>\n","author":"OTheThingsIveSeen"}