{"rank":"13","title":"The Bargainer's Requiem","id":"8j7509","url":"/r/nosleep/comments/8j7509/the_bargainers_requiem/","time":"1526246931000","body":"<div class=\"md\"><p><em>What I am saying now is a lie</em>. Or is it? I suppose it’s up to you, whoever you are, to decide. If <em>they</em> even thought I was writing this…well I suppose I’d already be dead, wouldn’t I? I’m dead anyway, so what does it matter if I tell? I just hope this makes it to someone who can get help. Not for me, no I’ll be long gone by the time this finds you, but for the others. Oh god, there’s so many others out there, and they’re always being watched. I suppose I’ve put you in danger as well, and for that, I’m truly sorry. But it’s all just a lie, right? Like I said, I’ll leave it up to you to decide, but right now I have to tell you what happens when you make a deal with a demon. </p>\n\n<p>How does one even come to encounter a demon, you might be wondering. I can’t say for sure, but I think that some people just put off an energy that attracts them. Desperation, despair, anger, perhaps? But they’ll find their way to you, in your lowest moment, and make an offer you can’t refuse. Have you seen that movie <em>The VVitch</em>, the one with Black Phillip? “Wouldst thou like to live deliciously?” Black Phillip asked the main character. She wanted to, and she did. All it cost was her soul. Me? My deal started out relatively small, just something to keep my life together. But the favors keep growing, the demands more gruesome, the tasks more bloody, and I am loathe to resist. But <em>this?</em> I just can’t! How can they expect me to, she’s my daughter for God’s sake, how can I…but this is all a lie, remember? </p>\n\n<p>So, I mentioned that demon attracting energy? I can only imagine it was wafting off me in waves that fateful April night, just a few short years ago. I was fucking miserable. Halfway through my second bottle of wine, I sat at the small patio table on the balcony of my 5th floor apartment, face red and swollen, snot and tears staining my face from all my crying. Ten years, ten long freaking years, and he just walked away. Leaving me and Callie, our 5-year-old daughter, all alone so he could what, chase after that bimbo from the office? I kept it together, stayed strong and assured my girl that everything would be fine, that Daddy just needed a little time, as he packed all his shit that afternoon and left without so much as a faked sorry. But that night, I broke. I lit another cigarette, even though I’d quit two years prior, and took a deep drag, wincing at the way the smoke burned my raw throat. </p>\n\n<p>Out of the corner of my eye, I saw something strange. At first, I thought it was the drink, and my own emotional instability causing me to see things that weren’t there. But I knew something wasn’t right. The air vibrated, the corner of my balcony putting off an incredibly uneasy feeling, and I swear I could see the air shimmering, light green sparkles. My pulse jumped in my throat, and I tried in vain to will my heart to cease its erratic hammering in my chest. I should have ran inside, slammed the doors shut and locked them, drew the curtains and stayed bundled on the couch until morning. </p>\n\n<p>But I didn’t, because I am an idiot. Instead, I took another drag, and turned to face the corner just as the shimmering green sparkles materialized into a being that resembled something human. I knew it wasn’t though, there was no hiding the fact. Its ears were a little too pointy, the eyes a bit too large and wide, and it just exuded pure e<em>vil.</em> “Wh wha what do you want?” I managed to stammer out. The thing looked straight at me then, it’s too large eyes boring right through me, and it smiled, flashing sharp, sickeningly yellow teeth. “To help you, of course. Your pain, it calls to me.” It stated matter-of-factly, its voice smooth like honey. </p>\n\n<p>“H-h-help me? But how, why?” I whispered. My head was spinning, too drunk, I told myself. Too drunk and hallucinating. I closed my eyes, convinced I’d open them and the thing would be gone. Instead, when I lifted my head and peeked through one eye, the thing had pulled up a chair across from me, lounging back with one ankle resting on the opposite knee. It reached forward across the table, and pulled a cigarette from my dwindling pack. “Got a light?” it mumbled around the cigarette clenched between its lips. I found myself unconsciously pulling my lighter from my jacket pocket and sliding it across the table. “Thanks.” It nodded in appreciation as it flicked the lighter, the cherry at the end of the cigarette flaring to life as the thing took a drag and exhaled with a sound of satisfaction. “I make things happen. Grant wishes, if you like. Anything you desire, all you have to do is ask. But it will cost you.” It answered belatedly, its voice a calm, lilting sound that make me feel anything but at ease. </p>\n\n<p>“Cost me? Like….my soul?” I asked. The thing flicked ash into the glass ashtray that was sitting on the table and laughed. The sound was like bells tinkling, and glass breaking. I know that sounds stupid. It was a happy sound, but it held a sense of danger that I can’t quite describe. “No, my dear that’s not my department. Souls are of no use to me. I may ask favors, I may ask for objects, it all depends really. But I’ll tell you what, for our first trade, I’ll keep it simple. I’ll grant your any wish, and all I ask in return is a lock of your hair. What do you say, Angela, do we have a deal?” The thing took the last drag off its cigarette and stubbed it out in the ashtray, then leaned back staring at me intently, too wide eyes alight with excitement and a smirk playing at its lips. “I just want him back,” I sobbed, the tears breaking loose once more and flowing freely down my face. </p>\n\n<p>The thing grinned then, and pushed up out of its seat. It glided, yes glided, over to me and took a small chunk of my hair in its hand, then swiftly and painlessly with the other sheared the lock free with a clawed finger. “Three days. Give it three days, and your life will be back to normal.” It placed a ghost of a kiss to my temple, and with a field of green sparkles, it shimmered into nothing. I sat there for what felt like an eternity, staring at the spot where the thing disappeared, not sure what to make of the encounter. Too drunk, I thought again. Too drunk, and losing my fucking mind. A cool spring breeze picked up then, and I took that as my cue to head in for the night. I went to the kitchen and poured myself a glass of water, popped a few aspirin for good measure. Numbly, my feet led me to the shower, and after soaping and scrubbing crawled into bed and fell into a dreamless sleep. </p>\n\n<p>The following two days went by in a blur. A painful hazy blur, in which I tried my best to maintain a sense of normalcy, if not for me, then for Callie. She went to school, I to work, and we ate dinner in an uncomfortable silence. The second was the hardest. “Where’s Daddy gone, Mommy?” She asked, an innocent pleading in her voice, a need for some sort of reassurance that only a mother can provide. “Don’t worry, baby. He’ll be home tomorrow.” I heard the words leave my lips, and immediately wished I could swallow them back down. Why had I told her that? The event that unfolded two nights prior was merely a figment of my imagination. Just the desperation of an insane, heartbroken woman manifesting itself in the form of a wish granting demon. I looked up then, realizing I had been staring at my plate, lost in thought, for quite some time, and gave Callie the warmest smile I could muster. “Put your plate in the sink, baby, then go brush and put on your jammies. We’ll watch a movie before bed, yeah? Tomorrow’s Saturday after all, no need to be up early. Well go on, I’ll see you in a minute.” </p>\n\n<p>I couldn’t help but feel ridiculous for thinking, if only for a moment, Jonathan would be home tomorrow, as I sat curled up on the couch with Callie’s head resting in my lap, Elsa from <em>Frozen</em> belting out “Let It Go” in the background. I ran my fingers through her soft brown waves, my mind briefly going to the chunk that was missing from my own wavy mane, and resolved to call him tomorrow. To get things set in place, hammer out a visitation schedule, set a child support amount. I can handle this, I told myself. A part of me even believed it a little. </p>\n\n<p>I awoke Saturday morning to the glorious scent of freshly brewed coffee and the sound of two hushed voices whispering back and forth. It must just be Jonathan and Callie, I thought, as I readjusted my pillow and laid back down, only to fling myself upright seconds later, heart pounding in my throat. <em>Jonathan?</em> I swung my legs around to dangle off the side of the bed, and shoved my bare feet into my favorite pair of cozy slippers before grabbing my fluffy purple robe off the bedpost and slipping it over my bare shoulders. I tend to run hot while I sleep, but I needed the warm secure feeling my robe provided, security that my simple nighty could not, to face whatever fresh hell awaited me in the kitchen. I crept cautiously down the hallway, careful to avoid the creaky spot, and peered around the corner that opened into the kitchen. Callie sat at the small island cracking eggs into a bowl, and there, standing in front of the stove with a spatula in his hand and a kitchen towel draped over the opposite shoulder, was Jonathan. </p>\n\n<p>Callie glanced up from her work just then, surprise washing over her face, quickly replaced with disappointment. “We were going to surprise you, Mommy! We were so quiet,” she whined, and Jonathan turned around then. He gave me a sheepish smile, then turned back to the stove, flipping pancakes over on the griddle, and removed bacon from a frying pan, setting it on a paper towel covered plate to drain. He tugged the kitchen towel down off his shoulder, wiped his hands, then sauntered over to where I stood frozen just inside the kitchen. “Morning, babe,” he murmured, as he snaked an arm around my waist, giving me a quick squeeze and planting a kiss firmly on my cheek. I shied away from his touch, mind racing a million miles a minute. It happened. Holy shit it really worked. </p>\n\n<p>“Jon? What are you doing here?” I asked, my voice still heavy with sleep, brain not fully processing the situation playing out before my eyes. “Well I live here, don’t I? Miss Callie and I were hoping to bring our favorite lady breakfast in bed, but we should have known better than trying to sneak anything past you! Go sit down, Angie, I’ll bring you a cup of coffee.” I felt my feet moving me forward to the couch of their own accord, then numbly, I flopped myself down. I looked around the living room, my gaze coming to land on a framed photograph of Jonathan’s parents taken on their 30th wedding anniversary, a photo Jonathan had packed up when he left, now back perfectly in its place. A quick survey of the room revealed that everything was back in its place; Jonathan’s books were back on the shelf, his prized baseball signed by Hank Aaron in its glass case perched on the mantle. Just then, Jonathan appeared in front of me, holding out a steaming mug of fresh coffee. I accepted it with shaky hands and an appreciative nod, then took a sip. Perfect. He always made the best coffee. </p>\n\n<p>I stood, mug clasped firmly in both hands, and walked around the house. His towel was on the rack in the bathroom, his toiletries in their proper place. His clothes were back in the closet, his pillow on the bed. How had I missed that? It was like he’d never left. “Mommy?” Callie called, as she poked her little head in the doorway of my bedroom. “What, baby?” I responded, turning to glance at her. “Breakfast is ready, I set the table all by myself. Come on!” </p>\n\n<p>Our lives went on seamlessly, like my husband and father of my child hadn’t just up and left. Like the perfect little family we’d always been. It seemed neither Callie nor Jonathan remembered him ever being gone. But I did. And it was slowly eating away at me, that knowledge. I filled the hole my little secret was creating with drink, a bottle or so a night, when Callie and Jon were asleep, when the voices telling me I was a monster couldn’t be silenced by the busyness of the day any longer. I found myself cringing at the thought of my husband’s touch, at the hard truth that he didn’t <em>want</em> to be touching me. I called on the demon about 3 months after Jonathan had returned home. I wasn’t sure how to go about summoning it, so I just sat on the balcony wine glass in hand, and called “I want to make a deal,” out into the night. For a few breathless seconds, nothing happened. But then, slowly but surely, I felt the change in the air, and the corner began shimmering. </p>\n\n<p>“You rang?” The thing smirked, as it stepped out of a cloud of green sparkles. It pulled up a patio chair, lounging back, and grabbed a pack of cigarettes from the inner pocket of its long duster jacket. “Hmm?” It gestured the pack towards me, I shook my head no in response. Shrugging, it took a cigarette out for itself, lit it up, and exhaled a puff of smoke before fixing its wide eyes on me, head cocked slightly to the side in curiosity. “You don’t look happy. Is everything alright with Jonathan?” It inquired, and genuinely seemed interested in the answer. The question took me aback. “What? Yes yes, everything is fine. That’s not what this is about. I was wondering if you can help me with something else. But first, what’s your name?” The thing tapped ash into the ashtray, making a tisking noise. “Can’t tell you that, Angela. See, to know a being’s true name is to have power over it, and that simply won’t do. But I’ll tell you what, how bout you call me Ray?” </p>\n\n<p>“Ray?” I asked skeptically. It, I mean he, nodded in response, a smug smile showing a flash of those sharp yellow teeth. “So, what can I do for you, Angela?” Ray stubbed his cigarette out, and reclined, head resting on interlaced clawed hands. “I’m going to get fired, I just know it. All the stress from being the only one who knows about it, you know the situation with Jonathan, is really getting to me, and it’s showing in my work.” I rushed out, and took a big sip from my glass. “Well gee Angela, I wonder what could be effecting your performance,” Ray quipped sarcastically, “so I guess you want me to make sure you don’t get fired?” “No,” I affirmed, “I want a raise. Higher pay, less hours. I want my own office, not just some dinky ass cubicle.” Ray’s already large eyes grew impossibly larger with excitement, he leaned forward, stare boring into me, and licked his lips. </p>\n\n<p>“Wanna be the boss huh? That’s no problem, Angela. I can make it happen like that,” he snapped his clawed fingers for effect, “But it’s going to cost more than a lock of hair.” I stared him in the eyes, determined not to being intimidated by this evil thing before me. “Name your price.” I would not be moved. Ray let out a laugh then, and it made my skin crawl. “I’m hungry,” he said. “You you’re hungry? Well I guess I could make you something real fast…” I trailed off, unsure what exactly one would cook for a demon. Ray grinned then, so wide it looked like his lips might split. </p>\n\n<p>“Bring me your cat.” </p>\n\n<p>“I’m sorry, what? My cat?” </p>\n\n<p>“Yes, your cat,” he hissed with excitement. I slammed my glass down on the table, wine sloshing over the edge. “Fuck you!” I spat out between clenched teeth. “I am not going to just let you eat my cat!” Ray pushed away from the table and stood. “No cat, no deal,” He stated simply, with a shrug of his shoulders. The air began to shift again, and I could already see the green sparkles materializing. “Wait!” I shouted, holding out a hand. The sparkles dissipated at once, and Ray stood there, head cocked to the side in curiosity. The all white Persian, Snowball, <em>was</em> getting up there in age. Jon had the cat for about 2 years before we got together. Would it really be such a terrible loss? Callie had been begging for a puppy. And I mean, it wasn’t really <em>my</em> cat….. “Will you make sure she doesn’t suffer?” I whispered, voice barely audible. Ray nodded enthusiastically, and said “Of course, Angela.” </p>\n\n<p>I stood and shuffled inside, and found Snowball asleep on the armrest of the couch. I scooped her up in my arms and she mewled in protest. “Shhh,” I soothed, as I stroked her soft white fur. I carried her slowly out to the balcony, trying to tell myself it was for the best. I <em>needed</em> this job in a much more important way than I needed this cat. I silently prayed, to a God I’m not sure exists, to forgive me. I stood before Ray, Snowball clutched tightly to my chest, feeling as though I might be sick at any moment. Tears began to break loose from my eyes, and I gave Snowball a squeeze and placed a kiss on the top of her fluffy head. “I’m so sorry.” I looked at Ray then, wiping tears on my sleeve and said firmly, “Please, be fast.” </p>\n\n<p>Ray snapped his fingers, and I felt Snowball go limp in my arms. I choked out a sob, the tears coming fast now, as Ray made a gesture with his outstretched hands for me to give him the cat. I obliged, gingerly placing Snowball’s lifeless body into Ray’s eager claws. Ray opened his mouth then, impossibly wide. I thought for a second I saw a glimpse of green fire burning in his throat, then he began to devour poor Snowball whole. I turned away as his mouth closed, the whole cat inside, and made a mad dash for the edge of the balcony. I threw up a $40 bottle of Soft Red all over Mrs. Johnson’s newly reupholstered patio set a floor below. When the heaving subsided, I turned back to face Ray. “You just ate my fucking cat,” I said in disbelief. “Enjoy the new job. Maybe think twice before calling me again. Or don’t, better for me that way.” Ray winked then, and vanished into a field of green sparkles. </p>\n\n<p>The next deal cost me a finger. Just writing that makes the nub where my right pinky use to be throb. It was the middle of July when I got the phone call. My father had been sick for some time, you see. Lung cancer, I’m sure those 30 years of smoking didn’t help much. But it jumped to the lymph nodes, and pretty soon metastasized throughout his entire body. It wasn’t long after we got the news that it had spread that he passed. I had our flights all booked, ready to leave on Friday night after work, when I got <em>the</em> call on Wednesday. My mom did her best to keep it together, but it was easy to hear that she was breaking apart inside. Her life revolved around Dad, my younger brother, and I. I told her we’d be in early Saturday morning, and hung up the phone. I held it in my hand long after the conversation was over, my mother’s words not really sinking in. Jonathan was away on business, and wouldn’t be back until Thursday afternoon. I put Callie to bed, and hugged her extra tight. Then I poured myself a glass of bourbon, second guessing and grabbing the bottle and a spare glass, and headed to the balcony. </p>\n\n<p>“Ray, I need your help,” I shouted into the empty night. It wasn’t empty long as I felt that tell-tale shift in the air, and those green sparkles appeared. “Long time, no see, Angela,” Ray stepped out of thin air and pulled up the chair across from me. It’s true, I hadn’t called on Ray in over 2 years, not since the incident with Snowball. I gestured at the glass questioningly, to which Ray nodded in agreement, and I poured him a glass. He took a sip without saying anything, just staring intently at me. “My dad died tonight,” I managed to croak out, my voice and heart breaking simultaneously. Ray shook his head apologetically. “Condolences.” </p>\n\n<p>“I need to say goodbye. Please, can you just give me that? I need to make it there in time, before….I just need to tell him that I love him, and I’m sorry. I’m sorry for everything.” This last part came out barely audible. We had had a falling out a few years back, my father and me. We exchanged pleasantries on holidays, but other than that, it was pretty much two-way radio silence. “That’s a tricky one, Angela,” he replied, “but I can do it. I just don’t know if you can pay the price.” </p>\n\n<p>“Please Ray I’m begging you. Whatever the price, I’ll pay it,” I affirmed, unwavering in my resolve to make this deal. “I’m going to need a finger,” he said simply, then took another sip, “Excellent year by the way.” “A finger? And where the fuck am I supposed to find a finger just laying around?” I seethed. “Well, anyone with a hand I suppose. Like that chap down there in the alley, so piss drunk, I doubt the poor bastard would even miss it. Or how about little Callie? Mmm, yes. A child’s finger, I could do a lot with that. I could sweeten the deal considerably for that, Angela,” he mused. I slammed my fist down on the table, sending both glasses and the bottle wobbling. “Don’t <em>ever</em> speak of my daughter again, you hear me? She will never be involved in this little game we’re playing at. Never.” I snarled, ready to pounce if he so much as looked at me wrong. Ray held his hands up innocently, in a “hey, just a suggestion,” kind of gesture. “Fine, fine, my mistake. But I will be needing that finger, Angela. And soon. The longer we wait, the harder it will be to get you back to the right time.” He smirked. </p>\n\n<p>I watched intently as the blue flame of my gas range licked at the sharp blade of my meat cleaver. I used it on occasion to spatchcock a chicken or a turkey breast. Now I intended to use it to cut off my own pinky. I could have taken it from the homeless man down there in the alley, sure. But I could not shoulder that amount of guilt. Not again. Not after having to act like nothing was ever wrong between Jonathan and me. Not after having to pretend I didn’t know where Snowball wondered off to. Seeing how deeply her absence saddened Jonathan. Not after Callie crying for weeks, helping her hang missing posters around the neighborhood. No, this was my deal. I would fork over the payment. The blade turned bright red, and I knew it was time. </p>\n\n<p>I took several deep breaths, and a nice swig off the bottle of Woodford Reserve that sat next to the cutting board on the counter. I poured a splash of the bourbon onto my right hand that was resting on the cutting board. I took a wooden spoon from the drawer, and placed it in my mouth, biting down as hard as I could. Ray sat at the kitchen island, staring intently, delightedly, as if at any second, he would start rubbing his hands together in anticipation. Sick fuck, I thought. “Make sure you use a good amount of force. It’ll be easier if it comes off in one blow. I don’t think you can stomach it if you have to hack,” Ray offered from his spot at the island. I growled in response. But he was right. One cut, I had to do this in one cut. I cleared my mind, spread my hand wide, and forcefully brought the cleaver down. I heard it thunk soundly into the wood beneath as wave after wave of blinding hot pain seared through my hand. I screamed wordlessly against the spoon clenched in my teeth as I dropped the cleaver, and sunk to the floor in a heap, cradling my hand to my chest. It was bleeding, but not as much as one would expect. Heating the blade had worked to cauterize the wound pretty efficiently. </p>\n\n<p>Ray tossed a kitchen towel in my direction as he strolled over towards me, and I dutifully wrapped my hand, before losing the contents of my stomach all over my freshly mopped floor. He stood in front of me, picking something up off the counter. <em>My finger.</em> Ray crouched down in front of me, looked me directly in the eye, then stuck the severed end of my finger between his lips, making a slurping sound. His eyes fluttered shut, and he let out a moan of satisfaction. I vomited all down the front of my shirt. The too large eyes flew back open, and with a chuckle he removed my finger from his mouth. “Make it a nice goodbye, yeah?” And with that, he was gone, and I was left staring at a fading cloud of green sparkles.</p>\n\n<p>Coming up with an excuse as to why my finger was gone, and where it went to, wasn’t as hard as one would think. That night once I’d returned home from my journey back in time to visit my father, I played up the shock in the emergency room, and the staff on shift quit pushing fairly quickly. Everyone else was not so easily placated. I finally decided the best course of action was to play the shell-shocked and clueless drunk woman, so utterly distraught by the news of her father’s passing, that a terrible accident occurred, and poor me, I must have passed out after it happened. Hey, at least it was close to the truth. As for the whereabouts of my amputated finger, the only logical explanation was that Baxter, the new family dog, must have run off with it whilst I was unconscious. The lies rolled off my tongue with a polished fluidness. When had being deceitful become so easy? What was happening to me? I avoided calling Ray for quite some time after that. Time came and went, seasons changed, and Callie had just celebrated her 10th birthday. </p>\n\n<p>It seems that my father’s illness may not have been due solely to poor life choices, and that genetics may have had a hand in it. At least that’s what they’ve surmised. I started experiencing this terrible back pain about two months ago. Chiropractic wasn’t touching it…it was like the pain was deeper, more internal. At first, my family doctor just prescribed me some Vicodin, told me to take it easy, and sent me on my way. “You’ve had a rough go these last few years, Angie, take it easy and slow down a bit,” he had said with a gentle pat on my shoulder. Shortly after that visit, I started coughing up blood. </p>\n\n<p>The CT scan showed many “shadows” on my right lung, so I was sent in for a biopsy. Sure as shit, its cancer. Small Cell Carcinoma, to be exact, the most aggressive form. But luckily for me, it’s in the limited stage right now, meaning it hasn’t spread beyond the right lung and nearby lymph nodes. The oncology specialist recommends surgery to remove the affected lobe and nodes, then chemotherapy, and preventative radiation to the brain. With all of this, I should be guaranteed at least five more years. <em>Five more fucking years</em>. I bit back a laugh as it bubbled up from my throat, and glanced at Jonathan. He sat in silent horror, intently watching the oncologist as he explained my options. Jonathan gave my clammy hand a squeeze as he turned to look at me, eyes so wide they reminded me of Ray. <em>Ray,</em> I thought<em>.</em> “You can beat this, Angie,” he murmured reassuringly, though his eyes told a different story. I felt my lips twitch upwards into a small smile, and laid my head against Jonathan’s shoulder. He was right, after all. I can beat this…but what will it cost me? </p>\n\n<p>“Come on out, you sick fuck, I know you’re waiting,” I called to the corner of my balcony that was already putting off that ominous vibration. Green sparkles materialized, and out stepped Ray, smoothing down his black button up shirt. “Now, Angela, is that any way to greet an old friend, one who’s done so much for you?” He quipped as he pulled up the chair opposite me. He cocked his head and fixed the large orbs of his eyes on me, curiously, anxiously, awaiting my reply. “You’re right. I’m sorry,” I ground out, feeling anything but apologetic as I remembered the sheer delight he had exhibited when my severed finger had been between his lips. I needed his help though, so I swallowed my pride, and disgust, and poured him a glass of Candoni. I picked up the pack of cigarettes, took one out for myself, because obviously quitting had done no good for me anyway, and then offer the pack to Ray. He accepted with a nod, lit his cigarette, then offered the flame of his match to me. </p>\n\n<p>“As much as I always appreciate the drink, what, may I ask, brings me here this fine evening? I’m a busy man, Angela. Places to go, people to eat, excuse me, meet.” He smirked as he brought the glass up to his lips. I laughed then, a bitter sound, and replied, “No, you’re not.”</p>\n\n<p>“Sorry, I’m not what?” </p>\n\n<p>“A man. You are <em>not</em> a man.” </p>\n\n<p>“Ah, but I am. Human, no. But man, very much so.” He exhaled a stream of smoke, and waggled his eyebrows suggestively. I fought the bile rising in my throat. I cleared my throat, and got right to business, not wanting to wait and see where this was going. “I’m sick Ray, its cancer. I need you to cure me.” I stated firmly. Ray took another sip of wine, visibly working something out in his head. “Well, shit,” he huffed and stubbed out his cigarette, “can’t have you dying on me, no that simply won’t do. So many more deals we have left to make. So many…possibilities. I will fix it, don’t you worry.” </p>\n\n<p>I let out a breath I didn’t know I was holding as relief washed over me. “You’ll fix it, just like that? For free?” I asked. Ray’s eyes went impossible wider, then he let out a hearty laugh. The longer the laughing continued, the more the dread in the pit of my stomach grew. Once his cackling died down to light giggles, he wiped his eyes on his sleeve, and gave me a look that cut right through me. “Nothing is free. Ever. Always remember that, Angela. No, this favor will cost you dearly.” He affirmed, and my stomach dropped to the floor. He drained his drink, and reached across the table for the bottle, carefully pouring himself another glass, topping mine off as well. “It’s time you learned what real sacrifice is, Angela. In exchange for your life, I will require that of your daughter’s. Now calm down! I don’t mean to kill her, no, I’ll simply keep her. I promise, not a hair on her little head will be harmed. I can even erase all memory of her, once the deal is done, to make it easier on you.” He lounged back, waiting, a sick delight shining in his eyes. </p>\n\n<p>I swallowed hard, my mouth gone dry, and heart beating erratically in my chest. “You’re fucking evil.” I whispered harshly. He shrugged, and took another sip from his glass. “I know. So do we have a deal?” My head was spinning, and I felt as though I might pass out. This is too much. How could he expect me to just hand over my baby girl? Then the anger came. Pure, white hot anger. How dare he! “I don’t give a fuck what you are, or what you’re capable of. You will never touch my daughter. No deal.” I seethed through gritted teeth, glaring daggers across the table at Ray. He had the nerve to give me a sympathetic look, and sighed. “I was afraid you’d say that. I already told you I can’t let you die. Do you remember when you asked my name, and I told you to know a being’s true name is to have power over them? I know your name, Angela Marie Carson. I have in my possession a lock of your hair, and your finger. See, in the magical world, we have this thing called The Rule of Three. A thing done three times is unbreakably strong. Your name, your hair, your finger. Threefold, you are bound to me. In other words, you <em>will</em> make the deal. You don’t have a choice.” </p>\n\n<p>I gaped at him, mouth unable to form words. Oh god, what had I done? I picked up my glass, and threw it at Ray’s head. Then, I did the only thing I could think of. I screamed. I screamed and cried, and paced the balcony, and only vaguely wondered why Callie and the neighbors were undisturbed. Surely he had something to do with it. Ray stood and made his way over to stand in front of me, arms opened as if to embrace me. I flew into him, fists pounding into his chest as I screamed. He made no move to stop me, and soon I found myself falling to the ground in a boneless, sobbing heap. “No deal.” I managed to croak out. Ray crouched before me, and lifted my chin with a clawed finger to look at him. “I will give you a week, Angela. A week, to come to terms with this. Then I will come back, you will make the deal, and the child will be mine. I’ll see you soon.” With that, he stood, and vanished into a cloud of green sparkles.</p>\n\n<p>That was six days ago. I’ve been very busy, searching for something, anything to get out of this contract. After hours of Googling demons and magical contracts, I decided I needed to enlist the help of a professional. I was able to compile a list of occult shops around town. Most were a joke, simple tourist traps hocking crystals and shitty fortune tellers. Finally, I came across a shop downtown that is apparently home base for our local Wiccan coven. Amethyst, the owner of the shop listened in abject horror as I told her my tale. Instead of reaching for the phone to call someone to haul me away to the nearest psych ward, she hurried behind the counter and began scribbling a name and address down on a piece of paper. “If anyone can help you, she can,” was all she told me, as she pushed the folded scrap of paper into my hand, mouth set in a grim line. </p>\n\n<p>Having no time to waste, as the day was fading fast, I made my way back to my car and punched the address into GPS and began driving. The directions took me about an hour out of the city, past the small town on the outskirts, and into the densely forested land beyond. My car bumped down the poorly maintained dirt road, causing my headlights to jump and dance across the trees on either side of the road. Just as I began to wonder if the Wiccan had sent me on a wild goose chase, a small run down cabin came into view. I pulled in and parked in front of the rickety looking front porch. Steeling myself, I exited my car and made my way to the front door. Across the threshold, a line of red dust was scattered. The door was heavy wood, with ornate symbols carved into its face, and it was lacquered a deep purple. I took a deep breath, and rapped my knuckles on that curious looking door. Inside, I could hear the slow shuffling of feet, and then silence as the movement ceased momentarily, before the door creaked open slightly. </p>\n\n<p>A small elderly woman with long grey hair pulled back in a neat braid covered with a silk scarf answered the door. The hand the held open the door was decorated with many gold rings, and the other held a polished wood cane. “I’m looking for Vadoma Loveridge. I was told I could find her here. Please, I need help.” The old woman turned and hobbled across the entryway to an old oak table laden with bottles of various sizes, bowls, and other trinkets. She picked up an amber bottle and made her way back over to the open door. She leaned the cane against the doorway, and with a worn shaky hand, unstopped the bottle and sprinkled its contents onto the fingers of the opposite hand. She motioned for me to bend down, and once I obliged, she drew a symbol on my forehead with the liquid. It smelled of lavender, with a hint of something old and earthy underneath. “I’ve been expecting you, dear.” She said, her voice soft and thickly accented. She picked up her cane and turned to venture deeper into the house, beckoning me to follow with a wave of the hand. I paused for a moment, then hesitantly followed her inside. </p>\n\n<p>Once inside the living room, I sat down on the small loveseat adjacent the fireplace. A puff of dust came out of the cushions as I settled in. Vadoma left once again without saying a word, and I could hear water running and the clanging of china coming from the kitchen. Some time later, she returned with a kettle and two mugs on a tarnished serving tray. She set the tray down on the coffee table in front of me, and settled herself down in the armchair directly my opposite. “Pour the tea, will you, dear. Two sugars for me,” she instructed, again her thick accent giving me pause and making me wonder where she was from originally. I bent forward and began pouring the tea, adding two sugars to her mug, one to mine with a splash of cream, and offered the mug across the table to her. She accepted it with two shaky hands, took a sip, then stated, “Romania,” with a knowing smile. I didn’t ask how she knew what I was thinking, there was something unnerving about the woman, something omnipotent, that the idea of her being able to read my mind was not surprising in the least. </p>\n\n<p>“I know you do not have a lot of time, dear, so let us get right to it. You are having a problem with a demon, yes? The Spirits told me a young woman in grave danger would seek me out soon, a foolish woman who made deals with ungodly beings. That is you, yes?” she asserted. Dumbfounded, I could only nod my head in answer. “Tell me about this demon, from the beginning.” She cradled her steaming mug in her weathered hands, and sat back, looking at me intently, waiting. As I told my story, her face remained emotionless, though at times I could see disgust or horror or some other objectionable emotion flash through her dark eyes. When I got to the bit about my finger, I felt her gaze burning upon the place where my pinky used to be, but still she said nothing. When I had finished, I sat staring into my mug, ashamed to face this woman, to see the well-deserved judgment reflecting in her eyes. When I finally gathered the courage to face her, I saw that her face was still carefully void of emotion, and her eyes held no judgement, but rather, pity. The eyes can’t lie. </p>\n\n<p>“Drink your tea before it gets cold,” she chided, as she pushed herself up gingerly from the chair with the help of her cane. She exited the small living room, and disappeared down the hall with a soft swish of skirts. <em>What the hell is going on?</em> I thought as I sat alone on the ancient sofa, the only sounds keeping me company were the crackling of the fire in the hearth and the faint clink of glass from down the hall. I stood and took in my surroundings; there were aging black and white photographs of some faraway land hung sparingly on the walls. An antique grandfather clock stood in the far corner of the room, in desperate need of a dusting and probably a servicing, as the pendulum hung unmoving. As I was inspecting the trinkets in the curio cabinet beside the fireplace, Vadoma’s voice came from the entryway of the living room. “Please, do not touch those. Come, sit back down.” How had I not heard her shambling back down the hallway? She lowered herself back down into the armchair with a grimace, and motioned at the loveseat for me to do the same. </p>\n\n<p>“You will give your daughter this when you get home. She must wear it always, never taking it off for a second, to protect her from the demon. As long as she wears this, she will be safe.” She placed a silver pendant attached to a chain on the table. It was a small circle with intricate symbols carved into it, a snake twined around the edge, encircling the symbols. Next, she placed an amber bottle onto the table. “This is a binding powder, placed around the home, it will keep evil from entering,” Vadoma said, and I thought of the red powder across the threshold of her cabin, “but if one draws a circle with it, it will keep a demon trapped within. Be careful not to disturb the circle once its laid, and seal it with three drops of blood, nothing more, nothing less.” I picked up the necklace and bottle, and placed them into my purse with care. </p>\n\n<p>“Do you own a firearm?” Vadoma asked. I nodded and replied, “Yes, my husband has a pistol.” She made a noise of approval and continued, “Very good. Then you will need these.” She reached a hand into the pocket of her apron, and set two bullets down on the table. The first was silver in color, and once again, was etched with intricate symbols. The second looked rather ordinary. Vadoma pointed at the first bullet and said, “This is an iron bullet, with a small amount of silver mixed in. The silver is not important in this case, but iron is toxic to demons. Once you have it trapped inside the binding powder circle, shoot it directly in the heart.” I nodded to show that I understood, but a feeling of dread was creeping up inside me. “What about the second one?” I asked cautiously. </p>\n\n<p>“What do you know of the Rule of Three, dear?” Vadoma queried. The blank stare on my face must have been answer enough, as she continued on, “I must confess, my dear, that I am uncertain if you can break the contract this demon has you under. Threefold, the demon owns a piece of you. A blood exchange is the only thing left, I’m afraid. The beast seeks to turn you, to make you one of his own. Unfortunately, I have never encountered a person that was already bound by the Rule of Three. If you should fail, then this is your last resort. This bullet is for you.” </p>\n\n<p>I numbly drove home that night, replaying Vadoma’s words over and over in my head. <em>Seeks to turn you, to make you one of his own…This bullet is for you.</em> Absentmindedly, I stroked the bullets in my purse on the seat next to me. It was late by the time I made it home. Callie was already in bed, and Jonathan sat on the couch with a book and a cup of tea, waiting for me. “I’m so sorry babe, this case is just killer and I lost track of time at the office,” I sighed, the lie rolling off my tongue and past my lips with practiced ease. Perhaps, if I do fail, it won’t be such a bad thing. I fear I may not be worth saving anymore, I thought as I set my purse down on the kitchen island, careful of the contents inside. I made my way over to the couch, leaned down and planted a kiss firmly on Jonathan’s lips. “I’m gonna go tell Callie goodnight, shower, then go to bed. I’m exhausted, babe. I’ll see you in a minute.” </p>\n\n<p>I made my way to Callie’s room, and shook her awake. “Mommy?” she mumbled, rubbing the sleep from her eyes, blinked several times, then focused her gaze on me. “I’m so sorry to wake you baby girl, but I have a surprise for you. But, you have to promise me, cross your heart promise, that you will never ever take it off ok? Can you promise me that?” I whispered urgently. Callie nodded wearily in response, and I slipped the silver chain over her head. “It’s pretty. Thank you, Mommy,” she yawned, then lay back down and drifted off to sleep. </p>\n\n<p>Tomorrow is the seventh day. I let my assistant know I won’t be into the office tomorrow, and I talked Jonathan into staying home as well. I will call Callie in sick from school. I have a family fun day planned for the three of us, after all, if things go wrong, this will be our last day together, and if they go right, I don’t have much more time anyway and I want Callie to remember our time fondly. I’m going to let her eat ice cream for breakfast, and not deny her a single thing tomorrow. Whatever Callie wants, Callie gets. We will rent a movie and snuggle up on the couch with a giant bowl of buttery popcorn. When Callie goes to bed, Jonathan and I will make love with a passion that I haven’t felt since that first deal with Ray, perhaps because of the guilt I feel over taking away his choice to leave. </p>\n\n<p>Then, when he falls asleep, I will remove the pistol from the safe in the closet, load it first with the demon bullet, then the one meant for me, and drive to the wooded area just north of town. There, I will set my binding circle, and from within it, I will call upon Ray. Either way this goes, I can’t wait to see the look in those too large eyes when he stares down the barrel of my gun as I say, “No fucking deal.”</p>\n</div>\n","author":"420_Princess"}