{"rank":"7","title":"The Riders in The Sky","id":"8j7alp","url":"/r/nosleep/comments/8j7alp/the_riders_in_the_sky/","time":"1526248326000","body":"<div class=\"md\"><p>Its an old legend, one that most people don&#39;t know. Hell, I don&#39;t know the legend. The most I&#39;ve heard of it is in song, or in some video game I&#39;ve played. Regardless, its true. I saw them.</p>\n\n<p>See, I live in a small town out in the west, and its usually quiet. People keep to themselves, and we go about our days just fine. I&#39;m usually at home playing video games, if I&#39;m not at work. I&#39;m a Custodian at the local high school, so the worst thing I&#39;ve seen was a used condom on school grounds that I had to pick up when I was on grounds duty.</p>\n\n<p>A week ago, though, I heard something. I was at work, and usually I get off at 10:30pm. Because I was working overtime, I wouldn&#39;t be able to clock out until 12:30am. The school itself is about a half hour away from home though, so I wouldn&#39;t get home until 1:00am. About half way home, around 12:45am, I heard it.</p>\n\n<p>A mournful wail echoed across the sky. Normally, if I&#39;d heard something that scared me, I&#39;d either start running, or I&#39;d suck it up and keep walking. This? This was different. I didn&#39;t just hear it.</p>\n\n<p>I felt it, like it was echoing through my skeletal frame, reaching through to my soul, stopping shy at my heart. I don&#39;t know why I did it, but instead of pucking up my pace or hiding, I stopped dead in my tracks. I was yelling at myself to run, to get home as fast as I could, but I couldn&#39;t move! It was like some invisible thing had me by the ankles, and it wouldn&#39;t let go! I couldn&#39;t even turn my head!</p>\n\n<p>And so I saw them. Pale white horses with red manes burning like fire, and black steel hooves. Mounting them were the true horrors. </p>\n\n<p>At first glance they look like men; like cowboys. They wear brown and black hats, and those denim jackets over long sleeved western-style shirts and usually blue jeans. And, of course, the brown or black boots that correspond with the color of their hats. Here&#39;s where things really differ. They don&#39;t have guns. You&#39;d think that guns would make them more terrifying, but I don&#39;t think that. Rather than toting revolvers, they have chains wrapped around their fists. They aren&#39;t silver, like you might think. In fact, bow that I think about it, nothing they had on them looked to be silver at all. The chains were black, and the way they looped around the riders fists it looked like they could go on forever. It looked like they were using those same chains like brittles. </p>\n\n<p>They were riding in the sky, literally. The hooves were nowhere near the ground, and yet, I could hear it every time a hoove kicked, like the horses were stampeding in a valley.</p>\n\n<p>It wasn&#39;t until I saw the face of their leader that I was truly terrified. I&#39;ve lost so much sleep over it, I don&#39;t know what to do. I haven&#39;t been to work in a week for fear that I might see them again. When he looked at me, he looked me dead in the eyes as they rode passed me, and there are two things that got to me. The first was that he didn&#39;t have eyes. Just big black holea where his eyes should have been. Despite that, he was looking at me. Or maybe through me. I don&#39;t really know.</p>\n\n<p>The second thing I&#39;m absolutely certain of. The man in the front of the cavalier, the one that looked at me or through me or whatever, the one I have assumed to be the leader? Yeah. He looked just like my older brother.</p>\n</div>\n","author":"WikkedGrin"}