{"rank":"126","title":"Why I Can’t Sleep Unless the Doors are Closed","id":"8j7s8r","url":"/r/nosleep/comments/8j7s8r/why_i_cant_sleep_unless_the_doors_are_closed/","time":"1526253061000","body":"<div class=\"md\"><p>This happened during my freshman year of high school in 2006, but I still remember everything that had happened as if it was yesterday. </p>\n\n<p>My best friend, at the time, had come over to spend the night for one of our many sleepovers. As we settled down for the night, she asked if she could sleep on an air mattress as we both tended to spread out, and my bed at the time wasn’t very big. After getting things ready, we both laid down to sleep around midnight.</p>\n\n<p>I’m not entirely sure what it was that made me wake up a few hours later—maybe it was a dream or maybe it was just a feeling that forced me to wake up. After I got rid of the initial sleepy haze, I took the time to check on my friend to see if she was still sleeping or not. However, something else caught my eye.</p>\n\n<p>I had glanced at my closet doors, which had been open a bit, and I literally froze with fear. There was a face in my closet, staring right at me. I couldn’t see a body, but the face appeared demonic and full of evil. It’s face was a dark red, it’s eyes were pitch black, but it was its smile that sent chills down my spine. It was one that held some sort of malicious secret waiting to be revealed. After a good, few seconds, it disappeared. It was at this point that I was trying to figure out what had happened. Could I have still been in a dream state? Was it simply a trick of the mind? Or had there actually been something there? I wasn’t sure, but I eventually calmed down as I convinced myself it had been some part of a dream.</p>\n\n<p>As I was in the middle of laying back down, my best friend asked, “Can I get in the bed with you?” I didn’t really think anything of it, but immediately said she could. After we both settled in my bed, she turned to me, and my heart skipped a beat with what she said. “Thank you for letting me get up here with you. I didn’t want to be near the closet with that thing in there.”</p>\n\n<p>I asked her what she was talking about because I wanted her answer to be a bad dream. However, she replied with, “There was that evil face in the closet. It was looking right at me with those eyes and a sinister smile.”  I had never felt so scared at that point because she had seen the same thing I did, and when I told her as such, we both rushed to close the closet doors as quickly as we could, and turned out my bedside lamp as a “just-in-case” precaution.</p>\n\n<p>Now, to this day, I cannot sleep unless all the doors in the room I’m in are closed. If a door is open, I’m extremely tense and skittish of everything that happens, and I feel extremely unsafe.</p>\n</div>\n","author":"Rel7625"}