{"rank":"55","title":"Stay away from Yeadon Tarn at night.","id":"8j7t4e","url":"/r/nosleep/comments/8j7t4e/stay_away_from_yeadon_tarn_at_night/","time":"1526253319000","body":"<div class=\"md\"><p>Let me start from the beginning. I’ve lived in Otley and Yeadon all of my adult life. The two small Yorkshire towns are separated, divided in two by a great snaking wooded ridge known as the Chevin. The old woodland is popular through the day with dog walkers and climbers who travel to visit from far and wide. They are safe and probably won’t witness anything sinister. As long as they leave before the sun sets. </p>\n\n<p>See, for locals like myself it’s a well known fact that The Chevin and the surrounding countryside are haunted. In fact, haunted is perhaps the wrong word... Infested seems more apt. Ghost sightings are an almost daily occurrence, and it’s usually guaranteed that if you visit a local pub at night you’ll hear someone recounting a tale of a spectre they’ve seen standing at the edge of the forest, beckoning them in, as they drive home. I, myself have witnessed many spirits in my 23 years on this earth but they are tales for another time.</p>\n\n<p>These ghouls while at times disturbing and aggressive are not dangerous. From what I and others have witnessed, they cannot interact with us physically and thus are incapable of causing us harm. No, the ghosts are definitely not the problem in our are, there are other far more insidious beings living in the shadows that I have come to learn should be feared. An encounter with one of these creatures is the reason I’ve finally decided to write my experiences down.</p>\n\n<p>Some theorise the Chevin is a natural occurrence, a place where the barriers that surround the living from the lands of the dead are thinner than they are elsewhere, hence the ghosts and the other creatures that come to feed here. Others believe that witch burnings in the Middle Ages led to a curse been cast on the two towns. I’m not sure which theory is true, all I know is that there are things that are out there that pose a tangible threat the local people and it needs recording. </p>\n\n<p>Anyway enough background information, it’s time I told the tale that needs telling. A couple of months ago I was up visiting friends in Yeadon. Slightly smaller than Otley, the sleepy leafy town sits on top of the Chevin and thus despite is attractive appearance seems to be a hotspot for supernatural activity.</p>\n\n<p>The night in question was in mid February we’d had a sudden snowstorm and so I decided to set off home before the roads became too dangerous to travel on. Travelling down the country road that connected Yeadon to Otley via the Chevin, aptly named Cemetery Road, I was straining to see through the thick snow in front of me. Suddenly I spotted a figure at the side of the road waving what seemed to be arms (you never can be sure where I’m from) in the direction of my car. Something primal told me to carry on driving but I refused to listen to my instincts and slowed down to a stop. I rolled down the window to see a bald man, mid thirties, wearing an orange jacket, khaki cargo trousers and hiking boots. “Thank god you stopped fella, I’ve been walking this road preying someone would stop for the past hour. I’d given up hope. My car’s stuck a bit further up. Batteries drained is there anyway you could me a jump?” He said in a southern accent signalling, like his outfit that he was an outsider and probably not aware of the local history. “No worries, mate jump in I’ll get you sorted” I replied throwing in a reassuring smile for good measure.</p>\n\n<p>After he climbed in and introduced himself as Ian, we chatted as I drove down the road in the direction he said he’d left his car. His wife Maria and their young daughter Lili were waiting for him inside while he went to get help. Despite never meeting them personally, at least alive anyway, it brings me great pain to recall their names. After ten minutes of driving down the whitewashed road he signalled me to slow down. I shuddered involuntarily, for immediately to our left was Yeadon Tarn. The tarn was a large body of water approximately a mile across and similar to the Chevin while popular in the day it was an unspoken rule to never venture there at night. Over the years, many teenagers had disappeared at the site fuelling rumours that something evil lived there. Even the ghost sightings ceased which was confusing given the amount of people that had surely died there. It was this history that caused me to give a warning to Ian before we approached.</p>\n\n<p>“ listen man I’m not a hundred percent sure what you’ve heard about this area but this is not a place we want to be at night.” I told him</p>\n\n<p>He shot me a confused look “ Look mate there’s my car just there” he pointed at a green jeep stained white with snow in the car park to our right. “ ten minutes tops and you can be on your way home, I really appreciate you helping me out here”.</p>\n\n<p>With that I felt a sharp prong of guilt and shame at the pit of my stomach for my cowardice. We pulled over to the jeep and I could immediately tell something was wrong when Ian returned to the car, his face was none white and his eyes wide with alarm. “They’re not there” he exclaimed stunned “I told Maria to wait for me there…. She wouldn’t have left, not with Lili it’s far too dangerous for her to be out in this weather”\nI climbed out of my Audi to join Ian and we followed him other to the Jeep. Inspecting the car I found something red and glistening on the front left passenger door handle… it appeared to be blood! \nIan was looking around at the snow littered ground panicked and did not notice my gruesome discovery. “Look! there’s two sets of footprints going this way they can’t have gone far, we’ll find them in no time” he unlocked the truck reached around for a few moments and then produced a torch. Clicking it on he set off following the tracks through the car park and towards the water. Against my better judgment I followed.</p>\n\n<p>After a couple of moments I broke the silence. “ I know you’re not from around here but there’s something you need to understand about this place. Bad things happen here. Things I can’t really explain to someone whose not experienced them. The best thing for us to do right now….the safest thing for us to do right now….. would be to go back into town and grab a few guys to come help us look. There won’t be many happy to travel down here but there’ll be enough that it’s safer for us” I could already see I’d lost his attention. </p>\n\n<p>His eyes were fixed on two figures, twenty paces in front of us. A woman and a young girl. “ Maria! Lilli!” He exclaimed as he darted forward to meet them. My mind seemed to assess  up the situation at a superhuman speed. I could tell something was wrong. The posture of the two females,their odd jerky movement, the fact that neither of them had made a noise in reply to Ian, there wasn’t just something wrong; everything was wrong. That’s when I saw them. Two pale men in jet black suits, they were stick thin and their tight withered skin was ashy white. Their black hungry eyes where focused on us and their teeth were clenched in a terrifying grimace. The thing that sticks with me the most though were the hands, their hands were moving backwards and forwards up and down as if they were puppeting Maria and Lilli. \n“Ian wait” I screamed as my companion reached his family but it was two late. The pretence dropped and the two females dropped to the ground inches away from Ian. The creatures were on him within seconds clearing distance at an ungodly speed. There was nothing I could do other than to save myself. I took off running with Ian’s screams ringing in my ears.</p>\n\n<p>It took me no longer than two minutes to get back to my car but it felt like a lifetime. I sped all the way home paying no attention to the inhospitable weather conditions. I rushed inside locked the door behind me and sat down in shock in the middle of my living room. All the lights were left on. </p>\n\n<p>I never went to the police, I didn’t want to bring attention to myself and have those creatures find a way to get me. Besides, as far as I’m aware no bodies were ever found just the empty jeep. Just another couple of disappearances in towns that have had to cope with hundreds over the years. I’m hoping if you were otherwise thinking of visiting Yeadon, this story keeps you away but if that’s nots the case for gods sake…….</p>\n\n<p>Stay away from Yeadon tarn at night!!</p>\n</div>\n","author":"Tobias404"}