{"rank":"105","title":"Hunted in the mountains","id":"8j7usb","url":"/r/nosleep/comments/8j7usb/hunted_in_the_mountains/","time":"1526253779000","body":"<div class=\"md\"><p>Cloudcroft, New Mexico; a small, scenic, touristy town hidden in the in the mountains of south-central New Mexico. Years ago the region experienced a series of horrific and devastating forest fires. The effects of which can still be seen today. </p>\n\n<p>My father and I went up into those mountains a few days ago. It’s been another dry year but no fires thus far. The reason for our trip up there was three fold. My dad wanted to scout the land for an elk hunt he’d have in a few months, I wanted to get the altitude training, and we wanted to spend some time together before I leave for boot camp. </p>\n\n<p>If you’ve never been to Cloudcroft, it’s beautiful. I love the mountains, I love the brisk air. Despite being almost 9000 feet in elevation I wouldn’t mind living there. The region typically experiences cold winters with a lot of brutally heavy snow storms. The weight of the snow combined with the wind can often leave shrubs, saplings, and even older trees bent, arched, and twisted. </p>\n\n<p>My dad and I arrived at a secluded area way outside of town and set up camp. Afterwards we set out to scout a bit while we still had daylight. We ended up spotting a small herd of elk at one point. The area looked promising for my dad’s hunt. The rest of the evening proved to be rather uneventful. My dad practiced with his compound bow a little bit, I browsed a car catalog, and we are a dinner of deer steak and potatoes. </p>\n\n<p>The next morning we got up about an hour before sunrise. We spent a bit drinking coffee and eating a small breakfast before we set out. We took a long, arching path that would eventually circle back around to our camp. The sun began to rise and the temperature plummeted. Around that time, my dad and I broke through the forest into what first appeared to be a clearing. Only it wasn’t a clearing, it was a vast swath of the forest that was burned years ago, the charred remains of trees still planted firmly in the ground. The forest was finally beginning to reclaim the area, grass, shrubs, and even small saplings were beginning to grow. </p>\n\n<p>Out of nowhere a thick fog rolled over, blanketing the area in a thick, suffocating mist, dropping visibility to about 10 yards. Suddenly the area became otherworldly in appearance.The charred tree trunks and saplings twisted by the weight of past snows created strange, alien shapes in the mist. </p>\n\n<p>My dad and I were prepared for such situations. I had my compass and he had a gps, all would be well. My dad broke out the gps, he had barely turned it on when the batteries died. He had left the backlight on and it used too much juice. No worry, I had my compass and knew the general direction of our camp. We began walking back towards camp when we heard something behind us. It sounded like something running through the grass, something with more than two legs; the footfalls swift yet heavy. </p>\n\n<p>We turned to face the direction of the footfalls. My dad was packing a .45 Kimber 1911. Being less than 21 I couldn’t pack a pistol and a rifle would’ve been to heavy so I contented myself with an assortment of knives. My dad unbuttoned the holster of his pistol. It could’ve been a cow elk or a deer but you could never be too careful. We turned back in the direction of the camp and began walking again. The fog seemed to thicken over time. Visibility was down to 5 yards at the most. This made our going slow. We were on the side of a mountain in unfamiliar territory. The shadows of the burnt trunks and twisted saplings played tricks on my mind. I was becoming uneasy. </p>\n\n<p>Suddenly another noise came from behind us. Only it wasn’t footsteps again. It was a whistle; it rose in pitch and gave way to a low warble. It reminded me of that dinosaur from Jurassic Park that sprayed that fat dude in the face. This time when we turned in the direction of the noise my dad knelt and unholstered his 1911, aiming in the direction of the noise. It wasn’t an elk or a deer and if it was a bird it wasn’t anything we had ever heard before. Perhaps some kids were trying to mess with us. We sat there, tense and alert, for what seemed like an eternity. Finally my dad holstered his pistol and suggested we pick up the pace back to camp. </p>\n\n<p>The moment we stood up and turned back around something rushed us from our right side. Coming from uphill from us it covered distance blindingly fast. As it passed I felt like something smacked into my right thigh. And then it was gone. It wasn’t until I tried to take a step that I knew something was wrong. My right leg gave out from underneath me and I face planted into the ground. My dad rushed to my side and turned me over. We looked down to my leg to find that it was bleeding. A cut, made with almost surgical precision, ran six inches down my thigh and almost two inches deep. That was when the pain hit. It felt like someone had taken a superheated spike to my leg. I’m not gonna lie, I wasn’t quiet about it. </p>\n\n<p>My dad took the first aid kit from his pack and was in the process of removing the bandages when that thing rushed us again. This time it came from us from downhill and naturally it wasn’t as swift. As it passed I caught a glimpse of unnaturally long legs, a bent and arched frame, and pale leathery skin. My dad removed his pistol and squeezed off two shots at it as it ran past but his shots were rushed and they went wild. He set his pistol down and went back to putting pressure on my leg and wrapping it. </p>\n\n<p>Slap-dash bandage job done, my dad wrapped my arm over his shoulders and helped me up. We began going as fast as we could back to the camp but I was injured, the fog was thick, and we were disoriented; the going was slow. We heard the whistle again from downhill, our left. My dad took out his pistol again and aimed in its direction. </p>\n\n<p>It came from directly behind us. We didn’t hear it running at us until it was too late. I saw it sprint by in a blur. My dad grunted and dropped to the ground, without his support I involuntarily followed suit. He was clutching his abdomen below his left rib cage. His shirt and jacket were torn and blood flowed freely from between his fingers. The whistle came again, this time from in front of us. I turned to see it’s shadow coming at us from the mist. I reached for my dads gun but it was like I was moving through molasses. Before I could grab the gun and aim the creature had closed distance, grabbed my dad, and was gone. </p>\n\n<p>I collapsed on the ground. I could still hear my dads screams echoing in the mountains. My leg wound was bleeding through the bandage. I needed to get moving or I’d either bleed out or worse. But first I needed to be ready to defend myself. I grabbed a ka-bar knife from my belt, it was a birthday gift from my dad from when I turned 18. It’s blade was recently sharpened and oiled, its handle sturdy and true. It wasn’t a .45 1911 but it was better than nothing. Unsteadily, I stood up and hobbled in the direction of camp. </p>\n\n<p>I was a sitting duck. Alone, lost, disoriented, injured, armed only with a knife, and with severely limited visibility, I was easy prey and I knew it. If I got out of the fog maybe I would have a better chance, if only slightly. I heard something coming at me from behind. I couldn’t jump to any one side due to my leg so I fell to my left. That’s what saved me. As I fell the thing flew by right where I was just standing. So instead of being taken by whatever it was, I rolled uncontrollably downhill almost 100 yards. I rolled over thorny shrubs, logs, and rocks. I rolled into and bounced off of tree stumps. My pack was ripped off my shoulders somewhere down the way. My plummet was only stopped when I crashed into a blackened, charred tree trunk with a sickening crunch. </p>\n\n<p>I forced myself to sit up and assess the damage. I was cut up, beat up, and bruised. My clothes were in shreds, cuts and scrapes showing through the holes and tears. Sitting up was excruciatingly painful, I could feel that multiple ribs had been fractured or broken. The cut the creature had made on my leg was bleeding profusely. There was a cut above my right eye that was bleeding down my face, forcing me to keep that eye closed. I was toast.  </p>\n\n<p>I sat there, propped up against the blackened tree trunk. I had lost my ka-bar somewhere uphill but I had more knives. I grabbed a Buck hunting knife. The blade was five and a half inches long, thick, and heavy. If I was going to be torn apart by this creature I might as well make the thing hurt too. The fog was still as thick as ever, dense and suffocating. My nerves were obviously shot. Every noise made me jump out of my skin; a vulture somewhere above and behind me, a coyote yipping in the distance, a mouse scurrying over dead leaves. Despite my blood loss and my pain, or perhaps because of it, I was on high alert. And so I waited for an agonizing eternity.</p>\n\n<p>The whistle came again, loud, low, and long. The creature knew it had won. It was coming for me. Only a few minutes later, directly ahead of me, a shadow came at me from the mist, long, slender, and arched. Out of the fog, the creature formed into full view. The skin was thick and leathery yet so pale, it seemed to be stretched and drawn so tightly over its frame that every bone could be counted. It’s tail was short and stiff. It’s rear legs were about half as long as it’s front legs, the knees bent backwards. It’s front legs were so very long and thin. They ended in three long fingers. It walked on its knuckles like a gorilla. Halfway up each of it’s forearms came a long, wicked looking dew claw, they both dripped with fresh blood. On its round head were two, small, beady eyes that radiated an oily, malevolent stare. Two large, drum-like membranes sat behind its eyes, like what you would see on a frog. It’s mouth was merely a gaping hole filled with small and needle-like teeth surrounded by stretched, cracked lips.</p>\n\n<p>It walked within a breaths distance of me, staring me in the eyes. I could smell rot and decay in its breath. Resisting the urge to gag, I stared back into its eyes. Slowly, it raised one of its front legs, extending its stiletto-like dew claw. Before it could strike, I lunged forward and planted my knife deep into its abdomen where it’s stomach should’ve been. With a piercing, reverberating whistle that was more like a scream, it clutched at the knife and reeled backwards. It tore the knife out with a savage jerk and tossed it aside. Then slowly, deliberately, it turned to face me once more. It pounced on me like a tiger pounces on an unsuspecting prey. I curled into the fetal position as it tore my back, arms, and legs. I knew I was going to die. </p>\n\n<p>Suddenly a shot rang out, and another, and another. I felt the creature flinch after each shot. Two more shots and I felt it’s warm blood spilling on me. With a shriek born of hatred and agony, it ran. I felt a hand on my shoulder. I looked up to see my dad. He was in bad shape, torn and bleeding from everywhere it seemed. The creature had grabbed him by his pack and he was able to cut the straps off to get away. We sat there propped against that same blackened trunk for some time. I became cold, so very cold. Blood loss no doubt. </p>\n\n<p>Eventually the fog burned off and yet we weren’t able to get up to move. After almost three hours of weaving in and out of consciousness, someone found us. A lone hiker had seen my pack from a distance and had subsequently found us. Park rangers were alerted and came to our location and we were airlifted out and taken to a hospital in Albuquerque. </p>\n\n<p>That was only three days ago. The memories are still fresh and the nightmares are constant. Mountain ranges anywhere in the world are home to beautiful and awe-inspiring views and animals. But they also hold secrets, hiding places for creatures who would rather go undiscovered and undisturbed, creatures that sleep in darkness, accompanied only by the bones of past hunts.</p>\n</div>\n","author":"ColdCoffee1775"}