{"rank":"4","title":"A Strange Animal That Waddled Through The House","id":"8j7w3k","url":"/r/nosleep/comments/8j7w3k/a_strange_animal_that_waddled_through_the_house/","time":"1526254137000","body":"<div class=\"md\"><p>I heard about a woman who was very sick. She heard voices and saw things that weren&#39;t there. Apparently she had a kid too. I don&#39;t know what kind of mother she was but I&#39;m sure she loved her child. She was such a lonely woman too, more lonely than I could describe. </p>\n\n<p>After having her son, her sickness worsened rapidly. She&#39;d sit in a dark room trying to watch the television when shadows would creep away in the corner of her eye. No matter how quickly she turned to see them, she was never fast enough.</p>\n\n<p>A small animal would walk throughout the house too. Sometimes the woman would only hear its footsteps, and other times she&#39;d see it waddling away down the hall. </p>\n\n<p>&quot;Hey,&quot; she&#39;d call out to it, &quot;Hey&quot;.</p>\n\n<p>It wouldn&#39;t turn. It didn&#39;t understand. </p>\n\n<p>The woman was fascinated by this animal. In her sickness, she forgot to ask herself if it was truly there. Part of her didn&#39;t give a damn. </p>\n\n<p>&quot;Hello?&quot; She&#39;d ask it, &quot;Hello?&quot;</p>\n\n<p>It didn&#39;t know how to respond. </p>\n\n<p>An ugly irritation swept through the woman. She just wanted it to acknowledge her. No one ever acknowledged her. She was so alone, and being ignored by the strange animal felt so... insulting.</p>\n\n<p>She didn&#39;t have to stand for this. She wouldn&#39;t.</p>\n\n<p>&quot;HEY!&quot; She scolded, &quot;LOOK AT ME!&quot;</p>\n\n<p>It jolted as the woman&#39;s voice boomed through the room, but it would not turn. </p>\n\n<p>&quot;I SAID LOOK AT ME!&quot; She growled. </p>\n\n<p>It ignored her. </p>\n\n<p>How cruel. All she asked for was recognition. She just wanted someone to know she was there. If even this stupid animal didn&#39;t care enough to give her the slightest glimpse, it wouldn&#39;t be allowed to glimpse at anything.  </p>\n\n<p>The woman charged to the animal and picked it up. It&#39;s fur was warm. It struggled in her grip. She took it to the bedroom and held it on her bed, next to a cabinet where she kept sewing supplies. There she found a needle, a long one just right for stitching. Or puncturing. </p>\n\n<p>This was when the woman finally got a good look at the animal. There was confusion in its eyes. Tears even. The woman barely cared as she positioned the needle right where it gazed. </p>\n\n<p>Slowly, oh so slowly, she sank the needle in its first eye. It howled and cringed yet couldn&#39;t escape. With her finger, the woman wiggled the needle to distort the eye further before pulling it out. The other eye was next, and so it was pierced and distorted all the same. </p>\n\n<p>But the woman was still angry. </p>\n\n<p>Gripping the needle with a fist, she stabbed into the animal&#39;s mouth. There was so much irritation in her. She clenched her teeth as she forced the needle through the animal&#39;s face. It shook incredibly. It screeched. It felt the needle gashing its tongue as its face was mauled. </p>\n\n<p>But this, it wasn&#39;t right. No. Something&#39;s wrong. </p>\n\n<p>Clarity found itself in the woman&#39;s mind as she finally questioned if this animal was actually on her bed. It was an animal. It must have been. What else could it be?</p>\n\n<p>She looked closely at its eyes. Blue eyes. Just like her. </p>\n\n<p>She stared at its hair. Dark brown. Like her hair. </p>\n\n<p>Something illuminated the room. Not a light, at least not literally. This was an illuminating force that only arose upon seeing through her terrible sickness. There could not have been a more horrific light. </p>\n\n<p>There was no bizarre animal on her bed. Covering her hands was her child&#39;s blood. Everything came back to her now. Her baby had just learned to walk; sometimes she could hear his footsteps as he waddled down the hall. He was such a sensitive child, who&#39;d jolt if his mother shouted at him. </p>\n\n<p>What had she done?</p>\n\n<p>Dropping her needle in shock, she screamed and held her child in her arms. &quot;I&#39;m so sorry sweetheart, I&#39;m so sorry, oh god.&quot;</p>\n\n<p>The woman ran to the kitchen and turned on the sink. There was so much blood creeping from her child&#39;s mouth and eyes, dripping down her dress and dotting the kitchen tiles. She must have grabbed all the towels she could reach as she tried to wipe her child&#39;s face clean. </p>\n\n<p>&quot;it won&#39;t work.&quot; It said.</p>\n\n<p>&quot;It won&#39;t work. You&#39;re a monster.&quot;</p>\n\n<p>The open wounds were relentless. They had to be closed. A needle, <em>the</em> needle was still on the floor in the other room, so the woman ran back and picked it up. Stitching threads were mixed with the sewing supplies in the nearby cabinet. Would they work? She had to try. </p>\n\n<p>As she tied a thread to the needle, she pierced it deep into her child&#39;s wound. In, and then out. In, and then out. Slowly the child&#39;s flesh pulled together. She was so close but <em>close</em> wasn&#39;t enough. Close would never be enough. </p>\n\n<p>The threads she used were too thin. With blood clearing the child&#39;s throat and gushing from his mouth, he began to cough. He coughed horribly. He couldn&#39;t control it. And so through the coughs, the child&#39;s stitches split apart, once again tearing its mouth. </p>\n\n<p>&quot;It&#39;s not working.&quot; It said.</p>\n\n<p>&quot;You&#39;re killing me, <em>you&#39;re killing me.&quot;</em></p>\n\n<p>&quot;God I&#39;m sorry! Please I&#39;m trying, please, I&#39;m so sorry sweetheart! Please!&quot; </p>\n\n<p><strong>&quot;You&#39;re killing me.&quot;</strong></p>\n\n<p>This was more than the woman could take. She didn&#39;t know what to do and fell to her knees. &quot;Oh god, oh god, please baby I&#39;m so sorry. I love you, oh my god.&quot; </p>\n\n<p><strong>&quot;You&#39;re killing me. You did this to me you&#39;re killing me&quot;</strong></p>\n\n<p>She could do nothing. Her shock paralyzed her on the ground. She was such a helpless woman who knew she was helpless. Perhaps she found the strength to rock back and forth; perhaps she could hold her child even closer. </p>\n\n<p>Nothing else. </p>\n\n<p>The woman was too horrified, too sick, too ashamed to pull herself up. So there she remained, rocking on the floor as she screamed for forgiveness from her child. </p>\n\n<p>&quot;I&#39;m sorry baby, I&#39;m sorry baby. Baby please... please, I&#39;m so sorry.&quot; </p>\n</div>\n","author":"Passages741"}