{"rank":"326","title":"Devil, take the wheel.","id":"8j7w0b","url":"/r/nosleep/comments/8j7w0b/devil_take_the_wheel/","time":"1526254109000","body":"<div class=\"md\"><p>I sank into my seat as my parents once again berated me for a &quot;bad&quot; mark. After so many years, I eventually learned to just tune them out. I sighed as multiple iterations of &#39;homeless&#39;, &#39;fast-food worker&#39; and &#39;piece of garbage&#39; went in one ear and out the other. I really don&#39;t see what&#39;s so bad about a B+, but my parents apparently do. I flinched as my father flung the page at me. It landed in my soup, soiling both my supper and the page. I didn&#39;t care. I wasn&#39;t hungry.</p>\n\n<p>I politely excused myself as I fished the paper out of the soup and went up to my room. To my delight, neither of them decided to follow me. A small blessing. I smiled.</p>\n\n<p>I took the opportunity to write in my journal. Unfortunately, nothing is really safe when your parents are like this. Instead of a regular book, my most private musings were written on the underside of my bedframe, in a special UV pen that my best friend gave me for my birthday. Even then, I had to be careful to convince my parents that the pens were just normal gel pens, or they would be confiscated too. I held a small flashlight in my mouth, writing about yet another horrible day and watching in satisfaction as the words disappeared behind the tip of my pen. When I was done, I flashed the UV light on the end of the pen, watching as hundreds of entries lit up, filling the better half of the wooden planks with the scribbles of my misery.</p>\n\n<p>Then, I crawled out from under the bed, and into my covers. I woke up later that night. When I got up, I saw a man, not my father, sitting on the edge of my bed. For some reason, I felt no fear.</p>\n\n<p>&quot;Who are you?&quot; I asked.</p>\n\n<p>&quot;Lucifer,&quot; he replied simply.</p>\n\n<p>&quot;Lucifer...&quot; I repeated. &quot;Well, hi. I&#39;m-&quot;</p>\n\n<p>&quot;I have no interest in who you are,&quot; he interjected. &quot;I&#39;m just here to knock some sense into you. Do you, or do you not, hate your parents?&quot;</p>\n\n<p>&quot;Well yeah...&quot;</p>\n\n<p>Before I could continue, Lucifer interrupted yet again. &quot;Then why do you do nothing about it?&quot;</p>\n\n<p>&quot;I&#39;m just waiting to leave when I&#39;m 18, you know? I&#39;ll be legally able to do whatever I want, so I&#39;ll just leave and cut all contact with them.&quot;</p>\n\n<p>Lucifier laughed. &quot;Do you really think they won&#39;t follow you? You&#39;re an only child, who else do they have to harrass?&quot;</p>\n\n<p>I had never thought about that before. &quot;Uh, I don&#39;t know, I&#39;ll get a restraining order or something.&quot; Suddenly, I felt very flustered.</p>\n\n<p>The man laughed again. His laugh was without a trace of a smile, almost mocking. &quot;I have a better idea. Both of them are sleeping right now. They&#39;re completely defenseless. You could just walk in there with any weapon at all and-&quot;</p>\n\n<p>&quot;Woah, woah, woah. What makes you think that I&#39;ll do that? If I get caught, it&#39;d land me a lifetime in prison!&quot;</p>\n\n<p>The man smiled for the first time. &quot;If. Don&#39;t worry, I&#39;m an expert.&quot;</p>\n\n<p>After some more convincing, I finally followed the man downstairs. He took me to the kitchen and leaned on the counter. &quot;Take your pick,&quot; he said, gesturing at the many unensils.</p>\n\n<p>I took a small knife from the knife block. &quot;Like that?&quot;</p>\n\n<p>Lucifer pinched the bridge of his nose. &quot;No no no. Here, I&#39;ll do it. You won&#39;t feel a thing, okay?&quot;</p>\n\n<p>Without thinking, I said, &quot;Sure, go for it.&quot;</p>\n\n<p>Lucifer smiled. He pressed his hand against my chest, and sank right in. At this point, I blacked out.</p>\n\n<p>When I woke up, I was in my bed. I rubbed my eyes. There was a note on my desk, with a bloody cleaver beside it.</p>\n\n<p><em>You can thank me later. Don&#39;t worry, I cleaned everything up. You can have the honor of washing the weapon though.</em></p>\n\n<p><em>Don&#39;t worry about paying me back. Two souls are enough for one night.</em></p>\n</div>\n","author":"Dxiled"}