{"rank":"40","title":"I Found VHS Tapes from Hell [Update]","id":"8j8cl3","url":"/r/nosleep/comments/8j8cl3/i_found_vhs_tapes_from_hell_update/","time":"1526258719000","body":"<div class=\"md\"><p>Part 1: <a href=\"https://www.reddit.com/r/nosleep/comments/8ijnju/i_found_vhs_tapes_from_hell/?utm_source=reddit-android\">https://www.reddit.com/r/nosleep/comments/8ijnju/i_found_vhs_tapes_from_hell/?utm_source=reddit-android</a></p>\n\n<p>“What&#39;s going to happen with those tapes?” I asked.</p>\n\n<p>The detective turned and through a devilish grin he said “These, I&#39;ve been looking for these, we&#39;re going to see just what depths humans can reach.”</p>\n\n<p>Fuck.</p>\n\n<p>I didn&#39;t wait around for anything else. I drove straight home watching my rearview the entire way. No sooner did I set foot in the front door, my phone rang.</p>\n\n<p>“Get out while you still have a life to leave with.”</p>\n\n<p>“Who the fuck is this?!” I demanded.</p>\n\n<p>Click.</p>\n\n<p>Shit. Was this a joke or something? i don&#39;t know if I should be afraid or not. That fucking detective clearly was a part of whatever happened at that place. I decided it best to leave town while I could. I packed up as much shit as I could fit into the car and split town. I didn&#39;t need that guy looking into my life. It&#39;s bad enough he knows, I know what happened.</p>\n\n<p>It was already late when I left and I only got about 4 hours distance behind me. Was that enough? Somehow, I didn&#39;t think so. I had to stop for the night though. I pulled off the expressway and into a small motel lot, got myself a room close to the office and tried to sleep. </p>\n\n<p>The memories of the tapes still fresh in my mind made it extremely difficult to get any rest. The thought of the dick knowing who I am made it impossible. For all I know he could already be on my trail, tracking credit cards or who knows, watching my every move via satellite. Still, I had to get some sleep or I’d be a waste to drive tomorrow. </p>\n\n<p>There&#39;s a knock on my door. How long have I been asleep? The clock shows 3:42 a.m.</p>\n\n<p>“Oh fuck, fuck! No one knows I&#39;m here. Fuck!”</p>\n\n<p>“Excuse me sir? Can you please come to the door sir?”</p>\n\n<p>I recognize the voice immediately. It&#39;s the detective. I&#39;m so fucked. I had to think fast. </p>\n\n<p>“Sir, I just need to ask you some questions.”</p>\n\n<p>“Uh yeah, I&#39;m just uh getting dressed, hang on one second.” Bullshit obviously.</p>\n\n<p>Ok, I had a plan. Got the keys ready to the car. I grabbed the shitty chair from the room, threw open the door and charged at the detective, chair first.</p>\n\n<p>Did he know what I was planning? He stepped aside and let me run passed him. Sure as Shit, the second I got parallel to him he threw a quick punch to the side of my head knocking me out.</p>\n\n<p>I woke up in a dark room, tied to a chair. I heard shuffling from behind me. </p>\n\n<p>“Oh shit, I&#39;m sorry man. Don&#39;t fucking hurt me, I ain&#39;t gonna say anything. God I promise!”</p>\n\n<p>“I&#39;m not going to kill you. That wouldn&#39;t be fun at all. On the contrary. I&#39;m going to let you go now but you will have to escape after that. It&#39;ll be fun I assure you.”</p>\n\n<p>I was scared before, now I was terrified. </p>\n\n<p>He cut the ropes from my ankles first, then my wrists. He leaned toward and whispered to me,</p>\n\n<p>“Run rabbit run”</p>\n\n<p>Oh fuck. I ran. Where was I? I tried to get my bearings but it was dark. Obviously a building of some sort. Old factory, old hospital seemed more likely. The halls were endless and they all lead to nothing. Doors opened to sealed off rooms. Stairs up or down only took me further into hell. I felt for my phone. Of course it wasn&#39;t there. Jesus, why would it have been? </p>\n\n<p>I kept moving, had to find a way out. I could hear him moving behind me, it seemed every step I took, he got closer. I&#39;ll be damned if I&#39;m going to die here.</p>\n\n<p>I had to find a place to hide, and soon. The only way I&#39;m going to stop him is by surprising him. After moving another few minutes I found a small dark corner to stand in. I waited for an eternity for him to pass. Waited. He never came near to me. I&#39;m not sure where he is now and that makes this scenario even worse.</p>\n\n<p>I have to become the hunter. Throw him off my trail and get behind him. </p>\n\n<p>First things first. Find the room I was tied in and get a weapon. Even a piece of the chair would suffice. I made my way back there. I went inside, thank God everything was still there. Picking up the chair, I smashed it against the wall breaking it to pieces. Surely he heard that. Fine. I wanted him to.</p>\n\n<p>I went down the next hall and listened for him. A knock down a hall near me. Had to be him. My breathing was the only other sound I heard. Now was my time, I slowly made my way towards the sound. I needed to wait now. Standing in a darkened corner again I could hear his movements. Closer. Closer. Closer.</p>\n\n<p>I leapt out at him, bringing the chair piece down on the back of his neck. He stumbled forward. I jumped on top of him landing blow after after blow.</p>\n\n<p>“You. Fucking. Pig. Fuck. You!”</p>\n\n<p>I didn&#39;t stop. Couldn&#39;t. Not until he was finished for good. With a each shot more gore appeared. </p>\n\n<p>Through the brutality he managed to gurgle,</p>\n\n<p>“You&#39;re learning, becoming evil. Welcome.... to the… end.”</p>\n\n<p>With one final swing, I thrust the chair piece into and through what was left of his head. He was gone.</p>\n\n<p>I fell backwards exhausted. </p>\n\n<p>Gazing at the mess in front of me, realizing I made it, made me sick to my stomach. I vomited onto the floor and carnage. I gathered my composure and stood myself up.</p>\n\n<p>Now to find my way out.</p>\n\n<p>Back at home now. No fear of repercussions for my actions, I was cleared of any wrongdoings based on the tapes and evidence at the abandoned hospital. I&#39;m just glad to be able to put this behind me. </p>\n\n<p>I&#39;ve seen what true evil is and what it can do.</p>\n</div>\n","author":"RockabillyOx"}