{"rank":"3","title":"\"Watch out for the creature lurking in the woods\"","id":"8j8dfb","url":"/r/nosleep/comments/8j8dfb/watch_out_for_the_creature_lurking_in_the_woods/","time":"1526258957000","body":"<div class=\"md\"><p>My father and I have always been very close, but the last time we went camping would change our lives forever. It was around dinner time when my father suggested the idea of a camping trip, &quot;Let&#39;s go camping, son!&quot; he exclaimed in his typically insufferably happy tone. &quot;uh, okay.&quot; I muttered, up until this trip I had always been laid back so this would be a normal response coming from me. Since this wasn&#39;t the first time we had gone camping we already had camping equipment s we packed up and headed out. It was a long two-hour drive but eventually, we got there and started putting together our camping set-up. Once we had our tent up it was already around sunset so my father and I decided to call it a night. We headed off to bed and I had a surprisingly comfortable sleep that night keeping in mind I was basically sleeping on dirt, The next morning just as the first rays of sunshine were peeking through the horizon my father shook me awake.</p>\n\n<p>&quot;Son, son! wake up!&quot; is what I made out of his frantic attempt to wake me up, &quot;what?&quot; I said in a sleepy voice &quot;Just come out of the tent, it&#39;s a lot to explain.&quot; he said visibly shaken. I had just woken up so it took me a while to really start getting the day rolling but once I did I told my father I was ready for whatever he had to tell me, &quot;okay, &quot; he started &quot;I woke up around midnight and felt a dark presence in the tent. I looked around and saw a dark figure standing over me, &quot;I almost screamed but the figure hushed me and told me not to worry in an almost inhumanly deep voice. the figure told me that over the next three days If you or I looked at him over the course of our three-day camping trip he would take us back to where he came from and if you try to leave he will find us. Then he just simply vanished.&quot; I, of course, thought it was a joke and said laughing a laugh of unease &quot;Are you serious?&quot;. &quot;Yes!&quot; he said clearly flustered &quot;Just whatever you do don&#39;t open your eyes If you wake up in the night&quot;. I was stunned, this couldn&#39;t be real, there&#39;s no way that some being would just drag us off into the darkness surrounding our camp just if we looked at it. I guess I was silent because my father started talking again &quot;Do you understand?&quot; I didn&#39;t know what to say &quot;Yeah, I guess&quot; I replied.</p>\n\n<p>The rest of the day went by just as a normal day camping would but the dreaded darkness of the fading day was fast approaching but I knew I had to sleep. During this night all I could think about was if I would really be dragged off into the night by some entity if my eyes happened to flutter open in the next few hours, eventually, I did manage to sleep but I woke up to the sound of my father screaming. I immediately ran over to his tent and saw I faceless humanoid creature that was at least eight feet tall with over-grown limbs grabbing at my father &quot;DAD!&quot; I yelled without much thought but simply yelling would do nothing. I had no idea what to do until, &quot;The gun!&quot; I silently thought to myself, I ran over to my father&#39;s truck and grabbed his .44 Magnum handgun and ran back over to the tent. I shot that thing in the head six times as that&#39;s all of the ammo that was in the gun, I guess six shots to the head wasn&#39;t enough to kill that creature but certainly enough to scare it off as it ran out of the tent, leaving me and my dad. I looked over at him and saw that whatever that thing was ripped my dads leg off &quot;Holy Hell!&quot; I yelled and dialed 9-1-1 as soon as I got my hands on a phone.</p>\n\n<p>My father and I were quickly rushed to the hospital and he was patched up and even has a very efficient prosthetic leg now. Its been about four years since this incident happened at the moment I&#39;m seventeen, but the doctors are worried about me because they say I&#39;m growing taller than I should and my facial featured are starting to decompose. Also, I have an inexplicable need to go back to those woods, you know what? I think I&#39;m going to go camping at that park every day.</p>\n</div>\n","author":"Ciananman"}