{"rank":"23","title":"University Hole","id":"8j8djn","url":"/r/nosleep/comments/8j8djn/university_hole/","time":"1526258988000","body":"<div class=\"md\"><p><a href=\"https://www.reddit.com/r/nosleep/comments/8ji7cs/university_hole_food_water/\">Part 2</a></p>\n\n<p>•</p>\n\n<p>My first semester as a transfer student was one of the most suffocating periods of my life. Sounds over the top, but I did not think I would survive. It&#39;s been a couple years since and I am finally ready to share.</p>\n\n<p>I won&#39;t try to hide which university this is since my comment history is a giveaway, though I&#39;ll keep the exact location to myself. </p>\n\n<p>•</p>\n\n<p>Summer semester, 2016. I was assigned an off-campus apartment (UCF doesn&#39;t refer to their housing as dormitories.) The sixth floor room was a bit more than I could afford but it was the only place still open for the summer. Cosplaying roommates, nasty kitchen sink, nothing out of the ordinary. Matter of fact it was quite pleasant aside from the typical weird drama.</p>\n\n<p>One roommate, C, kept the apartment smelling like lavender oil, one of my favorite smells. She was the only other tenant taking summer classes, our other two roommates were with their families. C worked a lot and studied on campus, I had online classes and played a ton of games in my room. We didn&#39;t speak or see each other often, and when we did it was usually small talk in passing or through text. Fine by my introverted ass. </p>\n\n<p>Sounds silly, but I never got a &quot;bad vibe&quot; from this place. A year prior I had started eating right, bodybuilding with my new boyfriend, and I had finally got my mom to agree with me pursuing a Cinema Studies major. I was at the top of the world and no one could stop me.</p>\n\n<p>Until the back-to-back Christina Grimmie and Pulse night club shootings. Two students were killed and everyone went into a panic, including myself. I was afraid of leaving the apartment. Isolated myself. Stopped going to the gym. I had my groceries delivered via hired students and only ventured downstairs to collect mail. Sunlight didn&#39;t touch my skin for weeks. Inevitably, I slipped deep into a depression hole.</p>\n\n<p>I&#39;ve had major depression disorder as far back as I can remember. My mom was in denial about her delicate flower having any imperfections, so I hadn&#39;t gotten real treatment until a few months ago. Goldfish and peanut butter dinners, lack of basic hygiene, 14 hour naps, no gym, the whole nine yards. The deeper into the hole I go, the harder it is to climb out.</p>\n\n<p>After two months of neglecting my responsibilities, I think I snapped. After one particularly long &quot;nap&quot; (20 hours, can you believe that&#39;s not my record?) my room was dark and my sinuses were stuffy and swollen. I assumed I had woken up at night with my crooked schnozz acting up again. Not an unusual occurrence. I reached across my bed to grab my phone and, out of habit, opened Facebook. There was nothing. No posts, no notifications, not even a message from my now long-distance boyfriend. Thinking it had glitched somehow, I reloaded the app. Still nothing. I had no signal, no internet. Nothing to distract myself aside from two blu-rays and my gaming systems, though my library is crippled by a lack of internet. </p>\n\n<p>Staring at the ceiling, I started to cry. Tears come easy when you&#39;re legs up in a hole. I just felt numb, like a wet blanket covered me from head to toe. No lights shone through the slats on the window. The air was thick, as if the building was under intense pressure. </p>\n\n<p>I eventually got up to pee and blow my nose, and as I shuffled back across the well-worn carpet to my desk, I caught the smell of the apartment. It wasn&#39;t the light wafts of C&#39;s lavendar sticks, but a penetrating, earthy scent. I just wrinkled my nose as I reached for a Dualshock and held the middle button.</p>\n\n<p><em>beep</em></p>\n\n<p>Leaning back in my chair, I squinted out the window. Even with the blinds open, all I saw was my dark reflection illuminated by the blue monitor. It didn&#39;t make sense. What made less sense was the dirt on the windowsill. Not dirt, /soil./ Moist, gravelly soil.</p>\n\n<p>There shouldn&#39;t have been soil on this particular windowsill, I would have noticed it in the past couple months. Once I turned on my lamp, I learned what was truly off about my room. Pressed against the window was a wall of dirt and condensation.</p>\n\n<p>I had woken up in a literal hole.</p>\n\n<p>Or at least that&#39;s what it felt like. There was no way for a wall of dirt to spring up overnight. This was like someone removed our unit and buried it. </p>\n\n<p>Of course I thought I was dreaming. The common room lights were on, its window was black, gravel speckled throughout. Soil scattered on the sill, same as my room. I inspected the glass for cracks, but found none. </p>\n\n<p>At this point I felt sick. Not violently, but in a dull, crushing way, as if I were going to implode. I needed to get away from the dirt. Our building&#39;s hallways were indoor, so the next logical choice would be to try the front door, get away from the stench.</p>\n\n<p>It was not logical. Not at all. Where there should have been a pleasantly painted hallway was the rocky shore of a murky expanse of water with no opposite shore in sight. I stared for quite a while, jaw hung wide open. My gut kept me from passing the threshold. I felt the pressure from beyond. A cold, choking pressure. I stared for quite a while before a gull cawed as it hopped towards me. I shrieked and slammed the door on the bird. Rude, I know, but I was weirded out.</p>\n\n<p>After I calmed a little, I opened the door a crack and peeked through. I was greeted not by the shore, but a field of slow crawling magma. The heat was intense, yet the doorknob was cool to the touch. Shaking my head in disbelief, I shut the door again, locking it this time.</p>\n\n<p>I&#39;m pretty good at waking myself up from a nightmare once I&#39;m aware I&#39;m in one,  but my normal methods weren&#39;t working. Counting, singing the alphabet backwards, jumping jacks, anything to distract you. Nothing. Just the door in front of me. </p>\n\n<p>At this point I started to panic. I&#39;m stuck in a hole with a nonsensical door.</p>\n\n<p>This door was my only exit, but the exit wasn&#39;t my own. I needed to get out.</p>\n\n<p>•</p>\n\n<p>Edited to add the detail that kept me from sharing this experience in the first place. I&#39;m not sure how I left it out, I will pay more attention in the future.</p>\n\n<p>Edit 2: formatting</p>\n\n<p>•</p>\n\n<p><a href=\"https://www.reddit.com/r/nosleep/comments/8ji7cs/university_hole_food_water/\">Part 2</a></p>\n</div>\n","author":"beefy5layerhamu"}