{"rank":"15","title":"Addiction","id":"8j8fup","url":"/r/nosleep/comments/8j8fup/addiction/","time":"1526259639000","body":"<div class=\"md\"><p>I don’t know if I’m going insane or what the hell is wrong with me. But things have slowly started to get to my head. \nI served 3 years in the military, and as a nurse, you had to see a lot. Things you want to unsee.\nPeople even ask me if I have PTSD, but it’s more complicated than that.\nI have cravings, and I’m not talking about craving for food, like pregnant girls gets, but I have a craving for blood. It’s not who I am, and I’m so devastated right now. </p>\n\n<p>I am a 29 years old woman, single mom and now work as a volunteer at the homeless center, handing out soup and drinks to people who have nothing. \nEvery day, I see people who have no parents, no homes and no purpose, but yet they wander lifelessly around. And the thirst of blood gets worse. Just thinking how I could sneak one guy, tell them I have a shot in my car if he’s interested. It’s one move and he would be dead. I just need to get my craving under control. It drive me crazy and I can’t concentrate.</p>\n\n<p>I got knocked out after an explosion in the field. I hit my head extremely hard and woke up later and I felt different. I licked my blood of my hand and it was like a child in the candy shop. I couldn’t stop. I kept licking until the nurses locked my arms to the bed. I was possessed, I was fighting against the chains. I needed the blood. </p>\n\n<p>“Suzann?” I got snapped back to reality. \n“Can you take over? I need to get supplies” the lady asked and I nodded. I filled the bowls with soup and handed it over to the dirty junkies, thinking how I could get one of them to my car.\nIt was my chance. Someone who looked like a drug addict looked at me.\n“I don’t need food, I need a shot” he was shaking. I smiled and leaned towards him.\n“I might have something you like” I winked and told him to meet me at the lot. I just left, I needed this chance and I didn’t care if I didn’t feed the homeless. He had what I need and he thinks I got what he wants. It’s a win-win.</p>\n\n<p>He stood there. Still shaking, waiting for the shot he so badly needed. I waved at him and I think that’s the first time I’ve seen such a junkie run. I pretended like I was digging in my purse. I was looking for something, then I turned around quick and knocked him out with my fist. He didn’t seem to pass out at first, so I kicked him one more time in the throat. “Fucking junkie.” I mumbled as I kept kicking. I saw him laying lifelessly on the ground. I put him in the trunk and covered him up, but I couldn’t resist. I cut his wrist open, had a towel ready to stop the bleeding. I laid my lips on the cut and sipped the blood. It was like drinking water after a long hot day. It was like all the flames inside me was out, I was so relieved. Kind of turned on. I think I was just very ecstatic. I covered the wound and covered the body and went back to my job.</p>\n\n<p>Days went by and I kept drinking off the body, but as I kept drinking the blood, I became thinner and I felt sicker by the days, so I went to the doctor to take some tests. \nAfter an hour he came back with a worried look. “Have you been in contact with blood lately? Or used needles?” I mentioned my volunteer job and I sometimes had contact with the junkies. I couldn’t mention the blood I drank from the body I killed, but it all came falling to me. I drank blood of a junkie. \n“I tested you, and you tested positive for aids.” My heart sank. </p>\n\n<p>Who knew my addiction could get me killed.</p>\n</div>\n","author":"CannedTomatoSauce"}