{"rank":"11","title":"I’ve had a couple strange experiences during the night. Thoughts?","id":"8j8t9e","url":"/r/nosleep/comments/8j8t9e/ive_had_a_couple_strange_experiences_during_the/","time":"1526263375000","body":"<div class=\"md\"><p>The strangest thing happened to me two nights ago, and again last night.</p>\n\n<p>I woke up around 3 in the morning to a bright light shining in through my window. Looking around my room, I noticed that every surface was coated in a delicate lace of frost, like a funeral veil meant for those headed to the grave. Slipping out of my bed, I noticed something else that was really weird – it was cold. I mean freezing. Like winter temperatures, not something you’d expect on the 13th of May.</p>\n\n<p>After slipping on some of my heavier clothes, I headed over to my window. I remember looking outside and seeing nothing. Well, there wasn’t nothing, there was just nothing to see. Except white. Thick, bright white – like a thick fog that someone’s shining an industrial work lamp through.</p>\n\n<p>I scrubbed away the frost lace covering the glass, and put my face up to it, trying to get a better look outside, but there was no point – I still only saw the bright white fog. For whatever reason, I decided that I’d head outside to see what was really going on. After donning some more appropriate apparel, namely my winter boots and a thick coat from the back of my closet, I snuck downstairs and out the door. Before slipping outside, I grabbed a couple of balls of yarn from my mother’s knitting basket – it looked really easy to get lost outside, regardless of how well I thought I knew my neighbourhood.</p>\n\n<p>Outside, my suspicions were confirmed. I guess sometime during the night, a freezing cold fog had rolled over my city, and had decided to stay. But that still didn’t explain the intense light. Outside, it seemed like the fog itself was what was glowing. The streetlights paled in comparison to the luminescence of the fog, as did the headlamps and flashlights of the few people I saw outside at the time.</p>\n\n<p>That was the other odd thing – the people. They were dressed in, at most, light sweaters – totally unfit for the chill that I felt. As I passed, they gave me odd glances, and I returned them. Nothing about this situation was right, but I felt that I, at least, was being somewhat more rational than them.</p>\n\n<p>A couple times, I saw some cars loom out of the fog, only to return to its embrace a couple seconds later. I also saw other shapes. And I heard them, too. Great, tall forms, with perhaps a half-dozen long legs – like those spider crabs from the deep sea. The first one I saw shocked me. It trundled past down the street, piping with, presumably, massive lungs a song almost deeper than what I could hear.</p>\n\n<p>I almost considered just heading back to bed after that. Things had really gotten out of hand. I still don’t see how people weren’t waking up to ogle at these beings. The few people out jogging or walking their dogs seemed oblivious to their existence.</p>\n\n<p>I remember that at one point, I tried to follow one. It just kept on walking, first down my street, then once it had reached the end of mine, down another. </p>\n\n<p>It wasn’t the only form out there, either. High above us both, I saw great shadows glide lazily through the thick fog. I guess I felt them more than I saw them – they pushed great gouts of air down towards the ground below themselves.</p>\n\n<p>There were smaller beings, too. Things with three legs that followed the tall ones. They had teeth, long sharp teeth. Once, I saw a pack of the small ones charge one of the tall ones, and actually take it down. I was pretty impressed, it was like being on a safari.</p>\n\n<p>I guess I dropped my twine lifeline, because I remember getting lost at one point. Everything looked the same all around me – it didn’t help that every house I passed, and was close enough to see, looked exactly like mine.</p>\n\n<p>The houses were odd, too. Or rather, the inhabitants of the houses were odd. At first, I thought that the people who lived in them finally woke up and saw what was going on outside, but then I realized that I wasn’t seeing people. I was seeing more of these things. But they looked a bit like people. They were tall, though, and skinny. I remember in particular their eyes – eyes that were startlingly black against the omnipresent white void. They reminded me a bit of those pictures of black holes – the ones where all the stars and stuff are bent around a single sphere that’s darker than night. Or maybe that nifty new material – I think it’s called vantablack. It’s supposed to absorb like 99.9&#37; of light.</p>\n\n<p>Anyways, I saw these odd people, but I don’t think they saw me. They just looked outside. It’s like they were expecting someone, but they didn’t seem to notice the people that did pass on the street, and the people on the street didn’t seem to notice them either.</p>\n\n<p>Eventually I went back home. It’s a shame I didn’t bring a camera, I think you guys would have liked some of the photos. I fell back asleep and woke up in the morning. I remembered the strange place I went – or rather how strange my neighbourhood had become, but I put it off as a dream. I left my parka on the floor though, so I know that it was real.</p>\n\n<p>My parents asked me if I had been out that night, they said the neighbour had seen me walking around in a parka. I don’t think this was true, because my neighbour would have seen all the beings that walked around out there as well.</p>\n\n<p>Anyways, it happened again last night. Luckily, I hadn’t put away my parka, but I don’t think I’d have needed it anyways. It was a bit warmer last night, but the fog was just as thick. Everyone was acting weird this time. Like I wasn’t there. They kept moving real slow, too. </p>\n\n<p>I tried to follow one of the big tall things, but it kept running away from me, making quite a racket. Last time they hadn’t noticed me, but maybe I looked more visible without my parka.</p>\n\n<p>It even rained, too. But even the rain was weird. Piercing through the white fog, it was real slow, and real loud. A little bit like a drum. But not like a rock drum, more like one made of skins, like you sometimes see on the Discovery channel.</p>\n\n<p>I also saw the void eyed people. They saw me too this time, it was exciting. They looked at me, and a couple even smiled. One even opened the door for me, but I don’t know the people who lived in that home, so I didn’t go in. It’s only when they started to come out on the street, stalking towards me on long, dark limbs, like coal, that I got a little bit frightened. I went home after that and locked my bedroom door.</p>\n\n<p>See, but now I have a problem. I woke up this morning to the same thing, but when I went outside, nothing was moving. The grass wasn’t rustling, the trees weren’t swaying. It was only the rain. Slow, loud, and constant.</p>\n\n<p>Dum…</p>\n\n<p>Dum…</p>\n\n<p>Dum…</p>\n\n<p>Like a drum beat, or a heartbeat.</p>\n\n<p>I passed a couple people, but they didn’t notice me. They didn’t even move.</p>\n\n<p>The other things did, though. And boy did they move. I think that the tall things can easily set the record for the fastest land animal – it’s a shame that everyone seems to be ignoring them.</p>\n\n<p>But the void eyed people could move pretty fast, too. I could see them better this morning, I think the rain was pushing away the fog. They’ve got really long legs, and long arms. And quite a smile. As soon as I stepped outside, with an umbrella this time, (I didn’t want to get wet like last night), they headed towards me. It’s like they’d been expecting me. They were smiling, but all I could look at were their eyes. Like chunks of nothing. Not nothing like the fog had been the first time I’d seen it. Not something in the place of nothing. These things had eyes that were actually made of nothing.</p>\n\n<p>They kind of scared me, so I haven’t done a whole lot of exploring tonight. When I saw them coming for me, I went back up to my room, and locked my door. I don’t think they mean me harm, but I don’t really want to meet them.</p>\n\n<p>But at this point, I don’t really think I have a choice. I guess I left my front door open, because I can hear one, knocking at my door. I’m sure it’s smiling. I can almost feel it’s empty gaze through the 4 or so centimeters of hardwood that is the door to my bedroom. I don’t think it will come in unless I let it in, but I don’t want to do that. I tried to sleep, but I can’t. </p>\n\n<p>It’s knocking is in time with the rain.</p>\n\n<p>Dum…</p>\n\n<p>Dum…</p>\n\n<p>Dum…</p>\n\n<p>Maybe it is the rain. Maybe it’s the void. Maybe it’s from hell.</p>\n\n<p>Maybe it is hell.</p>\n\n<p>It won’t stop. I’m tempted to open the door, just so that it will. Just so that I can sleep. Time has stopped, morning isn’t coming for me. Please help.</p>\n</div>\n","author":"56Nare"}