{"rank":"29","title":"I met the girl I was 100 years ago.","id":"8j90j2","url":"/r/nosleep/comments/8j90j2/i_met_the_girl_i_was_100_years_ago/","time":"1526265453000","body":"<div class=\"md\"><p>I was walking through my woods one night, I had just snuck out of my house to escape the noise of my parents fighting for the 5th time this week. I don&#39;t think they really cared if I was safe, they just wanted me there to scare off strangers.</p>\n\n<p>I was a tall, lanky girl, with a large ugly scar across my face from a injury when I was born. I kept people away, they were afraid of me, but I was more afraid of them.</p>\n\n<p>I sat down on a log, it was mushy from years of rot. I flicked a spider off my boot and started to think about my life when I heard a voice behind me say:</p>\n\n<p><em>&quot;Follow the lights, young one. They will take you home.&quot;</em></p>\n\n<p>I thought to myself, <em>Why would I want to go home? Its a living nightmare there!</em></p>\n\n<p>Just as that thought exited my mind, a path of dark grey lights appeared in front of me and lead deep into the woods. I had no clue where they went, but I started following them, each light vanished into a cloud of dust whenever my rather large boot touched them.</p>\n\n<p>I had been hiking for hours. My boots sloshed with dirty swamp water, my favorite plaid shirt was ripped to shreds from wild rose bushes, and my hair and face was plastered with leaves. I eventually stopped to catch my breath, empty my boots, and clean off my face. As I was pulling the almost ancient leaves off my face, the on that was on top of my scar would not come off, I scraped, scratched, pulled, and peeled, but it <em>would not come off</em>, and it kinda stung.</p>\n\n<p>As I got up, the lights that were ahead of me vanished, the log under me turned pure black, and my veins turned black. A ice-cold hand touched my shoulder and said with a hollow voice, <em>&quot;Do you know who I am, young one?&quot;</em> </p>\n\n<p><em>&quot;No, N-No I don&#39;t&quot;</em></p>\n\n<p><em>&quot;Ah, It seems my legend isn&#39;t told in this world, this is tragic, Madison.&quot;</em> </p>\n\n<p>I was puzzled. How did this short, stocky woman that looked like she was born two years before Moses know who I am?</p>\n\n<p>All I felt after that was pure pain, It felt like the life was being drained out of me. I woke up in a cold, dark room, the woman was at the foot of my bed, the leaf was still on my face.</p>\n\n<p><em>&quot;My name is Laura, you don&#39;t look anything like what I expected... Anyway, I am the person you were 100 years ago.&quot;</em></p>\n\n<p><em>&quot;What. 100 years? Wait... how?&quot;</em></p>\n\n<p><em>&quot;I am the person you were in a past life, your soul has been used since the beginning of time, poor child. Unfortunately, none of those people lived past their 20s... except me, I lived well into my 100s.&quot;</em></p>\n\n<p><em>&quot;Ok... what does that mean, my soul is in for its 2,018 year check-up?&quot;</em></p>\n\n<p><em>&quot;Ha, no. I have been watching you, you have severe anxiety and depression. I brought you here to show you how you died in all your past lives, so you understand why your mental health is what it is today.&quot;</em></p>\n\n<p><em>&quot;...Ok...&quot;</em></p>\n\n<p>Her face then turned pure black and her eyes glowed white, she then put her hands on my shoulders and mumbled some Latin words. My soul walked out of my body and stood beside her, it then duplicated and stood beside itself. My souls had the same black veins I had.</p>\n\n<p>She took her hands off my shoulders and I fell to the ground, I sat up and watched my souls- mix of red, blue, pink, and black stand there motionless, waiting for Laura to command them.</p>\n\n<p><em>&quot;I will use this soul to show you how you have died.&quot;</em></p>\n\n<p>I was prepared for hours of watching my soul die about 100 times, but instead, I saw my soul do the same thing over and over:</p>\n\n<ol>\n<li>Get captured.</li>\n<li>Get shot.</li>\n<li>Not die.</li>\n<li>Get up.</li>\n<li>Get shot again and die.</li>\n</ol>\n\n<p>I was horrified, for once I wanted to go home. </p>\n\n<p><em>&quot;HAULT! YOU MUST SEE WHAT YOUR SOUL WILL BECOME!&quot;</em></p>\n\n<p>I sat down and watched the other soul flash purple and black, it then rushed into my body, knocking the air out of me.</p>\n\n<p>Laura helped me up onto my feet then turned a light on in front of me, my shadow was long, dark, bent over like a old lady, and had a witches&#39; hat on.</p>\n\n<p><em>&quot;Wh... What did you do to me?&quot;</em></p>\n\n<p><em>&quot;I turned you into a witch, it was going to happen eventually, better now than later!&quot;</em></p>\n\n<p>Before I could say anything, I woke up in bed, with black fingernails, black hair, green eyes, and black earrings that I could not get out. The leaf was gone, and so was my scar. My veins were still black.</p>\n\n<p>I walked through the world for years like that, I could summon crows and talk to the dead, but I eventually made a deal with the devil to get my old soul back. Thankfully, he got rid of the scar. </p>\n\n<p>I still have the witch soul in a locket, and I could give it to anyone I want... even myself.</p>\n</div>\n"}