{"rank":"1","title":"Helping Annie","id":"8j91yc","url":"/r/nosleep/comments/8j91yc/helping_annie/","time":"1526265878000","body":"<div class=\"md\"><p>It happened when I was on a website about suicide. I remember I had my red and black blanket, the one I just got for Christmas, wrapped around me. I wasn’t sleeping; I never really fall asleep, unless it’s during the day and I want to avoid my responsibilities. I was thinking about all the pills I have and if I took them all, would I die? Because I wanted to. </p>\n\n<p>And that’s when he came into my life. My fingers drug across my mouse pad, my eyes dancing across my laptop screen, the lights too bright for the pitch-black room I was in. There were images of boys and girls smiling and holding hands and going to class and petting dogs. Fake happy fuckers. I was alone and miserable, and I had been for months; these images were not something I could relate to, or even see in my future.</p>\n\n<p>my name is Kale. i work for this website. is there anything you want to talk about?\ndon’t be weirded out. i’m just making sure everything is ok (:</p>\n\n<p>I immediately rolled my eyes. Everybody wants to help, because they get it on their mind that if they at least try then they won’t have to feel as bad when I give up. Not only that, but this “Kale” guy used a backwards smiley face. Amateur. I ignored him and closed out of the browser. I threw my laptop onto the end of my bed, done with it, done with that website, done with everything.\nI have a complicated relationship with suicide, though. I know, with every inch of my being, that I will never kill myself. Despite the constant urge, the incessant desire to just stop, I can’t hurt the people in my life. It’s complicated with them as well, but not enough to be that selfish. I was more or less checking out the website to try and change the dialogue in my head. It gets old to want to die every night. </p>\n\n<p>The next morning met my eyes thanks to an alarm, reminding me that no, I wasn’t dead and I had to be at least semi-productive; it was one in the afternoon. If I didn’t have to go into work at two, I would have slept for the rest of the day. My bed was warm, it held me when no one else would, it kept me safe from everything but my own thoughts. I had nothing to look forward to, nothing to get up for. Obviously, though, I would have to pay to put that bed somewhere, hence why I still went to work. </p>\n\n<p>Once I convinced myself to leave my sanctuary, I took a peek at my unruly hair, making a note, for probably the 17th time, that my light brown roots were reminding people that I wasn’t a natural blonde. Breakfast, or lunch rather, did not seem appetizing, so I went for Xanax instead, the only tool I used to make my tornado of a life a little more bearable. The pills left an awful taste in my mouth after they inched their way down my throat. </p>\n\n<p>Having plenty of time before I had to go into work, I retrieved my laptop from the floor at the foot of my bed as it had fallen off in the middle of the night, no doubt due to my incessant tossing and turning. I quickly began erasing emails that meant nothing to me: a coupon for 20% off at Bath and Body Works, someone telling me I qualified for debt relief. My finger froze mid-air as my eyes scanned over an email with the subject line “Kale Just Wants to Help.” I thought about deleting it but decided to open it up instead. </p>\n\n<p>annie,\ni’m assuming your name is annie, since your email is <a href=\"mailto:annie.est.1994@email.com\" rel=\"nofollow\">annie.est.1994@email.com</a>. i’m sorry if i scared you last night, i just want to help. i think i can help you. if you want to talk, just reply to this email. i hope you’re doing okay.</p>\n\n<p>kale</p>\n\n<p>I was bewildered, flabbergasted, and any other big word that means shocked and sputtering. I know for a fact that I never once gave out my email address on the site where Kale found me. At this moment, with my heart trying to slam its way out of my chest, I was torn between responding or deleting the email. He had already gotten this far; would he get my phone number soon? My address? Was it all a fluke? </p>\n\n<p>Within less than a minute I was typing a response; I don’t think I blinked once. </p>\n\n<p>Kale, \nI have no idea how you got my email, but it’s a bit unnerving. Do all of you assume every visitor to the website is suicidal? I would suggest some new tactics before you freak too   many people out and make them want to die, even if they didn’t want to in the first place.</p>\n\n<p>I didn’t bother to leave my name at the end since he already knew it. A breath of fresh air flowed from my laptop and into me as I hit send, satisfaction washing over me; I hadn’t felt like I’d done something important in a long time. Reaching up to shut the lid to my computer, I stopped again as a loud “ding” rattled in my ears.</p>\n\n<p>annie,\nwe get access to lots of tools to assure we are reaching everyone. suicide is an epidemic (:</p>\n\n<p>kale</p>\n\n<p>Reading his email left a bad taste in my mouth; it tasted like what I imagine rotten kale would taste like. At first, I was confused, but now I was just outright shaken. I couldn’t even think of how to form any kind of response; I just let my laptop sort of slide off of my lap and left it at that. </p>\n\n<p>To say I was numb when I clocked in at work would be an understatement, but this was a norm, something comfortable. Working at Ridgemoor Market was debilitating and soul-crushing. Every day, I felt less and less like a human and more like a small gear, part of a working whole; I wasn’t there to meet you with the smile at the register, I was there to make sure you got the most organic, nutritious baby carrots and that was that. I did you a service, I got paid, I went home. </p>\n\n<p>After a monotonously grueling shift, I retreated into my bedroom, abandoning my worn-out, black tennis shoes near the door. As I slid by the broken mirror that rested against my wall, I was reminded of three things: I looked (and felt) like shit, my cat broke my mirror and I needed to throw it out, and I was pissed at my cat for breaking my mirror.</p>\n\n<p>My roommate was almost never home, as she had two jobs and an older boyfriend who liked to buy her things. The only signs that there was even another person living in the apartment were dishes scattered about, with crusted-on oatmeal and mystery chunks. I didn’t mind the solitude, it made me feel more comfortable. The fact that we had neighbors, though, made me worried about what they could hear through the walls, what they thought I did and who they thought I was. </p>\n\n<p>Before I made it across my bedroom floor, my foot landed on something small and hard, and it snapped under my weight. When I lifted my foot up, and I saw the volume button imprinted onto my skin, I knew I had just broken my TV remote. With a huff, I turned around and glimpsed the crime scene; sure enough, it was smashed. I guessed I would be watching Netflix from my laptop, that evening. </p>\n\n<p>His name and his messages weren’t even on my mind until they all flashed across the screen at me. There I was, planning a nice night in with Black Mirror, and Kale forced himself in and brought snacks. </p>\n\n<p>annie,\ndon’t be mean, just talk to me. all i want to do is help. can you just tell me why you visited our site?</p>\n\n<p>kale</p>\n\n<p>At this point, I almost wanted to applaud this guy for his effort, but the majority of me really just felt pissed off. He was incessant; he was a stranger and he was trying to peer into my life. \nMessage me one more time and I’ll call whatever corporate office you work for and get     you fired. This is seriously inappropriate. </p>\n\n<p>I’m not normally the type of girl whose blood runs at a boil when she gets mad, but I felt like strangling a lightbulb. Kale had overstepped and one more message would feel like harassment. I wanted my own interest in suicide to be private; one attempt to reach out is comforting, but since I declined it, more than once at this point, I felt intruded upon. </p>\n\n<p>A ding. </p>\n\n<p>annie annie aniiee.\nthere is no corporate. this is not an organization. i am a volunteer and paart of the agreement is anonymity. sorry (:</p>\n\n<p>kale</p>\n\n<p>My stomach gurgled and twisted. Unnerving, that’s all I can describe the feeling as, because every part of me is on the verge of shutting down. My fingers shake as they press keys on my laptop, most of them incorrect, but with Google’s astounding capabilities, the suicide website pops up before me, and I click on the link. </p>\n\n<p>My eyes jump over the pictures of the robotic teenagers, begging the page to produce some kind of phone number for customer service or a representative. I realize my plan wasn’t entirely thought through when the chat box pops up. </p>\n\n<p>aAnnie! that email was meen ):</p>\n\n<p>I don’t know if I’m screaming in my head or out loud, but my finger leaves a trail of sweat as I swipe it up to the red “x.” I needed to get away. But then I spotted it. A phone number. </p>\n\n<p>I fumble for my phone, tossing my comforter and pillows around, not knowing where I tossed the damn thing. When I eventually reached it, I imagined my joy to be more than 100 times that of a pirate who finally found the treasure the “x” on the map led to. I dialed the number and tried to swallow unsuccessfully, both my mouth and throat dryer than the ends of my hair. </p>\n\n<p>My heart seems to do a happy dance when I hear the ringing, the sound of some kind of freedom. Right? But then a click. </p>\n\n<p>“Hello?” I question after a few seconds; maybe it wasn’t enough time for the other person to greet me, but I was restless. </p>\n\n<p>More silence. I wait, not wanting to seem rude. </p>\n\n<p>“Annie. Kale will be on the line in just a moment,” a female’s voice informs me, followed by a soft click. And more ringing. </p>\n\n<p>“Wait, no. I didn’t— no!”</p>\n\n<p>“Aaaaaaaaannnie! So glad you c—”</p>\n\n<p>I actually felt bile rise into my throat when my phone slid out of my hand. I hoped I hung it up. I had no idea if I had.</p>\n\n<p>A text message. </p>\n\n<p>Another message. </p>\n\n<p>They begin showing up on my laptop through the iCloud connection. His name pops up as the sender, as if I had his number already saved into my contacts. I didn’t. </p>\n\n<p>annie why ded you hang up? </p>\n\n<p>why did you hang up?</p>\n\n<p>are ypu okay?</p>\n\n<p>i think i shoud come ovgr</p>\n\n<p>I slammed it shut. I tried to find my phone, I could hear it continue to go off. Message after message. It wasn’t stopping. </p>\n\n<p>I pounced out of my bed, running to the bathroom, locking the door behind me. My cat meowed at me from the other side of the door as hot tears somehow trickled into my mouth. I guess tears are salty. </p>\n\n<p>I didn’t know if I would have preferred hearing my phone continuously going off or only hearing the sound of my heart and nothing else. I knew I was home alone. I didn’t know who was coming over. \nA thud. A pound. A noise from the front of my apartment. </p>\n\n<p>Someone inside. My cat is silent. Why is she silent? Where did she go?</p>\n\n<p>I hear walking. I try to creep silently across the bathroom floor and into the bathtub, barely parting the curtain to climb inside. </p>\n\n<p>I think I know he’s here. It has to be him. He said he was coming. </p>\n\n<p>Now a noise at the bathroom door. </p>\n\n<p>I’m so scared. </p>\n\n<p>“Annie.”</p>\n</div>\n","author":"niceworkbonedaddy"}