{"rank":"7","title":"Home Sweet Home (Part 2)","id":"8j92ds","url":"/r/nosleep/comments/8j92ds/home_sweet_home_part_2/","time":"1526266007000","body":"<div class=\"md\"><p><a href=\"https://www.reddit.com/r/nosleep/comments/3rz2xm/home_sweet_home/\" rel=\"nofollow\">Part 1</a></p>\n\n<p>I know it&#39;s been about two years now of radio silence, but a lot has happened since then. I received a lot of private messages about my situation. Most of you were very kind and urged me to seek additional closure.   </p>\n\n<p>In the two years since I began putting all this to paper, things have become far more strange than I could have ever imagined. Originally I had posted about this just a few weeks after my father passed,  since his passing brought a lot of memories up for me about the house that I&#39;d rather have not remembered. </p>\n\n<p>For the first year of my silence I was plagued my nightmares every time I closed my eyes. I dreamed of things I didn&#39;t realize I remembered. Between things coming back to me and these nightmares, sleep became quite difficult, as I began to dread even closing my eyes. It affected my work and home life immensely. </p>\n\n<p>In the beginning of the second year my wife decided that my ongoing issues with my past were “taking over the present.” She filed for a divorce and moved back to her home state to live with her parents. After 10 years of marriage, and barely after a year of my father&#39;s passing this was a difficult pill to swallow. We sold our home and split up everything fairly and went our separate ways. Having no kids together the divorce went through rather quickly. </p>\n\n<p>I ended up quitting my job at the time and starting with an at home position for a tech support company that let me make my own hours.  I also moved back to my home town to a very old high rise apartment building downtown. It&#39;s the oldest living structure in the city I live in, so it&#39;s bound to have a lot of stories of its own. Since I moved in I&#39;ve experienced a variety off odd occurrences which I&#39;ll post a little bit more about later as I&#39;m starting to think a lot of it might be relevant. </p>\n\n<p>Since I moved back I&#39;ve made a stronger attempt to be in contact with my mother and siblings more often (We are all spread out and my brother and sister have families of their own and busy lives, so it&#39;s sometimes difficult to get the chance to talk to them constantly). </p>\n\n<p>Recently I decided to conduct an experiment of sorts. Other than what we all experienced together at the old house, we have never discussed any of our personal experiences together. I asked the three of them to each write down anything that happened to them there and send it to me in an e-mail without discussing it with the other two. I also wrote down a lot more about what I remembered and saved it as a file on my hard drive. I decided to do it this way so that no one&#39;s recollection would influence the other&#39;s.   </p>\n\n<p>I thought I would start by posting some of the things I&#39;ve remembered from back then. As I get the e-mails from my family I will include those in later posts.   </p>\n\n<p>Here goes nothing.... </p>\n\n<p>I guess the first thing I really want to get into is some objects we had around the house that caused a few notable events. </p>\n\n<p>When I was little cabbage patch kids were all the rage (Seriously, you can look into old videos on you-tube about people trampling each other just to get one during sales, it&#39;s insane!). My family didn&#39;t often have a lot of money but were able to get one for each of us for Christmas one year when we were all still young enough to enjoy them. </p>\n\n<p>At first things were so awesome. We would take them wherever we went and play with them together at every available opportunity. I mentioned in the last post that no one ever really came over to visit, so these dolls ended up being our way of “having friends over”. Sounds silly now, but we had some pretty vivid imaginations and it made the three of us happy.   </p>\n\n<p>As time went on though things definitely changed. Keep in mind I slept with mine EVERY night. I WOULD NOT sleep without it. It was never out of my sight unless my eyes were closed. I remember sometimes I would wake up and it would be missing. I would freak out and look all over the house and find it in unlikely places. It showed up in the couch with the television on a few times, which I always found odd because usually I was the first person to wake up in the house. Other times it would be sitting facing the front door of the house, or even the backdoor near that creepy laundry room I discussed in the last post. It wasn&#39;t every night, and I don&#39;t recall it being any specific day of the week. It all seemed pretty random to me.    </p>\n\n<p>Not long after finding it in random places it would sometimes talk to me. My mom always called whoever I was talking to my “imaginary friend”. Being young of course I would argue that my friend was real. I don&#39;t believe I ever told her it was the doll I was talking to (I&#39;ll have to ask her about that after I get her e-mail about what she remembers). At first it was normal stuff about my life, the kinds of things I liked to do, and how I felt about different members of my family. Of course being that young I was thrilled for anyone to be interested in my thoughts and secrets so I spilled everything to this doll (Whose name by the way was Aaron according to the “adoption” paperwork that came with it).     </p>\n\n<p>Aaron knew things I didn&#39;t even tell my brother about, and I rarely kept anything from him. Over time things got a little more intense. I remember Aaron pushing me towards decisions I was pondering on at times, and even suggesting new things that needed to be done altogether. He would whisper to me late at night about my brother stealing toys from me, my sister breaking my things, and my father and mother always “talking bad” about me when I wasn&#39;t around. I took a lot of it to heart of course, why would my best friend lie to me?   </p>\n\n<p>It was around the time Aaron began making violent suggestions that I locked him away in a toy chest in my closet and never played with him again. I remembering my mom asking me about it and me telling her that I was getting too old to play with a cabbage patch doll. Mind you at the time I was about six years old or so.     </p>\n\n<p>A few weeks later I reluctantly decided to unlock and open that toy chest ( I had the only key in a secret place in the bedroom I shared with my brother that not even he knew about). When I opened it there were weird scratch marks on the inside. All the toys within were broken to pieces. Aaron was nowhere to be found. It&#39;s one of those things I had forgotten about entirely till about a week ago.   </p>\n\n<p>There&#39;s one more I clearly remember now involving another toy. Not too long after I stopped playing with Aaron my mom had gotten my brother and I a Teddy Ruxpin to share. My sister was deep into the barbie phase by then and it&#39;s all she even cared about. My brother and I played with it together often. We would listen to the tapes and watch it come to life, which enthralled us deeply at the time as there was nothing else really like it. One day my sister pranked us and switched the cassette we had inside Teddy with “Scary Stories to Tell in the Dark”. Naturally my brother and I were terrified pretty quickly but were too scared to even move till side a ended. When it did we screamed and made a break for it! We wouldn&#39;t even go to our room until my mother had retrieved the doll and put it in her own closet. My sister admitted the joke later that day and showed us the cassette.     </p>\n\n<p>Teddy creeped us out after that though so we didn&#39;t play with him too much. When we did we used him as more of a boombox anyway. We would just put music we liked in it and listen to them that way. We couldn&#39;t bring ourselves to ever listen to another story from him ever again. About four months later the three of us were in mine and my brother&#39;s bedroom just sort of hanging out and playing board games. All of the sudden Teddy, from in our closet, starts talking at random. My sister pulled him out and set him between us. For the first minute or two he seemed like he was telling us a story from one of the actual cassette tapes made for him. Suddenly his story took a turn for the worse. Somehow three children that had the same names we did were on some sort of adventure. One by one the children were basically dismembered and eaten by a teddy bear in the woods.     </p>\n\n<p>We listened to the whole story. Immediately my brother and I glared at our sister, certain she was behind it. That&#39;s when she yelled at us about it being a “lame attempt to get her back.” That&#39;s when I started getting super nervous, and I noticed my brother was as well. Our sister grabbed Teddy and went to pull out the cassette tape, but there wasn&#39;t one inside of it. The three of us screamed until my mother came in, by now Teddy had been silent for a few minutes.  </p>\n\n<p>Mom refused to believe anything had happened. She said we must have been imagining things because she had taken the c batteries out to use for something else the day before. Just as she opened the battery casing and showed us it was empty, Teddy said “Ouch”. Startled, my mom dropped Teddy on the floor. I remember him saying her actual name out loud and that “she was naughty and needed to be punished” in a strangely pleasant voice. This time even my mom screamed. She grabbed Teddy by the foot and ran outside to throw it in the garbage. By the time we all made it out behind her she was dousing it with lighter fluid and setting it on fire. I remember all four of us just standing there and watching it burn as its eyes blinked and stared at us, it&#39;s mouth moving constantly. I don&#39;t really remember what it said while it burned, but I do remember some strange loud pitched sounds that made me think that maybe it was screaming.   </p>\n\n<p>Well, that&#39;s all for now. I&#39;ll post more later in the week, I have a lot of things written down. Of course I&#39;ll be including the information from my brother, mother, and sister as soon as I get it. To those that messaged me with kind words, thank you for giving me the courage to explore this part of my past. Hopefully it will help me get the closure I need to get past it. </p>\n</div>\n","author":"RazTSlasher"}