{"rank":"4","title":"The girl by the by the sewer Pt 1","id":"8j99df","url":"/r/nosleep/comments/8j99df/the_girl_by_the_by_the_sewer_pt_1/","time":"1526268035000","body":"<div class=\"md\"><p><a href=\"https://www.reddit.com/r/nosleep/comments/8ji5hg/the_girl_by_the_sewer_pt_2/?utm_source=reddit-android\" rel=\"nofollow\">Part 2</a></p>\n\n<p><em>The Girl By The Sewer, Pt 1</em></p>\n\n<p>So, first of all, I live in a very populated area and nothing significant ever happens here. Especially not to me, but this was really weird to me.</p>\n\n<p>I live in a populated area of Georgia. I rarely ever see anybody on the side of the road or walking on the side of the road. But this was the first time I had seen someone on the side of the road. I go to school the same way everyday, and believe me when I say this, nothing ever changes. Until this one time.</p>\n\n<p>I dont know why, but I saw a girl. She seemed to be around 10-11 but something was off. I drove with my brothers down the same road, just like everyday, and then I saw her. She eyed me and her eyes peered into me like she could see right through me.</p>\n\n<p>I freaked out. Panic set in and couldn&#39;t tell why. Then I noticed something about her, She was covered in, what looked like, blood. Something next to her was spread out, organs of a small animal everywhere. A rabbit or a squirrel is what it looked like. I turned my head away, gagging. </p>\n\n<p>I got to school and I couldnt focus to save my life. Then in a small voice I heard say &quot;Sara..?&quot; I panicked. That girls voice, it seemed so real. \n My friends know I have anxiety and that I get anxious easily. It happens often. \nSo I went to the bathroom to calm down, that girls voice echoed, like my mind was a well and she was yelling into it. </p>\n\n<p>Her face and that sinister look on her face hasn&#39;t left my mind. She looked like she wanted to hurt me. Maybe I should tell someone but right now this is the only way I can vent about it.</p>\n\n<p>I don&#39;t know if it was my imagination, Or if I actually saw someone...or something? \nBut something weird did happen that night. I went to lay down and my dog was with me. I always keep my door closed. That night something was calling my name and it was scratching. Not regular scratching, it was like, what ever it was, was trying to get away from something and it needed to get inside.\nShould I try to help? I mean..it seems like I should try? right? I need help right now. I&#39;m wondering if I can look up anything to see something that happened around or in my area.</p>\n\n<p>I don&#39;t know why my brothers couldn&#39;t see her. Does she need my help? Does she want help?\nI&#39;m just sitting in my room. Typing this. trying to make some sense of this. is she real? Or was she a spirit? a vengeful ghost? Does anyone have any ideas? </p>\n\n<p>Since it is the weekend, I  haven&#39;t gone by the sewer but I will tomorrow. I will try to keep you updated. I don&#39;t know if I can. I&#39;ll try. But school might get in the way, and I don&#39;t know if I&#39;ll ever see her again. </p>\n\n<p><em>UPDATE</em></p>\n\n<p>I swear. I saw her at Kroger, this seems unlikely but it happened. I was getting out of the car with my brothers and she was sitting next to the cart area. I tried to ignore but she kept staring at me. Mumbling something but once I saw that I looked away. i was scared out of my mind.  I havent looked stuff up since I wrote this the first time. But I intend to, very soon atleast. Since this happened about a week ago, I hadn&#39;t seen much. I have been afraid of going anywhere. My parents have been super chill about me not going to school, since it&#39;s the last week. But that only made it worse. the hard thumps around my house. the loud banging on the door and the scratching have gotten terribly loud. Wait..its going again..the wailing..damn it.. I want to open it..Badly..I want to see.</p>\n</div>\n","author":"xxsomeonexx12"}