{"rank":"73","title":"I found a note at a crime scene in Toronto","id":"8j9i7i","url":"/r/nosleep/comments/8j9i7i/i_found_a_note_at_a_crime_scene_in_toronto/","time":"1526270773000","body":"<div class=\"md\"><p>Some of you may be aware of the horrible accident involving two young adults in Toronto last week, but most of you won&#39;t be. The police forced a cover up of the story. So if you weren&#39;t a witness, then you wouldn&#39;t know. Unfortunately, I witnessed the whole thing. I saw the girl fall 40 stories out of a condo complex East of the CN Tower and explode on impact with the ground. I saw the boy fall 10 minutes later from that same balcony. I was coming from the grocery store. I dropped my bags and ran to the spot where the two fell. It was horrible. Most of the girl was unrecognizable. I could distinguish some clothes mangled with blood and hair. Bones had been crushed to dust. She resembled a squashed bug and nothing like a human.</p>\n\n<p>But it was the boy who caught my attention. His torso had been completely obliterated. Only a pair of legs remained, stuck to the pavement. The reason why I&#39;m writing this story today is because I saw a note sticking from the pants pocket of his legs. The note was strange. It looked like it had been protected from any damage from the fall, and the handwriting looked professional. Not the look of someone who had subsequently jumped from a window.</p>\n\n<p>I am a long time Reddit user and have made a few posts in my day. The contents of this note unsettled me, and I don&#39;t want to immediately go to the police. I know <a href=\"/r/nosleep\">r/nosleep</a> is a supporting community for stuff like this, so I&#39;m going to share the note and I hope you guys can help me out:</p>\n\n<p>&quot;<em>This is the last will and testament of Jonas Roberts. I am writing this to clear my name, and to give my family and friends some context for what I can imagine will be a horrible shock. I am deeply sorry to everyone for everything I have done. Some things are irreversible. Some sins simply cannot be atoned.</em></p>\n\n<p><em>First, I just want to clarify that it was my girlfriend, Leah Nicholson, who needed to jump from that balcony. She was chosen and her fate was sealed. I begged her to come back down from the ledge. I told her we&#39;d figure something out. I think she was about to change her mind when she fell. I could see it in her eyes. When I saw her hit the pavement I knew I had two options: Face a lifetime of questions, court hearings, and the memories of her eyes, or jump and end my suffering early. I hope God forgives my suicide, even though I took the easy way out.</em></p>\n\n<p><em>Next, I want to explain the circumstances of her murder, because she was murdered in a way. We made the mistake of using Air BnB to book a trip, and wound up in a sketchy room with a guy who wouldn&#39;t let us leave. He told us that her soul was the property of the company. Something about not reading the terms and conditions. I don&#39;t know if this guy is human. His eyes are black and don&#39;t have any white or colour or anything. He would sit in the corner and not move for hours a day. We found him sitting there when we first entered the room, and tried interacting with him. We would say hi and he would just stare into the distance. It wasn&#39;t until the end of the trip that he started to move and talk. Leah told me he showed her horrible, unspeakable things. I watched as he whispered in her ear and she cried out in pain from the visions. He said she had to choose: death or enslavement. She chose death. The man tried to take her off the balcony but she jumped too quickly. He looked at me and then ran out the door faster than I&#39;ve ever seen a human run.</em></p>\n\n<p><em>Now I am alone. I will never see Leah again, or anyone for that matter. I want her family to forgive me for not taking better care of her. I want my family to forgive me for the pain I have caused them. Finally, I want the readers of this letter to forgive me for sharing this story. Leah told me not to, because it&#39;s through print that these things spread. I wasn&#39;t entirely sure what she meant, but I hope nothing bad comes to any of you. This sin cannot be atoned. I wish only for a peaceful afterlife.</em></p>\n\n<p><em>God Bless,</em></p>\n\n<p><em>Jonas&quot;</em></p>\n\n<p>Pretty weird huh? I hate vague notes as much as the next guy, so I tried to do some digging. The incident happened at 16 York St. in Toronto. Upon further inspection, Air BnB does not have any rooms available there. I thought that was weird, but not completely unexpected because the place they stayed did not seem like any of the completely registered Air BnBs I&#39;ve stayed in. But it gets weirder.</p>\n\n<p>I decided to Google 16 York St. to see what would come up. I thought at first maybe the pages were outdated, because it said that the building hadn&#39;t even been built yet. Unfortunately, that is the case. 16 York St. doesn&#39;t exist. It&#39;s just a construction site right now. I went back to the place where the incident happened and I couldn&#39;t find the building they fell out of. I could have sworn it was 16 York. How could a building just disappear? </p>\n\n<p>But this is the weirdest part: I don&#39;t know if I&#39;m just focusing too hard on this project or what, but I&#39;ve started to see a man in a suit with black eyes all over the city. He&#39;ll just be walking down the street, or in line behind me for coffee. I once saw him on my street, standing under a streetlight, as I was walking home from work one night.</p>\n\n<p>I don&#39;t know what kind of contract these kids signed was, or why it seems to have carried over to me. I&#39;m hoping to find answers though, before I end up splattered on the pavement.</p>\n</div>\n","author":"ExistentialPranks"}