{"rank":"9","title":"Repeat","id":"8j9vov","url":"/r/nosleep/comments/8j9vov/repeat/","time":"1526275196000","body":"<div class=\"md\"><p>My name is Adrian. I am going to die on December the twenty-second, in the year 2043, at the age of forty-five. My cause of death will be a skull fracture of the left temporal lobe and internal cranial bleeding.</p>\n\n<p>You do not need to know of what I am about to tell you; I am still going to explain to you why I know the information I have stated and how it is completely out of anyone&#39;s control.</p>\n\n<p>I die and reincarnate, but only in the same lifetime. I cannot explain how. It has become an endless loop that I believe chronologically proceeds along these lines:</p>\n\n<p>• On my 21st birthday, I get partially drunk, slam my head against a concrete slope and regain my inexplicable understanding of having &quot;lived&quot; multiple times before, only lacking the knowledge of the events leading up to my death each time (hereafter referred to as cognition)\n• I spend the next twenty-four years of my existence doing as I please; regardless of what I do, I survive until the date I am destined to die\n• The day turns to December the 22nd and I can remember nothing\n• Suddenly everything is dark and I am aware that I have a severe headache\n• I die\n• I am unborn\n• I gain full cognition two hours prior to my birth and am compelled to attempt to strangle myself with my umbilical cord, the result being lack of oxygen to my brain and near death\n• Assumably due to my lack of oxygen at birth, I lose cognition, but I live the first twenty-one years of my life harmlessly, in exactly the same way every single loop, down to the last time I bite my nails\n• Repeat</p>\n\n<p>Nothing of particular merit or unusualness occurs during the time I am incognizant between my birth and my 21st birthday, which leads me to believe that the cause of this phenomenon happens on the day of my death. I have no means to prove this theory. My amnesiac state on that day has been unavoidable, in spite of every effort on my part to prevent such an outcome.</p>\n\n<p>I am not asking for help. This message is not a plea. I know the suggestions I shall still receive in response to this post as to what is happening to me and the theoretical ways I could end the cycle, both harmless and non. There is nothing you can tell me that I do not know by now.</p>\n\n<p>For those wondering, this is not the first time I have written this post, but the phrasing has been altered somewhat to accommodate the variable factors that have changed in the past few loops.</p>\n\n<p>Yes, I have lost count of the amount of lives I have gone through. This one is perhaps the third most passive loop that I have started.</p>\n\n<p>Finally, no, I will not keep you updated on the progress of my &quot;life&quot; in this particular cycle, in any previous cycles, or tell you the future. As far as I am concerned at this point, time is a broken construct of the mind and space is all that there is.</p>\n\n<p>I will not respond to any further inquiries.</p>\n\n<p>This post is not for my sake, but for yours-- though ultimately, you will not be conscious of this knowledge when it will actually apply to you.</p>\n\n<p>This can not continue. In my next lifetime, I am not merely ending my existence, but all life as it will be known. This is the only way to stop the cycle. I need it to stop.</p>\n\n<p>I bid you to enjoy this loop. It will be your last. None of you will deserve such an end and I am sincerely apologetic. I wish it didn&#39;t have to come to this.</p>\n\n<p>Goodbye.</p>\n</div>\n","author":"Chocorrupt"}