{"rank":"37","title":"My property isn’t normal","id":"8j9y4o","url":"/r/nosleep/comments/8j9y4o/my_property_isnt_normal/","time":"1526276085000","body":"<div class=\"md\"><p>You could say i live in the middle of nowhere. I prefer to call it the middle of the wilderness though. And after living alone out here long enough, i thought i would become familiar with the land out here, and even get comfortable. But i never have gotten comfortable, maybe used to this place but never comfortable.</p>\n\n<p>Pretty sure i can hold my own out here for the time being, but even so, LOTS of weird shit happens out here. Glad to finally have a way to tell strangers who probably won’t judge or call me crazy though!</p>\n\n<p>Back to the topic at hand, weird stuff. I’ll start with the first odd experience i had here. When i first purchased this land i was really exited. There was already a house on the property that was the perfect size for me! Not only that but it seemed pretty new. Like the former owners didn’t stay around very long. Yea red flags but how was i supposed to know how messed up this place was. Anyway i move in without any issues and within a week I’m out on some of the trails that were already there, looking for deer tracks and other game trails. I’m actually having a pretty relaxing time until i swear i hear a baby say “momma” in the most stereotypical voice I’ve ever heard off in the distance. Now like i said I’m here in the middle of nowhere so there shouldn’t be anyone for miles. I just shook it off as me hearing things.</p>\n\n<p>Twenty minutes later i hear the same voice say momma again. Only this time it’s 40 yards away on the other side of some trees and brush. It didn’t even sound like a real baby, it just sounded like some disturbed dude. Of course at this point he is definitely on my property as well. I start making my way through the undergrowth, then when I’m sure I’m about to hit where he was the brush clears out to a clearing and i finally get a glimpse of the man. </p>\n\n<p>He was butt naked and halfway behind a tree, and flaunting a huge smile while his eyes stay kinda squinty. He was also pretty skinny as i could see his ribs. Now usually you hear people say that “at this moment my blood ran cold” but honestly, mine didn’t, i was looking at some butt naked crackhead trespassing on my property. He decided to let out another “momma”during silence when i was trying to figure out my next move, so i promptly responded with a hearty “WHAT THE ACTUAL FUCK ARE YOU DOING?” That’s when he decided my next move for me.</p>\n\n<p>He started running at me. And i might have run away, if he hadn’t been so scrawny. So when he reached me with that big smile, and looked like he was about to grab me... i punched him in the throat. It was a good punch. I was proud of it honestly, it would have kept any normal man on the ground for at least a minute. This is when i got the first hint that this wasn’t a normal man. While i was standing there, proud of my mike Tyson level haymaker. The guy immediately got back to his feet and before i had time to hit him again, he dive tackled me to the ground. And it hurt pretty bad. He somehow pinned my shoulders to the ground and no matter how hard i kicked and punched him, he wouldn’t let up. So i was forced to use plan b. </p>\n\n<p>I pulled out my trusty bear grills survival knife... and stabbed him in the gut twice. This finally got his attention. And he hopped back to his feel slinging blood all over me in the process. I got back to my feet, knife in hand and waited for him to do something else. All he did though was stick a finger in his wound, then lick the blood off. THEN CARTWHEEL INTO THE WOODS CRYING LIKE AND ACTUAL NEWBORN BABY THIS TIME. Now by this point i was pretty on edge. And right as he got far enough away that i could no longer hear him. I turned and walked home. I know i should have run, but running through the woods is so tiring and i just didn’t feel like it. When i got home all was normal again, for a while. </p>\n\n<p>Another story that comes to mind when i think about odd things happening around the area is the event that lead to me no longer camp in my woods. By the time that the events in this story took place, i had already experienced quite a few things on this property. And this was easily the third freakiest thing to happen up to that point, right behind the naked stab victim that cried like a newborn baby and cartwheeled our into the woods. This time i had decided that i wanted to go camping. Despite all the stuff that had happened, i had never been seriously injured in those woods, SO WHY NOT GO SLEEP IN THEM. Bad choice, i know. Anyways, the first few hours when i got into the woods went fine, i set up camp, build a fire, burn myself trying to cook a hot dog, piss on fire that burnt me. Then i started to realize... camping is pretty boring when you’re all alone. So i decided to go to sleep. </p>\n\n<p>Next thing i know i wake up to the sound of a young girls voice down in the creek, sounds like she’s college type age. She’s saying, “help i need some help down here, I’m lost, dad? Help!” And i can hear her down in the creek, from my tent. Now this isn’t the first time I’ve been lured into the woods by a voice pleading for help. But this voice was a lot more convincing than the others. Non the less i still brought my newly purchased .45 caliber hand gun that i had bought for dealing with, the things, on the land. </p>\n\n<p>I made my way into the creek, flashlight in hand and headed down to the voice. Soon i find the source. Now i didn’t put the flashlight beam on her right away because i didn’t want to blind her. But i could clearly see the outline of a small girl sitting on the bank of the creek, i got about fifteen feet away and she stopped me, stating that “you really don’t need that flashlight with the moon out like this”. It wasn’t even close to a full moon so that confused me a little, i replied with, “i don’t know bout you but i can’t see a thing out here, lemme me help you though, are you hurt?” Then i started to shine the flashlight on her but she screamed “STOP” before i got to her face. This time her voice wasn’t as convincing, i could tell she wasn’t human. </p>\n\n<p>Now, what you guys need to realize is that I’m not a badass, and I’m not trying to sound cool or tough. But ever since something happened three years ago. The same event that caused me to move out here. I don’t respond to situations the same anymore. Maybe I’m not scared of death anymore. Maybe I’m mentally unstable. Maybe I’m weird. But when i establishes that this thing wasn’t human, i started to smile, it fooled me, got me out here in the woods, in it’s domain, and was probably going to make an attempt on my life. But i might as well piss it off a little. So i flicked my flashlight up and revealed its face. </p>\n\n<p>It actually was a girl, sort of, she was super pale and had abnormally large eyes, that were completely black. When the light hit her face her head snapped forward and made eye contact with me and her jaw dropped open 3 times larger than any human could, and then she screamed. It was LOUD. Like inhuman loud. It sounded like a girls scream but as if it were being played through massive speakers to make it ear splitting. Then i felt something closing around my neck. She hadn’t moved but was somehow choking me. Still screaming.</p>\n\n<p>I have realized while living here that the entities that can hurt you, can also get hurt themselves, now most of them are tough as nails, but they can be hurt. This memory went through my head just as i felt something warm dripping onto my neck and my left ear went quiet. Busted ear drum. I aggressively threw my flashlight at the bitch and it connected with what i assume was her eye, i couldn’t tell for sure because i didn’t have a flashlight. And yes i forgot to use the gun. It was new and in the current life or death situation i forgot i had it. Luckily this girl wasn’t one of the tough ones and i felt the grip on my neck loosen and her scream stopped. No sooner had i taken my first breath when she bent over backwards possession style and sprinted into the woods in reverse. When i finally caught my breath i slowly walked by to my campsite and went to sleep in the tent. </p>\n\n<p>You may be asking why i didn’t go back home after that but it was a 20 minute hike and my flashlight was broken so i had to wait till morning. Slept pretty good though. No noises woke me up.</p>\n\n<p>I woke up then next morning expecting my ear to be killing me but miraculously it was completely back to normal. I later figured out that it was the lady in the tree who fixed my ear but that’s a story for another time. That morning i just packed up everything and headed back home. Only thing that got messed up was my flashlight so i wasn’t even that disappointed in the trip. I still don’t camp out there anymore because no matter how weirdly wired i am, that girl really did freak me out a good bit, and I’m sure she’s still out there. </p>\n\n<p>What you will notice so far is that these entities aren’t really very effective killers. But that doesn’t go for everything out here. I can’t tell y’all about the property without mentioning skinny. Fuck skinny.</p>\n\n<p>I understand that skin walkers are a common topic on the horror scene at the moment and from what i can tell i think that’s the creature I’m dealing with. But i could also be wrong, because if this is a skin walker it’s advanced to another level. Not only does it imitate voice. It imitates appearance. And it really wants me dead or gone.</p>\n\n<p>I like to call it skinny, i think it pisses him off though. And when i say his name, i say it loud, because especially at night, i know he’s listening. I’ve lived here for three years now and he’s been harassing me for about a year. And he’s good. One of the smartest things to come after me so far. The only one that can seem to almost get in my head. He tries to lure me out not by pretending to be someone in trouble like other imitators that I’ve dealt with before. He’s aware that that stuff doesn’t work on me anymore. No, he tries to piss me off. He wants me to try to kill him. The problem is we both know i probably can’t. </p>\n\n<p>One time he got me though, i was watching a documentary about veteran suicide. It’s a terrible topic. I’m a supporter of our armed forces, and i think it’s terrible that our government doesn’t take better care of the vets that risk everything overseas so we don’t have to. They were doing a slide show of men how had unfortunately lost the struggle with their own demons. I had to look away for a second because this one guy that appeared on the screen looked to young and happy to have gone to this dark of a place. He was mixed race from what i could tell, Athletic looking, and had a big dimpled smile on his face. When i look away, I’m suddenly staring at the same kid... outside my window. Same smile. Same build. Same uniform. One difference. Across his forehead was the word “Failure”. I instantly knew it was skinny. He wasn’t trying to imitate this kid, he was insulting him. And he finally struck a nerve. I had seen him imitate so many other people, and try so many other tactics, but this was the one that finally broke me. I was ending this creature.</p>\n\n<p>I exploded out of my chair and bolted for my bedroom. Grabbed my 45 caliber handgun and proceeded to walk towards the same window the young soldier was still staring through. I got within five feet and saw that the word had changed. It now spelled out “i deserved it” after reading this, i didn’t hesitate to raise my gun and fire two shots. But i think he ducked them. Bastard is fast. \nI stormed outside to try to find him but he wasn’t anywhere to be seen.</p>\n\n<p>That’s when i hear, “gotcha” whispered into my ear and i was flung against the wall of my house. The gun flew out of my hand in the process. Broke two ribs and dislocated my right shoulder. I was a dead man. And he knew it. </p>\n\n<p>Ever since the incident that lead me to buy a house by myself out in the middle of the woods, I don’t think I’ve ever felt fear again. Something is wrong with my head. But i did feel defeat. I fell for his trap. And now he’s going to kill me. As these thoughts passed though my brain, i passed out from the pain. And the concussion probably. Then, for some reason that i still don’t understand, i woke up. It was bright outside and i was covered in blood and in more pain than i had ever been in in my entire life. But i was alive. Why was i alive? I struggled to stand up with my right arm hanging loosely at my side. And i soon noticed the words carved into the outside wall of my house. “Next time”. Fuck skinny. </p>\n\n<p>Ever since i got back from the hospital (i told the doctors i fell off of a roof) I’ve been trying to find ways to deal with, or kill a skin walker, if there is a way, or if he’s even a skin walker. He beat me. I’m usually pretty lighthearted with most of my experiences no matter how intense they are. But i just can’t with this one because if i lose to skinny again. I guess i will be signing off for good. Be careful out there. And don’t be fooled like me. There isn’t always a next time. </p>\n\n<p>BUT HEY, not dead yet, so maybe There will be a next time. I plan on writing down more of my experiences in the future so keep your eyes peeled for those. Until next time. \nCole signing off\n<a href=\"https://www.reddit.com/r/nosleep/comments/8jo10u/my_property_isnt_normal_part_2/\">Part Two</a> </p>\n\n<p><a href=\"https://www.reddit.com/r/nosleep/comments/8khkip/my_property_isnt_normal_part_3/\">Part Three</a> </p>\n</div>\n","author":"Murderbird17"}