{"rank":"8","title":"I know its real","id":"8jaxmc","url":"/r/nosleep/comments/8jaxmc/i_know_its_real/","time":"1526290030000","body":"<div class=\"md\"><p>Sleep paralysis is completely normal especially if youre very tired yet Despite being told by my peers in my psych class of how I should dismiss these happenings as just sleep paralysis. That I should be silly to think that THEM or these creatures I repeatedly see are &quot;real&quot;however let me share an experience with you and tell me what you think.</p>\n\n<p>My sister just got back from her retreat (3 days, requirement from our catholic private school at this Retreat house in a village far from city grounds. I was next but that would be in a few months). When she got back I was ecstatic because we had catching up to do, but decided on talking in the morning as she was tired and I was tired. Being the lazy bum I am, I decided to sleep on the living room couch which is long and comfy as hell. Midst me half-way falling asleep I feel someone moving behind me and moving the couch cushions.</p>\n\n<p>It irritated me that someone had the nerve to keep shuffling about behind me whilst I sleep. Irritated I said &quot;What the hell? Stop moving around and pushing the cushions about&quot; I craned my neck a bit and noticed the person doing it was my brother.\nYet he wasnt my brother, or rather IT wasnt. This thing, it was a pale little boy with dark circles under his black holes which I presumed to be his eyes and these blood red lips or lines or what served to be &quot;lips&quot; and its when my heart stopped. My brother wasnt even at home that week he was with my uncle and cousins sleeping over. My whole world turned black, and the surrounding air felt cold. I tried moving and calling for help, feeling all air leave my lungs and my heart feeling a burn - as if Im having a heart attack at that moment.</p>\n\n<p>Suddenly my sister came rushing down and told me &quot;Hey why dont you sleep in my room tonight?&quot; I quickly said yes and we were walking upstairs, it was then I noticed why is the house in a darkish blue hue? and since when did my sister invite me into her room when Im practically banned from entering let alone sleeping.</p>\n\n<p>It was then that I noticed she stopped moving and was just standing with her back turned to me.</p>\n\n<p>I couldnt move</p>\n\n<p>I couldnt speak</p>\n\n<p>I could feel the tears rolling down my cheeks and her head slowly turned and it was no longer my sister with her long brown curly hair, brown eyes and tanned skin with freckles scattered across her face. No it was them.</p>\n\n<p>A tall pale skinned woman who was naked, had red lips and black gaping holes serving as eyes. Her arms extended towrds mine and its when I felt breath behind me and near my ear that there were more of them.</p>\n\n<p>They never spoke but their actions were deafening to my ears, the stares killed me bit by bit and I tried ever so screaming for help. I wanted my mom. I wanted my sister, I wanted my brother oh dear I wanted anyone, just away from these pale bald creatures</p>\n\n<p>Suddenly I woke up, just when I thought I couldnt take it anymore I woke up. My boyfriends face inches from mine asking if I was okay. I was so grateful at that moment for him. I hugged him for the life of it. We were at home in my room, it was 3 am according to the clock near my bed. I was about to ask him what he was doing at my house when I realized, my boyfriend is out of the city. He wont be back until next week. My heart dropped cold The surrounding light turned a darkish blue hue and the air turned cold. I could see them</p>\n\n<p>I COULD SEE THEM</p>\n\n<p>THEY WERE BY THE WINDOW, BESIDE ME, IN FRONT OF ME ABOVE ME</p>\n\n<p>EVERYWHERE</p>\n\n<p>THEY WERE THERE</p>\n\n<p>TRYING TO TAKE ME WITH THEM</p>\n\n<p>I SCREAMED, I TRIED SCREAMING I COULDNT SCREAM</p>\n\n<p>i couldnt move, I could do nothing but I didnt want to give in</p>\n\n<p>I dont want to go with them</p>\n\n<p>I couldnt</p>\n\n<p>I wouldnt</p>\n\n<p>My mom found me screaming downstairs in the living room on the couch with my back arched up and head rolled back my hands balling into fists as if I was posessed (imagine the conjuring or exorisist thats me af) and im sweating and crying and she kept trying to wake me up but and Im so glad she did wake me up by pushing me because had she just verbally done it I dont think I wouldve made it.</p>\n\n<p>Its been a reoccurring theme, my so called sleep paralysis involves these pale white beings that are bald with big black holes in their faces serving as eyes and red lipstick. There are women, men and children and are always naked and always reach for me as if trying to grab me and drag me.</p>\n\n<p>This always happens when I notice a glitch in my dreams which dont even seem like dreams sometimes but utter reality.</p>\n\n<p>I cannot sleep without praying</p>\n\n<p>I cannot sleep without someone being in the same building as me for safety purposes.</p>\n\n<p>I have drawn them, I have been told this is not merely sleep paralysis by my grandmother and the witch doctor. Something more sinister lies behind these pans of tiredness and I feel like the common term of sleep paralysis serves as an excuse for these things happening to me. Especially with how real it feels and the fact that my mother saw me in an arched position.</p>\n\n<p>I am going to see the witch doctor tomorrow and consult people who have known me growing up and have been with me during those years. Deep down THEM, those creatures I believe they want me for a reason, but I don&#39;t know what reason it is. </p>\n\n<p>I feel like they want me while I am at my weakest, while I am very tired. I am not going crazy, this is real. This is more than &quot;Sleep paralysis&quot;I dont even think it is, but people think it is. Im scared</p>\n\n<p>Helpp</p>\n\n<p>I want to sleep but I am tired.</p>\n</div>\n","author":"peachylenny"}