{"rank":"25","title":"More than Snakes and Spiders on an Australian Mine Site (Part 3)","id":"8jb2ng","url":"/r/nosleep/comments/8jb2ng/more_than_snakes_and_spiders_on_an_australian/","time":"1526292000000","body":"<div class=\"md\"><p>Sorry about the time between last post things have been full on. If you haven&#39;t already please read previous parts.</p>\n\n<p><a href=\"https://www.reddit.com/r/nosleep/comments/8hmm65/more_than_snakes_and_spiders_on_an_australian/\">Part 1</a></p>\n\n<p><a href=\"https://www.reddit.com/r/nosleep/comments/8hvsz3/more_than_snakes_and_spiders_on_an_australian/\">Part 2</a></p>\n\n<p>My feet were pounding along the ground. Red dirt being kicked up violently. I hear Joey’s panting next to me. I don’t look at him though.</p>\n\n<p>There is something primal in running for your life. Everything kind of just happens. The door to the tool shed was the only focus in my vision everything else faded into the background. My only thought, my only goal, was getting to that door. It may have only been thirty meters away or so but it sure as hell felt like a mile.</p>\n\n<p>I wasn’t far from the door when I heard the shot. All of a sudden a third pair of footfalls could be heard slightly behind us. Slowly they were getting louder but my focus didn’t falter once. Finally making it to the door both Joey and I pile into the trailer shutting and locking the door behind us obviously just in time.</p>\n\n<p>“Fuck doing that again… Merv even know how to use that fucken rifle… or does he just hold it cause he thinks it makes him look cool?” Joey said between breaths.</p>\n\n<p>“You’re not dead so quit your bitching ok.”</p>\n\n<p>The trailer was a mess like always which was mine and Joey’s fault as Merv was always hounding us to keep a clean organized area. Tools were strewn everywhere covering desks and racks with no order or system apparent. That was when it hit me that I couldn’t remember where we had stored the radio as it never got much use from Joey or I.</p>\n\n<p>I began digging threw everything. I was throwing tools aside not caring how much sound I was making. This thing knew we were in here and if it wanted to bust through the door there was nothing I could do, so I just needed to focus getting this radio so we could get the fuck out of here.</p>\n\n<p>Through the loud bangs of metal tools hitting shelfing I heard a mumble come from Joey’s direction.</p>\n\n<p>“James, I don’t want to die man.” I stopped turning to face Joey.</p>\n\n<p>Even when he and I had gotten ourselves into stupid situations before his give no shit attitude had never faulted. I had never seen the look of fear on his face and it was discomforting. I walked up to him placing both my hands on his shoulders</p>\n\n<p>“We aren’t gonna die man. We are gonna find this radio and we are gonna call main camp. We are gonna get them to send a fucken army out here. Then we are going to go home and you are going to use this story to pick up whatever poor girl is going to fall for your bullshit. Do you understand me?” I tried saying with the most conviction I could muster.</p>\n\n<p>He chuckled while looking down at his feet “Yeh I understand.”</p>\n\n<p>I gave him a hug. “I promise you mate. You will not die while I am still breathing.”</p>\n\n<p>I began ruffling through everything again, Joey finally joining me. I was cursing myself that we didn’t keep this place better organized.</p>\n\n<p>“I found it! Thank Fuck! I fucken found it!” Joey screamed jumping up and down like a little girl who got the Barbie doll she wanted Christmas morning.</p>\n\n<p>“Main camp, come in…”</p>\n\n<p>Nothing.</p>\n\n<p>I snatched it off him “Fuck sake come on is anyone there? Fucken answer.”</p>\n\n<p>“… You’re meant to say over fuckwits. Over.” A reply, thank god.</p>\n\n<p>“This isn’t the fucken Special Forces! We are being attacked by some fucked up manner of God’s abomination. You need to send someone to Drill site 4 now and get us the fuck out of here. Fucken Over.”</p>\n\n<p>“… A what? Can you repeat that? Over.”</p>\n\n<p>“We are being attacked by something! Just get us the fuck out of here now! Over.”</p>\n\n<p>“…Attacked by what? Over.”</p>\n\n<p>“It doesn’t fucken matter just send someone out to grab us now it’s a fucken emergency!” I was losing it.</p>\n\n<p>“…Okay, Okay. I have informed my supervisor now. He is contacting departments and sending a team out to you now. Make sure you stay together and in the trailers. Keep this on you and use it to keep me updated on your situation. Over.”</p>\n\n<p>“Thank fuck, how long till they arrive? Over.”</p>\n\n<p>“… ETA is said to be about three hours, we are moving as fast as possible. Over.”</p>\n\n<p>“Thank God.” With that I put it in my pocket.</p>\n\n<p>“See Joey told you we would be fine.” I said turning to Joey grinning.</p>\n\n<p>“Not out of it yet man, we need to try and make it back to the original trailer, least we can use these as proper weapons.” He pointed to a couple of sledge hammers up against a wall, “Lot better than a fucken frying pan.”</p>\n\n<p>“Yeh but how-“</p>\n\n<p>I stopped because all of a sudden I could hear the door knob rattle. I looked at Joey he had this look of panic plastered on his face I have no doubt I mirrored.</p>\n\n<p>“Don’t worry Joey. It’s locked. We are safe in here.” I muttered unconvincingly never removing my eyes from the handle.</p>\n\n<p>He didn’t even acknowledge me. He just stood motionless staring at the door muttering something to himself which I couldn’t hear.</p>\n\n<p>Then all of a sudden that soft subtle scratching turned into Slamming. Both I and Joey slinked backwards towards the opposite side as far away from the door as we could possibly get. Trembling with every step we took. Not once faltering in our focus on the door.</p>\n\n<p><em>Bam - Bam - Bam.</em> Over and over again this thing was throwing itself against the door. I was standing there coming to terms with everything. That moment I realized that Joey and I may actually die. The wood of the door started to splinter as this thing continued its assault. The door wasn’t going to hold much longer.</p>\n\n<p>As the door was nearly obliterated this thing halted its assault. I didn’t understand why as the door was nearly destroyed, it nearly had us. Three sharp knocks rang out followed by a voice invading my ears.</p>\n\n<p>“<em>leeeeeet… usss… Innnn…</em>” It was toying with us.</p>\n\n<p>I wish to never hear that voice again for as long as I live. The voice came across like a child who was just learning to construct sentences. The voice was raspy with a menacing tone behind it. The voice made this thing all that more terrifying. The evil that dripped from the voice nearly made me give up there and then.</p>\n\n<p>All of a sudden another shot rang out. This time though it was followed by a howl of pain. Rushing to the window with Joey we glimpsed this thing retreat towards the darkness surrounding the lab on the other side of camp.</p>\n\n<p>“I love that man. Have I ever told you that? I really do fucken love that man.” Joey grinned. Looking like he was feeling like his hopeful self again.</p>\n\n<p>“Sure he would love to hear that from you. What do you say we get back there at let him know while we have an opening?”</p>\n\n<p>With that we approached the door, slowly opening it. I kept my eyes out on the other side of camp where this thing ran off towards. Confident the coast was clear for now we began running.</p>\n\n<p>I caught a glimpse of it exiting the darkness as we were out in the open. A black oily fluid dripped from a painful looking injury on its side. It had this furious look on its face which couldn’t mean anything good for Joey or I if it got it’s claws on us. Seeing it we both began to pick up our pace running for our life’s another time that night.</p>\n\n<p>As we started to approach the trailer where safety beckoned us things took a horrible turn. I caught a glimpse of this thing clambering on top of the trailer making its way above Merv who was now standing at the door preparing to take a shot behind Joey and I.</p>\n\n<p>It was impossible. We were being chased by this very thing I was staring at right now. There was no way it could’ve made it there that fast. Even if it had why was Merv still aiming behind Joey and I? That was when it dawned on me that we had not only been facing one of these creatures tonight but we had been facing a pair.</p>\n\n<p>“MERV WATCH OUT!” I screamed, but it was too late.</p>\n\n<p>It pounced on top of him. It began tearing into his flesh in a flurry of claws. The screams, god the screams, they were almost as bad as the gurgling that came after as we charged in.</p>\n\n<p>“Get off him you fuck!” Joey charged, raising his sledge hammer bringing it down with force on the back of this creature’s skull. The back of its skull shattered inwards from the impact of the hammer as if it were glass. It made a slight shriek as it raised its hands clumsily to the back of its head before finally going limp, falling forward on top of Merv.</p>\n\n<p>I turned facing the other one, which was now fast approaching. At the sight of its fallen partner it made a pitiful howl as it increased the speed of its advancement.</p>\n\n<p>“Fuck my hammers stuck, I can’t get it out” I could hear Joey struggling behind me.</p>\n\n<p>This thing barrelled straight towards me where last minute I lifted the hammer attempting to plummet it into this things face. Using all my might I closed my eyes as I slung the hammer down with a chesty roar escaping my mouth. I felt the hammer come down on solid ground. Opening my eyes I see the hammer has kicked up a puff of red dirt. I turned to my right just in time to see a white claw fast approaching.</p>\n\n<p>I flew back into the trailer. Feeling the collision vibrate through my bones I slowly slid down the side of the trailer till I come to a seated position up against it. I start to see stars while it was getting darker on the outskirts of my vision. Through the haze in my vision I can see this creature stand onto its two feet and began slowly making its way towards where I laid defeated.</p>\n\n<p>“Get away from him!”</p>\n\n<p>I see a much smaller shape collide with the creature. Joey had given up on trying to collect the hammer and had somehow managed to bring this thing to the ground.</p>\n\n<p>“You fucks killed Merv! You aren’t killing my best mate!” He screamed into its face as he landed blow after blow with just his fists.</p>\n\n<p>For a moment it looked like it may all be over, Joey may be able to win this. Well that’s what I thought until I saw the claw go across Joey’s chest.</p>\n\n<p>“Arghhh!” Joey slumped off the thing. He was lying face down in the dirt moaning. He had clearly taken some damage from that hit and wasn’t in great shape.</p>\n\n<p>It got up slowly with that twisted grin on its face. It didn’t look injured at all besides the bullet wound in it’s side. Grabbing the back of Joey’s collar lifting his upper body slightly off the ground it began walking away from the carnage.</p>\n\n<p>“Get out… of here… James…” Joey mumbled as it began walking into the night with him.</p>\n\n<p>Falling too my side I came face to face with Merv’s corpse. Blood was steadily flowing from the wounds in his neck giving his skin a ghostly pale tone. The only thing in his eyes being the frozen terror he experienced before his life had been brutally ended.</p>\n\n<p>That was the last thing I saw before consciousness evaded me.</p>\n\n<p><a href=\"https://www.reddit.com/r/nosleep/comments/8jtsu6/more_than_snakes_and_spiders_on_an_australian/\">Part 4</a></p>\n</div>\n","author":"Korijay"}