{"rank":"4552","title":"I Was Fucking Fat","id":"8jbgth","url":"/r/nosleep/comments/8jbgth/i_was_fucking_fat/","time":"1526296943000","body":"<div class=\"md\"><p>I was fucking fat. </p>\n\n<p>I wasn’t pudgy, portly, or stout.</p>\n\n<p>Showers were unsightly affairs that found me working vigorously to scrub every crevice. I’d use my left hand to pull back a roll, then my right would dig into the fleshy folds to wipe away the unholy tendrils of dirt and dried sweat that had accumulated within. The ordeal would take over an hour.</p>\n\n<p>That’s why I never showered more than once every three days.</p>\n\n<p>Plus, you know – the shame.</p>\n\n<p>And I’d heard it all. “Why don’t you just take better care of yourself?” “Do you want me to help you?” “How did you let it get this bad?”</p>\n\n<p>There were the looks, as well. Sideways askance glances would pull faces in my direction as I walked by, as though invisible fishing lines attached themselves to every wandering eye. Those strings would pull taut when people thought themselves to be out of my view.</p>\n\n<p>I saw them all.</p>\n\n<p>There’s simply no way to articulate the powerlessness that comes with morbid obesity. The path to “normal” is <em>so fucking long.</em> Each step is agonizing when exercise is constant pain and food is the <em>only</em> good thing in life. </p>\n\n<p>Imagine that the world expected you to hold your breath for a year. How many times would you try before failing yet again?</p>\n\n<p>Food was the sweet ambrosia that made getting out of bed worthwhile.</p>\n\n<p>And I knew it was going to kill me.</p>\n\n<p>*</p>\n\n<p>“Janelle, You’re going to be getting ready for college this summer,” Mom claimed nervously. “You don’t want to spend a week on a cruise with your <em>mother.</em>”</p>\n\n<p>I rolled my eyes. “I think I’m a pretty good judge of what I want, Mom. Besides, it will be one last fun thing we do before I move out,” I offered a wan smile.</p>\n\n<p>“But what if <em>I</em> want to have fun?” she snapped. Mom rested her fingers on her lips in shock, realizing that her words must have cut me far deeper than she had planned. “I mean, I <em>would</em> want us to have fun….” She stared at the ceiling awkwardly. “I don’t want you to have to deal with my embarrassment every time you wear a swimsuit.” </p>\n\n<p>A painful silence ensued. </p>\n\n<p>I didn’t go with her on the cruise.</p>\n\n<p>*</p>\n\n<p>With the house to myself, I spent a lot of time crying.</p>\n\n<p>And yes, I binged. But answer this: if I <em>truly</em> had no hope of losing the weight, what was the point in regulating my food intake at all?</p>\n\n<p>It came to a head when one day that week when I looked back on what I’d accomplished since waking up. An open bottle of vitamins lay on my desk, but I hadn’t taken one. 9:13 p. m. was illuminated on my clock, and I reflected on what I <em>had</em> consumed throughout the day. Most of the dishes and boxes were still in my room festering in a hopeless heap of garbage.</p>\n\n<p>One dozen store-bought powdered doughnuts; six fried eggs, along with eight strips of bacon; a two-liter of Coke; three fun-size Snickers; three king-size Milky Ways; a microwave turkey dinner with mashed potatoes and gravy; two triple-meat What-A-Burgers (Florida’s finest restaurant); one chocolate milkshake; one vanilla milkshake; a whole key lime cheesecake from the Publix; one canister of Original Pringles; one canister of Sour Cream and Onion Pringles; six Eggo waffles (with real maple syrup); a homemade BLT with extra mayo; a bag of cracklin’ pork rinds; and a glass of water to feel healthy.</p>\n\n<p>I tried to imagine my life past the age of thirty. Nothing came to mind. </p>\n\n<p>My crying became apparent only when the computer screen was too blurry to read. I suppose that I’d been silently weeping for most of the day, and had become so used to it that I was totally unaware of the action.</p>\n\n<p>I searched for extreme answers. And if there were a possibility of an over-the-top, unimaginable approach, it existed in the untamed wilds of the internet. </p>\n\n<p>Thank God for Reddit. One year ago, I found my answers there.</p>\n\n<p>“Let’s be honest. I was going to eat myself to death, and sooner rather than later,” one commenter wrote. </p>\n\n<p>That sure as shit caught my eye. </p>\n\n<p>“I needed an extreme solution. None of the bullshit that I was being offered was anywhere close enough to save my life. I weighed 573, and was gaining two pounds per week. BW <em>fixed everything.</em> This is NOT for people looking to lose a few extra belt sizes. This is extreme shit designed for people who have no fucking hope. Do not mess around with this.”</p>\n\n<p>My heart fluttered, which was physically painful.</p>\n\n<p>“The (non-monetary) price is steep enough that you’ll only pay if you have nothing to lose.”</p>\n\n<p>That caused me some concern. I reached for my keyboard so that I could leave the website when my oversized forearm sent a torrent of What-A-Burger wrappers and Pringles cans cascading onto the floor. </p>\n\n<p>I knew I didn’t have the energy to pick them up. And when I went to type in the address once more, my fingers slipped ten times due to their swollen girth and semi-permanent coat of burger grease.</p>\n\n<p>I decided to stay on the page and read a little more after all. </p>\n\n<p>“If your life is so miserable that you don’t care whether you live or die, then what have you got to lose? If you saw just one day of what things <em>could</em> be, don’t you believe that you’d take the fresh start? Don’t you believe that there has to be a Better Way<sup>TM</sup> ?”</p>\n\n<p>It might have meant selling my soul. But in that moment, I truly didn’t care. I imagined Mom coming home and discovering that I was missing or dead, and I felt nothing.</p>\n\n<p>That’s how I knew that it was time.</p>\n\n<p>*</p>\n\n<p>For the first time in years, I did not fall asleep immediately upon laying down. </p>\n\n<p>I was nervous.</p>\n\n<p>They’d requested my name and address, but no credit card. Isn’t that odd? I’d been skeptical at first, but figured that it would only have been a scam if they had some way to access my mom’s bank account, or possibly even mine. The thought of someone sneaking into my room and having his way with me caused me to laugh aloud.</p>\n\n<p>The sudden sad smile that I felt was the only thing to remind me that I’d once again been crying.</p>\n\n<p>*</p>\n\n<p>I awoke to a splitting headache. As usual, my body did not want to get out of bed.</p>\n\n<p>But I was dizzy. I was uncomfortable. And I was cold.</p>\n\n<p>I sat up and tried to get my bearings, but the world felt liquid. There <em>almost</em> no light. And there was no bed. Why was there no bed?</p>\n\n<p>I realized that I was cold because I was naked. I would have wrapped myself into the fetal position if my stomach fat weren’t preventing such an option. My entire abdomen burned. I grabbed at my belly, sliding my hands through the layers of fat and skin in search of the source. </p>\n\n<p>After a minute of frantic seeking, I found a metal ring. I traced it all around the innermost layer of my rolls; it surrounded and squeezed me. </p>\n\n<p>Attached to the back of the ring was a heavy metal chain. My hands began to shake as I traced the chain to the wall behind me, where it was embedded into the concrete. I pulled on it, then yanked, then frantically thrashed. </p>\n\n<p>Panic overwhelmed me.</p>\n\n<p>And then it passed, as all things do.</p>\n\n<p>My breathing slowed, and I began to analyze.</p>\n\n<p>If… whoever it was wanted me dead, it would have already happened. They needed me for something. </p>\n\n<p>It served to reason that I would be expected to know what that purpose was. </p>\n\n<p>I felt around the floor. What little light there was shined through a crack just brightly enough to illuminate a few inches of the wall, which actually made it harder to see everything else.</p>\n\n<p>My hand wrapped around a cool cylindrical object. I brought it closer to me and felt it carefully.</p>\n\n<p>It was a plastic bottle of water. I set it aside and kept looking. I found nothing.</p>\n\n<p>Panic was rising once again in my chest. I couldn’t block the image of excited Coke shooting to the top of a shaken bottle.</p>\n\n<p>Then I found the note.</p>\n\n<p>It was folded neatly, just at the edge of my grasp. I unfolded it with shaking hands, scooting toward the sliver of light that was splashed upon the wall. </p>\n\n<p>“A pound of fat contains 3,500 calories. An immobile person will burn 1,500 calories per day.</p>\n\n<p>“There is a <a href=\"https://www.reddit.com/r/NoSleepInterviews/comments/8jc5zt/may_14th_2018_byfelsdisciple_interview_part_1_of_2/\">Better Way</a>.”</p>\n\n<p><a href=\"https://www.facebook.com/P-F-McGrail-181784199029462\">FB</a></p>\n\n<p><a href=\"https://www.reddit.com/r/ByfelsDisciple/\">BD</a></p>\n\n<p><a href=\"https://www.reddit.com/r/nosleep/comments/8jku53/i_was_fucking_fat_part_2/\">Part 2</a></p>\n\n<p><a href=\"https://www.reddit.com/r/nosleep/comments/8k3jty/i_was_fucking_fat_part_3/\">Part 3</a></p>\n\n<p><a href=\"https://www.reddit.com/r/nosleep/comments/8kcxjv/i_was_fucking_fat_part_4_final/\">Part 4</a></p>\n</div>\n","author":"ByfelsDisciple"}