{"rank":"253","title":"Canadian Paranormal Encounters: Panic at Manic-5","id":"8jblkr","url":"/r/nosleep/comments/8jblkr/canadian_paranormal_encounters_panic_at_manic5/","time":"1526298438000","body":"<div class=\"md\"><p>We all know everything on NoSleep is true, but sometimes it’s hard to believe someone when they&#39;re a 15-year-old girl one week and suddenly a 45-year old father of three the next. That’s why I wanted to do something different. Over the past couple of months, I’ve been putting out feelers to friends, family, colleagues, and even strangers to collect and share real paranormal encounters they’ve experienced here in Canada.</p>\n\n<p>It’s been a little tough-going because I tend to be pretty shy out there in the real world, and it can be awkward to ask strangers if they’ve ever seen a ghost, but I was really surprised by the positive reception and people’s openness to discuss the topic. Turns out, if you ask around, almost everyone has had <em>some</em> sort of paranormal encounter or another they’re willing to share. (They’re not all super interesting, though.)</p>\n\n<p>With their blessing, I’ll be relaying their stories to you in this series entitled <em>Canadian Paranormal Encounters</em>.</p>\n\n<p>Quick note, I typed up these accounts in the third person because it felt weird to write in the first person, given they happened to other people. I know it’s not the norm on NS, but it makes more sense to me.</p>\n\n<hr/>\n\n<p>This first story comes from my mother’s cousin, Jean-François, who worked at one of Québec’s largest hydroelectric dams back in the early 1970s. He was hired by Hydro Québec as an engineer, and his job mainly involved patrolling the Manic-5 powerhouse, checking the valves, maintaining the turbines, making necessary repairs – that kind of stuff. He was never <em>alone</em> at the facility, but the workforce was fairly small, so he’d often go hours without seeing anyone else.</p>\n\n<p>Before I begin his story, I just want to put things into context. If you already know how hydroelectric dams work, feel free to skip this explanation. If you don’t, here’s the tl;dr version:</p>\n\n<ol>\n<li><p>Build a big ‘ol wall on a river – in this case, the Manicouagan River – to create an artificial lake.</p></li>\n<li><p>Build a powerhouse with turbines nearby downstream.</p></li>\n<li><p>Funnel water towards the top of the powerhouse and use the awesome power of gravity and water pressure to spin the turbines, which generates electricity.</p></li>\n<li><p>HARNESS THE ALMIGHTY POWER OF ELECTRICITY.</p></li>\n<li><p>Dump the water back into the river at the bottom of the powerhouse.</p></li>\n</ol>\n\n<p>The cool thing is, if the river has a good enough flow and is long enough, you can build multiple hydroelectric dams on it and keep juicing that same water for all its worth! Hence, the name of the powerhouse Jean-François worked at: Manic-5. ‘Manic’ for the river (Manicouagan), and ‘5’ for the dam number. <em>Technically</em>, due to circumstances I’m not going to get into here, Manic-4 was never built so Manic-5 is actually the <strong>fourth</strong> dam on the river, but that’s not really important here.</p>\n\n<p>Explanation over. On to the story.</p>\n\n<p>Manic-5 had only been running for a few months when Jean-François was hired, and Hydro Québec was having trouble staffing the powerhouse. He figured it was due to the dam’s remoteness: it was about 3-4 hours away from civilisation, with only one lonely road to and from. The distance made it impractical to commute, so the staff would spend the entire week at the facility and swap out with a second crew every other week.</p>\n\n<p>On the phone, Jean-François recounted the first time he drove up to the dam. He described it as a massive concrete behemoth peeking out from above an ocean of trees, like the outer wall of a castle that didn’t exist. It had a weight to it that went beyond that of its building blocks and the water it held back. He felt like it was watching him. The wall was the only thing between him and a flood of water that would wash him away forever. A guardian, a tombstone. The powerhouse was so close, if anything were to bring down the dam wall, he’d have just enough time to know death was coming, but not enough to run. I guess you could liken it to living under a volcano.</p>\n\n<p>He was paranoid the dam wouldn’t hold. He inspected it every chance he got, searching for fissures and leaks, but never finding any. Intellectually, he <em>knew</em> it was built tough and wouldn’t break, but he couldn’t shake the nerves. It was like looking out over a ravine, and knowing there’s only a guard rail between you and certain death. How strong <em>is</em> that guard rail? Do you take it at face value that it’ll hold?</p>\n\n<p>He barely slept his first week there, keeping his ears open for any sign of impending doom, but at first, all he heard was the ceaseless drum of water rushing through the turbines. Then, one night, as he was staring at the cold concrete ceiling in the makeshift dormitory, he heard a dripping noise.</p>\n\n<p>Any deviation from the norm naturally struck a chord of terror within him. It was kind of like bracing to feel the iceberg hit, and then hearing a light scraping along the hull. Where there’s smoke, there’s fire.</p>\n\n<p>Already drenched in sweat, Jean-François got up to investigate. The powerhouse was full of criss-crossing concrete corridors, making the source of the sound difficult to pinpoint. With nothing but a flashlight in his shaky hands, he walked up and down, straining his ears to differentiate between echo and source. It was only once he’d reached the lowest floor that the sound became loud enough for him to confirm he was headed in the right direction.</p>\n\n<p>He swept his flashlight left to right, until he caught something shimmering on the floor. As he approached, he realized it was a puddle coming from under a door where they’d been planning on installing a security office. Now, if it’s not obvious enough, water <em>inside</em> a hydro dam full of <em>electrical</em> equipment? Yeah, it’s <em>not</em> a good thing. He scurried to the nearest supply cabinet and slipped into these really thick rubber boots for insulation.</p>\n\n<p>He returned to the door and found the puddle had grown. Not a good sign. Unsure what he’d find inside, he cautiously opened the door, imagining a wave of water waiting to sweep him away. He found the room empty, but for a large puddle of water in the middle of the room, slowly spreading towards the corridor. This was a relief, because it meant it was likely just a leaky pipe and not, you know, a tidal wave of doom. So there he was, in the room, searching for the source. He checked the walls, nothing. He checked the ceiling, smooth as silk. He crouched down and inspected the floor to see if it was bubbling up through a crack, noth-</p>\n\n<p>He felt a droplet hit the top of his head.</p>\n\n<p>Okay, he figured, he’d probably ruled out the ceiling too fast. He backed away and aimed the flashlight up, squinting to find the source. He heard a few drips, but couldn’t see movement or water clinging to the surface. He looked back down to the puddle and saw a droplet splashing into it.</p>\n\n<p>This is the part of the story where Jean-François’s voice began to falter. I could tell, even so many years later, it <em>still</em> freaked him out. There was this distinct uncertainty in his voice, as though he was both afraid to say what happened out of honest fear, and out of fear of ridicule. Silence hung on the phone for a few moments, and then he continued.</p>\n\n<p>He told me he panned the flashlight back up very slowly, and that’s when he saw it: there was a droplet hanging in the middle of the air. It slowly curved inward in a J-like shape, pooled, and then fell into the puddle. Jean-François swears it was as though it was following the curve of someone’s cheek all the way down to their chin.</p>\n\n<p>He stood in stunned silence as another droplet emerged out of thin air, somewhere between five and six feet in the air.</p>\n\n<p>Drip.</p>\n\n<p>Drip.</p>\n\n<p>Drip.</p>\n\n<p>He ran out of there so fast, he almost lost one of his boots. He ran back to the dormitory and shook one of his colleagues awake. Exhausted, confused, and more than a little grumpy, he reluctantly followed him back down not even ten minutes later.</p>\n\n<p>The puddle was gone, but in its place were wet, bare footprints walking all around the room, up the walls, on the ceiling, and finally, leaving out the door and disappearing halfway down the hall.</p>\n\n<p>Jean-François said he refused to go back to that section of the powerhouse after that night, but he heard others also found puddles leaking out from under that door. They ultimately built the security office in another location and converted the space into a storage room, but even that wasn’t enough. The room was later sealed off with concrete, under the guise there was some sort of flaw in the foundation, but they say even today, they sometimes find puddles under the now sealed wall.</p>\n\n<hr/>\n\n<p><em>If you&#39;re interested in more Canadian paranormal encounters, check out the other instalments:</em></p>\n\n<ul>\n<li><p><a href=\"https://redd.it/8jkzyz\">Vision in the Rare Books Collection</a></p></li>\n<li><p><a href=\"https://redd.it/8jwfma\">The Spectres of Sparks Street</a> </p></li>\n<li><p><a href=\"https://redd.it/8l9pt5\">Last Ride of the Night</a></p></li>\n</ul>\n\n<p><em>These encounters are all stand alone, so you can also jump in pretty much anywhere.</em></p>\n</div>\n","author":"manen_lyset"}