{"rank":"92","title":"They say the freaks come out at night.","id":"8jbshx","url":"/r/nosleep/comments/8jbshx/they_say_the_freaks_come_out_at_night/","time":"1526300404000","body":"<div class=\"md\"><p>They say the freaks come out at night... If I had any idea how... Literal that was, I&#39;d never have left my house that night.  It all started, like most nights do. With me reading creepy stories online. I had just read a particularly terrifying tale of a creep who broke into houses, only to watch you sleep, through sightless eyes. I love tales of the supernatural, of the unknown. </p>\n\n<p>But that&#39;s all they were, right? Tales, Fiction, Made up stories to make me jump at every little bump in the night. Or so I thought. Anyway I had just finished reading the story when I realized how hungry I was. I often forgot to eat during the day, which led to me pigging out at night. I walked out of my room, through the hallway, and into the kitchen of my apartment. I opened my fridge to the barren sight of a broke college student&#39;s food stores. Half empty bottle of mustard? Check. Moldy half eaten sandwich? Check. Leftover Chinese food that had sat untouched for far too long that I was still considering eating? Check. Nothing particularly appetizing. Oh well, Taco Bell is open late. </p>\n\n<p>I walked back to my room, and set about making myself look presentable to the outside world. It may be late, but I&#39;m not a complete shut in. After getting dressed, grabbing my wallet, and pulling a hat over the hair I was too lazy to brush, I walked out into the night. The night air had a chill to it, and the moon was hidden behind pale grey clouds.</p>\n\n<p>Taco Bell wasn&#39;t a far walk, but one thing you should know about where I live is that my apartment is located off of a road that runs parallel to a thick forested area. You go down that road for about two miles, turn left, then boom, civilization and the crappy, bathroom-inducing, &quot;Mexican&quot; food that awaited me. That section of road however was very dark. The kind of dark that if my life was a horror movie, you&#39;d probably be screaming for me to go back in the house. </p>\n\n<p>My empty stomach however, was motivation enough to brave the dark in hopes of cheap food. The first half of my walk, was pretty uneventful. Naturally I walked on the sidewalk by the woods, because my turn would be on this side. So about half way there, as I shuffled along listening to the sounds of the night, trying not to think of the creepy stories I&#39;d been reading, I saw a very strange man up ahead of me. </p>\n\n<p>I had had the sidewalk to myself up to this point, so this immediately caught my attention. He was about five foot five, very thin, bald, and wore a dark suit that blended in well with the night sky behind him. Despite his short stature, something seemed off about him. He wasn&#39;t walking. He stood facing me, unmoving. His arms pointed downward. They looked stiff, almost like he didn&#39;t quite know what to do with them. I stopped dead in my tracks. Now I am not a brave man. I&#39;ve been known to run from dogs, and everything in my body was screaming for me to do just that. </p>\n\n<p>I didn’t know why, but something was telling me to turn, and run home as fast as I could, lock the door, and hide in my room. I almost did, but my stomach grumbled again, more loudly. I was being ridiculous. This man was obviously just an eccentric homeless guy, trying to frighten me, and even though it was working, I was fucking hungry, and he stood in my way. I stuck my hand in my pocket, and found my pocket knife. I&#39;d carefully walk by him, and if he tried anything, I&#39;d be ready. I took in a deep breath, gripped my knife tighter, and walked on, slowly and methodically. </p>\n\n<p>As I approached I could make out his facial features more clearly. His face was smooth, and very sharp. He didn&#39;t have so much as a blemish on his pale skin. His lips were thin, and colorless, and both his cheekbones and chin, were very pronounced. His pale grey eyes seemed to peer into me. They looked... Hungry. Now I was really on edge. I was within thirty feet of him, and he still hadn&#39;t moved a muscle. He just peered into me with those strange, hungry eyes. I noticed the hand on my knife was shaking. Calm down Nathan, you&#39;re such a coward. There&#39;s nothing to be scared of.</p>\n\n<p>No sooner had I finished that thought when the man smiled. Only, it wasn&#39;t a friendly smile. If anything it made him look even more dangerous. I stopped again, staring back at the man before me. He slowly cocked his head to the right, before taking a single step toward me. Fuck being hungry.. I wanted nothing more than to run as far from this man as possible, but when I tried to do so, my legs wouldn&#39;t budge. The man&#39;s grin got even wider, and with that he started walking toward me suddenly. His stride seemed to be going farther than his short legs should allow. I wanted so badly to run away, or scream, but my body wouldn&#39;t cooperate. I was frozen standing in place.</p>\n\n<p>In no time the man stood within a foot of me. I could smell his breath, which was sickeningly sweet, and almost metallic. I did the only thing I could, which was grip my knife tighter. He opened his mouth to speak. It sounded unnatural. His raspy, yet clear voice seemed to pour from his mouth like some sort of liquid. &quot;Hello weary traveller, it would seem you&#39;re rather frightened, yes?&quot;. He may have phrased it like a question, but he damn well knew the answer. He smiled again before continuing. &quot;There is no need for fear young man, I come to you, with an&quot; he clicked his tongue against the roof of his mouth three times. &quot;Opportunity, if you will.&quot; When I was able to find my voice, it was shriller, and more frightened than I&#39;d have hoped. &quot;N-no thank you. I&#39;m really hungry, and on my way to get dinner.&quot; I mumbled. The man smiled wider, though his eyes remained the same. &quot;No really, I must insist.&quot; His awful voice replied. I thought for a moment. My legs wouldn&#39;t move still. I didn&#39;t have much of a choice, and based on the look he gave me, he knew that. I cleared my throat. &quot;Ahem. Uhhh alright. What kind of opportunity...?&quot; He licked his lips slowly, while maintaining eye contact that sent shivers down my spine. &quot;Well you see, most people will tell you that everybody is different, but not me. I know everyone is exactly the same.&quot; He brought his hands out in front of his chest, and began wringing them together. &quot;They all have a dream. Tell me Nathan, what is your dream?&quot; He finished with a nod. I considered for a moment. What kind of question was that? &quot;M-my dream?&quot; My voice wavered. &quot;I&#39;ve never... Really thought about it.&quot;</p>\n\n<p>In a flash the man&#39;s face twisted in anger. This time when he spoke, his voice was deep, and commanding, although still raspy. &quot;Do. Not. Lie to me again.&quot; He growled. The terrifying sight in my front of me turned my empty stomach. Who- no what was this guy? I realized I had to answer. &quot;I-I guess my dream is to have enough money to give my mom a better life.&quot; His face returned back to the same threatening smile. &quot;Ahhh, I see. You like so many others desire wealth. What if I told you I could help you achieve your dream? For a price.&quot; My heart. skipped a beat on his last word. What price? The man chuckled, as if I had voiced my thought aloud. He continued. &quot;I assure you nothing too valuable. All I require from you, is time.&quot; I stared back at the man before me. Surely this wasn&#39;t real. I had fallen asleep reading a story. Any second I&#39;d wake up, and my brother would be there to give me a ride to college. </p>\n\n<p>&quot;Time? What do you mean?&quot; I asked the man nervously. He let out a small chuckle before answering.  &quot;Well you see, I, very much like yourself, find myself with an appetite that needs... Mmmm... Satiating. All I need to do is feed off your… Well, your energies. You lose several years of your life, but gain as much wealth as you desire. Think about it, how can you miss these years, if you haven&#39;t had them yet?&quot; </p>\n\n<p>As he finished I breathed in deeply. My life? No amount of money was worth that. &quot;And if I decline?&quot; His voice was angry again in an instant. &quot;I have made you a kind offer. Do not make me retract it.&quot; He snarled. There was no way in hell I was losing years of my life to this... Thing. At that moment the fear, while still present, faltered. The man looked confused as I realized I could move again. I charged him, pulling my knife from my pocket, and plunging it into his chest. He let out a terrible animalistic shriek, and I ran into the woods as fast as my legs could carry me. </p>\n\n<p>As I tore through the brush watching through the dark for any trees, I ran headfirst into something, and collapsed to the ground unceremoniously. I looked up, and saw the man standing above me, it was him I bowled into. Somehow he had gotten in front of me. His suit had a tear where the knife had stabbed him, but you could see pale undamaged skin underneath, in stark contrast to the darkness around us. I crawled backwards trying to get away, but ran into tree. He walked toward me slowly. I felt warm liquid rush down my leg, and I started to sob. As the man approached me I felt tired. The last thing I remember is a hand touching my shoulder. </p>\n\n<p>I awoke in my bed with a start. As I looked around I noticed light shining into my room through the blinds. My computer still had the scary story open over at my desk, and my stomach rumbled hungrily. I sighed in relief. It was a nightmare. I wasn&#39;t going to read any creepy stories anytime soon. As I brought my hand up to yawn my heart dropped. It was wrinkled, and withered. I got up, and my body screamed in protest. Every joint ached. As I hobbled over to my mirror I was mortified. My skin was loose, wrinkly, and covered in age spots. My long black hair, now mostly gone, white, and wispy. And my blue eyes, were now pale, and grey. I started to sob, and barely recognized my own voice. It was no nightmare. He had taken more than a few years. My life, as I know it, is over.</p>\n</div>\n","author":"nt483"}