{"rank":"37","title":"I'm a bartender in the Limbo and I only serve humans - Part 4","id":"8jbwby","url":"/r/nosleep/comments/8jbwby/im_a_bartender_in_the_limbo_and_i_only_serve/","time":"1526301464000","body":"<div class=\"md\"><p><em>“The bar in the Limbo stays in a certain reality for briefly a day before changing it’s location.”</em></p>\n\n<p>Hello people, Emily here.</p>\n\n<p>A prey came in today.</p>\n\n<p>I’m back behind the counter, still serving drinks.</p>\n\n<p>At the moment, I’m serving several clients so you might have to wait.</p>\n\n<p>_______________________________________________________________________</p>\n\n<p>Back, again, thanks for….waiting? Does this count as waiting? Whatever, I’m back and that’s all that matters. That sounded a bit arrogant, sorry.</p>\n\n<p>I’m currently sipping on a Gray Zone <a href=\"https://www.reddit.com/r/nosleep/comments/8ixgqw/im_a_bartender_in_the_limbo_part_3_a_long_one_the/\">(See part 3 for the menu)</a> whilst reading the “Girl With The Dragon Tattoo”. I’m currently, and I’m proud to say, on page 23. You might ask how is this even remotely impressive and I’ll tell you it’s hard to read when there’s patrons coming in and out by the minute. Most of them just order a Fictitious Moon and pass out on the counter. The problem with that is, in order to make a Fictitious Moon I need time and I can’t post the recipe here (also the ingredients needed are pretty much non-existent on Earth) due to the establishment’s well being.</p>\n\n<p>After they order, I have to inform Boss that we’ve got a fraction of soul for payment, to which Boss usually starts chanting in a spine chilling ancient tongue. The person who ordered the drink and paid the price often start looking pale and concerned after the chanting. They ask me to “bring the bill”, I tell them that it’s already paid and after a few seconds they notice the price tag and start shaking/crying. I mean, I would feel bad but it’s your fault for not even taking the time to read the damn menu. About 4 people are passed out and Donny is escorting them outside the bar. By escorting I mean Donny just hoists their dazed out bodies to throw it out of the bar into the ditch. The muddy, wet ditch.</p>\n\n<p><strong>Rule 23#: No clients are to sleep inside the bar. If incapable of movement, employees are to guide them outside.</strong></p>\n\n<p>I remind myself the rules seldom because of Donny’s outburst yesterday. I still feel a bit guilty. Also, if someone disobeys the rules, only misfortune waits them. At least that’s what Boss said.</p>\n\n<p>Donny and I are currently on our shifts. Vaune didn’t show up, presumably killing demon toddlers.</p>\n\n<p>Today, we’ve opened up our bar to a rainy season. Birds chirp nonchalantly as the raindrops grace the leaves of an old tree. The color of nature contrasts with the moody gray tone of a stormy day.</p>\n\n<p>Ah, Donny has at last throw—I mean escorted the passed out patrons out of the bar. I can finally read. Or so I pretty fucking thought.</p>\n\n<p>A guy came in, screaming bloody murder.</p>\n\n<p>“WHAT THE HELL HAPPENED” Donny asked. The panic stricken stranger was shouting “HELP! HELP, I’M BEING STALKED, I NEED HELP”</p>\n\n<p>I looked at the door that the customer had carelessly left open and shook my head. Some manners, huh. Just when I thought I had some time to myself.</p>\n\n<p>The man slowly sat on one of the bar stools. I asked him what happened to him and who he was and turns out the man is actually Donny’s dealer.</p>\n\n<p>“Don quit a long time ago but the relationship between a druggy and a dealer is strong.” I thought to myself. Suddenly, I heard skittering…skittering?</p>\n\n<p>He calmed down after a few minutes of Don consoling him and I asked him if I could get him anything. Donny was already back to his duties of cleaning the floor. The man looked at the menu, scrutinizing it with his disturbed hazelnut colored eyes. He stopped looking and looked at me. I smiled at him because I’m a <em>polite</em> bartender. Because he had taken his eyes off the menu, I assumed that he was about to order.</p>\n\n<p>“What the fuck is this?” he asked, quietly.</p>\n\n<p>“Uhh, drinks?” I answered.</p>\n\n<p>He looked baffled for a few seconds before sighing and saying “I’ve gone completely fucking delirious, haven’t I?” under his breath. The man smelled earthy and peaty from running out in the rain for quite some time. After his quiet self-deprecation, he shrugged to himself and asked for one Old Faithful. After I served him the hard hitting whiskey, he exhaled, inhaled and looked at me with a determined look on his face.</p>\n\n<p>“I need help.”</p>\n\n<p>I looked at him and after a few seconds I simply told him no.</p>\n\n<p>I wasn’t about to lose my job because of a random wet stranger who barged into the bar screaming about some creature following him. He still tried to persuade me into helping him.</p>\n\n<p>“I really do need help, an urgent one. This is a life or death situation, I’m being followed by one of the Horned. Please, you have to understand.”</p>\n\n<p>Now, I’m not a complete sociopath, just a regular horror junkie. I wanted to give him sympathy, to at least offer a helping hand but I was obligated to my duties as a bartender and an employee.</p>\n\n<p><strong>“Rule #2: The client’s business is the client’s business. Not of the employees. The workers should avoid being involved both indirectly or directly.”</strong></p>\n\n<p>With a rule pretty much describing exactly what was happening now, I was stuck in a position where I could offer no aid. I wanted to say that he’s fucked and fucked alone he is, but I knew more than to make a delirious person mad.</p>\n\n<p>The man started crying. His trench coat still dripping wet, drops of dirty water  muddying the floor and after a while the table had its very own puddle of tears. He started speaking whilst sobbing.</p>\n\n<p>“I just wanted to try out how it is, how it felt to be free and rich. After I got caught with the package, I spent 9 years in prison and each day I thought about my wife. Each fucking day I gritted my teeth, never giving up and just stabbing myself in the neck with one of the the shards of glass scattering about my cell because I knew… I knew I still had someone waiting for me, just as patiently as me. I didn’t want to disappoint my wife again and I swore to myself in that hellhole that I was going to make sure she lived the rest of her life happy. She deserved it. After serving my sentence I ran immediately to my old apartment, the route still clear in my mind from countless nights of walking back home with her. I knocked hard, impatient and excited. Nobody answered. I knocked again, harder and more concerned than excited this time. Nothing. Tried my luck with my piece of shit phone and it worked. But she didn’t pick up, her sister did. She had been in a coma in a local hospital for five years. I jumped when the door suddenly opened. And what I saw there…what I saw…there…” he trailed off.</p>\n\n<p>I realized that after all the hardships he had gone through to finally find a save haven in the middle of a cursed wet hell, he had started to drift off to a well deserved sleep. Don looked over at us, gave a look of slight relief and resumed scrubbing the dirt off the floor. And I finally had the opportunity to get back into my book about hackers and r*pe.</p>\n\n<p>I started flipping through the first few pages, trying to reach page 23 but stopped when the stranger suddenly shot up straight with an expression that only criminals in death row could make.</p>\n\n<p>“FUUUCK!” he shouted at the top of his lungs.</p>\n\n<p>I calmly asked him to calm down. That’s a weird sentence.</p>\n\n<p>“No, you don’t understand! I just had the nightmare again, it’s near, it’s fucking near goddammit!”</p>\n\n<p>“What’s near, mister?” I asked, putting my book back down on the counter. I guess it’ll have to wait.</p>\n\n<p>“The Horned!”</p>\n\n<p>The Horned. If I recall what Vaune was rambling on about a week before, that name is reserved for entities that are conjured from nightmares. I was reading my book as Vaune talked on and on, unbeknownst to my disinterest.</p>\n\n<p>“Malevolent figures who crawl out of the deepest corners of a disturbed person’s brain into our reality. They seek every known person their host had in their memories and for some reason they all possess horns. I think it’s connected to the whole thing about Wendigos and stuff. Anyways, if you want to save yourself from these assholes, you’ll either need to kill the host or cut off their horns. Each Horned have a different type of horn like…like a deer’s or a goat’s and such. Personally, I’ve dealt with a bull horned one. They are the most aggressive, similar to a bull, heh. Tall figures with no eyes, set ablaze with black fire, annihilating everything in it’s path. I could tell you more about the Horned and their types <em>buuuuut I think you stopped giving a shit two seconds into this conversation.</em>”</p>\n\n<p>With that, she got up and gave me a sudden but gentle suplex. I didn’t know that suplexes could be gentle but I guess it can be. It felt as though I was floating for a bit before landing on the soft cushion of Vaune’s chair. I was disoriented and confused for about 5 minutes and when I came to, Vaune was already gone.</p>\n\n<p>I kinda regret not listening to her now. At least I could’ve advised the guy on how to survive the damn thing. He started shaking again, looking pathetic, hobbled up in a feeble position on the stool and started weeping. “I’ve had enough, I don’t want to have to fucking deal with this anymore!”</p>\n\n<p>I grinned.That’s exactly my reaction a semester into my college.</p>\n\n<p>Donny was consoling him by patting him on the back, telling him that he’s safe here and to swig his drink.</p>\n\n<p>First off, he just fucked up the first rule of the bar which is not to ever touch them unless they are direct threats. Secondly, it is comfortable and relaxing here but certainly not fucking safe unless Boss or Vaune is here.</p>\n\n<p>If you thought about it closely, Don was a lying prick. I kept my mouth shut though. “Cynical thoughts be damned. CYNICAL THOUGHTS BE DAMNED.”</p>\n\n<p>The man stopped being so hysterical and finally started drinking the Old Faithful. I was starting to get afraid he wasn’t going to drink it. As he sat there with his adrenaline slowly wearing off, he was glancing at the menu.</p>\n\n<p>“Something you want?” I asked.</p>\n\n<p>“No, no…uhh…can you tell me more about the drink Fictitious Moon?”</p>\n\n<p>“Certainly sir. This beverage will put you into a deep sleep and let you, as you wanted, live a life you dream of. I recommend it if you’re in need of a relaxing sleep. But do keep in mind, we don’t let clients sleep here.”</p>\n\n<p>“I-I see…” he mumbled.</p>\n\n<p>“One Fictitious Moon, please.”</p>\n\n<p>I started mixing in the ingredients needed for one small number 11. After finishing up, I dialed up Boss to let him know that there were Drops (Parts of a Soul) to be absorbed. The man had 75 Drops left. Now it was 74.85. A murderer, huh?</p>\n\n<p>Boss started chanting in that weird language once again as the man started taking gulps from his glass. Let me tell you, the man was <strong>thirsty</strong>. And despite it’s ability, Fictitious Moon was a delicious drink that could sate one’s thirst. After two seconds, the man’s eyelids began to lower. His consciousness was dwindling by the second as the sweet taste and sweet effect of the beverage numbed his mind. And presumably after days of manic insomnia, he finally started sleeping. A deep sleep with loud snores.</p>\n\n<p>I have ADHD. I could not concentrate on my book at all. Fuck.</p>\n\n<p>As I sat there, wondering how my luck is so shit and if I could bring myself to order a “Happy Go Lucky” for a quarter of my soul, <em>I realized something</em>.</p>\n\n<p>Don was cleaning the floor, still and the man was completely out cold. The mud and tears that the man had dirtied the counter with now had a slight tinge of black. Like a drop of ink in a clear water, it swirled around inside the small puddle.</p>\n\n<p><em>What…</em></p>\n\n<p>Then, a small black thing quickly came into view. It dropped inside the puddle. The puddle became even darker.  </p>\n\n<p><em>What the hell…</em></p>\n\n<p><em>A drop presumably made of tar or ink…drop…above…something on the ceiling?</em></p>\n\n<p>I shot my head upwards, facing the ceiling. <strong>A black sticky mass was on the ceiling, spider like eight joints, eyeless head with a gooey dark horn…</strong></p>\n\n<p>I tried to slowly call over Donny. After I had moved my hands in a <em>“come here, but very slowly or I’ll kill you”</em> manner, Donny stepped closer to me.</p>\n\n<p>“What’s up, Emily?”</p>\n\n<p>Ah fuck, an accidental pun. It made me a bit more aggravated than scared.</p>\n\n<p>I signed a “Hush” with my pointy in front of my mouth, then motioned it upwards. He looked up.</p>\n\n<p><em>“Holy shit.”</em> he said in a hushed voice. I could relate.</p>\n\n<p>“Call Vaune or Boss, whoever’s available, pronto.” I said in the quietest tone I could make.</p>\n\n<p>Don signed an “OK.” with his pointy and thumb. I passed him my phone, which he promptly took and slowly clicked the volume down button until it was muted. Then he started dialing Vaune from my contacts. By all the God’s blessing, the ringtone wasn’t loud enough for the thing on the ceiling to react.</p>\n\n<p>To this day, I still wish that Vaune offed herself with one of her custom-made pistols because she picked up the phone with an ear-piercingly loud, cheery <strong>“WHAT’S UP, MILIA?”</strong></p>\n\n<p>The eyeless head now had eyes. Human eyes with pitch black pupils suddenly formed on its face, in wrong places. It’s putrid mouth now making a malicious smile. The oozing black mass seemed to move a bit. Then it dropped down.</p>\n\n<p>The soundly sleeping stranger had wide, tormented eyes as the thing seemed to bound him to itself, slowly absorbing him. I think I saw hundreds of black teeth where the man’s body was stuck to. I reminded myself the bar’s rules and just watched. Donny probably had the same thing in mind.</p>\n\n<p>After 3 seconds of being quietly swallowed, the man started to scream. Shouts that came with the stranger’s violent struggle for life and desperation.Screams that could haunt anyone’s dream for years to come. Thank god I’m used to Mary in the backroom. Though, Donny seemed to be in a state of shock. The phone dropped on the floor, Vaune still yelling “HELLO? IS THIS A PRANK CALL? YOU FINALLY DECIDED TO CALL ME FIRST? HELLO? WHO’S SCREAMING IN THE BACK? MILIA? HELLO???”</p>\n\n<p>Donny and I just stood and watched as the man was completely devoured.</p>\n\n<p>The thing crawled out of the bar, leaving a trail of disgusting black mucus. It skittered as it moved out of the bar and into the gloomy, gray world outside.</p>\n\n<p>Donny got back to work, wide eyed and mute.</p>\n\n<p>I poured myself another Gray Zone and resumed my book where I left off.</p>\n\n<p>The rain making a pleasantly relaxing sound as the raindrops came down on the bar’s roof outside. The book still yet to be finished.</p>\n\n<p>I’ll check up on you people later.</p>\n\n<p>-Emily</p>\n\n<p>(P.S: Uhh, thrice now? Sorry for my terrible writing. I hope you didn&#39;t get too inconvenienced by it.)</p>\n</div>\n","author":"rantleystalk"}