{"rank":"161","title":"Our camera was recording for 168 hours...","id":"8jbx3c","url":"/r/nosleep/comments/8jbx3c/our_camera_was_recording_for_168_hours/","time":"1526301684000","body":"<div class=\"md\"><p>Our camera&#39;s battery life only lasts at about 2 hours... So I don&#39;t know how it recorded for a whole week. Our camera was like a knock off of the GoPro camera since it was cheap because that was what we could afford at the time. Anyway, the camera had only 7 videos and 0 pictures in it which enraged me since I haven&#39;t copied the videos and pictures yet. I decided to take a look at the videos. The videos themselves lasted 24 hours exactly which was weird since the camera had a recording limit of 10 minutes also I wasn&#39;t going to waste 168 hours of my life watching all of these. So I&#39;ll summarize them to not waste time on making this longer. Every video has a display of \nthe date this was recorded and the time it was recording.</p>\n\n<p>First Video: Sunday, the first video was me placing the camera on the tripod then leaving the room and that&#39;s it. Nothing else happened after that.</p>\n\n<p>Second Video: Monday, it was already 10:00 PM and I was fast asleep. I usually don&#39;t sleep this early but I did so anyway. At about 1:00 AM I saw something appear at the foot my bed. It looked like black smoke but it was too transparent to be smoke. It disappeared a minute later. Nothing else happened after that.</p>\n\n<p>Third Video: Tuesday, At about 8:47 AM, I woke up and drank some water, I left the bedroom to eat some breakfast. As I was leaving the T.V. suddenly sprang to life and began flickering on and off. Although it did not produce any noise of static it did however have very high brightness and contrast. When I entered the bedroom again the T.V. turned itself off abruptly. I found this a bit off since I did not see any reflection of light shown on the floor or on the walls when I entered the room. Nothing else happened after that.</p>\n\n<p>Fourth Video: Wednesday, At 5:00 AM every electronic device turned on by itself. The light didn&#39;t blink or anything, it just lit up until 6:00 AM. The T.V. just showed a blank white screen. I tried to look at the PC&#39;s screen to see if it was the same as the T.V. and it was. Again, I didn&#39;t feel like the lights were on. Even though I&#39;m asleep I usually get awaken by lights almost instantly even if it&#39;s dim, but this one didn&#39;t wake me up. Nothing else happened after that.</p>\n\n<p>Fifth Video and Sixth Video: Thursday and Friday, Corrupted. I think it&#39;s corrupted since the 2 videos just showed black screens the entire time but I could hear the audio and see the display of the date and time was still there. It was mostly static noise which was again odd since our camera had a decent sound capture quality. </p>\n\n<p>Seventh Video: Saturday, 1 AM to 5 AM. It was dark but not pitch black dark. The only light came from the street lamp that was close to my window and the moon&#39;s rays showing through the window. The camera then rotated 40 degrees to its&#39; left to expose my entire body sleeping. The black smoke appeared out of nowhere once more but this time it didn&#39;t just stay in one place. This time it entered my body using my mouth, but it didn&#39;t happen right away. It spent the first 3 hours trying to get into my body and after it was inside my upper body got up and looked straight to the camera. My face then went from a blank expression to a devilish smile. My face stayed like that for an hour and then finally my body lied down. Now in the last hour the camera flickered from video to black over and over again until the hour was over. Now you might be wondering how I saw all this with minimum light source. Well the street lamp was very, very close to the window so it was equivalent to half my room being lit up. The light from the street lamp wasn&#39;t strong enough to awaken me which is for the last time really, really off. </p>\n\n<p>After that week I began to feel all sorts of pain from stomach pain to chest pain. Now I don&#39;t know how our camera recorded all of this because firstly it isn&#39;t controlled by a remote or something and secondly when we got back to our house the camera was already drained of life. </p>\n</div>\n","author":"TheRedGM"}