{"rank":"45","title":"Silent Night","id":"8jbzk1","url":"/r/nosleep/comments/8jbzk1/silent_night/","time":"1526302364000","body":"<div class=\"md\"><p>My family has always been pretty biblical, and although I have never really considered myself christian, we still go church and pray before meals. Yesterday we did the usual, a bible scripture before we eat, one after and one before bed. I&#39;m 17 and my two little shithead brothers are 14. They&#39;re twins. We all sleep in the same room, and i have to sleep on the other side of there beaten, crippled bunk bed. I don&#39;t get much sleep, and at first my family suspected insomnia was the reason but i have always just put it down to stress. Exams...colleges..etc. It was about 2 in the morning when i heard the whisper of a faint, light tapping. It was constant, almost rhythmic, like it had a place and purpose. I swiftly got out of my bed. I crept over to the noise and realised that it was coming from the wall. I slowly approached my baby blue, painted wall until i was close enough to put my ear against it. </p>\n\n<p>Then It Stopped....</p>\n\n<p>What followed was a roaring blast of light, almost ten seconds long, accompanied by a booming encore of the sound of a horn.</p>\n\n<p>This is the best way i could describe it: \n<a href=\"https://www.youtube.com/watch?v=iole3n3yvpU\">https://www.youtube.com/watch?v=iole3n3yvpU</a></p>\n\n<p>I don&#39;t remember what happened after that, only what happened after i woke up. strangely, i was resting on top of my bed. The sheets were clean, and the bed was made, almost as if i hadn&#39;t slept on them. Both of my brothers were gone, and my alarm clock was reset. I got out of bed, and started to put some clothes on. From what i could recall, it was a Sunday morning, which meant i had to put on all my shitty little &#39;smart&#39; clothes on. I was about halfway through getting my buttons done until i remembered. Horror came upon my face, I HAD FORGOTTEN BREAKFAST!</p>\n\n<p>I rushed downstairs, with an apology prepared for my mother. She hates waking me up and I probably missed breakfast. I swung open my living room door and shifted into the desolate kitchen. Nobody was home. I called out for any body, even my father (whom i had recently fallen out with) and i was left without an answer. Eventually, i started to reminisce on the night before, and remembered the horn, the light. </p>\n\n<p>I sprinted out side, looking around for any body. I was scared, and i still am. I must have searched for hours, but nobody was home, nobody was at home. Its been about 30 hours since then, and I&#39;ve just woken up. The noises, the light happen every hour or so. The electricity, water, hell even the WiFi works. I&#39;m currently writing this on my laptop at home, the only place i can feel safe. A few hours ago i left the house to explore, try and find other people. Even wildlife has left the earth. Its just been.... left with silence. I eventually got to a shop, and decided to eat, finally. It was then when i noticed weird things were going on. Things were changing, food was being restocked when i wasn&#39;t looking. The time on the clocks were moving, but in completely random and distorted ways. Even i was changing, my hair colour is now a shade darker, and my freckles are gone. Where am I? Who am I? Were you me, am i you?</p>\n\n<p>The horn is blown again, and darkness follows. Its a Silent Night.</p>\n</div>\n","author":"CronicNS"}