{"rank":"1","title":"Dusty Old Museums At Night","id":"8jcam5","url":"/r/nosleep/comments/8jcam5/dusty_old_museums_at_night/","time":"1526305070000","body":"<div class=\"md\"><p>I work as a museum as a night watch men. It is probably one of the most boring jobs imaginable. But it isn&#39;t a far commute, and it pays well, so that is pretty good. My job is to guard an old house that once belonged to a painting collector. I have to do routine checks all night of every room in the house to make sure no one breaks in and steals anything.</p>\n\n<p>The entire place is run down. Everything is laid out exactly as it would have been in the 1800&#39;s. The last time anyone cleaned it was when the museum opened like hundred years ago when some descendant of the original owner slapped a bow on it and said was &quot;refurbished&quot;. They don&#39;t even put the paintings behind glass. None of them are important anyway though, these paintings are like the sibling of a famous person, no one could tell me what any of them look like without looking them up.</p>\n\n<p>It is supposed to be part of the &quot;history&quot; wing of the museum. Originally it was the <em>only</em> part of the museum, but then they built the main building right next to it. The main building has other parts of the &quot;history&quot; wing, just a few exhibits about the history of the time period and some context of the house. But because the rest of the building mostly contains the far better science wing, you wouldn&#39;t be blamed if you referred to the entire thing as the science wing.</p>\n\n<p>The science wing is meant to teach people about science and technology, if that wasn&#39;t obvious from the name. I like the displays there, especially the interactive ones. The coolest display is this one which lets kids move a ball with their mind. How cool is that! It is kinda tacky, but it can teach kids about science <em>and</em> still be impressive. I like the science wing, and I only mention it because it is by far, my favorite part of the job. Although, it just might be it is just good in comparison to the <em>other</em> wing.</p>\n\n<p>What is funny is that even though the original house was suppose to be the core of the museum&#39;s attraction, its crown jewel, it actually feels like <em>it</em> is the tacked on peace.</p>\n\n<p>I have been getting sick lately from the dust from this place. Breathing it in for so long has been making me dizzy. Since the science wing is new, it is a lot cleaner, but they literally don&#39;t clean the other wing. But even though it makes me sick I <em>have</em> to be there. My job is to guard it, they don&#39;t have a security system in the house.</p>\n\n<p>They should just get rid of it. The manager told me it isn&#39;t as popular. The manager said it then just... trailed off. Like this was some sort of tragedy? The only thing I liked about the house is that it gives me a job. So I pretend to care, I nod when the manager talked about how it is important to not forget our history, yet you never seen anyone even go in the place. I&#39;ve asked the manager how much they go to see the place (I was trying to get them to see how much dust has accumulated, so the manager would have more of an urgency to clean it) but then the manager just said they have been meaning to check the place out lately but hasn&#39;t since the death of their spouse.</p>\n\n<p>They are the manager of the museum and even <em>they</em> haven&#39;t gone there. No one wants to admit it, but that place is unbearable. I ask about the dust problem constantly, I tell them how I have been getting headaches, they tell me they are worried that a lot of the cleaners potentially can damage the wood, and they won&#39;t even touch the paintings. (Even though I bet you if the original owner had those cleaners, they would use them without a second thought.) And no one wants to do anything about it!</p>\n\n<p>I tell them it would be better if they put those damn paintings behind glass! Not because I am worried, like I said they aren&#39;t anything pretty to look at, but just because that would mean the place would be more sanitary. I think I saw mold growing on one painting and it has started to smell. My boss seems to be more worried that the tour guides aren&#39;t watching people closely because some <em>scoundrel</em> stole an <em>irreplaceable</em> 18th century spoon! Oh Dear! How dastardly!</p>\n\n<p>Joking aside, there actually was a stealing problem, a lot of the junk has gotten stolen because one tour guide, Randall, gave less of a shit then I do, I don&#39;t know why anyone would want anything that is here, it is literally worthless dusty trash. I guess some people think it is think it would be cool to eat their frosted flakes with a spoon that belonged to some nobody painting collector. Power to them I guess. Clearing out some of this dusty old garbage was doing me a favor.</p>\n\n<p>People could burn all of the books and paintings in this house and I would not even shed a tear. Did you cry when Joseph Gordon-Levitt lost his brother? What about when Waka Flocka Flame lost his? If you even knew one had a brother I would be surprised, if you knew both I would be shocked. And Waka Flocka only lost his brother five years ago. You might feel bad for <em>them</em> but that isn&#39;t the same thing as feeling bad for their brothers. Some people might miss their brothers, I am not one of them. I couldn&#39;t care less. Call me cold, but I don&#39;t care.</p>\n\n<p>I just wanted the manager to take care of this dust problem. Even the tour guides only had to stomach it that house for 10 minutes tops, and that is <em>only</em> if someone even <em>bothers</em> to come. A lot of the tour guides are in so much denial, that if I had cleaned the dust, they would report me. The only one they were ever too afraid to rat on at the end of it was Randall, not because they wanted to protect their own or anything but because he was the manager&#39;s kid.</p>\n\n<p>Everyone knew that Randall used to look the other way when you would want to steal something, but no one wants to be the one to send a principals kids to the principal&#39;s office. I noticed when I was young that was always how it went down. I used to think teachers were worried about protecting the kid, like the principal was gonna be really harsh, but when I got older I realized they were trying to protect themselves. That kind of situation, you thought the fear was for someone else, but then you realized the fear was for themselves all along.</p>\n\n<p>That doesn&#39;t make any sense. Maybe it was just that the most anal of those nerds really can&#39;t get too mad for too long about a spoon, even if it was also sometimes the occasional book that Randall would let you steal too. And when he was really lazy, that chair wasn&#39;t fun to replace from what I heard. It didn&#39;t help that the manager can be kind of creepy too.</p>\n\n<p>That is the funny thing too! I almost forgot about the gross books. You weren&#39;t aloud to even read them, they were too focused on &quot;preserving&quot; them. I once heard that there are priests out there who can recite the Bible from memory, so that if every copy was destroyed, it could be re-written. The way I see it, that if there was enough people like that person who even <em>half</em>-remembered* hal*f of the versus, you could reconstruct the whole thing in only a few days. No one could even come close to doing that with any of these books.</p>\n\n<p>It was like finding out Nicholas Cage&#39;s brother, Mark Coppola, was a pastor.</p>\n\n<p>Nobody cares.</p>\n\n<p>And nobody will.</p>\n\n<p>Just like I don&#39;t think that the answer to the universe lies in knowing Nick Cage&#39;s brother, neither was it probably one of the books of the shelf of some painting collector from the 1800&#39;s. I don&#39;t care how rich they were, people are a lot richer now. Everything in that house is vastly inferior to anything that we have nowadays. Even the paint that they used a hundred years ago when they were &quot;revitalizing&quot; it, it is so crappy that it chips.</p>\n\n<p>The old house doesn&#39;t need another &quot;revitalization&quot; we should just burn it and be done with. But because I would be out of the job, I just needed to get them to start cleaning up this place. At least if they cleaned up the dust, I could go a night without nearly passed out. Everyday I had noticed more mold, paint chips, and bugs and rats and spiderwebs and dust. There was, and is just so much dust that it is sickening!</p>\n\n<p>I once heard that it wasn&#39;t until someone stole the Mona Lisa, that the painting became popular. I don&#39;t give a shit about any fucking painting, but that bit stuck by me. If I didn&#39;t get those old painting behind glass, and if I still can&#39;t just even get them to clean up some of this God forsaken dust, I just might lose it. I might just lose my fucking mind.</p>\n\n<p>I had decided I was going to steal one of the paintings, the only one that the old as shit paint collector managed to get that anyone seems to care about. I came up with the perfect plan, it wasn&#39;t hard to do since it wasn&#39;t like I was going to sneak past myself now was I?</p>\n\n<p>On a day that Randall, good old Randy, was the last to give a tour, I was going to take the painting and move it to the attic, that way they would only find it when they finally came to clean the place up or when the painting became important enough that I could reason that enough people would come to see it that someone would complain about the dust.</p>\n\n<p>When the other tour guides finally rat on Randall, I would leak it to the press that a museum manager&#39;s kid stole a painting. This way, it would speed that process of getting the painting more noticed up some more.</p>\n\n<p>Because Randall never stole anything himself, he just looked the other way, I reasoned that no one wouldn&#39;t think he had it anyway. He will get blamed but they won&#39;t know who actually stole it and where it was. I even hoped that they would even fire the manager, that way I could get a new boss and would be fucking thrilled if they actually put those painting and books behind some thick glass and maybe even clean up the place!</p>\n\n<p>The plan went perfectly, except when I was looking for a place to hide the painting in that gross old attic, amongst the rats and the cobwebs that I noticed something, it was a skull. II had uncovered a real life, dead skeleton. I don&#39;t know who it belonged to. I don&#39;t even know what time period it was from.</p>\n\n<p>The skeleton made me think against leaking to the media. I went to report the to my manager instead that the painting was missing. I said that Randall had probably let someone steal it. The next day the manager said Randall had gone missing and that Randall had probably been on the run since he stole the painting. I was glad to no that Randall had run away, but it was weird the manager thought Randall had stolen the painting himself.</p>\n\n<p>I felt bad for blaming Randall and letting him take the fall a little now. I didn&#39;t really care about the rules Randall did break, let alone one that he didn&#39;t, so having to run away for a silly painting was a little depressing.</p>\n\n<p>I just need them to clean up the whole place and they would find the painting and the skeleton. After that, they would realize Randall was innocent anyway. Plus, if I have to spend another night in that dusty place I might die. I have been having a really fuzzy time remembering stuff recently, like when the manager mentioned a basement off hand to me recently, I asked them about the basement and the manger looked stunned, I guess it is really sad that I never heard about the basement until then considering for how long I worked here.</p>\n\n<p>The manager isn&#39;t eager for the police investigation, but who would want to have investigation onto your own son? I don&#39;t want the police investigating either, because I know as long as the place gets cleaned they will find the painting anyway.</p>\n\n<p>I still think about the skeleton though, I put it out of mind, The past doesn&#39;t matter, the skeleton is dead anyway so it doesn&#39;t matter what matters is if I can get them to clean this place soon.</p>\n\n<p>The skeleton did look a little <em>recent.</em> It wasn&#39;t new, not by any means. It was covered in dust just like anything else, it had crossed my mind that it was definitely not new but was it old enough that it could have been a person who the original owner locked in the attic, or was that <em>too</em> old. Maybe it was someone from the 1900 century who was murdered and hid up here?</p>\n\n<p>And what was in that basement?</p>\n\n<p>I do wonder whose skeleton that was in the attic, what is in the basement, and if Randall was okay, but I just need to get that dust cleaned, then everything would be fine. Some things were better left in the past anyway.</p>\n</div>\n","author":"AnarachaAnon"}