{"rank":"16","title":"Eyes So Red","id":"8jdcg4","url":"/r/nosleep/comments/8jdcg4/eyes_so_red/","time":"1526313106000","body":"<div class=\"md\"><p>Finally meeting a woman who is willing to hold my hand and spend time outside of life with me, I realize that my world has shifted slightly. Everywhere I go there is a weird feeling in my stomach, and not the butterflies from this woman. As if something is peering and jotting notes about our actions. I try to push it aside because I’m with her, but I just can’t help the feeling of being on edge. </p>\n\n<p>One afternoon after a movie and dinner, we walked from the diner to her apartment. I walked her up the few steps, kissed her, and told her goodnight. Walking away was when I started my speculations. She was there. At the window. Peering. Eyes so red. They weren’t red before. I waved and smiled. She smiled, twisted, but a smile. </p>\n\n<p>I thought nothing of it as we had been tired, and the next date we had was like any other before so I assumed my eyes just played a trick on me in the dark. That’s when I saw her though. We were walking in the park at about ten at night, the streetlight hid most of her. Her hair was black, frizzed, and abandoned. I could make out her height and started to walk up to her, but that’s when I saw them. Her eyes. Eyes so red.</p>\n\n<p>I immediately turned to my woman and she looked at me in a dazed confusion. She inquired about my actions but I thought my hallucinations were just playing tricks again. Resurfacing from my childhood. I glanced at my woman again and noticed her height and outfit. The same from under the streetlight. I pushed it aside and we continued our stroll. Everywhere I looked her outline was there, eyes so red. Red, blood red, a satanic red, one of rebellion and mischief. One of death. </p>\n\n<p>We walked up those stairs, I did my spiel. Said goodnight. As I walked away there was a crash inside the apartment. I pounded on her door. Boom. Boom. Next I kicked viciously. Cluck. Cluck. I combined both. Boom cluck boom…boom cluck cluck. In panic and frustration I used my shoulder and barged in. I saw no one, but I felt a presence. That feeling again. I searched the house for her, no one. </p>\n\n<p>Hurriedly I pulled my phone from my pocket but as I turned it on the reflection disgusted me. There she was. That woman, sprawled like a spider upon the roof. Blood dripped from her mouth, profusely. She pounced and I parried. I pulled my knife out and attacked. Her beating red eyes spat hate upon my soul. Blood red filled. Ridden with desolation. I killed her, the pale body changed none and went limp. My adrenaline coursed my veins, I blinked. </p>\n\n<p>All color returned in the woman, her eyes became black with Death. The black hair was mandated, taken care of. The pocket knife dripped. Dripped the blood of a woman. My woman. I peered out the window now realizing my mistake. I saw the woman, smiling. Twisted. But a smile. </p>\n\n<p>My woman was beautiful. So pretty. Her breasts luscious. Profound facial features. I could feel that adrenaline once again. Blood coursing. I wrapped my hand around her neck. Stripped she looked so beautiful. I could feel that presence again. I loved it. I did my deed, I hope she enjoyed as much as I did. \nI did my spiel and said goodnight. I went home and planned my next date with her. </p>\n</div>\n","author":"LaxBroSMS"}