{"rank":"41","title":"Doctor Cho's Miracle Salve (Part 1)","id":"8jdft8","url":"/r/nosleep/comments/8jdft8/doctor_chos_miracle_salve_part_1/","time":"1526313783000","body":"<div class=\"md\"><p>I studied the pristine cardboard box on the table in front of me. A cursory glance revealed no dents or tears on the surface of the cardboard. The sender ensured each length of tape was applied with no air bubbles or uneven alignments. When shaken no items inside could be heard bouncing off the confines of its casing. I flipped the small object a few times in my grasp looking for any information indicating who it was from. But there was no address label or postage anywhere on the box.</p>\n\n<p>I hadn’t been expecting any packages in the mail this afternoon. And it was rare for anyone to send mail to my apartment too large to fit in my mailbox. When I stumbled onto the dictionary sized box placed in the center of my welcome mat I had been a little surprised. Now studying the outside of the featureless cardboard, I felt that surprise give way to confusion. </p>\n\n<p>Pulling the house key out of my pocket I split the immaculate tape sealing the mystery box. Flipping open the cardboard flaps revealed a small piece of paper sitting on top of a sea of packing peanuts. The paper was no larger than the paper used to hold a fortune cookie message. It contained four words written in the small formal lettering associated with old school typewriters. </p>\n\n<p><em>Doctor Cho’s Miracle Salve</em></p>\n\n<p>I threw the package from the table as if allowing it to stay close to me a second longer endangered my life. I did not waste any time jumping from my chair as I watched the box make contact with the nearby wall causing an eruption of foam chunks. My eye catching a glimmer of light reflecting off a small metallic object that had been hidden by the packaging. I took a few steps back creating as much distance between myself and the metal tube as possible. Never taking my eye off the now stationary object. Silence filled my small apartment while the chaos of eight years of buried memories and emotions exploded in my mind.</p>\n\n<p><em>Doctor CHO’s Miracle Salve</em></p>\n\n<p>The first time I had come across Doctor Cho I was a freshman in college. It had been a few weeks since I first stepped foot on campus, and it had been a difficult transition. Having come from a quiet suburban community I had always viewed college as an exciting adventure into the world. With this in mind I had chose a school hundreds of miles away from everyone I had ever known. Expecting to make fast friends with the people around me I was surprised to learn making a good impression was not one of my skills. Blindsided by my own introversion I spent the first month on campus walking through a fog of disappointment and self-loathing. </p>\n\n<p>Giving up on having meaningful interactions with other humans I’d spent a few weeks adhering to a pretty dedicated schedule. I’d wake up ten minutes before my first class of the day, get back from class, and play video games alone in my dorm until I felt tired enough to sleep. A solitary life I had resigned to living.</p>\n\n<p>Until I was forced out of my state of perpetual autopilot by a familiar tune on one of my short walks from class to my dormitory. A sweet upbeat sixty-four-bit melody permeated the small grass field between dorms. I followed the melody that had penetrated my self-pity to its origin. An open ground floor window. Without thinking about the insanity of my own actions I kneeled onto the windowsill and popped my head into the room.</p>\n\n<p>“Are you playing Mario 64?” I asked my voice cracking from its lack of use. </p>\n\n<p>“Holy shit!” A mop haired guy replied dropping the controller to the floor and recoiling to the side of the couch farthest away from me. The two of us sat in silence for a moment.</p>\n\n<p>“I thought I heard a familiar song,” I said. “I was wondering if it was from Mario 64.”</p>\n\n<p>“Who the hell are you?” The Mop haired guy asked still bunched into the corner of the couch.</p>\n\n<p>“Martin” I said. “Although most people I know call me Marty. I probably shouldn’t have barged in here. I’ll just let you get back to…”</p>\n\n<p>“Fuck,” the mop haired guy interrupted “What time is it?”</p>\n\n<p>Not pretending to wait for an answer he began checking his pockets for something. Unsuccessful he began sliding his hands through the creases of the coach. Swearing more under his breath he started pulling pillows and cushions off the couch still not finding satisfied with his findings. </p>\n\n<p>“Its four twenty-seven,” I said looking down at my watch. </p>\n\n<p>“We almost missed it,” He said turning his head towards a half-opened door he cupped his hand to his face. “Dave you have two minutes if you want to watch Doctor Cho. Get your ass in here.”</p>\n\n<p>Acting like I no longer existed with half my body hanging in his window the mop headed guy kneeled in front of his television and began changing channels. All the while a booming set of footsteps made their way towards the half-opened doorway from the other side of the dorm. By the time the mop haired guy found the channel he was looking for the door blew inward revealing who I assumed was Dave.</p>\n\n<p>“You were supposed to give me ten minutes asshole,” Dave said to the mop haired guy who was once again sitting on the couch. “What if I had been getting the mail or taking a dump? I’d have missed it again.”</p>\n\n<p>“Are you incapable of telling time yourself?” the mop haired guy asked. With his eyes still glued to the screen in front of him he lifted his right arm and pointed at me. “Instead of being so indignant you should be thanking Marty for breaking my concentration.”</p>\n\n<p>Dave have a genuine double-take after following the path of his friend’s gesture. In the heat of the moment all I could think to do was smile and give out a short wave. Dave looked towards the moped haired guy.</p>\n\n<p>“Chris, why is there some random dude hanging halfway into your room?”</p>\n\n<p>Chris shrugged his shoulders and kept staring at the screen showing highlights from the school’s baseball team.   </p>\n\n<p>“Is he a decoration?” Dave asked with a tone trying to pry a reaction out of Chris. “Or is he one of your interpretive art pieces?”</p>\n\n<p>“I don’t know man,” Chris said taking his eyes of the television for the first time since he turned the channel. “The dude just popped his head in my window and asked something about Mario. I might have questioned him more, but I realized we were about to miss Doctor Cho. If you want to interrogate him be my guest, but I have better things to do right now.”</p>\n\n<p>“Whose Doctor Cho?” I asked. </p>\n\n<p>Pulled out of their argument the two turned to look at me with disbelief.</p>\n\n<p>“You haven’t seen Doctor Cho?” David asked placing his hand on his forehead. </p>\n\n<p>“Get in here kid,” Chris said with a look of disappointment and pity. I think he was going to say more, but a synthetic tune began to play over the television speakers. In unison both of their heads turned towards the television. David made his way to the far side of the couch beside Chris not once diverting his attention from the screen.</p>\n\n<p>“You want me to come in?” I asked my words met with a long silent pause. “Is one of you going to let me in the front door?”</p>\n\n<p>“Not enough time,” Dave said in a hypnotic monotone voice. </p>\n\n<p>“Climb in the window,” Chris said similarly monotone.</p>\n\n<p>When I laughed as if they were joking David sharply shushed me. After one final internal struggle over to stay or leave I hoisted myself through the open window. The urge to have some kind of interaction and a growing curiosity over this doctor they were obsessed over was too strong. I scooted into a small open space beside the couch and took in the show.</p>\n\n<p>On the screen was a piece of paper with the words “Now a word from our sponsor” written in the formal text associated with a typewriter. Not nearly as formal though was the noticeable downward slide of the paper. At the point where it had fallen so far down it could no longer be read a pair of long bony fingers came into frame to pull it back up. Again, we watched the paper placed in front of the camera. Although this time it began to slowly dip forward until with a <em>click</em> the music stopped.</p>\n\n<p>The screen exploded into a jumbled chaos of beige and dark colors wiping across the screen. It took a blink or two for my eyes to adjust and realize it was the camera being moved to a different location. The screen settled on a wavy beige background that seemed to move from time to time. </p>\n\n<p>The beige background began to back away from the screen revealing it to be a wrinkled collard shirt. With his lanky arms outstretched as if to will the camera from moving a figure continued backing away. Eventually allowing his arms to lower to his sides the tall figure stopped retreating from the camera and took a rigid stance. His head and shoulders were still out of frame.</p>\n\n<p>Behind him was a living room with walls covered in a mildewed floral wallpaper. The areas where the wallpaper overlapped had separated and hung towards the floor. Against the center wall sat a couch covered in stains of different colors and severity. Numerous places along its surface had begun to crumble allowing stuffing to protrude from its surface.</p>\n\n<p>Still standing out of frame the tall figure was joined by his exact opposite. The co-stars jiggling belly alone took up more than half of the screen they shared. As if to highlight this particular feature the newcomer wore a t-shirt stretched well beyond its limits allowing for a substantial amount of his midsection to show uncovered. He also was shorter than his partner but his head was also completely out of the shot.</p>\n\n<p>Just about the time he had entered the screen the fatter host leaned off screen to his left. There was a <em>click</em> and another synthetic song started to play. For a while the two stayed where they were. The tall figure still and his counterpart leaning of screen while the music played. With a second <em>click</em> the song stopped and the guy leaning off screen stood back up. The lanky cameraman turned towards his fellow host with a discomforting methodical movement.</p>\n\n<p>“Daniels!” a deep computer modified voice said. A long bony finger raising to chest level with the fatter host. “Your hair is a mess, your teeth are unbrushed, and I can smell your disgusting body-oder in my office. Once again it would appear you are unprepared for work.”</p>\n\n<p>“I’m sorry Mr. Anderson,” a high-pitched computer modified voice said as the larger man slumped his shoulder forward. “I tried my best this time this time.” </p>\n\n<p>“Well it would appear your best is not good enough,” The deep voice said. “You are fired.”</p>\n\n<p>“Oh no,” the high-pitched voice said. The larger host turned towards the camera appearing to put his arms in a way that would place his hands on his head. “I’ll have to kill myself.” </p>\n\n<p>Both hosts went back to their original posture. The tall man standing rigid and still, while his counterpart rocked back and forth on his feet. There was another awkward silence before anyone said something.</p>\n\n<p>“How many times has that exact scenario happened to you?” the deep voice asked. “Humans were once vile creatures filled with lust and thirst for blood. The only thing we cared about was ripping the throat out of our next meal and overpowering one another for physical and sexual dominance. But now we are expected to be sophisticated cultured animals with well-groomed fur and flower-scented flesh.”</p>\n\n<p>“There are just so many products.” The high voiced said talking over the last few words of his partner. Every time he spoke his large stomach bounced. “There are just not enough hours in the day.”</p>\n\n<p>“What if I told <em>you</em> there was an easier way?” The deep voice said pointing his bony finger towards the camera when he said the word <em>you</em>. “What if I could give you one product that could fix all of your self-grooming issues?</p>\n\n<p>“I’d say you had better produce that miracle potion now or I’ll hold you down and pry each and every fingernail off until you did.” The high-pitched voice said.</p>\n\n<p>While he talked he turned towards his tall partner and contorted his hands into tense claws. There was another long silence before the larger man dropped his hands back down to his sides and the two shared an unconvincing laugh together. </p>\n\n<p>“Do not worry friend,” the deep voice of the lanky man said while he placed a long arm around his partner’s shoulders. “I would be happy to tell you about the product that changed my life.”</p>\n\n<p>With his free hand the tall figure reached into his back pocket and lingered for a moment. Switching to his front pocket he again emerged empty handed. Taking his arm off his partner he placed his other hand in his back pocket, and this time he emerged with a small object. Before you could tell what he was holding the tall man lunged the object forward towards the camera. For a moment everything on screen became a blur as the camera’s automatic focus struggled to make adjust to the sudden change. </p>\n\n<p>When it was visible the screen was filled with a tube that resembled a small toothpaste container. Except this was not made of the plastic most toothpaste was shipped in. This tube was made of metallic material. Taped to the center was a small piece of paper that said in the same typewriter font <em>Doctor Cho’s Miracle Salve</em>. </p>\n\n<p>Giving only a second to read the label the taller moved back into his earlier position. Again, there was a moment where everything was blurred beyond comprehension while the camera refocused. When it cleared once again the tall figure was presenting the object to the camera high on his own chest. Not realizing it was half off screen.</p>\n\n<p>“This amazing gift from the heavens in my possession is <em>Doctor Cho’s Miracle Salve</em>,” The said the tall man’s robotic voice. “It is the cure of any of the grooming issues that ails you.”</p>\n\n<p>“Does it function as toothpaste?” The high voice asked.</p>\n\n<p>With a jarring cut the screen changed from the two out of shot men to the inside of someone’s mouth. It was half filled with dead and dying yellow teeth. Many of the remaining teeth were either chipped or cracked. Most spots where there had been teeth were dark infected holes. </p>\n\n<p>In front of the mouth came a yellowing toothbrush caked with green and black gunk near the bristles. From above the camera shot came the opening of a metallic tube where a yellowish-orange goop dribbled out onto the toothbrush. Now covered in the toothbrush entered the mouth. We had a front row seat to watching the goop spread across the few teeth that were left in the mouth. Some of the <em>Dr. Cho’s Miracle Salve</em> was liquid and spread around the mouth while chunkier pieces clung to the teeth as they were shifted around. The tooth brush exited the mouth where a mixture of blood and <em>Dr. Cho’s Miracle Salve</em> pooled around the tongue. The scene ended with the mouth closing and swallowing the disgusting cocktail. Another jarring cut brought us back to the two hosts still standing in their original positions.</p>\n\n<p>“Can it help me tame my wild hair?” the high-robotic voice of the fatter man asked.</p>\n\n<p>Again, we cut to a different scene. Instead of a mouth this time we were given an over-head view of someone’s scalp. Besides a few patches of long wisps of hair, the person’s head was bald. Covering the bare skin was a dark red seeping rash. There are more than a few spots of caked blood where the irritated areas had broken open and gone unwashed. </p>\n\n<p>From off frame comes a small blood-stained washcloth and the metallic bottle of <em>Doctor Cho’s Miracle Salve</em>. The yellow-orange goop was once again squeezed from the tube this time falling in a large quantity onto the washcloth. The more liquid parts of the product absorbing into the fabric while the more solid matter sat on the surface. The person applying the product began rubbing the rag across the scalp over and over until satisfied. By now the once irritated skin is now a mess of open wounds. Some spots pooling blood while more ran down the side. Across the surface of the scalp are the more solid yellow-orange particles of <em>Doctor Cho’s Miracle Salve</em>. The screen cuts once again back to the two hosts.</p>\n\n<p>“My goodness,” The high-pitched voice said. “what else can <em>Doctor Cho’s Miracle Salve</em> do?”</p>\n\n<p>“I’m glade you asked good sir,” The deep voice said while moving a bony hand into his front pocket and pulling out a piece of paper. “It can moisturize skin, shampoo and condition hair, deodorize armpits, sooth burns, cure warts, end nausea, sooth heartburn, grow hair, cure erectile dysfunction, and much more!”</p>\n\n<p>“An amazing product like that must require a fortune to attain,” the high-pitched voice said while the taller man placed the paper back into his pocket. “I guess I’ll have to go without <em>Doctor Cho’s Miracle Salve</em>”</p>\n\n<p>“Do not pout my friend,” The deep voice said while the tall man again placed a bony arm on the larger man’s shoulder. “<em>Doctor Cho’s Miracle Salve</em> costs one easy payment of $17.32”</p>\n\n<p>“Maybe my life is worth living,” The high-pitched voice said rubbing his hands together. “How do I get my hands on <em>Doctor Cho’s Miracle Salve</em>?”</p>\n\n<p>Removing his arm from his co-stars shoulder the taller figure placed his hand in his pocket once more to pull out a small sheet of paper. Just like he had done with the tube of his product the tall man rushed to place the small sheet of paper close to the camera. For a moment the screen blurred as the camera compensated for his sudden proximity change, but when it was done a ten-digit local phone number was written in the same typewriter style font.</p>\n\n<p>“Just call this number today,” The deep-robotic voice said. “And we will send you your tube of <em>Doctor Cho’s Miracle Salve</em>.”</p>\n\n<p>The screen was quiet and still with the number on screen. After a moment though the number pulled back once again blurring the vision of the camera. When it adjusted the larger man was no longer on camera, and the taller figure continued to stand still in his spot on the screen. After another long pause he took a few steps towards the camera stretching his arms towards the screen. Then it cut to black.</p>\n\n<p>I sat for a bit looking towards the blank screen, but not really seeing it. Even when the next program began I wasn’t paying attention. Questions and images buzzing through my head at a torrent I couldn’t quite keep up with. Let alone process properly. </p>\n\n<p>I pulled my gauze away from the screen and looked around the room. Dave and Chris looked back at me with a look of expectation on their faces. They wanted me to do or say something. I ended up saying the thing that had kept popping up in my mind throughout the viewing process.</p>\n\n<p>“What the fuck did I just watch?”</p>\n\n<p>Chris and Dave looked towards each other. The moment their eyes met the two men erupted into laughter. I went to ask them what was so funny but realized I was unable to, because the moment I opened my mouth I broke into a laughing fit that cramped my sides and refused to stop.</p>\n\n<p>“I love watching it with someone their first time,” Dave said when he was able to compose himself. He was still wiping tears from his eyes.</p>\n\n<p>“I always end up feeling jealous,” Chris said through a shaky voice. “I always wish I could go back and watch it again with fresh eyes.”</p>\n\n<p>“Seriously,” I said being careful not to breath too deep to give my abdominal muscles time to recuperate. “What the fuck was that?”</p>\n\n<p>“I got class in an hour and need to get something to eat,” Chris said standing up from his spot on the couch. “Come with us to the dining hall and we will explain everything we know.”</p>\n\n<p>And just like that my of solitude had come to an end. Thanks to the weirdest piece of film I had ever seen I had made my first two friends. Chris, Dave, and I became inseparable, and for a while we spent a lot of that time discussing <em>Doctor Cho’s Miracle Salve</em>.</p>\n\n<p>But that was back when it was all a weird mystery. Time spent arguing over whether it was a student film or a failed attempt to gain quick drug money. Nights staying up till in the morning around a video game or some illegally obtained booze waiting for our favorite little oddity to air.</p>\n\n<p>It was until we learned the truth about <em>Doctor Cho’s Miracle Salve</em>.</p>\n</div>\n","author":"JDerrick29"}