{"rank":"1","title":"A VOW TO THE WITCH","id":"8jdrh9","url":"/r/nosleep/comments/8jdrh9/a_vow_to_the_witch/","time":"1526316178000","body":"<div class=\"md\"><p>Well for starters the witch of my life came to me at an unusual scene (lets put it at that). By the way I&#39;m a Forensic pathologist.</p>\n\n<p>It all started in a case of a murder in a home. My boss was actually close to the police and hired me to go with them on the investigation and to the crime scene to inspect the body of the deceased old man. When we arrive at the crime scene we were shocked that the body was remain intact and no scratches or any sign of wound, the body then sent to our laboratory to be dissected and thoroughly inspect the body of the source of his death. We went and investigate the rest of the house and something in my line of sight disturb me to be the least was a small hole in the living room wall, I inspected it closer and saw an eye looking straight through me. I informed the officer and we tear the wall down to our shock there was a metal door behind the frame of the wall. We opened it and what I- or everyone saw was a beautiful raven haired girl which looks about my age without any clothing on but one thing that bothers me was not about her body but what was engraved on her neck and it seems like a Latin words but we bare it no mind and taken her to custody.</p>\n\n<p>We then proceed to the autopsy of the old man, we began to open up the corpse starting from the skin but the body surpasses our imagination the skin was not attached to the muscle at all, It looks like the person was just wearing a human leather that is well preserved then we went to proceed to the Internal Organs and that is where we are battling our brains out. The lungs was severely burnt like it inhale fire and the stomach and Intestines were missing, liver scratched and Heart that has a huge gaping hole. There was no medical record or any sort of case that has this so we concluded that the Patient died at Lung failure and Cardiac arrest and proceed to the cremation of the body.</p>\n\n<p>After our job was done my Chief told me to head back to the police station and pass the reports of the body. On the way to the police station I feel like someone was watching me from the distance and all the hair in my back just raise so that&#39;s when I decided to just f*ck it and ran as fast as I can. Once reaching the police station I head to the Records and pass the report on the autopsy. On my way out I saw the woman that we saw behind the door fully clothed and there&#39;s just something in her that I cant help but mesmerized, she looked at me and smiled a sweet and Innocent smile so I mustered up my courage and approach her, we talked for a while and I offered him to dinner which she gladly accepted.</p>\n\n<p>(Fast forward to 2 years)\nWe were both happy with our life she became the love of my Life and We both said our marriage vows &quot;Till death do us apart&quot;. Now we have a beautiful daughter but something still bothers me while its been two years but her face still didn&#39;t change even a single bit.</p>\n\n<p>Out of curiosity I read the case that we both first met. I read something rather Odd there was a list of the items the Old man possesses. A book of unknown language, A ring and a Talisman. I looked up the book and saw It was a book against witches and protection and The talisman was suppose to be a ward against their magic.</p>\n\n<p>My mind was going nuts, I kept saying it in my head that it cant be my wife cant be. She looks too innocent to be like that. So I left  it at that, I burned the remaining records and kept it somewhere no people could find it. In. The. Past.</p>\n\n<p>I love my wife that much and I would not destroy my family for something like this. The only thing that would separate me from my wife and family is just DEATH.\n<em>&quot;till death do us apart&quot;</em> </p>\n</div>\n","author":"amethodofchaos1"}