{"rank":"51","title":"The house across the street: getting ready for recon (Part 2)","id":"8je8g0","url":"/r/nosleep/comments/8je8g0/the_house_across_the_street_getting_ready_for/","time":"1526319713000","body":"<div class=\"md\"><p><a href=\"https://www.reddit.com/r/nosleep/comments/8j33oy/ive_been_getting_a_little_worried_about_the_house/\">Part 1</a></p>\n\n<p>Hey guys, Xnyrax here.</p>\n\n<p>As I write this, it&#39;s around half past 6. It&#39;s quite a while before the SOS lights in the house across the street usually start, but a lot has happened and I figured I&#39;d update you guys. On the advice of <a href=\"https://www.reddit.com/user/Mommyhita1\">u/Mommyhita1</a>, I called the cops a few hours ago. I was considering doing it anonymously, but after awhile of thinking, I figured nah, fuck it. Everybody knows everybody around here and everybody&#39;s related to everybody. Hell, I have three cousins who work as local cops. Plus, it&#39;s not like I have a reputation to worry about. So I called the non-emergency line and got connected to my cousin Steve, who promised he&#39;d send someone over soon after I told him I had seen someone climbing in. Sure enough, in less than an hour, there were two big burly cops checking out the building from the outside, looking for signs of entry and that sort of thing. One of them came over to talk to me; I knew him, from back when I was a kid. A guy named Mike, we used to go to church together.</p>\n\n<p>We exchanged pleasantries, &quot;how are the kids?&quot;, that sort of bullshit, but I could tell he was watching me in that way that people watch me all the time when they pass the house. It&#39;s the kind of look that says loud and clear &quot;you&#39;re a fucking loony toon&quot; without actually coming out and saying it. Eventually we got around to him taking my statement, and I told him a made up story about how I  had been awake and had seen someone trying to get in, specifically to that tower I was mentioning to you guys earlier. He nodded and started to leave, but I was able to get him to answer a couple of questions before he did, more or less tell me what he had seen.</p>\n\n<p>There were no signs of forced entry. They couldn&#39;t go in without a warrant, but nobody had forced their way in at least. In my mind that erases the &#39;thief&#39; option. The second and more interesting thing was what they found on the doors and the front windows. See, I can&#39;t see the front of the house from my porch. I can just see about half of the front porch, the part that has no windows at all and a burned-out light, and not even that directly. Anyway, Mike said that there were a ton of holes all along the entryway and the windowsill, places where nails had been at one point. Underneath all of the windows and doors on the front, there were piles and piles of rusty iron nails, all of them carefully painted blue. This, obviously, piqued my interest and I asked him if he had picked up any of them. He started to argue about how they were evidence, but once I pointed out that they hadn&#39;t actually <em>seen</em> any signs of entry and besides, one fucking nail isn&#39;t going to be missed, he let me have the one he had picked up.</p>\n\n<p>The nail&#39;s old, really old, and like he said, blue. It&#39;s sitting on the table next to me as I write this. I knew immediately what it was for. Like I said, I&#39;m a nerd; but for what, I didn&#39;t tell you. I&#39;ve always been interested in myths, legends, superstitions, that kind of stuff. When I was a kid I devoured Irish myths, and then moved on to Greek, Roman, Aztec, and further afield. My grandma, the one who left me the house, taught me some Cherokee stories and Muskogee ones too (we&#39;re native on her side), and a handful of rituals that I still remember. The nail part is obvious. Coffin nails are used in voodoo and a bunch of other magical systems; they supposedly have a great deal of &#39;negative energy&#39;, the kind used for dark magic and that kind of shit. However, you can also use them to &#39;seal in&#39; a spell, to fix it in place. The blue thing, though, is something more regional and I had to look it up before I figured it out. The part of Oklahoma where I live is called Little Dixie colloquially, and we have a lot of Southern traditions. One of them is painting things a shade of blue called haint blue to ward off haints, which are nasty spirits that haven&#39;t moved on. It&#39;s not too common anymore, which is why I didn&#39;t really remember it, but some people still do it.</p>\n\n<p>Now, I&#39;ve always been a skeptic, Nosleep, but this nail is <em>really</em> fucking weird. When Mike handed it to me, I could feel....something in it. Like it was humming or vibrating, gently enough that I wasn&#39;t sure at first if my hands weren&#39;t shaking, but enough to be noticeable. It&#39;s still doing that now every time I pick it up. I don&#39;t know if it&#39;s really magical or whatever, but it&#39;s definitely <em>something.</em> My theory, then, is that someone was trying to seal something inside the house with these nails--what, I don&#39;t know. But the fact that they&#39;ve all fallen out, and Mike did say <em>all</em>, worries me quite a lot.</p>\n\n<p>Two other things happened today. The first is that I called my greataunt and asked her about the hipster guy and the house. She was nice enough about the hipster, but quietly contemptuous in that way unique to old Southern ladies. But when we got on the house, she was very talkative. It turned out that my greatuncle&#39;s death was a lot stranger than I had thought. I remembered going to his funeral when I was thirteen (although I did know I hadn&#39;t seen him in a LONG time before that), but hadn&#39;t really wondered about how he died, or gave a shit. She told me that actually, no one had found his body. Around when I was six, nearly two decades ago, he just up and vanished one day. She had come by to visit him and found the door unlocked, his car and keys and wallet and everything still at the house, but him gone. They searched the house and the couple acres he owned behind it with a fine-toothed comb, found nothing at all. So she took care of the house for the time it took to get him declared dead, and, as his closest relative, sold off the property once that was done. When I mentioned the nails, she was pretty noncommittal. Said they had always been there and she didn&#39;t feel right pulling them out. That was about the last I got from her before she started asking questions I didn&#39;t want to answer, and I quickly hung up.</p>\n\n<p>Nearly as soon as I had finished this, the second thing happened. I had a knock on the door. It was a neighbor, Marvin. Well, sort of a neighbor. He lives catty-corner to my house, just across the street from the Palace of Green Porcelain. He&#39;s honestly the nicest dude in the neighborhood. Not friendly exactly, but the times we&#39;ve talked, he hasn&#39;t given me the fuck-you look that I mentioned before, and has generally treated me like he would anyone else. His daughter has bipolar disorder, so I guess he&#39;s used to people with mental shit.</p>\n\n<p>Anyway, he had noticed that the cops came to the Palace and then to me, and wanted to know what they asked about. I told him and he immediately looked suspicious. I had a hunch that he had seen what I saw, and I brought it up. He seemed hesitant at first, but soon explained that yeah, he had seen it. What&#39;s more, because his house is in front of the Palace rather than to the side, he can see the other tower, and confirmed a suspicion I had. The other tower is having the same shit every time mine goes off, but at almost exactly different intervals. When one light is off in one tower, the other will be on, and vice versa. He said it almost looked like someone trying to blink at different times with both eyes. When I showed him the nail, he felt the vibrations too.</p>\n\n<p>The cops aren&#39;t going to do anything, so we decided to deal with it ourselves. I know that sounds like generic dumb horror movie behavior, but so is sitting on your hands and doing nothing. I dug up my grandma&#39;s old nvwodhi--sort of like a Cherokee magic book--and looked through it, trying to find something that would protect against evil spirits like the nail. Like I said, I&#39;m a skeptic, but fuck, if we&#39;re doing this, it&#39;s better to be prepared. I found one I think will work. The funny thing about Cherokee magic is that it almost always requires three things, at least the stuff I know; you need a specific chant, you need running water, and you need tobacco. Luckily, the book had the chants, and I had a faucet and plenty of cigarettes. It didn&#39;t feel right to share my family&#39;s private traditions on the internet, so forgive me if I don&#39;t give you the specifics. But essentially what I did was invest seven cigarettes (seven&#39;s a sacred number in Cherokee belief) with a mixture of my own personal &#39;energy&#39; and the power of the water, or at least that&#39;s what the ritual was supposed to do. I dunno if it worked. The cigarettes don&#39;t feel any different to me. But anyway, when burned, the smoke is supposed to protect whoever&#39;s holding them from bad juju, essentially, and cleanse away traces of the same.</p>\n\n<p>While I&#39;m doing this, Marvin is heading to the store. He&#39;s buying a flashlight, a camera, some gloves and black clothes, and a few other tools to break in. He&#39;s also buying a pair of walkie talkies, because...well, because I&#39;m not going in. I can&#39;t. I tried today to walk down the driveway, and I had only gotten halfway past my long-disused car before I started hyperventilating. I don&#39;t have my pills and I don&#39;t have any weed, so there&#39;s no way I&#39;m going to be able to calm down enough to get over there. Marvin understood. I&#39;ll be a sort of mission control instead. Neither of us know what we&#39;re looking for. I guess he&#39;ll know it when he sees it.</p>\n\n<p>I&#39;ll let you know how it goes tomorrow. And if anybody who knows about the sort of warding magic I&#39;m talking about reads this, let me know any tips and tricks you might have. I don&#39;t know if anything like that will help, but like I said, it doesn&#39;t hurt to be prepared.</p>\n\n<p>Wish us luck, guys.</p>\n\n<p>Note: I actually wrote this yesterday, but took it down after we decided not to explore the Palace last night; Marvin couldn&#39;t find someone to watch his daughter and she REALLY DOES need someone around, even when she&#39;s asleep. I managed to arrange for my cousin to take care of her tonight, so the exploration starts tonight. Plus, because I&#39;m an idiot, I needed to repost twice for guidelines violations. I really need to read more carefully.</p>\n\n<p><a href=\"https://www.reddit.com/r/nosleep/comments/8jxjc7/the_house_across_the_street_the_stain_part_3/\">Part 3</a></p>\n</div>\n","author":"xnyrax"}