{"rank":"2","title":"I bet you've read scary stories around the campfire. Have you ever thought you were in one?","id":"8jew5d","url":"/r/nosleep/comments/8jew5d/i_bet_youve_read_scary_stories_around_the/","time":"1526324581000","body":"<div class=\"md\"><p>Hello, i won&#39;t be telling you anything about myself, it&#39;s none of your business. But i will tell you about my experience with what I call &#39;The white watcher&#39;.</p>\n\n<p>This will take place at three different points in my life, 2016, 2017, and now, 2018. I&#39;ll explain my situation, and how all this started.</p>\n\n<p>2016:</p>\n\n<p>It started with me and my cousins, along with my grandma ( who is not a old as you think, all my relatives are like that), camping at a trailer park, that had a pool, lake, a pavilion for watching movies. I always had fun there, playing with my cousins. My uncle had rented a golf cart for are trip, so we can ride around and get places faster. It was about 9:45 when my grandma, my aunt, and my cousin all decided to ride around on the golf cart one more time before quiet time came (That means we can&#39;t be loud past 10 PM so people can sleep). My aunt was driving, my grandma had shotgun, with my cousin and I on the backseats. We had fun and everything was going good. But this is where stuff hits the fan. We pulled up back at my uncles trailer, and as we where getting off, i saw a weird, figure? Let&#39;s say figure, in the bushes. I didn&#39;t have my glasses at the time so my vision was bad, but i could tell it was pure white, croutching sorta, and looking directly at me. I was having a mini panic attack now, but didn&#39;t tell anybody about what i saw. I was so scared that whatever that thing was would crawl out of it&#39;s little hiding place and come kill me. Now let my tell you a good thing, the next morning when i woke up, it had left. I assumed it was just my eyes playing tricks on me again.</p>\n\n<p>2017:</p>\n\n<p>This part takes place on a girl scout camping trip, for three days we would stay at a camp site and have a good time. I again didn&#39;t have my glasses, since I&#39;m a moron and don&#39;t instinctively grab them, at the camp site there was a fire pit with wodden logs for chairs surrounding it, like in cartoon camping scenes. There was a Yurk with bunk beds in them for us to sleep, tents for the troop leader, and a small building we called &quot;The leader&#39;s den&quot;, since that&#39;s where the leader and chosen girls would prepare the food. It was the second night and we where all sitting around the campfire, talking and doing what girls do, i was siting with my back to the leader&#39;s den, and turned around to grab a hair tie my friend dropped. But when i looked at the leader&#39;s den, i saw that white thing again. This time it&#39;s laying down with it&#39;s arms up, as if it&#39;s ready to pounce at me any moment, it&#39;s still staring right at me. Only at me. I couldn&#39;t move to another spot since everywhere else was taken, so i had to sit there, knowing that weird demon is right behind me. Later that night, when i was trying to sleep, i thought of two things for that creature. I began calling it &quot;The white watcher&quot;, and actively started looking for it, i wanted to show i knew it was there.</p>\n\n<p>2018:</p>\n\n<p>Now, i haven&#39;t gone camping yet, but summers around the corner, and I&#39;m gonna be camping alot, one again for girl scouts, two are sleep away camps, anything else are trips with my family. I regret saying i&#39;d camp alot,  the watcher completely slipped my mind when we where discussing it. But now I&#39;m scared, what if i see it and it&#39;s even closer then before? Is it gonna get me this time? I&#39;m gonna bring my glasses everytime now, and when i finaly do see it, I&#39;m gonna make darn sure everybody around me sees it to. There&#39;s just one thing that keeps crawling into my mind, something that makes my heart race and my mind cloud. It&#39;s that I&#39;m going to see it with my glasses on. I&#39;m going to get people attention to look. But there going to look. And then stare at me and say. &#39;Nothings there&#39;.</p>\n</div>\n","author":"TheFlowerDream"}