{"rank":"544","title":"Red string keeps appearing around my fingers","id":"8jf1gc","url":"/r/nosleep/comments/8jf1gc/red_string_keeps_appearing_around_my_fingers/","time":"1526325697000","body":"<div class=\"md\"><p>Despair is a miserable thing. It marches toward you from a grim distance. You can see it coming, can feel the weight of its approach. As you watch it draw nearer you’re probably slumped down in a corner somewhere, your eyes bloodshot and exhausted. If you had the energy, you would try to resist its arrival. But that kind of strength has left long ago. So instead you sit, hands covering your face, one terrified eye peeking out between your fingers and pray the fallout isn’t as brutal as you fear. </p>\n\n<p>Despair is complete and total emptiness. It is not a <em>meaninglessness</em>, but instead, a removal of something so treasured that it’s departure has left you halved. Not physically, not even mentally. No, instead it is an absence of a hope you once held onto. An idea that maybe, somehow, things would turn out all right. And maybe they will, but in the face of such gloom the idea is so alien you can’t even comprehend its possibility. </p>\n\n<p>Despair is waking up every day and confronting the shadow that looms across your bed, grinning down at you from where you had fled it the previous night as sleep took you. </p>\n\n<p>Despair is pretending everything is ok when in fact, it’s not ok, God no, will it ever be ok again?</p>\n\n<p>Despair is waking up from an alcohol induced blackout on your bathroom floor and why, Christ why is there so much vomit and blood everywhere - who’s blood is that - is that my blood - oh no, what did you do, for fuck’s sake, what did you do…</p>\n\n<p>I’m tired. </p>\n\n<p>God, I am so fucking...<em>tired</em>. </p>\n\n<p>I didn’t even want to write this tonight, but I’m afraid of the nonstop dreams that await behind my eyelids. What is safe if not sleep? And if you’re robbed of that, where else is there to turn? Can’t I get a second, just a fucking second, away from this?</p>\n\n<p>No. No, of course not. Because then it wouldn’t be despair. Not in the way I’ve learned it to be. </p>\n\n<p>I laughed just now. Right now, just as I wrote that. I’m not entirely sure why. Maybe I’m just so exhausted that it is the only release I can manage at this moment. I really don’t want to go to sleep. Not tonight. Not ever again. Because I know what’s awaiting me. It is the same shadow that stands over my bed now. </p>\n\n<p>People...friends...I don’t know how much longer I can keep this up. </p>\n\n<p>God...<em>damn</em> it. </p>\n\n<p>I thought I was going to cry just now. I snorted instead. And for some reason that brought a fist crawling up my throat. I feel a welling, a pooling, behind my eyes. Not tonight. I’ve done a lot of crying...so please. Not tonight. I’m too tired. I’m just so...tired. </p>\n\n<p>Ah…</p>\n\n<p>There it is. </p>\n\n<p>The red string. It has looped itself around my fingers and curled up my wrist. I follow its length and see it is spooled out onto the floor, disappearing beneath the bed. I’m never allowed to see the other end. But I don’t need to. I know where it goes. </p>\n\n<p>And I know all I have to do is give it a tug and I’ll be...<em>there</em>. </p>\n\n<p>But no...please...I don’t want to tonight. Not tonight. </p>\n\n<p>It’s useless. I always give in. Once the string has appeared in my hand, I know it is only a matter of time before I dutifully pull at it. </p>\n\n<p>This string…it will lead me back to the despair. To the root, the cause, the catalyst of this horrible state of mind I have found myself trapped behind. </p>\n\n<p>I’m going to pull the string. </p>\n\n<p>But first, I’m going to step back and catch you up. I’m going to step outside the narrative here and walk alongside the story, retrace my steps back to this moment. I would very much like it if you would stay by my side and follow along. Please. Just be with me...just for a little while. Walk with me, side by side, and observe from a distance what has led me here. </p>\n\n<p>Just one of you would be enough.</p>\n\n<p>Here we go. I’m swinging my legs outside the page and hopping the border of format. I’m now outside the words, come on, take my hand, I’ll help you cross over as well. </p>\n\n<p>There we are. Thank you.</p>\n\n<p><em>Thank you</em>.</p>\n\n<p>Follow my finger. Look at where I’m pointing. Yes, now keep your eyes trained on that. Take my hand, if you would, and I’ll guide you as we waltz miserably along the exterior of this tale. </p>\n\n<p>The red string. Yes. That’s how it started. When I first became aware of its existence, I wasn’t in this sad state of mind. No. At least not consciously. I was sort of numb, in a pleasant kind of way. My life was lukewarm, like the doldrums of middle age except it had struck me much earlier. I was still in my twenties, as I am now, and things were...well...things were fine I suppose. I knew my life was lacking something, a companion perhaps, but I wasn’t unhappy. </p>\n\n<p>I was like coffee after it has sat on the counter for some time. Lukewarm, not terrible, the caffeine was still there. </p>\n\n<p>But one night, or day (I can’t remember, but what does it matter), I found myself sitting on my bed, thinking far too much about far too much. I’m like that. Just who I am. So anyway, I was there, musing things over, feeling a heaviness approaching. I cocked my head, curious and a little scared, and tried to pinpoint what was happening. </p>\n\n<p>I wanted something. Something I didn’t have. Ah...that’s not quite right. I didn’t want it. Want is such a selfish word. </p>\n\n<p>I hoped for something. </p>\n\n<p>That’s a little better. Saying you want something implies you think you might deserve it. And I had done nothing to deserve what I was about to find. </p>\n\n<p>So there I was. Sitting on the bed. Feeling that heaviness. Getting a little emotional probably. Sorting things out in my head as best I could. Totally lukewarm and fearing the cold. </p>\n\n<p>And then I looked down and there was the string. I had it clasped between my fingers like it had been there this whole time. It was bright red and slithered to the floor beneath my closet door. </p>\n\n<p>Welcoming the break from my weary thoughts, I cocked an eyebrow. Where had this come from? What was it? And why was I holding it?</p>\n\n<p>I pulled at it. </p>\n\n<p>Boom. </p>\n\n<p>I was gone. </p>\n\n<p>Now, please, hold my hand a little tighter as we continue to walk alongside this madness. I don’t want you getting lost. We’re getting there, it’s just a little rocky up ahead. Keep your eyes on the story and I won’t let you go. </p>\n\n<p>Pull the string and boom. Gone. The world vanished. I know it sounds insane, but it happened. So where did I go? Well...I’m not quite sure.</p>\n\n<p>I was in a hallway. A long, long hallway. It was narrow and lined with doors of all colors. Some were plain-faced, others were elaborately decorated. The floor was white beneath my feet and the ceiling overhead was low. </p>\n\n<p>The string was gone. </p>\n\n<p>A little scared, but intrigued, I began to walk down the silent hall. Where was this? Where had I gone? Of course these questions bombarded me, along with a whole host of others. But that isn’t important. I was as confused as you would be. </p>\n\n<p>I tried a couple of the doors but found them locked. I pressed my ear against them and heard nothing. And so I kept walking. I passed dozens and dozens of doors, each one like a vault. </p>\n\n<p>Reds, blues, paneled, steel, wood, every kind of door you could imagine. </p>\n\n<p>The further I walked, the more I realized something. I was beginning to panic. That heaviness I had felt earlier was back and worse than ever. My breath came in short gasps and my chest rose and fell in shaky expanses. </p>\n\n<p>Help me. Someone help me. Get me out of here. Anyone. My God, please, I’m suffocating…</p>\n\n<p>There. </p>\n\n<p>A sound. A noise. </p>\n\n<p>It was coming from further down the hall. I trained my ears to it. Singing. A woman was singing. </p>\n\n<p>And it was <em>beautiful</em>. </p>\n\n<p>I hurried toward it, trying to determine which door it was behind. I passed hundreds of them. I had to find the source, the soothing melody melting away all my fears, bleeding out the heaviness that had been building inside of me. </p>\n\n<p>I skid to a halt. I pressed my ear to a door painted green. It shimmered for a moment and I thought I had got the color wrong. Blue? No...no it was green. A bright, shining green, like there were thousands of coats of paint beneath it, all swirling with life.</p>\n\n<p>I listened. Yes. The singing was coming from inside. </p>\n\n<p>Hesitantly, I tried the knob. It was locked. Swallowing hard, lost in the euphoria of the song, I raised my fist and knocked. </p>\n\n<p>A moment later, I heart a bolt click open. The door cracked and a woman about my age peaked out at me. Her eyes glowed the same color as the door. </p>\n\n<p>“Hello,” I stuttered, “I think I’m lost...can I come in?”</p>\n\n<p>She smiled, revealing a beauty that matched the music I had heard coming from inside. Christ...thinking back...she <em>radiated</em>. That smile...it captured me and I was completely helpless to it. It told me everything there was to know about this mysterious person. </p>\n\n<p>It told me I was safe. </p>\n\n<p>“Of course,” the woman said, her voice soft and comforting. She pulled the door open and I suddenly felt tears run down my face. </p>\n\n<p>“Thank you,” I choked. </p>\n\n<p>I entered the room and she closed the door behind us. Inside was small, very small. A single chair sat in the center of the enclosed space. The floor was richly carpeted and a series of lights illuminated the interior. </p>\n\n<p>“Why did you let me in?” I asked, feeling dazed, bewildered, and totally lost in the presence of this woman. </p>\n\n<p>She went to the chair and sat down before answering, her lips curling into a warm smile, “Because you heard me singing.”</p>\n\n<p>I nodded, the closed door at my back, “It was the most beautiful thing I’ve ever heard.”</p>\n\n<p>She blushed and shook her head, “You exaggerate.”</p>\n\n<p>“No,” I rushed to say, “I mean it.”</p>\n\n<p>She looked up at me, “Would you like me to sing for you again?”</p>\n\n<p>I felt a wave of something barrel through me, an emotional need that brought a choked cry from my throat.</p>\n\n<p>“Yes...<em>please</em>…”</p>\n\n<p>And so she sang. I slumped to the floor, back to the door, my eyes lost in hers as her voice serenaded the air around me. She made the air I breathed come alive. I felt a peace settle down around me like I had never felt before. A warmth that echoed from her lips, her smile, her song, and it consumed me in the most incredible of ways. When she was finished, I found that I was crying. </p>\n\n<p>“That was beautiful,” I whispered, eyes red. </p>\n\n<p>She smiled shyly, “Would you like to come visit me again?”</p>\n\n<p>My heart soared, “I would like that very much.”</p>\n\n<p>She stood and walked to me. I climbed to my feet, wiping the tears from my face. </p>\n\n<p>And then she hugged me, her head pressed against my chest, her golden brown hair smelling like spring flowers. </p>\n\n<p>Her voice came softly, “It’s going to be ok.”</p>\n\n<p>I bit my lip, more tears coming, and wrapped my arms around her, “Thank you.” </p>\n\n<p>Then I was back in my room, back on my bed, back in the world. </p>\n\n<p>The weight I had felt was gone. It had been replaced with the most dangerous thing in the world. </p>\n\n<p>Hope. </p>\n\n<p>What had I just discovered? Where had I been taken? What was this feeling inside of me, this warm rustle of wind through my lungs. I closed my eyes and for the first time in years, I felt myself smiling. Not because something amused me, not because of some trickle of humor, but because I felt...I felt happy. Oh, what a feeling that was. I can sense it now, the ghost of that rush. My chest was buzzing, my mind opening. </p>\n\n<p>I was...happy. </p>\n\n<p>We’re not done yet though. Stay with me just little while longer. We’re nearing the end. Don’t let go of my hand. Please. Don’t leave me. I couldn’t take that. I don’t want to walk the rest of this by myself. I couldn’t bear the loneliness if you left me now. You’re staying? Thank you. Christ...thank you. It’s going to get dark up ahead, but I’ll get us to the finale. Trust me. You’re safe here. Just don’t let go. </p>\n\n<p>Over the next couple months, I found myself returning back to that hallway, that room, the song, the mysterious, beautiful woman with the voice that made everything perfect. I know it sounds like fantasy, how is anything perfect, how could <em>anything</em> in this world be perfect?</p>\n\n<p>Perfect is what you make it. </p>\n\n<p>During those months, I would often find myself holding that red string. I didn’t know where it came from, I still don’t, but it always appeared. Over and over again I’d suddenly find myself holding it. I never hesitated to pull it, returning me back to that wonderful place. </p>\n\n<p>I found the door, her door, and knocked. She always answered with a smile, a glow, sometimes a hug. She let me inside and she would sing. I lost myself countless times beneath the ocean of her song. I would cry, smile, laugh, and other times I would just sit and bask in it. As my visits became more frequent, the more comfortable we grew with one another. Sometimes when she sang, she would usher me to her and I would lay my head on her lap and she would stroke my hair as he voice reverberated around the room, cleansing me of all the horrors of the outside world. It was just her and I in here. And there was nothing that could reach us. Nothing to hurt us. We were safe and we were happy and I found myself falling deeply, hopelessly into her. </p>\n\n<p>Like I stated, this continued for months. The red string, the tug, the room, the song, and my growing, unstoppable desire for her. It was the first time I had ever unlocked in such a powerful way. And I knew it was the purest thing I had ever felt. </p>\n\n<p>And the most dangerous. </p>\n\n<p>Hold on. Stop. Just...just give me a second to catch my breath. No, don’t let go. Please. I’m just tired. Look ahead of us, past the borders, down into the story. You see that? Do you see the darkness and the cliffs ahead? Can you hear the thunder? Ok...I think I’m ready. Let’s go. </p>\n\n<p>It was a time like all the others. The string appeared between my fingers. I pulled it, hard, eager to return to the world of the hallway, the room, the woman. </p>\n\n<p>And I was back. The white tongue of floor rolled out before me and I hurried to the green door I had grown so accustomed to. When I reached it, I knocked, just like I always did. It opened a crack and the woman looked out at me. </p>\n\n<p>But her eyes did not hold the glow. </p>\n\n<p>Concerned, I asked what was wrong. </p>\n\n<p>Her voice came back to me with all the weight of hell behind it, “You can’t come here anymore.”</p>\n\n<p>I felt as if I had been struck by lightning, my vision sparking with horrible flecks of blinding shock, “W-what do you mean?”</p>\n\n<p>She remained shielded behind the door, “I’m sorry. You can’t come here anymore. You need to go back.”</p>\n\n<p>A hammer the size of life crashed into my chest. </p>\n\n<p>“W-why?” I croaked, mind reeling, panic seizing me, “What happened? What’s wrong?”</p>\n\n<p>Her eyes dropped, “I don’t think you were supposed to find this door. I’m sorry. You have to leave. You need to stop coming here.”</p>\n\n<p>“No,” I whispered, voice shaking now, “No, please don’t do this.”</p>\n\n<p>I saw her eyes swell with emotion, a deep, terrible pain that absolutely devastated me to the very core of my being. </p>\n\n<p>“I’m so, so sorry. Goodbye…”</p>\n\n<p>And then she closed the door. </p>\n\n<p>My knees shook and my mouth hung uselessly ajar. Tears found my eyes and agony found my heart. I slumped to my knees, staring at the closed door, and placed my hands upon the surface. </p>\n\n<p>Why? Why was this happening to me? Please, someone tell me why the fuck this is happening to me?</p>\n\n<p>I silent cry rattled my throat, but I bit down on it hard, so hard I felt blood spill between my teeth. I didn’t want her to hear it. I didn’t want her to know how fucking hard my heart had just been ripped open. How crushing and murderous those words had been. How completely raw they had left me, alone, kneeling in this hallway completely lost, confused, and horribly, maddeningly <em>alone</em>. </p>\n\n<p>I turned and sat against the green door, my back pressed against the wood. I covered my eyes with my hands, my fingers reaching into my hair, and I cried. I cried and cried, and I fucking wept until my throat burned from having to silence each sob. </p>\n\n<p>My eyes rolled wildly in my head, bloodshot and unseeing. </p>\n\n<p>That’s when I heard another door open, far down the hall, away from me. </p>\n\n<p>Vision blurred, I turned my head. </p>\n\n<p>Something was watching me. Its form rose toward the ceiling, so tall it had to bend and contort its dark mass just to fit. From this distance, I couldn’t tell what it is was, but I felt its arrival ripple through the space between us and hit me with a sensation so hard I gasped. </p>\n\n<p>Fear. Overwhelming, all-consuming fear. It struck me so hard I felt my jaw pop. </p>\n\n<p>Slumped against the door, I stared at it. It didn’t move. It just...watched me. </p>\n\n<p>And then I was gone. Back in the real world. </p>\n\n<p>We’re going to take a short-cut here. I thought I could tread the entire length of this, but my legs are growing so weary and I’m having trouble breathing. Follow me, over here. Around that. Yes. Don’t let go. Look. Yes. Right there. That’s the end. Come on, let’s go to it together. Please. </p>\n\n<p>What we skipped over is nothing but the obvious. The absolute devastation of this new turn, the sleepless nights, the vices that suddenly reared up to help me cope, the slow spiral of self destruction, alcohol, and other demons that tore and cut into me. I simply was not constructed to deal with this level of pain. But none of us are, are we? </p>\n\n<p>The most horrible thing during all of this was that the string kept appearing in my hand. And everytime, a sob would shake from my chest a moment before I pulled it. I couldn’t help it. I had to keep going back, each time hoping that maybe, please fucking maybe it was all just a nightmare. </p>\n\n<p>I would walk the hall, empty and alone, and find her door. I never knocked. Not after she told me I had to leave. That I couldn’t come back. No. Instead I just sank before it, covered my face, and cried. She knew I was there. And her silence came not from coldness, but from the realization that a mistake had been made. </p>\n\n<p>So I sat and cried and stared at the door. Every ounce of me screamed to knock, just fucking knock, and maybe, Christ almighty, just maybe she’d let me in again. But I didn’t. I couldn’t. I knew I was never going inside ever again. And yet I couldn’t stop revisiting this place. This hallway. This door. I knew the happiness, the joy, the song that flowed from inside. The warmth, the beauty, the kindness that was now locked away. </p>\n\n<p>But it was not for me to experience anymore. </p>\n\n<p>And so I just sat, or curled up on the floor, and wept, waiting to for someone, anyone, to help me. </p>\n\n<p>During these times, I would hear doors opening in the distance. At first, I ignored them, too lost in my own pain. But after some time, after a couple visits back to that place, I finally started to pay attention to them. To the sounds that followed. </p>\n\n<p>Things were emerging from the countless rooms. Horrible, twisted, nightmarish things that stood and watched me. They never moved, never made a sound, only stood as their doors closed behind them. </p>\n\n<p>They have been getting closer lately. Each time the string appears and I return back to her door, those dark monsters extend further toward me. Each time, another emerges into the hallway, coming from a door that’s just a little closer. </p>\n\n<p>I know they will kill me. It’s only a matter of time. I have to stop going back. I have to throw that fucking red string aside whenever I find myself clutching it. </p>\n\n<p>But the very idea is a hell unto itself. </p>\n\n<p>How do you deconstruct the most incredible span of your life so that the memories of its joy hold no sway over your emotional state? Because if I can’t figure that out, then these monsters, these murderous shadows are going to reach me and I will die beneath them. </p>\n\n<p>Stop.</p>\n\n<p>We’ve reached the end. I needed to get this all out. Thank you for walking with me. You can let go now. Please, let go. You don’t want to follow me to this next part. You see, like I said earlier, the string has found me again. It is curled around my fingers as I type this. I don’t want to pull it. I know how dangerous it is. </p>\n\n<p>Regardless of whether I do or not...I wanted you to know what has happened. In case I don’t come back. In case I find myself trapped in that hallway with those monsters. I think they will reach me this time. And if not now, then the next. They were so close the last time. </p>\n\n<p>Thank you. Thank you for listening. </p>\n\n<p>You made me feel not quite so alone. </p>\n</div>\n","author":"Elias_Witherow"}