{"rank":"965","title":"Never Date a K-pop Idol (Update #3) Final","id":"8jfh17","url":"/r/nosleep/comments/8jfh17/never_date_a_kpop_idol_update_3_final/","time":"1526328897000","body":"<div class=\"md\"><p>I got a call around 4:20 am in the morning. I wasn’t even aware I’d dozed off. I remember sitting cross-legged on the bed, just staring at the wall opposite me, trying not to think about anything, and the next moment I was snapping awake to the sound of my cell phone’s ringtone.    </p>\n\n<p>It was dad’s caller ID.    </p>\n\n<p>My heart beating wildly, I snatched up the phone.<br/>\n‘What the hell is going on, K?’ dad demanded.<br/>\nI was so relieved to hear his voice that for a few seconds I couldn’t talk, I just sat there, gulping air.<br/>\n‘Hey, K,’ he said, ‘you there, hon?’<br/>\nTaking a huge breath, I told him everything.    </p>\n\n<p>‘Right,’ dad said when i&#39;d finished, ‘I’m sending you a ticket ASAP, you’re getting on a plane and coming back home. God damn it, I told your mom you belonged here….’<br/>\n‘Mom and me are coming back anyway,’ I argued.<br/>\n‘That’s going to take too long, you get your ass back here now, your mom can close up shop without you.’    </p>\n\n<p>I found myself shaking my head even though he couldn’t see me: ‘I’m not leaving without mom,’ I said.<br/>\n‘You’re going to do as I say, K – I’ll talk to your mom, you’re the one they’re after, not her.’    </p>\n\n<p>There was no point in arguing with him. I could tell his mind was made up, so I changed the subject and for the next five minutes we talked about other things.    </p>\n\n<p>By the time he hung up I was elated. I was literally walking on air.<br/>\nFor the first time I felt I could actually handle this situation, just so long as dad had my back.    </p>\n\n<ul>\n<li><br/></li>\n</ul>\n\n<p>Feeling more optimistic, I checked online for reactions to my apology.    </p>\n\n<p>I was instantly blown away.    </p>\n\n<p>The internet was at war with itself.<br/>\nMy apology video was everywhere, mirrored hundreds of times across all the major social networks. I almost didn’t recognize myself. I was bald. I looked ghastly. Oh, my God.    </p>\n\n<p>A lot of the people commenting on my video felt I should be forgiven, that I’d learnt my lesson, but there was a smaller, more vocal group, that continued to attack me relentlessly. They felt I should get out of Korea. That I should get cancer and die. That I should jump head first out of a high-rise window. And on and on it went.    </p>\n\n<p>But the whole thing had started to spill across national borders – the US press were beginning to pick up on it, not in any major way, but the smaller media outlets were carrying my story way down on their news feeds.    </p>\n\n<p>AMERICAN GIRL FORCED TO APOLOGIZE FOR DATING K-POP STAR    </p>\n\n<p>There were several variations of this headline.    </p>\n\n<p>GIRL, 17, INCURS WRATH OF K-POP FANS BY SLEEPING WITH IDOL    </p>\n\n<p>TEENAGER CAUGHT UP IN K-POP SCANDAL    </p>\n\n<p>On certain Korean news sites, I was trending number 2, right behind that story about all those girls being abducted in Seoul. I couldn’t believe how far this whole thing had gone. I was famous for all the wrong reasons.    </p>\n\n<p>I watched my apology video again and again.    </p>\n\n<p>A lot of people said I was faking it, that I just trying to get people to feel sorry for me. A lot of people thought I was being a manipulative bitch.    </p>\n\n<p>I didn’t see any of that when I watched the video.    </p>\n\n<p>I saw a very scared girl.<br/>\nI saw someone fighting for their life.    </p>\n\n<p>I shut it off after watching it three times in a row.<br/>\nWhat the hell had possessed me to shave my hair, mom was going to kill me.     </p>\n\n<p>They say once you shave your head your hair never grows back the same way again.    </p>\n\n<ul>\n<li><br/></li>\n</ul>\n\n<p>I was about to switch my phone off when it rang again.    </p>\n\n<p>There was no caller ID this time.<br/>\nFrowning, I answered it.    </p>\n\n<p>‘You’re mad at me, aren’t you?’<br/>\nI didn’t immediately recognize the voice.<br/>\n‘Who is this?’ I asked.<br/>\n‘It’s Park.’    </p>\n\n<p>I swear to God my heart stopped beating right then and there. I felt the ice creeping through my veins, and my hand began to shake.    </p>\n\n<p>‘Kyung? You still there?’<br/>\n‘What the hell do you want?’ I hissed.<br/>\n‘I saw your video.’<br/>\n‘You mean my grovelling apology.’<br/>\n‘I’m so fucking sorry, Kyung, I never meant for any of this to happen.’<br/>\n‘You publicly blamed me for everything. Where I come from that’s called saving your own lousy skin.’<br/>\n‘You think I wanted to? You think that was by choice? Kyung, the agency controls everything….’<br/>\nI made a contemptuous sound: ‘there you go again,’ I said, ‘blaming other people….’<br/>\n‘You don’t get the fame game, do you?’<br/>\n‘No, but I get the asshole game Park….’    </p>\n\n<p>‘I want to meet up with you.’    </p>\n\n<p>That took the wind right out of my sails. ‘Excuse me? Are you fucking crazy?’<br/>\n‘The trains start in just under an hour. I’d like us to meet face-to-face - I think you deserve to know what’s really going on.’<br/>\n‘I know what’s going on….’<br/>\n‘Listen,’ he said, ‘I’ve got information that will help protect you, I’m texting you an address, I’ll be there at 6am, if you don’t show up I’ll understand.’<br/>\nHe hung up after that.    </p>\n\n<p>I stared down at the address he’d texted.<br/>\n‘Go fuck yourself,’ I said and switched my phone off.    </p>\n\n<ul>\n<li><br/></li>\n</ul>\n\n<p>I left a note for mom, telling her I was going to the library. She was still asleep on the coach when I left the house around five-twenty that morning. I figured she’d sleep until at least eight.    </p>\n\n<p>I was wearing a hoodie and a surgical face mask as I sneaked out the back window and crept along a narrow alley located to the rear of our house.    </p>\n\n<p>The alleyway was cool, it ran all the way down to the river, but you could branch off at various points, like you’d have all these mini alleyways snaking away from the main one.    </p>\n\n<p>One of these mini alleyways brought me back onto the main road a couple of hundred yards downwind of our house. No one appeared to be filming from the opposite sidewalk but I wasn’t taking any chances, I kept the hoodie pulled down as low as possible, but not so low I couldn’t keep an eye on both sides of the street.    </p>\n\n<ul>\n<li><br/></li>\n</ul>\n\n<p>I needed to hear what Park had to say.    </p>\n\n<p>I tried to convince myself I didn’t want anything to do with him, but he’d promised me the information he had would make this whole thing go away, and somehow, despite everything that had happened, I believed him. There was more to this than met the eye.    </p>\n\n<p>I’d been reading a lot about these sasaeng fanatics and sure, they were crazy enough to do almost anything, but the ones harassing me appeared way too organized, like they were working in shifts, or relays or something…Sometimes it felt like an entire army had been mobilized against me. None of it made sense….    </p>\n\n<p>And how had they found out so much about me?<br/>\nThat still bothered me.    </p>\n\n<ul>\n<li><br/></li>\n</ul>\n\n<p>I needed to know what was going on.<br/>\nI fucking deserved to know what was going on?    </p>\n\n<ul>\n<li><br/></li>\n</ul>\n\n<p>The address took me to an abandoned office block near Jjokbangchon, which is a really rundown district of Seoul.     </p>\n\n<p>Trespass laws are really harsh in South Korea so I made doubly sure there was no one about before sneaking in through a rear window.    </p>\n\n<p>Once inside I picked my way across a landscape of rubble and busted furniture, broken glass crunching underfoot, naked wires dangling from the ceiling like dried brambles. Song once told me that large areas of Seoul were constantly being torn down, people moving out, the developers moving in. She told me that one day nothing of the past would remain.    </p>\n\n<p>I called out Park’s name, my voice echoing through canyons of desolation.    </p>\n\n<p>No response.    </p>\n\n<p>I was seriously creeped out by this time. The building was a mausoleum. I felt like the last girl on earth.    </p>\n\n<p>As I crossed a large reception area my phone buzzed, the sound driving a spike of fear through my heart.    </p>\n\n<p>I glanced down at it.    </p>\n\n<p><strong>I’m in the basement.</strong>    </p>\n\n<p>The message was from Park.<br/>\nI took a shuddering breath.    </p>\n\n<p>Nothing felt right about this. Standing there, in the middle of a derelict reception hall, I seriously considered getting the hell out of that place, going home to the US. To dad. There was no way I was heading down into the basement. Jesus, just the thought of it gave me the creeps.    </p>\n\n<p>But then another thought struck me; what the hell have I got to go home to? More intimidation? More threats? More fear? This cloud hanging over my head for the rest of my life. Everyone thinking I was to blame.    </p>\n\n<p>I needed to make a stand.<br/>\nI needed to bring this thing to an end.    </p>\n\n<ul>\n<li><br/></li>\n</ul>\n\n<p>I shot a quick video of myself.    </p>\n\n<p>Staring into the camera lens of my phone, I gave the address of where I was, I gave the time, and then I told the camera I was headed down into the basement to meet with Park. After that I uploaded the video to a file sharing site and sent the password to mom.<br/>\nIn the event I went missing, I just hoped she was tech-savvy enough to know what to do with it.    </p>\n\n<ul>\n<li><br/></li>\n</ul>\n\n<p>I took the emergency stairs down into the sub storys of the building, and the deeper I got the darker it got and the darker it got the more I got this feeling I was walking into a trap.    </p>\n\n<p>Below ground was almost pitch black, I had to use my phone’s flashlight app, sweeping the beam back and forth across acres of concrete and rubble and cursing my stupidity every time a rat darted in and out of the shadows.    </p>\n\n<p>‘Park!’ I called out.    </p>\n\n<p>There was no response, just the sound of my own voice echoing and booming into the void, but after a while I thought I could make out a faint glow ahead, like a camp fire flickering and dancing against the walls of a cave.    </p>\n\n<p>I scooped up an iron rod lying discarded amidst the rubble.<br/>\nI felt better with a weapon.    </p>\n\n<p>At some point I realized I was moving across an underground car park. It felt like an eternity in every direction. But that light fascinated me, drawing me towards it like a moth to a flame. I switched off the cell phone flashlight and then I switched off the phone. I didn’t want it ringing and giving away my position.    </p>\n\n<ul>\n<li><br/></li>\n</ul>\n\n<p>As I approached the light I could make out an enormous picture of Park hanging against a grey boundary wall. Hundreds, maybe thousands, of candles had been arranged on a series of stone steps placed immediately beneath the picture. The candles cast the picture in an almost religious glow.    </p>\n\n<p>As I stared at that picture I felt a chill creeping up my spine. The place stunk of death. I had to take my handkerchief out and cover my nose and mouth. But I didn’t retreat. I kept on staring.    </p>\n\n<p>Park looked like some kind of deity.<br/>\nHe looked beautiful.    </p>\n\n<p>The candles had burnt so low they’d formed a river of frozen wax that crept down across the steps and almost to my feet.    </p>\n\n<p>It was a shrine to Park. Josh sticks burned in silver holders, bouquets of red carnations, withered through lack of light.    </p>\n\n<p>Someone had been worshiping Park down here in the dark.    </p>\n\n<p>On the lowest step of the shrine six framed photos had been carefully arranged.    </p>\n\n<p>I crouched down and stared at them.<br/>\nI recognized those faces.<br/>\nThey were the six girls who’d recently been abducted in Seoul.    </p>\n\n<ul>\n<li><br/></li>\n</ul>\n\n<p>I don’t know why, but something drew my eyes upwards.<br/>\nThat’s when I saw them.    </p>\n\n<p>Six bodies hanging upside down from the ceiling. I could barely make them out in the gloom so I switched my cell phone on and directed the flashlight upwards.    </p>\n\n<p>The bodies had been wrapped in shrink film and strung from a set of ceiling rings by heavy steel chains. They looked like cattle carcasses, only they had the proportions of human beings – of young women….    </p>\n\n<p>It hit me then.<br/>\nThey were the missing girls.    </p>\n\n<p>They’d been murdered and offered to Park as some kind of pagan sacrifice.<br/>\nWhat in God’s name was going on?    </p>\n\n<ul>\n<li><br/></li>\n</ul>\n\n<p>My nerve broke and with an involuntary scream of terror I turned to flee from that nightmarish scene.    </p>\n\n<p>They were standing behind me.<br/>\nI hadn’t even heard them approach.    </p>\n\n<p>They were all wearing Park masks and skinny black suits. They stood as though posing for a menswear catalogue. Seven of them. Seven Park clones. And every mask wore this smile that was all the more terrible for being so utterly banal.    </p>\n\n<p>I almost had a heart attack when I saw them standing there.    </p>\n\n<p>‘What’s going on?’ I stammered, ‘where’s Park?’    </p>\n\n<p>‘We all Gong!’ They whispered. ‘All is Gong!’    </p>\n\n<p>And with that they all started blowing on these shrill fireman’s whistles. The sound was horrendous. And at the same time, they were all pointing at me and quick-marching on the spot. They were moving in precise unison. Like they’d choreographed this moment. Like they’d been practicing for weeks.    </p>\n\n<p>They’re clones. I remember thinking, they’re not human. They’re either clones or some kind of glitch in the matrix.<br/>\nI was terrified.<br/>\nLike literally immobilized with fear.    </p>\n\n<p>‘All is Gong!’ They kept chanting.    </p>\n\n<p>A moment later they came at me like a bunch of feral rats.    </p>\n\n<p>I dropped my phone and swung the iron rod I was holding as hard as I could. I only intended to ward them off but the rod connected with the side of the first guy’s head, knocking his mask off with the force of the impact, and he went reeling sideways as I turned and fled into the dark.    </p>\n\n<ul>\n<li><br/></li>\n</ul>\n\n<p>Whistles pierced the air behind me. They sounded like hunting whistles, and right then I felt like prey. I twisted my shoes off and ran barefoot, trying to stay as quiet as possible, but I heard them coming after me, flashlights from their cell phones groping towards me through the dark.    </p>\n\n<p>I knew they were circling me, that there was no real chance of escape, but sometimes, when you’ve got nothing to lose, you wind up doing the most unlikely things.    </p>\n\n<p>I passed a support column made of reinforced concrete that had degraded to the point the steel bars were sticking out of it like broken ribs. I barely thought about it. I grabbed the bars and climbed the column out of sheer desperation, using every niche and crevasse I could find, and when I was way up close to the ceiling I held on for dear life and stayed as still and as quiet as possible.    </p>\n\n<p>I heard the Park clones rushing past beneath me, their whistles stabbing at my eardrums.    </p>\n\n<p>As the sounds of their whistles dwindled into the distance I climbed back down the column and struck out in the opposite direction from the clones.    </p>\n\n<p>At last I pushed through a side exit and up a series of narrow stairs. I was moving in almost total darkness, tripping and stumbling over discarded office furniture, pausing every now and then to listen out for sounds of pursuit.    </p>\n\n<p>I pushed through another door and instantly covered my eyes to ward off the sudden glare of daylight. When my eyes had adjusted I realized I was back in the reception hall.    </p>\n\n<p>Sobbing with relief I started across the hall, heading for the window I’d first gained access to the building through, but then I stopped with a sharp intake of breath.    </p>\n\n<p>A Park clone was standing between me and the window.    </p>\n\n<p>I was like a deer caught in headlights, my heart beating so hard I thought it was going to come bursting through my chest.    </p>\n\n<p>The clone raised a hand and pulled his mask off.    </p>\n\n<p>It <em>was</em> Park. \nThe real Park.    </p>\n\n<p>For a moment I couldn’t understand what I was seeing.    </p>\n\n<p>He held a finger to his lips. Hushing me. Then pointed towards the window I had been headed towards.    </p>\n\n<p>I continued towards the window, trying to give Park as wide a berth as I could.    </p>\n\n<p>As I passed him, he said, ‘tell the world, Kyung, the fucking industry is sick, the agencies are out of control, I can’t get out…please, help me get out….’    </p>\n\n<p>I’ll never forget the look of sheer anguish that masked his face at that moment. He looked like he was in hell.    </p>\n\n<p>When I was past him I raced towards the window, climbed through, and ran for my life.    </p>\n\n<ul>\n<li><br/></li>\n</ul>\n\n<p>I called the police after that but by the time they arrived in the building the bodies had gone, the shrine had vanished, and there was no sign of a crime.<br/>\nThe agency had cleaned house.    </p>\n\n<p>I left South Korea less than a week later.    </p>\n\n<p>I live with dad now. Mom decided to stay on in South Korea, but she visits the US from time to time.    </p>\n\n<p>I miss her.    </p>\n\n<p>Just one more thing, three weeks ago I read that Gong Woo Bin hung himself from the light fixtures in his dormitory. It was widely reported at the time that he’d scrawled the words <strong>“Who am I?”</strong> on the living room wall, but most probably that’s just a rumor.    </p>\n\n<p>Despite everything that happened I actually feel sorry for him.    </p>\n\n<p>I hope in death Park finally found the peace that eluded <a href=\"http://delunachike.com/\">him in life.</a>     </p>\n</div>\n","author":"ChikeDeluna"}