{"rank":"11","title":"The Woman With The Hook","id":"8jfh1m","url":"/r/nosleep/comments/8jfh1m/the_woman_with_the_hook/","time":"1526328900000","body":"<div class=\"md\"><p>At the age of 15, I began looking into the life of a woman called Sofia Hermul. Sofia lived across the street from me and there were a few very weird incidents that happened surrounding her and her house. I have multiple stories to share, ending in a finale that no police officer, detective or kid could&#39;ve thought of. I&#39;ve kept my mouth shut for too long, it&#39;s about time the truth was exposed.</p>\n\n<p>Sofia was always an odd woman. At first, she was just your typical middle class journalist. She was married and had 2 kids. One of her kids was a loner, called Ash. Ash was a weird girl. She kept to herself and occupied herself with books surrounding murder and weapons, which itself didn&#39;t raise any alarm bells because I mean, we all have our demons, who was I to judge? </p>\n\n<p>Anyway, I kept my distance from her typically. I guess you could call me a nerd/loser? I enjoyed my video games and I had my edgy moments, but I wouldn&#39;t have called myself &#39;unpopular&#39;. People knew who I was and I had a decent amount of friends. </p>\n\n<p>Anyway, back to the story at hand. Ash was bullied by a lot of people in school. She was never driven to the point of doing something drastic, but she was &#39;unpopular&#39;. Rumours around the school were that she was abused by her step-father, but it wasn&#39;t until the day that she came into school with a broken arm that I started sounding some alarms. </p>\n\n<p>Myself and my two friends, Lukas and Maya, agreed that we should head to Ash&#39;s house and see what happened. If we could help her out, then we should do the right thing. Of course, as I&#39;ve grown older, I&#39;ve realised that we were too dumb to realise that this was larger than we could ever have predicted.</p>\n\n<p>We took our bikes to my house and grabbed 2 flashlights, a switchblade and a crowbar. We almost didn&#39;t take the crowbar, but the crowbar ended up being the only thing we really needed.</p>\n\n<p>We ventured across the street at around 9:30PM, it was winter in a middle class neighbourhood, we wore black hoodies and jeans to stay hidden and if anyone in the house turned on a light or looked out of a window, we&#39;d cower in the snow or hug the wall. We made it to the backdoor, which was unlocked.</p>\n\n<p>&quot;Slightly weird.&quot; Lukas commented, as he switched the switchblade. It was a black steel switchblade, blending in with the darkness that surrounded us, little did we know that it was more dark inside the house then it ever could be outside.</p>\n\n<p>Maya chuckled, I was pretty sure they were flirting and that they liked each other but I didn&#39;t really feel like it was a good time to mention it. Lukas, pushed the door open gently stepping into the house, followed by Maya, and then by myself. I gently closed the door behind me.</p>\n\n<p>As we entered, we heard the clanging of metal. Lukas paused, raising the blade as someone stepped around the corner. </p>\n\n<p>A woman stepped out from around the corner, &quot;You&#39;ve made a mistake.&quot; The woman said, she was masked in a shadow but her eyes were visible. They were dark, almost completely black. But that wasn&#39;t her most disturbing feature... upon where her right hand should&#39;ve sat, was a metal hook. She chuckled, then stepped back and vanished.</p>\n\n<p>Lukas got up, slowly moving backwards whilst gripping the blade. Maya did the same but I remained still, frozen. I gripped the crowbar but that was the only part of my body I could feel. Maya, grabbed my collar, yanking me back. </p>\n\n<p>I shook my head, snapping from my trance. Lukas turned, yanking at the door handle. It was locked. &quot;CREEPY BASTARDS LOCKED THE FUCKING DOOR!&quot; Lukas yelled, grabbing the crowbar from my hand. He slipped the crowbar into the door crack, pulling at it with all of his might. </p>\n\n<p>That&#39;s when he was thrown back, against the wall. It all almost happened in slow-motion. It almost looked like an act, but as he hit the ground, Maya and myself knew it wasn&#39;t an act. Ash turned the corner, gripping a large, machete blade. A grin encased her pale, sweaty face. &quot;Welcome, friends.&quot; She said, her face twitching as she tilted her head.</p>\n\n<p>Maya picked up the crowbar, Ash tilted her head again, slashing at Maya. Maya ducked under the machete slash with ease, raising the crowbar and bringing it down upon her face. </p>\n\n<p>Ash dropped to her knees, her face was titled to the side. She then brought her face back up to stare at us with those dead eyes. Her face itself was crooked, broken. Her jaw was smashed and two of her teeth were on the floor. She grabbed at the machete, driving it at Maya. Maya raised her hand, allowing the machete to impale her hand, rather than her chest. </p>\n\n<p>She brought her foot into Ash&#39;s stomach. Ash was taken aback. I grabbed the crowbar, turning to Ash&#39;s stepfather who had just walked in with that same, creepy smile. His eyes were as dead as Ash&#39;s. </p>\n\n<p>Ash grabbed her elbow, snapping her broken arm back into place. Maya slashed at her arm, cutting a deep cut into Ash&#39;s arm. She yelped, falling back. I struck Ash&#39;s stepfather&#39;s arm, snapping it in two. He grunted, raising a hatchet and chopping his own hand off. He glanced at Ash, &quot;You were always weak.&quot; he&#39;d grunt, as he smashed his hatchet into her head. </p>\n\n<p>Lukas grunted, his eyes were closed and he was clearly unconcious. Ash fell back dead, dropping her lifeless body next to Lukas&#39; unconcious body. Ash&#39;s stepfather returned his dead stare to Maya, &quot;You&#39;d be perfect for our family.&quot; He said, a dark smile covered his face.</p>\n\n<p>Maya dropped to her knees, her eyes were enlargened and as dead as Ash&#39;s and her stepfather&#39;s. &quot;Yes Father.&quot; she said, her voice was lifeless. I cried out, stepping back. I glanced at Lukas&#39; body. Maya stood up, standing beside her &#39;Father&#39;. The woman with the hook appeared again, standing beside what I could only assume were her two &#39;minions&#39;. The word seemed so unrealistic but that was all that I could think of. </p>\n\n<p>That&#39;s when Lukas&#39; unconcious body rose, grabbing the crowbar and swinging at the woman with the hook. The woman raised her left arm, the crowbar would bounce back, hitting Lukas in the face. He fell back, tossing me the crowbar. I caught it, swinging at the woman again, this time the crowbar would connect, breaking the woman&#39;s jaw. Lukas got back up, charging to my side. </p>\n\n<p>The woman screamed something in a foreign language. We both backed up as Maya and her &#39;Father&#39; stepped forwards, gripping their weapons.</p>\n\n<p>I shook my head, &quot;Fuck this.&quot; I yelled, tossing the crowbar through a window that lay across the room. I charged past the crowd, followed closely by Lukas and dove through the window. Lukas collapsed after me and the house erupted into flames. The cackles of Maya, the stepfather and the woman with the hook echoed throughout the neighbourhood. </p>\n\n<p>I grabbed the crowbar and pulled Lukas to his feet, charging back to the house. We ran upstairs and watched the blaze from across the street. That&#39;s when we noticed something written in the snow next to the blazing house. </p>\n\n<p>YOU&#39;RE NEXT</p>\n\n<p>Me and Lukas vowed to never speak about these events again. Little did we know, that was the start of something scarier than we could&#39;ve ever predicted. </p>\n\n<p>The most disturbing part was that everyone acted like Maya never existed and that nobody lived in the house opposite us. </p>\n\n<p>Sofia existed. And I became dead set on researching this &#39;being&#39;. Little did I know it would lead to these events. </p>\n\n<p>That&#39;s the end of the first chapter of my story. The second will come in due course, unless the woman comes for me again. In which case guarantees cannot be made. </p>\n\n<ul>\n<li>Fergus, \nPrivate Investigator</li>\n</ul>\n</div>\n","author":"InsertNerdyNameHere"}