{"rank":"91","title":"Case #7- The Village of Lost Souls- Part 1","id":"8jfhq7","url":"/r/nosleep/comments/8jfhq7/case_7_the_village_of_lost_souls_part_1/","time":"1526329026000","body":"<div class=\"md\"><p>I fidgeted in my seat, nervous. Jacob was the one who usually handled this part of casework but he left for a family vacation in Pennsylvania two days before, leaving Moxxy and I to fend for ourselves. Meeting new people gave me anxiety. Meeting people who wanted our help with supernatural problems? That was a little worse. Having to pretend like I knew what I was doing because Moxxy, for whatever reason, decided to rent us an office so we could be “professionals”? That was on “just kill me now” levels.</p>\n\n<p>The door opened and Moxxy led in a young man who looked as nervous as I felt. He was short and squirrely, with no facial hair. He had the kind of face that was meant he’d be carded until his forties. He offered me his hand. “Hello! My name’s Mark Neil.”</p>\n\n<p>I shook his hand. “Hi, Mark. I’m Emily. I see you’ve already met Moxxy. Please, have a seat!”</p>\n\n<p>He sat down in front of the desk while Moxxy sat in the corner. She gave me a thumbs up and an encouraging smile. I read Mark’s aura. He was nervous and excited, yes, but underneath that was fear. He was concealing it well, but auras don’t lie.</p>\n\n<p>He coughed lightly into his hand to break the tension and started talking. “Thank you for seeing me. I’m just going to get this all out, okay? I’ve always been… sensitive. To spirits, I mean. I can hear them talking sometimes and every once in awhile I can see them. My dad passed away a couple weeks ago and I’ve been seeing his ghost. I’ve seen standing outside on our lawn, I’ve seen him walking through the halls in our house. He never talks to me. I don’t think he can even see me. But I’m pretty sure he’s trying to warn my mom and me because she’s sick now, just like he was. I’m scared she’s going to die too. So I got my ouija board and asked my spirit guide what to do… oh, and I have a spirit guide. Just f-y-i. Anyway, she spelled out “Mielke Investigations” so I googled you and here I am, asking for your help. Okay, that’s everything.”</p>\n\n<p>“Wow! First off, I’m sorry for your loss.” He nodded this thanks and I continued. “It’s not unheard of for spirits to visit their loved ones to warn them about something but before we jump to that conclusion, we should probably try to contact your father.”</p>\n\n<p>“I’ve tried with the ouija board. He never says anything.”</p>\n\n<p>“We have a few different options to try. With your permission, we’ll come to your home and do a thorough investigation.”</p>\n\n<p>His aura shifted. The fear moved closer to the surface but so did another emotion I hadn’t seen in him before: hope. “I would be very grateful to you for that. I live in Dodgerton Village. It’s pretty far from here.”</p>\n\n<p>“That’s okay, Mark. We’re willing to travel.”</p>\n\n<p>We hammered out the details of where Moxxy and I would sleep once we got there. Moxxy showed him out when we were finished and I slumped into my seat. Being professional was exhausting. At least the case seemed like it was going to be easy. A simple attempt to verify a spiritual manifestation followed by attempting to contact it. Whether we were successful or not in our goal, the end result would be the same: encourage Mark’s mother to go to a hospital. If she really was sick, she needed doctors, not ghost hunters.</p>\n\n<p>Moxxy came back and gave me a huge smile. “You did great, Em! Me and Jacob couldn’t have done better if we handled it ourselves!”</p>\n\n<p>“Thanks, but that was the easy part. We still have to actually go there and do the work.”</p>\n\n<p>She waved her hand dismissively. “It’s a cakewalk. Standard haunting by a recently deceased relative.”</p>\n\n<p>“What if it’s not, though?”</p>\n\n<p>“Well, then we’ll deal, like we always do.”</p>\n\n<p>The next day we packed our bags and set out for the village. Mark was kind enough to give us a ride there in his car. The drive took several hours, during which Moxxy and Mark discussed paranormal investigation. He was excited and wanted to know everything about what we do. Moxxy was happy to tell him but I was starting to get suspicious that he was one of those types who’d fake a supernatural occurrence for attention. The fear in his aura had vanished since we spoke the day before. Maybe it was only the fear that comes with lying.</p>\n\n<p>Dodgerton Village may have had a small population, but it was spread over a good amount of land. Not at all the tiny, one square mile community I was expecting. Mark’s house was of a nice size. Two floors, four bedrooms. The kind of house it was only really feasible to own in a small town, given the cost of living in a city. We set up in one of the bedrooms. Mark offered to give Moxxy and I separate rooms, but I was more comfortable sleeping with a friend when staying at a strange house.</p>\n\n<p>We had yet to meet Mark’s mother. He told us she was sleeping, that the doctor told her to get as much rest as possible. I made a mental note to inspect her aura when we eventually met.</p>\n\n<p>And speaking of, the house had some irregularities in its aura. It wasn’t unusual for houses that had seen murders or other great tragedies to soak up that negativity but that wasn’t what was going on in Mark’s house. There was a negative energy, yes, but it didn’t feel like part of the house’s aura. It felt foreign, like something had tracked it in.</p>\n\n<p>Moxxy mounted a camera in the living room to record Mark and myself. We sat on the couch and Mark made an attempt to contact his father. “Dad? Are you there? These are friends of mine. They’re here to help. If you’re here, can you give me a sign of your presence?”</p>\n\n<p>I scanned the room, looking for changes in the energy that might indicate a spiritual reaction. Mark continued.</p>\n\n<p>“There’s something I need to know, Dad. Is Mom going to die? Did you come back to warn us about it? If you did, please let me know. Please give me a sign that you can hear us. I would like you to make your presence known. Can you do that for me?”</p>\n\n<p>There was no reaction. The energy in the room didn’t change. I looked at Mark and saw that he was getting frustrated. “Hey, it’s alright. Sometimes it takes a little while for a spirit to respond.”</p>\n\n<p>“Why can’t I hear his voice?” He asked. “I hear ghosts talking all the time without me asking them. Why isn’t he answering me?”</p>\n\n<p>“Let’s try something different.” I took his hands in mine. “I’ve got some psychic ability too. Maybe if we combine our energies, we’ll get some kind of reaction. Like boosting a signal or something.”</p>\n\n<p>“Okay, you’re the expert.”</p>\n\n<p>Actually, I just made that up. Still, I figured it couldn’t hurt to try and after a few moments, it became clear that joining hands was doing something. My sensitivity to supernatural energies felt heightened. I could feel Moxxy’s presence without looking at her. It went beyond that, though. I could tell exactly where the mice were in the walls and basement. I knew there was a bird nest with two chicks in the attic. And I could feel Mark’s mother in the master bedroom. Something was wrong with her aura. It felt weak. Tainted. Whatever was wrong with her wasn’t a normal illness, it was affecting her on a spiritual level.</p>\n\n<p>An image began to form in my head, an image of a man in black robes. He was clean shaven and unsmiling. His eyes were icy sharp. As I watched, an altar materialized in front of him. In the center of the altar was a golden bowl filled with blood. Around the bowl were bones carved with ornamental glyphs or runes. The man took a vial of blood from his pocket and emptied it into the bowl. Then he began to chant.</p>\n\n<p>“Emily!” A hand smacked my face hard, forcing me out of the vision. I blinked and saw Moxxy in front of me. She was gripping my shoulders hard and looked concerned. Behind her, Mark stood in awe, eyes wide and mouth open.</p>\n\n<p>“What did you do that for?”</p>\n\n<p>Moxxy sighed and hugged me. “Fuck! You scared me, Em.”</p>\n\n<p>“You’ve been catatonic for like, ten minutes!” Mark sounded excited. “Were you in some kind of psychic trance? Did you see my dad?”</p>\n\n<p>“No.” There were framed photographs of Mark’s family all around the house. The man I saw wasn’t his father. “Can I actually talk to Moxxy alone for a minute?”</p>\n\n<p>“Yeah, sure. I’ll go make some coffee.”</p>\n\n<p>He left for the kitchen. I relayed everything I’d seen in my vision to Moxxy and told her about the unnatural illness of the woman in the next room. She looked more excited at the revelation than was appropriate. “Do you think someone’s cursed her? And maybe Mark’s dad too?”</p>\n\n<p>“I don’t know but it’s definitely a possibility. If it is someone using magic, how are we going to fight them? We don’t have a good record when it comes to fighting witches.”</p>\n\n<p>“What are you talking about? We deal with Hannah all the time, don’t we?”</p>\n\n<p>“Hannah lets us go all the time. If she wanted to, she’d turn us all into stains on the walls. Look what she did to Donnie, and he’s better than we’ll ever be.” An idea started to form in my head. “And she’s willing to cooperate sometimes. Maybe we could get her help here? She might recognize whatever magic that guy was doing.”</p>\n\n<p>Moxxy groaned. “Do we have to? I hate that psycho bitch. We don’t even know how to get ahold of her anyway.”</p>\n\n<p>“You’re not wrong. I’ll think about it.”</p>\n\n<p>Mark came back with two mugs of coffee. “So, if it wasn’t my dad, what did you see?”</p>\n\n<p>“I don’t want to say until we know for certain. But I need to talk to you about something. This is looking like it might be more than a simple haunting. We might have to stay here longer than we planned. Is that okay?”</p>\n\n<p>Mark nodded eagerly. “Mi casa su casa.”</p>\n\n<p>And so it began, my first case where I lead from the start. So much for being a cakewalk.</p>\n\n<p>(Case #7 will <a href=\"https://www.reddit.com/r/JacobMielke/\">continue in an update.</a> Mielke Investigations is an <a href=\"https://www.facebook.com/jacobmielkeswriterprofile/\">ongoing account.</a> )</p>\n\n<p>Update: Part 2 can <a href=\"https://www.reddit.com/r/nosleep/comments/8jzpg7/case_7_the_village_of_lost_souls_part_2/\">be read here.</a></p>\n</div>\n","author":"JacobMielke"}