{"rank":"27","title":"The Photographs Inside","id":"8jfq7f","url":"/r/nosleep/comments/8jfq7f/the_photographs_inside/","time":"1526330767000","body":"<div class=\"md\"><p>I like to collect strange books. Not because I hunt for value, there’s no agenda to the way I look for them, I simply pick them up as I go along. If I spend more than a minute looking at a single book, I’m probably going to buy it. If it catches my eye day-by-day, as I walk by, eventually I will claim it. </p>\n\n<p>I’ve always loved books, but my love of them came from inheritance. Or, hand-me-downs, however you see it. I’d visit my grandmother and come home with books read by family members years before I was born. I built up a reputation as the quiet, bookish child. People gave their rejects to me rather than throwing them out. </p>\n\n<p>When my great grandmother passed away, they put aside some of her books for me. </p>\n\n<p><em>‘Dorothy Eeling May 26: 1933’</em></p>\n\n<p>Is inscribed on the first page of a red leather copy of Ivanhoe. She would have been 15 then. The handwriting is of her father, my great-great grandfather, Mr. Eeling. </p>\n\n<p>That’s what books mean to me. They tell a story. The older, or more unusual, the better. </p>\n\n<p>Luckily, living in England, it’s quite easy to find an abundance of old things. We seem to be tripping over antiques and curiosities here. They line charity shops, and even skips. Books like my dear copy of Ivanhoe all too often end up discarded when an elderly person passes away. </p>\n\n<p>And there I am to find them. That’s a little morbid, I admit. However, these things are meant to be shared and loved after all. Besides, I enjoy the thought that many people over many years have interacted with my collection. It’s the same reason why I adore visiting historical sites. Walking in the footsteps of those who came thousands of years before. </p>\n\n<p>There’s a village near where I live that has a castle just outside it. One of my favourite spots in this land. Walking around it, climbing its stairs, finding its little rooms and cellars is a joy. I found graffiti there from <strong>1753.</strong> <strong><em>Graffiti.</em></strong> </p>\n\n<p>I digress, my main sentiment is that I’m mildly obsessed (in a good way, if there is one) with times long past by. Thus, explaining my collection of oddity books. </p>\n\n<p>I live quite some ways from where I was born. I moved for University and stayed because it was easier. However, I visit home now and then. I may stay for a week or two in summer. Last year was one such summer. </p>\n\n<p>My family live in a town, in a neat little Victorian terrace. There’s not much in the town, so I rarely bother going out. Living in a city now is rather soul sucking. Growing up, on the edge of my birth-town, we faced countryside. </p>\n\n<p>I descend from a long line of farmers, on both sides of my family. If it’s possible to inherit a love of something, then I inherited a love of nature. </p>\n\n<p>While home, I tend to focus my energy on what I so miss in my new grey city: greenery. Rushing rivers, whispering trees, soft grass, the song of a blackbird, or the cooing of a wood pigeon. I truly miss the sounds of home when I am away. So, when I am home, I take myself on walks. </p>\n\n<p>I walk up the tow path of the canal. I meander the fields, watching the wildlife. Or I venture up the river. Generally, all the paths lead back towards the town, some way or another.</p>\n\n<p>One day, I followed the river for a while, however the sun decided to hide behind the clouds. It drew me back towards the town with the threat of rain. So, I browsed some shops. Second-hand, and charity shops mainly. After a series of unimportant events, and saving the best for last, I went to the local charity book shop. </p>\n\n<p>A nice shop, however I had experienced limited success there before. This was no such day, this was a day of success. </p>\n\n<p>I wandered around aimlessly, flicking through a few titles. It was mostly disappointing as the ‘classic literature’ only seemed to have modern reprints. Then I went to the non-fiction section, which I don’t usually. There was a tall glass cabinet there, it had a few thick scientific books and encyclopaedias in. At the very bottom, at the back, there was a stack of three books. </p>\n\n<p>Three brightly coloured hardback books with abstract illustrations all over them. They were scientific books: <em>‘Man and his Ancestry’</em>, <em>‘Nerves, Brain and Man</em>’, and <em>‘Man Against Germs</em>’. </p>\n\n<p>I was smitten with their unique covers and bought the lot happily. I still remember walking from the shop, blue carrier bag in hand, the sun had just begun to shine again. The tarmac was warm, and the smell of car fumes that bit stronger in the air as I prepared to walk down the hill, back home. Once back, I must admit, I showed them off a little. Then packed them safely away.  </p>\n\n<p>Sadly, I did not properly look at them until I had gotten them back to my flat, in my dreary grey city.</p>\n\n<p>I flicked through two of them, having a look at the illustrations, giving them a scan. Most of the information will no doubt be outdated now – they were all published in the 60’s.</p>\n\n<p><a href=\"https://imgur.com/5olRBF9\">Here is a photograph of the books.</a></p>\n\n<p><a href=\"https://imgur.com/QYjrKCa\">Here is one showing the cover of Man and His Ancestry.</a></p>\n\n<p>Upon opening ‘Man and His Ancestry’ (my favourite of the books, going by cover artwork) I was met with what I first thought were little black squares of paper.</p>\n\n<p>They slipped out so suddenly it surprised me greatly. Then upon further inspection, and holding them up against the window, I discovered they were photograph negatives. They seem to depict a family holiday, or perhaps a summer in the life of this family. Some seemed to be laminated, whereas some were not.</p>\n\n<p><a href=\"https://imgur.com/F829lFc\">Here is a photograph showing how I found the negatives.</a></p>\n\n<p><strong>All the photographs I found:</strong> </p>\n\n<p><a href=\"https://imgur.com/20hsEsc\">Photo 1: a baby in a pram.</a></p>\n\n<p><a href=\"https://imgur.com/jVsqF2n\">Photo 2: a boy buried in sand, with an older woman sat near.</a></p>\n\n<p><a href=\"https://imgur.com/Xe6Mlpw\">Photo 3: a man and woman (not the same woman from 2) standing together.</a></p>\n\n<p><a href=\"https://imgur.com/JuWdDi1\">Photo 4: a boy laying on the sand.</a></p>\n\n<p><a href=\"https://imgur.com/OH2JAKW\">Photo 5: the same woman and (possibly) the same baby.</a></p>\n\n<p><a href=\"https://imgur.com/JkMW10P\">Photo 6: another shot of the buried boy and the older woman.</a></p>\n\n<p><a href=\"https://imgur.com/IdPedcL\">Photo 7: the same man and the same boy.</a></p>\n\n<p>I photographed them, as you can see, and sort of forgot about them. I put the negatives back into the book and went on with my life. </p>\n\n<p>However, something had started. Something I cannot entirely explain. Which is why I’m writing here now; I just needed to explain all of this to someone. </p>\n\n<p>I don’t know how long it was, but sometime after I found the negatives, my dreams changed. Not in any major, dramatic way. Just one key feature: crying. A quiet, muffled crying. It was so subtle, so, strangled. Just out of reach, yet I heard it, and it woke me up every time. </p>\n\n<p>This turn of events seemed uneventful. I just started a new project at work, and I live alone, so I could only assume it was from stress. I started going on my phone less before I went to bed, but it only made the crying louder. It seemed the more I tried to focus on being calm, and relaxing, the louder it got in my mind. </p>\n\n<p>The soft, untouchable tears ebbed closer to me each night. That is the only way I can explain it. They got closer to me. Maybe that is why they had been so quiet, because the source had been far away. This strange dream was developing into something that quite scared me. However, it had no visual accompaniment. To call it a dream is a vague description, but I don’t know how to describe it. Perhaps as in interruption, or background noise. A background trying to make its way to the foreground. </p>\n\n<p>I was still having dreams while hearing the crying, but my dreams started to fade. First, they became slowly desaturated until all the colour was gone. Then they started to dissolve. Blackness taking over until that’s all there was. Blackness, and crying. The crying echoes against the great dark space. It feels large, but tiny at the same time. It’s hard to explain with words, it’s more of a feeling. </p>\n\n<p>I don’t dream anymore.</p>\n\n<p>Normally I would blame stress, or anything else. Even now it seems wild to accuse these photographs of anything, but they are the key. They are the starting point. </p>\n\n<p>Up until recently I believed it was just me, but that was up until I saw the woman.</p>\n\n<p>I saw her in my dream. </p>\n\n<p>Out of the darkness – the black, emptiness that had been my dreams, she turned to me. I woke up with a fright. </p>\n\n<p><em>And she was still there.</em> </p>\n\n<p>The room was pitch black, but her white face stared at me, wide eyed. Tears rolled down her cheeks, they were thick and inky. Black against her pale, pale face. </p>\n\n<p>Her eyes shifted behind me, although there was nothing there but wall. Her mouth abruptly dropped open, much too far, revealing a gaping black hole. She gasped and folded into nothingness. Like a piece of paper her face folded down until it was gone entirely. </p>\n\n<p>I almost smashed my lamp, as I threw my hand down to switch it on with so much force. The warm, amber light it emitted revealed no one was in the room with me. </p>\n\n<p>It’s safe to say that I have gotten <em>no sleep</em> since then. </p>\n</div>\n","author":"SquireScribbles"}