{"rank":"61","title":"Sometimes I sleep on the ceiling","id":"8jfx8y","url":"/r/nosleep/comments/8jfx8y/sometimes_i_sleep_on_the_ceiling/","time":"1526332264000","body":"<div class=\"md\"><p>The first time it happened, I wasn’t sure what was going on. I awoke on the floor, several feet from my bed. I landed with a bone-jarring thud which knocked the breath out of me. It seemed unlikely that I’d just rolled out of bed and landed so far from the edge of the mattress. The most logical explanation I could come up with at the time was that I’d been sleepwalking in the searing August heat and ran into a bedpost. </p>\n\n<p>Oddly, I had strange, unexplained indentions all over my skin. Since my carpet is very soft, I couldn’t see how its woven fibers could make all of the pitted impressions I had on my arms and shoulders. Only later did the bizarre truth present itself. I gazed up at the ‘popcorn’ texture on my ceiling and had an epiphany. The indentions in my skin were just like the decorative plaster ‘drips’ on the ceiling. There were even some areas worn smooth from the gritty friction of me rubbing against them. While the gravitational logistics escaped me, I finally had to accept the truth. I’d been sleeping up there.</p>\n\n<p>I couldn’t begin to explain how I achieved nocturnal weightlessness, but somehow I was. Nor could I glean any reason for the ‘Peter Pan syndrome’. Occasionally I’d wake up a split second before falling to the floor. Thankfully, most of the time I was still floating directly over the mattress. What was the catalyst for this baffling phenomenon? Was it related to something I ate? Was I harnessing telekinetic powers in my sleep? Had a local witch placed an evil spell on me? All kidding aside, it was really happening and I had to consider all scenarios; likely or not.</p>\n\n<p>Besides the bumps and bruises of falling a significant distance, there are other inherent risks associated with being an unmoored human zeppelin. What if I accidentally left the window open because of the stifling heat? Would I float off and asphyxiate in the thin upper atmosphere? I assumed either that would happen or I’d awaken high in the sky and plummet to my death. </p>\n\n<p>Thankfully there’s a large ceiling fan in the middle of my bedroom to make sleep more bearable this time of year. Ordinary, it would’ve been a godsend in the summer months but with the new risk of accidentally drifting into it, it was a different story. It has five aircraft aluminum blades and an industrial fan motor. Just the thought of being chopped to death by those high-speed props caused me to cringe. There was no appealing scenario under those circumstances. Either I’d die of from merciless temperatures, or risk being chopped to bits.</p>\n\n<p>To thwart those possibilities, I began tethering myself to the mattress with a rope. Although it was loose enough to allow me to turn over in my sleep, I’d often wake up with a crease on my abdomen. I must have floated against it with no remaining slack in the line. It was further proof that I was at real risk of drifting away or harming myself. At the initial realization of what was going on, I was too preoccupied with the risks of my nocturnal behavior to wonder what caused it to happen. That was to come later.</p>\n\n<p>Mankind is always looking to turn his challenges into advantages. Turn lemons into lemonade and that sort of thing. My strange tendency to float around in my sleep was no exception. I wondered if I could learn to control my unconscious levitation for some form of financial gain. I awoke the next morning with the strangest compulsion I’ve ever felt. I had an unexplained ‘need’ to hold a piece of chalk! At first it made no sense. What could it possibly mean? Then I remembered from my college art classes that Michelangelo had painted the top of the Sistine Chapel while lying completely on his back! It was a very exciting realization. </p>\n\n<p>Maybe my unconscious mind wanted to express its creative side and illustrate my ceiling in a similar way! I was a decent artist but who could say how much greater my talents might be under the tutelage of the sandman? Excitedly I drove to a craft store and purchased a pastel set of artist chalk. I was anxious to see what my dreaming self would create while I slept. That night I was careful to place the opened drawing set on my nightstand, and leave my bed mooring partially unfastened. Instead of looping the rope around the mattress at my midsection, I put it around my waist and tied the end to the headboard. That would allow me enough slack to reach the ceiling but still avoid the ceiling fan. With any luck, I’d awaken to a colorful ‘masterpiece’ and possibly chart a new career course for myself.</p>\n\n<p>To my disappointment, there was only a single circle written on the ceiling the next morning. Even more disheartening, it was drawn with the most common run-of-the-mill yellow piece of chalk. Obviously my muse was still flexing its creative muscles. Either that or my unconscious self wasn’t going to be much of an artist. Still, it was significant progress. I had successfully managed to give my dreaming mind a means of expressing itself. Rome wasn’t built in a day. ‘Practice makes perfect.’</p>\n\n<p>The next night I hoped for a huge jump in my unconscious artistry but I tried to temper those expectations. Upon awaking, I still had the same ordinary piece of classroom chalk in my fingers. The only new addition to the ceiling illustration was a single line extending from the circle. Again it was anticlimactic. On my second pass, I was hoping for greater progress. Instead it seemed like I was destined to just add a single geometric shape each night to the mystery drawing. Was it supposed to be minimalist modern art? At the current pace, it might be weeks before a finished composition took shape. </p>\n\n<p>Each night I added another linear piece to the puzzle. On the floor I found several pieces of broken yellow chalk. I assumed they’d fallen from my hand as I reached the full limit of the mooring rope. Because of that, the newest addition was incomplete. I really didn’t want to give myself any more slack since it brought me closer to the ceiling fan blades but by my calculations, I still had a couple more feet of clearance. I desperately wanted to complete the drawing, even if it wasn’t a true masterwork. The shapes and angles were very familiar but I just couldn’t place them into a recognizable context. I went ahead and loosened the rope to allow maximum safe reach. The spinning blades would only be inches from my reach but the deep compulsion to see the process through was stronger than my fear. At that point, I was blindly obsessed to know ‘the secret’.</p>\n\n<p>The next morning I was startled to see that my bed had been dragged a couple inches toward the fan. It’s a miracle I wasn’t hit by the blades! Without my weight in it, the bed was much easier to drag. The irony was that it was the mass of my own floating body that dragged it. My latest addition to the drawing had some 45 degree angles deviating from the original straight line under the circle. Above the circle was a straight line and a right angle. </p>\n\n<p>It all looked terribly familiar but I still couldn’t place it. One of the facets of obsession is an inability to see ordinary things for what they really are. By now, any lucid person would’ve recognized the childhood ‘hangman’ game rapidly reaching its conclusion but I was too immersed in my own downfall. I could see all of the individual ‘trees’ and still not comprehend the meaning of the ‘forest’. Instead of recognizing the deadly danger I was in and abandoning the mystery, I just added some heavy objects in front of the bed to anchor it better. </p>\n\n<p>Every day passed in a blur. Instead of my unconscious hours being ‘necessary downtime’, they became the sole reason for my existence. I rushed through my daylight hours in order to get another piece of the ceiling puzzle added by my sleeping doppelgänger. Anyone else would have easily comprehended the existing parts for what they were, but I was too wrapped up in it all. Some days I awoke with significant lacerations on my forehead and fingertips but I still kept going. Marching right into the fire. I had to see it through. </p>\n\n<p>On the final night of the hangman’s morbid game, I went to sleep with the peaceful mindset of a person believing his quest would soon be over. I was certain there was only one remaining piece left, and I was right. Unbeknownst to me, as I slipped into unconsciousness, my helpless body floated upward toward certain doom. I awoke at the very end of my tether, only inches from the blades as the breeze whipped my hair back and forth! Unlike all the previous occasions, my body didn’t drop like a stone once I regained consciousness. I continued to float like a human balloon. Then the bed started to slide despite all the counterweights. Slowly I witnessed the knot on my headboard start to come undone (as if by unseen hands). </p>\n\n<p>In that harrowing instant, the true meaning of my nocturnal artistry came to me. My tether would come undone and coil around the whirling blades, hanging me in the cruelest irony imaginable. I grabbed the rope and started desperately pulling myself toward the bed. The faster I drew away from the hungry blades, the faster the knot unraveled. My muscles ached and cramped with fatigue as I fought the unnatural current. I was finally within a few inches of the headboard. I struggled with all my remaining strength to grab it before the knot loosened completely. Just as my mooring rope came loose, I said out loud; “Human bodies can not float.” Immediately I dropped onto the mattress. I collapsed in exhaustion but didn’t dare fall asleep again. </p>\n\n<p>Since then I’ve taken all necessary precautions. I bought an awesome air conditioner which keeps my home very cool. There’s no more need for that sadistic ceiling fan. I’ve also placed foam padding on the walls and ceiling to protect me from bouncing around like a ping pong ball. I have installed locking doors and windows. Whatever dark force that causes me to levitate in my sleep will no longer threaten me. I am no longer afraid. I am fully prepared to sleep in my bed or on the ceiling. </p>\n</div>\n","author":"OpinionatedIMO"}