{"rank":"3","title":"The Brown Man","id":"8jfy20","url":"/r/nosleep/comments/8jfy20/the_brown_man/","time":"1526332431000","body":"<div class=\"md\"><p>I&#39;d taken a part-time job cleaning a hockey arena. It wasn&#39;t a bad gig at the time. I was in my 20s taking courses in the daytime so this was a perfect little evening job. My nightly task took around four hours from around 10pm to maybe 2am but even earlier if I could hustle. The job was the usual janitorial tasks - mopping, vacuum the offices, empty garbages, clean fingerprints off the glass. It could be done my own pace and it earned just enough cash for books, instant noodles and my cigarette habit too. </p>\n\n<p>The arena wasn&#39;t old or creepy and it wasn&#39;t even in the woods. It was, however, on the outskirts of town and so, after everyone had gone home and it was past midnight it was a bit eerie in the sense of how quiet it was around the place sometimes. You could still see the city lights and hear distant highway traffic. I wasn&#39;t the only living soul around either. It was not unusual to see some leftover staff members, maybe a Zamboni repairman was working late, sometimes people showed up having forgotten their skates or purses earlier. Sometimes they&#39;d find me emptying garbage bins and ask if I&#39;d found a handbag or wallet and often I had. Sometimes, a person would suddenly show up and give me a &#39;movie fright&#39; just because I didn&#39;t think anyone was in the building at the time. Sometimes in the wee hours of the morning the parking lot was the spooky place because it was well lit near the doors but so very dark around the perimeter of the lot. &#39;The Brown Man&#39; was often outside, standing in the parking lot and that made me feel safe and secure.</p>\n\n<p>The Brown Man, Mr. Brown, just &#39;Brown&#39; and for nearly the entire year I worked there I did not know what his actual name was. Funny how you talk to someone all the time but you never even got their name. In my mind, I dubbed him &#39;The Brown Man&#39; because of his car was brown, his clothes were brown, I guess he loved the color brown. &#39;Brown&#39; was my &#39;smoke break chat buddy&#39;. Mind you, I don&#39;t think he smoked. Did he smoke? I don&#39;t remember. I know I loved smoke breaks. I&#39;d managed my own work schedule where I&#39;d have a quick smoke before I started and chat it up with Brown. Then about an hour later I&#39;d pop back outside to double-check the doors were locked and often chat it up with Brown if he was still there. Around midnight I&#39;d take out the trash and that was another smoke-break though Brown was rarely there that late. I don&#39;t think I ever saw him after midnight.</p>\n\n<p>The Brown Man wasn&#39;t actually brown, though he did have brown eyes and a brown mustache. He did some sort of job in the Arena Adminstration. Brown always parked his old brown car in the nearest spot to the front doors of the arena. He was always wearing a brown sweater, brown slacks and brown loafers. I remember that brown car was maybe 15 years old, it was just your average mid-range consumer 4-door of it&#39;s time. His brown shoes were the most standard loafers, his sweater the standard department store sweater, probably five or so years old but well laundered. He probably had seven pairs of the same brown clothes I once mused to myself. In winter he wore, of course, a brown parka and oddly enough brown driving gloves. The kind with laced leather. I didn&#39;t even know where a person could buy those styles anymore either. It once occurred to me that, if a person was asked to describe Mr. Brown&#39;s voice, his mannerisms and even his mood they could say &#39;brown&#39;. None of this in a bad way, I just mean he was plain, average, down-to-earth, he was &#39;brown&#39; if he was a color himself. </p>\n\n<p>And I did get to know him better after a few months. Sure, the first months and most times it was the usual smoke break coworker type idle chat, &quot;<em>How&#39;s it going tonight)?&quot; I&#39;d ask as I lit up a smoke. &quot;</em>Ohh.. good good, same as always I guess, which is good I guess<em>&quot; he&#39;d reply. &quot;</em>Yep, getting cold/warmer/rainy out tonight<em>&quot; one of us would say &quot;</em>well I guess I&#39;d better go*&quot; and the all usual friendly but idle chatter. </p>\n\n<p>But I have to tell you, &#39;Brown guy&#39; wasn&#39;t really such a mediocre man as I got to know him better. As the months rolled by, sometimes, our conversations got a little deeper. We&#39;d talk about the city planning department or other things related to the arena and Brown Man was a real expert and he could break down the local politics and rules into easy-to-understand explanations anyone could grasp. I figured since he worked in the arena office he probably had a lot of experience with city by-laws, planning, zoning and house so one time I asked him about buying a house in town. Wow, Brown was a real local historian too, he knew everything it seemed and shared all the &#39;insider stuff&#39; too. He knew everything about the various developers, what city counsel was trying to do and told me why I should <em>not</em> buy the place I was looking at. He did give me a alternative suggestion on where to buy a home and I can tell you, years later, it was the best investment I&#39;d ever made and the best home I ever owned. </p>\n\n<p>Mind you, although I had a consistent smoke-break routine - I never knew for certain when Brown would be parked outside. Some nights he wasn&#39;t there and presumably got home a bit early. Other times he&#39;d be out there for my first smoke break but not the second break. He&#39;d never be there after midnight. It&#39;s funny but we&#39;d talked about houses, city history and all about zoning, bylaws and neighborhoods over our chats and I don&#39;t know where he lived. It once occured to me I&#39;d never even seen him entering or leaving the parking lot so I couldn&#39;t even say what direction he headed. I once made myself laugh out loud late at night as I imagined Brown lived in the most average looking brown house with brown sofas and surely had a brown dog named Brownie. You know, that reminds me, one odd thing is sometimes Brown seemed to have brown &#39;whiskers&#39; that reminded me of a dog or a critter. Not a beard like a man but i mean like sparse longer wispy hairs where a proper beard should have been. </p>\n\n<p>I can honestly say The Brown Man and I became real friends.. ...well, more like he&#39;d become a &#39;father figure&#39; or I suppose &#39;mentor&#39; could be a better term. I remember having a rough relationship problem with my then hot-tempered fiancee. In my 20s I was immature and terribly over-emotional about every breakup or couple&#39;s dilemma. I didn&#39;t have anyone else to talk to that day and so that night I just unleashed all my girl troubles on Brown. In retrospect, I shouldn&#39;t have dumped that nonsense on a more distinguished older dude like Brown. Older? Let me think, he was maybe in his 40s.. no 50. Well I tried to think actually... I feel like when I met him the first time he was around 35-45? But then what I think now is that he might have been coloring his moustache and hair then. When i met him his hair was a solid brown. So maybe over winter he stopped dying his hair and the natural gray was revealing his true age. Well anyways, I really unloaded the emotions on the poor old guy. </p>\n\n<p>Despite being closer to my grandfathers generation, Old Brown dropped some relationship advice but he did it in that older man way. You, know how older dudes in their 60s talk by speaking in the broad and &#39;universal&#39; sense and yet in ways you could also apply to your specific situation. &quot;<em>Some of that is a woman&#39;s way of testing the man</em>&quot; and &quot;<em>For men, we are better off not showing them all our cards</em>&quot; and then something more specific but still hypothetical like &quot;<em>You might be lucky if she goes because the next one is the one for you</em>&quot;. The thing is, years later it turned out he was right in the most specific way - the next girlfriend after her, it turned out, was the keeper. We&#39;re still married and yes we do live in that house Mr. Brown recommended I look at. He really can be credited with making my life so much better. </p>\n\n<p>On night something scary did happen at the arena. I&#39;d popped out for a smoke around midnight and to my shock saw a pair of legs dangling out of Brown&#39;s car! It was so quiet out in the parking lot, nobody else was around and for what felt like a minute I was holding my breath, holding a pair of garbage bags and frozen in fear, I thought it might be Mr. Brown in some trouble! He was an older man, always working late, he&#39;d keeled over from a heart attack was my very first thought! Then I saw the dirty blue sneakers at the end of those legs and realized it wasn&#39;t brown but a thief rummaging around in Brown&#39;s car. I took it very personally, I mean, I was absolutely enraged, as if this was violating my own family! Well, in a way, us Arena People were a kind of work family but specificaly doing this to Brown was like an attack on my best buddy and my &#39;father figure&#39;. </p>\n\n<p>My instinctive reaction scared me nearly as much as the thief I think. I boomed my voice to a level I didn&#39;t know I could boom, with the authority of an emperor I yelled as aggressively as could be &quot;<em>YOU GET THE HELL OUT OF THE CAR NOWWW</em>!&quot; [but I didn&#39;t say &#39;hell&#39;] and the thief, a local druggie I recongized, he was so shocked by the seemingly supernatural volume of my voice it&#39;s like he was hit with a taser! He launched his torso up so hard and fast he smashed his head on the door jam with a THUD. I think he was stunned for a minute but then leapt to his feet and ran an Olympic Record breaking 100 meter sprint into the outer darkness of the parking lot. As he ran for his life he dropped a handful of coins and wash tokens he&#39;d surely been stealing from Browns brown car.</p>\n\n<p>But Mr. Brown wasn&#39;t around. I did think of that, that maybe he&#39;d knocked Brown out or chased him away but there was no sign of Brown and I had seen the car there all night so I assumed, like often happened at the Arena, he&#39;d had car problems, the old dead battery in winter maybe and he&#39;d just left it there overnight. At one point the cops dropped by and when one asked me the owners name and.. ..I had to say &quot;Mr.Brown&quot; and described him as one of the bosses in the office. I could not believe I was prepared to fight for the man&#39;s property but I actually didn&#39;t know Brown&#39;s proper name, not given or family names. Anyways, I left a note describing the break-in and troubles along with a police officer&#39;s card. Surely Brown would have it towed home, repaired and now there was a smashed out lock to fix too. I really hate junkies and thieves. </p>\n\n<p>But I didn&#39;t see Mr Brown anywhere around the place for a week or two. I figured that whatever was wrong with his car was bad enough to retire the old brown car. I felt bad because that was probably Brown&#39;s &#39;old faithful&#39; of a car. He seemed to keep it well-maintained, clean, I bet he would hate to part with it. I waited to see what newer car he&#39;d show up in next time and I needed to know if it would be brown. But it seems odd that he wasn&#39;t outside in any car for weeks afterward. Maybe he was on holidays? He was an old guy and it occurred to me that maybe he simply retired? When I thought of the last night I&#39;d been chatting with him, he really did seem to be showing his age, I remember he did look gaunt, too thin, his brown sweater was more hanging off him, his skin was too sallow, almost yellowy-brown. I worried that he might have been ill. Something serious maybe as three weeks rolled by and no Brown to chat with on smoke breaks. </p>\n\n<p>One evening I was there a bit early and saw a new office worker type working late. He seemed to be some sort of boss or manager, a hurried type rushing about with papers. New Office Man spotted me as the night janitor and approached me with some requests about vacuuming some back office normally locked.. oh and some fingerprints needing extra help. After assuring him I&#39;d get it all done he seemed satisfied but I couldn&#39;t let him go without asking abotu Old Brown. &quot;<em>Heya.. I haven&#39;t seen, you know... ..Ole Brown around lately</em>?&quot;. New Office Guy looked confused. I tried again &quot;<em>You know, well.. hehe..it&#39;s funny but I talk to the guy all the time.. you know, brown car, brown sweater guy.. sorry what is his name. Mr...He&#39;s always out front in the parking lot</em>?&quot;. New Office Boss guy has suddenly thinks he knows what I&#39;m asking about, &quot;<em>Wait, are you asking me what is the name on guy on front of the Arena</em>?&quot;. Now I think we were both confused so I just went along with him. &quot;<em>Yes, that guy</em>&quot; because maybe his name was on the reserved parking stalls?. &quot;<em>Oh you&#39;re asking who was Falter, right?</em>&quot;. </p>\n\n<p>Then New Boss guy seems happy to answer the question and gives me a brief summary of the life of M.M. Falter and all the while I go into apoplectic shock because.. because Brown was obviously Mr.Falter. A city pioneer of sorts, he owned and donate all the land this arena is built on. New Office Guy goes on about how he used to come visit the arena all the time to watch his grandkids play hockey. At some point it occurs to me that Mr.Brown was always parked in the reserved parking spot. I just thought it was &#39;reserved for Falter Arena staff&#39; not specifically a Mr. Falter! I was stupefyed as I put it all together in my head. Brown was Falter and I&#39;d been talking to the man himself for a little over a year! I didn&#39;t know his name or who he was. </p>\n\n<p>New Boss Guy, maybe mistaking my shock as intense fascination with his account adds more background on Brown, &quot;<em>Yaaaa, I guess he was a little eccentric and you&#39;re right he was a bit famous for wearing the team colors heheh.. yes, I&#39;m sure his car probably was brown too heh</em>!&quot;. It dawned on me the local hockey team was indeed the &#39;Bruins&#39; aka &#39;The Brown Bears&#39; duh. New Boss Guy carries on &quot;* Oh ya, he was dedicated though, he volunteered here for ohhh he was probably 76 before he stopped coming around*&quot;. </p>\n\n<p>I was forcing myself to believe New Office Guy was refering to Brown &#39;stop coming around&#39; as of a month ago but I felt like he was referring to things many years ago. &quot;<em>Sad thing, I went to high school with one of his kids the one that was hit by a drunk driver, kid died. Sad stuff</em>&quot;. New Office Guy stopped and looked a little lost in thought as I already looked. A few seconds of blank stares and he clicks back on to hurried-mode &quot;<em>Anyways, gotta run. Don&#39;t forget to vacuum that back office okay bud</em>!&quot;. I probably said something in agreement but I was really confused and couldn&#39;t really reconcile time anymore. Had I been working there for decades or just a year? Had it been a month since I&#39;d seen The Brown Man out in the parking lot or.. was it a decade ago? </p>\n\n<p>I asked a few other employees around the place about &#39;Falter&#39; and nobody had a clue. The concession people often stay late. &quot;<em>You guys know that old dude, the brown car, brown slacks, brown shoe old dude</em>?&quot; and they did not quite know who I was referring to. One older lady insisted she did remember the old owner was indeed called &#39;The Brown Man&quot; or maybe &#39;Mr Bruins&#39; but didn&#39;t know anything else. My brain tried to reconcile times. The high turnover of young employees meant few knew anything about the place or history. </p>\n\n<p>I bet I was talking to his brother the whole time? Did I travel in time at nights? Sure, was that the ghost of Falter I was chatting up? I had to concede that while plenty of people walked by us at nights, I don&#39;t remember anyone speaking to him or him to anyone else! I knew for sure I didn&#39;t see him anymore and I felt a bit sad about that. Instead of hopping outside in excitement for a smoke and to say hello to the old guy, I would stand there in the parking lot alone and sad. I think he must have died. I was in a state of mourning. </p>\n\n<p>One night, I was outside having a smoke before leaving for the night. I was just looking at that parking space where he would have usually parked. It did say on the wall &quot;Reserved for:&quot; and then in fading brown paint &#39;Falter&#39;.\nMoths often fluttered about the yellowish night lights of the arena. Just beside me was a concrete post and there on sat a rather large brown moth. He wasn&#39;t bothered by my presense at all. I took a closer look and he barely moved his wings a bit. I guess he was resting or waiting for a moth friend. &quot;<em>well moth, I guess you&#39;re the new smoke break buddy</em>.&quot; I flicked my cigarette butt into the sandy outdoor ashtray, sighed and half-jokingly said to the moth &quot;<em>Okay Mr. Brown.... Well, I guess I&#39;ll go home</em>&quot;. The moth moved his wings a bit as if agreeing, I iimagined. </p>\n\n<p>As I backed my car out and started driving off - that big brown moth flew right over the car, as if sending me on my way, then the whiskered moth whooshed down over my windshield and up and and back towards the lights. I turned my head backward to try and watch its path. Crunk! ...and that&#39;s when I hit something. That soft but hard crunch!</p>\n\n<p>I was sure it was a deer. This was not uncommon in the area and the force through the steering wheel and into my hands let feel it was a creature not an object. I backed up a bit, I couldn&#39;t see over my hood far enough and how eerie to back up in that darkness and see, first his head then his legs and then those dirty blue sneakers now fully in my headlights. He was sprawled out, face up, clearly unconcious if not dead. He must have been hiding behind one of the bigger lamp posts with the thick concrete bases. All I can think of is that he was hiding there waiting for me to leave so he could break into the arena. He must have assumed I had spotted him and that I was driving over to confront him? I&#39;d put the fear of God into him that one night so I think he panicked and decided to run for it but only managed to run straight into my blind path where he tasted my bumper. I looked at his body for maybe a minute and then I made a decision to drive away. </p>\n\n<p>I was certain that I knew there were no cameras on that end of the parking lot. So, I just drove away. I gave myself about 15 minutes, the time it takes to drive most of the way back home and only then did I phone 911. I let my voice be that of a casual but concerned citizen simply driving home from work and spotted what looked like &#39;a couple of drunks fighting in the arena parking lot&#39;. The dispatcher took the information and when it came time to get my name and number my phone cut out. It really did. I lost the signal. I really don&#39;t think they cared that much. </p>\n\n<p>Days later I was leafing through the local newspaper and there it was. They reported a man had been taken to the hospital after what was believed to be a drunken brawl at the local hockey arena. Police were asking about the yet unknown assailant. It was also noted drugs were a factor. A few more days later, a friend of ours working as a nurse at that hospital told my wife about a junkie who was <em>lucky</em> he got beaten up because, had he not been rushed to the hospital would have probably died from overdose in the parking lot! It sounded like he had done a tremendous amount of heroin and other things too. So, you see, I probably saved his life! I heard he was institutionalized after the accident. Maybe brain damage. He was slow and incapable of even taking care of himself properly. That&#39;s what some in town said. </p>\n\n<p>I never once worried about trouble from it. There wasn&#39;t even any damage to my vehicle never mind any witnesses and I had a feeling the cops maybe even suspected I probably did punch him out after catching him breaking into cars and they were happy to be rid of the problem and certainly not question me about it any further. You know, its so funny but I did see something, some small damage to my car that might have been from hitting the junkie in the parking lot. It was an indent and it really was, using some imagination, in the shape of a moth. It rusted a brownish-red &#39;moth&#39; square in the middle of the chrome grill. Maybe he was wearing a belt buckle with a moth on it? I like to think it was the eyebrow earring he had that indented my chrome grill. </p>\n\n<p>I do remember he shouted something. He yelled, so quickly and loudly at the moment of impact &quot;<em>You Did This</em>&quot; which is odd because I mean he thought this. I know what he thought and it was &quot;You did this assh..!&quot; before it went very dark for him. Isn&#39;t that strange? I know what he thought at the moment he was hit. I know what all junkies think the moment I hit them. </p>\n\n<p>Now, I call myself &#39;The Brown Man&#39;. I&#39;ve hit a dozen junkies since then. They think a lot of things on impact but the most common is simply &quot;FAWK!&quot; but I get a lot of S-words or combos. Some think both and it sounds funny like &quot;SHFkkk&quot;. But to know what they say, I have to have their skulls crack the steel, then have that travel through my truck&#39;s parts, into my steering wheel through my brown laced-leather driving gloves and into my hands. It&#39;s something about this brown truck that they don&#39;t see coming. </p>\n\n<p>Maybe my truck and everything looks so looks so average, dull brown, maybe my brown sweater, my brown laced-leather driving gloves, my brown Kango hat. I think its the hat. Once I hit this junkie and his impact-thought was &quot;<em>Holy hell where da fuq did he get a brown Kango hat from</em>!&quot; and I have to admit that made me laugh out loud. They rarely see me coming and if they did - by then it&#39;s too late for them. The awful thud sends them reeling. They almost always go unconcious before they hit the ground or as they&#39;re sliding across the pavement like ragdolls. Or they might be dead. I&#39;m not bothered. Only once was I bothered, I think it was the fifth junkie I hit. Or maybe the twenty fifth I can&#39;t remember but the point is that his pants tore off his body and there he laid, still alive. Someone rushed to him and to my horrfied surprise, the man began to record the scene with a cell phone. Even leaning in for close-ups, moving around the gasping and naked man. I was enraged. I took it very personally and he was so easy to hit, dead center of his skull and the most unexpected bonus of imbedding that phone into his face too. His impact-thought was, mysteriously hooting &#39;WERLDSTA!&#39; and then a pitiful &#39;no.&#39;.</p>\n\n<p>I am The Brown Man and I&#39;m getting very old soon. It&#39;s been years since I saw my mentor, Mr. Falter, the original Brown Man and he was old then. I&#39;m getting old now too, I think? My life has been good. I might be 50 soon, or 55 maybe? I&#39;m getting grey but my wife, she&#39;s still young and beautiful. My life has been very good. Sometimes I stop at the arena and wait outside waiting to see if my old friend, Falter is there. Sometimes he is. Sometimes I just stop there for a smoke break and keep the moths company at night. If you see me waiting there, outside that arena, feel free to say hi. greet me, we can talk a little. I can tell you things too. You do have to ask me first but if you ask me I can tell you things that can make your life very good. Or I might be the last thing you see? You&#39;ve already decided which it will be. I&#39;m just drawn to you like a brown moth to light you see. I was and still am The Brown Man. </p>\n</div>\n","author":"Nevespot"}