{"rank":"148","title":"There's an Ancient Monster in the Red Sea","id":"8jg42f","url":"/r/nosleep/comments/8jg42f/theres_an_ancient_monster_in_the_red_sea/","time":"1526333745000","body":"<div class=\"md\"><p>Hi, my name is Jeremy and I&#39;m on my first expedition in the Red Sea. My specialization is paleontology, but I work with a team that has conducted dives and excavations by the Red Sea over the past ten years. In case you need a refresher, the Red Sea is located <a href=\"https://en.m.wikipedia.org/wiki/Red_Sea\">here</a>.</p>\n\n<p>&nbsp;</p>\n\n<p>A variety of interests attract many people that seek glory, gold, and God. Some search for sunken treasure while others search for proof of the Exodus. However, I was not invited for either of those reasons. </p>\n\n<p>&nbsp;</p>\n\n<p>Our benefactors are interested in an excavation near the shore of the Eastern Egyptian Desert. So, I trekked Southeast of Cairo and made my way to the Gulf of Suez. The destination was a series of islets at the bottom of the gulf. Our mission was to explore the vicinity of three islets: which are cryptically labeled &quot;Beta&quot;, &quot;Gamma&quot;, and &quot;Delta&quot;. There is also an &quot;Alpha&quot; islet, but we were not given permission to explore it. </p>\n\n<p>&nbsp;</p>\n\n<p>I arrived on the scorching sand of Islet Gamma and noticed an obese man wearing a long-sleeve white shirt and brown cargo shorts. The man smiled and revealed his sweaty pit stains as he waved at me.</p>\n\n<p>&nbsp;</p>\n\n<p>&quot;Welcome, Jeremy! My name is Hakim, and I will be your guide.&quot; Hakim cheerfully greeted me.</p>\n\n<p>&nbsp;</p>\n\n<p>Hakim led me to a dirt path that carved through the marsh which led inland. Tall palm trees relieved the Sun&#39;s heat, but the humidity was extreme and the buzzing from the mosquitoes was irritating. My underwear was soaked with sweat by the time we arrived at the first dig site.  </p>\n\n<p>&nbsp;</p>\n\n<p>&quot;You must be the new guy, huh?&quot; A voice called from the shade of the palm trees.</p>\n\n<p>&nbsp;</p>\n\n<p>&quot;Yes, my friend. This is Jeremy.&quot; Hakim answered.</p>\n\n<p>&nbsp;</p>\n\n<p>The man stepped forth from the shadows. A puff of smoke came from his mouth while he stretched his firm, tan arm towards me.</p>\n\n<p>&nbsp;</p>\n\n<p>&quot;You can call me, Perez. I&#39;m the foreman. Did they tell you why a paleontologist is needed?&quot; Perez asked.</p>\n\n<p>&nbsp;</p>\n\n<p>I didn&#39;t have any idea, but Perez finally gave me a straight answer on the subject.</p>\n\n<p>&nbsp;</p>\n\n<p>&quot;There&#39;s a hypothesis that a temple dedicated to the ancient Egyptian god, <a href=\"https://en.m.wikipedia.org/wiki/Sobek\">Sobek</a>, is abandoned somewhere nearby. There are a series of ruins along the coast that seem to support this hunch.&quot; Perez paused and took a drag from his cigarette before he continued.</p>\n\n<p>&nbsp;</p>\n\n<p>&quot;Except, I don&#39;t think that these ruins are -&quot; Perez was interrupted by Hakim&#39;s cell phone ringing. </p>\n\n<p>&nbsp;</p>\n\n<p>Hakim answered the call, but it was brief. We were informed to travel towards the Northern shore of Islet Gamma and await further instructions. A crew of workers were gathered near a sheet of palm leaves at the North shore. We heard the clinking of pickaxes striking the earth as we approached. Hakim called toward the workers and Hakim translated for us:</p>\n\n<p>&nbsp;</p>\n\n<p>&quot;They said that they&#39;ve found eggs.&quot; Hakim reluctantly answered.</p>\n\n<p>&nbsp;</p>\n\n<p>&quot;You mean fossilized eggs?&quot; I assumed.</p>\n\n<p>&nbsp;</p>\n\n<p>&quot;I guess so.&quot; Hakim replied. </p>\n\n<p>&nbsp;</p>\n\n<p>I took a peek over the crowd and looked down into the hole at the center. There was a ladder that descended into the hole which had a width that could barely fit a man. I heard steps on the ladder as one man struggled to climb to the surface with one free hand. His other hand was still in the hole while I heard another set of steps coming from the ladder below. The man on the surface pulled up a chest while a second hand pushed from the edge of the hole to help the first man. The two men dragged the chest toward the palm leaves and collapsed from exhaustion on the beach.</p>\n\n<p>&nbsp;</p>\n\n<p>We stepped forward and opened the chest to find a bundle of large oval stones with a nest of hay in the dusty chest. There were three stones, and each appeared like a cracked egg shell.</p>\n\n<p>&nbsp;</p>\n\n<p>&quot;Dinosaur eggs...&quot; I gasped underneath my breath.</p>\n\n<p>&nbsp;</p>\n\n<p>The other workers conversed with Hakim while Perez silently squatted by me. He stared at the fossilized eggs while I traced my fingers over the grooves. </p>\n\n<p>&nbsp;</p>\n\n<p>&quot;Good news! There seems to be a small passageway underneath the sand. We may have found a tomb!&quot; Hakim shrieked with joy.</p>\n\n<p>&nbsp;</p>\n\n<p>&quot;A tomb...for what?&quot; Perez skeptically asked.</p>\n\n<p>&nbsp;</p>\n\n<p>Hakim descended into the hole first, followed by Perez, and then myself to find the passageway. I wrapped my shirt over my mouth to block out the dust particles as I clicked on my flashlight. </p>\n\n<p>&nbsp;</p>\n\n<p>The air was stale, and the warmth of the sun was replaced with a dark, cold atmosphere. The jagged rock path was cramp as we walked through the tunnel that led deeper underground. The pathway contained a series of limestone steps that stopped at a plateau. </p>\n\n<p>&nbsp;</p>\n\n<p>&quot;Look, over here!&quot; Hakim shouted as he pointed at the painted hieroglyphics on the wall.</p>\n\n<p>&nbsp;</p>\n\n<p>&quot;This place is cursed.&quot; Perez muttered.</p>\n\n<p>&nbsp;</p>\n\n<p>&quot;How do you know?&quot; I curiously asked.</p>\n\n<p>&nbsp;</p>\n\n<p>Perez traced his fingers along the grime of the wall and pointed to a set of smudged hieroglyphics. He wiped the area with a cloth and revealed that the hieroglyphics were distorted.</p>\n\n<p>&nbsp;</p>\n\n<p>&quot;The ancient Egyptians believed that names contained power. This part here, where the hieroglyphics are underlined, is used to describe a name. Someone tried to erase the name.&quot; Perez explained.</p>\n\n<p>&nbsp;</p>\n\n<p>&quot;If you erase a person&#39;s name, then you&#39;re erasing a person from existence.&quot; Perez elaborated. </p>\n\n<p>&nbsp;</p>\n\n<p>There was a picture of a giant oval next to the smudged name. The oval appeared like the fossilized eggs that we found earlier, except for an ankh inscribed upon the egg.</p>\n\n<p>&nbsp;</p>\n\n<p>&quot;This is excellent! I will call for the Egyptologist at once!&quot; Hakim squealed as he clapped his hands together. </p>\n\n<p>&nbsp;</p>\n\n<p>Hakim walked back to the ladder while Perez inspected the rest of the tunnel. I followed closely behind his trail until we reached the end of the tunnel. A partially unearthed pillar sealed the end of the tunnel, however, there was a small gap at the bottom right corner. A cool draft blew in from the gap.</p>\n\n<p>&nbsp;</p>\n\n<p>&quot;Do you think that this is it?&quot; I whispered to Perez.</p>\n\n<p>&nbsp;</p>\n\n<p>&quot;Perhaps...&quot; Perez responded as he crawled down to the floor and shined his flashlight into the gap. </p>\n\n<p>&nbsp;</p>\n\n<p>&quot;Shit.&quot; Perez gasped.</p>\n\n<p>&nbsp;</p>\n\n<p>Thundering steps from behind startled me as Hakim&#39;s voice echoed throughout the tunnel. Two men squeezed into the cramp space with us while Hakim stood at the threshold of the chamber.</p>\n\n<p>&nbsp;</p>\n\n<p>&quot;The Egyptologist is down there!&quot; Hakim cried.</p>\n\n<p>&nbsp;</p>\n\n<p>&quot;Guess we&#39;ll find out, Jeremy.&quot; Perez snickered. </p>\n\n<p>&nbsp;</p>\n\n<p>Perez crawled through the gap while I followed him into the void. There was a small ledge which had a pike at its base. There was a rope tied around the iron pike that allowed one to scale down the cliff.</p>\n\n<p>&nbsp;</p>\n\n<p>&quot;Don&#39;t look down.&quot; Perez warned as we scaled down the subterranean cliffside.</p>\n\n<p>&nbsp;</p>\n\n<p>A musty aroma greeted us at the bottom of the chasm. The cavernous floor was covered in debris from stone. There were snapped bones scattered across the cavern.</p>\n\n<p>&nbsp;</p>\n\n<p>&quot;Jacqueline!!!&quot; Hakim yelled with his hands cupped over his mouth.</p>\n\n<p>&nbsp;</p>\n\n<p>The ground shook as Hakim&#39;s booming voice bounced off the walls. </p>\n\n<p>&nbsp;</p>\n\n<p>&quot;Jeremy and Perez, you should take the right side. The rest of us will follow the direction of the columns that are embedded into the cliff.&quot; Hakim instructed.</p>\n\n<p>&nbsp;</p>\n\n<p>The ground gradually became soft and moist as we explored the right wing of the discovered chamber. We crouched as the ceiling sharply dipped closer to the floor. A muffled cough broke our silence as we stared into a pile of dark rubble.</p>\n\n<p>&nbsp;</p>\n\n<p>&quot;Help!&quot; Yelped a faint voice in the darkness.</p>\n\n<p>&nbsp;</p>\n\n<p>&quot;Jacqueline!&quot; Perez shouted as he pressed his hand on the cold pile of rocks.</p>\n\n<p>&nbsp;</p>\n\n<p>&quot;Jacqueline, sit tight! I&#39;ll let Hakim know that we found you.&quot; Perez assured her before darting through the darkness.</p>\n\n<p>&nbsp;</p>\n\n<p>&quot;Wait!&quot; Jacqueline cried but Perez already had left.</p>\n\n<p>&nbsp;</p>\n\n<p>&quot;It&#39;s OK. We should get you out soon.&quot; I said.</p>\n\n<p>&nbsp;</p>\n\n<p>Hakim and his men scrambled to the rubble and pulled rocks out immediately. It took us almost an hour before Jacqueline was finally free. </p>\n\n<p>&nbsp;</p>\n\n<p>We decided to retire early for the day. Jacqueline explained that the hieroglyphics were for a ritual to summon an avatar of Sobek. She believed that priests of Sobek would gather here in dire times to call upon the might of Sobek - through an avatar - to protect their people. I wondered why such a place would be abandoned but it seems that I would soon learn for myself.</p>\n\n<p>&nbsp;</p>\n\n<p>Half of the crew&#39;s tents were built on the shore near the hole, while the other tents were at the original dig site in the marshes. Hakim and Perez were sleeping at the marshes while I slept near the shore.</p>\n\n<p>&nbsp;</p>\n\n<p>The adrenaline of the day kept me awake as I tossed and turned in my sleeping bag. My nerves were jittery, and I couldn&#39;t keep my legs still. Thirty minutes passed before I went for a walk around the shore. The moonlight made it easy for me to navigate through the campsite. Most of the workers were asleep, but there was a tent at the edge of the campsite with a lit lantern.</p>\n\n<p>&nbsp;</p>\n\n<p>Nobody was inside the tent. However, I noticed a large oval silhouette within it. I figured that maybe someone found another fossilized egg, but that&#39;s not what I found when I flipped open the flap of the tent. There was a large, brown egg that sat next to the warmth of the lantern. The egg was easily bigger than my head. Its surface was smooth and polished. At this point, I&#39;m trying to figure out who found this, but I have a feeling that I won&#39;t have to wait too long for an <a href=\"https://www.reddit.com/r/Torpenta/\">answer.</a></p>\n\n<p><a href=\"https://www.reddit.com/r/nosleep/comments/8kx6p1/theres_an_ancient_monster_in_the_red_sea_part_2/\">Part 2</a></p>\n</div>\n","author":"Torpenta"}