{"rank":"3","title":"Stadler House: Book One: Chapter Six","id":"8jgc1c","url":"/r/nosleep/comments/8jgc1c/stadler_house_book_one_chapter_six/","time":"1526335542000","body":"<div class=\"md\"><p>Dr. Stadler and Maggie’s master bedroom contents are made of heavy old stained wood. A massive king-sized sleigh bed fills the center of the large room. A nightstand sits on both sides of the bed with matching bronze colored lamps topped with off-white shades with ornate floral designs circling the bottom of each. </p>\n\n<p>An enormous colorful Persian style area rug fills much of the floor space allowing only partial glimpses of the stained and sealed wooden floor below it. At the foot of the great bed resting on the rug comfortably rests a wood and leather bedroom bench. Dr. Stadler’s clothing from the day rest atop it.   </p>\n\n<p>Maggie Stadler lays on her stomach in her long nightshirt examining the contents of Anna’s file from Dr. Stadler’s Office. A bewildered look holds firm in her expression as she slowly moves between the gathered documents. Maggie sits upright and looks to the master bathroom door, “Are you almost done? You promised to go over Anna’s file with me.”</p>\n\n<p>The bathroom door opens and a wall of humidity and steam flow out followed closely by a damp Dr. Stadler wearing in boxers, as he towels his head. Maggie smiles mischievously at him. She seductively moves from the bed to his side, “Why, Doctor Stadler, are you trying to seduce me?”</p>\n\n<p>Maggie pouts childishly and sits on the bed. She playfully pulls him onto the bed. He lands on the bed and grabs a handful of documents. He shakes them in her direction, “She’s already undergone the first of the treatments. She has gone deeper and opened more than any of the other subjects.” Dr. Stadler drops the pages and kisses Maggie on the forehead.</p>\n\n<p>“She’s very odd,” Maggie blurts out. Maggie playfully pulls the towel from the Doctor’s hand and runs her fingers through his hair.  Dr. Stadler closes his eyes allowing the sensation of her touch to lead him back down onto the bed. Dr. Stadler smiles and she stares at him with starry eyes. </p>\n\n<p>Maggie straddles Dr. Stadler hips as he opens his eyes. “So, it’s working then?” He smiles and gently thrust his hips skyward, “So far so good.” Maggie lowers herself across his chest and moves in for a kiss. He leans forward to kiss her, but is met by her playful bite on his lower lip, “Yeah, but it wants to be called Ankou?”</p>\n\n<p>Maggie sits upright on his hips, “What does that mean?” Dr. Stadler slowly begins to unbutton her nightshirt, “Not sure just yet.” She places a finger on his chin and then slowly traces it down his chest to his navel, “But it will listen, right?” A slowly growing bulge forms inside his boxers. Maggie smiles as she takes his planned response into her hands. Dr. Stadler exhales loudly as tingling runs down his spine with her supple touch, “Not… Sure… just yet.”</p>\n\n<p>Maggie’s grasp becomes uncomfortably firm, “What do you mean you’re not sure?” His eyes bulge as the pressure intensifies. He gasps, “she’s the first for the process to work with. I know where I messed up with the others.” “And,” she demands as she tightens her grip. He clenches his eye closed unable to handle the increasing discomfort, “With Anna, we can prove that we can bring the mind of the dead back.” He tries to pull away.</p>\n\n<p>“Into a prepared subject,” she smiles devilishly and slowly releases he grip upon his manhood. He sits up and she meets him nose to nose. They stare into each other’s eyes for a long moment. He squints his eyes. She nibbles on his chin then looks into his now open eyes, “now…”</p>\n\n<p>Dr. Stadler and Maggie embrace as sexually passionate couples do. The wood of the bed frame groans rhythmically as the headboard collides forcefully with the wall behind it. Moans of passionate lovers fill the air. The lightning from the storm outside offers a glimpse to each lover’s inhibition free focus. </p>\n\n<p>A second flash of lightning reveals Anna standing a silent and ghastly vigil in the room just outside of the view of the Stadler’s. She exits silently through the door amidst the loud sounds of passion generated by the couple. Following closely behind her are two shadowy figures vaguely resembling humans. </p>\n\n<p>Anna moves down the long corridor to the second-floor bathroom. She pauses once she notices the steam slowly rolling from under the door and entering into the hallway. Anna smiled ghoulishly as she glares at the door.</p>\n\n<p>Pop music plays loudly inside the second-floor bathroom. The large mirror opposite the bathtub and shower combination casts only a blurry reflection due to the presence of the steam and humidity in the air creating large amounts of condensation.  The bathroom counter space offers his and hers sink combination an assortment of toothbrushes, hairbrushes, and various cosmetics fill the void between them. </p>\n\n<p>Julie stands naked in the bathroom as she roughly towels her hair dry. She wipes the steam from the enormous mirror, as she sings along with the songs playing on the small radio. She stops singing as she sees her reflection. She turns to looks away from her reflection and begins to sob, “Pathetic Loser.”</p>\n\n<p>Julie punches the mirror causing small thin cracks race out from under her hand. Fragments of the mirror fall into the sinks of the bathroom with a loud CRASH. She pulls her fist back and examines it closely making sure to have no new injuries to explain to the Doctor or Maggie.</p>\n\n<p>Two shadow figures pass under the door and slowly move above Julie on the ceiling. “Poor Girl,” the whispers fill her head as Julie’s focus holds at the long scars running the length of her wrists. “When you needed them where were they?” She slides her numerous colorful bracelets into place to hide her scars.</p>\n\n<p>“No one has ever been there for you when you need them,” more whispers fill her thoughts. Julie’s newly applied mascara runs with the flow of her building tears. “Everyone leaves me,” Julie pouts softly to herself as she covers her athletic frame with her towel. </p>\n\n<p>Julie does not notice the shadowy figures move from the ceiling back down to the sides of the doorway. The door quietly opens revealing Anna. The loud pop music conceals Anna’s entrance followed by the closing of the bathroom door. Anna’s eyes resemble large voids as she saunters to Julie.</p>\n\n<p>“They know you don’t belong,” the voices continue to fill Julie’s thoughts. “She shakes her head, “I know.” Julie clenches her eyes closed as the voices in her head offer, “They know you died.” Julie shakes as she leans on the countertop trying to rationalize a response to the unspoken words, “but they brought me back.”</p>\n\n<p>“What makes you so special?” the words in her head strike hard at the core of her being.  “It should have been me,” Julie sobs loudly, “I should have stayed dead. Not you mommy. I didn’t mean to.” Julie opens her eyes and sees Anna standing close by.  Julie and Anna stare into each other’s eyes for a long moment.</p>\n\n<p>“You know what you have to do,” Anna hands Julie a shard of the broken mirror.  Julie nods and closes her eyes. She snatches off her bracelets. The bracelets slide and CLATTER across the bathroom floor. Julie’s willpower fails her as she announces, “I’m sorry, Dr. Stadler. You tried so hard, but I just don’t belong here. I never did.”</p>\n\n<p>Anna raises her clenched right hand. Julie mimic’s Anna’s movements precisely. Her right hand holding the broken mirror shard. Anna hammers her fist against the soft inside of her forearm repeatedly. Blood sprays across the mirror as Julie stabs the shard into her forearm. Her arm releases numerous fountains of blood with each tendon tearing strike. </p>\n\n<p>Surprise fills Julie’s expression as she realizes what she has just done. She touches the inside of one of her newly inflicted wounds confused at the lack of sensation. The young woman’s vision becomes blurry and she slumps to the floor unaware that the lack of sensation comes from both shock and trauma that will now allow her to pass beyond the veil. </p>\n\n<p>Anna walks out of the bathroom into the hallway and gets startled by the near collision with Emily. “Where have you been?” Emily asks painfully oblivious to the events that have transpired this evening. Anna turns to greet Emily, “downstairs watching the rain. It really puts me at peace. Why what up?”</p>\n\n<p>Emily smiles and shows Anna a small nail polish kit, “As my new sister. I want to do your nails for you.” Before Anna can offer verbal resistance, Emily seizes Anna by the wrist and leads her off to their bedroom. </p>\n\n<p>Across the house, John enters the garage, as the lights flicker following a recent lightning flash outside the group home. He pushes the door closed with his foot while he clings to his glass of milk and ham sandwich, “Tyler, you still in here?” He crosses the threshold and pauses at the billiards table to glance around the room. </p>\n\n<p>Lightning flashes and thunder booms nearby outside causing John to jump a little. His twitch sends a line of milk out of his glass and to the floor. He watches concerned that he will end up in trouble, again. The lights flicker making the fluorescent light slow to flash back to life. </p>\n\n<p>“Come on man, where you at?” John waits a moment for a response. John sees movement out of the corner of his eye drawing his attention to a darkened corner near the weight bench. He slowly crosses the room, “Tyler? That you?”</p>\n\n<p>The heavy smell of nail polish fills the small bedroom of Emily and Anna. Anna sits on the top of a bed braiding Emily’s hair from behind. She stops and looks in the direction of the game room. A low growl comes from the small girl’s body, “I need a drink.” </p>\n\n<p>Anna stands up and walks towards the door. Emily looks up at Anna, “can you grab me a drink too?” “Sure, no problem,” Anna glances back across her shoulder, though her attention clearly is focused elsewhere. </p>\n\n<p>Anna shakes her head as she turns back to Emily, “Promise me you’ll stay put.” Emily nods, “Sure but you do my toes next, K?” Anna smiles and leaves quietly closing the door behind her.</p>\n</div>\n","author":"roger75lee"}