{"rank":"23","title":"I've found another world, pictures forthcoming","id":"8jggxz","url":"/r/nosleep/comments/8jggxz/ive_found_another_world_pictures_forthcoming/","time":"1526336718000","body":"<div class=\"md\"><p>I feel like I&#39;ve drank a whole pot of coffee.  It&#39;s 2am and I&#39;m writing this from a local Dennie&#39;s.  I just couldn&#39;t bear to go home. I&#39;m too amped, antsy, frantic really. I have more to do but I&#39;ve decided to get this online as quickly as possible.</p>\n\n<p>I&#39;ve discovered something. Something incredible, almost unbelievable.  Even now I question what I thought I saw.  But the only scenario I can come up to explain what just happened is that I was drugged.  If anyone in my life would do such a thing it would be Davis.  But even if that were true, it does not explain everything.Davis called me tonight and practically begged me to drive out to a rental property he was about to show.  I was pretty put out, but he just kept repeating that he had found something unbelievable and that I had to see it immediately.  I won&#39;t lie, the &quot;unbelievable&quot; things I imagined he was talking about were cocaine, strippers, or something expensive that he was planning on illegally acquiring.  Behind his crisp business-like exterior Davis spent most of his time off the rails, and always seemed to come out of the ensuing chaos for the better.  If he jumped off of a bridge he would land on a boat carrying mattresses stuffed with cash. He was just that kind of person, and I had been his unwilling (and only) friend throughout his tumultuous life.</p>\n\n<p>I breathed some relief as I pulled up and found the house dead quiet. I was expecting a mess of strobe lights and a murder of degenerates accosting me as I pulled up. Davis met me at the door with wild eyes and firmly grabbed my shoulders, half shaking me and half pulling me into the house.</p>\n\n<p>&quot;You&#39;ve got to see this, it&#39;s incredible…. You won&#39;t even&quot; he carried on vaguely as we descended into the concrete basement of the small single family home. &quot;I can&#39;t even explain it, you just have to do it. Just…. There&#39;s no way I can make you understand.  Just go through there. When you want to come back just turn around and do the same.  If you see a man, just ignore him.&quot;</p>\n\n<p>&quot;Davis, what the hell are you talking about?&quot; I  took a millisecond to think. &quot;Okay, what did you take?&quot;&quot;Ha, nothing. I took nothing.&quot; He smiled, eyes still flaring madly. &quot;Smoked some weed but that&#39;s it. I swear.  Just go through there.&quot;</p>\n\n<p>He pointed to the basement wall to our right. As my eyes adjusted I saw that he was pointing to a doorway sized hole in the concrete wall, apparently leading to another section of the basement.  I figured it was probably where the heater and water tank were and I started to ponder the situation.  Had Davis found a dead body? Was that the man he mentioned?  Maybe the body was near something? Something he had been trying to hide down here? Something valuable?  My mind turned in this direction as I found myself slowly approaching the opening.  It was extremely dark past that hole and I could not make out much as my hand released my hold on the wall and I passed through the threshold.</p>\n\n<p>It was like. How do I explain this?  It was as if something enormous turned, wrenched.  But it was inside me as much as it was on the outside.  And it was beyond enormous.  It was… fundamental.  For the smallest of moments it hurt. Horribly.  For just a moment it felt like all of existence had twisted and crushed me in its wake, and in the next I was just opening my tired eyes, as if from a very poor restless sleep.What those eyes fell upon kept me paralyzed for a full minute, maybe even more.</p>\n\n<p>I was standing on a hillside. I guess you would still call it a hillside.  Where to start… The sky. It was full of miles long green wisps floating through the darkness behind them. Lights shot through that sky, is if meteors were entering the atmosphere at every turn, each second that passed.  It was a constant melee in the heavens.  The ground at my feet was composed of both rough and smooth patches of black stone, sporadically dotted with small volcanic pools spewing lava and emitting noxious clouds that spread wide and far off into the distance.  The trees, if you can call them trees, twitched and twisted their sparse limbs as if striking something in the air.  The light, the motions, the odor, all if it quite suddenly broke my paralysis.</p>\n\n<p>I turned from the scene before me, and vomited violently. The contents of my stomach looked strange and out of place on the black ground.  It was too bright, too varied. It seemed... unwelcome.  Wiping tears from my eyes I raised myself to a crouching position and was immediately startled by two things.  One was extremely comforting, the other terrifying.</p>\n\n<p>Before me was an opening in the black stone.  It appeared to be exactly like the one I had walked through in that basement.  Right down to that long worn block that reached into the entrance on the left side of the opening. This was my salvation, my return.  I knew immediately that this was the way home, and that it was open and safe.  It wasn&#39;t until much later that I remember Davis telling me to simply turn around.</p>\n\n<p>This was also the point at which I saw the &quot;Man&quot;.  Standing about twenty feet above the opening on the cliff-side he stood, rigid and unforgiving.  He looked like he was a hundred years old.  Bony, worn, slight and singular.  It unnerved me that he should stand so perfectly straight. His frame looked like it would be crushed had he chosen to to lift an apple.  He just stood there, staring at me.  Not moving even an inch.  </p>\n\n<p>After weighing my options for a hot minute, I slowly started back towards the opening, never taking my eyes from the man.  I could imagine him jumping that ledge and blocking my path at any minute.  He did no such thing.  And within moments I was back through the doorway, twisted and unconscious for a split second, and then rapidly regaining my bearings back in the world that is so familiar to me.</p>\n\n<p>&quot;Not just me right?&quot; A sharp sideways grin spread over Davis&#39;s mocking face.</p>\n\n<p>My mind could put together no intelligent question so I replied with my heart. &quot;What the fuck was that?&quot;</p>\n\n<p>&quot;Dunno yet, man.  Somewhere else. I know that.&quot; He ran his fingers over his five o&#39;clock shadow.  &quot;What I do know is that I&#39;m going back. Tomorrow.  I already cancelled my open house.  And you&#39;re coming with me.&quot;</p>\n\n<p>Typically any suggestion that Davis made that concerned my whereabouts, activities or well being would be immediately discarded.  This was no exception.  I began to run him through the dangers involved in whatever he had discovered.  I listed the ways that we could already be hurt, or in danger just from visiting once.  I tried to convince him that the existence of any sentient being in that place made matters even worse.</p>\n\n<p>In the end, our typical dynamic played out as it always did.  I would put up a fight, and try to convince him to take things slowly and cautiously. And by the end of the conversation I would find myself agreeing to his preposterous plans and even participate, though begrudgingly.</p>\n\n<p>There is one thing I hold to.  Discovering something of this magnitude, it would make us famous if not enormously wealthy.  But even beyond that, what this would mean to the world.  What this would mean to people. To know that there was something out there that we have not even begun to explore. This would change science, religion, society. It has to be explored and people need to know that their world is so much bigger than they think.</p>\n\n<p>Please forgive the brevity of this post. I tried not to go overboard with details which I will have to do at some point soon.  But tonight I need to go home and start packing.  We&#39;re heading back in the morning with cameras, first aid kits (my idea), food, water and a number of other tools we may need, least of which being Davis&#39;s 9mm handgun.  I don&#39;t imagine I will get much rest tonight but I have to try to sleep. We leave in the morning.  I&#39;ll post pictures and evidence here first, even before notifying the media.  Stay tuned.</p>\n</div>\n","author":"hashbanger"}