{"rank":"59","title":"Parenthood is not all it's cracked up to be...","id":"8jggi7","url":"/r/nosleep/comments/8jggi7/parenthood_is_not_all_its_cracked_up_to_be/","time":"1526336608000","body":"<div class=\"md\"><p>&quot;You&#39;re going to be a father!&quot; </p>\n\n<p>Those were some of the greatest words I have ever heard in my life. Aside from, &quot;I do!&quot; from my wife, I can&#39;t think of anything better to hear. This all came as a surprise, though, since we weren&#39;t trying and she was on birth control. Yeah, I know, it&#39;s not 100&#37;, but you really don&#39;t expect it to happen to you. Still, though, this was to be one of the happiest moments in my life.</p>\n\n<p>At least it should have been. As the pregnancy drew on, something was never feeling right. While still in the womb, he seemed to...well...it&#39;s hard to explain, but I&#39;m trying here. He always seemed to know when I was talking to or about him. It&#39;s not abnormal to see babies shift during pregnancy, but he&#39;d actively seek me out when I would talk to him. He also was very demanding from my wife. He&#39;d make sure she ate specific foods and would not let her get away with not eating for a while, or even drinking water at times. I&#39;m not talking about starving him, I just mean when he wanted it, he wanted it then and there. He&#39;d make her miserable until he got it.</p>\n\n<p>&quot;Oh, he&#39;s just developing! It&#39;s a pregnancy thing, don&#39;t worry,&quot; my wife and other people would say.</p>\n\n<p>&quot;He&#39;s just going to be a daddy&#39;s boy!&quot; they&#39;d tote, &quot;Be happy about it!&quot;</p>\n\n<p>I just knew this wasn&#39;t normal. I wish I had stopped it before it had gotten that far, but my personal beliefs wouldn&#39;t allow it. Never mind that I have no say in it and my wife would never have aborted anyway. So, I sucked it up and just figured it was me. I mean, this was something new and I was just scared, right?</p>\n\n<p>Finally the day came and he arrived. I forgot all about it. However...I didn&#39;t have that immediate bonding feeling with the child. My wife? No problem. Same with my relatives. Everyone kept telling me how happy I must be. How proud I must be. Oh, he looked like me, so that wasn&#39;t an issue. It was...something else.</p>\n\n<p>I felt terrible for a long time. I would research why I didn&#39;t feel connected to my child. Every website I saw basically told me it was a psychological problem, that I was, indeed, a bad parent, or because I&#39;m a <em>\\</em>gasp** man <em>\\</em>gasp** it&#39;s a problem with me genetically and, as a man, I&#39;m terrible. I began to feel even worse, until I really started to pay attention to my son. That&#39;s when I realized, it wasn&#39;t me. It was him.</p>\n\n<p>He always seemed very advanced for his age. He was holding his head up at 3 days old and looking around. Not just that blank stare, but a deep and intense study. By a month old he was trying to stand himself up and, with help, was able to do so. He was already babbling and laughing at two months while jumping in his jumper. He would follow me intensely and watch my every move. He studied EVERYTHING.</p>\n\n<p>Then I started to notice strange things happening around the house. Keys began to go missing. Kitchen utensils moved around the house from the drawer. The TV changing channels with no one touching the remote. Light bulbs popping randomly and mostly in his room.  As he got older, even stranger things would happen. He&#39;d &quot;talk&quot; to things. He&#39;d act like he was following someone walking around the house, or something flying around the ceiling.</p>\n\n<p>&quot;Oh, he&#39;s playing with angels,&quot; my mother would say to be cute, &quot;All babies do it.&quot; Do they? Do they lay there and reach up with both hands to get picked up by these &quot;angels&quot;? Do they talk to these angels? Do these angels...have voices that come through the baby monitors singing and talking to them?</p>\n\n<p>He started on formula a few months ago. He&#39;d be drinking from his bottle, but I didn&#39;t give it to him. Neither did his mother. We never knew where he got it from. The dog, a very loving bulldog, was always by his side, but...started to shy away from him. Cautious, but not really scared. He&#39;d stare at that dog and she&#39;d slink away, as if being told to leave. She loved that baby at first, but recently...I&#39;ll get to that. When he&#39;s done with his bottle, he&#39;d drop it. I&#39;d hear it hit the floor at times, but...it was gone. Nowhere to be seen. He&#39;d start laughing as I was looking for it. When I stared at him, he&#39;d just grin and point his hand at me then laugh some more. We lost three bottles like that. Sometimes we&#39;d find them wedged in places there&#39;s no way he could have gotten to, such as in the storage shed outside, or in a drawer.</p>\n\n<p>When he started on solid foods recently, it was much the same. He was already feeding himself with the spoon! He is only six months old and already feeding himself with a spoon! Again, he&#39;d drop or toss things and they&#39;d disappear. He&#39;d just laugh when you look for it. Many times he&#39;d end up holding it, shaking it in his little baby hand showing you he found it, and then go back to eating or hand it to you to be washed. My wife can&#39;t be more proud. I can&#39;t be more worried.</p>\n\n<p>Now...the dog. I thought it would be funny to have the dog lick his face at times to clean him up. At first he seemed to find it funny, but I guess it&#39;s another thing I should have stopped. About a week ago I left him to eat and I can only guess the dog went to lick his face. I was in the kitchen when I heard him fussing at the dog, then the dog yelp in massive pain. I thought maybe he twisted her ear...but she was gone. There he sat, babbling to himself and eating. I looked every where for my dog. I had her for four years and she was gone. I asked him what happened to the dog, and he just smiled...laughing and shaking his head at me. I asked him several times, but he seemed to get upset and stopped responding. My wife thinks she ran away after getting hurt. That&#39;s impossible since all the doors were shut at the time.</p>\n\n<p>Things are getting worse. He&#39;s getting more talkative, at six and a half months old. If he doesn&#39;t like something, it ends up gone or the person ends up dead. We were at a pizza parlor up in Virginia City this past weekend. The staff was great, but he didn&#39;t like one of the guys who pinched his cheeks. The next day, the guy was gunned down during a drug deal outside a local casino. Two weeks ago I was pulled over and made the statement to my wife as we were pulling away that the cop was an asshole. A day later he was killed in a traffic collision involving wild horses.</p>\n\n<p>I don&#39;t know what to do. I&#39;m trying to be the best father I can be, but...one wrong move and I may be gone. Parenthood...is not all it&#39;s cracked up to be. Especially with your BOY is an SCP</p>\n</div>\n","author":"croidhubh"}