{"rank":"7","title":"Birdwatching","id":"8jh05g","url":"/r/nosleep/comments/8jh05g/birdwatching/","time":"1526341492000","body":"<div class=\"md\"><p>I’ve always liked birds. They are beautiful yet fragile creatures. Their feathers of all colors like black, auburn, orange, red, blond and even the rapturous blue make them more gorgeous than any other animal on earth. So naturally I picked up a hobby for birdwatching. Though you could say I started this hobby late at the old age of 25. I always was a rather lonely person and staring at birds through the window of my room was just something I did as a youth. But when I was 25 I decided to really take it seriously. I bought binoculars and bird books and scoured the suburban neighborhood in which I lived by endlessly to watch and record the numerous birds of Texas that made their residence here. Besides, it was good to get out of the apartment. There were times where I’d be holed up inside for days without leaving. Working at home for an office firm could do that to you, especially if socializing was never something you were good at.</p>\n\n<p>One of the types of birds that I enjoyed watching the most were killdeers. They typically show up here in this part of Texas halfway through spring and stay up until the end of autumn. Most people find them to be nuisances like pigeons because they’re named for the loud and abrasive “kill-dee!” sound they make. Their nests are usually made in gravel or rocky areas because their eggs are a light brown with black specks spangled across the shell. They camouflage so well you may never notice when you’re about to step on them, and the mother comes running from nowhere crying fire and fury with her kill-dees. They, once more like pigeons, have a less fearful standing with humans because their nests are often so close to us. They trust quickly and easily.</p>\n\n<p>There was a park in the neighborhood I lived near where all of the parents took their kids during the spring or during the morning hours of summer (before the triple digit weather came). A bench sat at the base of a hill that overlooked the large playground protected with an awning that must have cost the city a pretty penny to build so quickly, as I never remembered it being there a week before I starting birdwatching. But the parking lot was built nearby the bench and some natural rocks stuck out from the dirt where the construction workers also placed some gravel. A mother killdeer built her nest here just ten feet from this bench.</p>\n\n<p>I didn’t even need my binoculars to watch her. Every morning I sat on that bench and watched her covet and nurture her singular egg in her nest. When I’d come to the bench, she would hop from her nest and run around the gravel, screaming at the perceived threat of me. But after I sat down for only five minutes, she would come back to rest upon her precious egg after realizing I meant her no harm. She was just as I read of the killdeers: she trusted very quickly. After a week, the egg had hatched and revealed a beautiful baby bird. The books didn’t lie, they hatched running! It wasn’t ugly like most birds are when hatching; this one had feathers and energetic legs. It walked with its mother outside of the nest.</p>\n\n<p>To me, the bird was an absolute treasure. It reminded me of why I loved birdwatching. I could see into these animals’ lives, however uninteresting or simple, while they thought nothing of me. They thought nothing of the giant man that sat on the bench and watched life unfold before his eyes. The mother bird and the baby looked so soft. I wanted so dearly to pet their feathers like one pets a dog or cat. It was different for birds. Well, at least for killdeers. I had never heard of them becoming pets or ever showing affection towards humans. Even though it trusted me, I doubt I could come forward and pet it or its newborn. But I was determined.</p>\n\n<p>Each day I moved a foot closer to the nest. The mother was none the wiser. It fed its baby and taught it to run with grace. The father would return every now and then when the mother would cry from some other perceived threat. That was usually the children playing on the jungle gym or the old couples feeding pigeons nearby. But it regularly stayed away from the nest, as it was the mother bird’s duty to stay. Eventually, I got close enough to reach into the nest. The baby was scared of me understandably. I must have seemed colossal to the poor thing. The mother came running and squawking, but there wasn’t much she could do to stop me at this point. I had pet the small bird, while the mother frantically cheeped and put on a broken wing display to no avail. I was smarter than her. Not that I was here to prey upon the bird. But the thought occurred to me that if I had wanted to, the small baby bird was completely at my mercy. And the mother helpless to stop me.</p>\n\n<p>The baby killdeer was indeed soft. It huddled into the nest unsure of its capability of using its legs to flee. My index finger coaxed the feathers on its back ever so softly. I didn’t want to hurt the poor thing. I started to feel shame. My curiosity had caused distress not only for the baby bird but also its mother. Animals were very capable of feeling fear, I knew as much. But could birds remember? Would the mother ever trust me again? These thoughts ran through my mind as the mother frantically flapped her wings and limped along the gravel in an attempt to lure me away from her precious offspring. I relented and took my seat back on the bench.</p>\n\n<p>The mother continued for a few minutes. But eventually, she made her way back to her baby. She sat atop it and warmed it. She soothed it. Was it crying? Could it speak in some bird language and tell its mother it was scared? Birds were very much like humans. So much so that it gave me ideas.</p>\n\n<p>There was another baby bird I watched. Its feathers were a beautiful blonde and it had impossibly blue eyes. She was such a sight; surely it was a beautiful bird you only see once in a lifetime. She was soft, and I had to pet this one too. But her mother protected her much like the killdeer. But they trusted easily, so said the books.</p>\n\n<p>So, I sat next to the mother on the bench. We made small talk. She was a beautiful specimen too. Her feathers and eyes matched the baby bird’s, but they didn’t have the same softness. I still had to earn her trust, so I propped open my bird book and pretended to read it while I was watching the young bird. She moved with grace and energy as though she had just learned how to fly. It was magnificent to behold.</p>\n\n<p>Over the weeks, I inched closer and closer to the nest so the mother would trust me. We became good friends. I noticed the father bird sometimes came by the nest, but like the killdeer he wasn’t always there. It seemed it was the mother’s duty to stay. I would ask the mother how things were while I watched the cardinals land in the nearby trees, and she would ask me how my job was holding up. Sometimes we would laugh and I would think it’s okay to pet the baby bird, but somehow, I knew I had not yet earned the mother bird’s trust.</p>\n\n<p>The day finally came. I had brought a frozen treat to eat while birdwatching, and the mother bird took her usual spot on the edge of the bench. She asked where I had bought it, and I informed her of the ice cream truck on the other side of the hill that overlooks the playground. She looked excited and asked me to watch her baby bird. The mother wanted to treat her offspring. I told her I wouldn’t mind.</p>\n\n<p>In truth, there was no ice cream truck. But by the time she would have made it over the hill, my hand was already in the nest. I was smarter than her. And this time I was here to prey upon the bird.</p>\n</div>\n","author":"GoGoSpaceMan"}