{"rank":"122","title":"I shouldn't have gone hiking with my friend","id":"8jh10e","url":"/r/nosleep/comments/8jh10e/i_shouldnt_have_gone_hiking_with_my_friend/","time":"1526341714000","body":"<div class=\"md\"><p>Daniel and I have been friends since middle school. It’s a relationship that was initially formed by proximity--our surnames start with the same letter so we were always seated next to each other--and sustained by the relentless grindstone of time. Honestly? The guy can be a real pain in the ass. In fact, I would say that it’s his default setting, and so I wasn’t terribly surprised when five minutes into the hike he went plunging off into the underbrush, completely disregarding the spray-painted blazes that marked the way.</p>\n\n<p>“Dude, you’re supposed to stay on the goddamned trail,” I shouted after him half-heartedly.</p>\n\n<p>“The trail can suck my dick!” came the faint response, partially muffled by his crashing footsteps. Like I said, default setting. </p>\n\n<p>I spent a moment relishing the peace and quiet that inevitably descended whenever Daniel was out of earshot. Then, somewhat reluctantly, I shouldered my backpack and went to follow him. The guy has a lousy sense of direction and no clue about proper woodland behavior, and I didn’t relish the thought of having to call the rangers out to rescue him. </p>\n\n<p>I stepped off the path and my boots sunk into the loamy earth, which immediately released a thick cloud of midges. It took a surprising amount of effort to lift my feet from the clinging muck. I’d hiked up Gwyllion Mountain by myself and with others many times before (first time with Daniel though), and it wasn’t a difficult hike. This was the first time I’d ever disregarded the trail.</p>\n\n<p>I wish I hadn’t done it.</p>\n\n<p>It was easy to follow Daniel’s destructive passage through the woods. Broken sticks and trampled leaves littered his wake. If I stopped and listened, I could hear him faintly in the distance, whooping and shouting incoherently. The air was spicy with spilled sap and the musty odor of overturned stones. The trees started to more closely together and curved over my head, their leaves blocking the sky. It was as if I were walking through a forest cathedral—even the birds maintained a respectful silence. All I could hear was my own increasingly labored breathing and the soft suck of the mud beneath my feet.</p>\n\n<p>Then I realized I couldn’t hear Daniel anymore. I stopped walking and strained my ears for the slightest sound. Nothing. How long had I been following this idiot? It couldn’t have been more than ten minutes, yet the air was suffused with a distinctly unseasonable chill, and I realized that I could no longer clearly see my hands in front of me.</p>\n\n<p>“Daniel? Daniel!” I shouted. My voice died in the still, humid air. Nothing to do but continue to follow his footsteps, now larger and deeper and oddly distinct in the half-light of the forest.</p>\n\n<p>They led to a small clearing and then abruptly stopped, as though Daniel had been whisked up into the air. There was something small and gleaming in front of the last print and I knelt down to identify it.</p>\n\n<p>A neat pile of bone-white pebbles, stacked with obvious care and intent. A cairn.</p>\n\n<p>I can’t really describe to you the sheer magnitude of the dread that squeezed my throat and stomach in its iron fist. I tore my gaze away and up, anywhere but that evil little collection of stones, and found myself gazing at what was hanging directly above my head. A shirt, jacket, and jeans hung neatly from the tip of an overhanging branch, swaying gently in a relentless breeze. The jeans had been tucked carefully into a pair of muddy hiking boots. Daniel’s boots. </p>\n\n<p>A bright beam suddenly lit up the clearing and I spun around, afraid and disoriented. Daniel was shining his flashlight into my face.</p>\n\n<p>&quot;Dude! Mark. Mark, are you okay? I was looking for you, bro.” Daniel peered closely at me, his faced creased in an unfamiliar expression of concern.</p>\n\n<p>“You were…I saw…” I stammered, managing to flail my arm upwards. Daniel followed my gesture with his flashlight, illuminating a branch bare of leaves or anything resembling clothing.</p>\n\n<p>“You saw what?” he asked, skepticism and the usual asshole-ishness creeping back into his voice. I managed to direct my gaze downwards and flinched involuntarily when I saw that the cairn was still there.</p>\n\n<p>“Oh, that,” said Daniel. He began to chuckle. “Like it? That’s some Blair Witch shit right there.”</p>\n\n<p>My unexplained dread was beginning to dissipate into annoyance at Daniel and the more commonplace fear of being lost in the middle of an unfamiliar forest.</p>\n\n<p>“You’re a fucking idiot,” I told him. “Why the hell did you go off trail? Now I have no idea where the hell we are.”</p>\n\n<p>“Don’t worry,” he replied, and began to walk briskly off. “The campground’s only about five minutes from here.”</p>\n\n<p>I followed him. What else was I supposed to do? It was so dark now that I could see nothing except Daniel’s flickering light. He strode ahead in silence, occasionally sweeping his light back and forth across the ground behind him, for my benefit I suppose.</p>\n\n<p>Something was very wrong but I couldn’t quite articulate it.</p>\n\n<p>At some point we must have retained the trail because soon we were walking up the familiar steps that led to the campground and viewing platform, not that we were going to get any spectacular views at this time of night. </p>\n\n<p>Daniel’s voice came out of the darkness. “C’mon, help me build up the fire.”</p>\n\n<p>I wondered why he had turned off the flashlight, and then I realized what had bothered me before. As he had illuminated the path in front of me and behind him on our way to the campground, he left no footprints behind him. The marshy ground had remained undisturbed.</p>\n\n<p>I tried to speak very calmly. “In a bit, man. Gonna set up my tent now.”</p>\n\n<p>“All right,” came the soft reply. </p>\n\n<p>By some small miracle of muscle memory I got my tent set up in the pitch dark in record time, then crawled in. Some instinct warned me against switching on my own flashlight. It didn’t matter anyway. I still saw the cairn, glimmering like bone in the middle of my flimsy abode.  </p>\n\n<p>So. I’m typing this on a phone whose battery is rapidly diminishing. Yes, I tried to contact the police but my call failed, and I wouldn’t know what to tell them anyway. Somehow I was able to access the Internet, but I don’t have much hope that this will ever be seen.</p>\n\n<p>It’s still standing out there, waiting. Toying with me. Sometimes I hear its rapid footsteps circling me at a gallop, other times it runs long fingers down the outside of my tent.</p>\n\n<p><a href=\"https://www.facebook.com/LindenWriter/\">Any advice?</a></p>\n</div>\n","author":"stange_loops"}