{"rank":"303","title":"Accounts from a Lonely Broadcast Station Finale [Part 9]","id":"8jh4jq","url":"/r/nosleep/comments/8jh4jq/accounts_from_a_lonely_broadcast_station_finale/","time":"1526342600000","body":"<div class=\"md\"><p>Part <a href=\"https://old.reddit.com/r/nosleep/comments/8fp44u/accounts_from_a_lonely_broadcast_station_part_1/\">1</a>, <a href=\"https://www.reddit.com/r/nosleep/comments/8fwy74/accounts_from_a_lonely_broadcast_station_part_2/\">2</a>, <a href=\"https://www.reddit.com/r/nosleep/comments/8ga7c7/accounts_from_a_lonely_broadcast_station_part_3/\">3</a>, <a href=\"https://www.reddit.com/r/nosleep/comments/8gsnkx/accounts_from_a_lonely_broadcast_station_part_4/\">4</a>, <a href=\"https://www.reddit.com/r/nosleep/comments/8hblei/accounts_from_a_lonely_broadcast_station_part_5/\">5</a>, <a href=\"https://www.reddit.com/r/nosleep/comments/8hotb1/accounts_from_a_lonely_broadcast_station_part_6/\">6</a>, <a href=\"https://www.reddit.com/r/nosleep/comments/8i7u2o/accounts_from_a_lonely_broadcast_station_part_7/\">7</a> ,<a href=\"https://www.reddit.com/r/nosleep/comments/8it3dh/accounts_from_a_lonely_broadcast_station_part_8/\"> 8</a></p>\n\n<p>The  forest was alive. Even before the fog came, we could see it moving and  wriggling with electric energy as the thunder roared overhead and  lightning cracked at the top of the mountain. I’ll admit for a moment, I  actually wondered if a forest fire would be <em>preferable.</em>  Obviously death hadn’t been enough to keep Jennifer and countless  others from coming back in some form, and so I later decided that  setting every strange abomination on fire would only create more dangers  for us.</p>\n\n<p>I won’t beat around the bush. We  were scared. We knew enough and had seen enough to know we wouldn’t be  safe. As the rain poured down and the cables and lines swayed from side  to side off the tower, Daniel and I were not only afraid for our own  safety, but for everyone else’s.</p>\n\n<p>This broadcast tower was keeping the town alive. <em>We</em> were keeping the town alive. An alcoholic and a failed theatre actor: who knew?</p>\n\n<p>The  lights flickered again, prompting the broadcast to turn to static and  skip as I scrambled behind the desk to get the sound going again. For  mere seconds, the waves would go silent, then spring to life again just  as a rumble would vibrate underneath the tower. I noticed Daniel flinch,  holding one of his ears just moments after the broadcast came back and  static-filled music played again.</p>\n\n<p>“You hurt?” I asked him, but he shook his head, stretching out his jaw.</p>\n\n<p>“No. My ears won’t stop ringing though.”</p>\n\n<p>I shrugged it away, imagining all of those cliche excuses. <em>It’s the weather</em> or <em>the pressure is different up in the mountains,</em>  so on and so on. But he bounced back immediately, marching over to the  window to scan his eyes over the dreary-looking forest. It was hard to  see much of anything through the rain, but he squinted to make out  shapes on the horizon.</p>\n\n<p>“There’s something moving out there.” He said almost breathlessly. “...Far away, but it’s getting closer. It’s hard to see.”</p>\n\n<p>I  didn’t need to see for myself to know what he was looking at. In the  midst of the rain and the lightning, the fog would still find a way to  roll in. After all, it wasn’t really a product of the weather at all. It  was more of a living thing, or rather, an amalgamation of all <em>formerly</em> living things on this side of the mountain range.</p>\n\n<p>“...I  need you to run the emergency broadcast.” I told him as I pushed away  from the console and popped up out of my chair. A strong wind whipped  past, rattling the walls and making the wooden floorboards creak beneath  our feet. I felt unsteady, suddenly worried the old stilts holding us  up would give in and we’d crash down into the trees below. The only  thing worse than the fall would be the exposure to the open woods,  should we even survive the way down. The floor rumbled as if the  building itself were <em>breathing</em> before  it settled back into place. I looked at Daniel and he looked back at  me; we both knew we’d have to prepare for the worst the storm could do.</p>\n\n<p>As  he practically fell into the chair, turning on the microphone to  broadcast a crackling message over the air, I rummaged in the storage  closet for industrial sized flashlights and the keys to the generator  shed. Now, all of this supplies made more sense to me: backpacks,  emergency food rations, first aid kits, flares, fire starting kits …  this place was never meant to be a radio station. It was most likely a  ranger lookout that had been adapted into something capable of  large-scale broadcasting. While knocking things out of my way in search  of the keys, I found a pack of walkie talkies, and checked them for  batteries.</p>\n\n<p>Daniel was already done with  his announcement by the time I found them, and appeared at my side to  snatch one out of my hand. He seemed to be thinking the same thing I  was: if the power went out, one of us would have to go out there to turn  on the generator. <em>One</em> of us.</p>\n\n<p>We couldn’t risk both of our lives with nobody to take over the responsibility.</p>\n\n<p>“Did you start the music again?” I asked him.</p>\n\n<p>Daniel nodded. “It’s going.” He said, but the lack of confidence in his voice spoke of a deeper thought. It was running <em>now,</em> but if the lights continued to flicker, it might not be for much longer.</p>\n\n<p>There  was nothing else to do but wait. As the fog bounded through the forest,  moving the trees with the weight of its eerie inhabitants, could  only watch as it engulfed the entire woodland.</p>\n\n<p>I had never seen the fog rest at the edge of the forest, but it did this time. Something about the music, or rather the <em>signal,</em>  kept it from crossing that line between us and the town further down  the mountain. We unplugged our headsets, letting the music play in the  studio for us both to hear, and sat down at the edge of the window on  the floor. It was the calm before the storm as we stared at the swaying  poles and wires outside, wondering which one would be the first to snap  or end up snagged in a tree.</p>\n\n<p>A moment  passed, but it was a long and excruciating moment of silence. Dan was  the first to break it, as his talkative self almost always was.</p>\n\n<p>“You  wanna know what I did before this?” He asked, but I knew he’d tell me  anyway. I nodded still. “After I graduated with a master’s degree in  performance art- a <em>master’s</em> degree -  the only acting job I could get was recording a commercial for some  plumbing service. I recorded lines in an actual studio, talking about  toilets for twenty takes. And you know the worst part?”</p>\n\n<p>He  laughed, looking over with this stupid, somewhat disheartened grin.  “They didn’t even pick mine. I heard the commercial on the radio in my  car and it was someone else completely. Never in my life did I think I’d  be legitimately <em>pissed</em> because I wasn’t chosen as a spokesman for toilet cleaning.”</p>\n\n<p>That  actually made me laugh, even if it was a bittersweet moment of  lightheartedness. I shrugged my shoulders with an expression of  nonchalance. “Go figures you’d get let down by the radio <em>twice.”</em> I gestured to the room around us and Daniel snorted mid-chuckle.</p>\n\n<p>“What about you?” He asked in return. “Tell me a stupid thing you’ve done.”</p>\n\n<p>I  had to think for a moment, not because I couldn’t recall any but  because there was too much to recall. Somehow, all of my stupid mistakes  just ended up … sad.</p>\n\n<p>“I almost died in a  bathtub once.” I said, chuckling even if it wasn’t all that funny.  Daniel seemed unsure if he should laugh or not. “I was shitfaced and I  felt terrible so I wanted to take a bath. Ended up passing out almost  the second I got in it and Jennifer found me after I had apparently  flipped face-down. She honestly thought it was a suicide until they got  me breathing again and found out I was <em>still</em> just as hammered as when I went in.”</p>\n\n<p>That  time, I laughed but Daniel didn’t. I even knew it wasn’t funny, but I  was desperate to grab at straws just to find a reason to take it  lightly. When I saw the severity of the frown on his face, my smile  disappeared and I suddenly felt like a child being scolded.</p>\n\n<p>“How  long have you been sober?” He asked. I didn’t need to question how he  knew it was an ongoing thing. After all, he had seen enough on my  computer to know most of the truth by now.</p>\n\n<p>I  felt a tightness in my throat and the breath I took in next was shaky  and uneven. “M-my first sober day was the day I came into work a few  weeks ago.” I had to bite my bottom lip to keep from letting it tremble.  Putting it into perspective felt pathetic, reminding me of just how  soon it was. “...The only reason I’m not drunk right now is because the  fuckin’ grocery guy only brings me cheap, shitty iced tea.”</p>\n\n<p>That  time, we both laughed, but it didn’t last. In a second, amusement  turned to tears as I unwillingly felt a sob escape me, both of my hands  covering my face. With my eyes squeezed shut, I only felt Daniel’s hand  pat between my shoulders and remain there until I uncovered my face. I  refused to let myself cry out loud. Those thoughts and feelings were  pushed back down as my eyes returned to the fog at the edge of the  forest. I watched it move and swirl, many eyes and many shapes moving  and twitching as if waiting eagerly to be allowed further. The shed was  so close to the edge. <em>Too</em> close.</p>\n\n<p>A  familiar pair of eyes stared back at us then. Up in the tree, free from  the fog and hopping near to tap its beak at the window, was that damn  bird again. I looked at it closer this time. Its eyes were hazel. Now, I  found myself wondering less where it came from and <em>who</em> it had borrowed those eyes from.</p>\n\n<p>“What did you see?”</p>\n\n<p>I  heard Daniel’s voice, but didn’t process it at first. With a deep  breath, I wiped away the tears from my face and turned to him with a  ‘hm?’ of confusion.</p>\n\n<p>“...At the graduation party. You were in the woods and you saw something. Didn’t you?”</p>\n\n<p>The  word ‘graduation’ in itself made my stomach sink. I looked away from  Dan again, squinting as I struggled to bring those thoughts forward  again. Somehow, just looking for the memory caused an internal pain.</p>\n\n<p>“I  didn’t know there was anything fucked up about the woods back then.” I  said. “I told you that I left here, right? When I was a really little  kid. My dad died and my mom remarried, so we moved in with him out of  town. Then I came back the week of graduation with a bunch of people I  used to know as kids and they all said this woods got <em>creepy</em> since I left…”</p>\n\n<p>Bits  and pieces were still missing from my thought process, but I was  piecing them together in the moments I paused and kept silent. It was  some terrible puzzle slowly coming into view, and it made my face turn  to a grimace.</p>\n\n<p>“I wandered off, probably  because it was loud and everyone was acting like an ass. But out in the  woods, I heard something. It was a growl I thought at first, but now  that I remember that sound, it was … it was a voice. A low, gravely,  painful <em>groan.</em> This animal stepped  out of the bushes and I thought for sure it was some kind of cougar or  wild dog, but its face… oh god, it had this <em>face.</em> Yellow eyes like a wild cat, but the nose and the mouth were … different. Human and familiar.</p>\n\n<p>“He  looked at me and I saw his mouth move, trying to say something. But all  that came out was this terrible rattle, like it hurt to breathe. It  sounded like he was suffering, like it took everything he had just to  say a single word. I-I ran back to the party and I drank and drank and  fucking <em>drank</em> until I couldn’t  remember that thing’s face anymore. And it worked for a good, long time  too. But now? Now that I’m sober, all it took was thinking about it once  for it to be stuck in my head again.”</p>\n\n<p>Dan  gave me an apologetic look, as if he had some reason to feel sorry  about it all. His hand fell on my back again and he opened his mouth to  speak. I’m sure it would have been some great words of wisdom or  encouragement, but he never had the chance.</p>\n\n<p>There  was a flash of lightning and a deafening crack as it struck one of the  poles standing around the station. The thunder blended into the sound of  the crackling radio for a split second before the lights went down, the  sounds stopped, and we were plunged into a dark, thick silence.</p>\n\n<p>All  I could see in the dark were Dan’s eyes, illuminated by the flashes of  lightning as he watched the forest’s edge. The fog twisted and moved in  patterns of rolls, tumbling over itself like a living beast as it  crawled towards us. It was almost too dark to see, but my eyes could  make out blots of shapes inside of the fog - arms, legs, bodies, all of  them eager to inhabit the land they had been barred from until now. The  mist swirled around the stilts of the tower, creeping upwards before we  had no choice but to made a split decision.</p>\n\n<p>Daniel  turned on his walkie talkie, testing it by holding it up to his mouth. I  could hear the crackle of his voice come through mine even just a few  feet apart.</p>\n\n<p>“I’ll let you know when I’ve  got it going.” I told him sternly, jumping up to my feet. I was about to  push open the fire escape with no hesitation, but I felt a rough hand  grab the back of my shirt before I had the chance.</p>\n\n<p>“Stay in here so you can get the radio going.”</p>\n\n<p>“No.”  I answered flatly, refusing to follow that order. There was a scowl  pulling at the edges of my lips as I glared at him. “I wasn’t there when  you got hurt and I couldn’t help Jennifer either. So let me do this.  ...Let me do this.”</p>\n\n<p>We stared at one  another for almost too long, but I could feel him slowly letting go of  my shirt. His arm dropped, giving back my freedom to move, and he nodded  his head once in silence.</p>\n\n<p><em>Daniel, if you’re reading this, you snooping bastard … thank you.</em></p>\n\n<p>The  door took a heavy burst, but I shoved it open and was surprised for a  moment when I didn’t hear an alarm. Of course, it didn’t take long to  remember that the power outage had taken <em>everything,</em>  not just the lights and the radio signal. The fog was already rising,  covering the ground and crawling upwards over the sides of the building.  It was only moments before I was trapped inside of it, not sure whether  to run for my life or take it slow to stay hidden. It would have been  no use. They knew I was there already.</p>\n\n<p>I  held my flashlight in shaky hands to illuminate the steps of the fire  escape. There were no vines, no slimy, mud-covered appendages, and  nothing waiting there to trip me. Still, I didn’t trust that the fire  escape was unoccupied. I could hear a faint clank from the bottom, as if  something was trying to pull itself up to the open door behind me.</p>\n\n<p>The <em>sound</em>  in that fog was maddening. The amalgamates were suffering inside of  themselves, parasites eating off of one another and groaning in some  constant pain. The ones that didn’t moan and cry in their torment were  voicing aggressive growls or rattling breaths as they searched through  the fog for another living thing to tear apart and add to their  collection of stolen bodies. My flashlight caught a glimpse now and  again of milky white eyes or the glimmer of rain-soaked skin or fur. I  didn’t dare look back, but I could hear and feel the crash of weight  against the fire escape, as if something was trying to crawl its way up  underneath a section as I passed.</p>\n\n<p>Once  the end of the stairs was in sight, I made it my goal to run to the shed  as quickly as possible and lock myself in immediately until the  generator would start. The problem would be getting <em>out.</em> My light caught the end of the step, and there I saw what had been making all of this noise.</p>\n\n<p>A  woman’s face stared up at me with dead, pale blue eyes. She was  dragging herself, her upper body struggling to leave the ground and  crawl its way up, as her lower half was weighing her down. This half of a  woman, one I remembered seeing sprawled over the branch of a tree, was  being engulfed in roots and bark. The living plant her corpse had been  fused with pushed itself along the ground but clumsily, as if it was too  heavy and too scattered in its movements to make any progress.</p>\n\n<p>Her arms, however, were still moving and capable of grabbing me if I got too close. The worst part was how <em>pleadingly</em>  she looked at me, as if the human part of her was begging for a way to  get out. I couldn’t help but feel that the aggression was <em>fear,</em>  but it didn’t tug on my heartstrings quite enough to convince me to  stop. I jumped over the edge of the stairs, falling only a couple of  feet from the ground and making a straight line to the shed. The keys in  my pocket jingled and slipped between my fingers as I tried to find the  right one, all the while far too aware of every shadow and every  glimmer of eyes creeping closer.</p>\n\n<p>The fog  was too thick to see well. My flashlight only served to show me that  there was nothing directly in front of my eyes, but it was perhaps a  blessing that the creatures hunting in the fog were stuck in it just as  much as I was. I still sensed that they knew I was there, searching and  struggling to catch anything in their grasp. I ever heard the shriek of  one, like the sound of a whining animal in pain, as it was caught in the  clutches of another, larger, and likely more terrifying beast.</p>\n\n<p>I  felt the surface of the wood in front of me, whispering words of relief  as I patted along the edge of the shed until the door was at my  fingertips. A pair of keys were fished from my pocket and my clumsy  fingers struggled to swiftly find the one small bit of metal that I  needed.</p>\n\n<p>Just then, I heard a crackle. It was the walkie talkie connected to my hip, Daniel’s voice on the other end.</p>\n\n<p>“Did you find it yet?” He asked, but I felt my stomach tie up in knots when his voice rang out over the silence.</p>\n\n<p>I  wasn’t the only one to hear him. Heavy grunts and stomps of feet, like  hooves digging into the dirt, surrounded me. I could hear the shriek of  something vaguely avian mixed with a human-like scream, and bellowing  roars that shook my skull from the inside. I was in a rush to open the  door, trying every key as I blindly searched for the right one. Finally,  as I prepared to swing the door open, I could feel the vibration in the  ground as something heavy and tall landed by my side as if jumping from  the tops of the trees.</p>\n\n<p>In the blinding  fog, I could see brown and grey fur, spotted with blood. It smelled like  rotten flesh and mold, its joints cracking and groaning as it bent down  to my level. I could see its eyes in the periphery of my vision - at  least six of them, pale, stained with flecks of jaundiced yellow,  sitting above an elk-like snout. Its antlers scraped the side of the  wood with a terrible, jaw-clenching sound. I felt a touch to my back,  and recognized it immediately. The spider-like appendages that had  brushed my arms on the last fog day weren’t the legs of some giant  spider, but this thing’s <em>fingers.</em> It breathed in, then out with a rattle, and the stench of blood and death was warm against the side of my face.</p>\n\n<p>When  I told Daniel that almost drowning in a bathtub was the stupidest thing  I had done, I meant it. It was the stupidest thing I had done … <em>yet.</em> But this day, I changed all of that.</p>\n\n<p>I  threw the shed door open, stepping out of the way to let the heavy  wooden plant hit the hulking beast beside me directly in its nose.  Moving quicker than I ever had in my life, I slipped into the shed and  jammed the door shut behind me, locking it up tight and throwing  anything I could find in front of it as I heard the beast bellow more in  <em>annoyance</em> than in pain.</p>\n\n<p>My  light shone on the generator, but I had to work quickly. I felt a  tremble in the floor as whatever stood outside knocked against the door  so roughly that it caused dust and debris to fly into the air. I fumbled  with a can of oil, spilling a bit of it onto my shoes and my pants but  still managing to fill the machine as that <em>thing</em>  outside rounded the edge of the shed in only two large steps. It  pounded on the roof, big enough and powerful enough to cause the wooden  beams above my head to crack bit by bit. I threw the nearly-empty oil  can to the side and tried to find every button and switch in order  before the ceiling collapsed under the weight of that thing’s fists.</p>\n\n<p>I flipped the first switch, then the second, knocking my fist against it as I impatiently waited to hear it spring to life.</p>\n\n<p>“Dan!”  I yelled over the walkie talkie. “I’ve almost got it. You have to get  ready to switch the breakers though. They’re downstairs, <em>go!”</em></p>\n\n<p>I  heard his voice, but it was muffled and his words weren’t making sense  over the endless crackle. God, I hoped he heard me. I felt a pain in the  back of my head as a bit of wood from the ceiling fell with another  forceful hit, and suddenly I could see a pale light from above as the  foggy sky became visible. A hole had been punched in the ceiling, but in  moments, it was blacked out by the multiple eyes of that tall, decaying  abomination from the woods.</p>\n\n<p>I flipped the last switch and the generator began to rumble. It was a <em>success,</em>  and regardless of whether or not I survived to escape this crumbling  wooden hazard, the station would have power in moments. I staggered  back, clothes and hair smelling like oil, staring up at the pale eyes  above the roof with frightened defiance.</p>\n\n<p>The  shed rattled, another hard punch or kick hitting it from the side where  I stood. It was enough to push me forward and knock me onto my hands  and knees, but it didn’t last. I could hear it before I saw it. The  lights outside buzzed as they all came alive one at a time, bathing the  entire clearing with a yellow light. That’s when I heard my device  crackle again, Daniel’s voice speaking clearly on the other side.</p>\n\n<p>“I can’t get the radio started.” He told me in a panic. “It’s - there’s not enough power to run it! It won’t work!”</p>\n\n<p>It  seemed like a failure at first. But then I remembered that stupid,  laminated piece of paper I had been staring at for the last month on my  desk. Rule #1: When the radio is down, activate The Bell.</p>\n\n<p>I was only pissed that he’d be the one to push it after that button had been tempting me since my first day.</p>\n\n<p>“See the button on the wall? The one behind the case? Push it.” I shouted back to him sternly. “Don’t hesitate, just <em>push it!”</em></p>\n\n<p>I  could hear him on the other end, fiddling with the case before he did  exactly as I said. The next thing I heard was surprising.</p>\n\n<p>Nothing.  I didn’t hear a damn thing. At least, not from the speakers on top of  the radio tower. Instead, I heard Dan let out a pained yell and fumble  around the room before a small mechanical whine and a clatter followed.  Later, I would learn what that was: it was Dan throwing his hearing aid  across the room.</p>\n\n<p>The creatures outside  didn’t disappear. Rather, they became noisy in their pained and agitated  sounds, rumbling past and dragging themselves away in any way they  could. They were retreating to the forest, bothered by some sound that  my ears couldn’t pick up. A drone, perhaps too high or too low for my  ears to hear, was driving them off. The Bell, just like every other tool  around here, was solely there to control <em>them</em> all along. Or rather, to control the forest itself.</p>\n\n<p>The  eyes disappeared from the hole in the ceiling and I could hear the  hulking creature above me slowly stomp away, resigning itself to return  to the mountain. My legs felt like jelly and my head was pounding, but I  still managed to find the door and push my way out into the fresh air  again, just as a glimpse of a giant, mud-covered hoof disappeared into  the treeline.</p>\n\n<p>Daniel had propped open the  fire escape when I came back up, slowly and exhaustively forcing my way  to the top. The lights were on, the radio was off, but we were safe for  the time being. The first thing my co-worker did was pull me into a  hug, lifting me a few inches off the ground, and saying these profound,  thoughtful words to me:</p>\n\n<p>“You smell like petroleum.”</p>\n\n<p>I  wish I could say that was the last time anything weird has happened  here. But, as you can guess, a day or two has passed and everything is  still bullshit. The sink doesn’t cry anymore, but we still get some  weird calls and Dan told me that it rained <em>pebbles</em>  the other day. I told him I was pissed off that he didn’t collect any  for me like a baby otter. I’m sure things will always be weird around  here and there will always be some story to tell, but for now, I think  I’m going to focus on doing my job and lasting a bit longer than  employees one through twenty-seven. But I&#39;m sure if you don&#39;t hear from  me, Dan will be sneaking on my laptop again some day. I could change my  password, but ... nah.</p>\n\n<p><a href=\"https://www.reddit.com/r/1046FM/comments/8j61aq/part_9_update_more/\">This is Evelyn at the 104.6 Emergency Broadcast Station</a>, and in case you were wondering, that bird is still out there. Daniel decided to name it Bartholomew.</p>\n\n<p>I fucking hate Bartholomew.</p>\n</div>\n","author":"wendingus"}