{"rank":"14","title":"Nightmare","id":"8jh6hn","url":"/r/nosleep/comments/8jh6hn/nightmare/","time":"1526343102000","body":"<div class=\"md\"><p>I can’t take it anymore. </p>\n\n<p>I haven’t slept in days, look at me, do you think I want to look like this? I used to be pretty… but now I can’t even stop crying long enough to fix my makeup or even…it doesn’t matter.\nEvery night when I close my eyes its the same;  I’m in my bed but don’t feel like I’ve gone to sleep. Its so real. It feels… Real.</p>\n\n<p>The dreams aren’t always the same. Last night for instance; I heard sobbing. I didn’t want to get up to check, but it was like, like I didn’t have any control over my body, y’know. I felt myself sitting up. Pulling away the sheet. And completely outside of my control, stepping onto the bedroom floor.\nThe wood of the floor was cold. Much colder than it had been when I had gone to bed, Colder than wood has any right to be. Usually it has that warm, natural feeling, but tonight it felt like Ice. I ignored it, and stepped out the bedroom door, into my hall.</p>\n\n<p>The sobbing was much, much louder out here, it was like our whole house was filled by these sobs coming from the bathroom. Its so hard to explain, I’d never felt like this before these dreams started, but I felt like a backseat driver inside my own head. I wanted to scream for someone, for help, but I couldn’t. All I could do, was walk slowly down towards the bathroom.</p>\n\n<p>When I got there the sobbing stopped, as strangely as it started. The bathroom door opened, I didn’t touch it so it must have been a air pressure or something. Light from in the bathroom hurt my eyes after the dark hallway but when I was able to see again, mom was sitting, curled up in a ball on the floor against the bathroom sink. She must have been the one making all the noise. Opposite the sink, lying in the bath was… </p>\n\n<p>It was the size of Jimmy…</p>\n\n<p>He was wrapped in that stuff they make sacks out of, Hessian I think its called. Brown ropes were tightly wrapped around him holding the cloth in place. They bound his ankles, his knees, his waist, and werer knotted thickly around his neck keeping the cloth tight against his face. I didn’t know how, but he was still breathing, the cloth moist with his breath, was moving in and out with every gasping breath he took.\nThe thing in the bath started to move more violently as I entered the bathroom, he was moving around and moaning like he was in pain, and then suddenly patches  of red appeared randomly on the cloth, as though a dozen deep wounds had  spontaneously opened in his flesh.</p>\n\n<p>Blood quickly soaked through the material and began to stain the bath. I could not stop watching as he bled out into the bathtub, the movements and noises becoming weaker every second, before finally stopping. Then there was nothing for a moment until the blood soaked pile of rags began to sit up towards me.</p>\n\n<p>In my fear and desperation I was able to snatch back control of whoever was driving my body, and turned to mum. She was no longer in a ball on the floor and sitting up. Only…\nOnly it wasn’t mum. </p>\n\n<p>She had the same face as my mother, the same body, but I’d never seen that sort of  hatred and anger in my mothers eyes, I had never seen anything on her face like that before. It was not my mother.\nShe reached out trying to claw me but I finally had full control of my body back. I slammed the bathroom door in that thing’s face and sprinted down the hallway.  </p>\n\n<p>This bit is always the same, Three loud bangs, like someone was trying to smash in our front door. And I’m back in bed, covered in sweat. </p>\n\n<p>It was three AM. </p>\n</div>\n","author":"jwplato"}