{"rank":"19","title":"A Novel Excerpt from my Grand-Grand-Uncle","id":"8jhfe1","url":"/r/nosleep/comments/8jhfe1/a_novel_excerpt_from_my_grandgranduncle/","time":"1526345282000","body":"<div class=\"md\"><p>When my grandmother died, I was the one to settle her estate and collect her possessions. Most of the things I found were mundane and others – more questionable. </p>\n\n<p>If you have ever lost a loved one, you might understand how emotionally draining it is to go through their personal things. It feels like an invasion, in spite of the fact that they are gone and never coming back, and at the same time it just <em>hurts</em>. They can be quite scary as well, the things you dig up. </p>\n\n<p>So, with that in mind, I have several cardboard boxes in my house that are filled to the rim with old papers, diaries and photo albums from my grandmother and it wasn’t until recently that I found the energy and courage to go through one of them. </p>\n\n<p>Due to some events that happened after her passing, I became interested in genealogy. I ordered some kits and dumped my DNA into various online databases like 23 &amp; Me and Ancestry.com. Nothing satisfying came out of this search. The fact that I had a 4th cousin twice removed from Wichita, Kansas, told me absolutely nothing of interest about my ancestors or myself. And all that time, boxes full of memories and family history were piled up in my basement. </p>\n\n<p>I decided to open one of the boxes up. I found more tax forms than personal letters, but I did find one thing that struck me as odd – a writing excerpt from a grand-grand Uncle. I remember my grandma talking about him. Hector was his name. He drank himself to death in his fifties. Supposedly, he was miserable because nobody wanted to publish his writing and he hated his job. </p>\n\n<p>His excerpt is simply titled “An Autobiography”. I don’t know this grand-uncle, but I was raised to honor my ancestors. I see no better way to honor him than by sharing his strange story with all of you, so that he is published in some way at least. Here we go.</p>\n\n<hr/>\n\n<p><em>An Autobiography</em> by Hector Wolfling </p>\n\n<p>“I’m him,” I hissed. </p>\n\n<p>“Who?” the boy replied. </p>\n\n<p>Yellow teeth stood crooked in a hollow-cheeked frame.  He wore a black frock coat, with the top buttons undone. A slightly lopsided, black top hat rested on his head. The aimless way in which the lad slung his beech wood walking stick about betrayed the fact that the he was no gentleman. He bore no rings, or any other jewelry for that matter. One of the Bureau’s orphans, I knew right away. </p>\n\n<p>“I’m Hector,” I whispered. “From the Bureau.”</p>\n\n<p>“That’s not possible.”  The boy shook his head, as the rest of his body stood frozen in between two of the pub’s round, oak tables, underneath the orange light of a brass oil lamp. “They said you would be playing a board game.”</p>\n\n<p>“I’m playing cards, am I not?” I replied, pulling out a second chair. </p>\n\n<p>“That’s not a board game,” the boy replied. \nI threw up my hands. </p>\n\n<p>“If I wasn’t Hector, how would I know about the Bureau?” I asked, remembering that one must always be frank with orphans, as even the slightest of subtleties escapes their senses. </p>\n\n<p>“Alright,” the boy spoke. “I suppose that makes sense. I am Victor.” In spite of the intense training and reconditioning that the Bureau had doubtlessly put him through, the lad’s voice retained a sort of common flatness. </p>\n\n<p>“I know,” I said. “Let’s keep it quiet, shall we? Did you bring them?” \nI handed the boy a few of the playing cards, as per the Bureau’s instructions. This way, we would look like a normal pair of men playing cards in a pub. Father and son even, perhaps. The more innocuous, the better. </p>\n\n<p>“You only gave me queens and an ace, sir,” the boy frowned. “I can’t play any games with that.”</p>\n\n<p>“It does not matter,” I replied. “I do not know any games. Just put one down. It will look as though we’re playing.” \nThe boy hesitated, before he complied. He put down a Queen of Hearts. I placed another card on top of it. I believe it was an ace. </p>\n\n<p>”Did you bring them?” I repeated. “The words?”</p>\n\n<p>“Yes,” Victor answered. “Are you ready to receive them?” A card rested in between two long, bony fingers. They trembled slightly. </p>\n\n<p>“I am,” I said. “But you have to be quiet about it. And keep playing.” </p>\n\n<p>Victor looked around the pub. A four-man flute band played songs on the small stage in the back, as in the distance, the red-haired barmaid foamed an amber liquid into a glass, from a wooden barrel. Finally, the boy leaned closer to me, and whispered: </p>\n\n<p>“Computer. Tuxedo. Video-Home-System. Intranet. Apollo. Eleven. Telephone.” </p>\n\n<p>I listened carefully. Most of the words sounded foreign and exotic, yet I found myself relieved. I recalled my encounter with another man, no more than a fortnight ago. The cloaked stranger. He had been at least two decades older than Victor, and he drank tall glasses of dark ale. </p>\n\n<p>“Is that all?” I asked. </p>\n\n<p>“Yes, sir.” Victor replied. “That’s all I have.” </p>\n\n<p>“Fine,” I said. I looked around the dim pub. A few patrons made their way to the door, as a new stream of guests trickled in. The flute band played a tired song. </p>\n\n<p>“You can leave now.” I snatched a playing card out of the young man’s hand. </p>\n\n<p>Victor nodded but remained seated. </p>\n\n<p>“You may leave,” I repeated, remembering my commitment to being clear in my communications with orphans. “You will be paid after I have delivered your words to the office.”</p>\n\n<p>“Well, I just got one more question, sir,” Victor said. “What does it all mean, those words?” </p>\n\n<p>I glanced at the boy in disbelief. There he sat right across from me, in his ill-fitting suite with his ill-fitting manners. Words that would change the world rested in between his slightly parted lips. He spoke several of them a mere minute ago, and yet he did not know what they meant. </p>\n\n<p>I sighed and pulled out my golden pocket watch. It was eleven o’clock, the gray striped number display told me. </p>\n\n<p>“Never you mind,” I said. </p>\n\n<p>The boy’s face betrayed disappointment, but he accepted my rejection with a quick smile. </p>\n\n<p>“Pleasure doing business with you,” he said, as he got up from his chair. I watched as he walked through the pub, until a crowd of people and smoke absorbed him from sight. </p>\n\n<p>I thought about the other man. The one that I met two weeks ago. </p>\n\n<p>“Forget your old pipe, sir,” he grinned, after several pints of that dark drink. “I’ve got something way better for you. Directly from the Bureau.” </p>\n\n<p>I took the white, paper stick out of my coat pocket and lit it with the flame of a tall candle that sat on top of the table.  Victor’s words danced through my mind, and I repeated them quietly, to myself. <em>Computer. Tuxedo. Video-Home-System. Intranet. Apollo. Eleven. Telephone.</em></p>\n\n<p>I wondered how the boy gathered these – promises. Were they sent to him in dreams? Daytime visions? Each of the men employed by the Bureau of Better Advancement had a variation of the Gift. Most of them were willing to put it to work in exchange for a few coppers and a belly full of food. Few realized how valuable they were to the cause, and even fewer exploited this fact. </p>\n\n<p>In the forty-six years that I worked for the Bureau, I only heard of them being defeated once. It was a lass – the only female ever known to be employed by this agency. She had been an aristocratic lady. The barley-haired, seventeen year old daughter of a baron. </p>\n\n<p>They located her Gift and showed up on the doorstep of the gray-brick manor in which her family resided, but she did not go with them at once, like the others did. In exchange for her words, she demanded that they set her up with a job at the London Journal, and that they paid for her rent in a luxurious, downtown apartment while she worked. </p>\n\n<p>Her words turned out to be of little importance; they were about young men fighting in muddy ditches – as young men have done since the beginning of time and likely would again - and sugary things called “twinkies”. </p>\n\n<p>I stared at the deck of cards, which now laid flat in the middle of the table. Were they designed by the Bureau as well, I wondered. Did they hear a young man speak of cards, many centuries ago? Of paper kings and queens? Or of red clovers and ink-black hearts? \nTools. I did not know the words that Victor spoke, but I knew that they were tools. “Bless him”, I thought, for his variation of the Gift was the kind that brought enlightenment into the world. The kind that the Bureau made into devices that enhanced humanity’s progress.</p>\n\n<p>I took a drag off the white, tobacco-filled stick that the stranger called a ‘cigarette’, and that I’d taken to calling a disposable pipe, and pressed its bright orange tip into the heavy wooden table top, in the way that the stranger had showed me. </p>\n\n<p>I could not stop thinking about him, now.  His hazy blue eyes, and the way in which he vanished one pint of drink after another. He laughed often, but those cloudy eyes never laughed along. I did not need to prompt him to speak his words. </p>\n\n<p>He unburdened himself freely. They were nothing like Victor’s. He spoke of iron birds crashing into towers. Of crimson rivers amid fields of poppy. Of molten bodies in a city that laid flattened to a pulp. Of a single man advocating for the demise of millions, through a device called “radio”. Of a rock in the vastness of space and the two centuries that sat between it and Earth. </p>\n\n<p>I remembered how thin the stranger was. How peaks of greasy, blonde hair rested heavy on his forehead. “Tell them,” he hiccupped in between mouthfuls of dark liquid. “Tell them at the Bureau, tell them that they have to stop. I don’t know what it means – the things that I see. But I see them, I see them every night. They mustn’t come true. Tell them to stop. Please.”</p>\n\n<p>Nausea made its way into my stomach. The young orphan and his gift of enlightenment – were his words better than the older stranger’s? Did one’s predictions not lead to those of the other? \nI stood up abruptly, moving the table. The heavy candle shook, and several drops of wax flung out of it. “No,” I thought to myself. “It is not up to me to question. The Bureau must do what it must.” </p>\n\n<p>I picked up my hat from the table and wondered if hats were invented by The Bureau as well, and at what cost, before I quickly banished the thought. The Bureau of Better Advancement knew best.  </p>\n</div>\n","author":"thelamehelptheblind"}