{"rank":"19","title":"Why I will never go to my cousins again","id":"8jhgz9","url":"/r/nosleep/comments/8jhgz9/why_i_will_never_go_to_my_cousins_again/","time":"1526345698000","body":"<div class=\"md\"><p>So I always heard about the <a href=\"/r/no\" rel=\"nofollow\">r/no</a> sleep but never went but today I have something to post on it. I&#39;ll be honest I never thought I would have to post anything on this tag but here I am, this is the reason why I&#39;m never going to my cousins house again.</p>\n\n<p>So I&#39;m 17, my cousion Elijah is 18. He has an apartment but lives with his friend John who is 20. I was invited over to help him fix something in the house since he always breaks stuff and him and John are to lazy to fix it themselves so they call me a lot. This day John called me and asked me to help fix the sink since the water wasn&#39;t running, I thought maybe something was blocking the pipes so I said sure why not.</p>\n\n<p>When I got there it was around 6:30pm but it was pretty light out still. I got inside and started looking for John because he&#39;s the one who called me. When I went in and started looking I couldn&#39;t find him, I looked in the room, bathroom, living room, but I really couldn&#39;t find him anywhere.  After some time I just thought that he had left to go somewhere and left me to do the job, this whole time I also forgot about Elijah so I went to look for him but couldn&#39;t find him either. I decided to just go work on the sink. While I was working on it I kept hearing noises in the house but just thought it was the house shifting since it was old. What finally drove me to go look around was hearing Footsteps in the house. When I went to go look around see what that noise was I found a little door that I never really seen when I usually went there, I open the door and was horrified by what I saw there was just a really old mattress on the floor and it&#39;s like there was urine and blood on the floor also so I shut the door and waited outside the house for the two of them to come back.</p>\n\n<p>When Elijah and John had finally come back they wondered why I was there, I was so shaken I could barely talk. When I told them that one of them called me to try to fix the sink Elijah and John looked really confused since they had said the sink was running fine and if it was broken then they didn&#39;t know what happened to it. I told them about the room but the way they reacted was really weird they had both said that there was no extra door so I decided to go and show them. I saw the door and I opened it and I found Elijah and John were horrified and shocked like I was, we had decided to call the police. One of the police men was looking around and found John&#39;s cell phone. The police said the recent call to my number, they asked why I was there in the first place I told them I got to call about a broken sink... Guess John didn&#39;t really call me.</p>\n\n<p>After the police had come they said that there had probably been someone living there from the mattress and urine stains. They also said that if the person&#39;s did call me there was probably something bad plan for me. You may be thinking well there&#39;s nothing to worry about since the room was found and you&#39;re fine still. The reason I&#39;m never going there again is because I found a picture of me when I was bent over the sink looking for what could have fallen down before I tried to fix it. Also who&#39;s ever in that room has it been caught yet so I dont want to go over thinking it&#39;s John or Elijah but end up being the person in the room.</p>\n</div>\n","author":"KarlaKarlaM"}