{"rank":"4185","title":"I've Had The Same Student In My Class for Seventeen Years","id":"8jhjoj","url":"/r/nosleep/comments/8jhjoj/ive_had_the_same_student_in_my_class_for/","time":"1526346416000","body":"<div class=\"md\"><p>Teaching was my calling, and I entered the profession wide-eyed and filled with innocence. Although my first year had <em>many</em> bumps in the road, my classroom became a thriving community where learning flourished — or so I’d liked to think.</p>\n\n<p>I remember every student from my first year, I can still recite the class roster alphabetically seventeen years later. Their faces are forever burned into my mind, and I cherish those memories to this day.</p>\n\n<p>On the first day of my second year, I was filled with joy as one of my former students walked through the door — Dawn Beasley. Dawn was a sullen and withdrawn child and I had struggled mightily to connect with her, as did her classmates. Preparing to reassure a kid with the first day jitters, I approached her for a hug. </p>\n\n<p>Instead of embracing me, Dawn stared at me like I was a perverted stranger and backed away. Without a word, she slipped off her backpack and sank into a chair in the back row — her seat from last year.</p>\n\n<p>“Sweetie, you know I love seeing you, but this isn’t your class anymore. We can catch up later, but if you don’t hurry you’ll be late.” I spoke to Dawn in my calmest teacher voice, hoping I wouldn’t make her feel unwanted.</p>\n\n<p>Rather than acknowledge my request, Dawn stared ahead in silence, firmly planted in her chair. </p>\n\n<p>“Dawn, I know you’re nervous but you can’t camp out here, as much as I would like that. Come back later today and I promise I’ll find time to chat.”</p>\n\n<p>To my great annoyance, Dawn remained in her seat, staring at me with blank eyes. The other students began noticing the brewing power struggle, causing them to whisper excitedly among themselves. Having a former student blatantly disregard my directions was not an ideal start to the school year, it was a problem I’d have to nip in the bud.</p>\n\n<p>“I’m not going to say this again, it’s time to leave.” I filled my voice with every ounce of authority I had in me.</p>\n\n<p>I expected some reaction, but Dawn just sat there expressionless. Disrespect was one thing, but this was beyond that. For the first time in my career, my anger boiled over.</p>\n\n<p>“My patience is gone, put on your backpack — now!” I strode over towards Dawn and forcefully grabbed her by the arm, “Class, stay in your seats until I get back.” </p>\n\n<p>For the entirety of the walk to the principal’s office, we remained in silence. Not that it seemed to matter to Dawn, she hadn’t said a word through the entire ordeal. </p>\n\n<p>“Mrs. Avanati, I need you to deal with this child. Despite not being my student, she refused to leave my class after several clear directives — I’m at a loss.” I threw my hands up in the air to signal my frustration.</p>\n\n<p>For a moment, the principal stayed silent, a perplexed looked etched into her face. She seemed to be struggling to formulate an appropriate response, as if the words were filed away in some seldom used cabinet. </p>\n\n<p>“I’m a bit confused, what do you mean by not your student? Dawn is one of our late registrations, and Mr. Wagner, she is assigned to your class.” She barely masked her irritation, astounded at the perceived stupidity of my actions.</p>\n\n<p>Her words hit me like a ton of bricks, I felt reality crumble around me. Dawn was in my class the previous year, of this I was sure. But Mrs. Avanati was not one to joke, and her face betrayed no feeling other than displeasure. </p>\n\n<p>“I, uh — must have missed her name on the class roster. I’m so sorry for this intrusion, I guess I have the first day jitters.” My nervous laughter did nothing to lighten the tension.</p>\n\n<p>Head held low, I walked back to my classroom with Dawn. All of the questions racing through my mind I forced out of my consciousness. I had students to teach and they were my priority. </p>\n\n<p>“Class I apologize for my behavior earlier, even teachers make mistakes sometimes. I’d like to welcome back Dawn, she’ll be joining us for the year after all.”</p>\n\n<p>I made no attempt to explain myself further, and even if I had wanted to, what explanation could I give? Nothing made sense and for the first time in my life, I felt utterly lost.</p>\n\n<p>The day went by at a snail’s pace. Every other minute I glanced at the clock, barely able to concentrate. I did my best to avoid Dawn, being in her presence caused a visceral reaction that manifested physically. Something deep inside of me was begging me to run, a primal fear passed down in our genes by half-starved ancestors fleeing from giant beasts of old. </p>\n\n<p>As soon as the last bell rang, I quickly ushered my students out the door. Dawn was the last one to leave, slowly trailing behind the others. Before she left, she turned around, lips pursed into a victorious smirk, and gave me a wink.</p>\n\n<p>My head felt bloated on the drive home, filled to the brim with impossibilities. The gears in my head came to a grinding halt, unable to process the events of the day. </p>\n\n<p>I felt so confident in my position, Dawn <em>had</em> been my student. Every fiber of my being knew it to be true, screeching at me in agreement. Still, doubts had arisen I couldn’t shake — was I going insane?</p>\n\n<p>Hands trembling, I pushed open the door to my apartment, my cat meowing happily as I entered. Without hesitation, I rushed towards my filing cabinet and pulled out a file labeled <em>School Year, 2001-2002.</em></p>\n\n<p>Filled with anxiety, fearful of what I might find, I dumped the contents of the file onto the floor. Tests, report cards, field trip forms, and all other manner of school-related documents scattered around me. Like a man possessed, I combed through every single paper hoping I’d find evidence of Dawn.</p>\n\n<p>My first thought was the class photo, but I quickly remembered she was out with the flu that week — a planned act? Digging endlessly through graded papers and quizzes, I couldn’t find a single one with Dawn’s name attached to it. </p>\n\n<p>There didn’t seem to be a shred of proof that Dawn had ever been in my class. After almost two hours of searching, I was ready to throw in the towel and accept whatever came next. That was until, out of the corner of my eye, I spotted a small scrap of notebook paper folded so many times you’d barely notice it. </p>\n\n<p>Heart racing, I unfolded the paper, my clammy hands soaking the edges. The note read as follows:</p>\n\n<p><em>Dear Mr. Wagner,</em></p>\n\n<p><em>Your class was so fun, you are so nice and so fun. I want to be in your class again, that would make me so happy.</em></p>\n\n<p><em>Can I do that?</em></p>\n\n<p><em>Okay, thank you.</em></p>\n\n<p><em>Dawn</em></p>\n\n<p>I pumped my fist into the air, a short moment of sweet vindication. Then, reality came crashing down onto me. Everyone but myself had no recollection of Dawn, their memories of her vanished like a puff of smoke on a windy day. With a handwritten note and a head full of memories no one else could corroborate, I knew no sane person would believe me — once again I felt utterly lost.</p>\n\n<p>With no family support, no savings, piles of student debt and bills, and no other job prospects, I resigned myself to the fact that I’d have to return to work.</p>\n\n<p>My teaching style completely changed my second year. No longer was I the energetic teacher constantly floating around the room ready to offer additional support. I was a shell of myself, a deflated husk who rarely left the sanctity of his desk. </p>\n\n<p>Unlike me, Dawn was the same girl she had always been. Withdrawn and quiet to the point of near silence, little more than a shadow on the wall. Most of my days were spent observing her movements, trying to understand whatever I was dealing with. </p>\n\n<p>Dawn never interacted with other students. At the lunch table, her peers would give her a wide berth. Despite otherwise crowded tables, Dawn would always have several feet between her and the nearest children. </p>\n\n<p>Dawn never smiled. Her facial expressions never changed, other than the one notable occasion.  The aptest word for Dawn was neutral, she showed no emotions, no feelings, noting at all. \nHer eyes were dead and soulless, causing me to shiver every I saw them.</p>\n\n<p>Worst of all, Dawn never missed a day, that is, except class picture day. In later years that became a high holiday of sorts for me, a blessed day. </p>\n\n<p>During that year, I applied everywhere, but no one would hire me. I was over-qualified, under-qualified, and my personal favorite, just not what we’re looking for right now. My discouragement grew, and by the summer, I could barely find the motivation to send a single application a month. </p>\n\n<p>As my job prospects withered before my eyes, the bills began stacking up even higher. My car’s electrical system had to be replaced, my mom needed money for medication, my dog had to have knee surgery — the hits kept coming. By August of 2003, I was debt-ridden and financially unstable, in poor health due to stress, and terrified beyond reason as the first day of school rapidly approached. </p>\n\n<p>Sweat dripped down my brow as a new flock of students shuffled into my classroom. I uttered a weak hello as they found their seats. I had looked over the class roster endlessly, and Dawn’s name was absent every time. Still, I remained fearful.</p>\n\n<p>The student’s groaned as the shrill school bell rang, the first day had officially begun. A room full of eyes focused on me, waiting for instruction. Breathing deeply, I arose from my chair and introduced myself. </p>\n\n<p>“Good morning students and welcome to the 2nd grade. My name is Mr. Wagner.” My voice was flat, devoid of interest. </p>\n\n<p>“Good Morning Mr. Wagner.” A chorus of voices responded.</p>\n\n<p>The following hour was spent overviewing rules and expectations. As that hour passed, I felt the color begin returning to my face. A certain joy, a certain freedom that I had almost forgotten crept back into my heart. Dawn was nowhere to be seen, and I couldn’t be happier about it.</p>\n\n<p>My mood lightened, interactions with students were more positive, and everything about my demeanor improved. A weight had been lifted off my shoulder, while some live with a chip, I had been living with a boulder.</p>\n\n<p>Lunch came and went, and the students obediently followed me back to the classroom. This year would be different, I thought to myself, a wide grin plastered on my face. Ready to start anew, I gallantly strode into the classroom.</p>\n\n<p>“Mr. Wagner, you have a late registration joining your class.” The words cut through me like a serrated knife.</p>\n\n<p>Dawn stood nervously behind Mrs. Avanati, clenching her arm tentatively. The color I had only gained back moments ago, drained quickly from my face. </p>\n\n<p>“I believe Ms. Richards has a smaller class size, shouldn’t she be getting the new student?” I practically vomited the words onto the floor.</p>\n\n<p>“In most cases yes, but Dawn’s parents specifically asked for you because of all the great things they’ve heard — I decided to honor their request. And may I say, keep up the great work Mr. Wagner.”</p>\n\n<p>“Thank you, it means the world,” I replied through gritted teeth.</p>\n\n<p>Misery crashed over me, dragging me down into the dark abyss. Just being near Dawn made my skin crawl, I could barely look at her. Another year with her seemed unbearable, if only I knew.</p>\n\n<p>My teaching career lasted seventeen years. During that time I married, was gifted two beautiful daughters, and bought a modest home on a quiet suburban block. Despite all the change, one constant remained in my life — Dawn.</p>\n\n<p>Year after year, she’d find her way onto my class roster. I changed schools three times, even moving out of state, but it didn’t matter. I taught her in Iowa, California, and for a brief period in Oklahoma — part of a summer program I volunteered for. </p>\n\n<p>Strange and violent occurrences followed Dawn everywhere she went. I’d describe her as a poison, slowly seeping into a town’s consciousness and driving weaker souls mad. </p>\n\n<p>Soon after we’d move to a town, there would be a sharp increase in abnormal behavior and tragic events. Children went missing, otherwise normal individuals committed horrific acts, and drug addiction would run rampant, among other things. </p>\n\n<p>Despite the chaos swirling around us, tragedy had never struck my family. I had protected them from the truth, shielding them from that burden — I carried it alone. My children were my sole purpose for living, the only reason I managed to soldier on for so long.</p>\n\n<p>“Daddy, I made a new friend!” My youngest daughter’s tender voice echoed through the house, “I want you to come and meet her, I think she knows you.”</p>\n\n<p>“Well you know, I am pretty famou—“ I choked on my joke as I walked into the kitchen. Arm slung around my daughter’s shoulder, greasy strands of black hair obscuring her dead eyes, was Dawn. For the second time in seventeen years, I saw her ghastly smile, this time revealing rows of razor-sharp teeth. </p>\n\n<p>“Sasha come to me, now!” I screamed to my daughter in terror. But it was too late, Dawn clasped her jaws around my daughter’s neck, shaking her like a rag doll. Dropping down onto all fours, Dawn skittered away with blinding speed, crashing through a window in the foyer. </p>\n\n<p>I write this to you from prison, hoping somebody, anybody will believe my story. Lawyers, police, judges, and even my own family have cast my story aside as rubbish. If I am not freed soon, I believe my death is imminent. </p>\n\n<p>You see, there’s a new prison guard patrolling the cell block. Her greasy strands of hair dangle over dead, pale eyes — always watching me. </p>\n\n<p>When the long night is over, dawn rises once again. </p>\n</div>\n","author":"SpookBrain"}