{"rank":"0","title":"If you’re ever hunting in the woods, sleep with one eye open...","id":"8ji3nw","url":"/r/nosleep/comments/8ji3nw/if_youre_ever_hunting_in_the_woods_sleep_with_one/","time":"1526351503000","body":"<div class=\"md\"><p>Me and some of my closest friends decided to go on a hunting trip in the woods, staying in a cabin owned by my uncle. It was me, my friends Kenny, and Geoff. Because we were deer hunting, we brought hunting rifles on the trip. </p>\n\n<p>I pulled up to the cabin with my Ford F-150 pickup truck, after what seemed like forever driving on the driveway leading to the cabin, and proceeded to unload the truck of all the things that would satisfy a guys’ retreat. I first grabbed the cases of beer, and took them to the porch. Kenny and Geoff both followed with the grill, and cooler of food, respectively. I held the door to the cabin open for Geoff so he could take the food inside. </p>\n\n<p>Kenny went ahead and turned the power and utilities on for the cabin out back. I went back outside to grab the rifles in their travel cases, and heard the sound of leaves crunching, as if someone/something were walking on them. I looked in that direction expecting a curious black bear.... only there was a shadowy figure deep in the tree line, way too humanoid to be a bear. </p>\n\n<p>I ignored it, and just rationalized it as the feigning sunlight playing tricks on my eyes. Us three guys sat out on the porch, which had a fire pit, and drank some beers while reminiscing on old high school memories. These stories ranged from our girlfriends at the time, to how we got robbed a championship in high school football. </p>\n\n<p>The fire was dying out, due to nobody putting anymore logs on the fire, as everyone was ready to go to bed. It was Kenny that went to bed first, then Geoff, I stayed up to sit around the fire a bit longer. I soon became too tired to stay awake any longer, so I dumped a bucket of water on the fire to extinguish the flames. Earlier I lay claim to the master bedroom, which was on the ground level of the cabin. </p>\n\n<p>I climbed into the bed, and fell asleep immediately, I woke up to something in the middle of the night, it wasn’t exactly a noise, but rather something moving back and fort in the window, causing a shadow to flicker across the floor because of the moon’s lighting. I originally dismissed it as a tree branch swaying in the wind. </p>\n\n<p>Since I was already up, I decided to get up to go to the bathroom. When I stood up from the bed, I was able to see outside the window causing the shadows, to my horror, I saw the shadow of a humanoid figure who seemed to have climbed a tree. When I was done doing my “business”, I climbed back into bed and was about to go to sleep when I heard tapping on the window. </p>\n\n<p>My first thought was “it’s just the branches from the hedges”, but then I remembered... there’s no hedges around this cabin. I stood back up from the bed and saw a person with their hood covering their face out the window, thankfully this window is too tall for him from the outside. he was holding a fixed blade knife. I tried my best to not panic, or wake my friends upstairs. I moved slowly to my gun in its case, I opened the case, and loaded the gun as quietly as possible. </p>\n\n<p>I peeked back out the window, trying to be stealthy about it, so I don’t attract the stranger’s attention. He seemed to have moved on, just when I about let my guard down I hear footsteps on the porch. Without thinking, I went to the living room area where the front door to the porch is, and opened the door on the opposite side. I yelled out “get out of here!” And fired a shot into the air. I heard the footsteps scramble off into the forest, and it sounded like the steps were going back to would eventually take him to the main road. </p>\n\n<p>I didn’t sleep at all that night, in fact, I was so scared of what happened I couldn’t get myself motivated to go out into the forest, I told my friends about it, and they seemed to believe me. If they were convinced enough to not go out that morning, I’d say that at least believed me a little bit. I couldn’t help but think “what if the guy was a killer?” </p>\n\n<p>Either way, it ruined the guys’ retreat. </p>\n\n<p>Because of this experience I always sleep one eye open on my hunting retreats now. </p>\n</div>\n","author":"BayernMunich22"}