{"rank":"2","title":"The girl by the sewer Pt. 2","id":"8ji5hg","url":"/r/nosleep/comments/8ji5hg/the_girl_by_the_sewer_pt_2/","time":"1526351943000","body":"<div class=\"md\"><p><a href=\"https://www.reddit.com/r/nosleep/comments/8j99df/the_girl_by_the_by_the_sewer_pt_1/?utm_source=reddit-android\" rel=\"nofollow\">Part 1</a></p>\n\n<p>{TRIGGER WARNING: MENTION OF ABUSE AND RAPE}</p>\n\n<p><em>The Girl By The Sewer Pt. 2</em></p>\n\n<p>I don&#39;t know why but I did it. I opened up the door, I didn&#39;t see much though. I saw claw marks on the bottom of my door, almost causing a hole.</p>\n\n<p>But I saw <strong>her</strong> or at least I think so. She was pale, deathly pale. She looked at me and darted. Where? I don&#39;t know. Somewhere. I only had gotten 30 mins of sleep last night, I&#39;m tired and exhausted. I&#39;m too afraid to go back to sleep. I&#39;m in a school bathroom writing this because I can&#39;t talk to anyone about this.</p>\n\n<p>While sitting here, I&#39;ve done some research. Apparently there was a girl named Evelyn who was found dead by the sewer. The exact one I pass by everyday. As soon as I read that it gave me chills. </p>\n\n<p>I investigated some more and people reported that they had seen her.</p>\n\n<p>Then died. 24 days later.</p>\n\n<p>Panic. That&#39;s all I can do right now. </p>\n\n<p>When I saw her last night, she didnt look like she did before ..Her eyes had been replace with black void, there was nothing, every bit of her innocence had been taken and thrown into a pit of despair. </p>\n\n<p>I don&#39;t know what compelled me to, but I spoke into the darkness she had disappeared into. &quot;..how did you die?&quot; I didn&#39;t expect a soft voice to answer back but thats exactly what Happened.</p>\n\n<p>&quot;My mother..and her friends&quot; she hesitantly spoke.</p>\n\n<p>I was confused. What could&#39;ve happened?? Then, I heard my basement door close and scurrying feet. </p>\n\n<p>At this point, I could only think of the worst things that had happened to her. Then I had realized why her dress was tattered. I didn&#39;t want to think of it. So I opened up my laptop and did more research. </p>\n\n<p>She had been abused by her mother..and raped by her mother&#39;s friends. My face scrunched up in disgust. I couldn&#39;t believe what I had read, the reality hit me hard.</p>\n\n<p>Then my lights went off, then so did my laptop. Weird..Then I felt her hot breath on the back of my neck. I sat there in fear. I couldn&#39;t turn around, I didn&#39;t want to. </p>\n\n<p>inaudible whispering is all I heard in my ears. I closed my eyes, hoping everything would disappear. Then, when I opened my eyes, everything was normal. My door was closed, my fairy lights were on, and I was sitting on my made bed with my laptop on. </p>\n\n<p>It&#39;s strange cause I don&#39;t exactly remember falling asleep. I must have made my way under the sheets, because when I woke up that&#39;s exactly where I was.</p>\n\n<p>My dark room was strangely calm,and everything was silent. It felt like time had stopped and that my life was beginning to turn around.</p>\n\n<p>Of course, life is never that simple. I&#39;m pretty sure that Evelyn is going to haunt me forever. Maybe I can get rid of her? it wouldn&#39;t be a bad idea. I just want this to be over. I haven&#39;t gotten good sleep in forever and I&#39;m constantly anxious. I stopped going to school, I feel like I&#39;m slowly going insane and my friends are more worried than ever. I&#39;m fine though.</p>\n\n<p>I have been going places and have been seeing her more and more. My friends have been coming over to try to help me, but I keep brushing them off and keep telling that it&#39;ll be fine. Evelyn has become more of a mystery to me and curiosity is probably going to kill me along with anyone else who gets involved.</p>\n\n<p>I wouldn&#39;t consider myself a firm believer of ghost and spirits but this..this is different. She seems like she wants help but then again I&#39;m too afraid to help. She seems desperate. But as of right now, I&#39;m more worried about my due date. it&#39;s already been close to 2 weeks, 8 days to be exact. But I know I&#39;ll die if I don&#39;t help.</p>\n\n<p>It&#39;s sad that I&#39;m venting to people on the internet who probably don&#39;t even care. This is the only way I can stay calm at least. I can only vent to strangers and hope I&#39;ll get someone to help. I guess I&#39;m only writing this down for just in case I die.</p>\n\n<p>I hear knocking at my bedroom door, loud banging. It doesn&#39;t sound like anything my mom would produce, but my dad isn&#39;t home. I have a feeling that Evelyn isn&#39;t alone. That she&#39;s working with someone. Not someone. Something. They are both here to kill me, I just know it.</p>\n\n<p>I guess all I can do is sit on my phone, under my covers, typing this. This might not make any sense right now but, believe me, it doesnt to me either. I don&#39;t believe anything I see. Running off of little to no sleep and drinking coffee isn&#39;t helping. I&#39;m having worse night terrors, and all I can do is scream and hope for the best.</p>\n\n<p>I just know she is out to kill me. My door is almost tore open. I don&#39;t know what to do, I&#39;m sorry if I stop writing,  you&#39;ll know why. Evelyn has to be working with something and I intend to find out, soon. If I ever gain the courage to open the door, it could end two ways, death or confrontation. I don&#39;t know if I&#39;m okay with either. </p>\n\n<p>As of right now, I hear thumping above my head and the scratching has stopped. I need to leave. Maybe if I leave she&#39;ll leave. Or stay at the house. I&#39;m making a break for it.</p>\n\n<p><em>UPDATE: MADE IT OUT OF THE HOUSE</em>\nI&#39;m leaving for a vacation soon, and hopefully I won&#39;t have sleep paralysis or have anymore occurrences with her. I don&#39;t know. Maybe this is just a sick dream. Maybe I&#39;ll wake up and everything will be normal and I wont pass the girl by the sewer. But once again I&#39;m passing that sewer, and I see her crawling out, with her eyes glued on me. </p>\n</div>\n","author":"xxsomeonexx12"}