{"rank":"7","title":"University Hole: Food, Water","id":"8ji7cs","url":"/r/nosleep/comments/8ji7cs/university_hole_food_water/","time":"1526352397000","body":"<div class=\"md\"><p><a href=\"https://www.reddit.com/r/nosleep/comments/8j8djn/university_hole/\">Part 1</a></p>\n\n<p> •</p>\n\n<p>This happening has been difficult to talk about, and posting on mobile is my only option for a while. I started writing in a notepad, then an online word processor, but something is keeping me from mentioning the door. Internet and service has been spotty. The nightmares popped up again last night, developed a crushing migraine that should be controlled by medication. I&#39;ll ask my doctor about them if I get the chance, but summer semester started today and time will be slim. I&#39;ll do my best to write my experience down. Something tells me it is required.</p>\n\n<p>•</p>\n\n<p>At this point, avoiding the front door felt like the best option. </p>\n\n<p>Looking around for something to distract myself with, I surveyed the common room. I have to admit the place looked awesome despite the looming wall of dirt. Updated appliances, roomy kitchen, wide windows normally overlooking the community pool. Very comfortable aside from a soiled windowsill. </p>\n\n<p>Now, it was stuffy. It stank. It was cold.  Cramps radiated through my abdomen, feeling as if my stomach was eating itself. Despite the migraine and nausea, I was starving. If this was fake, the physical effects sure felt real.</p>\n\n<p>Survival mode kicked in, and I resorted to my problem-solving mantra: WWASD (What Would Adam Savage Do?) Summoning whatever memory I had of the MB island survival episode, I based my priorities on their goals: food, water, shelter, mind stimulation, and escape.</p>\n\n<p>I tested the kitchen faucet, relieved to have drawn clear water in response. I filled two filtered pitchers and placed them in the fridge. Rationing food was the next priority.</p>\n\n<p>I pulled all my food out of the cabinets, fridge, and freezer, taking inventory on a legal pad as I went. Keeping macros in mind (a habit from bodybuilding) I jotted down meals, rationing it out to a minimum amount each day. Two months worth of food and booze, hopefully unlimited water. Just in case the unit lost power I planned to finish meat in the freezer first. It didn&#39;t take long to replace the food.</p>\n\n<p>I had suspected how much weed I had left, but I checked anyway. Two months, if I paced myself. Once finished, I returned to the kitchen and slipped the pad and pen into a drawer.</p>\n\n<ul>\n<li>Food, check.</li>\n<li>Water, check.</li>\n</ul>\n\n<p>Shelter wasn&#39;t an issue. Unless I opened the door, I wasn&#39;t exposed to the elements. I get cold easily, a large stash of jackets and blankets was always close at hand. What did prove to be a problem was the apartment&#39;s pressure, stench, and the discomfort that resulted. Portioning migraine pills felt like the best option for the headaches. I had hoped they would knock out the nausea too, though the main culprit was the earthy smell. I figured I could escape the smell if I wrapped a clean towel around my nose and mouth. It didn&#39;t help much.</p>\n\n<p>In my fight-or-flight frenzy, I neglected to think of C. I&#39;m embarrased to say it took quite a while to knock on her door. I didn&#39;t know if I wanted her to be home. One one hand, I wouldn&#39;t want her to be stuck here. On the other, I didn&#39;t want to be alone.</p>\n\n<p>Gathering myself with a deep breath, I rapped my knuckles on her door.</p>\n\n<p>&quot;C? Are you here?&quot; Thirty seconds. Nothing. I knocked again.</p>\n\n<p>&quot;C, do you smell that? Are you okay?&quot; Another thirty seconds, nothing. I jiggled the handle to no avail. Risking embarrassment, I pressed my ear to the door. There was a low rumble, it took a few moments to realize what I heard was my own heartbeat. </p>\n\n<p>Five more times I knocked, called her name, and was answered by five rumbling silences. I slumped down to the tile, nearly in the threshold. I leaned my shoulder on the door, knees tucked to my chin. At that moment I felt selfish for wanting someone I barely knew to keep me company in that cursed hobbit hole. Tears welled, digging my guilt for being lonely even deeper. </p>\n\n<p>In the doorway, I became disoriented. Cold sweat broke skin as a wave of dissociation washed over me like a tankful of molasses. I was dragged to the ground, head spinning, body heavy. Breathing became increasingly difficult. </p>\n\n<p>Having no choice, I laid there focusing on my breath. It wasn&#39;t long before my eyes began to sting and eyesight blur. I kept on wheezing as best I could, squeezing my eyes shut.</p>\n\n<p>I&#39;m not sure how long I laid curled up on the tile before I felt a draft tickle my overgrown leg hair. It took what seemed like days to muster enough strength to turn my body towards the crack below C&#39;s door. There was indeed a draft. A draft that smelled of stale socks and moldy fries. It wss an improvement on the musty soil, like I had found an air pocket in a flooded sewer.</p>\n\n<p>Once I had a few dozen gasps of &quot;fresh&quot; air, the nausea subsided and heaviness drained away. Pushing myself up on all fours, I crawled to the kitchen. </p>\n\n<p>Nothing could get me to acknowledge the door. I kept my eyes to the ground until my hair brushed the kitchen cabinets. I tested my legs. Wobbly, but the counter made a good safety railing. </p>\n\n<p>On a plate I gathered a handful of strawberries, two tablespoons of peanut butter, and some lunch meat. With my plate and a cup of filtered water, I trailed to my room, shutting the door behind me. My spoils were on the desk only seconds before I got the heebie-jeebies and had to shut and lock every door in the room. Satisfied, I ate.</p>\n\n<p>Taste is taken for granted, it&#39;s not hard to forget the nose&#39;s role.</p>\n\n<p>Everything tasted like dirt, but in this moment I didn&#39;t care. I ate my peanut butter dipped strawberries and presliced turkey, pushing through the thick, lingering aftertaste. The dirt permeated everything from my clothes to my skin. It stuck to the tongue, the throat, the teeth.</p>\n\n<p>After finishing my improvised meal, I sat in silence staring at myself in the empty monitor across me, dark window towering behind. I had spent long enough on the floor for the PS4 to put itself in rest mode. Eyes were sunken, bags dark and heavy.  Matted hair twisted and piled at the back of my skull, brown tendrils slicked to the temples by old sweat. Cheekbones portruded from the sides of my face, shadows carving holes between the jaws. Any mom would have conniptions if she saw their child so hollow.</p>\n\n<p>Thoughts of the door invaded my mind, and I fought to push them out. They were as permeating as the earth stench. Its image lingered behind my eyelids, burned into my memory. The dark coat of paint, rusted deadbolt, the knob detached from whatever lay beyond a pristine threshold. Imagining this doorway as my only way out made me feel even more isolated. It made me sick.</p>\n\n<p>Despite being stuck in whatever stupor I was in, thoughts of the door were not welcome. Its ever changing destinations felt even worse than the unit I was buried in. I wanted nothing to do with the thing. </p>\n\n<p>Being stuck on my own isn&#39;t foreign to me. If I ignored the smell and thought of the daylight, this hole wasn&#39;t much different from most of my days. The thought of clearly dreaming or experiencing a psychotic break was ghoulishly reassuring. I could survive without thinking of the door for a while. </p>\n\n<p>Escape was not on my mind.</p>\n\n<p>•</p>\n\n<p><a href=\"https://www.reddit.com/r/nosleep/comments/8j8djn/university_hole/\">Part 1</a></p>\n</div>\n","author":"beefy5layerhamu"}