{"rank":"0","title":"I planned a meeting with my friends on a railroad.","id":"8jifr6","url":"/r/nosleep/comments/8jifr6/i_planned_a_meeting_with_my_friends_on_a_railroad/","time":"1526354536000","body":"<div class=\"md\"><p>I used to live in a small town in North Carolina during all of my childhood; there wasn&#39;t really any technology during then so me and my friends were outside a lot, although there was flip phones so we could still text each other rather than calling. </p>\n\n<p>Me and my three friends were hanging out on a road near the park playing with bricks trying to do the double domino effect, and I won&#39;t lie; we were also trying to score some girls.</p>\n\n<p>First, let&#39;s call my three friends Tim Franco, Jim Guaj, and Kim Zimon. (Note: These are all fake names)</p>\n\n<p>When they finally set it up it was short lasting pleasure but still nice. They set it up a few more times, on the third time I looked over and I saw a man in a black suit near a fancy restaurant; I thought &quot;Oh, he&#39;s probably waiting for a date or something&quot;. But then he pulled out a device that looked odd, or what would today be any other iPhone 8. I didn&#39;t like what or why he pulled it out, it made me feel uneasy. </p>\n\n<p>Tomorrow, I was packing my stuff from my locker; Tim and Jim have already left and Kim was sick so I was still at school putting books in my bag when I get a text. I will now paste the chat. </p>\n\n<p>Tim - Hey you wanna meet up?\nMe - sure where do you wanna meet\nTim - I was thinking the newly built railroad in the outback\nMe - when did they build a railroad\nTim - Just a few weeks ago\nMe - ok cool you gonna invite jim aswell\nTim - Yeah\nMe - aight guess we will meet there</p>\n\n<p>When I got home I did the very little homework I had to do then took a shower, after that I headed towards the outback; it was pretty far so I had to get there either quickly or early. </p>\n\n<p>When I got there it was dark but not too dark to the point where you couldn&#39;t see your hand in front of your face. I had to call my dad and ask him if he could pick me up in the next hour or two; He said it&#39;s only 5:24, I looked at the time and he was right even though it looked like it was 7:45!  How did it go dark that quickly? even then neither Tim nor Jim was there, also Tim said it was built a few weeks ago, in fact it was really rusty; it looked like it was there for at least eight months, at most two years. </p>\n\n<p>I waited for a bit, felt like 20 minutes; I stood on the railroad and stood in a prideful posture when I see him. No, not Tim nor Jim, I saw the man, the same man with the fancy clothes near the fancy restaurant with the same fancy gadget. I got anxious I stared into his face, it was emotionless, expressionless, and most of all sorry. He looked like he was gonna be sorry for what he was gonna do, he was walking towards me all the while and I didn&#39;t even realize. He got close and in what felt like less then a millisecond I heard rapid footsteps behind me, I got scared so I curled up in a ball to make me feel safe but the man had gone, instead he was running away from me behind me like he just went through me or teleported in the position behind me. </p>\n\n<p>I stared as he ran very quickly away from me, I turned my head and then I saw something I will never forget even in the afterlife. There lying on the ground was Tim and Jim very good looking, and very dead. I couldn&#39;t believe what I saw; it was surreal, too surreal I started hyperventilating, worried and only then I heard my phone ring I check it, it was my dad &quot;Dad (6 Missed Calls) 11:05&quot;. I thought &quot;No, my friends aren&#39;t just dead as a roadkill dog are they? And no way time went THAT quickly&quot;. Obviously one thought was put much higher than the other; I answer...</p>\n\n<p>Dad - WHAT THE HELL!? IT&#39;S ONE HOUR &#39;TILL MIDNIGHT WHERE THE HELL ARE YOU!? \nMe - Dad, my friends are dead.\nDad - WHAT!? WHAT DO YOU MEAN?\nMe - Just come pick me up and quickly\nDad - I&#39;LL TRY AND WHEN I SEE YOU YOU&#39;RE GONNA GET A REAL BAD ASS WHOOPIN&#39; \nMe - Please, just come quickly.</p>\n\n<p>When my dad came he was obviously furious but as soon as he saw the bodies he quickly became terrified. He said &quot;Son, did y-you do this&quot;? &quot;No&quot; I replied. &quot;There was a man and h-he-&quot; but before I could finish he said &quot;Get in the car&quot;. I responded by following his order; He then takes out his phone and then calls what I assumed to be the police. I pull out my phone and then Contacts, I go to Tim&#39;s contact, I stare at it, and then I cry. </p>\n\n<p>The police arrive and of course interrogate me since there was only me and the man that I had very little to no knowledge of his facial features. They ask me the usual cop questions but then...</p>\n\n<p>Cop - Have you seen the man you stated at anytime before or after?\nMe - O-One time before. \nCop - When?\nMe - Me and my friends were hanging out on a road playing with bricks and I saw him outside of the the Bonefish restaurant. \nCop - Can you try to draw his face for me?\nMe - I guess.</p>\n\n<p>I draw his face to the best of my ability. </p>\n\n<p>Cop - Thank you, now one more. You said you were hanging out with friends right? \nMe - Yeah. \nCop - How many? \nMe - Three; Tim Franco, Jim Guaj, and Kim Zimon. \nCop - Kim Zimon? He died a stillborn. </p>\n</div>\n","author":"Krassro"}