{"rank":"10","title":"Vices and Virtues volume 1: Greed and Generosity","id":"8jir0f","url":"/r/nosleep/comments/8jir0f/vices_and_virtues_volume_1_greed_and_generosity/","time":"1526357566000","body":"<div class=\"md\"><p>I made my life by climbing over the backs of others. Everything I did was a calculated move designed to bring me one step closer to the top of the mountain. That ambition was instilled in me at a young age by my father. He was a successful realtor in New York, which was not an easy task.</p>\n\n<p>So when he promoted me to VP of his company (Danner &amp; Fink Realtors), I knew what I had to do.</p>\n\n<p>I wasn&#39;t overt about my plans. I never told anyone, despite how much my brother suspected me of planning the unthinkable.</p>\n\n<p>Grant was never the same as our father and I. He gave his life to the scum who live on street corners. He volunteered at a soup kitchen five days out of the week. He was a movie critic, so he just sat around and watched shitty films, wrote about them, and got paid. Not that it mattered, because he just donated most of it to charity anyway.</p>\n\n<p>I never got along with him because of that. He didn&#39;t see the value of hard work, regardless of how hard I tried to help him, regardless of how hard our dad hit him, he just didn&#39;t care. </p>\n\n<p>I graduated valedictorian, he barely tried and averaged C&#39;s. I&#39;m VP of a real estate agency, he&#39;s a stay at home loser who helps people who don&#39;t even try to help themselves. It&#39;s disgusting.</p>\n\n<p>So I was surprised when he asked me whether or not I was going to kill dad. He&#39;s usually such a brain dead loser he doesn&#39;t notice shit. But I guess even he has some capacity for observation, surprising as that is. </p>\n\n<p>&quot;Why would you think I was going to do that?&quot;</p>\n\n<p>He looked at me from his perch on the filthy couch and laughed.</p>\n\n<p>&quot;Come on. You&#39;re an ambitious guy, and there&#39;s one spot left in the ladder to success. You&#39;re telling me you don&#39;t want it?&quot;</p>\n\n<p>I was shocked. This <em>urchin</em> had the nerve to question my ability?</p>\n\n<p>&quot;I want it, yeah. But not enough to kill somebody. Jeez. What kind of person do you take me for?&quot;</p>\n\n<p>He was more perceptive than I thought. I might need to take care of him too.</p>\n\n<p>Which is why I invited Grant and our father to my apartment for dinner. I left a message at the office to tell everyone that my father is taking ill, and might not be back for some time. Nobody would notice Grant missing anyway, so I didn&#39;t think to make a cover for him.</p>\n\n<p>I was finishing up the food when my dad arrived. 5 minutes early, as per the norm. Thankfully, I planned for that, and I had slipped the ground up Oxy into the spaghetti sauce long before his Mercedes Benz pulled into the parking garage. </p>\n\n<p>Next up, I mixed a small amount of lye into the glasses of champagne. Not enough to throw off the taste, but enough to do some damage in a few hours.</p>\n\n<p>Finally, as a bit of joke, I had baked cyanide into the pecan almond pie. The almonds would cover the smell, which means everything would go according to plan.</p>\n\n<p>I let my dad in with a hug and a smile. </p>\n\n<p>&quot;How&#39;ve you been?&quot;</p>\n\n<p>I smiled.</p>\n\n<p>&quot;Never better.&quot; And that was the truth. </p>\n\n<p>Once my father&#39;s position vacated suddenly, I&#39;d be appointed to lead the company. Then, I&#39;d have all the cash I could ever want, and I will finally have succeeded in life.</p>\n\n<p>My father sat down and I put the champagne and spaghetti in front of him. He was an old man, in his late 60&#39;s, and the Oxy was enough to knock out Dwayne Johnson, and my father was no Rock. </p>\n\n<p>My brother arrived ten minutes late, also per the norm. I don&#39;t think he was ever on time for anything in his life. So by the time he got here, the food was lukewarm and the champagne was starting to lose the fizz. Typical.</p>\n\n<p>By the time the Oxys started to kick in for them, I was just finishing my salad. My dad slumped on the table, and my brother tried to stand up, but swayed dangerously before collapsing in a heap. </p>\n\n<p>I dragged them both into the bathroom and started pouring the rest of the lye into the tub. Before I could finish, though, my brother stood up, remarkably clear eyed for the amount of drugs I have him. Without saying a word, he kicked my knee and pushed me into the tub.</p>\n\n<p>I could feel the burning of the chemicals before I even hit the surface. Some got into my eyes, and I felt the vision begin to leave me. I jumped up and saw him standing there through the gray haze that now covered my eyes. </p>\n\n<p>&quot;Damnit Grant, this was supposed to be easy for me. Now look what you did you fucking...&quot; </p>\n\n<p>He swung at me again, but he missed and fell off balance. I pushed him by the side and he fell face first into the tub. I held his head down as he thrashed, but he spent too much time helping others, and not enough helping himself. He wasn&#39;t strong enough to get away, and after a minute he stopped moving. I pulled his head up and saw the effects of the lye. He was unrecognizable. Perfect. I carefully placed his whole body into the mixture, making sure I didn&#39;t spill any. </p>\n\n<p>I went to the kitchen and got a garbage bag. My father was still asleep on the floor. I placed the bag over his head, and after a couple of minutes his heart stopped. I put his body into the tub as well, pouring another two gallons of lye into the tub for good measure.</p>\n\n<p>The next morning, I returned to the building where my father&#39;s - no, my company was housed. As soon as I entered the lobby, however, the security guard turned on his radio. </p>\n\n<p>Now, I was born at night, but it wasn&#39;t last night. I pulled a small knife from my suit jacket&#39;s inner pocket and plunged it into the guard&#39;s back. With that, I made my exit.</p>\n\n<p>Yeah, it didn&#39;t quite go according to plan after all. But for now, I&#39;m laying low in an empty house on the city limits. It&#39;s only a matter of time before I can make my move and take what&#39;s rightfully mine. And until then, I will wait, and I will get my face and eyes fixed. Then I&#39;ll be unstoppable.</p>\n</div>\n","author":"Lieutenant_Buzzkill"}