{"rank":"1","title":"Grey Cloud (Part 2)","id":"8jitl1","url":"/r/nosleep/comments/8jitl1/grey_cloud_part_2/","time":"1526358300000","body":"<div class=\"md\"><p><a href=\"https://www.reddit.com/r/nosleep/comments/8aa54h/grey_cloud/\" rel=\"nofollow\">Part 1</a></p>\n\n<p>We woke up the next day to the crashing of thunder and the sound of rain pattering against our hotel room window, the gloomy clouds casting a grey shadow over the early morning light. Even though we had been laughing about it the night before, I couldn’t stop thinking about the photo of that family, and dwelling on the words I read from that journal made me uneasy. I remained quiet and lost in thought as I finished gathering my things. Out of the corner of my eye I could see Mattie stealing glances at me. </p>\n\n<p>“Hey, you okay?” she asked. </p>\n\n<p>“I’m fine,” I said. “Why do you ask?”</p>\n\n<p>She stared at me for a second before saying, “Just asking. You ready to go?”</p>\n\n<p>“Yeah.”</p>\n\n<p>I picked up my bag and followed her out of the door.</p>\n\n<p>Besides the sound of rain hitting the windows, it was eerily quiet when we walked downstairs to the lobby, and I couldn’t help but notice how dingy and deserted the hotel looked. Aside from an employee speaking with a couple at the front desk, there was not another soul to be found.  </p>\n\n<p>Mattie set her bag down and said, “Hey, why don’t you get the car loaded while I take care of the room?”</p>\n\n<p>“Sounds good.”</p>\n\n<p>I grabbed our bags and ran to the car, quickly throwing them in the trunk and diving into the passenger seat to avoid the heavy downpour. A few minutes later, I saw the couple run to their car and drive away.   </p>\n\n<p>Almost ten minutes later, Mattie entered the car looking flummoxed.</p>\n\n<p>“That was weird,” she said.</p>\n\n<p>“What was?”</p>\n\n<p>She took a deep breath and turned to me.</p>\n\n<p>“The lady at the front desk was making small talk and asked me how long you and I had been married.”</p>\n\n<p>I chuckled. She and I had been close friends for so long, we were both used to others assuming we were together. </p>\n\n<p>“So, I told her you’re just my longtime friend and she got really nasty. She said that we shouldn’t be spending time in hotels alone together because it’s not right, that it was ‘unclean.’ I told her it wasn’t really her business to say anything, and she threw the receipt at me telling me to ‘repent if I knew what was good for me.’”</p>\n\n<p>“Seriously?” I said, astonished. “That’s not okay. Do you want me to go back and say something?”</p>\n\n<p>She started the car and buckled herself in.</p>\n\n<p>“No, it’s okay. We don’t have to see her again. Though if we do ever come back this way, we’re staying at a different hotel.”</p>\n\n<p>“Given the size of the area and its relative location to any civilization, I don’t think there are many options for us to choose from.”</p>\n\n<p>The rain showed no signs of stopping anytime soon as we pulled onto the road. </p>\n\n<p>“Maybe we should have brought umbrellas,” said Mattie, peering through the windshield at the darkened sky.</p>\n\n<p>“Yeah, but then we might not be getting the full Grey Cloud experience.”</p>\n\n<p>She gave me a sideways glance.</p>\n\n<p>“I’m not sure the name is meant to be taken literally, Sam. Besides, I don’t know about you, but I didn’t bring anything to prevent my phone from getting soaked, which means we’ll probably have to leave ours in the car. So if any animal attacks you, I won’t be able to call for help.”</p>\n\n<p>“Thanks for making me the victim in your hypothetical scenario. Besides,” I said, after checking my phone, “it wouldn’t matter anyway. I get absolutely no signal out here.”</p>\n\n<p>“Of course…”</p>\n\n<p>We drove in silence for a couple more minutes before she spoke up again, her soft voice carrying a tone of empathy.</p>\n\n<p>“That stuff we found yesterday was pretty weird, huh? Honestly, I’m a little creeped out by it. If you were feeling too spooked to go back, we could just head home.”</p>\n\n<p>Her sudden change in sentiment caught me off guard. I had never known Mattie to be too creeped out by anything to refrain from exploring.</p>\n\n<p>“We came all this way to check this place out. Why do you think I would want to go home?” I asked, more confused than offended.</p>\n\n<p>She took a deep breath as if contemplating how to best articulate her response.</p>\n\n<p>“I could tell something was on your mind this morning. I was hoping that would be what was bothering you, but now I think it’s something else. The thing we still haven’t talked about.”</p>\n\n<p>My heart sank into my stomach. I knew where she was going with this, but I decided to remain silent and let her press on.</p>\n\n<p>“It’s just...it’s been six months since your mom left,” she said, her voice faltering. “And we never talked about it. You haven’t told me how you’re dealing with it, or if you’ve had any new information on her whereabouts. I know it’s been hard, but it’s not like you to not talk through things with me, Sammy.”</p>\n\n<p>I watched rain droplets streak down the window as I thought about what to say next. I didn’t want to talk about this, not now. To be fair to her, I had never wanted to talk about it. After a couple minutes of delaying my response, I conceded.</p>\n\n<p>“I don’t mean to hide things from you. I didn’t want to think about it, and talking about it with someone means I have no choice but to dwell on it. But I promise you, Mattie, when we get home, we’ll talk about it.”</p>\n\n<p>She said nothing but reached over and gave my arm a light squeeze, staying silent as she focused on the road. As I turned to look back out of the window, I thought I saw her wipe something from her eye. </p>\n\n<p>We pulled up to the familiar entrance gate, and were surprised to see another car there, one that was driven by the couple from the hotel.</p>\n\n<p>“Looks like we might not be the only ones willing to brave this weather for a cheap thrill,” I quipped.</p>\n\n<p>After throwing our phones in the glovebox, we got out of the car and ran along the path into the cover of the thick forest, grateful for the minimal protection it offered us from the rain. That paranoid feeling from the day before had resurfaced just a little; we kept eyeing the trees, expecting someone to be watching us. </p>\n\n<p>As we broke through the treeline and came upon the lake once again, we looked towards the cabins for signs of movement, but it was hard to see through the heavy rain. </p>\n\n<p>“Maybe they’re waiting out the storm in one of the cabins,” Mattie wondered out loud. “If I’m being honest, I’d feel a little better knowing we’re not the only ones here. Let’s see if we can find them.” </p>\n\n<p>The sound of rain falling on the lake was deafening as we ran along the shore and towards the communal houses. When we came to the center, I gestured towards the fire pit.</p>\n\n<p>“At least this weather means it can’t magically start again,” I said, nearly yelling so she could hear me over the heavy downpour.</p>\n\n<p>Mattie rolled her eyes and looked around at the houses facing us, searching for any sign that the couple had entered one of them. After a few seconds of standing in the rain, I went for a more direct approach.</p>\n\n<p>“Hello?” I called out. There was no answer.</p>\n\n<p>“I’d be surprised if they could even hear me,” I said.</p>\n\n<p>“Hold on,” she said, holding her finger to her lips. “Do you hear that?”</p>\n\n<p>She cupped her hand around her ear and aimed it towards the forest.</p>\n\n<p>“I can’t hear anything,” I said.</p>\n\n<p>She motioned for me to follow her as she walked closer towards the trees. As soon as I started following her I caught the faintest sound of what she was hearing.</p>\n\n<p>It was music, coming from the depths of the forest.</p>\n\n<p>It sounded like a lullaby playing in the wrong tune, slow and flat. I was so intrigued by it that it wasn’t until Mattie started walking towards the treeline when I noticed a path leading into the forest. Without hesitation, we followed it. </p>\n\n<p>We had been walking for a few minutes when I noticed something strange. The music did not sound as if it was getting any closer. It seemed to become quieter as we walked deeper into the forest until it faded away completely and we were left once again with the sound of rain hitting the trees. I had grown so accustomed to the tune that its sudden absence made me feel exposed, as if the music had been masking the sound of our movements.</p>\n\n<p>Mattie turned and looked at me as if she hadn’t realized I was walking with her for the last several minutes. It occurred to me we hadn’t yet acknowledged what we both heard.</p>\n\n<p>“Did you hear that too?” she asked.</p>\n\n<p>“If you’re referring to the music, then yes, I did. I wonder where it was coming from…”</p>\n\n<p>As my thought trailed off, I looked past Mattie and saw the path continuing beyond a line of trees. </p>\n\n<p>“There’s something over there,” I said. </p>\n\n<p>“Do you think that’s where the music was coming from?” she asked.</p>\n\n<p>“Possibly. Let’s go find out.”</p>\n\n<p>We followed the path beyond the trees and saw that it led to a large house, with a wooden porch built around the whole property. All of the windows were open, as if the house and its many eyes were watching us as we approached. We walked up the porch steps and stopped in front of the door.</p>\n\n<p>“Should we knock?” she asked.</p>\n\n<p>“No one’s lived here for decades, right? Look,” I pushed the door gently and it opened with a loud groan. “The door hasn’t even been shut properly.”</p>\n\n<p>“Which means anyone could be in there,” she retorted. </p>\n\n<p>“Like the couple?” I reminded her.</p>\n\n<p>We tentatively stepped into the house and stood there, listening for any signs of movement. The silence assured us that we were truly alone. </p>\n\n<p>This place was well-furnished and better maintained compared to the cabin we were in yesterday. The interior felt spacious, with the living room and kitchen interconnected and an open staircase in the corner leading to a second floor  A fireplace was located in the corner of the living room, giving the vacant house a cozy atmosphere.</p>\n\n<p>There were framed pictures lining the walls above the fireplace, with the same woman featured prominently in all of them. To my surprise, there was one photo in particular with someone I recognized.</p>\n\n<p>“It’s that family,” I said, looking at the familiar faces from the photo we found the day before. The older woman had her arms around them and they were all smiling. Glancing at the other framed pictures, they all showed different families posing with the same woman.</p>\n\n<p>“Maybe she lived here,” I thought out loud. “Do you think these people used to live in the community?”</p>\n\n<p>“If they did, then that story saying they all left during the 60s is wrong. This one has the year ‘1973’ written on it,” she said, pointing to a photo with the woman looking much older, standing in front of the lake and carrying a little girl.</p>\n\n<p>My attention diverted from the photographs to the staircase.  </p>\n\n<p>“I’m going to see what’s upstairs,” I said.</p>\n\n<p>“Okay, but let’s not stay here much longer. I’ll see what I can find down here.” </p>\n\n<p>I walked up the staircase to find a loft that appeared to be used as a study. There was a desk placed by a window overlooking the surrounding forest, and near it a large bookshelf was filled with books covered by a layer of dust. In the corner was a record player with a pile of vinyls stacked next to it. </p>\n\n<p>I walked over to the desk to look at the many papers strewn across its surface. There was a large piece of paper with writing on it that caught my attention:</p>\n\n<p><em>Good news, my children. We feed it, and feed it, and still it remains hungry. We must give it more so that it can grow. Given the intended state of our Order, our stock will run out, so we must make the decision to search for more beyond our borders. If we are able to blend in, by God’s mercy, It shall be satiated.</em></p>\n\n<p>I turned the paper over to discover I was looking at the back of a geographical map of the surrounding area. Someone had drawn an arrow pointing to the lake and written, “Anomaly discovered.”</p>\n\n<p><em>Is this what she was talking about?</em> I thought. </p>\n\n<p>That paranoid feeling of being watched prickled up my neck again. I looked out of the window at when a sudden movement between the trees caught my eye. I stood there in bated silence, waiting to confirm if something was really out there or if I was just seeing things.</p>\n\n<p>Mattie’s voice rang up the staircase, making me jump on the spot.</p>\n\n<p>“Sam, you need to come down here,” she said. The tone in her voice made me feel uneasy.</p>\n\n<p>I started walking towards the stairs when something dark caught the corner of my eye. I looked out of the window once more, expecting to see nothing. The sudden appearance of a robed figure standing among the trees made my blood run cold.</p>\n\n<p>From the distance I had to strain to see it through the rain and the trees, and although a dark hood covered its head, I recognized the face of the woman working at the hotel desk. </p>\n\n<p>I didn’t know what she was doing there staring up at the house in the middle of pouring rain, or if she knew we were there, but instinctively I knew we shouldn’t stay there any longer. </p>\n\n<p>I ran down the stairs to the first floor to find Mattie standing there with a framed photograph in her hands. </p>\n\n<p>“We should leave now,” I said, hoping she would notice the urgency in my voice.</p>\n\n<p>“What’s going on?” She asked.</p>\n\n<p>“I’ll explain once we’re in the car,” I said, walking briskly towards the door, “but right now we need to go.”</p>\n\n<p>She made no motion to follow me.</p>\n\n<p>“Sam, look at this…” she said, holding the photograph towards me.</p>\n\n<p>“Mads,” I said, trying to keep the impatience out of my voice, “you can show me later, I don’t care to see any more photographs right now.”</p>\n\n<p>“Just look!” she cried, thrusting the photo into my hands.</p>\n\n<p>I looked down at the dusty frame and saw a photo of a small boy being held by a woman. They were both looking down at the camera, the woman smiling, the boy staring curiously at the lens. The sky above them was clear and blue. </p>\n\n<p>Though she looked much younger and had no stress lines, the woman was definitely my mom. She had the same almond-shaped brown eyes and identical warm smile.</p>\n\n<p>Distracted from my prior urgency to leave, my head started swimming, with so many unanswered questions being brought to the forefront of my mind.</p>\n\n<p>Mattie was wondering the same thing as I was.</p>\n\n<p>“Why would there be a picture of you and your mom out here?” she asked. </p>\n\n<p>“I don’t know…” I lied. Now was not the time to tell her about the suspicions confirmed by the photograph. I could tell her when we were safely in the car.</p>\n\n<p>She stared at me for a moment before taking the photograph back and saying, “Alright, let’s go.”</p>\n\n<p>As I turned to leave, the sound of footsteps emerged from the other side of the door, making the old wooden porch creak.</p>\n\n<p>I backed away and looked around the house, trying to find another exit. There was another door through the kitchen, but as soon as we started making our way towards it, the front door opened. The woman featured in all of the photographs was standing in the doorway, looking much older. Her hair was white and thinning, and her face bore an expression of contempt.  </p>\n\n<p>She walked slowly into the house with her hands behind her back, never taking her narrowed eyes off of us.</p>\n\n<p>Mattie was the first to speak up.</p>\n\n<p>“We’re so sorry,” she said, holding her hands up as if to show we meant no harm. “We didn’t mean to intrude. The door was unlocked, we didn’t know anyone lived here.”</p>\n\n<p>The woman said nothing but merely stood there as if waiting for something. </p>\n\n<p>Before I could say anything, the couple from the hotel were brought into the house, followed by a man also wearing dark robes. He was holding both of them tightly by their arms, their hands tied up and their mouths gagged.</p>\n\n<p>“Mother, here are your pawns,” he said, taking the gags out of their mouths.</p>\n\n<p>“Please!” the man cried out, “Let us go. Where’s our son?”</p>\n\n<p>The woman referred to as “Mother” finally spoke, her voice deep and hoarse.</p>\n\n<p>“Your works here are appreciated. Do not weep, for you and your son will be united for one final task. The most essential one.”</p>\n\n<p>The woman started crying as the man struggled against his bonds. </p>\n\n<p>“No! We did what you asked! They’re here, aren’t they? You promised us we would be set free!”</p>\n\n<p>She walked up to the man and stroked his cheek.</p>\n\n<p>“And so you will be, my child. You and your son will be welcomed by God, your souls stripped from their cages of flesh and carried on high to His almighty Glory. You will pass from this life knowing the world is ever closer to its purification because of your sacrifices. There can be no greater joy.”</p>\n\n<p>She turned to the hooded man and said, “Bring them to the lake.”</p>\n\n<p>The couple started struggling as the hooded man gagged them once again and pulled them out of the house and into the forest. As the woman walked to the doorway to watch them, their muffled screams could be heard echoing distantly across the trees.</p>\n\n<p>Keeping my eye on the woman’s back, I started walking backwards slowly towards the kitchen door. I met Mattie’s gaze and could tell by her face that she was terrified. I nodded towards the door and she started moving.</p>\n\n<p>Then the woman turned around and spoke directly to me.</p>\n\n<p>“You must be Sam. I hoped I would see you someday. it’s so good to finally meet you. I wish we could talk more, but I’m afraid I have things to do, and you and your friend will need to be kept for preservation.” </p>\n\n<p>I heard the door behind us open. </p>\n\n<p>“Don’t you worry,” she said, “I’ll see you again soon.”</p>\n\n<p>From behind, a cloth was pressed to my nose and the last thing I heard were Mattie’s cries of protest before my vision went dark.</p>\n</div>\n","author":"SomaSimon"}