{"rank":"9","title":"The Figure...SFW","id":"8jivjm","url":"/r/nosleep/comments/8jivjm/the_figuresfw/","time":"1526358856000","body":"<div class=\"md\"><p>I wake up to sudden inexplicable cold sweats dripping down my face. I grip my blanket and cover my face to my nose; stunned by my fear. I think to myself to not have this happen tonight. I glance over to my alarm clock but my eyes are still groggy from my sleep. I’m paralyzed at the thought that someone is watching my every breath. Mustering all the strength I have in my current paralyzed state I manage to clear my eyes out and look at the clock. It read 3:12. I slump my body into my bed wishing for this feeling to subside, but the longer I lay down the worse it becomes. I know what I have to do: I have to go to the window. </p>\n\n<p>I’m shaking; the draft sneaking under my door makes it feel like someone is breathing down my neck. I’m starting to feel like I can’t take it anymore. Taking one more deep breath to somehow gather my senses, I finally sit up and start to slowly slide my blanket off of me as quiet as can be. My feet touch the hardwood floor and it burns; not like a hot sensation but a temperature so cold it burns. Wincing through every step I manage to get within five feet of the window. The closer I get the harder each step is. My legs start to go weak and the ground feels like it is sinking me in with every step. I start to close my eyes hoping what has been haunting me for the past five days isn’t there. </p>\n\n<p>I feel the window press against my hands. Opening my eyes I have a sudden sense of relief. Nothing was outside my house. The relief only lasted for a brief second; I finally noticed how eerie the night was. There was no breeze, no cars, no rustling in the leaves, not a single soul in sight. The anxiety kicks in once more and I start to peer around the corner of my block but the tree is blocking my view. I start to hear footsteps but they’re walking too slowly to be normal. The door behind me started to creak open but there was no one there. I took my eyes off the window and went to close my door. As I grab the handle my body goes stiff and I struggle to move. I have to get back to the window.</p>\n\n<p>I try to fight this relentless resistance but the more I fight it the weaker I get. I’m starting to think about giving up and just let everything take its course. I tell myself that I have to at least give it one more try. I can’t just let this thing get to me. I finally get to the window and I see it again. It was a tall black silhouette just standing at the corner staring at me. I am in utter shock of what I am seeing. The shape was of a man but so dark you could not see the features of its face. I cannot leave this window. My heart is racing and the cold sweat is getting worse. I’m completely drenched in sweat and completely shaking. I start to think this is the end and that this thing will not leave me alone. </p>\n\n<p>I notice that the man has not gotten any closer since I first saw him and it feels like it has been ages since this all began. I try and look at my alarm clock without taking my eyes off the figure but I couldn’t. I looked at the clock and it said 3:30. It has only been 22 minutes. I immediately jerk my head to look outside and the worst thing that could have happened, happened. I lost sight of the figure and I know now that it is coming for me. I run to my door and sit in front of the door bringing my knees to my chest. Everything goes silent.</p>\n\n<p>I’m shaking, sweating; I even start to cry while the inevitable is bound to happen to me. My room suddenly starts to rumble and a sound that seems like it came from the deepest pit of hell deafened my room. I cover my ears to try and reduce the noise but nothing seems to be working. All my objects start to fall off my walls as the shaking gets worse. Long black arms that are darker than shadows start to reach through my window. The arms were stretching towards me cornering me into my wall. The figure now had long nails that were scratching at my floor to try and get to me. I try to kick it away but nothing will stop this demon. Then I finally see it. </p>\n\n<p>The figure peaks its head over the window, but know it wasn’t just a dark face. It eyes and mouth were illuminated with a bright red color and glowing somewhat like a Jack o’ Lantern. It now had sharp teeth but not just one set of rows it looked like it had about five. It stopped and stared at me for a second but then it leaped towards at me. </p>\n</div>\n","author":"joegordon323"}