{"rank":"24","title":"Strange Subtle Occurrences Keep Happening, And I'm Losing My Sanity","id":"8jjcc2","url":"/r/nosleep/comments/8jjcc2/strange_subtle_occurrences_keep_happening_and_im/","time":"1526364250000","body":"<div class=\"md\"><p>Hi. To start this off I really don&#39;t know what I&#39;m doing. I don&#39;t use Reddit, as my older brother simply lent me an old account of his to allow me to write this. I have heard of this forum before through the internet grape-vine, but never actually read any of it&#39;s content, but I am aware of the authenticity of some of it&#39;s stories..being fake; or so I&#39;ve heard. </p>\n\n<p><em>However I can assure you this ongoing saga of my life is real. And I need advice and guidance.</em> </p>\n\n<p>As the title suggests, I truly believe I am being stalked/followed by somebody, or I&#39;m suffering from some utterly baffling case of memory loss where I&#39;ll commit one of the strange occurrences and then forget it. Like I said I&#39;m so fucking confused and scared of what could very well be myself. </p>\n\n<p>Let me start with the notes. </p>\n\n<p>It&#39;s like some fucked up case of on the time clockwork. For three straight Friday&#39;s, between when I would wake up and before I went to work at my retail job in my city, I&#39;d find a short, single sentence note either hanging by a magnet on the fridge, or simply strewn onto the table. </p>\n\n<p>Said notes are, as previously stated, a single sentence, if that. </p>\n\n<p>The first few weeks of the notes appearing, I shrugged it off as a friend messing with me, as I often have friends over on the weekends, or simply something I was doing in a sleepy state at night. </p>\n\n<p>However as three weeks of me discovering these notes passed, on maybe the fourth morning after they must have been written, a night in which I had come home <em>alone</em>, nobody else at my residence, I still found a note. </p>\n\n<p>I was now thoroughly creeped out and disturbed. I had forgotten what the first three notes said, simply short phrases, however this one I snapped a photo of, which I&#39;ll show here now:</p>\n\n<p><a href=\"https://imgur.com/a/u8m4DbA\">https://imgur.com/a/u8m4DbA</a></p>\n\n<p>I don&#39;t have children, and I live alone. I&#39;m a 19 year old girl and am single, and have no enemies that I&#39;m aware of. Something like this scares me and is giving me the chills again just thinking about it. At first I thought logically, wondering if one of my friends had left it over. </p>\n\n<p><em>But like I said, it was just me that night, unlike the previous three notes I mentioned.</em>  </p>\n\n<p>Strangely enough, the notes stopped for a two weeks period after finally snapping a photo of one of them rather then passing it off as a joke. </p>\n\n<p>I was a bit on edge for those two weeks, and was constantly looking over my shoulder, and even a couple times asked my friends if I had a secret admirer or something, still attempting to make sense of it. </p>\n\n<p>That brings me to the next event, and the one that has me questioning my sanity. </p>\n\n<p>When I woke up a few days prior to writing this, Thursday morning of last week, I discovered my kitchen/dining room table had been set for what appeared to be a meal for two. Plates, knives, forks, and glasses; all empty, but set nice and straight as if I was expecting company. </p>\n\n<p>I wasn&#39;t. And once again it had been just me at my house the night before I discovered this. I couldn&#39;t put logic into this one whatsoever.</p>\n\n<p><em>I didn&#39;t do this.</em> </p>\n\n<p>As much as the picture fucks with my head, I did snap one of the meal setting as well:</p>\n\n<p><a href=\"https://imgur.com/a/crASpsg\">https://imgur.com/a/crASpsg</a></p>\n\n<p>Once again, I live completely alone. And if it matters, I am totally healthy physically and mentally, and I have no mental disorders. </p>\n\n<p><em>I just don&#39;t understand this. It makes no sense to me.</em> </p>\n\n<p>After the dinner plate incident, I began to notice small inconsistencies in my apartment. </p>\n\n<p>Doors being open after I swore I had shut them. Food that I&#39;m confident I hadn&#39;t eaten, suddenly being gone.</p>\n\n<p>A thought I had yesterday was that possibly a squatter was residing in my apartment.</p>\n\n<p>I checked each room, each nook and cranny, and came up empty handed. I even had the assistance of my best friend, who I simply lied to and said I was searching for a phone charger. </p>\n\n<p>The thing that has been bothering me today is the doors. </p>\n\n<p><em>I ALWAYS</em> shut my doors. I have just four of them in a short hallway inside my apartment, and despite constant attempts to close them and even double check before I leave the house or anything, I always find them open, even if I turn my back for mere seconds. Here&#39;s a picture of the four doors I&#39;m talking about: </p>\n\n<p><a href=\"https://imgur.com/a/oG7B8wL\">https://imgur.com/a/oG7B8wL</a></p>\n\n<p>Today however, is what has pushed me over the edge. I left my apartment for an hour or two to go to coffee with my best friend, and when I returned home, I found a variety of things. </p>\n\n<p>My TV was totally messed up and glitching as if it had been punched or something, two of the hallway doors were open, the kitchen cabinet was open about halfway; and the icing on the cake, my bed covers were undone. </p>\n\n<p>You probably think I&#39;m fucking insane. I wasn&#39;t, but I&#39;m starting to feel that way. Nothing from my apartment was stolen, nothing was severely out of place. </p>\n\n<p><em>Just subtle inconsistencies. Every wanning fucking minute of every day and it&#39;s driving me fucking insane.</em> </p>\n\n<p>This may have gotten off topic. I don&#39;t know. Here&#39;s a picture of my TV with the static, as well as my undone bed: </p>\n\n<p><a href=\"https://imgur.com/a/gVKAwEE\">https://imgur.com/a/gVKAwEE</a></p>\n\n<p>I always make my bed, and this is really getting to me. The opposites of my normal routines keep happening. I don&#39;t get it. I really need answers. What should I do? </p>\n\n<p>This isn&#39;t a normal post from what I&#39;m sure you&#39;re used to, but it&#39;s what&#39;s happening. I ask for some advice. </p>\n\n<p>I think I really need it. </p>\n</div>\n","author":"xxMayim_Bialikxx"}