{"rank":"25","title":"No Service","id":"8jjmmp","url":"/r/nosleep/comments/8jjmmp/no_service/","time":"1526367894000","body":"<div class=\"md\"><p>In light of recent events I felt it paramount to share the details of my past few days. I never really do postings like this, given that I&#39;ve never experienced anything genuinely haunting or paranormal in my 19 years of life. I&#39;m just a typical sophomore attending a California State University. I spend my days with my girlfriend and studying, and during downtime I like to nerd out and play video games on my PC and browse subreddits that relate to gaming and tech. Thus, I see reddit as a prime outlet to spread details on what&#39;s been going on in my life (for those interested).</p>\n\n<p>Two days ago I sat around my desk pandering on some field studies I needed to complete for my Earth Science course (I&#39;m a Biology major). The scope of this specific assignment required that I venture into a remote (or semi-remote, given the dense populations around where I live) environment. I decided to take my research to a nearby hiking trail where many students have been before (so I&#39;ve been told).</p>\n\n<p>I gathered my notebook and compass, as well as a flask for water and a few snacks. It took me only around 20 minutes to drive to the spot where the trail begins.</p>\n\n<p>After walking for about an hour and collecting samples for my lab I felt I needed a break. I ripped open my Clif bar wrapper and delved into the chewy energy bar. Whilst enjoying my snack I heard my phone begin to ring. This was odd as I had noticed I lost service only 10 minutes into my hike. I looked at my screen and I had been correct - no service was being picked up from my device yet I was receiving a call from an unknown number. I decided to ignore it as it was a blocked number and I needed to focus on my assignment.</p>\n\n<p>Another half hour had passed and I had lurked far from the main trail. I have a keen sense of direction so I wasn&#39;t worried in the slightest. I stumbled upon an empty shed and the wooden door had been crept open about halfway. My curiosity led me to enter the shed and scope out the inside to see if anything useful for my research would rest inside. </p>\n\n<p>Once I opened the wooden door I was surprised to see what was inside. Moss had collected along most of the walls inside and the only thing lying upon the floor was a large box that had a broken and rusty lock over the front clutch. I nudged the lock off with my foot and without hesitation I peered inside.</p>\n\n<p>On the base of the box was a small note. I read:</p>\n\n<p>&quot;To my beloved Lance, </p>\n\n<p>I have been waiting for you for five days now and have seen no signs of your presence. I checked every tree in a 10 mile radius over the course of my arrival here and no markings show that you have taken interest in my request. So, I feel it necessary to adhere to your previous demand. I managed to find the rope under the brush as you promised. I still find it strange that you refuse to stick to your original plan on meeting me here but I&#39;ve held out for much too long. I suppose this is goodbye.</p>\n\n<p>-Judith&quot;</p>\n\n<p>I really didn&#39;t know what to make of the note. It had tattered edges and dirt covered both sides of the page. I left the note in the box not knowing what else to do with it. At this point I was only confused, and felt I should head back the way I came.</p>\n\n<p>My phone begun to ring again. The caller ID had shown as unknown once more. This time I answered... For the first ten seconds or so I could only hear a low tone which grew increasingly louder and sharp. Then I begun to make out some muttering over the line as the tone halted.</p>\n\n<p>&quot;Sink. The trees. Judith.... I&#39;m so sorry. Wait my Judith. Please wait.... I&#39;m coming for -&quot;</p>\n\n<p>I was terrified and vexed. I continued hastily back the way I came. Upon nearing the original walking trail I noticed a large area where leaves had been spread far and few inbetween at the base of a large oak. I strutted over and saw the end of a rope sticking vertically out of the ground. Curious, I grabbed the edge of the rope and pulled as hard as I could until it broke out of the tough and firm dirt. The rope was frayed on the end and worked itself down into the shape of a noose. </p>\n\n<p>I had realized what it was that I grabbed and frantically turned and hustled in the other direction. Thanking God I was fast, I found myself treading back down my original pathway.</p>\n\n<p>Once I made it all the way home I felt exhausted and wanted to shower and get into bed. The warm shower felt uncomfortable on my eczema covered skin - a condition that has worsened with the stress of attending college. After a brief shower I stepped onto the bathmat and glanced at the mirror - this is where things quickly went south and i begun to panic.</p>\n\n<p>The mirror was foggy as usual and drips of water revealed slightly clear images in the mirror through the mistiness. There I saw behind the edge of the curtain a drape of long black hair. I quickly turned and had seen nothing was actually there and that my mind must have been playing tricks on me.</p>\n\n<p>Now frightened and confused I got in bed and instantly put my head down. I woke up the next morning and noticed - though occurring quite frequently recently with my eczema and nighttime itching - my back was covered in deep red scratches. This hadn&#39;t alarmed me before given my skin condition. Now, with deep sore marks and spotting blood on my sheets, I started to worry. </p>\n\n<p>My phone rang again from an unknown caller and this time I quickly answered, curious to see what would happen. A distorted voice begun to speak slowly yet firmly.</p>\n\n<p>&quot;Don&#39;t fuss about the young lad... Wait. Wait. Wait until he&#39;s asleep... Creep and cower but don&#39;t awaken the fellow. Slowly mark and we shall take care of the rest. The trees, don&#39;t forget about the trees. Do this for us Judith&quot;</p>\n\n<p>Then the call abruptly came to an end. I found all of this overwhelmingly frightening and have only told my girlfriend about the details - nothing has happened since these incidents two days ago. In the past my friends have pulled pranks on me as they know I scare easily (like moving me out of my bed at night and putting me in my kitchen to wake up to a doll laying next to me). Yet, a prank from my friends WOULDN&#39;T explain the note I found and being able to receive a call without service. Not only is it impossible but also far too unlikely that they could plant a fake note in a random location (despite them knowing I was doing a field study that day and my intention on going to this general location).</p>\n\n<p>I will keep this subreddit updated if anything continues. I&#39;m glad nothing happened yesterday or today as it would make me really frantic and distressed given the approach of finals, etc. </p>\n\n<p>Bye for now <a href=\"/r/nosleep\">r/nosleep</a> </p>\n</div>\n","author":"luckilemon98"}