{"rank":"16","title":"The Last Few Haunting Years","id":"8jk5vr","url":"/r/nosleep/comments/8jk5vr/the_last_few_haunting_years/","time":"1526375447000","body":"<div class=\"md\"><p>This is my first ever post on this site, so bear (is that even how you spell it?) with me. I&#39;m in my first year in highschool, and I&#39;m home schooled. I&#39;ve been living at this house for at least four and a half years with my parents and sister. We live in a small community, a few miles from town. We&#39;ve always lived in the same county. I was excited to finally get out of our old house and move here. Our last was old and falling apart, and I swear it was haunted. Some creepy stuff happened in that house- but that&#39;s a story for another day. </p>\n\n<p>Anyway, my parents rented this new place. It was comfortable and clean, unlike the last house. Our landlord told us that other people had lived in it before, but he never said who. Our neighbor said that the last family was nice, but their kid was &quot;weird&quot;. We never thought much about it, though. I liked the house, and my bedroom. My sister took the big bedroom (typical big sister move) so I had the small room. Although, granted, it was bigger than my last bedroom. I didn&#39;t get any bad vibes from this place, at least not for awhile.</p>\n\n<p>I started seeing things, in my room especially. Things I saw out of the corner of my eyes. Shadows, sometimes. Other times bright lights. At first, I thought that my eyes were playing tricks on me. Then it started to get worse. The feeling of someone watching me. Leaning over me while I was in bed. Faces hovering above me at night. Things crouching on my nightstand and breathing down my neck. I&#39;ve even named a few of them. Skrunch, for the one that was on my nightstand. He was like and old and wrinkly hairless man that always had the same agonizing look on his face.</p>\n\n<p>It didn&#39;t take long for me to start hating my bedroom. I had already hated the county that we lived in, but this just made it worse. A lot of bad things started to happen when we moved there. Multiple fires, one even burning down the barn my mom and sister were keeping their horses at. It not only leveled the place, but it killed a couple of kittens and burnt their mom up so badly that she could hardly walk anymore. It almost killed my dad, too, when he collapsed because he inhaled to much smoke. There was more, but back to the story.</p>\n\n<p>Then I found writing on the walls in my closet. Well, my sister found it to be honest. We found it on Halloween, to make things even more creepy. It was written in some glow in the dark paint, or something like that. It said:</p>\n\n<p>&#39;The Dreams\nI Dream\nAre Always\nBlack There\nIs No Up\nThere Is\nNo Down\nThere Is\nNo Right\nThere is\nNo Left\nI Feel Like\nI Susp&#39;</p>\n\n<p>It just ended in &#39;Susp&#39;. Maybe he was trying to write suspend but ran out of room? Anyway, I was a little more than creeped out when we found that. I didn&#39;t even want to go back in my room after I found that. But as night came around and sleepiness overcame me, I went to bed, evil writing on the the wall or not.</p>\n\n<p>But wait, there&#39;s more. Before finding the writing, I had always kept my closet door open when I went to bed. Just to lazy to shut it, you know. Then I started seeing things in there, out of the corner of my eye. Feeling things watching me from in there. Now, I haven&#39;t been afraid of monsters in my closet since I was a kid, but now all those fears were slowly coming back. I thought that if I closed it, I would be declared a wuss. I thought that if I faced whatever was in there, they wouldn&#39;t bother me anymore. I was wrong.</p>\n\n<p>Then the dreams came. I&#39;ve never been much of a dreamer, so this was somewhat strange to me. Most of them were just weird, like me just sitting up in my bed staring at the wall in front on me, unable to move. And out of the corner of my eye, all I see is the eternal darkness of my closet. Or voices calling out to me in there, or laughing. Most of those dreams were fairly uneventful, besides one. It still haunts me to this day.</p>\n\n<p>It was the scariest and most realistic dream I&#39;ve ever had. To turn a long story into a short one, I was sitting up by the foot of my bed like usual with my feet on the ground. My door was slightly ajar, and a dark, almost burnt human looking thing with only a smile on his face popped his disgusting head over and started talking to me and giggling. Anyway, he started scuttling toward me, I hit him and chased him out, then he chased me, then end of dream. Another story for another day.</p>\n\n<p>I nicknamed him Smiles. Why did I fell sad for hurting him? Why did I feel bad for him? I felt like I was going insane. For a long time I felt that way. Sadness, constantly. Like my head could explode at any moment. Insanity. That wasn&#39;t the end of my misfortunes, though.</p>\n\n<p>A few months after the dream, our landlord (I&#39;ll call him Bill) shot and killed his wife (I&#39;ll call her Susan). It was all a freak accident. Too much alcohol, too many guns, an argument. Bill went to prison after he pleaded guilty. I loved Susan. She was one of my only friends. We would talk about books, and she would tell me story&#39;s about her life when she was growing up. She was like the grandmother I had always wanted.</p>\n\n<p>That was a wound that I could never quite heal. I hated this place so much. To many bad things had happened. To many dreams. To many things in the corner of my eye. To many things in my head. I became introverted, not liking to talk to anyone other than my immediate family. I drowned my sorrows in music and video games and books. The dreams eventually stopped, but I still saw things. I even saw one straight one.</p>\n\n<p>As I mentioned before, my mom and sister kept their horses at an old barn not to far from were we lived. I would go with them to it once in a while to skip rocks in the lake and go explore. I didn&#39;t have a thing for horses, so I never rode them or anything like that. One day when we were driving down an old road that led into town from the barn. The road was bumpy, and there were weeds and bushes all around us. It was a cool and breezy that. The sun had just gone down, so it was still relatively bright out. My window was down and I had my arm sticking out of it. I was lost in thought, as I usually am. But then I saw it.</p>\n\n<p>Eyes. Big eyes. Belonging to a shadow way off in the distance. It was staring at me, and I was staring back. It&#39;s eyes were bright white, sticking out from it&#39;s surroundings. I was fixated on it, wondering what the hell I had just scene. Could it have been an animal&#39;s eyes I was seeing? No, it&#39;s eyes weren&#39;t florescent, and it looked human. Random people with flashlights? No, it&#39;s private property, and why would anyone be out here this late? It still bothers me. Nobody else saw it, and I never told anyone about it. The thing looked almost identical to the things I saw in my bedroom at night. I never forgot about those eyes. I later looked up &#39;shadow with eyes&#39; on the internet and learned that other people saw them too. I think they&#39;re just called shadow people.</p>\n\n<p>Well, all this was in the last few years of me living here. I still live here, still have the same room, and still see things. They have somewhat faded in the last few years, but they&#39;re still there. But something is bothering me. It made me write this. We found more writing. Underneath the kitchen counter. All it said was &#39;SAVE ME&#39;. I&#39;m scarred. Not again. I have a feeling that that &#39;weird&#39; kid that lived here before wasn&#39;t that weird after all. Maybe he sees things like I do.</p>\n\n<p>And that&#39;s it. Hope you liked reading about the last couple of years of my life, even though I hated it. I&#39;m sure more will happen in the future, but right now it&#39;s all mostly quiet. I hope it stays that way.</p>\n</div>\n","author":"BlankFace_0"}