{"rank":"2870","title":"I Was Fucking Fat - Part 2","id":"8jku53","url":"/r/nosleep/comments/8jku53/i_was_fucking_fat_part_2/","time":"1526383917000","body":"<div class=\"md\"><p><a href=\"https://www.reddit.com/r/nosleep/comments/8jbgth/i_was_fucking_fat/\">Part 1</a></p>\n\n<p>It’s amazing what our minds will do when faced with the unlikely. </p>\n\n<p>“Impossible” is a false concept, nothing more than a coping mechanism designed to give us comfort from boundaries that don’t exist. </p>\n\n<p>I sat, naked and chilly, chained to a wall, and waited for someone to explain everything.</p>\n\n<p>Nothing happened. </p>\n\n<p>I lay down.</p>\n\n<p>It became hard to tell the difference between sleeping and waking. I jerked into a sitting position at one point, unsure of what had just happened, filled with panic. The room was still dark, save for the solitary sliver of light. The chain was still constricting and painful. I panicked. Standing, I pulled against the chain in hopes of loosening its anchor to the wall. I yanked. I tugged, shook, and rattled it violently. I screamed, begged, and sobbed. “This is too far!” I screamed into the nothing. “Too. Fucking. FAR!” I pulled against the chain until I could feel rivulets of blood licking my pudgy sausage fingers, causing my hold on the chain to slip. </p>\n\n<p>I let it go.</p>\n\n<p>And sat.</p>\n\n<p>And waited.</p>\n\n<p>Sleep blended with waking. New bottles of water appeared. They might have been drugged, so I didn’t drink them at first, because that would have been too much. I got thirsty. Eventually, I realized that it wasn’t too much. I drank, and then I drank more. What had seemed impossible became possible, and I stopped fearing the water. </p>\n\n<p>I needed a toilet. It would be impossible to endure without one. So I screamed until I was hoarse, but somehow none came.</p>\n\n<p>I pissed on the floor. It was easier the fifth time. I made sure to go in the farthest corner that my chain would allow, because wallowing in my own urine was out of the question. </p>\n\n<p>Until I woke up in my own piss. To my shock, it <em>was</em> possible. </p>\n\n<p>And after that, it became possible to sit my own piss without any qualms. All of the internal alarms that had screamed <em>this cannot happen</em> were silenced. </p>\n\n<p>It turns out that the fear of sitting in piss only exists in your own mind. </p>\n\n<p>Then I had to shit.</p>\n\n<p>In anger, I flung the first piece of scat at the crack in the door, convinced it would deliver a message. I laughed at my victory.</p>\n\n<p>Nothing happened.</p>\n\n<p>Imagine my surprise when I eventually <em>accepted</em> the fact that I could shit in the corner and mentally deal with it. I had just assumed that it was beyond any physical possibility to handle it. But I sat, and shat, and moved on. </p>\n\n<p>In time, my torso felt like it began to shrink. The ring started to loosen. A little. </p>\n\n<p>I battled the <em>thought</em> for a long time. It was impossible to say just <em>how</em> long, because I had no ‘day’ and ‘night.’ I had given up on crying when I realized that there was no point, because no one was listening – so even tears could not be used to mark the calendar. </p>\n\n<p>But part of me believed that I had to battle the <em>thought.</em></p>\n\n<p>Another part asked <em>why</em> I couldn’t accept the idea. “Because,” a voice inside said. “Because.” “I will wait,” said the opposition. “You’ll never wait long enough,” the voice said back. The opposition spoke in silence. And after some time, when it asked “why?”, there was no response. And I had no qualms when I did it, because the voice that had declared my actions impossible was silent. </p>\n\n<p>So I picked up the freshest shit, and I spread it like butter around the ring. Thick clumps of it fell to the floor, but I found them with my toes and picked them up again. The shit squished between my fingers as I kneaded it into my fat folds beneath the metal ring. It was oily and wet, and I made sure to spread a healthy coating of shit all around the ring, slathering and wiping it over my skin. It smelled, but I simply accepted the smell as I rubbed shit all around like lotion, spreading it, coating it, caking it across my skin. Once I had accepted that it <em>wasn’t</em> impossible to use a turd as lubricant, all of my inhibition just dissolved like the shit that I was massaging beneath the ring.</p>\n\n<p>I twisted the metal like it was a tiny hula hoop. And it slid around my body.</p>\n\n<p>A little.</p>\n\n<p>It had been impossible to budge the ring when I first arrived. </p>\n\n<p>Hope flared in my chest, and my heart fluttered. It hurt, but the pain was a distant sort of fact that I accepted without truly feeling. I allowed myself to imagine crawling through this river of shit and coming out clean on the other side. </p>\n\n<p>I smiled as I went to sleep, but the line between sleeping and waking was blurred. I knew that it was dark, but it was hard to find my way in the dark so I reached out my hand. I was trying to find my mom, because I knew that she loved me and couldn’t find me. But why was it so hard to find <em>her?</em> I kept reaching out, but her hand was just out of reach. I wanted to grab it, but I knew I had to pull it all away. So I peeled off my jacket, but it wasn’t enough. I ripped off my shirt and pants, but she needed more. I was embarrassed, but I undid my bra and dropped my panties and stood in front of her naked. I felt ugly because I was naked. My body had so many lumps that my belly hung down and covered my crotch. No one could even see my pussy but I was still so humiliated because it was ugly outside and ugly inside. I cried and asked for her to hug me, but she said I needed more. I told her that there wasn’t any more for me to give, but she said that there was a lot more. So I said okay, and I ripped open my torso and peeled off my skin like a jumpsuit. It felt good to slide it off my shoulders, because it was <em>Janelle,</em> it was me, and ugly was <em>part of me,</em> I knew it. </p>\n\n<p>I saw my skin lying on the ground, and I could tell that it was me, and I cried because it was dead. Then I asked Mom if enough of me was dead for her to hug me, and she said no, I needed more. I cried harder because there was nothing left, but she said I needed to shed more of myself. I pulled my eyes out so that she wouldn’t have to see me cry. Then I pulled another layer of <em>Janelle</em> off and threw it onto the floor because it was <em>me</em> and that was ugly. I cried because I could see my face on the ground and I knew that it was going in the trash and that no one would miss it. I asked my mom to hug me one more time and she said just one more. I knew that it was too much, but she said it wasn’t too much. I was completely sure that it would be impossible, and that I had lost. Then I saw my hand reaching into my torso and beginning to peel. I said wait, and that it couldn’t be done, but my hand didn’t care. It tore almost all of me away this time, until there was nothing left but a pile of guts and a beating heart, but the heart just wouldn’t stop beating, even when I told it that it was okay, there was nothing of me left, but it kept right on going like it didn’t care what the world thought, and I said why, why, why, but it just said thump, thump, thump.</p>\n\n<p>I woke up in a pool of my own piss, wriggled the shit-chain just a <em>little</em> more than it had moved before, and smiled in <a href=\"https://www.reddit.com/r/NoSleepInterviews/comments/8jc677/may_14th_2018_byfelsdisciple_interview_part_2_of_2/\">the dark</a>.</p>\n\n<p><a href=\"https://www.facebook.com/P-F-McGrail-181784199029462/\">FB</a></p>\n\n<p><a href=\"https://www.reddit.com/r/ByfelsDisciple/\">BD</a></p>\n\n<p><a href=\"https://www.reddit.com/r/nosleep/comments/8k3jty/i_was_fucking_fat_part_3/\">Part 3</a></p>\n\n<p><a href=\"https://www.reddit.com/r/nosleep/comments/8kcxjv/i_was_fucking_fat_part_4_final/\">Part 4</a></p>\n</div>\n","author":"ByfelsDisciple"}