{"rank":"70","title":"It came during a snowstorm.","id":"8jkwq7","url":"/r/nosleep/comments/8jkwq7/it_came_during_a_snowstorm/","time":"1526384709000","body":"<div class=\"md\"><p>I lived in a house in the suburbs of St. Albans when I was 9 years old with my family.</p>\n\n<p>My grandfather passed this old four square house down to my father and one day it would’ve been mine. We were an ordinary middle class family, two older sisters and a younger brother, with food on the table and a shared computer.</p>\n\n<p>It was December 23rd, 1992. Bleak and chilly was the outside and the slow but relentless fall of snow steadily covered the roads outside on that faithful day.</p>\n\n<p>The day before was a lively one, bustling with commotion as my parents put up the decoration, making our dull house seemingly cheerful and welcoming. Both of my sisters took countless pictures of it as they usually tend to do for teenager purposes while my baby brother, little Tom, laughed gleefully and clapped his soft, plump hands together. We all fell asleep just like any other day. That night I had a dream about blue clouds hanging over the city as cars flew above it.</p>\n\n<p>Breezy, cold winter morning.</p>\n\n<p><strong>11:00 AM</strong></p>\n\n<p>Morning came and with just a pair of days left until the big occasion, my parents were busy shopping for presents and ingredients for the Christmas dinner. That day, I woke up to an unusually quiet house. Our residence had always been filled with chit-chats from my sisters’ room and the soothing humming of my mom as she did housework. Now it was suddenly so hollow and quiet.Thinking that my parents were out shopping whilst my siblings presumably went over to their friends’ houses, I clothed my self, poured a bowl of cereal, adding a chocolate chip cookie that I hid behind a white cup the day before. I was a fearful child ever since I was a toddler so I made sure that there was no one in the house by checking each of the rooms. They were all empty and when I yelled loudly “Anyone here?”, no one but the looming silence answered.</p>\n\n<p>After that, I locked the front door and sat down in front of the TV while having my breakfast. In our household, kids weren’t allowed to do that because we had to sit down at the table while chatting among ourselves, to “Liven up”. What my parents failed to see in that rule was that at 8:00 A.M, nobody wanted to speak a single world out of tiredness and morning grumpiness except them. So eating cereal and also a cookie, which is a rare treat in our house, while also watching the television, was a special occasion.</p>\n\n<p>The show that I watched intently was Dexter’s laboratory. I sat there for about an hour after finishing my breakfast and then finally stood up, deciding to clean the dishes. Walking past my bedroom I shot a glance out of the window to see snowflakes slowly falling outside. It had been a cold month. The sight of it gave me a phantom chill and I shuddered. My body seemed to get goosebumps just from the sight of the icy weather outside.</p>\n\n<p>I wanted my mom to be proud of me when she came home so I cleaned the kitchen plus the living room, trying my best to make them neat and spotless. Maybe this will get me a better gift than my siblings, who knows.</p>\n\n<p>After an hour of tiresome and boring chores, I finally had some time to myself. My parents still hadn’t returned with my younger brother and I didn’t know where my twin sisters were. The clock was hitting close to 2:32 P.M. My sisters were in high school while I was in fourth grade. One of the benefits of being a student is that you have all the crayons you need to get creative.</p>\n\n<p>I doodled and colored for who knows how long. It was starting to get dark outside and my parents were still no where to be seen. I looked up at the clock after finally finishing a drawing of Rudolf the reindeer to see that it was roughly 4 o’ clock in the afternoon. Suddenly,my stomach grumbled and I remembered that we would usually have lunch at this hour. It wasn’t a big deal to me that none of my family members hadn’t came yet. What did concern me is that the slowly falling snowflakes had become a snowstorm overtime, burying everything in it’s milky white coat. Even if they were to come now, I doubted they could get the car in the garage. So, being an idiotic 9 year old who wanted to impress everyone, I took a shovel from the garage and went outside.</p>\n\n<p>My body immediately reacted to the bone chilling winter evening. Everything around me looked blue and gloomy in the bitter cold. Our neighboring houses had put up their Christmas decoration lights but they didn’t seem to have turned it on. The snow was raging at this point and I had to make it quick. I shoveled snow from our driveway for ten minutes which felt like an hour to a kid like me before going back inside the empty house.</p>\n\n<p><a href=\"https://www.youtube.com/watch?v=BO20TGeFVCw&amp;list=PL6674FE0F7323E5BC&amp;index=1\">Dark and gloomy 6:00 P.M</a></p>\n\n<p>I was concerned. And worried. Nobody had come home and it was 6:00 P.M already. I smacked myself on the forehead for not remembering that my mother always left a spare cellphone in one of the kitchen drawers just in case. I was just a child so I never had to use it. In fact, that day I used the phone for only the second time. My mother was a smart woman. She had scribbled down her phone number on a piece of paper and glued it right beside the telephone, just in case. Slowly and carefully copying the numbers from the piece of paper into the phone, I finally hit “Call”. It rang 7 times before disconnecting. Desperation was something I wasn’t used to. Some hard object seemed to have formed in my gut, churning with each passing minute.</p>\n\n<p>It was starting to get dark outside as the snowstorm became so rampant that nothing could be seen outside the window. I held my tears back as I scribbled a note to Santa, asking him to bring my family safe home and that I didn’t need a present this year, just my family.</p>\n\n<p>As I was writing, a hard knocking on the front door suddenly echoed through our house. I was instantly overjoyed and started running downstairs, naively thinking to myself that Santa was real and that he had brought my family back. But then I stopped midway. I was just a child but I had known my family for 9 years. None of them knocked this loudly. The door was practically being slammed against. Something was trying to barge in through the door. I still had the faintest hope that this was just my mother who wanted to get inside the warmth of our house, away from the frost outside so I tip toed towards the door’s peek hole and looked into it. I saw a human shaped figure standing on our porch but it definitely wasn’t my mother. This person had an unnaturally long neck and instead of a normal human face it had painted on it’s bleach white skin, a poorly drawn red smiley face. The stranger was wearing a tattered black suit, slamming his over sized hand onto the door, rattling the door frame. He suddenly stopped. I held my breath, hoping he didn’t notice a thing. He stepped closer to the peephole and seemed to stare directly at me with his painted eyes. I was utterly terrified. Slowly backing off from the door, I sneaked back upstairs. As I stepped up the stairs, a sudden sound of glass shattering disoriented me. I looked back at the door to see a long, pale finger sticking out through the peephole. I couldn’t hold in my shock and yelped and when I let out that sound the disturbing man suddenly bashed the door much more violently while shrill, malicious laughter came from behind the it. The wooden door tried its very best to hold it’s ground but it was failing as cracks started showing after the third impact.</p>\n\n<p>In a complete, overwhelming panic, I ran upstairs towards my room as fast as I could. The phone was there and it was the only thing that could save me. Right after I had reached my bedroom door handle I heard the front door being torn apart and thrown away, wood splintering and the sound of snowstorm raging outside had now become more clear and transparent from the absence of the door blocking it. But that’s all I heard. Not a single footstep nor something coming up the stairs. The house was deathly quiet while a feeling of impending doom hung in the air. I quietly opened the door to my room, stepped in silently and closing and locking it. It was 9:23 P.M. I sobbed quietly to myself as I dialed 911. Nothing…</p>\n\n<p>The phone’s battery was dead.</p>\n\n<p>I cried even harder as I desperately dialed my mother’s number again and again with each call disconnecting without a response. Something slammed against my door. I knew what it was before I even needed to look up. Weeping even harder, but trying my best to stay quiet, I crawled under my bed. Holding my hand around my legs, I sank my face deeply into my thighs, sobbing, trying to think of anything else at all.</p>\n\n<p>Right after I crawled under the bed, the door burst open, the lock snapping. A pale, white, skinny pair of feet stepped in and bitter cold air swept in. Its toes were long and thin like a grown woman’s fingers. It stood there for a while, inspecting everything in the room painfully slowly. Then, with a jerky motion, it bent down and I could see its head up-close. A maniacal pair of eyes and pointy, jagged teeth painted onto it’s otherwise blank face. It started to get into a crawling position, creeping closer to me, sinking its ice-shard like frigid, sharp fingers onto my soles, it pierced me as though I was being melted and I couldn’t even scream. It started laughing viciously with that satanical voice again, its fingers now painted sanguine with my blood. It hadn’t had enough and slowly pulled out it’s fingers from my feet, then started to sink it onto my torso and abdomen. Five knife like fingers started to sink into my skin. I realized my feet were already frostbitten. The fingers seemed to suck the heat and blood out of me. The pointy fingers cut onto me and I sobbed uncontrollably. I couldn’t scream. I couldn’t scream. I couldn’t scream. It was staring deeply into my eyes, chuckling to himself as its vile claws entered my torso.</p>\n\n<p>Suddenly, the jagged fingers stopped violating my skin and the man shot up to a standing position with inhuman speed. I heard someone calling my name downstairs. My mother’s voice was unmistakable. The creature stepped near the window of my room before turning back to look at me. I was under the bed in a fetal position, bleeding out and frost bitten, my death approaching rapidly. I could barely open my eyes to see it gesture a “hush” with its pointy finger before opening the window and disappearing out into the murky winter gloom. My mom came running upstairs with my siblings, crying out my name but before she could reach, my dad came rushing in. He looked at me just once, then immediately hoisted me and started running towards his car. My mother was crying but my siblings didn’t know what was happening except my oldest sister, Mary, who looked deathly concerned with a grim look on her face.</p>\n\n<p>I passed out while dad drove the car towards the hospital in the night. I woke up on a hospital bed. I had several deep pierces in my feet and slight gashes in my abdominal and chest area and moderate hypothermia. Every wound had frostbitten the skin around the area it entered. It was as though I was slowly stabbed with several ice shards during a snowstorm.</p>\n\n<p>After a few months, I recovered. That day, my parents explained they were out shopping for decorations and gift wrapping when they got into a serious car accident on the icy highway. They had to admit Tom into a hospital and was filling out insurance forms and documents, delaying their return before finally coming back home to a traumatized child and a busted open front door. It had countless holes in it, violently torn apart.</p>\n\n<p>In the present, I&#39;m 32 and I still walk with a limp due to phantom pain in my feet and I absolutely despise winter. I hope whatever that thing was, it melts in hell for the trauma and scars it caused me. And my broken front door.</p>\n</div>\n","author":"rantleystalk"}