{"rank":"159","title":"Canadian Paranormal Encounters: Vision in the Rare Book Collection","id":"8jkzyz","url":"/r/nosleep/comments/8jkzyz/canadian_paranormal_encounters_vision_in_the_rare/","time":"1526385597000","body":"<div class=\"md\"><p><em>This is the second instalment of a series where I investigate real paranormal encounters in my home and native land. You can read the first instalment here: <a href=\"https://redd.it/8jblkr\">Panic at Manic-5</a>. These encounters are all stand alone, so you can also jump in any time without needing to read the rest.</em></p>\n\n<hr/>\n\n<p>I heard this story from a librarian after a tour of the rare book collection at the Library of Parliament. This was actually what spawned the idea of writing about real Canadian paranormal encounters, but since it was kind of spur-of-the-moment, I didn’t have anything prepared and didn’t take notes. What I’m trying to say is, please forgive me if I can’t remember little inconsequential details like the <em>exact</em> floor number. I didn’t take down the librarian’s name either, so I can’t follow-up with her to verify those details, but they don’t affect the story, so I hope that’s okay.</p>\n\n<p>What happened was the tour group and I were in one of the library sub-basements (maybe 2-3 floors down?) where they keep the rare books. We were there maybe thirty minutes in all, and every ten minutes or so, the lights would turn off, leaving only two emergency fluorescents open on either end of this really long room. The librarian said it was nothing to worry about: we just had to move a bit to trigger the motion sensor so the lights would turn back on. It was some sort of combination energy-saving measure, as well as to help protect photosensitive material. No biggie.</p>\n\n<p>As I stood there in the dark, I remember thinking how eerie the room looked, with row upon row of old books, boxes, and displays hidden under black-out drapes. You know that thrill you get when you sit around a campfire telling scary stories? That feeling was creeping up on me. That’s why I lagged behind once the tour group moved on and helped the librarian pull the blanket back over a display she’d unveiled for us, and then I blurted out the question that started this all:</p>\n\n<p>“Got any ghost stories?”</p>\n\n<p>I was expecting a laugh or a dismissive wave of the hand. I was <em>not</em> expecting the apprehension on her face or the way it looked like she was trying to swallow cement as she gaged whether or not I was serious. I <em>almost</em> chickened out and rejoined my group, because of the whole…social awkwardness thing, but I’ve been trying to come out of my shell, so I forced myself to mumble a half-baked explanation about being into horror and how old buildings usually have stories to tell or something like that. I forget my exact words, but whatever I said, it swayed her, and got her to share something she’d experienced a few years prior.</p>\n\n<hr/>\n\n<p>It was after-hours, and she was alone in the rare book collection, working late to bank vacation time. The library had been doing a bit of re-organizing, and she was hard at work sorting a box of books that had just been transferred in from storage. The rare books aren’t actually organized in the same way a normal library would organize them, no Dewey Decimal System or anything like that, and most hadn’t even been registered in their electronic system yet (yes, I can just feel you librarians reading this cringeeeeee), so it was a really slow-going process. During the tour, she’d mentioned it’s not uncommon for them to find books they thought lost or destroyed, and come across books they didn’t even know they owned.</p>\n\n<p>The room is organized like so: a long central aisle sectioned by support beams and large wood-and-glass displays for the most impressive rare books, doors on the far ends of the room, motion sensors for the lights next to each door, and rows of compact bookshelves on either side of the central aisle. If you’ve never heard of compact shelving units, they’re basically these big metal bookshelves on tracks. Instead of the typical shelf, gap, shelf, gap, and so on and so forth, these bad boys are all squeezed together with only enough room for one gap at a time. It almost doubles storage capacity, but the downside is, if you need to consult a book in a row without a gap, you have to move all the bookshelves between it and the current gap by manually turning these three-pronged hand cranks on the side of each bookshelf like you’re opening a submarine hatch.</p>\n\n<p>The librarian had been working in a row on the left side of the room, when the lights automatically turned off. Since the motion sensors only pick up movement in the central aisle, she stretched her arm out and started waving blindly. When this didn’t work, she stretched further, her torso now in the aisle, and that’s when she caught movement from the corner of her eyes. It was just for a passing second, but she saw someone in old timey clothing on the right side of the aisle walk by before they disappeared behind one of the support beams.</p>\n\n<p>The lights flickered on.</p>\n\n<p>Now, normally, someone in old-timey clothing would have been <em>extremely</em> odd and a sure sign it was time to get the hell out, but the Library of Parliament actually has a changing room one floor up from the rare books collection, full of costumes of old prime ministers, their wives, and other historical figures from a discontinued program where they’d walk around Parliament acting out scenes for visitors. She figured a colleague was playing a prank on her, so she dashed around the support beam to try and scare them first.</p>\n\n<p>The aisle was empty.</p>\n\n<p>She walked up the aisle and peered towards the bookshelves, but like I said earlier, they’re all squeezed together and the gap on the set of bookshelves on the right side of the room was on the very end, so there was nowhere for someone to hide.</p>\n\n<p>Convinced she’d imagined the person, she went back to work. After all, she figured, if someone had truly been walking down the aisle, the lights would have turned back on immediately after turning off.</p>\n\n<p>She’d barely placed another book, when she heard the grinding shriek of old metal coming from the right side of the room, the distinctive sound of a hand crank being turned. It was accompanied by the slow scraping sound of a heavy bookshelf moving along its track. She slowly and nervously peered out, expecting to see her colleague turning the crank, but instead, found the aisle empty again, and the noise silenced.</p>\n\n<p>Now, she was thoroughly freaked out. She retreated back into her row of books and anxiously tried to get back to work. No sooner was she out of sight, however, did the noise pick up again. This time, she inched her way very slowly out of the row and peeked out from behind the bookshelf.</p>\n\n<p>The hand crank was moving.</p>\n\n<p>It was moving <em>slowly</em>, but it was moving.</p>\n\n<p>She couldn’t understand what she was seeing: those hand cranks <em>can’t</em> move on their own: it takes a bit of elbow grease to get them spinning. It’s not something that, say, the wind can do.</p>\n\n<p>She stood there in shock for a moment, and then summoned the courage to take a closer look. With great trepidation, she crossed the aisle and walked to the shelving unit just as it clicked against the other, forming a new gap. She heard a thunk, and peered into the row, only to find a book on the floor leaning against wall. She described her mental state as being kind of in a haze at that point, like she couldn’t wrap her head around what was happening, so she just did what seemed logical at the time. In hindsight, it wasn’t the <em>best</em> idea, but she walked into the row and picked up the book with the intention of putting it back in its place. Before she could, however, she saw someone standing at the foot of the gap, blocking her exit.</p>\n\n<p>He was wearing old clothes, just like she’d seen before, but she couldn’t recognize his face. There was something about him that filled her with dread, and she only realized much later, it was the fact that she couldn’t see his lower-body. He stepped aside and disappeared from sight, and suddenly, she heard the squeal of the hand crank, and it was moving <em>fast</em>. The bookshelf began sliding towards her rapidly. She screamed, dropped the book, and ran out just as the shelves were starting to squeeze against her.</p>\n\n<p>The aisle was empty, no sign of the crank-turning phantom.</p>\n\n<p>Suddenly, a hand crank on the left side of the room started spinning wildly, closing the gap on the row she’d been working in earlier and crushing the box of books she’d left inside.</p>\n\n<p>She booked it out of there like a bat out of hell. Out the nearest exit, up the first of…three(?) flights of stairs. She heard footsteps behind her, but she didn’t look back. Up, up, up, and finally, she was on the main floor, where the night janitor was mopping. She tried to explain why she looked so scared, but he checked downstairs and said there was nothing amiss.</p>\n\n<p>She says she’s never seen anything since then and never goes down there after hours, but sometimes, when she’s at the door to the rare book collection, she’ll hear the sound of the hand crank turning, even though the room is empty.</p>\n\n<hr/>\n\n<p><em>If you&#39;re interested in more Canadian paranormal encounters, check out the other instalments:</em></p>\n\n<ul>\n<li><p><a href=\"https://redd.it/8jblkr\">Panic at Manic-5</a></p></li>\n<li><p><a href=\"https://redd.it/8jwfma\">The Spectres of Sparks Street</a> </p></li>\n<li><p><a href=\"https://redd.it/8l9pt5\">Last Ride of the Night</a></p></li>\n</ul>\n</div>\n","author":"manen_lyset"}