{"rank":"24","title":"My great grandmother was found alive","id":"8jlc24","url":"/r/nosleep/comments/8jlc24/my_great_grandmother_was_found_alive/","time":"1526388867000","body":"<div class=\"md\"><p><a href=\"https://www.reddit.com/r/nosleep/comments/8e1c7u/my_greatgrandmother_is_missing/\">Great Grandmother is missing</a></p>\n\n<p>My name is Noah Krammer. My great grandmother, Lulie Krammer, was found. Alive.  Thank you to everyone who tried to comfort me.</p>\n\n<p>First of all, my great grandmother disappeared in really weird circumstances. She had been in a coma for as long as I could remember. Finally, when she was out of the coma, before I could get to her hospital from my college, some guy, my “cousin” named ‘Max’, who I had never heard of came to see her. Then, she disappeared from her room into thin air. </p>\n\n<p>Then this police officer named Owen from Montana called me and said he might have some leads and told me he would like to meet up with me. He came over to the hospital the next day, we went over the questioning drill and then the video and he asked if I would like to join him on a road-trip to where he thought my great grandmother might be and that it would take a couple of days. He also said it wasn’t official and his buddy was mixed up in it and he wanted to find them. I was ready to jump on anything that might lead me to my great grandmother. </p>\n\n<p>So I went with him and we drove. As soon as night fell, I could feel myself slipping up and sleeping so I told Owen I was going to be falling asleep and he said he had no problem with that. I heard what sounded like drums, a steady beat and a strong firm hand softly guiding me into the darkness, I happily followed. The next thing I remember is Owen waking me up saying we had arrived. I had a terrible headache.</p>\n\n<p>It looked like we were near a park of some sort and Owen started walking up a trail and asked me to follow him. I did what he told me to, he was police. It led up to a cabin which was sitting in some heat. There wasn’t much in the form of any sunshine, trees covering everything, but I could feel the heat drain me. As soon as we reached the door, it opened and inside was the man, whom I had the displeasure of watching in the CCTV video, my “cousin max”.\nRage filled me as I saw his face and I was ready to throw some punches, but my body felt paralyzed.</p>\n\n<p>“Somebody’s back early” Max said</p>\n\n<p>“Yea, I did what you told me to do. Now give me Sophie back along with the others. Keep your part of the deal.” Owen said.\nDeal? A deal? This police officer made a deal with this fella’? I was fuming.</p>\n\n<p>Max pointed towards the stairway behind him </p>\n\n<p>“After you.” </p>\n\n<p>Like, clockwork, my feet moved, but nothing else did, hands didn’t work enough for me to even grab the wall while walking and teeth were clenched tight. It was the first time, I knew, how it felt to knowingly walk into a trap. Officer Owen seemed to be much in the same position as me as he took out his gun and placed it on the table before he walked up, not saying a word. Max led us to a dark room lit only by a small candle. </p>\n\n<p>Inside the room were three women hung upside down, with weird markings on them. One was a toddler, girl by the looks of the frock, maybe 2-3, another was a fit looking red-haired lady and the last was my great grandmother. Hanging upside down. My heart sank and I could see Owen was in his own hell too. I looked to Max and he extended his hand.</p>\n\n<p>My body moved on its own and I slowly pulled out my ring and placed it on his hand. It was a black pearl. It belonged to my great great grandfather or something. Mom told me it was some family heirloom and it linked me to my great grandmother. I felt powerless to stop it from slipping on to his hands. As soon as I was moved back to my place, Max placed it in the center of a circle or something he had crudely made with six huckleberries on the floor. </p>\n\n<p>With that, he started chanting something in a language I didn’t understand. The whole house started shaking to what felt like drum beats. The three women who were hanging started convulsing much like my great grandmother had in that hospital room. I wanted to close my eyes, I wanted to make it stop, but I couldn’t. I was stuck for what felt like an eternity watching all three of them violently convulse. </p>\n\n<p>With some smoke and a loud gong, it stopped and we all dropped to the ground. I couldn’t move. The soft sound of drums could still be heard inside of my head and my eyes closed involuntarily.</p>\n\n<p>When I woke up, Owen was up checking on the women. I immediately rushed to help him. Max was nowhere to be found. \n“I’m sorry to have to put you through this man.” Owen stared at the ground, unable to look me in the face.</p>\n\n<p>“I know you want some answers, but I…” </p>\n\n<p>“It’s okay. I know you don’t have any.” I cut him off. I still don’t know what made me say it, at that moment. Of course, I wanted answers. I was livid, but I knew better than to ask questions I didn’t want answers to. Within the next hour, officers flooded the area and the women were wheeled out to ambulances. I went with my great grandmother. It was night by the next night, the doctor told me what I wanted to hear. She was up.</p>\n\n<p>I walked into her room and was greeted by her grinning at me ear to ear.</p>\n\n<p>“Hey, I don’t know if you know me, but I am Noah. Your great grandchild.” I stood there beaming like an idiot, my eyes watering around the corners. </p>\n\n<p>“Thaaaaaat’s silllllly. I’m Louiiiiiissssseeeee.” And she giggled, like a child but I don’t think I will never forget that sound, chilling my bones, like that. </p>\n\n<p>Owen barged into the room and with him was the red-haired lady in her hospital gown leaning on his shoulder. They quickly closed the door behind them and she placed a gooseberry on top of my great grandmother and said something in another language. It sounded much like the language that max spoke. The moment my great grandmother heard it, she fell limp on to her bed and within a second revived with a huge breath.</p>\n\n<p>“It worked!” yelped the red-haired lady and fell to her knees. The doctor came in and scolded her for being there but this lady couldn’t help laughing. The nurses came to help her back to her room, I think, and the doctors led me out to do some tests on my great grandmother. </p>\n\n<p>I sat down on the seats near the room, next to a gentleman, who was sleeping with a hat over his face. As soon as I sat down my body froze</p>\n\n<p>“Well, poor little Sophie, thinks she did it, but well, she doesn’t have to know it was me.” I recognized the voice. It was Max. I couldn’t move. </p>\n\n<p>“I’ve let them out now. The curse is broken and they are free to roam. I have no need for your ring now. Or their bodies.” My hands moved into my pocket only for me to feel something in there. It was the ring. When I came to my senses, he was gone. </p>\n\n<p>I know better than to ask questions I don’t want answers to.</p>\n</div>\n","author":"Distant_claws"}