{"rank":"26","title":"Production Hell The Devil is Beating on his Wife","id":"8jlf05","url":"/r/nosleep/comments/8jlf05/production_hell_the_devil_is_beating_on_his_wife/","time":"1526389580000","body":"<div class=\"md\"><p>It was a little before nine on a sunny Sunday morning and I was sitting on the front porch of the dilapidated house just off campus I was renting for the summer. My best friend, Hugh, was sitting across from me. We had been out all night drinking and arguing about 20th century literature and Rick and Morty’s place in the canon , and by now we were too tired to argue but not too tired to continue sipping on Gentleman Jack out of stolid, cut crystal tumblers on my porch.</p>\n\n<p>A thunderclap came out of nowhere--so sudden and harsh it felt like a punch in the gut, and then rain started to fall right through the still sunny morning sky.</p>\n\n<p>“Fuck, bro,” said Hugh, “back in New Orleans when it rains on sunny days  we’d say ‘The Devil is beatin’ on his wife,’ and when Old Sugah is riled up, that’s my cue to exit.”</p>\n\n<p>“Alright, bro,” I muttered, pretty content to try to sleep all this off anyway. But then I was suddenly curious, “Wait, who the fuck is Old Sugah?”</p>\n\n<p>“Oh, my granny used to call the Devil Old Sugar. Because of how he was Lord of the Flies, they said, and she figured the lord of the flies would have a sugarcube for a head. Made him the lord of absinthe, too, the real shit, not the weak concoction they sell now--cuz the real shit tastes so evil you have to sweeten it with a cube of burning sugar.”</p>\n\n<p>“You come from quite a family, Hugh.”</p>\n\n<p>“Don’t I know it. Old Sugah beatin’ on his wife,” he remarked again, pointing his handsome face directly into the sun as if to stare it down, “means today is gonna be a weird one.”</p>\n\n<p>“I guess so,” I said to his back as he ambled down the sidewalk and out of sight, and then thought that right about now I could use a weird day. At least a weird day would be some kind of change--it was all these normal ones that were blowing my shit.</p>\n\n<p>Hugh and I were both English graduate students at the University of Illinois in the Middle of Fucking Nowhere. It was easy to pretend we both had similar futures ahead of us--but whereas Hughbert Kempton Ruggles Boyd was a brilliant 20something who came from old Cavalier money down in Louisiana, I was a half-smart Yankee boy who came from a Chicago burb with a family that didn’t give a shit if he lived or died. </p>\n\n<p>There was a PhD and probably an eventual tenured job at a prestigious university in Hugh’s future. My own future was more likely to involve lecturing suburban high school kids about the dangers of comma splices, and possibly being thought of as a semi-cool teacher because I knew who Cardi B was and probably wouldn’t bother to confiscate their Juuls most of the time.</p>\n\n<p>I had written a screenplay, of course, just like everyone else I knew; one I had honestly believed was going to make me rich. But there had been no traction, no representation, not even any social media buzz. And so here I was sitting and listening to the sounds of rain through heavy sunshine and hoping for one fuck of a weird day.</p>\n\n<p>A black millipede, big and fat as my thumb scurried across the rickety white Ikea table Hugh’s emptied tumbler and my tumbler, still half full of rich brown booze, rested on. I considered crushing the brazen beastie with my sturdy, cut crystal tumbler, felt too squeamish, and decided against it.  Just the thought of its pinkish guts sprawled across the table made me feel like dry heaving.</p>\n\n<p>A huge black millipede is <em>my</em> cue to leave basically any situation, so I downed the rest of my Gentleman Jack in a single gulp and took one last look around my neighborhood and muttered “Oh well. PIss on all of it,” and staggered into my bedroom to prepare to pass out while another peal of thunder whooped across the sunny sky.</p>\n\n<p>I was drunk enough to not undress from my old madras short sleeve button down shirt and khaki shorts, but sober enough to cue up my preferred sleeping playlist on Spotify (heavy on The National and The Mountain Goats) and I dozed off at long last while Matt Berninger moodily sang to me that, while I may not want an angel watching over me, (surprise surprise!) they wouldn’t wanna watch.</p>\n\n<p>A little before 3, I woke up to the charmless sensation of an enormous black house fly landing on my lips like a lover’s kiss. This time I slapped furiously at the fly and missed completely, succeeding only in rapping myself in the nose like you might swat a bad puppy who has just chewed up your one pair of loafers suitable for job interviews. The fly was a bona fide monster, and it just hung lazily in the air over my face for a moment, buzzing languidly, and then drifted off to rest on my drapes.</p>\n\n<p>“Fuuuuuuck,” I said, hopping to my feet. “Shiiiiiiit,” I added, reminiscing unfondly about the bug that had just been poised on my lips, probably pooping, as I recalled reading somewhere that flies poop everywhere they land.</p>\n\n<p>I stormed angrily to the adjoining bathroom and brushed my teeth  and looked back into the bedroom to note that four or five more big black flies had begun buzzing around the bedroom. The buzzing of the flies combined into a single, ominous drone that filled me with a hazy but unmistakable sense of dread.</p>\n\n<p>I got angrier to try to keep from getting scared. It didn’t really work.</p>\n\n<p>There was nothing to be scared of, I assured myself. This was just one of those mindfucks where all the free floating panic in my brain had been looking for a nice place to land and have a picnic and today my old pal Dreadful Panic had finally decided to land on my reactions to  a little bit of weird weather and a few gross but harmless bugs, and now the panic was contentedly chilling out and having a nice meal--and my peace of mind was the main course.</p>\n\n<p>I popped gooseflesh.</p>\n\n<p>Probably sick too, I realized--or else too much booze was thinning my blood and making warm rooms on a warm day in a hot month feel chilly.</p>\n\n<p>I rinsed my mouth out. Took care not to look in my bathroom mirror, because I’ve had a weird, vague horror of mirrors ever since I was a little kid, and when I start getting spooked I start to avoid them. I know there’s no boogeyman standing behind me, but I’ve always known I have the kind of brain who can conjure one up, and if I glance in a mirror and my brain plays a funny trick on me like making me believe there is some kind of man shaped thing with the head of a housefly (or a sugar cube)  standing right behind me then I’m definitely going to go nuts as soon as I see it and I’ve always feared insanity more than anything else.</p>\n\n<p>I took a deep breath and strutted back into my bedroom to take my phone from the bedside table. Then I walked right back out into the living room, swatting away a couple of flies I hadn’t noticed before in the process.</p>\n\n<p>Walked. Didn’t run but walked. Made it a point to walk in a nice, measured way--a crazy person losing his shit would run, but I was avid to prove to myself that I was calming down. Buddha-like, basically--that was me.</p>\n\n<p>I tried to think of a reason to leave the house that wouldn’t feel like a horror film protagonist running out of the haunted house and praying that his car engine turns over. Checked the time and weather--3:10 in the afternoon and the weather was supposed to be hot and humid but no more thunderstorms were in the forecast.</p>\n\n<p>I realized that just going through some of my normal routines was calming me down. My friends were living their lives all over my FaceBook account, and everything was churning along like clockwork. Someone had posted several photos from the academic conference they were at in Arizona, someone else posted some pics of their new baby, an adamantly child-free mutual acquaintance posted some pics of her Labradoodle in response, and I realized after a few minutes of liking and loving and babbling banal bullshit comments from time to time, my breathing was back to normal and I didn’t feel the same unsettling chill. To be on the safe side, I ambled over and shut the door to my bedroom (as freaked out as I had been, the fact I had not thought to do that only further confirmed I have the survival instincts of a hamster) and then opened up my computer to while away a little time working on my screenplay.</p>\n\n<p>Let me tell you about my screenplay. Ha just kidding! Come back, I wouldn’t do that to you.</p>\n\n<p>The important thing was, I had kept assuring myself, that I <em>had</em> a screenplay. I had created a thing and now I had to help that created thing find a place in the world. Or, to be more crass, I had to keep working until the thing I had created was a thing other people would want to consume. Something they would be willing to <em>pay</em> to consume. I was a long way from where I needed to be.</p>\n\n<p>I had written a plodding, and fairly polite coming of age film about a hapless male protagonist and his ill-fated efforts to win the love of his so-far-out-of-his-league best lady friend. In the end, although he doesn’t get the girl, my protagonist is a little wiser for his disappointment. Looking back now, I can promise you it was every bit as hollow and banal and bland as it sounds. Call it “Woke Say Anything.” Call it “Indistinguishable from half the movies released in the past half decade.” Call it bullshit. That’s what I finally did. Right then and there, sitting at my computer and staring at the screen, I realized <em>that</em> was my one and only problem: The thing I had created was boring bullshit and I had better goddamn well make something scintillating unless I wanted a future of trying to teach kids with 10k Twitter followers and the attention spans of gnats what a “gerund” is.</p>\n\n<p>There was an empty tumbler and a full bottle of Bulleit Rye by my computer when I sat down, feeling suddenly energized. “Don’t mind if I do,” I said to no one at all, pouring a glass of rye and opening up a blank document.</p>\n\n<p>I wrote furiously, in a kind of reverie. I got my ass to work on a screenplay that was gonna push <em>everybody’s</em> buttons. Now the protagonist, the apparent “nice guy” led a double life as a sadistic Lothario. I channeled every frustrated “nice dude’s” deep, dark id and just aired it all out. The fantasies about sexual dominance to overcome the feelings of deep inadequacy. Fantasies about playing fucked up psychosexual games (at one point the “hero” of the story blackmails a woman by threatening to send the receipt for the abortion he had paid for to her super-religious mother). Pivotal scenes about using sexual conquests for their only real purpose to guys like the narrator--as dominance displays to cow other, weaker males. The narrator was infuriating. He was amoral. He was the Red Pill subreddit come to life. He was Patrick Bateman for Generation InCel and I was absolutely certain that I had such incendiary content on my hands, even after such a rough pass, that it was going to make me rich and infamous.</p>\n\n<p>Did I lose track of time as I pounded out my draft? You bet I did. I was vaguely aware of the room growing colder and colder. When I reached the point in the narrative where the narrator first lets his masque of niceness slip and reveals that he has poisoned the beloved pet parrot of his gay neighbor for no other reason than to surreptitiously record the pathetic man breaking down in tears and post it to his YouTube channel I was aware of a loud, cacophonous buzzing and vaguely noted that the flies must have found their way in. This felt strangely reassuring to me--the swarms of flies felt like a handshake, like something clicking into place.</p>\n\n<p>It was when I reached the pivotal scene--in which the narrator blackmails his ex lover into giving him one last blowjob in exchange for not revealing the details of her abortion to her rich, deeply Christian mother who would both cut off all her love and cut her daughter out of the will if she knew--that it dawned on me at some point I must have put on my heaviest turtleneck sweater and still I was so cold I was shivering and when I looked up I saw that the room was now full of huge, buzzing flies weaving around in desultory, erratic flight paths.</p>\n\n<p>I looked down at my work and saw that it was good.</p>\n\n<p>In only a few hours, I had written something infinitely more marketable, and better, than the screenplay I had been dicking around on bit by bit for over a year. The flies buzzed and I grinned.</p>\n\n<p>I decided to take a long, fast drive on the backroads just outside of the small university town where I lived. It seemed like a good way to exorcise the very nearly sexual sense of ecstasy I was experiencing and get myself together enough to finish up the screenplay.</p>\n\n<p>It was 6:30 when I went out to my 2003 midnight blue Celica Sedan, now dressed appropriately for the season in my old madras shorts and a Father John Misty tee shirt. I slid into my seat. I buckled my seatbelt. I started the car. I began to check my mirror, and still couldn’t <em>quite</em> bring myself to deal with a mirror right now, so I did a slow K Turn in my driveway and pulled out onto Division Street.</p>\n\n<p>As unsettled as I had felt for much of the day, I was exuberant about the progress I’d made on my project and was willing to write off the angst and the anxiety as the cost of doing business for someone whose creative juices were finally starting to flow. I glided down narrow, dark streets and cranked up my Spotify on the car stereo, singing along enthusiastically while Frank Black explained that he was, was a Debaser.</p>\n\n<p>I left the city limits of Champaign-Urbana, the very small city that contains the U of I and drove out into the very large and dark Nothing just outside town where the roads have names like “Rural Route 6” or “County Drive 31,” and where farmers live in big houses and make their living by growing some crops and by being paid by the government to, for the love of GOD NOT GROW ANY MORE of some others; which seems like pretty good work if you can get it.</p>\n\n<p>It was late enough in the season that almost all the crops had been harvested anyway and so, though the air was still redolent with the sweet sick smell of fertilizer, and though some heavy machinery still rested in the fields, the fields themselves were mostly vast swaths of brutalized dirt and rows of desiccated, seared, harvested corn stalks swayed in the wind like men with broken necks swinging from gallows. The moon, I noted, was full and fat and seemed preternaturally close to the earth.</p>\n\n<p>Thanks to the magic of Google Maps I was able to drive willy nilly, giving no fucks about paying attention to where I had just turned or which cardinal direction my car was even pointing anymore and feel secure I could find my way back. I had turned down a particularly dark and desolate road which, unlike all the others, was named--BlackFriar Bridge Road the sign read, and Nirvana’s cover of The Man Who Sold the World had just come on Spotify when I heard another long, loud peal of thunder although it was not accompanied by lightning and no rain fell.</p>\n\n<p>I was unnerved. I was exhilarated. I was amped as fuck, bro. The thunder, once again, felt like some kind of agreement being proffered.</p>\n\n<p>I remember hearing Cobain on my radio just after I checked my clock and saw that it was 8:04 PM:</p>\n\n<p>&quot;Who knows?/Not me/We never lost control /You’re face To face /With the man who sold the world.&quot;</p>\n\n<p>I don’t know what happened after this.</p>\n\n<p>The next thing I knew, it was 10:13 PM, my car was significantly lower on gas than it had been, and as far as I could tell I was still driving on BlackFriar Bridge Road, which would have meant either it was the longest, straightest, flattest road in the world or there was something wrong with the clock on my phone. I had only snapped back to attention, in fact, because a pair of super bright headlights were making my eyes throb as a car had come up behind me and was tailgating me aggressively.</p>\n\n<p>At first, I thought it was surely a police car using some of the more charmless cop car tactics to try to make a hapless driver fuck up and get an excuse to pull him over. As it happened, my cruise control was still set to 55 and as far as I could tell I had done an admirable job of driving pretty safely while completely blacked out for some reason, and so the putative cop I was imagining behind me must have been making constipated faces and chomping down angrily on his cigar like old Boss Hogg failing to railroad those Duke Boys one more time.</p>\n\n<p>I felt a sudden, sharp sense of confused relief when I realized there were no longer headlights blinding me from behind.  Then I felt a sudden, sharp sense of confused panic when I looked up and saw that the car was now directly in front of me. It was a big, black car, a 1960 Cadillac De Ville to be exact.  All the windows were tinted, and it was gliding in front of me just slowly enough to force me to pump my brakes and take my own speed down to about 50.</p>\n\n<p>Even though the windows were tinted, I was absolutely sure there were two men in the car, one in the front and one in the back who was the driver’s boss. The car had no license plate but was otherwise in pristine condition. I could taste the battery acid flavored bile rise up in my throat that always comes when my adrenal glands are pumping hell for leather to try to keep me alert to an unsettling situation.</p>\n\n<p>I considered flashing the car with my brights, then thought better of it. What the fuck would that do, I asked myself. This car seems to have disappeared from tailgating me and teleported directly in front of me to fuck with me by pumping its brakes--what the fuck interest did I have in taunting the goddamn demon car?</p>\n\n<p>In fact, I slammed on my brakes hard with the wild notion that maybe I could turn around right in the middle of the road and then outrun the 60 Cadillac with my old Celica. The car was about fifty feet in front of me and still gliding forward when my car ground to a halt and I spun the wheel as far to the right as I could with plans of turning around 180 degrees in the fewest, fastest possible number of turns. I slammed on the gas and then slammed on the brakes just as fast, mashing me up against the steering wheel because the black car was now just sitting beside me, idling.</p>\n\n<p>I puked up more battery acid tasting bile and my heart thumped savagely when the heavily tinted driver’s window began to roll down, agonizingly slowly. I gritted my teeth. I held my breath. I felt hot tears running down my cheeks.</p>\n\n<p>A silver haired white man in his mid 60s, wearing a chauffeur’s uniform and cap, was staring at me serenely. His gaze had the sort of beatific brilliance, radiating such calm that I was stunned into serenity or something like it myself. I could feel the tightness between my shoulders start to melt away. My breathing returned to normal. I could swallow again. We never broke eye contact.</p>\n\n<p>(Well you wouldn’t want an angel watching over you…)</p>\n\n<p>The man grinned at me and I grinned back. As his hand reached under his seat, I had such a peaceful and loving feeling that I half expected him to pull out</p>\n\n<p>(Well surprise, surprise, they wouldn’t wanna watch)</p>\n\n<p>a piece of candy and offer it to me. But then instead</p>\n\n<p>(We never lost control)</p>\n\n<p>He was reaching for something else and as he brought it up to his face I saw that it was the most grotesque, reddest  devil’s masque I had ever seen. He stared at me through the masque. It was the face of a red, leering devil with huge horns protruding from his temples and a grotesquely oversized, phallic nose which I was involuntarily picturing poking around on me, violating me and I lost my shit completely and screamed myself hoarse and felt the sensation of hot piss running down my left leg and now I just threw my car into reverse and drove backward as fast as I possibly could, totally indifferent to the likelihood of being able to maintain control or even stay on the road.</p>\n\n<p>I refused to use my mirror and so I craned and lurched  my neck back as far as I could to watch behind me to try to stay on the road. There was nothing in front of me that I wanted to look at, I was sure of that much. I don’t know how long I drove this way, my neck craned to the back and in reverse going 35, 40, 45 miles per hour and expecting, at any moment, to be overtaken from in front by the godawful car that had begun to torture me for no apparent reason on what had been shaping up to be a pivotal night in my life.</p>\n\n<p>Keeping control of my own steering wheel was difficult with my blurry vision and trembling hands. My vision was good enough, navigating exclusively through the faint glow of my tail lights and blind instinct, to stay on the road, but several times the car veered off far enough to the right or the left shoulder to start kicking up gravel and try to lurch into the ditch. I was totally positive that, if I went off the road, that was going to be all she wrote. I’d die alone out here in the dark under the stars, stark mad and gibbering against my fate to the very end.</p>\n\n<p>I took a deep breath and looked up, forward and dead ahead, and saw no car. I craned my neck once more, and saw no car behind me either, laying in wait. The comparatively wide country boulevard was also clear to my right and to my left. I sighed deeply, slowed down, came to a stop.</p>\n\n<p>I was free.</p>\n\n<p>Thank God, I was free from whatever had been tormenting me.</p>\n\n<p>The moment I realized the car had just vanished like a phantasm melting away, , I started to rationalize the experience. Blamed it on my own overheated brain. Blamed it on the woman I’d loved who had left me high and dry a month ago. Blamed it on my parents, who had made it clear that if I wanted to continue my useless degree I was going to be on my own and out in the cold. Hell, I even blamed it on myself. Decided part of the problem was certainly that I’d become too narcissistic, too self-obsessed in the past few months. Decided to treat the evening as a wakeup call, as the kind of brush with insanity that ultimately serves as a reality check.</p>\n\n<p>I decided to pull over to the side of the road, set my navigation to take me home, put on a little music,  and try to get a little sleep.</p>\n\n<p>Like any good driver, I checked my rearview mirror.</p>\n\n<p>My sanity snapped.</p>\n\n<p>In the mirror, I clearly saw a man in an impeccable grey suit sitting ramrod straight in my back seat. He had not been there fifteen seconds previous.</p>\n\n<p>His head was a cube of sugar.</p>\n\n<p>The cube of sugar was on fire.</p>\n\n<p>I tried to look away from the mirror and turn around to see if he was really there but I could not tear my gaze away from the horror.</p>\n\n<p>Thousands of flies swarmed around the fiery cube of sugar. They flew near the flame. They flew into the flame. They caught fire and the smell of burning matter joined the overpowering pungence of burning sugar.</p>\n\n<p>The longer I stared into the mirror, the more overwhelming the fragrance became and the louder the flies droned. It was as though, staring at the scene through the mirror, I was cementing its reality.</p>\n\n<p>I prayed to God this was all a figment of my imagination.</p>\n\n<p>I felt a fly land on my scalp. Another. I shut my eyes and mumbled “No no nononono.” I felt something hot singe the back of my beck. A burning, crackling fly, no doubt, burning itself into my skin.</p>\n\n<p>I turned around and hoped I would see nothing at all again, just an empty back seat.</p>\n\n<p>I saw a man in an impeccable grey suit with a flaming cube of sugar for a head. I knew it was Old Sugah. Old Nick. The Lord of the Flies. Flies buzzed around by the thousand. Big fat flies. Some fast, some slow. Some orbited the flaming cube of sugar, some caught fire. In Old Sugah’s left hand, he held a piece of paper. I knew it was a contract. I knew it was for me. I had a fair idea of its terms.</p>\n\n<p>I lost my sanity. I lost my consciousness.</p>\n\n<p>When I woke up, it was sunny and warm. The first thing I was conscious of, as I opened my eyes, was that my left hand hurt like hell.</p>\n\n<p>I was laying propped up against an old, gnarled oak tree. My left hand had been nailed to the tree, with a contract written in spidery, crimson letters pierced by the same huge iron nail. Although I was in so much pain that snot and tears were running down my face, the contract was easy to read and understand. There was, of course, a needle glistening in the grass near my right hand. The hole in my left hand was caked with dried blood. I pricked my left index finger with the pin, and smeared enough blood on my right hand to affix my signature to the document and even as I finished crossing the last “t” in my name relief washed over me and I fell into another slumber amidst the smell of sugar just short of overpowering now.</p>\n</div>\n","author":"goldvine_throwaway"}