{"rank":"354","title":"Hungry Teeth","id":"8jlwdv","url":"/r/nosleep/comments/8jlwdv/hungry_teeth/","time":"1526393750000","body":"<div class=\"md\"><p>A while back, I put up a post on a website specialising in creepy versions of ‘kids say the darndest things’. Basically, people post weird, disturbing or strange things their kids have done or said. One woman posted about how her son slept with his eyes wide open, while others have submitted tales of horrific imaginary friends. You get the idea.</p>\n\n<p>My story was about my four-year-old daughter. We had been walking home from nursery, and as we passed through the car park belonging to a block of flats near our house, she bent down to the rusted pickup truck that always sat there, waved and said ‘Hiya’. This was creepy for several reasons besides the obvious. My daughter is autistic, and as such, her social and communication skills are behind where they should be. We’ve taught her a few things like ‘hi’ and ‘bye’, but she doesn’t understand them as social interactions, more as rituals. As far as she’s concerned ‘hi’ or ‘hiya’ is just something you say when you see somebody, rather than a social interaction - like saying &#39;excuse me&#39; after you sneeze or burp and not quite knowing why, just that you have to do it. She doesn’t do it to animals because that makes no sense to her and she doesn&#39;t engage in imaginative play so it couldn’t have been her saying hello to a cat or to some made up person. She was greeting a human, or something human-like. Or at least that&#39;s the explanation I wrote in the post. I didn’t believe anything was under that beat up old truck. It’s not uncommon for my daughter to practice talking, and I assumed that’s all it was.</p>\n\n<p>Within a few hours, I got several responses commenting on how creepy it was, or how other people’s kids had done similar things to stuff under their beds or in their closets. My favourite response by far was from a user who called themselves ‘Hungry Teeth’:</p>\n\n<p><em>Sorry, that was me. Didn’t mean to scare you.</em></p>\n\n<p>I laughed at their joke and replied:</p>\n\n<p><em>All is forgiven. Just make sure you don’t gnaw on my family or me, or steal my skin or something.</em></p>\n\n<p>That evening, after dinner, I was browsing through the forum when I saw Hungry Teeth had written back: </p>\n\n<p><em>I’ll try, but sometimes I get hungry.</em></p>\n\n<p>Another chuckle escaped my lips, and I replied:</p>\n\n<p><em>If you’re looking for a bite, you can always try my neighbours across the way at number 6. Big family. Nobody will miss them – they’re always causing trouble. Plus their kids are pretty pudgy – nice and tender.</em></p>\n\n<p>A few days went by and I didn’t get a response. Not that I expected one. All jokes had their limit, and ours had obviously run its course. Eventually, I forgot the whole thing.</p>\n\n<p>Police cars would pull into the estate every so often and make their way to the maisonettes across from mine, but that wasn’t uncommon. I don’t live in a dangerous area, but the neighbourhood is dotted with several council homes including several blocks of flats and the maisonettes opposite my house. I’m not saying people in social housing are bad – I grew up in one, so I knew that normally they’re home to good honest people down on their luck. But you can’t deny that social housing can also attract unwholesome people. Like the people in number 6.</p>\n\n<p>Let me tell you about that family. It consists of a wife, a husband, and five school-age kids. They moved in about a year ago and have been trouble ever since. For example, a few weeks ago, the wife came out of her place, marched to the maisonettes next door and began screaming, banging on her neighbour’s door, calling for the occupants to come out because she knows they ‘grassed her up’. The husband was shrieking and shouting threats, and ugly swear words, and the kids were joining in, copying, screaming and swearing and making threats at the poor neighbours until the police arrived and broke the whole thing up. Sadly, this isn’t an uncommon occurrence for them, and police are often at their place breaking up one disturbance or another. I get the impression the wife is one of those people that feeds on drama. I’m amazed none of them have been arrested for their shenanigans yet. I suppose it helps that they toe the line perfectly – they’re loud and boisterous, but they never hurt anyone or damage anything. They’re certainly intimidating when they get going, and when they do, you know you&#39;re probably not going to get much sleep that night thanks to their shrill displays. My husband often comments that it’s like living near a group of overly territorial howler monkeys.</p>\n\n<p>We’ve often debated moving out, but we don’t have the money, and we’ve seen troublesome neighbours like them come and go after one complaint too many. We always told ourselves it wouldn’t be long and they’d be shipped off elsewhere.</p>\n\n<p>One morning I awoke at 4 am because my daughter was up and already causing mayhem. It was my turn to get up with her, so I took her downstairs and began my day, leaving my husband in bed.</p>\n\n<p>As I was making her breakfast, I checked my messages and saw Hungry Teeth had replied in the night:  </p>\n\n<p><em>Thanks for the tip. I couldn’t eat another bite. I’m moving on now. Take care.</em></p>\n\n<p>The message made me feel a little uneasy, but I smiled. I jumped when I heard a knock at the door. I quickly threw on my dressing gown since I was only wearing a t-shirt and knickers, and then answered the door, finding a sombre looking policeman on the other side.</p>\n\n<p>“I&#39;m Inspector Jackson. I’m sorry about the early hour, but I saw your light was on and wondered if I could ask you some questions,” he said.</p>\n\n<p>It was then that I noticed the swarm of police and forensics on the green that lay between the line of terraced houses my home was sandwiched between and the maisonettes. Bright yellow and black tape fenced in number 6.</p>\n\n<p>“Oh god, is everything alright? What happened?” I asked.</p>\n\n<p>“We want to know if you saw or heard anything out of the ordinary over the last few days.” Inspector Jackson’s eyes met mine.</p>\n\n<p>I thought back. I hadn’t heard anything aside from the usual. Except...</p>\n\n<p>The kids at number 6 were usually outside on the green, shrieking like banshees, playing cops and robbers or whatever game they came up with, often not going in until 10pm.  But I realised then that I hadn’t heard them in days – not the kids, nor the parents. I hadn’t seen them either.</p>\n\n<p>“I... no. Actually, I haven&#39;t seen or heard from them for a few days.” I said. </p>\n\n<p>“Did you know the family?”</p>\n\n<p>Again I shook my head. “No. Not well. We just said hi when we put our bins out.”</p>\n\n<p>“When was the last time you saw or heard from them?” The Inspector’s expression was grim.</p>\n\n<p>“I... I’m not sure. The last time was Monday. I think. Yes – yes it was Monday.”</p>\n\n<p>The inspector continued writing in his notepad.</p>\n\n<p>“Is everything okay? Are they okay?” I asked shakily, swallowing, certain I would not like the answer but needing to know nonetheless.</p>\n\n<p>The inspector turned to the house, and then looked at me. I could see he was weighing something about in his mind.</p>\n\n<p>“The family were murdered,” He said at last. “Keep your windows and doors locked. If you see anything or anyone suspicious, call us immediately.”</p>\n\n<p>I nodded numbly and then closed the door, locking it behind me. As I went back into the living room to give my daughter her toast, I heard my neighbour calling me. Our living room opens out to the back garden, and I had the doors open because it was hot despite the early hour.</p>\n\n<p>I trudged onto the patio and saw my neighbour, an elderly woman, leaning over the fence.</p>\n\n<p>“Did you hear about what happened to Number 6?” She croaked.</p>\n\n<p>“They were murdered,” I said quietly, not wanting my daughter to hear. Even though I knew she wouldn’t understand what I said, I felt the words would be somehow toxic, and I wanted to shield her from the ugly reality.</p>\n\n<p>The old woman grimaced. “They were a huge pain in the arse, but nobody deserves to go that way.”</p>\n\n<p>I leaned in closer. “What do you mean?”</p>\n\n<p>“A friend of mine lives above them. She told me everything. Police found the family torn to shreds.”</p>\n\n<p>“Did she hear anything?”</p>\n\n<p>The old woman shook her head slowly. “That’s the strange part. They were dead quiet for days. Not a peep, even from their little hell spawns. She thought they’d gone away.”</p>\n\n<p>I felt the coffee I had drunk that morning try and rise from my stomach, but I pushed it down. “How did they find them?”</p>\n\n<p>I don’t know why I asked the question. It just leapt from my mouth. For some reason, I had to know.</p>\n\n<p>“There was a trail of blood leading from the house to the car park. It stopped underneath a car. Some poor bastard saw it and called the police. The rest, as they say, is history.”</p>\n\n<p>My blood turned to ice, and I had to remind myself to breathe. “What car was it?”</p>\n\n<p>“That old truck that always sits there.”</p>\n\n<p>It felt like a hole opened up beneath me and was trying to drag me down. Trembling, I excused myself and went back inside. I grabbed my phone and opened up the forum message, looking in horror at Hungry Teeth’s message:</p>\n\n<p><em>Thanks for the tip. I couldn’t eat another bite. I’m moving on now. Take care.</em></p>\n\n<p>It couldn’t be – surely it was just a coincidence? Besides, if there really were some strange creature or homicidal maniac living under there, how would it be able to comment on a forum – the exact post about it, no less? I didn&#39;t imagine there was great WiFi under there. Besides, why would it even want to? The more I thought about it, the more I was sure it was just one of those crazy coincidences.</p>\n\n<p>That evening, as we sat down to dinner, the local news reported on the incident, confirming what my neighbour had told me. The family had been found torn apart in their home after a man discovered a blood trail leading from under a truck to their front door. It was thought to have happened in the early hours a day or two ago, but the trail of blood was caused last night when someone or something dragged a body out of the house, across the green and under the old truck in the car park. The body wasn’t found, aside from a few bones like the skull, so police think it was eaten by scavengers. Teeth marks indicated that something had killed and then eaten the family. A representative from the local constabulary spoke to the reporter, claiming it was probably an animal attack (though what animal, they couldn’t say), and advised residents to keep their doors and windows locked and to report anything suspicious.</p>\n\n<p>The only lead they had at the moment was a smartphone found amidst the mess under the truck. It was heavily damaged, though, like it had been stomped on or run over, so it would be difficult to get anything off of it. The police admitted it wasn’t much to go by because they didn’t know if it belonged to one of the victims, the killer, or whether it had simply dropped out of a passerby’s pocket, but they seemed confident they would find more clues soon.</p>\n\n<p>Something sunk deep within me. Had I sentenced a family to death...? No. I couldn’t have.</p>\n\n<p>Hungry Teeth’s last message flashed through my mind:</p>\n\n<p><em>Thanks for the tip. I couldn’t eat another bite. I’m moving on now. Take care.</em></p>\n\n<p>Guilt surged through me. The family at number 6 had their problems, but they didn’t deserve this. Nobody did.</p>\n\n<p>I removed my story from the forum and deleted my account for good measure, and didn&#39;t tell anyone, not even my husband.</p>\n\n<p>It’s been six months since then. The police never found any more clues, and the culprit is still at large. I haven’t been back on the forum, nor has Hungry Teeth popped up on any other forums. Or at least not under that name, anyway. </p>\n\n<p>It took some time, but the neighbourhood recovered. The old rusted truck has been moved, and there’s even a new family living at number 6.</p>\n\n<p>I’ve moved on ... mostly. I’m usually able to convince myself that those messages were just a dark joke with unfortunate timing and nothing more, and I get on with my life. Then there are times when I pass by a car, and I find myself peering into the thick carpet of shadow beneath, wondering if Hungry Teeth is there, or worse, is it just cars it hides beneath, or could it slink under a bed too...?</p>\n</div>\n","author":"kathjoy"}