{"rank":"5","title":"Demon Scars [Part 3]","id":"8jlzxf","url":"/r/nosleep/comments/8jlzxf/demon_scars_part_3/","time":"1526394539000","body":"<div class=\"md\"><p>Part 2 of 8: <a href=\"https://www.reddit.com/r/nosleep/comments/8ifz6l/demon_scars_part_2/\">https://www.reddit.com/r/nosleep/comments/8ifz6l/demon_scars_part_2/</a></p>\n\n<p>&quot;Vietnam&#39;s main weapon was the M14 rifle but was replaced part way through the war in favor of the newly developed M16. </p>\n\n<p>The M16 was designed by Illinois-based ArmaLite but produced for the military by Colt Manufacturing Company. </p>\n\n<p>The &#39;M&#39; in the weapon&#39;s name is a military designation (M1911, M60, etc.).</p>\n\n<p>The M14 was manufactured by Springfield Armory during World War II as a replacement for the legendary M1 Garand. The M1 was standard issue to US and allied forces. </p>\n\n<p>Considered the last true &quot;battle rifle,&quot; the M14 fired a powerful 7.62 NATO cartridge (.308 Winchester) and could be equipped with a bayonet for stabbing gooks.</p>\n\n<p>Since the M14’s design was intended for use in the vast battlefields and trenches of the Great Wars, it didn&#39;t translate well to the tight jungle environment of Vietnam. </p>\n\n<p>Assaults and ambushes often occurred in closer engagements and a long heavy rifle best used at long-distances was not ideal.</p>\n\n<p>The military told the President they needed a lighter weapon and a bid for the next great assault rifle was put forth. </p>\n\n<p>This of course was the M16 but the Americans and the Southern Vietnamese Army still lost the war when the NVA captured Saigon on April 30, 1975. </p>\n\n<p>Two million civilians died probably because the Marines couldn&#39;t tell the innocent farmers apart from Charlie since they all look the same.</p>\n\n<p>I want to buy an M14 when I&#39;m older. Soldier of Fortune magazine featured a version called the M14S which is made in China by a company called, Norinco. </p>\n\n<p>It&#39;s funny that a weapon made to fight communism is now being made by the Chinese. </p>\n\n<p>The M14S is made from old railroad tracks and is very customizable with scopes and heat shields. You can coat the rifle in grease and bury it in the ground for later use. </p>\n\n<p>The benefits of Norinco’s M14S over Springfield&#39;s model are that the M14S costs less and has a better receiver. I also read that a polymer stock is better than wood because wood swells. </p>\n\n<p>During the 1970s, the strategy of warfare was changing and conflicts were no longer decided by capturing large tracts of land. </p>\n\n<p>USA learned this the hard way because those in charge of the Vietnam War were WW2 vets who still measured victory as they did in the past. </p>\n\n<p>Somebody told me that intel wasn&#39;t even provided for areas with less than 100 VC soldiers, so it&#39;s no wonder the US Army got wasted in Charlie&#39;s underground tunnels. </p>\n\n<p>Home field advantage is as important in war as it is in football. </p>\n\n<p>This is because it&#39;s harder to move all your men and resources overseas while the enemy is already prepared in their own country with lots of weapons and supplies. </p>\n\n<p>My uncle served in the Air Force during Nam, but my dad said he didn&#39;t see any real action. I asked my uncle about the war and he told me about agent orange.&quot;</p>\n\n<p>As I finalized the report, Randy drew a picture of a skeleton in army gear pointing a gun at a woman&#39;s head. We used this as our cover page. </p>\n\n<p>The next day at school we submitted our mighty social studies report. The world would not be prepared for our scathing account on America&#39;s greatest atrocities. </p>\n\n<p>Thankfully it was Friday and part of the day would be eaten up by the annual class pictures. We need not be mentally sharp today which was good. </p>\n\n<p>I was exhausted and Randy looked even worse. He said he was plagued by nightmares after I had left. </p>\n\n<p>He explained that he must be undergoing a spiritual metamorphosis but the growing pains would be worth it in the long run. </p>\n\n<p>He seemed unusually cheerful and even a bit giddy. Come to think of it I was woken up through the night by strange sounds coming from outside my bedroom window.</p>\n\n<p>I merely chalked it up to the pressure of the deadline. </p>\n\n<p>We agreed to meet over the weekend at Randy&#39;s house to go over our sacrificial plan and play video games. He wanted to start on it right after school, but I wanted to relax at home. </p>\n\n<p>It had been a long week and I was in need of a break from Randy.\nI went home for lunch and met Randy again in the afternoon for class pictures. He had a new notebook that he spent all morning drawing in. </p>\n\n<p>He showed me ideas he had for the sacrifice and told me how he pictured it going down. </p>\n\n<p>I told him to keep quiet and that we didn&#39;t want anyone getting wind of our operation. He chuckled at the term &quot;operation&quot; and nodded in agreement as he attempted to reel in his enthusiasm. </p>\n\n<p>I reminded him that we had all weekend to iron out the details. </p>\n\n<p>The following morning, I scarfed down some leftover fried chicken before heading out. I figured I would need lots of calories to keep up with Randy all day. </p>\n\n<p>My mom dropped me off at his place where I let myself in. </p>\n\n<p>Randy had been in the living room playing video games. As I got in I noticed that he was once again alone. </p>\n\n<p>I was a bit relieved to know that we had the house to ourselves. We would turn it into our own personal war room where we could plan our attack without any meddling parents.</p>\n\n<p>He had been playing Mortal Kombat on his Sega Genesis. Around him were empty soda cans and various books pertaining to black magic. </p>\n\n<p>He showed me a list of the game&#39;s secret codes and fighting moves that he had proudly photocopied without having to purchase the magazine. </p>\n\n<p>The Mortal Kombat games were unique in that the winner had the opportunity to enter a series of button combinations to activate a &quot;fatality&quot; finishing move. </p>\n\n<p>This would result in violently executing the losing opponent. </p>\n\n<p>What a time to be alive.</p>\n\n<p>I frothed at the mouth when I first heard about the game&#39;s fatalities at school. </p>\n\n<p>I was slightly disappointed that executed character&#39;s deaths were not permanent, and they could be back in action with no penalty.</p>\n\n<p>As we played the game, Randy talked about the sacrifice. </p>\n\n<p>He reiterated that I would have to select the &quot;offering&quot; as I was new to the town and that I had no existing biases towards any fellow targets. </p>\n\n<p>My selection would be pure. </p>\n\n<p>He also stated that this made us less likely of getting caught. He insisted that he would prepare the ritual and that the sacrifice would be performed in his house. </p>\n\n<p>This is where the demon dwelled and he would have quick access to his witchcraft manuals. </p>\n\n<p>Randy understood home field advantage.</p>\n\n<p>I suggested that the target could be lured to his basement under the guise of a gaming tournament. </p>\n\n<p>Here we could subdue the offering and perform the ritual. Randy nodded in agreement. </p>\n\n<p>But how would we dispose of the body? Or if things got out of hand, we could have a serious mess to deal with. </p>\n\n<p>Randy was quick to answer with some ideas he had been spit-balling. </p>\n\n<p>For instance, he planned on putting a pup tent in his basement where we could dismember the body without spilling blood everywhere. </p>\n\n<p>He then thought of encasing the body parts in cement and dropping them to the bottom of the lake. </p>\n\n<p>I argued that we were on a budget and getting the necessary supplies would be expensive. </p>\n\n<p>Furthermore, buying all this stuff could tip off the local hardware store that we were up to something. </p>\n\n<p>Besides, where would we store the wet blocks until the cement hardened? And how could we transport them to the lake afterwards? It was impractical. </p>\n\n<p>I had a better solution. We could perform the ritual in his basement as planned during the night and under the veil of darkness, we could promptly move the remains to the clearing in the woods. </p>\n\n<p>After all, no one ever travelled the forest and we could use the fireplace to burn up any evidence. </p>\n\n<p>The chance of getting caught carrying the body the short distance between the house and the trees was extremely low. </p>\n\n<p>Randy&#39;s eyes lit up. He said that we could pre-dig a hole to bury the body. The woods were sparsely traveled and no one would think to look there. </p>\n\n<p>Also, the forest cannibal could even do the work for us by eating the dead flesh. As long as we had a fire burning we would be protected from its gluttonous wrath. </p>\n\n<p>It was decided. </p>\n\n<p>Randy persisted that the ritual had to occur on March 3rd, which was soon approaching. His excitement quickly took a dark turn. </p>\n\n<p>He made me promise that I had to go through with the ritual with full commitment to the bitter end. His manner began to frighten me. Was he this serious of actually doing it? </p>\n\n<p>Evil men do what good men dream. </p>\n\n<p>What was originally fun and games was quickly losing its appeal. </p>\n\n<p>I tried to backtrack on my involvement. Maybe if I stalled the ritual date, he would lose interest and move on to something else. </p>\n\n<p>I reminded him that it would be cold in March and that the ground would still be frozen making digging nearly impossible. </p>\n\n<p>Furthermore, March 3rd was a school night and we would surely be caught if we were rushed.</p>\n\n<p>Randy sipped his cola and thought it over. As much as he hated breaking his rules of three he had to admit that I was right. </p>\n\n<p>Maybe summer would be better. As long as he had a couple warm months to explore his new-found powers, he would be happy. </p>\n\n<p>Throughout the house I heard a sharp ringing sound. I asked Randy if his mom had returned. He shook his head, she was probably out playing bingo. </p>\n\n<p>I asked about the noise and he said that the ghost of his grandmother would sometimes ping the crystal glassware in the china cabinet. </p>\n\n<p>He explained that she had died in the attic when he was a child. The crystal was her most prized possession in life and her spirit still roamed the house to admire the glassware.</p>\n\n<p>Over summer holidays teenagers often stay out late and sleep over at friends&#39; houses. This could confuse the time of disappearance and weaken any connection we may have to the missing person. </p>\n\n<p>He felt it was a reasonable trade-off and I felt that I had won a major battle. </p>\n\n<p>The pinging of crystal was heard two more times.</p>\n\n<p>With our goals accomplished, we spent the rest of our time playing video games and laughing like normal teenagers. </p>\n\n<p>As the day wore on, I decided to spend the night. I definitely had reservations of staying here, but we were in the midst of a gaming campaign that had no end in sight. </p>\n\n<p>It was easier for me to sleep on the couch and catch a ride home from my parents in the morning. Randy&#39;s mom still hadn&#39;t returned.</p>\n\n<p>Eventually I began to doze off. We shut off the game system and Randy retreated upstairs to his room. I rolled over and went to sleep. </p>\n\n<p>After being asleep for an indeterminate amount of time, I was awoken by the sound of whispering. </p>\n\n<p>It sounded like two people chanting quietly at the same time. The voices seemed to belong to a young male and an elderly female. </p>\n\n<p>I rolled over to see Randy standing a few feet away in the darkness. He was facing me with his head tilted upwards as if he was staring intently at something on the ceiling. </p>\n\n<p>The room was completely dark with the exception of three black candles alit at his feet. </p>\n\n<p>I couldn&#39;t clearly see his face but could see the muscles in his neck move with the stark shadows of the candle light. </p>\n\n<p>They moved in unison of the soft chanting. I had no idea where the second voice was coming from. </p>\n\n<p>In dismay, I sat up and asked what the fuck he was doing. He exhaled and looked down at me. </p>\n\n<p>The voices stopped.</p>\n\n<p>He appeared to be in a trance, like he was sleepwalking. Again, I repeated my question. </p>\n\n<p>He turned and walked to the other side of the room and stopped in front of the window facing the backyard. </p>\n\n<p>I got up and approached him, careful not to knock over any of the burning candles. </p>\n\n<p>He kept staring out the window and appeared oblivious to his surroundings. </p>\n\n<p>When I got near, I gripped his bony shoulder. His shirt felt cold, like he had been outside in the snowy night. </p>\n\n<p>&quot;Do you see it?&quot; he asked. </p>\n\n<p>I stepped forward and looked out the window, letting my eyes adjust to the blackness. </p>\n\n<p>&quot;Over there,&quot; he said. And there it was. </p>\n\n<p>In the big tree, I saw three bodies hanging from the branches. Three distinct human shapes silhouetted at the end of three ropes. </p>\n\n<p>They swayed gently in the moonlight. </p>\n\n<p>I&#39;m not sure if my eyes were playing tricks, but there appeared to be a fog-shrouded figure floating around the yard. </p>\n\n<p>It seemed to dart in between the bodies and move close to the window where we were standing. </p>\n\n<p>I felt as if I had frozen in place while watching this grotesque display.</p>\n\n<p>Not wanting to look but unable to blink, I let my eyes focus on the window glass. By staring past my reflection, I focused on the three candles alit on the floor behind us. </p>\n\n<p>I was able to block out the figure and the three hangmen but what I witnessed next was even more horrifying.</p>\n\n<p>In the reflection I clearly saw the candles flicker, influenced by some mysterious breeze. </p>\n\n<p>Suddenly the face of a withered old woman appeared over my shoulder. The candles went out and all was black.</p>\n\n<p>The next thing I remember was waking on the couch. It was now morning and the room was still. </p>\n\n<p>No candles sit on the floor and the big tree in the yard held nothing. I immediately got my shit together and left. </p>\n\n<p>I didn&#39;t even bother calling for a ride; I would walk home. </p>\n\n<p>As I opened the door and stepped outside, I heard the sound of crystal pinging behind me.</p>\n\n<p>Part 4 of 8: <a href=\"https://www.reddit.com/r/nosleep/comments/8k3b5m/demon_scars_part_4/\">https://www.reddit.com/r/nosleep/comments/8k3b5m/demon_scars_part_4/</a></p>\n</div>\n","author":"Rich_Brady"}