{"rank":"72","title":"Avoid the Yellow-Eyed Doorways in Abandoned Buildings","id":"8jm29c","url":"/r/nosleep/comments/8jm29c/avoid_the_yelloweyed_doorways_in_abandoned/","time":"1526395056000","body":"<div class=\"md\"><p>My name’s Jake. I live in Ireland and grew up in the countryside around a lot of nature, fields, and a nearby forest. I loved exploring places as a kid; taking walks through the forest with my dad, climbing the trees on the outskirts of my families’ farm and getting muddy after finding somewhere new by crawling into uncharted fields; I was pretty adventurous. Eventually, life happened; my parents got divorced, we had to sell the farm, and I moved to Dublin with my mum- I was eighteen at this point. There aren’t really any big forests in Dublin as you may have guessed, so I turned to urban exploring to quench my thirst for adventure. Urban exploring has this very unique desolate vibe to it that I find strangely beautiful. After a while I made friends, and naturally those friends threw parties. I’d like to talk to you about one of these parties in particular, one I don’t think I’ll forget for a long time. I’m telling you this because I want to warn you all about something, I want you all to be safe.</p>\n\n<p>The party in question took place a year after I started urban exploring. At this point I was nineteen, in college in Dublin and living in dorms. My friend James was throwing a party at his place; James was pretty popular and doing a different course to me, so I always met a lot of interesting people whenever I attended his parties. At this one party though, James introduces me to these three people; David, Sean and Sara.</p>\n\n<p>“Here Jake, these two lads and Sara like exploring shitholes too, maybe yous could trade ghost stories.&quot;</p>\n\n<p>James always has a way with words when he has too much to drink. From my understanding, David and Sean explored places together, and Sara had only just been introduced to them a couple of minutes before I was. We all sat down in a quiet part of James’ place and discussed our favorite places to explore over drinks. The conversation was great- I had never actually had the chance to have a proper discussion about one of my favorite things to do before. Eventually, the topic did turn to “ghost stories”, as James put it.</p>\n\n<p>“So, what’s the spookiest thing you’ve all seen while exploring? I bet I have the best story” Sara boasted.</p>\n\n<p>“Absolutely no way you have the best, Sean and I have seen some shit”. David said that in a grave tone which piqued my interest. Sean looked a little nervous and poured himself another drink.</p>\n\n<p>“I’ve only seen a couple of sorta creepy things, no serial killers yet” I joked.</p>\n\n<p>The group decided to start with me, because I admitted to having the least scary story, then Sara and David flipped a coin to see who would speak next. Sara would share hers after me, and David and Sean’s story would go last. I began my story.</p>\n\n<p>“So back before I started exploring areas near the college, I used to explore some abandoned places around the outskirts of the city. There was this really creepy abandoned hospital that I was exploring, all boarded up from the outside and very decayed on the inside. So, I’m exploring this place, admittedly during the day because it was creepy as hell, when I come across this strange doorway on the ground floor. I’m sure you’re all aware of the ones I’m talking about, the type that just lead into complete darkness down a set of stairs; the way to the basement…or so I thought at first. You see, I had already managed to find the way to the basement because I found an old map of the place; the basement entrance was on the other side of the ground floor. There was no place on the map showing another way down to the basement. In other words, what the fuck was I looking at? There was really strange graffiti around the edges of this doorway leading down into God knows where. Four horizontal lines were on either side of the doorway that continued diagonally down into the darkness; they looked like lines on a blank sheet of music. Small red circles were sporadically placed around the doorway. Lastly, there was a crudely drawn yellow eye above the doorway itself- almost looked like it was looking right at me. Yeah I got weird vibes from that so I decided that was enough exploring and left. No ghosts or anything, just a little weirdness. Felt like I was being watched though.&quot;</p>\n\n<p>The group fell silent. Sara had her hand over her mouth in shock; David retreated into himself and seemed to be thinking. Sean was pale white, he seemed to sober up complete after hearing my story.</p>\n\n<p>“Jesus I didn’t think it was <em>that</em> scary” I said.</p>\n\n<p>“I…I’ll be back, need the bathroom.” Sean hastily got out of his seat and left for the toilet.</p>\n\n<p>“So… onto mine.&quot; I couldn’t tell if Sara was excited or anxious when she said that. She began her story.</p>\n\n<p>“One time I was exploring an abandoned psychiatric ward at night- I like the thrill of midnight exploring. My favorite thing is taking photos of urban decay for a blog I run. I entered through the basement by an old broken window. I had a flashlight, a camera, a phone and a friend waiting on me in a car outside just in case. I took a couple of photos of the basement. The camera flash and flashlight provided me with a good layout of the place. Pale green peeling wallpaper, loads of old boxes, a lone set of wooden stairs leading upwards and rusted metal shelves; perfect for the blog. This is where things got freaky. I went up the stairs to what I assumed was the ground floor, what with me coming from the basement. Only, when I reached the top of the stairs, it wasn’t the ground floor. <em>I was back in the basement</em>. I came up through a previously non-existent flight of stairs near my entrance window. That sounds crazy but I’m serious. I figured maybe there was just a weird floor layout to the place. I went up the stairs again but found myself still in the same basement. I went back down a floor; I was still in the same basement. Naturally I started to doubt my sanity, and then I get a call from my friend waiting outside. She said to hurry up because I’ve been down there for hours! That’s impossible, I told her, I had only been down there twenty minutes, but my phone time confirmed that she was right. Two hours had passed. I was pretty unsettled so I headed over to the window I came in through. As I was about to climb out, I heard this noise, it sounded like metallic knocking echoing from far away- to my left. I spun around and took another picture to illuminate the room for a split second. Nothing was there…apart from a new doorway to my immediate left. It was solid wall before…but it was there now...&quot;</p>\n\n<p>I froze. David did as well, he was darting his eyes between Sara and I. Sara’s voice became quieter, as if the act of remembering sucked the confidence out of her.</p>\n\n<p>“…the doorway led straight down into darkness. Strange markings were around it. A yellow eye was above it. I decided to take one last picture with my camera, because I’m an idiot; right down the new magic doorway. The camera flashed went off and… well… I woke up outside the window I had crawled in from. It was morning by that stage and my friend rushed over to me crying. She thought I was dead!”</p>\n\n<p>Sara seemed distressed now; I could tell she was panicking. I decided to put my fear and questions aside and got her another drink- she looked like she needed it. David spoke carefully and sounded very concerned.</p>\n\n<p>“Sara, what did you see?”</p>\n\n<p>As I was getting the drinks, I heard Sara speak.</p>\n\n<p>“I couldn’t remember when I woke up outside. I looked at the photos on my camera after I copied them to my laptop and the last one I took of the doorway was blurry, like the camera was shaking or moving a lot during the picture being taken- it made it impossible to make out anything. But, I…I do feel like there was something down there. To make matters even worse, when I took the photo of that doorway, it felt like something was putting its hand on my shoulder when I blanked and woke up. At night when I close my eyes to sleep and see the darkness, sometimes it reminds me of that doorway, and I can’t shake the feeling of something being down there in the darkness- I could feel it.”</p>\n\n<p>I returned to my seat and gave Sara her drink. Sean re-joined the group and sat beside David; a little more color was in his face. He gave David a curious look and David nodded his head in return.</p>\n\n<p>“Yep, Sara too.&quot; David’s tone sounded almost defeated.</p>\n\n<p>“Fucking hell...&quot; Sean muttered.</p>\n\n<p>David turned to Sara and I.</p>\n\n<p>“Well, I bet you can guess what our story’s about.&quot;</p>\n\n<p>Sean was thinking to himself for a couple of seconds, as if he was carefully planning his words, then he told us what happened to him and David.</p>\n\n<p>“So this happened about a year ago when David and I lived in Newry, before we moved here for uni. David and I had explored a lot of places, and we videoed most of our adventures. We were trying to make a YouTube channel out of it, just a fun little paranormal investigation type thing. Eventually we heard about this abandoned prison in Northern Ireland through some online forums, apparently loads of prisoners died in there during The Troubles. We decided it was perfect for the channel and went out there with some camera equipment and our friend Aaron who usually helped us with filming. David and I were the presenters; we built it up as this really haunted place and Aaron filmed. It was actually a lot of fun, until we came across…well I’m sure you know by this point what we eventually found on the second floor- in one of the cells. We thought it would look really cool on video, but Aaron looked confused. He said he couldn’t see the doorway through the camera. We thought he was messing with us, but we looked through it too and instead of those stairs leading down, instead of that yellow eye and those markings on the sides, we saw just the solid wall of the prison cell. We knew the layout of the prison- we researched it before-hand; if a doorway was at the back of this particular cell, which it was, it would just lead straight outside as this cell is at one edge of the building…but it just led down somewhere, like it was ignoring the geography of the surroundings.&quot;</p>\n\n<p>I couldn&#39;t believe what I was hearing, that three other people encountered the same thing I did in different locations- it sounded impossible, but there was real fear in that room. I could tell the others were genuine. Sean continued.</p>\n\n<p>&quot;At this point we all felt very uneasy. My gut was telling me to get out of there, David agreed we should leave. Aaron was scared, but fascinated. He told us in all the time he had filmed for us he had never thought we’d find something actually paranormal. He convinced us that if we get proof, the channel could actually take off. To our shame he convinced us to stay. It was clear what the next step was. We needed to go down the stairs. Then…”</p>\n\n<p>Sean began to stutter and had trouble articulating the next part of the story. David put his hand on Sean’s shoulder before Sean got up and left; David continued while Sean got another drink.</p>\n\n<p>“Then we decided we would all go down the stairs together, none of that splitting up bullshit. It was a pretty narrow and we needed to go down single file. Aaron took point, as he was carrying the camera with the attached light on it; Sean was next, then me at the back. Unfortunately Aaron’s camera started acting weird and wouldn’t record anything. We descended slowly and carefully, the steps were steep and made of what looked like metal- they made a strange metallic sound with each step we took. Ever smell something so old it smells like its age? Well apparently this place was ancient. The same markings that were on the sides of the doorway were all over the walls of the stairway. Four horizontal lines on either side of the doorway stretched down diagonally into the darkness, surrounded by red circles. Eventually, we hit the bottom. We heard crunching beneath our feet. Sean and I turned on our own flashlights and looked down. Leaves. We were walking on leaves. The floor itself was soil. We were in a narrow hallway though. So narrow we needed to go forward single file like the stairway. The lines on either side of the doorway seemed to indent themselves into the wall now. We came to the end of the hallway after about five minutes of walking. There was an old, rusted metal door in front of us. It kind of reminded me of those bulkhead doors you get on some ships. It was covered in the lines and red circles, with that big yellow eye above the door. What’s worse was the writing around the door.</p>\n\n<p>‘DON’T OPEN ME’</p>\n\n<p>-written at least a dozen times. My heart was racing, every part of me told me to leave- something was very wrong and I feel like Sean and Aaron could sense that too. We decided this was as far as we were willing to go…until we heard a distant noise; a bang coming from behind us, far, far away…like a door closing.&quot;</p>\n\n<p>Sara and I were on the edge of our seats; I could tell her mind was racing with questions, even trying to rationalize things like mine was. We completely forgot we were even at a party at this point. David was getting more agitated the more he talked.</p>\n\n<p>“Aaron became frantic, said the camera viewfinder was working again but it wasn’t showing the camera view. It was showing the perspective of something staring at the now closed prison cell door at the top of the stairs. We didn’t believe him, but he showed us. That was when we knew we were definitely in some kind of danger, whatever it was it could see in the dark. We looked at the viewfinder, then the door in front of Aaron.</p>\n\n<p>‘DON’T OPEN ME’</p>\n\n<p>-my mind kept repeating that phrase over and over. I had the viewfinder now, as I was the one at the back, closest to the stairs and therefore closest to whatever the hell was at the top of the stairs. That’s when the knocking on the other side of the bulkhead door started, which caused a feeling of impending doom to set in to the pit of my stomach- I imagine Sean and Aaron felt the same way. I decided I would call out if anything happened on the viewfinder, while Sean and Aaron argued over opening the door with something obviously on the other side of it, or taking our chances going back up the stairs. Then, whatever was at the top of the stairs, turned around and faced the doorway we went down. It looked at the yellow eye above the doorway, before lumbering down the stairs. We all heard the sound of the strange metal steps from earlier echo through the hallway; we were trapped. I was looking at the viewfinder and seeing the things four, pale, long fingers run across the diagonal lines going down the stairs. Aaron and Sean were shouting now as the metal footsteps got louder. The knocking became faster against the metal door. I looked away from the camera and told them to calm down.&quot;</p>\n\n<p>David stopped to catch his breath and take a swig of beer. He sighed and continued.</p>\n\n<p>“Everything was quiet now except for the knocking. I looked back at the viewfinder; <em>it</em> was at the bottom of the stairs now. It looked down the dark hallway that we were on the other end of. Its four long fingers on each hand fit into the indents of horizontal lines on either side of the hallway walls. I could hear the faint sound leaves crunching incredibly fast- coming towards us. The viewfinder looked like this thing was <em>flying</em> down the hallway to us. The crunches got louder. Aaron panicked and decided to open the bulkhead door in front of him. The valve made a metallic screech as it turned; the knocking evolved into something hurling itself at the door from the other side. I’ll never forget the sound of our own screams. The crunching became very loud, I was sure I’d die. Aaron heaved the door open, and I remember seeing some sort of shadow come out from the other side of the bulkhead door. That’s all I remember. Sean and I woke up just outside the prison…without Aaron. Sean had some scratch marks on him…w-why didn’t it kill us? Why Aaron? Why only hurt Sean?....I just…”</p>\n\n<p>David’s words failed him- it was clear he still thought about what happened often. Sara and I tried to comfort him. Sean returned and we decided to change the subject from scary experiences to something else. We all agreed we should stop urban exploring, and we all decided to keep in touch with each other…just in case. The party was winding down, and we enjoyed the night to the best of our ability, although none of us were in any particular mood for drinking and fun. Sara left first, then David and Sean. Before Sean left though, he cornered me in a quiet place.</p>\n\n<p>“Look, I know when I was gone David told you what happened, what we saw, and it was every bit as horrible as he described it. I know because he’s told me his perspective multiple times. But it’s not exactly true. Whatever that thing was, it got David first, then me. David was already out for the count by the time Aaron opened that door, but I saw what was on the other side of that door…”</p>\n\n<p>Sean began to tear up- it was hard for him to talk.</p>\n\n<p>“...it was so <em>cold</em> and Aaron…”</p>\n\n<p>Sean fought the tears as hard as he could.</p>\n\n<p>“…and then whatever was on the other side of that door tried to drag me in and scratch me and this fucking things long fingers covered my eyes from behind me.”</p>\n\n<p>I didn’t know how to react at the time; I still don’t know how I could have. I just stood there, staring at this poor man telling me something that was obviously very traumatic for him. Sean wiped away the tears.</p>\n\n<p>“I don’t know what I saw, I think I might be crazy, but as scary, and strange as that thing with the long fingers was, I think it was trying to stop that door from being opened, and not trying to harm us…I’ve never told that part to anyone before…David thinks the long fingers thing killed Aaron, even though Aaron was the furthest away from it. Everyone else believes Aaron just went missing and that the things we were saying were just sick jokes!”</p>\n\n<p>I tried to console Sean, but he grabbed me by the shirt and looked me right in the eyes. Sean had the wide- eyed look of someone who had seen something truly unimaginable, he was completely inconsolable. I never saw it in him before, but he was definitely, well, ‘unhinged’ a little. He said something to me that I will remember for the rest of my life. He drew close to my face and spoke quietly, as if he was afraid of being overheard.</p>\n\n<p>“I saw something as the door swung open fully for a split second. Right before the long fingers got me. Sometimes I remember it as this blur, other times as a vague figure; I knew it was staring at me- that was certain. I felt its presence in my bones. That horrible shadow that enveloped Aaron- it clung to him. It muffled his screams into silence and he fell into the arms reaching out of the opened door…so many arms. I could see Aaron’s eyes though, wide open with terror, looking at me to do something; they screamed for him when he was unable to. That’s when the thing with long fingers covered my eyes- the last thing I remember is the sound of that door being shut tight.&quot;</p>\n\n<p>Sean left quietly after I managed to calm him down, which took a very long time.</p>\n\n<p>That was a while ago, I’m 20 now and I’m still not sure if I believe Sean. As real as it seemed at the time, typing it out now makes it seem like madness to me. I try not to think about it nowadays anyway. Sean recently entered a psychiatric ward, and I guess that made me want to write this all down- get it out there, maybe help someone. I choose to believe that what he told me was the first signs of schizophrenia or something similar. I&#39;d rather believe that than believe whatever he saw was real and it slowly drove him insane. Whatever the case, I know what I saw was real- that doorway exists at least. I urge you all to avoid it if you see it while urban exploring. If you take away anything from this, avoid the yellow-eyed doorways leading downwards, it’s just not worth it whatever the case may be.</p>\n\n<p>Stay safe.</p>\n</div>\n","author":"Notaninvalidusername"}