{"rank":"1","title":"Insomnia","id":"8jmbzo","url":"/r/nosleep/comments/8jmbzo/insomnia/","time":"1526397149000","body":"<div class=\"md\"><p>It was a chilly night in December in 1954, when the Bennett brothers moved to an old house in London. The journey to their  new home was long, the road did not have any illumination and at both sides there were abandoned houses, which seemed to be left in mid construction. Rain covered the city in this foggy night and the wind angrily hit the trees leaving a humming sound in the air, it could almost be confused by wolves. When they arrived, each one chose the room of their liking, Frank chose to stay in the last room which is at the very bottom of the house, the one painted with crimson red. Entering, he could not help but noticed the strangeness in that room. It was like a heavy object fell on top of him, it was difficult to breathe. He thought someone was in there, observing him, yet he did not pay it any attention because of the tireless from the long travel.</p>\n\n<p>When the night fell, the house was filled with complete silence and only the owls could be heard, he fell asleep by merely touching the mattress. However, when the clock hit 3:00 am, Frank was awoken by a freezing cold hitting every inch of his skinny and bony body, his body couldn&#39;t stop trembling no matter how much he covered with the bed sheets.</p>\n\n<p>In that moment the silence was replaced with whispers, a never stopping ringing his ears; a warm breath on the right side of his face despite the unfriendly, cold temperature. He closed his eyes harshly hoping that maybe it was just his imagination and if he could think of anything else the terrifying noises would stop. Nonetheless, with each hour that passed his senses became overly acute, he figures out there was no alternative but to stay awake.</p>\n\n<p>Days passed and after the first night Joseph had never seen him again, he thought that he was just having a rough time trying to adapt to his new surroundings but two and a half week passed and no matter the times he knocked on his door before, he would not answered. This time though, Joseph, determined, walked with a firm step towards his little brother&#39;s room.</p>\n\n<p>He abruptly stopped when he heard a loud cry, it was not a cry from sadness or pain; it was a scream of mortal terror, the sound of a soul tearing itself within the body that was holding it. He raced and opened the door with a loud thud, the room was pitch dark and the veil of the curtains flew while the strong breeze entered the open window. The only source of light was the thunders which stroke from time to time thus illuminating the now horrific figure of Frank who sank at the edge of the bed.</p>\n\n<p>Joseph was mad concern about his brother, guilt was eating him from the inside; how could he let this happen! Oh brother, I am such a prat! he thought as he observed him with awe, he did not look human anymore, he was a monster as far as he could see. He looked older, his ebony hair was longer and messy, his eyes were drawn to the nearest red velvet; just below were his dark bags making contrast with his pale skin, his nails were very long and his cracked lips trembled. It looked like all these days he had not eaten anything from the looks of his marked bones.</p>\n\n<p>Joseph moved cautiously towards Frank, slowly meeting his eyes but before he could do anything else something threw him to the floor and without being able to react he felt his sharp teeth pierce through his skin and as soon as it happened h let go a scream each part of his body felt the pain that his dear brother was causing him, no, he was not his brother anymore; he was a beast.</p>\n\n<p>The torrent of blood slid down his back were the holes has been made, he looked at the ones on the floor wit horror and touched it with trembling hands, but suddenly felt a large tongue lick all of it on his back followed his flesh being detached from his body, more and more. His arms, then his legs, tearing the skin off his face with his hands savoring every piece that he takes until just the bones are left. There he was, in the middle of the dimly, dark room whispering to himself:</p>\n\n<p>&quot;I must stay awake&quot;</p>\n\n<p>&quot;I must stay awake&quot;</p>\n</div>\n","author":"Wallflowr123"}