{"rank":"2","title":"My younger sister is possessed ?","id":"8jmfnz","url":"/r/nosleep/comments/8jmfnz/my_younger_sister_is_possessed/","time":"1526397937000","body":"<div class=\"md\"><p>So I have lived in the same house for the past 12 years. My youngest sister is 7 years old. She does odd things here and there that make me question wether or not she is possessed or being influenced by a entity or not. First I want to talk about my experiences in this house when I was about her age, hopefully it gives some insight on why I think she’s possessed. </p>\n\n<p>When I was about 6 I was put into foster care. Then a year later I was adopted. We were living in a house and had to move to our current one because we needed more room. (As they not only adopted me but my older sister as well). Anyways I was 7 almost 8 when we finally were all settled in this new house. As a child I had never been exposed to any paranormal activity, until we moved here. The first thing I do recall is having bad dreams, I believe that’s how it started. I remember going downstairs and sleeping in my parents bed (or even on their floor sometimes) because my dreams were so horrifying. (This was years ago so I don’t remember details of the dreams I just know they would make me incredibly scared). </p>\n\n<p>Then I started to see things..... well a young girl and a boy. I was a weird child and didn’t make friends easily so I often would try to talk to these two and for some reason thought it was normal. They just sometimes showed up and quickly disappeared or I would see them walk down the stairs and vanish.  I told my mom about this and she (to this day) makes fun of me for having imaginary friends. As I got older I didn’t see them anymore, but I felt their presence. </p>\n\n<p>When I first saw the boy and girl I felt no evil or bad but as I got older it didn’t feel right that they were in my home. About the time I began despising the two entities, they stopped showing themselves to me. I would get touched though, especially at night. I remember (on multiple occasions) my blankets would be pulled off me as I lay in bed. My hair would get pulled or moved, I would feel touched on my arms and sometimes I would have small scratches in odd places with no explanation. Anyways those are just some things I experienced as a child. I know there are entities here in my home and it’s part of the reason I think my sister is possessed or being influenced. </p>\n\n<p>She’s 7 almost 8 and she’s often sitting in her closet talking to <em>seemingly</em> nobody. When you ask her who she’s talking to she simply doesn’t answer or yells for you to go away. She’s recently become very mean, calls me a bitch and gets physically abusive towards me and our other siblings (for no reason at all). She doesn’t do her usual activities either . She doesn’t want to play games or go outside or even do arts and crafts (which she loves). She has no interest in doing anything she loves. What really caught me though is  one day we were in the kitchen together and she was helping me make toast and out of the blue she calmly says “the devil has awaken” when I asked her what the hell she was talking about she just repeated it. My history with these ghosts (or whatever they are) Weren’t harmful to me (that I recall) they just scared me. With my sister though... I think something dark resides within her because she is changing in ways that scare me. My brother and I are the only ones who seem to notice it though. </p>\n</div>\n","author":"iratella"}