{"rank":"1282","title":"I met my boyfriend on Craigslist","id":"8jmwgd","url":"/r/nosleep/comments/8jmwgd/i_met_my_boyfriend_on_craigslist/","time":"1526401471000","body":"<div class=\"md\"><p>“He <em>really</em> bought you that diamond bracelet?”</p>\n\n<p>I get why Rachel was skeptical. The nicest thing Mike ever got her was a pizza slice with everything on it. </p>\n\n<p>“How did you meet him?” Theresa asked, without a smile.</p>\n\n<p>“At Starbucks. He randomly sat down next to me, and we just started talking.”</p>\n\n<p>Okay, that was a lie.</p>\n\n<p>The truth was – I met him online. Specifically, Craigslist. Yeah, I know what you’re all thinking. <em>What, you can’t get a guy to like you at school?</em></p>\n\n<p>And, well, no. I can’t.</p>\n\n<p>I even asked out some guys. It didn’t end well. Kevin apparently had a girlfriend, though I never saw him with her. Jackson wasn’t into “my type,” whatever that means. And Alexander just gave a flat-out no, and never talked to me again.</p>\n\n<p>So, soon enough, I found myself browsing the personal ads of Craigslist. And after scrolling through some weird ads, I came across something real.</p>\n\n<blockquote>\n<p>Teenage guy seeking nice girlfriend - m4w - 16</p>\n\n<p>Hi there. my name is Matt and I’m a sophomore in high school :) I’m looking for a girlfriend. I’m pretty shy in real life, so I haven’t even been on a date yet! lol. I do track&amp;field at my school and like to play video games (Fallout yeah!!!).</p>\n\n<p>btw personality is much more important than what you look like. I want to laugh and have fun with my girl, not watch her apply makeup all day lol.</p>\n</blockquote>\n\n<p>We hit it off. He was funny, smart, and just <em>got</em> me. After a week, he mailed me the bracelet. After two weeks, we were basically in love.</p>\n\n<p>And, tonight, I was going to meet him for the very first time.</p>\n\n<p>At 10pm, I slipped into the lacy underwear I stole from my sister. At 10:30pm, I snuck out the window and walked the two-and-a-half miles to his house. His parents were out of town, he said, and we’d have the place all to ourselves.</p>\n\n<p>When I finally got there, I had to double-check I got the address right. It wasn’t a sprawling brick mansion, like I had pictured, from the bracelet and talk of his parents’ wealth. Instead, it was a grimy little house, with an overgrown yard and tacky garden statues.</p>\n\n<p><em>Clank. Clank. Clank.</em></p>\n\n<p>I hit the knocker three times. One of the lights flicked on. “Come in,” a voice called, from deep within the house.</p>\n\n<p>My heart racing with excitement, I turned the knob, and walked inside.</p>\n\n<p>The living room was a mess. The couch was covered in papers. And on the kitchen counter sat a tub of bleach and some dirty rags. The whole house reeked, too, of something foul. A putrid mix of chemicals and rotten food.</p>\n\n<p><em>Maybe I should leave,</em> I thought. But that was quickly stomped out by the excitement of meeting Matt. “Hello?”</p>\n\n<p>A figure walked out from the back room.</p>\n\n<p>But it wasn’t a teenage boy. Instead, it was a towering, gray, bearded man. Despite the condition of the house, he was well-dressed – in a neat button-down and khakis.</p>\n\n<p>He broke into a smile. Yellow, crooked teeth. “You must be Sami. I’m Mr. Johnson, Matt’s father.”</p>\n\n<p><em>But Matt said his parents would be out of town.</em> My heart pounded in my chest. “Uh, where’s Matt?”</p>\n\n<p>“He’s at the diner, waiting for you!”</p>\n\n<p>“But he told me –”</p>\n\n<p>“Oh, no, you must’ve gotten mixed up. He wanted to meet you at the <em>diner</em>, so you two would have some privacy from me. But I can give you a ride over!”</p>\n\n<p>“I think maybe –”</p>\n\n<p>“Come on, he’s so excited to meet you!”</p>\n\n<p>“No. I’ll come back tomorrow.” I turned my heel, and started towards the door – quickly, in fast, racing steps –</p>\n\n<p><em>Thump.</em></p>\n\n<p>Strong arms yanked me back by the waist. His wild eyes and yellow teeth flashed in my face.</p>\n\n<p>“Get off me!” I screamed. “Help! Someone –”</p>\n\n<p>But I felt the cold sting of metal against my neck.</p>\n\n<p>“Make any more noise, and I’ll kill you,” he growled.</p>\n\n<p>He took one of the rags from the sink. Pulled it around my mouth, gagged me. Then he bound my wrists and threw me over his shoulder. I kicked and screamed, but the noise came out as nothing more than muffled squeals.</p>\n\n<p>“Another girl, just like you, has a date with <em>Matt</em> tonight,” he whispered, as he walked towards the door with me. “I’m going to bring you and Britney to the abandoned farmhouse out on Alston Rd., and then we’re going to have some fun.”</p>\n\n<p><em>Thud.</em></p>\n\n<p>I was thrown into the trunk.</p>\n\n<p><em>Slam.</em></p>\n\n<p>The lid came down.</p>\n\n<p>The car rumbled beneath me. The tears fell hot and fast; cold sweat soaked my shirt. <em>How was I so stupid?!</em> I thought. <em>I actually thought some guy on the internet was the real thing? That he liked me?!</em></p>\n\n<p><em>Now I’m going to die. Oh, Mom… Dad… Theresa, Rachel…</em></p>\n\n<p>I fell against the side of the trunk, as the car swung in a turn.</p>\n\n<p><em>And that other girl. Britney. If only I could warn her…</em> My sobs were muted against the gag. <em>She’s going to die, too, with me. She just wanted a guy to notice her… like me…</em></p>\n\n<p>The car halted to a stop.</p>\n\n<p>I tried to scream. I tried to thump against the sides. I tried everything I could, to make as much noise as possible. Maybe <em>someone</em> would notice.</p>\n\n<p><em>Slam.</em> I felt the front door close as he got out. <em>No, don’t do it. Run, run, run…</em> I thought, as if I could somehow warn her through my mind.</p>\n\n<p>But then I heard something else.</p>\n\n<p>Shouting. Muffled through the metal, but I could still make out the words:</p>\n\n<p>“Hands in the air!”</p>\n\n<p>And then – <em>crack!</em> – the trunk popped open.</p>\n\n<p>There stood a police officer.</p>\n\n<p>“He’s got one in here!” he yelled.</p>\n\n<hr/>\n\n<p>By some miracle, “Britney” had been a sting, set up by the police. After searching Johnson’s house, they found three bodies in the basement. Of girls my age. Probably desperate, outcast, and feeling like they finally found true love in Matt.</p>\n\n<p>As for me?</p>\n\n<p>I’m grounded basically forever. The bracelet turned out to be a five-dollar fake, and my sister is still looking for her missing underwear. I’m going through counseling, but things are looking up.</p>\n\n<p>There’s even a guy in my class who seems to like me.</p>\n\n<p>But don’t worry –</p>\n\n<p>I’m never going to meet him at his <a href=\"https://www.youtube.com/watch?v=y7yQ5o0050k\">house.</a></p>\n\n<p><a href=\"http://blair-daniels.com/\">B</a></p>\n</div>\n","author":"BlairDaniels"}