{"rank":"34","title":"My best friend and I tried a new smoke spot to impress the cool kids, now I'm scarred for life.","id":"8jn24s","url":"/r/nosleep/comments/8jn24s/my_best_friend_and_i_tried_a_new_smoke_spot_to/","time":"1526402665000","body":"<div class=\"md\"><p>High school was always kind of shitty, but at least I had my two best friends: Mikey and weed. We were your typical B-List high school stoners. We’d buy a quarter ounce for an inflated $90, and it’d last us a month, if not less. You wouldn’t assume that by the way we talked to the more popular stoners in our grade, though.</p>\n\n<p>They knew we smoked and sometimes they’d pity us enough to let us smoke with them after school. We’d sit in the basement of Tony, their ringleader, smoking their $500 Illadelph bong as they entertained us with their stories of wild parties, close calls with cops, and all the girls they were hooking up with nightly. We’d sit there like chumps, making up shit like smoking an ounce in one night. They obviously knew we were lying, but they were nice enough to give us a casual “sick, man,” continue the sesh, and never called us out on it. </p>\n\n<p>One April night as we ascended from Tony’s stuffy basement into the cool, humid air, I decided I was done making up stories.</p>\n\n<p>“We need to do something risky next time we smoke,” I told Mike as we sparked up our American Spirits like the indie teenage degenerates we were.</p>\n\n<p>He agreed and throughout the week we planned our smoking extravaganza. We decided on an abandoned World War II bunker a couple miles outside of our town. I’d only been there a decade earlier with my Dad, but I knew it was the place. We each told our parents we planned to sleep at the other’s house, but we were going to sleep in the bunker. We even bought a whole half-ounce for our escapade. Needless to say, every time I saw Tony I hyped up our weekend (still fibbing about the amount of weed of course,) and he actually seemed genuinely intrigued for once and told his friends, who mentioned it every time I passed them in the hallway. I actually felt relevant for once.</p>\n\n<p>When Friday night came around, I walked out of my house at 9 PM as always, but this time felt different. I biked to Mikey’s house and he looked even more excited than I was. </p>\n\n<p>Mikey and I biked the 3 miles in what seemed like minutes and we saw our Valhalla. Draped in graffiti of all colors, time had apparently not been kind to this once heavily protected haven. As we descended down the rusty ladder, the bunked wreaked of shit and overall repulsiveness. In the back of my mind I was regretting our decision, but we were too far in to stop now. </p>\n\n<p>As soon as we toked up our resin-filled crack-pipe, though, the anxiety and smell went away as we blasted Frank Ocean and Pavement and surprisingly smoked most of the half as we watched the smoke billow from the ladder hole like a chimney. Our lightweight asses even got crossed off the six pack of Coors Light Mike stole from his Dad. We were finally having our night.  </p>\n\n<p>We passed out without even setting up our sleeping bags. I woke up to a warm substance dripping from the top of the bunker having to piss like a racehorse and extremely dehydrated. Still crossed I struggled to turn my head towards the ceiling trying to collect some of the moisture from the ceiling. Terrible decision. The creature standing above me hasn’t left my constant night terrors since that night. It stood at around eight feet with a violent tinted body and a lime green glow where its extremities connected to its torso.  a perfectly spherical head rested on its straight shoulders with what seemed like indents all over its face. As soon as it saw my face it released a high-pitched whistling sound as about 20 mini green Venus fly traps with spikes as teeth emerged from the gaps in its face. I tried to kick it away, but it latched onto my legs. Mike yelped and grabbed our smoke bag and left, what a loyal friend. His ruckus distracted the beast enough for the beast to let go of my leg and shot its face tentacles towards the ladder, but unfortunately barely missed Mikey’s legs. </p>\n\n<p>My entire lower body stung like a million red ant bites at once, but the pure adrenaline allowed me to react and dive out of the slit at the front of the bunker. Luckily it was only a few feet drop so I was only scraped to hell, so I lunged towards my bike, which had been knocked down by my former friend.</p>\n\n<p>As I picked up my bike all the piss in my bladder was released as the monster jumped so high vertically it would have made any NFL scout cream their pants at its athletic potential. I pumped my feet at a speed unimaginable as the creature sprinted fast enough to get close enough where it seemed like we were racing. I realized I wasn’t living if I didn’t act. I flung myself to the left, bike and all, and managed to knock down the beast. Before it could Halo jump back up I curb stomped that fuckers face like it was a roach until it looked flat. The little biting creatures crawled into the corpse of the beast after eating the remnants of its heads. I cried the whole way home and vomited five times, knowing I’d never truly recover. </p>\n\n<p>The sun had just begun to rise as I parked my bike and walked inside. I examined my wounds; Surprisingly nothing too terrible, and for once I would be downgrading my story to my parents. I slept until 2 PM peacefully, the last uneventful sleep I’ve had since ironically. When my Mom finally woke me up she screamed, but I explained that I fell off my bike on a hill.</p>\n\n<p>I didn’t dilute the story at school though, where I proudly ratted out Mikey for running and displayed my true wounds. For some reason Tony believed me again and asked if I wanted to join him and his friends in spending another night in the bunker. I told him he was crazy, but after my heroic acts I assumed it was safe. </p>\n\n<p>Sleep was always my favorite part of my day, but now it’s the only part I hate. I’m popular, all the girls think I’m a god, and Mikey is ostracized for being a coward. My new friends are sleeping at the bunker tonight, but I doubt they’ll have any problems. </p>\n\n<p>I killed it, right?</p>\n</div>\n","author":"nayrabstories"}