{"rank":"88","title":"My Project was a Beautiful One","id":"8jn6an","url":"/r/nosleep/comments/8jn6an/my_project_was_a_beautiful_one/","time":"1526403527000","body":"<div class=\"md\"><p>I wake up in the early hours of the morning and start my usual routine. Nudging my dog off my bed, I make my way to the bathroom where I brush my teeth. Looking into the mirror an outgrown beard and bristly haired man stares back at me. It was not uncommon for me to self-reflect upon myself while keeping up with my hygiene. Once finished, I grab my medicine bottle and dry-swallow the last pill, making a mental note that I need to stop by the pharmacy to get more. I hear my dog bark in the other room, so I quickly throw on my boots and take him for a walk. </p>\n\n<p>Now you may be picturing a nice neighborhood where I wave to the neighbors while strolling with my dog; that isn’t the case. My house sits atop a rather barren forest. My OCD forces me to live away from civilization, leaving my thoughts to my only companion and the woods surrounding me and my home. It is not uncommon for Zara, my dog, to run off and chase the morning birds, however this time was different. She had wandered off a little too far, forcing me to chase after her. </p>\n\n<p>My gut instinct told me to turn around but my persistent calling for my dog proved to be worthless. I follow the sounds of her barks, quickly approaching an old run down shed. I’ve attached a picture <a href=\"https://imgur.com/qPL3rM3\">here</a> so you can get a gist of what I had stumbled upon. At this point Zara was barking furiously as she had then gone into this place of abandonment. Now, not only did it strike me as odd that I had yet to come across this shed in the many years I lived in the vast wilderness, but what was even more odd was the stench emanating from within. </p>\n\n<p>Cautiously walking in, I do my best not to gag up my meal from the night before. Hanging from the ceiling is a girl. It becomes apparent that she is unconscious from the amount of blood pooled onto the floor. With many lacerations on her body, her scalp was halfway removed as if a feeble attempt was made to make a wig out of her now crimson hair. The sight was utterly gruesome. The person who had done this clearly wanted her to see her reflection as there was a rusted mirror hanging on the wall. With no cell service, my attempts to call the police were fruitless. I resulted in trying to gently tap her mangled body to see if she was still alive. In the midst of doing so, she awoke and started screaming. </p>\n\n<p>“It’s okay, I am just here to help,” I say in an attempt to calm her down. </p>\n\n<p>“No, no please you’re going to hurt me more, I can’t take it,”</p>\n\n<p>“Let me untie you from these ropes then it will be okay, I’ll get you to a hospital”</p>\n\n<p>“You’re going to hurt me like you did last time.”</p>\n\n<p>I ponder her statement for a moment, confused as I have never seen this woman before. I dismiss it as a result of blood loss and quickly explain to her that I will go back home to call an ambulance. Whistling for my dog, I run back home to call for help. Just as I am getting nearer to my home, I make a wrong step and trip over a rock, I fall onto the ground and slowly watch the world fade to black.</p>\n\n<p>I awake to find myself lying face first in the damp soil in front of my house. Confused as to what I was doing outside, I walk in and check my phone to see that it is the next day. Frantically running to my bathroom, I take the medicine bottle in my hand and notice it’s empty. Shit I forgot to refill my prescription, I think to myself. The drive into town is a long, seemingly-endless one so I figure I would wait until tomorrow to get more. My heart starts to race as I remember the project I am working on in my shed. I grab some tools from my garage and bring my dog along for the walk-- desperate to work on the beautiful thing I have waiting for me.</p>\n\n<p>The shed is getting nearer when I hear the grunts of my project, it seems as though she managed to partly untie herself from the ropes she was strung upon. Hammer in hand, I race forward to fix my utterly awful mistake of tying the rope in the incorrect form. I lift my arm, about to bring a cascade of menace down on her beautiful head when she removes herself from the ropes and brings them around my neck; I slowly watch the world fade to black.</p>\n\n<p>When I awake, I am tied into the same position she was, confused as to why this woman was doing this to me. I start to scream as I begin to wriggle about, turning myself to face a rusted mirror. Looking into it, I see a man with outgrown beard and bristly hair staring back at me. Fuck, I forgot to take my meds, I think as I start to feel something pulling at my scalp.</p>\n</div>\n","author":"madscormieyay"}