{"rank":"19","title":"The Witch","id":"8jn71t","url":"/r/nosleep/comments/8jn71t/the_witch/","time":"1526403675000","body":"<div class=\"md\"><p>I found these information from a friend&#39;s cousin who actually went there. He told my friend, and he told us, when we met at a party.</p>\n\n<p>This is so dangerous, I can&#39;t use names, but I&#39;ll try to describe it the best I can. The first thing you should do is ask yourself whether you really need to deal with that witch. It&#39;s not for anyone.</p>\n\n<p>She can solve minor problems, but the price wouldn&#39;t be worth it. Usually, people shouldn&#39;t even talk to such people. But if you must, I can only tell you what the friend&#39;s friend said. </p>\n\n<p>You should get there by car, as taxi drivers are specifically instructed not to take customers there.</p>\n\n<p>They won&#39;t take the fare if you tell them where you&#39;re going. Some will even advise you not to go. The house is at the outskirts, standing alone on a field, next to a large forest.</p>\n\n<p>It&#39;s creepy at night and there is little lighting to be found. Is as if light dims as you draw closer to her house. </p>\n\n<p>Time itself seems to pass in a weird way. I swear some people look at their wristwatch and notice time passing erratically.</p>\n\n<p>You get to the house with no fence. There is no need for one. Nobody dares rob that witch. Nobody is that stupid. Our friend told us the first thing you notice is just how beautiful the witch was. His cousin remained speechless for a while.</p>\n\n<p>The witch wore sunglasses. I heard it&#39;s because her eyes can paralyze someone. Other say they give you a heart attack. Nobody looked into her eyes. It&#39;s like gazing into the eyes of evil. Make no mistake, that witch IS evil. So thread carefully.</p>\n\n<p>Unlike 99% of fake psychics and wizards out there, this one is real. And that&#39;s the scariest thing. That magic powers exist. That they can change things, they act against nature. </p>\n\n<p>Such powers are rare, but the few who posses them are not heard of. Indeed, that witch, whose name I dare not mention, for even writing it can cause harm, displayed them. There were accidents. Some ended up in asylums, plagued by twisted visions or followed by entities. </p>\n\n<p>Others witnessed as their once beloved husbands or wives begun to shift behavior and attacked them. As hypnotized or like zombies. She controls them from the distance. Fires broke out. Others became sick. </p>\n\n<p>She once caused a plague to sweep among the homeless. You read about it. It was 1995. That&#39;s how dangerous she is. Some say her house is haunted. Some saw shadows fleeting at her windows or faces without bodies. </p>\n\n<p>I cannot say how true this is. The witch has a mirror room. There&#39;s hundred of them. They&#39;re all covered. My friend saw painted windows and doors that ended up nowhere. </p>\n\n<p>Wolves come to her from the woods. They act submissively. Even these animals know and fear her. She treats them good. My friend said his cousin saw a black wolf in the living room. The witch petted it and it was like a dog to her. </p>\n\n<p>It growled ferociously at the customer. It did not attack, but just seeing it was... was horrible. You always have to pay a price for her services. A price in gold. Always gold. Gold bars or gold coins. Her behavior is not evil. It&#39;s not rude or simple. </p>\n\n<p>On the contrary, its manner of speaking makes you feel like you&#39;re talking to an old friend. She&#39;s polite and careful and very, very educated. </p>\n\n<p>A vast knowledge on all topics. The speech is soft, but full of poison. Indeed, nobody heard of a more cunning person. A master of manipulation. But it&#39;s hidden beneath honeyed words. The witch&#39;s words are nice. </p>\n\n<p>If you don&#39;t pay, nothing bad happens. There are no threats made. But I heard tales of a customer who didn&#39;t felt like paying for a spell. He laughed at her and I don&#39;t think he really believed some harm can happen. </p>\n\n<p>As days passed, he started to eat less and less. He just wasn&#39;t hungry. He lost a lot of weight. He saw doctors, he begun eating a lot, but the more he ate, the thinner he got. Because he wouldn&#39;t pay, out of pride, he was cursed. </p>\n\n<p>After a few weeks of not seeing his friends, the client was found lying in bed.... as a skeleton. Not once did he consider paying his debt. Another one was cursed, because he mocked her. He said she&#39;s not real. He ridiculed her on his blog. </p>\n\n<p>The curse manifested itself in that the customer, after refusing to pay and calling the cops, fell in love with a picture. That photo of a woman mysteriously appeared on his desk. </p>\n\n<p>He couldn&#39;t lift his eyes of her. Upon research, he learned the woman was actually dead since 1984, but that didn&#39;t diminish his unnatural love for her. His mind was taken by magic. </p>\n\n<p>It was clouded. He already had a wife, but he was still obsessed. His wife tried to get rid of the picture, but it kept popping up everywhere. This lasted until the rude customer stabbed his wife and hang himself. He left a note expressing his love for that woman in the picture. </p>\n\n<p>My friend&#39;s cousin wanted a money spell. He got it. Now, he is happy with his new wife. He paid in gold bars and there were no problems since. He briefly described shadow figures with horns roaming around the premises on his way out. </p>\n\n<p>And a few child ghosts in the windows. He had nightmares for weeks until they ceased. Indeed, not a person to mess with. Not someone to visit. That&#39;s why that witch has no friends.... except the black wolf.</p>\n</div>\n","author":"mrpessimistik"}