{"rank":"447","title":"I think my grandfather might be a serial killer. Part 10 of 12.","id":"8jnl02","url":"/r/nosleep/comments/8jnl02/i_think_my_grandfather_might_be_a_serial_killer/","time":"1526406546000","body":"<div class=\"md\"><p><a href=\"https://redd.it/8epbdy\">Part One</a>   </p>\n\n<p><a href=\"https://redd.it/8fg0wx\">Part Two</a>   </p>\n\n<p><a href=\"https://redd.it/8g3t9k\">Part Three</a>   </p>\n\n<p><a href=\"https://redd.it/8gmv5o\">Part Four</a>   </p>\n\n<p><a href=\"https://redd.it/8h7vaz\">Part Five</a></p>\n\n<p><a href=\"https://redd.it/8hjvu5\">Part Six</a></p>\n\n<p><a href=\"https://redd.it/8htpr5\">Part Seven</a></p>\n\n<p><a href=\"https://redd.it/8i5k72\">Part Eight</a></p>\n\n<p><a href=\"https://redd.it/8ivfxi\">Part Nine</a></p>\n\n<p>&nbsp;</p>\n\n<p>We rode silently for some time, with my initial assumption being that we were going back to his hometown for him to tell me the rest.  As we drove, however, I began to realize that we were going north rather than east, taking the highway for two hours before he turned off onto a small paved road that later led to a gravel one.  Another few miles and we turned onto a concrete driveway that led up to a metal gate and a chainlink fence topped by razor-wire and several surveillance cameras.  A sign next to the gate read “Jager Solutions, Inc.”.</p>\n\n<p>&nbsp;</p>\n\n<p>I looked over at my grandfather perplexed.  “What is this place?  Why are we here?”</p>\n\n<p>&nbsp;</p>\n\n<p>He smiled at me as he tapped a remote attached to his visor and the metal gate began to open.  “We’re at the Batcave.  I couldn’t do research and other things related to all this close to home, so I bought this place.”  He was pulling through the gate now and gesturing to the three large warehouses contained within the fence’s perimeter.  “This used to be a warehouse for an importer—guy sold rugs and carpet I think—but when he died the place sat unkept and unsold for years before I found it.  Got it for a song, though the repairs and modifications did take some time and money.”  He pointed to the farthest building.  “That’s the main building there in the back.  These other two are mainly for storage and some fake inventory in case the place ever got audited or broken into.  Most people don’t even know it’s tucked back here though.”</p>\n\n<p>&nbsp;</p>\n\n<p>As we drove past the first two buildings, I saw relatively new-looking signs cautioning forklift safety rules and the importance of always wearing a hardhat and gloves.  I pointed at them.  “Safety first, huh?”</p>\n\n<p>&nbsp;</p>\n\n<p>My grandfather nodded.  “Yeah, me and my non-existent workers have never had a workplace death since I bought the place.”  He paused.  “Well, except for outsiders.”</p>\n\n<p>&nbsp;</p>\n\n<p>We parked outside of the building and he led me to a door with a keypad, making a point of showing me the code before we entered.  Inside was largely empty except for a pick-up, an SUV, and a corner of the building that had been converted into a workshop of sorts, filled with workbenches and tools along with a heavy oak desk.  I looked at him questioningly.  “The Batcave?”</p>\n\n<p>&nbsp;</p>\n\n<p>He let out a chuckle.  “No, not this.”  He walked over to a far corner that was largely in shadow and as I drew closer I saw that it contained a stack of what looked like corrugated roofing tin.  He went to a spot at the edge of the tin and stepped on it with his foot.  With a loud hiss, a portion of the tin lifted up to reveal a growing slit of amber light.  As it expanded, I realized that a large hydraulic hatch had been camouflaged by the pile of scrap and was now opening to reveal a set of concrete steps leading down into the ground.  My grandfather pointed at it proudly.  “Batcave.”</p>\n\n<p>&nbsp;</p>\n\n<p>He led me downstairs, which consisted of a short hallway with a small living area including a shower, sink and toilet on one side and a larger room that was clearly a lab of some kind on the other.  At the end of the hall was what looked like the door of an old bank vault.  When I mentioned that to my grandfather, he nodded.</p>\n\n<p>&nbsp;</p>\n\n<p>“That’s because that’s exactly what it is.  As you can imagine, after I got this place I had to have all this underneath added in.  I convinced the contractor I was some kind of doomsday prepper.  He was into that stuff too, so he actually gave me a discount.  But it was still ungodly expensive.”  He pointed to the vault door.  “But this…this I actually got for free.  Kind of.”  </p>\n\n<p>&nbsp;</p>\n\n<p>He took two large metal keys from his pocket and stuck them in the door.  They turned with a large, metallic thunk that made me think of bank robbery movies I had seen.  He then gripped the wheel in the center of the door and gave it two full turns before tugging the door open.  Lights came on inside as the door swung aside, and looking inside I could see he had more than just a vault door, he had an entire vault.  Safety deposit boxes lined the walls, and in the center a heavy metal table had been bolted to the floor, with several smaller tables on rollers surrounding it.  Some were filled with medical supplies or tools.  Others were filled with items you would find in a garage.  Drills, pruning shears, hammers, knives.  Along several places on the wall I saw what looked like metal mesh cages that seemed to contain something, possibly cameras.  Everything was immaculately clean, but it did little to make the room seem less sinister.</p>\n\n<p>&nbsp;</p>\n\n<p>“It looks like a cross between an operating room and a torture chamber.”  Speaking the thought before I realized it and looking quickly at my grandfather, afraid I’d hurt his feelings.  But he was nodding as he looked into the room before meeting my gaze ruefully.</p>\n\n<p>&nbsp;</p>\n\n<p>“That’s pretty much what it is, if I’m honest.  I got this vault from a defunct bank in Arkansas after I had started work on this place.  The bank building was being converted into a restaurant of some sort, and they just wanted the vault gone.  So I had to pay for the removal and transport, which was quite a bit even twenty years ago when I got it, but it was worth it.”  </p>\n\n<p>&nbsp;</p>\n\n<p>He pushed the door back closed and led me back into the living space.  Aside from a cot against one wall, it contained an overstuffed chair and a sofa along with a pair of small tables.  Sitting on the sofa, he gestured for me to sit in the chair.  “Before I try to tell you anymore, I think I should show you something.”  As I sat down, I saw he had picked up a tablet from the small table next to the sofa and was tapping at it.  After a moment he handed it to me.</p>\n\n<p>&nbsp;</p>\n\n<p>It was a video, and even before I hit play I could see it was taken with a camera in the vault room.  It looked very similar to how it looked now, except for the little girl tied to the metal table.  I felt my stomach lurch, and I had to fight to resist the urge to ask more questions before hitting play.  But I had come this far, and I needed to see it through and have some faith.</p>\n\n<p>&nbsp;</p>\n\n<p>When I started the video, I could see the girl struggling at the straps that held her.  The video was not of the best quality and seemed to have been filmed through some kind of mesh like those small cages I had seen in the room, but I would have guessed she was no more than ten.  After a couple of minutes of tugging at the straps, she became deathly still.  I leaned closer to the video, squinting to look for any signs of life.  Nothing.  I glanced at my grandfather.  He pointed to the tablet.</p>\n\n<p>&nbsp;</p>\n\n<p>“Keep watching.”</p>\n\n<p>&nbsp;</p>\n\n<p>Returning my gaze to the video, I waited and watched.  Several minutes passed.  Suddenly, I saw the briefest glimpse of her entire body seeming to flicker or jump, and then the video went scrambled for half a second.  When the image returned, it was in infrared mode and I almost threw the tablet down.</p>\n\n<p>&nbsp;</p>\n\n<p>Where there had been a little girl, there were now strings of coiled, stringy flesh that stretched out across the room in all directions like some kind of macabre spiderweb of gore.  My first nonsensical thought was that the girl had somehow exploded and that the image had frozen mid-destruction.  But then I saw the strands of meat moving of their own volition, running together and pulling apart like chewing gum as they explored the walls.  This wasn’t that little girl at all, or at least not the version of her that had been there moments before.  I looked back at my grandfather.</p>\n\n<p>&nbsp;</p>\n\n<p>“This is one of them?”</p>\n\n<p>&nbsp;</p>\n\n<p>He nodded and began to explain.</p>\n\n<p>&nbsp;</p>\n\n<hr/>\n\n<p>&nbsp;</p>\n\n<p>Two years after Salk’s death I had three more hunts under my belt.  I had already learned that many of them behaved differently from Salk and that the outsiders’ human form and the monsters were one, or at least inextricably linked.  But I had only seen one of the three actually transform, and he was radically different than the thing that Salk became. </p>\n\n<p>&nbsp;</p>\n\n<p>He was a young guy named Steven Kulchek, and he worked construction in Atlanta.  I had taken to going to medical conferences different places to have a reason to travel and widen my net in my search for outsiders.  I’d encountered him at a diner near his current work site and decided to extend my stay a few days.  I trailed him back to work and found he was working on a high-rise apartment building that was going up nearby.  He knocked off at four that afternoon and I kept with him all the way out of Atlanta proper and into one of the suburbs where he lived with his parents.</p>\n\n<p>&nbsp;</p>\n\n<p>I followed him for the next three days and nights as best I could, and on the third night he left home and headed back into the city.  At first I thought he might just be going out somewhere, but he headed right back to the work site.  He didn’t seem to have a key to the gate, but he scaled the fence nimbly and ducked into the shadows of the partially-constructed tower.  I went down the fence a hundred yards and followed suit.</p>\n\n<p>&nbsp;</p>\n\n<p>It took me a couple of minutes to find him in the dark, but then I saw him in the dim illumination of a distant street light, standing just inside what would one day be the lobby of the building.  He was looking up at one of the walls as though trying to decide something, his face half-hidden in shadow, but the portion I could see was as blank and emotionless as Salk’s had been.  Then he changed.</p>\n\n<p>&nbsp;</p>\n\n<p>In the blink of an eye, where Steven Kulchek had stood there was a much smaller creature.  Two feet tall or thereabouts, it had a barrel of a torso with two arms and legs all covered in something that looked more like bluish moss than any kind of hair and a flat, thick head that looked like a snapping turtle except for having six eyes on each side of its long, sharply beaked snout.  It gave out a small, contemplative clicking noise as it shuffled back and forth, still looking up at the wall.  Suddenly it leapt up ten feet and clung to the spot it had been considering.  As I watched, it began to lick the wall with a long, black tongue, each lash leaving a blue-grey trail of slime on the spot that quickly blended in with the concrete.\n&nbsp;</p>\n\n<p>I had no idea what he was doing, but I knew it was nothing good.  Still, I remembered shooting at the thing that I now felt sure had been Salk and the bullets doing nothing.  So I waited in the shadows for him to finish his work.</p>\n\n<p>&nbsp;</p>\n\n<p>It took close to two hours.  He moved from place to place throughout the outer shell that had been constructed so far, and I felt guilty for not moving against him, trying to stop whatever it was he was doing, but it was too great a risk without knowing more about what, if anything, might hurt or kill him in this form.\n&nbsp;</p>\n\n<p>When the creature was finished it climbed back down to the ground, and just as quick, the young man was standing there again.  Fully clothed, no sign of having just turned into a monster.  This was food for thought, but now wasn’t the time for theorizing.  Trying to move quietly, I left the shadows to intercept him from behind as he went to leave the building.  I had a collapsible baton that I had carried with me from the car, and I brought it down hard on the back of his head.</p>\n\n<p>&nbsp;</p>\n\n<p>Or that was the plan.  Unfortunately, he turned at the last second and it glanced off his shoulder, eliciting little more than a grunt of pain as he dodged to the side.  I was already reaching into my jacket pocket for my stun gun, but when I pulled it out and hit the button, it was dead.   This was strange, because it had been fully charged and working when I got out to follow him over the fence.  But again, no time to wonder.  He was…</p>\n\n<p>&nbsp;</p>\n\n<p>There was another flash of movement and the man was replaced with the creature.  Without missing a beat it leapt at me, slamming me to the ground.  I managed to get the baton up in time to catch its sharp mouth diving for my face.  With the iron bar of the baton wedged into the creature’s maw, I felt like I was just delaying my death rather than preventing it.  It was surprisingly heavy on my chest, and its hands and feet ended in hard claws that were already digging into my clothes and flesh, pushing my arms down and minimizing any leverage I had to push the baton and the creature further away from me.</p>\n\n<p>&nbsp;</p>\n\n<p>Then I noticed that it was stopping.  It pulled its head away swiftly and I thought at first it was going for another lunge, but then it jumped off me, shaking its head.  I rolled to my feet, ready for the next attack and saw that it was glaring at me, light gray smoke coming from the edges of its mouth.  I could see the yellow-brown of its beak blackening slightly where the smoke touched.\n&nbsp;</p>\n\n<p>I could tell it was considering its options, looking at the baton in my hand and then myself.  It was afraid of it more than me.  It suddenly leapt into the shadows, and for a moment I thought it might be retreating, but then I heard the scrabble of claws behind me.  I spun around with a blind swing and managed to catch it right before it landed on me, knocking me back down.  The baton had hit it in the side and done remarkably good damage, caving in part of its torso and causing it to immediately begin trying to roll-crawl away.  But I was quicker this time, getting back up on my knees and bringing the weapon down again and again until I was certain it was dead.</p>\n\n<p>&nbsp;</p>\n\n<p>I found out later I survived because of dumb luck.  Some of these things are very weak to iron--unnaturally so.  If it had been made of steel I would have died that night, and there was a time later on where my reliance on iron nearly did me in.  There are rules to these things, but you can never assume they will always apply.  There are always exceptions and you always have to remember that they have most of the advantages.  The way you beat them is by being smarter and stronger-willed than they are.  More clever.  I’m still learning now, but back then…I still had a lot to learn.\n&nbsp;</p>\n\n<p>One of the things that I wondered early on is what the nature of these things truly are.  First of all, are these people transforming directly from their human forms into monsters, like a werewolf or some versions of vampires?  But if that was the case, I reasoned, then what are the limits of how much they can transform?  Look, there’s no denying the supernatural component of all of this, and even early on I understood there would be some aspects of it I could never explain fully.  But at heart I’m a scientist, and I always start from that framework in trying to understand what I can.\n&nbsp;</p>\n\n<p>I considered mass, for instance.  Once I understood more of how the human and creature forms were connected, I started looking back at earlier encounters.  Salk, for one.  That creature was over half again as large as him as a man, and while you can displace mass to some extent if he was less dense in spots, I can tell you from the sound of it chasing me and the force with which it knocked me out that the monster version of Salk weighed significantly more than the man did.  </p>\n\n<p>&nbsp;</p>\n\n<p>And this creature I just told you about--it was less than half the size and weight of Steven Kulchek.  Even if his physical body was somehow transforming into that thing, where did the rest of the meat and bone and fluid go?  And then you have examples like the video I just showed you.  These things take all kinds of forms and sizes and then go back to looking like people the next instant.</p>\n\n<p>&nbsp;</p>\n\n<p>But the biggest sign was the clothes.  They weren’t shucking off clothes or ripping them apart as they changed.  They would turn back into being human with hardly a wrinkle or smudge.  So they aren’t transforming, they’re swapping places.  It was a theory at the time, but since then I’ve managed to get some footage slowed down enough that you can see the transition happen, if just barely.  It’s similar to when you drill through the seed, though it happens even quicker.  One moment, the person.  Next moment, the monster.  Or, to be more accurate, they are both the monster, just with different strengths and weaknesses inherent to each form.  Both are capable of doing a great deal of harm, and I’ve seen more than a few that seem to rarely change at all to their other form.  Their goals don’t require it I guess.</p>\n\n<p>&nbsp;</p>\n\n<p>When I had this place set up, I redoubled my efforts to learn more about them and those goals.  I have a very secure closed circuit filtration system running into that room so I can control if there’s air or not and pump in gas to sedate or kill if I need to.  The system has no ties to the other ventilation down here, so even if one of these things turned into a mist it couldn’t get out once the room is sealed.  Though I doubt that’s a possibility in any case.</p>\n\n<p>&nbsp;</p>\n\n<p>One of the consistencies I have found between all these outsiders is that their non-human form is always at least semi-solid and is never so small that it can’t house the seed.  The seeds do show up on MRIs if you know what to look for, but for obvious reasons I’ve never been able to scan one in creature form.  But I believe the seed is the key.  It acts like a gateway between this reality and…wherever those things come from.  What looks like a transformation is actually a swapping of sorts.  But if you destroy the seed, you destroy the gateway, and if you kill the human body, the seed will dissolve approximately 37 minutes after brain death. </p>\n\n<p>&nbsp;</p>\n\n<hr/>\n\n<p>&nbsp;</p>\n\n<p>“That’s by design I think.  Just like most of this is by design.”  As he had talked, my grandfather had been animated telling about his encounter with Kulchek, but that life had drained away as he talked about all he had learned.  Now he was silent a moment, staring off with a melancholy expression before looking back to me and forcing a smile.</p>\n\n<p>&nbsp;</p>\n\n<p>He leaned forward and tapped the tablet.  “Did you notice the wire mesh in front of the camera in the video?  Did you see those wire boxes in the vault?”  I nodded and he went on.  </p>\n\n<p>&nbsp;</p>\n\n<p>“When I first captured one and put it in the vault, I set up two camcorders to record what happened.  I didn’t think there was any real risk of it getting out and I had gas ready if I needed to knock it out or kill it, at least assuming that gas would work, because again, you can never assume anything is certain with these things.  In any case, I lock it in, it wakes up, it transforms for awhile and tries to get out.  I can hear it beating against the door.  Then it tries swapping back to the person, a pretty woman who ran a wedding boutique in Memphis, and I can just barely hear her screaming and crying as sympathetically as she could muster through the wall.  I hit the gas, go in and deal with her, and then I check the video.”</p>\n\n<p>&nbsp;</p>\n\n<p>“The videos were blank and the cameras were fried.  I figured out that whenever the swap happens, it sends out a short but very strong electromagnetic pulse.  Kills electronics and lights in about a forty foot radius around it.  That’s why my stun gun had died fighting Kulchek and that’s why my cameras got toasted.”</p>\n\n<p>&nbsp;</p>\n\n<p>I nodded.  “So you built Faraday cages around cameras to shield them?”</p>\n\n<p>&nbsp;</p>\n\n<p>He laughed and nodded.  “Exactly!  Very good.  They aren’t perfect, but between the shielding on the cameras themselves and the mesh, for the most part I can capture decent footage now.”  His expression was lighter for a moment, but my next question brought back the look I had feared since we left our fight with the House earlier in the day.</p>\n\n<p>&nbsp;</p>\n\n<p>“So you talked about them having goals?  Have you figured out what the point of what they’re doing actually is?  Or is it just random?”</p>\n\n<p>&nbsp;</p>\n\n<p>He frowned, looking thoughtful for a moment and seeming to consider his next words carefully.  “I don’t know what the overarching plan is, no, though I could guess it is a stage of some larger campaign to encroach upon or infect our world with their malignity.  But that there is a plan, an intelligent design, is hard to deny at this point.”</p>\n\n<p>&nbsp;</p>\n\n<p>He leaned forward, tapping his fingers individually as he made his points.  “First, the seeds are designed to take over people and also provide for an extremely efficient method of bringing over this other form, all while appearing to bridge and share consciousness between the two forms.  Could that be naturally occurring through some evolutionary process?  Possible but unlikely given the supernatural component and how perfectly it aligns with their apparent goals of infiltrating this world without notice and creating pain and death.”</p>\n\n<p>&nbsp;</p>\n\n<p>“Second, consider that this all occurs without altering the DNA or most biological processes of the human form.  There was no indication in Salk’s tissue samples that he was other than human, and while his blood unquestionably has some unique properties, it was nothing that raised red flags during routine testing at the hospital.  And I can tell you that I have run exhaustive tests on these things over the years and never found any trace of anything abnormal other than the seed itself, which somehow manages to self-destruct less than an hour after death, leaving no trace that it was ever there.”</p>\n\n<p>&nbsp;</p>\n\n<p>He sighed and looked away for a second.  I could see he was on the verge of crying, but he held it in check, looking back at me with his iron gaze as he spoke.  “Third, look at who they target to take over.  I have encountered close to a hundred of these outsiders in just over thirty years.  My guess is that there are at most a few thousand of them in the world right now, maybe less.  But without fail, to the extent I can figure out what an outsider’s individual goal is, the person they have taken is in a good position to accomplish it.  It’s not random, it’s part of some broader plan.”</p>\n\n<p>&nbsp;</p>\n\n<p>He rubbed his mouth and went on.  “I also know they have to be able to control and plan precisely who gets a seed.  It’s not like an infection or a bomb.  It’s selective.”</p>\n\n<p>&nbsp;</p>\n\n<p>I frowned.  What he was saying made a lot of sense, but it was still assuming a lot.  “How do you know that for sure?  What aren’t you telling me?”</p>\n\n<p>&nbsp;</p>\n\n<p>He looked down, his mouth trembling slightly.  “I know it because of the odds.  Say there are three thousand of these things out there.  Out of over six billion people, what are the odds that a specific person would have a seed?  Extremely low.  But out of all those people, against all those odds, I’ve got one in me.”</p>\n\n<p>&nbsp;</p>\n\n<p>I jerked involuntarily forward, blood rushing in my ears.  “What?  You have what?”  I had to have heard him wrong.</p>\n\n<p>&nbsp;</p>\n\n<p>He looked back up at me, tears now welling at the corners of his eyes.  “They put a seed in me.”</p>\n\n<p>&nbsp;</p>\n\n<p><a href=\"https://redd.it/8kl3aj\">Part Eleven</a></p>\n</div>\n","author":"Verastahl"}