{"rank":"26","title":"My Property Isn’t Normal (part 2)","id":"8jo10u","url":"/r/nosleep/comments/8jo10u/my_property_isnt_normal_part_2/","time":"1526409818000","body":"<div class=\"md\"><p>I’m happy to see that my experiences from part one got some attention! Wasn’t expecting this stuff to actually get any traction. I’m mainly here to vent, and have a place to catalogue the stuff that happens around my house. People also seemed to enjoy the the part where the naked dude attacked me, then cartwheeled into the woods crying like a baby when i stabbed him. Still not sure if he was human. Now i feel obliged to tell more of my experiences. Also, feel free to leave any questions you have and i will try to answer them in the next post. That being said, if you haven’t read part one i suggest you go back now and read it. I’m going to tell the following experiences as if you already know about the other experiences i have written about having on this property. This place is not normal after all, and takes some getting used to. </p>\n\n<p>Now that the intro is out of the way, i think we can start with Camo. And Camo is a fucking nuisance. I first time i came into contact with him was during the first whitetail deer season i had on my property. Now I’m a hunter, but the program that is “helping me” after the incident said i wasn’t allowed to have guns because the noise draws to much attention. Bullshit. I live in the middle of nowhere and there isn’t anybody else for miles, unless you count the chosen, but I’m pretty sure that the program is worried about the them. Luckily the lady in the tree hooked me up with the 45. Caliber I now have in my possession, but i didn’t have it upon first meeting Camo unfortunately.</p>\n\n<p>Anyway, back to the story. I first saw him when i was walking towards a ladder stand i had set up on a tree to watch deer, since i could no longer kill them. And yes i could have had a bow, but I’m shit with a bow, i would risk just hurting the animal. I don’t like the idea of an animal that is suffering because i couldn’t make a shot that would kill it instantly. Now, as i approach my stand, i notice a figure already sitting in it. It’s about the size of a regular human. He was dressed in full camouflage, pants, jacket boots, hat, face mask, and backpack. He actually seemed like a regular person, which i hadn’t seen any of those in the woods for the entirety of the 4 months i had been living there. The things that live on this property are generally more extreme. But no matter how relieved i was to see a proper human for once, he was deep in my property, and hunting in my stand. I had to get him to leave. </p>\n\n<p>I reluctantly shouted over to him, “ AYYYE, YOU AINT SUPPOSED TO BE HERE, TIME TO GO DUDE!”  Now i was about 75 yards away and to his left, but i yelled plenty loud for him to hear me clearly. He didn’t flinch, he stayed facing straight forward like a statue. What a prick.</p>\n\n<p>Look, try to be creepy all you want but ignoring someone like that is just rude. I know he hears me, i have reason to believe he was just trying to freak me out because I’ve made him break character before. </p>\n\n<p>So after i yell and he ignores me, i start getting impatient. I yelled the same thing at him again a little louder and still ended up with the same response. What a dick. Now I’m livid because he’s making me ruin all my chances of seeing deer this afternoon by making me yell at him. So naturally, i start a brisk stroll over to tell him off to his face, or maybe kick his ass. I already noticed he didn’t have a rifle so i just assumed that he was watching like i was planning on doing. Of course he could have had a concealed handgun but I’m a dumbass so i didn’t consider that. </p>\n\n<p>Then i heard the, “crunch” of something under my foot, and the sudden sound of rope sliding across a surface at high speed. I froze for a fraction of a second and before i could squeak out an oh shit. I’m hanging upside down from my ankle. There was a loop around my leg that held me suspended 7 feet off the ground like a damn cartoon. I was like a fucking loony toons character. I couldn’t help but roll my eyes. I immediately knew it was Camo and when i look up, or down? Shit i was upside down so i don’t really know where i had to look but i saw him slowly climbing down the ladder. Like really slowly. What a dramatic guy. If he wasn’t so obsessed with appearances he probably could have killed me. That what i think he wanted to do anyways. There was a machete on his hip that i could now see and the blade was chipped at in a way that made it look serrated, wouldn’t have been a very useful tool unless you wanted to use it to inflict pain. </p>\n\n<p>I think the biggest flaw with Camo’s trap though was that he didn’t account for the single fact that 99% percent of people who live alone in the woods learn that carrying a large knife at all times is a necessary thing if you want to stay alive. I wish i could tell you that i did a flip after i cut myself down and landed on my feet like some sort of badass. But i didn’t, i landed on the back of my neck and my vision went dark for 15 seconds, which i guess was enough time for tweedle dumbass to finally get to the bottom of my ladder stand. As i stood up, i saw that he was standing completely still at the base of the stand, still fifty yards away from me. Staring at me. I could hear his thoughts from here. “Damn why did he get out, shit shit shit”. Then he turned and bolted.</p>\n\n<p>This dude was booking, i lost sight of him in less than thirty seconds into my chase and had to give up. I need to jog more. And what more, by the time i got back to the ladder stand, IT WAS ALREADY GETTING DARK! I didn’t even get to watch any deer. </p>\n\n<p>I’ve seen Camo on multiple other occasions as well. But i figured him out. He got me the first time, but his traps really aren’t that sneaky, they are elaborate, but not sneaky. He always appears in an area that i plan on hunting in, don’t know how he knows where I’m gonna be, but i stopped questioning stuff on this land a long time ago. And i always notice him long before i get to the location. Again, i have no idea how he plans this shit out. And secondly, there is always a trap set somewhere directly between when i first spot him and his actual location. Like if i were to draw a line from him, to where i see him from, the trap will always be on that line. Also, another important thing to realize is that none of his traps are fatal. They are all meant to keep me from escaping, but not kill me, they do hurt though. One time i almost stepped in a bear trap he had set out and it for sure would have broken my leg had it got me. </p>\n\n<p>This non fatal part was his downfall. I figured out that he didn’t want me to die in a trap, he probably wanted to do the deed himself. Or maybe do something else but he really didn’t want me dead in a trap. So all i had to do to get him riled up was die in a trap, right?</p>\n\n<p>After the lady in the tree hooked me up with the pistol a little over a year and a half ago, one of the first problems i wanted to solve with it was the creator of the various nets, ankle snares, and holes, that attempted to contain me many times before. And i knew exactly how i was gonna do it. One of Camo’s recurring traps was just a large, 11 foot deep hole covered by a large amount of suspiciously patterned sticks and leaves that could literally be seen a hundred yards away. I just had to wait until he used this trap again. After a swinging log that i think was supposed to knock me out and another net that was meant to land on top of me ( i might add that it was made of wire so i couldn’t cut through it, but it also had a glare from the sunlight that made it impossible not to see). I finally came across the trap i was looking for, four weeks after i got the gun i find my self walking towards a 11 foot hole trying to pretend i don’t see it. Suddenly, i start falling. </p>\n\n<p>I was ready for the fall and let out a loud yell as i traveled downwards, and as i hit the ground i stayed as quiet as possible. Which was hard considering the broken toe and dislocated knee i had just received. Fuck Camo for making me do this.</p>\n\n<p>I army crawled over to the side of the hole and laid my head against the side to make it look like i had broken my neck. Then i waited. Took 15 mins for that little prick to dramatically make his way over to me, but i heard him walk up the the edge of the hole. I obviously had to close my eyes to appear dead because i couldn’t run the risk of blinking, but i almost smiled when i heard Camo mutter to himself “oh shit, no no no no no, they are gonna be so fucking pissed”. I took advantage of the moment and quickly opened my eyes and whipped out the pistol, firing three shots at him as quickly as i could. I missed with all but one. The bullet that met its mark put a hole in Camo’s shoulder and her let out a garbled scream of nonsense and gibberish. Something along the lines of “YOU PIECE OF FUCKING YOU I CANT BELIEVE THAT ASS FUCKING YOU SHIT AHHHHHHHHHHHHH!”</p>\n\n<p>He did end up running away but as he ran i heard him say “f-fuck this dude, I’m ahhh shit, i’m fucking done.” I was laughing my ass off. Till i realized i was severely injured and had to climb out of this hole. Good thing it was daytime though or i might not have noticed the black rope that Camo had lowered into the hole while he was cursing himself for killing me. I some how managed to pop my knee back in joint based on shit i had seen earlier in life and climbed out to limp my way back to the house. That was a good day, broken toes are fucking expensive to get treated though. The best part is that i haven’t seen Camo since that day. It actually worked. Wish i could pull something like that off with skinny.</p>\n\n<p>Another thing that i guess i need to explain to all of you readers is the lady in the tree. I’ve mentioned her a few times now and at least some of you are probably wondering about her. I honestly don’t know much about her myself. But she is hands down the best thing on this property. My first experience with her was when she healed a broken eardrum that i had suffered when meeting what i think was a banshee down in my creek. It was busted when she screeched really loud and when i went to sleep, i woke up perfectly fine the next morning. I almost thought it was all a dream until i saw the blood still on my pillow and the broken flashlight that i had used in personal defense. Well i guess this was the first time the affected me directly but not the first time she had helped me out, the true first time i didn’t realize was her until last night. It was the gun. The gun that i talked about “purchasing” in part one wasn’t really purchased, i just wasn’t willing to admit that i looted it off of and old corpse that i had found in an abandoned log cabin in the back of the property. This is an example of how sneaky she is. I only started to wonder if it was her doing while i was recording the first set of these stories and i started thinking about how good of shape this Gun was in. Of course it was a little dirty when i found it but it was also in perfect operating condition, and i figured that the skeleton that was clutching it didn’t need it anymore, but hell at this point i wouldn’t be surprised if he came to life each night. Either way i left the cabin with a new sidearm and two boxes of ammunition. </p>\n\n<p>I didn’t really think about it to much because finding a gun on a body is pretty mild considering the events that go down here on a week to week basis. But yesterday i started questioning the real origins of this gun. It was so well maintained and new feeling when i got it but the skeleton looked like it had been there forever. Not to mention the fact that the gun was unloaded and the boxes of ammo were unopened, but the skeleton looked like it had died holding the gun like he was intending to use it. It didn’t add up. So i headed back to the cabin. And i found my answer. </p>\n\n<p>Everything was the same when i got there as it had been over a year ago, i mean nothing had changed, especially not the body. The exact same as before. I was nervous at first, not because the body scared me, but because the joke about the skeleton coming back to life from earlier wasn’t really that far fetched in this place. I’ve never seen an undead skeleton, but i have seen other forms of undead, maybe I’ll tell y’all about those experiences sometime. </p>\n\n<p>Nervous or not though, i had had to confirm my suspicions, i approached the body and started examining the clothes. Just like i expected, the flannel shirt and brown jeans had no tags. Not like they had been ripped out, but like they were never there to begin with. Now there was only one more thing to check, i took out my knife and scraped the blade down the skeleton’s exposed arm bone. Sure enough, a shaving fell of. It was wood, the entire skeleton was made of wood and painted a lightish brown among other discolorations to look like the real deal. The lady in the tree is very talented when it comes to wood. But she can do so much more. I’ve only seen her in person two times, once when i caught a glimpse of her smiling as she walked into an opening into a tree only to close the opening with a door that fit so perfectly i couldn’t see the edges when i walked up to it. It just looked like a normal tree. And a second time two days after i encountered the screeching banshee in the creek. I saw her out the window of my front door, smiling in. She winked at me and ducked out of view. I ran to the door to try to see her fully but by the time i swung the door open she was gone in the night, nowhere to be seen. Which is really annoying. I would almost consider us friends by now and she still won’t show herself to me fully.</p>\n\n<p>Now when i saw her for the second time, i didn’t know what or who she was. But when i looked at the ground in defeat i notice the small sheet of what looked like homemade paper. On it was a short message that read.</p>\n\n<p>“I wish to congratulate on killing the Keelut, he was bringing an evil over the land that was distressing the forest. I don’t know how you actually ended him but i am happy all the same. I have seen you roaming and i am certain you have seen me. We work towards the same goal. Cleansing this land. My vows as a medicine woman keep me from directly interfering with the creatures of this land but i wish you luck on your mission and will support you from the shadows as best i can. I hope your ear feels better.”</p>\n\n<p>So i think the Keelut she was talking about me killing i think was a rabid coyote that i had killed a few days before the creek incident. It was hairless and just stared at me through some trees. I think it was trying to intimidate me to leave its territory. So i shot it between the eyes and left. My territory bitch. But this was the first time i realized that i finally had someone on my side on this land and that was a relief. She was actually really helpful. Once i got bit by a rattle snake and when i got home, there was a bottle labeled “ANTI-VENOM” sitting on my kitchen table. Another time i got bit by one of the shadow children while i was hiking, and when i got home there was a bottle of purple liquid in a glass vial in the same place on the table. I honestly expected it to heal the wound or something but it just made me really drunk. Guess she couldn’t help me much that time.</p>\n\n<p>She’s done other stuff too, but now I’m kind of worried about her. I haven’t heard or experienced any help from her in 8 months, I’m worried something got to her, or even worse. What if she is mad at me. I mean skinny almost killed me 6 months ago and she didn’t do shit. I’ve grown to like her and even depend on her a bit, but she is just... gone...</p>\n\n<p>I think I’ll call it quits for this post, but hopefully i can stay alive long enough to post more. The hunt for skinny continues and if you don’t know who that is shame on you for not reading the first post before now. And if you do know who that is i appreciate any suggestions you have for killing him. See y’all next time</p>\n\n<p>Cole, signing off.\n<a href=\"https://www.reddit.com/r/nosleep/comments/8j9y4o/my_property_isnt_normal/\">part one</a> </p>\n\n<p><a href=\"https://www.reddit.com/r/nosleep/comments/8khkip/my_property_isnt_normal_part_3/\">Part Three</a> </p>\n</div>\n","author":"Murderbird17"}