{"rank":"182","title":"I've Seen Something Strange In Just About Every State: Pennsylvania","id":"8joadb","url":"/r/nosleep/comments/8joadb/ive_seen_something_strange_in_just_about_every/","time":"1526411692000","body":"<div class=\"md\"><p><a href=\"https://www.reddit.com/r/nosleep/comments/8ip4f6/ive_seen_something_strange_in_just_about_every/\">Nebraska</a>  </p>\n\n<p><a href=\"https://www.reddit.com/r/nosleep/comments/8lmksc/ive_seen_something_strange_in_just_about_every/\">North Dakota</a></p>\n\n<p>From the time that I was fifteen to the time that I was seventeen, my family and I lived in western Pennsylvania. The area, rife with abandoned factories, crumbling roads, and desperate people, was smack dab in the middle of the Rust Belt. The place we lived in was close to the Ohio border, so it always felt like we were half in the East and half in the Midwest.</p>\n\n<p>The trouble with living in a rural town in both regions was that there often wasn’t much to do. Things got a little better when my friends and I turned sixteen and got our driver’s licenses. An old rusting Chevy might not have looked like much to onlookers, but to me it was a source of freedom. A quick stint on Interstate 79, and we could get to nearby cities like Pittsburgh and Erie. Those trips made my time living there more bearable. </p>\n\n<p>Of course, Interstate 79 wasn’t the only stretch of road we liked to haunt. Sometimes a few friends and I would drive the older State Route 351. Its pot-hole strewn pavement wound in and out of thick forests and hills, making for some interesting scenery during the day. At night, its 17.3 miles of asphalt took on a more sinister quality.</p>\n\n<p>It was my friend Dan that introduced me to the legend of Charlie No Face. Known as Ray Robinson in life, the man had been badly injured as a child resulting in loss of his eyes, nose, and right arm. The sight of a severely scarred man might have been a source of disgust in a more urban setting, but in the middle of nowhere with not much to look at, Ray Robinson became a curiosity. </p>\n\n<p>People sought him out on his frequent nightly walks of State Route 351. They’d come from miles and miles away just to catch a glimpse of a man who needed neither his sight nor his sense of smell to make a good go at living. </p>\n\n<p>By the end of his life, sometime in the 80s, Charlie No Face had risen to such legendary proportions that his name and background grew out of reality and into fiction. For years after his death, teenagers would traverse the old road hoping to spot the bogyman with no face.</p>\n\n<p>My friends and I were no different. Once we’d heard of Charlie, we couldn’t get him out of our heads. We used to go out on Fridays nights and drive back and forth between Koppel and New Galilee looking for a shuffling figure in the darkness. Most of the time, the scariest thing we’d see is a large buck bounding out of the woods, intent on playing chicken with the car.</p>\n\n<p>One night just before my seventeenth birthday, however, we saw something else entirely. My friend Dan was driving. I was in the front passenger seat, and our friends Kenneth and Roger were in the back. It was a rainy March night, the kind whose coldness seeps into anything and everything. </p>\n\n<p>I watched the windshield wipers as they raced back and forth, trying to keep up with the deluge. “Slow down man,” Roger pleaded from the backseat. </p>\n\n<p>Dan laughed, but complied, “wimp.” I smiled and looked out the passenger window. It was hard to see much between the rain and darkness, but I thought I saw a large form emerge from the trees.</p>\n\n<p>“What the hell is that?” I asked the others. Dan slowed his Tahoe to a crawl and the four of us peered off toward the dense foliage on my side. We watched as the bi-pedal shape limped its way toward our idling car. Unable to make out any specific features, I reached into the glove compartment and extracted a flashlight. </p>\n\n<p>The heavy duty illuminator generated enough light to cover the several yards between us and the unknown entity. The beam rose from the overgrown grass to unveil two dirtied and scraped bare feet, a ragged pair of jeans, a bloodied flannel shirt, and finally a face sans eyes and nose. The trifecta of gaping holes was accompanied by bloodied flesh and a mouth twisted in agony. </p>\n\n<p>The man – the <em>creature</em> - must have heard our screams of fright for he turned in our direction, and with arms outstretched and stumbled toward us. </p>\n\n<p>Dan slammed his foot down on the accelerator and after a moment of fishtailing the car was once more zooming down old State Route 351. This time no one told him to slow down. We sat there in stunned silence for a few moments digesting what we had seen.</p>\n\n<p>It was Kenneth who broke the tense quiet. “You guys saw what I saw, right? No Face Charlie?”</p>\n\n<p>I glanced sideways at Dan and met his eye. I shrugged and ran a trembling hand through my hair, “I don’t know, man. I don’t know what the hell that was.”</p>\n\n<p>“I bet it’s his ghost,” Roger broke in, “he’s probably pissed off people keep coming to look for him.”\n“No, way,” Dan snapped, “everyone knows No Face Charlie is just an urban legend. Besides, ghosts aren’t real. It was probably just an asshole playing a prank.” He voice wavered as he spoke, and he didn’t sound convinced.</p>\n\n<p>We didn’t speak much after that and called it an early night. In the weeks that followed none of the other three mention what we had seen. I tried to bring it up with them once, but they’d acted like it never happened. </p>\n\n<p>I found I couldn’t let the incident go so easily. Especially when I began to ask around at school about No Face Charlie sightings. I was surprised to discover that many of my classmates had had encounters in some form or another with him. When I plied them for details, however, the specifics of the entity they had seen always differed. Sometimes they had seen a short, stocky man with no eyes and no ears. Sometimes it was a tall, lanky fellow with no arms and no eyes. </p>\n\n<p>All of the differences made me wonder if they had actually seen anything at all. Perhaps these were just cases of mistaken identity – them wanting so badly to see a mythic figure that they’d attribute just about anything and everyone on that desolate stretch of road to the legend.</p>\n\n<p>I decided I’d do a bit more reconnaissance. I tried to get my friends to go with me, but they’d been avoiding the road like the plague. So I got in my car late one Saturday night, and I drove off into the darkness by myself. The trip between Koppel and New Galilee only took about ten minutes, so I made the trip back and forth several times.</p>\n\n<p>Finally, frustrated from the lack of any suspicious activity, I pulled my car off the road in between the two towns. I turned off the car and waited. Shivering in the absence of warmth from my heater, I debated on whether I should at least put on the overhead interior light. Not wanting to alert anyone of my presence, I decided against it.</p>\n\n<p>It was nearing two in the morning when I was jarred from a deep reverie. With my chin resting on the steering wheel, I was able to see out the windshield, down the road, and into the densely packed forest on either side. From the stillness a bulky shape detached itself from the shadow of the trees just ahead and to the left.</p>\n\n<p>The person – a man if I were to guess – tripped and fell to his knees. He crawled forward feeling his way with one hand while the other he held steadfastly over his right eye. The half-moon drifted out from behind a cloud, and with the sudden illumination I could see rivulets of blood pouring from between his fingers, and down his right cheek.</p>\n\n<p>“Help!” The cry was hoarse, but still intelligible. “Please, someone help!”</p>\n\n<p>I reached for my car door handle, intent on helping this clearly injured individual, when I saw another person emerge from the foliage. Frozen with uncertainty I watched as the newcomer looked first one way and then another down the road. Apparently pleased with the lack of cars, he stepped forward into the clear. </p>\n\n<p>He strode purposely forward, intent it seemed on reach the stumbling man. I nearly vomited when I saw him overtake the man on the ground, and stab him repeatedly in the back with a large knife; he jerked in pain several times before growing still. The moon once more disappeared behind a cloud taking with it the light, but not before I witnessed the attacker drag his victim back into the depths of the trees.</p>\n\n<p>I waited a few terrifying minutes before I got the hell out of there. I hoped that if the killer was still lurking, he’d have seen nothing more than a silver blur as my car sped by.</p>\n\n<p>After taking a while to rally myself, I went to the police station the following week to report what I had seen. The officer taking my statement showed me a book of people from the greater Pittsburgh area that had been reported missing, and ask me if I could identify the victim. </p>\n\n<p>The passage of time and darkness of that night made the task impossible. As did the daunting size of the missing persons portfolio. </p>\n\n<p>I was flipping through the various pages of photos when I had an epiphany. All these men were as varying in appearance as the versions of Charlie No Face that seen throughout the decades had been. I had to wonder then if what people had seen had been accurate – a man with no eyes and no nose, <em>another</em> with no arms and no eyes, yet <em>another</em> with no eyes and no ears.</p>\n\n<p>Perhaps State Route 351 was home to more than just an urban legend. Perhaps it was the stomping ground for some deranged serial killer.</p>\n\n<p>My family moved away from that rural town deep within the Rust Belt a few months later. Though I left the state far behind, there was one thing I learned from my time in Pennsylvania that’s always stuck with me:</p>\n\n<p>The true horrors in life aren’t generated by urban legends, but rather from the things hiding behind them.</p>\n</div>\n","author":"thecuriousdeadcat"}