{"rank":"36","title":"I managed to open my third eye while studying psychology","id":"8jogek","url":"/r/nosleep/comments/8jogek/i_managed_to_open_my_third_eye_while_studying/","time":"1526412922000","body":"<div class=\"md\"><p>“Reality is only an opinion, each experience merely a perspective”</p>\n\n<p>That’s the one quote that rings true through my mind as I sit here within my room and stare into my computer screen emotionlessly. I don’t know when I started to lose my mind but one thing is for certain. I’m not safe.</p>\n\n<p>It all started when I stayed late after class at Miskatonic University in Massachusetts. I was a psych major and was studying a series of people falling to neurotic episodes in the 1920’s. Reading through most of the files, I found accounts of several patients that seemed to have suffered from the disorder. Reactions to it spanned from full recoveries to relapsing almost every other week. It wasn’t until I reached the last file within the database that things started to get...odd. </p>\n\n<p>The file seemed to have multiple accounts of neurotic episodes that each ended with the patients dying mysteriously from a fever. I can’t say that was the part that disturbed me, however, it was the striking similarity between each of the patient’s accounts prior to their death. </p>\n\n<p>Each patient described seeing a strange...city made out of a green like material with a geometry that’s far beyond human comprehension. After seeing that I decided to call it a day with studying and just pick up on things in the morning.</p>\n\n<p>The next day, I went back to the library and asked the librarian about the accounts that I discovered the day before. It was then that I remember the librarian’s face turning grim as she looked right at me and told me that some things are best left unknown.</p>\n\n<p>Not wanting to press I started to do my regular studying while making extensive notes about the visions of this city and what it could mean. Eventually, my studying lead me to begin looking into other accounts of visions like this on the internet. Unfortunately, I had little luck, for many of the results were underwhelming to say the least. </p>\n\n<p>However, I did come across one account. Apparently, around the time when people started get visions of this city, there was a raid on a psychotic religious group that appeared to have been chanting incoherently. When the police arrived on the scene only a handful of them were alive. After the capture, the police confiscated a strange statue of a creature curled in what looked like a fetal position. Even with the terrible quality of the cameras back then I could see that the relic was much more lifelike than those of a similar age.</p>\n\n<p>That same night, after researching, I fell asleep rather quickly from the mental exhaustion of constant study and drifted into an enigmatic nothingness. However, in the comforting blankets of darkness, I saw a faint green glow outlined with the shapes of jagged structures and dark monoliths. The architecture of the structures seemed impossibly unreal and outside of anything that the human mind can hope to comprehend. Despite the amazement of it all, I somehow felt fearful of the place. Adrenaline surged through my body as I peered at...what looked like a city of some kind and as I stand...frozen within this limbo I begin to hear a low distorted hum sound. The longer the hum plays, the more furious it sounds going from a simple bass to a sinister melodic outcry. </p>\n\n<p>Before anything else could happen, I jolted awake in my bed and took a look at the alarm.</p>\n\n<p>9am</p>\n\n<p>Letting out a sigh I draped one arm over my eyes as I tried my best to shake off the memory of the dream. It didn’t take long for, as I layed there, I started to feel my skin crawl, as if I was encased with a sea of discomfort. Opening my eyes was a mistake.</p>\n\n<p>As soon as I opened my eyes I saw something horrific. Hundreds of thousands of centipedes covered my body...large, thrashing, lifting their bodies as they ravaged my own. I was only able to see this for a brief moment before the darkness took me against my will and I felt a severe pain within my eye sockets. Despite not seeing them...I could hear them, every individual leg moving across my body percussively. </p>\n\n<p>It didn’t take me long to cry out. </p>\n\n<p>Upon yelling, the centipedes seemed to have subsided and I opened my eyes to see that I’m sitting in my room alone with nothing but the morning sun. Looking at the clock I saw that it was noon and I quickly threw on some clothes before bolting to class. </p>\n\n<p>I didn’t get much of the lecture. I was too busy thinking about everything that’s happened thus far...plus, I could have sworn that the walls and the ceiling were festering insect like eyes of different shapes and sizes throughout the class period. Afterward, I found myself walking to the library again and, upon arrival, the librarian gave me a shake of the head as I returned to the psychology section to do my daily studying. </p>\n\n<p>Hours passed and I found nothing more on the dream phenomenon and, as I was lost in my craft, I had my focus broken by the sound of the librarian’s heels. Looking up from my workstation I see the librarian tell me that they were about to close. Nodding politely I packed up all my things and started toward the door. </p>\n\n<p>It was then that I heard the sound of footsteps matching mine perfectly. Stopping for a moment I turned around and saw an expressionless librarian staring into me. Slightly creeped out, I continued toward the door only to see her in front of me. Before I could react, the librarian snatched my forearm with a cold...inhumane grip and stared into my eyes with a look bordering on hatred.</p>\n\n<p>“I told you that some things are best left unknown. And now you’ve crossed a line you can never come back from.”</p>\n\n<p>The librarian’s eyes rolled back and her head split in half, gushing out blood as her head transformed before my eyes into an amalgamation of multiple body parts and entrails jumbled together with minds of their own. In the center of her multiple appendages was a large circular mouth with rows upon rows of sharp teeth. Fear jolted through me as I kicked and screamed, trying my hardest to get her off me. </p>\n\n<p>My efforts were futile.</p>\n\n<p>The abomination’s head descended upon the arm that was being held and forced its appendages into it piecing the skin and splitting it open until I could see bone. Blood poured out onto the library floor as I felt my head begin to throb. Pushing her teeth deeper into my arm the creature gripped on to my other arm and held me in place. At this point, my arm felt numb and the throbbing in my head turned into a severe shooting pain as I saw the creature get thrown across the room by some unseen force and smash neck first into a nearby desk. </p>\n\n<p>Not waiting to see if she’s alive I sprinted from the library and started to dial 911. The police picked up immediately and I waited just outside campus for them to arrive. Upon arrival, I saw two police cars and an ambulance arrive. The people in the ambulance were the first to walk toward me and I breathed a sigh of relief. That’s when I noticed it. Their eyes, seemed blank and expressionless. </p>\n\n<p>Standing up suddenly I turned and sprinted as fast as I could. Behind me all I heard was the gruesome stirring of flesh that hinted at the visceral transformation of these monsters. Not wanting to look back I stopped in front of my apartment, luckily I lived close. Opening the door to my room, I locked and barricaded the door behind me. </p>\n\n<p>So, here I am, locked and alone in a room of eyes staring into my soul that shall soon be judged by whatever is beyond. Blinking unforgivingly as they watch me type this final message to whoever is out there.</p>\n\n<p>To all my fellow researchers, I tell you to tread lightly and carefully. For the cost of true enlightenment is far too much for the human mind to handle.</p>\n</div>\n","author":"GanstaPiccolo"}