{"rank":"789","title":"There's Nothing Wrong With My Little Daughter","id":"8jomlp","url":"/r/nosleep/comments/8jomlp/theres_nothing_wrong_with_my_little_daughter/","time":"1526414225000","body":"<div class=\"md\"><p>&quot;I&#39;m sorry that we have to meet under these circumstances, Mr. Fenix, but it&#39;s an absolute must, that we talk about Abigail.&quot;</p>\n\n<p>I look down at my watch and let out a sigh.  &quot;Mrs. Johnson, there&#39;s probably a misunderstanding...&quot;</p>\n\n<p>&quot;No, Mr. Fenix...&quot;</p>\n\n<p>&quot;Just call me Adam.&quot; I asserted.</p>\n\n<p>&quot;Mr.Fenix, your daughter...&quot;   She pulls out a stack of paper and pushes it toward me. &quot;...has been drawing these in class.&quot;</p>\n\n<p>I pick one up and looked at it.  &quot;This is a drawing of a Dragon. What&#39;s wrong with that?&quot; I picked up another drawing. &quot;This one is of a Butterfly with razor sharp wings. She loves Comic books. I don&#39;t see why...&quot;</p>\n\n<p>The Counselor interrupts. &quot;Keep looking.&quot;</p>\n\n<p>I go through about a dozen more drawings and found one of a little girl holding a decapitated head. I look over at my daughter. Her eyes fixated on the floor. &quot;Abigail. &quot; She looks up. &quot;Yes, Daddy.&quot;</p>\n\n<p>&quot;What&#39;s this about?&quot; &quot;It&#39;s about a dream I had. There was a man who wanted to kidnap me and so I killed him.&quot;</p>\n\n<p>Mrs. Johnson tenses up.</p>\n\n<p>&quot;How come you were dreaming about such a thing.&quot; I asked.</p>\n\n<p>&quot;Mrs. Roberts was talking about stranger danger in class that day.&quot; said Abigail.</p>\n\n<p>Oh, it totally makes sense now in my head. My daughter had a day filled with talks about creepy people and so, naturally, she is going to have a dream about it.</p>\n\n<p>&quot;Mrs. Johnson, my daughter is bright and creative. She wants to be an artist.&quot;</p>\n\n<p>Mrs. Johnson is very stern. &quot;Keep looking.&quot; she repeats.</p>\n\n<p>I reach over and grab the rest of the stack. As I look through them, the drawing becomes more and more sinister. There was a drawing of boy with a gun and dead kids all around him. Another drawing is that of the word &quot;KILL! KILL! KILL!&quot; written repeatedly on a chalkboard. Another one shows a cat hanging from a tree. Yet another is of a Mother putting her children into the dryer.</p>\n\n<p>&quot;Now you see, Mr. Fenix, why we have to talk about Abigail?&quot; said the Counselor.I put down the stack of drawings and asked the Counselor if I can have a moment with my daughter.</p>\n\n<p>The Counselor obliges and leaves the office.</p>\n\n<p>&quot;Abigail, talk to me, honey.&quot;</p>\n\n<p>&quot;Daddy, it&#39;s not me. He wants me to draw those things.&quot;</p>\n\n<p>&quot;He? Who&#39;s he?&quot;</p>\n\n<p>&quot;He&#39;s scary, He stands behind me in class and tells me to draw these things.&quot;</p>\n\n<p>&quot;Abigail, listen to Daddy. I want you to look me in my eyes and tell me that you&#39;re not lying to me.&quot;</p>\n\n<p>&quot;Daddy, I am not lying to you. He...&quot;</p>\n\n<p>&quot;Abigail, listen. Your teacher is very concerned about these drawings. Mrs. Johnson is the school counselor. She is very concerned about these drawings.&quot;</p>\n\n<p>&quot;You&#39;re not listening to me. I didn&#39;t draw these because I wanted to. The scary man who stands behind me in class is making me draw these things.&quot; My daughter&#39;s eyes welling up.</p>\n\n<p>&quot;What man? How can a man just walk into a classroom and nobody notices him.&quot;</p>\n\n<p>&quot;I don&#39;t know.&quot;</p>\n\n<p>&quot;Abigail, this is my final warning to you. I don&#39;t want to hear any more lies coming out of you again.&quot;Abigail stays quiet. She pouts and looks the other way. Her arms folded.</p>\n\n<p>&quot;No more comic books. No more video games. No more of anything. You&#39;re getting out of hands with your imagination.&quot; I told her.</p>\n\n<p>&quot;THAT&#39;S NOT FAIR!!!&quot; she yells.</p>\n\n<p>I was going to say something else to her but I stopped myself. I collected myself. What should a good father do? a good father listens, I thought to myself. My precious daughter is all I have.</p>\n\n<p>&quot;Abigail. About this man that stands behind you in class. What does he look like.&quot;</p>\n\n<p>&quot;He&#39;s very pale and his fingers are long. I don&#39;t like looking at him. He&#39;s got a hundred ugly teeth. He is a scary man.&quot;</p>\n\n<p>&quot;Did this man hurt you in any way?&quot;</p>\n\n<p>&quot;No. He just stands there. Sometime he points with his long fingers at my drawing to let me know that I am doing a good job.&quot;</p>\n\n<p>&quot;Does any of the other kids see him as well?&quot;</p>\n\n<p>&quot;No. He only comes to me.&quot;</p>\n\n<p>&quot;Mrs. Roberts just lets him in the class?&quot;</p>\n\n<p>&quot;Mrs. Roberts doesn&#39;t care.&quot;</p>\n\n<p>&quot;Why not?&quot;</p>\n\n<p>&quot;Because Mrs. Roberts, like you, called me a liar when I tried to tell her.&quot;</p>\n\n<p>I leaned back in my chair. Perplexed. Why is my daughter saying these things. I motioned for Mrs. Johnson to come back inside.</p>\n\n<p>&quot;Would you mind letting me in on this little discussion?&quot; she asked.</p>\n\n<p>&quot;Mrs. Johnson, I know this may sound crazy but my daughter is telling me that there is a creepy man that comes in the classroom and stands behind her and forcing her to draw these morbid drawings.&quot;</p>\n\n<p>&quot;A man? how is that possible. The whole school would have been surrounded if a....&quot;</p>\n\n<p>&quot;Yes, I know, but she is very adamant about it. There is nothing wrong with my little daughter. I think I believe her.&quot;</p>\n\n<p>Mrs. Johnson pauses and gives me a look. She&#39;s not biting.</p>\n\n<p>The counselor gets up from her chair and motions for me and my daughter to follow. In the hallway, she pulls me aside and spoke softly under her breath.</p>\n\n<p>&quot;Mrs. Roberts is still in her classroom going over some papers. I suggest you go see her and sort this out. I don&#39;t know what else I can do. If anything should arise, and you have any concerns or questions. You can always call me. Even during off-hours. I am here for you and Abigail.&quot;</p>\n\n<p>I thanked her and off we went toward Room number 22.Mrs. Roberts is a portly woman. I know I shouldn&#39;t point out her size like that but I think that&#39;s part of her charm. Very motherly. Always full of sunshine.</p>\n\n<p>I peek my head inside the classroom. Mrs. Roberts is at her desk with her head down low squinting at some paper.  &quot;Hello, Mrs. Roberts.&quot; I said.</p>\n\n<p>She looks up and instantly flashes a giant, heart warming smile.  &quot;Mr.Fenix, what brings you here this late. How&#39;s Abigail doing?&quot;</p>\n\n<p>Abigail tucks away behind my back. She&#39;s refusing to look inside the classroom.  Mrs. Roberts suddenly remembers why I&#39;m visiting her.</p>\n\n<p>On the walls were a bunch of drawings by the other children. &quot;Mrs. Roberts&quot; bright smile quickly disappears. She motioned for me to come inside.</p>\n\n<p>&quot;Abigail is a wonderful girl. Lovely student. She&#39;s also quite the artist but it&#39;s the subject matter I&#39;m a little wary of.&quot;</p>\n\n<p>She points to a drawing on the wall made my Abigail.  &quot;I couldn&#39;t bring myself to take it down because I didn&#39;t want to hurt her feelings.  Take a look for yourself.&quot;</p>\n\n<p>She points toward Abigail&#39;s drawing tacked up between a drawing of a rainbow with cats underneath it and a Unicorn shooting stars out of its mouth.</p>\n\n<p>Her drawing was of a pale man with long fingers. His eyes were tiny, black and round. His abnormally large mouth agape with hundreds of pointed teeth protruding from within it.  Below him sits a little girl at her desk with her head buried in her arms. There is a word balloon and inside, it reads:  &quot;Shhhhh, It&#39;s going to be alright, Abigail.&quot;</p>\n\n<p>&quot;Abigail say that this man in the drawing stands behind her in class and forces her to draw these horrendous things.&quot;   I said without turning to look at Mrs. Robert.  &quot;What do you make of it?&quot;</p>\n\n<p>&quot;Mr. Fenix, I&#39;m sure this is a just phase and is easily fixable. You, as a father, knows what&#39;s best for her. Kids are brutally honest but also very vulnerable to their surrounding. A days worth of playing video games could trigger these nightmares.&quot;</p>\n\n<p>Abigail, who was milling about outside the classroom suddenly walks in and goes to her desk as if by command.</p>\n\n<p>She pulls out a piece of paper and a pencil and starts doodling. Mrs. Roberts looks over at her.  She nods at me.</p>\n\n<p>&quot;Let&#39;s just let her have her way with it and we&#39;ll see what she comes up with this time.&quot;</p>\n\n<p>Abigail then began furiously sketching away at the paper. She&#39;s gripping the pencil with her hand and drawing in circles.</p>\n\n<p>&quot;Honey, stop that. You&#39;re going to hurt yourself.&quot;    Abigail continues to violently draw in circles.    Her arms are moving against her will. She cannot stop.</p>\n\n<p>Something prevents me from going toward her. I feel as though I was shackled in place. Paralyze. Helpless.</p>\n\n<p>Her pencil snaps in two. She breaks out of her trance.</p>\n\n<p>&quot;Honey, are you alright?&quot; I yelled out. </p>\n\n<p>She looks up at me with her eyes full of terror.</p>\n\n<p>&quot;He&#39;s standing right behind me, Daddy.&quot;</p>\n</div>\n","author":"Abstractcastle"}