{"rank":"5","title":"I am stuck with this?","id":"8jonw6","url":"/r/nosleep/comments/8jonw6/i_am_stuck_with_this/","time":"1526414493000","body":"<div class=\"md\"><p>30 square feet. Perfectly symmetrical walls, no windows, no entrance not a single scratch or hole on the walls. It&#39;s just pitch black. \nThe only thing I remember was going to sleep. When i woke up I was here. It&#39;s kinda embarrassing that it took me a couple minutes to realize that I wasn&#39;t in my room anymore. I thought this was a nightmare...oh well...</p>\n\n<p>The wall was extremely smooth and felt warm to the touch and it was so quiet that I could hear my heartbeat. I stopped screaming and hammering a while ago but quickly realized that I would be running out of oxygen soon.</p>\n\n<p>It can be difficult to judge the passage of time when you can&#39;t see anything.</p>\n\n<p>I was lying on the ground when I heard a soft voice coming from right in front of me. My hair was standing up and I jumped back and pushed my body to the wall behind me. </p>\n\n<p>&quot; Who are you? &quot;, said a female voice.\n&quot; Who are YOU?&quot;, I countered.</p>\n\n<p>&quot; I am Freya... why are you scared?&quot;, she asked with a genuinely puzzled voice.</p>\n\n<p>&quot; Well...for starters you just appeared out of nowhere.&quot;, I answered still tensed up. </p>\n\n<p>&quot; What? No. When I woke up, you were lying on the ground sleeping. &quot;</p>\n\n<p>&quot; I was?...it&#39;s hard to keep track when it&#39;s pitch black. Seriously, there are no entrances here. &quot;  </p>\n\n<p>&quot; Pitch black? It&#39;s really bright in here. What are you talking about??&quot;</p>\n\n<p>She had to be lying. </p>\n\n<p>&quot; Oh really? Describe how I look then.&quot;, I challenged her. </p>\n\n<p>The room went silent for a moment. </p>\n\n<p>&quot; Caucasian, short black hair, greenish-blue eyes, a scar on your left cheek, relatively muscular....&quot;</p>\n\n<p>I stopped her. </p>\n\n<p>&quot; Okay, I get it. So, I am blind? Is that it?&quot;, I said realizing in horror.</p>\n\n<p>&quot; I am sorry.&quot;, she said and squeezed my hand. &quot; What is this?&quot;, she screamed.</p>\n\n<p>&quot; What? What happened?&quot;, I asked. </p>\n\n<p>I heard scratching sounds coming from her direction. </p>\n\n<p>&quot; I...I couldn&#39;t feel anything. I can&#39;t even feel my own face. When I took your hand, I couldn&#39;t feel a thing. Wait...&quot;, she said.</p>\n\n<p>&quot; The walls...what the hell?&quot;, she said. </p>\n\n<p>&quot; What’s happening...speak to me.&quot;, I demanded.</p>\n\n<p>&quot; The wall right behind you started counting down from 1000 and on the wall in front of us, some lines appeared.&quot; </p>\n\n<p>A countdown. So, we have like...15 minutes? For what?</p>\n\n<p>&quot; Read it out loud.&quot; </p>\n\n<p>&quot; It doesn&#39;t make much sense to me. &quot; </p>\n\n<p>&quot; Just... read it. &quot; </p>\n\n<p>&quot; Three gods, Sun, Moon, and Earth, are challenging you. \nOne always speaks the truth, one always lies and one speaks both. Which one of the gods is the liar?&quot;, she read.</p>\n\n<p>&quot; A fucking riddle? Whoever captured us wants us to solve this riddle in 15 minutes?&quot;</p>\n\n<p>&quot; Why? Why would some1 kidnap us and do this to us? Also...why are you blind and why can&#39;t I feel anything I touch???&quot;, she said hysterically.</p>\n\n<p>&quot; Calm down. This just means. We just need to solve this asap.&quot; </p>\n\n<p>&quot; I got nothing.&quot;, she said. &quot; Any ideas?&quot; </p>\n\n<p>I had a couple ideas but dismissed them immediately...it&#39;s almost like...</p>\n\n<p>&quot;510 seconds left&quot;, she said.</p>\n\n<p>&quot; I feel like we are missing some clues here. Are you sure there isn&#39;t anything else? &quot; </p>\n\n<p>&quot; Nope just us...&quot;, she said.</p>\n\n<p>Us? Oh.  I started stripping.</p>\n\n<p>&quot; What the HELL are you doing? &quot;, she asked.</p>\n\n<p>&quot; If we are the only ones in the room, then that might make US the hints. Do you see anything unusual on my body? Any signs. writing, anything suspicious at all?&quot; </p>\n\n<p>I stood up and turned around.</p>\n\n<p>&quot; Wait. On your back, there is a sun tattoo. I take it, that you never had any tattoos before? &quot;, she asked.</p>\n\n<p>A tattoo of the sun? </p>\n\n<p>&quot; Well, the most logical thing, would be to assume that you are the sun from the riddle. So... remains the question... are you the liar? &quot; </p>\n\n<p>&quot; I haven&#39;t lied since I got here. So, the sun, which is me, is telling the truth.&quot;</p>\n\n<p>&quot;312 seconds&quot;, she said. She didn&#39;t protest my claim. Weird.</p>\n\n<p>&quot; Your turn, strip, I will pat you down. &quot;</p>\n\n<p>&quot; Is that necessary...&quot;, she said.</p>\n\n<p>&quot; Do you want to find out what happens when the timer hits 0 ?&quot;, I asked. </p>\n\n<p>She sighed. </p>\n\n<p>&quot; Okay, I am done.&quot;, she said pissed.</p>\n\n<p>I started with her shoulders. When I reached her lower back, I sensed something. It was vague, but I was sure it was a circle. </p>\n\n<p>This didn&#39;t really help... Moon and earth are round... so this seems like a red herring.</p>\n\n<p>&quot; You realize, that if I say the truth then by default, you have been lying about something.&quot;, I said.</p>\n\n<p>&quot; Where is this coming from? What did you feel on my back, tell me. I haven&#39;t been lying about anything. &quot;, she said.</p>\n\n<p>&quot; It&#39;s a circle. There is a circle on your lower back. &quot; </p>\n\n<p>&quot; So, it won&#39;t straight up tell us which one I am, that&#39;s a problem.&quot; </p>\n\n<p>We stood still. </p>\n\n<p>&quot; 141 seconds left.&quot;, she said.</p>\n\n<p>Wait. Something was odd. Why wouldn&#39;t she tell me the countdown in steps of hundreds? What was it, again? 510...312 and 141?</p>\n\n<p>The sum of each is 6... so she is referring to 666? Like the bible demon thingy? What is she trying to say, though? Was she the liar? Why is she speaking in code?<br/>\nMaybe...she was forced to. AH....It&#39;s another rule, specifically for her. Along the lines of...&#39;You are this certain god but you can&#39;t tell him directly.&#39; Along those lines.</p>\n\n<p>I got a hunch but... better safe than sorry.</p>\n\n<p>&quot; 51 seconds. You never told me your name. &quot;, she said in a cheery tone. </p>\n\n<p>&quot; It&#39;s Lance....Are you sitting in front of the one who speaks the truth.&quot;</p>\n\n<p>&quot; Yes!&quot;, she said.  Got it...</p>\n\n<p>&quot; Who is sitting in front of the sun?&quot;</p>\n\n<p>&quot; The moon. &quot; </p>\n\n<p>&quot; Where is the earth?&quot; </p>\n\n<p>&quot; Nowhere.&quot; </p>\n\n<p>I got it. She was twisting everything. About herself. That&#39;s the 666 for. She was lying but she was saying the truth when she addressed me. Meaning...</p>\n\n<p>&quot; I am the sun, speaking the truth. You are the earth, speaking both. Which leaves the moon... which is the room, who is the liar. &quot; </p>\n\n<p>She went silent...My heart was racing...was I wrong? </p>\n\n<p>&quot; Oh thank god. You got the friggin hint....&quot;, she hugged me while crying. \n&quot; I thought I was a goner there for a sec.&quot; </p>\n\n<p>&quot; You lied about everything... That you couldn&#39;t feel anything. Even your name...&quot;</p>\n\n<p>&quot; Yup. Those were the rules.&quot;, she said while wiping away her tears.</p>\n\n<p>Suddenly my eyes started burning...my eyesight came back and I was staring at a blonde girl with big glasses. She had porcelain skin and bright blue eyes. Around my age, maybe a little younger. She had a rather sporty body and her left breast seemed slightly bigger than the right. How curious.  </p>\n\n<p>&quot; Put on your clothes.&quot;, I said rather enjoying the view.</p>\n\n<p>&quot; What? You don&#39;t like what you see?&quot;, she said in a cheeky tone.</p>\n\n<p>Guess she was lying about being shy too...</p>\n\n<p>&quot; What&#39;s your real name?&quot;, I asked curiously.</p>\n\n<p>&quot; Marianne. But my friends call me Mary. Nice to officially meet you, Lance.&quot;, she said while putting her clothes back. </p>\n\n<p>She continued...</p>\n\n<p>&quot; To be honest...for a second I thought you wouldn&#39;t realize that I was lying about myself the whole time...Well I couldn&#39;t lie about the timer and stuff... Oh well... Anyway. I guess the next stage awaits.&quot; </p>\n\n<p>She pointed to a black door that appeared in the middle of the room. \nIt just hovered there, and she made an attempt to open it. </p>\n\n<p>&quot; Wait. Tell me what you know!&quot;, I grabbed her hand.</p>\n\n<p>&quot; Nothing.&quot;, she said cold. </p>\n\n<p>Something in her tone ticked me off.</p>\n\n<p>&quot; You are lying. Tell me the truth or I will break your wrist. &quot;, I said pissed off.</p>\n\n<p>&quot; Look...All I know is that this is a game....&quot; </p>\n\n<p>I nodded slowly and let go of her hand. </p>\n\n<p>&quot; ...and that we were selfishly sacrificed... &quot;, she looked at me.</p>\n\n<p>Sacrificed?</p>\n\n<p>&quot;...on the wall it said that we can free ourselves by keep playing.&quot; </p>\n\n<p>&quot; Playing what? And what happens if we lose?&quot;, I asked.</p>\n\n<p>She came up close to me. </p>\n\n<p>&quot; I. have. no. fucking. clue. That was all. All I know is that we are playing some supernatural game that might or might not kill us. But the only way forward is through THAT fucking door. So grow a pair and let&#39;s go.&quot;, she said condescendingly while pointing at the black door. </p>\n\n<p>I didn&#39;t say anything and just looked at her for a heartbeat. \nI was stuck with...this...brat? </p>\n\n<p>I sighed.</p>\n\n<p>&quot; Well, don&#39;t piss yourself, this cute girl will save your ass when she has to. &quot;, she turned around and put her hand on the door knob.</p>\n\n<p>&quot; I liked you better when I was blind.&quot;, I whispered to myself.</p>\n\n<p>She gave me a sharp look. </p>\n\n<p>&quot;I heard that.&quot;</p>\n\n<p>For some reason the atmosphere got really weird really fast between us. </p>\n\n<p>&quot; Just focus on the door...blondie.&quot;</p>\n\n<p>&quot; Oh shit. Was that supposed to hurt my feelings? Weak... &quot;, she said while opening the door. </p>\n\n<p>Suddenly a wall of water welcomed us. We both were flung back and hit the wall. Her body smashed into mine and the water kept flowing in and kept pressing us against the wall. </p>\n\n<p>We had to go... no... swim through this door. Asap.</p>\n</div>\n","author":"SleepyGod01"}