{"rank":"7","title":"The Red Bridge","id":"8joy47","url":"/r/nosleep/comments/8joy47/the_red_bridge/","time":"1526416663000","body":"<div class=\"md\"><p>I have to write this fast. I don&#39;t know how long I have until IT shows up again. Let me quickly tell you my dilemma.</p>\n\n<p>I lived in a town in North Carolina. Newer town, nice people, good houses, I was living the dream. I had a brother who played baseball. The baseball field was on an island that was surrounded by a small creek. technically it wasn&#39;t an island but me and my friends liked to call it that. There were two ways to get in: a newer metal bridge or a old wooden bridge. My neighborhood was closer to the metal bridge so that&#39;s the one we took.</p>\n\n<p>So fast forward a year and i&#39;m at my brothers baseball game. The island was crowded since there was a large party going on nearby, and it just so happened that it ended exactly when my brother&#39;s game was ending. The metal bridge was filled with people and I wanted to get home to play Minecraft. Note that it is 2014 so it&#39;s all the rage. So we decide to go down the Red Bridge. The bridge is maybe 5 meters so it is not too long. We get to the edge of the bridge and suddenly my brother stops. He says that he doesn&#39;t feel safe going down the bridge. Annoyed I told him there was nothing wrong. How wrong I was.</p>\n\n<p>After a minute of arguing I just grabbed him and started dragging him across the bridge. he wrestled out of my grasp just as I stepped over the bridge. I fell over onto my stomach and got the wind knocked out of me. I angrily stepped up and brushed myself off. I turned around to yell at my brother but he was gone. So was the island. The bridge stretched onward in that direction. I looked the other way. The bridge stretched onward. I couldn&#39;t see the end. but then I noticed it. Standing 5 meters away from me was a man with his back to me. He wore a brown suit and had his hair slicked back. Relieved i called out to him where I was. then it turned around.</p>\n\n<p>The thing had no face. No fucking face. There was no detail in it. No moth, eyes, nose, ears, nothing. It reached into its pockets and pulled out a knife. Then it started to walk towards me. Not fast but very slow, like a zombie. It was going maybe a meter a minute. I knew that if it got to me i would be dead. i ran fast. I ran in the opposite direction faster than I ever thought I would. I ran like this for maybe 30 minutes until the thing disappeared in the distance. I grabbed my phone to call the cops, parents, fucking Ghostbusters, anyone. But every time I called someone the phone would turn off and the thing would appear close to me. I ran. I&#39;ve been running for days. But it&#39;s been years for you, hasn&#39;t it? At one point early in my running I had my phone out. My time and date were flying very fast forward. When I stopped, they stopped. I am literally running through time. I found out that I can message forums like this but not directly talk with anyone. I could also check the news. I am writing this now to ask anyone that can hear me, anyone who can hear this, help. I miss my brother. I miss my parents. I miss my friends. I just want to go home. But I can see the thing coming closer. Its empty face mocks me. Please just tell my brother I love him. Please. Don&#39;y go down the Red Bridge. please.</p>\n\n<p>Update: I could see the thing in the distance so I took a few hundred steps away. When I got far away I saw skeleton on the side of the bridge. It wore old clothes and seemed to be holding a journal. I took it and ran ahead some more. I am going to read it</p>\n</div>\n","author":"Fluffles0119"}