{"rank":"6","title":"What happened to a perfect girl","id":"8jp2ra","url":"/r/nosleep/comments/8jp2ra/what_happened_to_a_perfect_girl/","time":"1526417631000","body":"<div class=\"md\"><p>Ashley was a perfect girl. She was skinny, beautiful and rich. Her boyfriend Jason was devastated, they were the sexiest couple in the city. She was blonde and her eyes were green, atletic and stunning. Jason was diferent to nowadays. He used to had  black hair and light blue eyes, he had incredible abs, he was a rugbier.</p>\n\n<p>When they found Ashley&#39;s body his own relief was the alcohol, fast food and stay all day in a couch watching tv. He gained 80 pounds, he went bald. Nowadays he stays all day in his bed gaining more and more weight.</p>\n\n<p>Nobody knew who kill Ashley or why. The case was closed.</p>\n\n<p>Im in my terrace, feeling the soft perfum of my tree peaches. Is so sweet, so tasty. It bring me a memory: Ashley.</p>\n\n<p>She loved fashion, she was glamorous, she wanted to be a famous model, but she was a nasty and superficial girl. She can be so mean and cruel.</p>\n\n<p>&quot; Eww,&quot; she said one day in the gym- &quot; that guy has an horrible skin, is so greasy and full of acne&quot; or &quot; that girl is so ugly, she is so fat&quot;. </p>\n\n<p>I always said to her that she was being mean. </p>\n\n<p>&quot; Im not mean , I just marking their defects so the can change it&quot;. - she said.</p>\n\n<p>I always thought that she was just a Paris Hilton wannabe. Until I discover a dark secret.</p>\n\n<p>I always wondered why a lot of beautiful girls were missing in my town. They never found them. </p>\n\n<p>One night Asley ask me if I can take care of her  house, she was going to Miami with Jason.  </p>\n\n<p>I opened the door of her fancy apartment, I started to clean her room when a jingle distracted me. It was a key in a little chain. It was fell from her Prada blouse.</p>\n\n<p>I examinated, my curiosity was huge. I started looking the door that open that key. I was going to give up when I entered to her favourite room, It was a giant zen garden, she loved that place, drawing in the sand with her rake. It was something eccentric. In the walls were pictures of japanese geishas, cherry blossom flowers, and khanjis. I was distracted so I stuped with a stone in the middle of the way. I felt something hard and it budge in the floor. I wipped the sand, and I found a secret door. I tried the key. It worked.</p>\n\n<p>Now a big hole was open, It was dark, so I took one of the lanterns of the garden. I went downstairs, the smell was different, It was humid, mixed with rot. I couldn`t see much but  I saw lot of vessel, the smell  proceed of all. When I ligtet one I saw dry blood. It was like an horror movie, dry blood, skulls, bones. And in every vessel there where a photograph. All from the missing girls.</p>\n\n<p>I found a notebook that had a lot of creepy and weird recipes to be more beautiful.</p>\n\n<p>&quot; Drink her blood&quot;</p>\n\n<p>&quot; Eat her most atractive part&quot; </p>\n\n<p>I felt sick, that was her secret to be perfect. I have to do something. Ashley was a monster.</p>\n\n<p>I closed her bloody chamber and clean the place. I put her key in the Prada blouse. </p>\n\n<p>The next day Ashley came back. I had a plan.</p>\n\n<p>I knew Aslhey loved tropical drinks, and going to discoteque  to flirt with guys, so i invited her.</p>\n\n<p>After the party Ashley was drunk, so I took her to home, I enter to her appartment. And went to her zen garden.</p>\n\n<p>&quot; Minnie, what are you doing&quot; she said, with her drunk voice.</p>\n\n<p>&quot; Ashley I have a surprise for you&quot; I said</p>\n\n<p>she saw me open her secret room, she was weak to defend her life, I pushed in the stairs, I heard her bones cracking. </p>\n\n<p>She was crying, her legs were brocken. </p>\n\n<p>&quot; Oh Ashley , dont be mean, I just want to know your secret to be pretty&quot;- I said with a grin.</p>\n\n<p>She was mumbling, scared. </p>\n\n<p>&quot; You are the prettiest girl in the city&quot; - I sounded so evil.</p>\n\n<p>Ashley understood but her legs where brocken and very damaged. </p>\n\n<p>I used her knife to kill her , the smell of her blood was sweet like a fruit. I resist to drink her blood I dont want to be a monster like her. I trew her mutilated body in a dirtbag. </p>\n\n<p>The last thing i did was burn down all the bones, pottery and books. </p>\n\n<p>A secret is a secret.</p>\n</div>\n","author":"Celtygenevieve"}