{"rank":"12","title":"Happy belated Mother's Day.","id":"8jp6w6","url":"/r/nosleep/comments/8jp6w6/happy_belated_mothers_day/","time":"1526418478000","body":"<div class=\"md\"><p>I woke up feeling heavy. The loud, shrill beeping to my right was incessant. Without opening my eyes I reached over and fumbled to turn it off. I remained still for a moment but realized I couldn’t just lay there forever. As I rose from the pillow my skin tore away from me in large goopy patches. Stringing like mozzarella from a pizza slice it pulled from my naked body permanently stuck to my grey sheets. I sloshed to the bathroom and turned on the shower. </p>\n\n<p>Glancing in the mirror I didn’t recognize myself. I stood staring into my own blue eyes with no recognition for what seemed like hours but was more likely just minutes. With the mirror fogged up I dredged into the hot steam and under the running water. I let the shower hit me full in the face letting the water wash over me. I felt my old skin running down my body and heard swirling in the drain, new skin fresh and pink appeared in its place on my body. I pulled away from the ever going stream to gasp for air each time my lungs started to burn from lack of oxygen but stayed under the water until I was completely covered in a sparkling new casing. </p>\n\n<p>I backed up to alleviate my face from the onslaught of the water and breathed in and out heavily. As my breathing regulated to normal I started to sob. My body racked with heaves and I began to cough the harder I cried. The coughing turned into violent gagging until my stomach rejected the contents of last night’s meal.  After vomiting at my feet and watching the bile and bit of sandwich still undigested wash down the drain I grabbed soap and washed off, more for ritual than necessity though. </p>\n\n<p>I was on autopilot as my hands grazed over my body. After standing in the shower for a sufficient amount of time I turned the knob to off and pulled the curtain open. I wrapped a towel around my body, my hair dripping water in large splotches of the cloth. I sighed and stepped on the soft plush rug that resided outside my bathtub. Feeling like I was sinking in the deep mesh I placed both feet parallel as I unwrapped the towel and began to dry off my arms and breasts. Moving down I sopped up the wetness from my stomach, legs and between my thighs. I rubbed the towel in my hair to prevent it from leaking down my body undoing all the work I had just accomplished then tossed it to dry over the shower curtain rod. </p>\n\n<p>I shuffled out to the closet and dressed myself in something clean or more likely whatever didn’t smell too badly. Fully dressed I sat gingerly on the edge of my bed putting on my shoes but also contemplating lying back down in my still warm bed. Just letting my bed envelope me again in the comfy large blankets and fuzzy pillows but knew I might not get back up this time. So I pulled myself up from the bed with all the strength I had and walked out the door of my 8th floor apartment. </p>\n\n<p>As I stood in the hallway locking my door, my neighbor, Drew, almost skipping walked past humming a familiar tune and carrying groceries. He suddenly turned about face and looked at me with his head cocked, then asked if I was ok. I responded with a quiet yes, turned and slouched down the hall to the elevator. </p>\n\n<p>Leaning my head against the cool metal of the small box I was lowered towards the street level, but before I reached the first floor it slowed and stopped at the second floor. My eyes opened as the doors pulled apart revealing a smiling girl about my age or a few years younger. I snapped my eyes shut again in the hopes she would understand the signal to not speak to me. She didn’t. My ears were bogged down with her happy notes of positivity and cheerfulness. I looked at her with half lidded eyes and grunted a stifled response. This time she understood and slid over to the empty corner as we made our final decent to the lobby. As she almost bounced out into the street, I slugged my body behind her, the sun glaring down at me in disappointment. </p>\n\n<p>Getting to work was easy, my brain turned off in the automatic guidance of routine. Waves of people passed me but they were all unrecognizable blobs. I walked into the giant grey building a few blocks from my apartment and stealthy down the corridor to my cubicle farm of an office. Finally settling in my office of 3 foot high material covered foam walls, I logged into my computer and opened my emails. </p>\n\n<p>After a few hours of distracted work I realized I needed to go the bathroom. My body willed it away not wanting to move. An object at rest tends to stay at rest, my mother always told me. I focused more intently on my tasks refusing to head to the open areas of my work place. Not too long after I felt the urge again and decided it would be best to listen this time. With my head down and obvious body language of  GO AWAY I raced down the hall and into the restroom. </p>\n\n<p>As I sat in the stall I pulled out my phone for distraction. Social media and advertisements bombarded me with Mother’s day reminders. I shut my phone off and sat in silence for a while. Slowly a tear escaped my closed eye followed by a cascade of salt water river I could not contain. I leaned into it and let myself release all my tension through my eyes. Feeling a waterfall down my face and into my lap I gasped for breaths and silently moaned. The heavy water drenched me and began to pool onto the floor. It was then guided down the drain in the middle of the room swirling and making gurgling noises as it disappeared into the hole. </p>\n\n<p>When the door to the bathroom suddenly opened, it creaked with age and I stopped myself from making further noise. The torrential downpour quickly faded and I sat completely dry in the stall. Still feeling the heaviness in my chest I calmed myself and wiped away as much evidence as I could. I left the stall and moved to the sink. Washing my hands and looking into my red, wet face I scolded myself for letting my guard down at work. Using a paper towel I wiped off the remnants of moisture from my eyes and cheeks and blinked a few times. </p>\n\n<p>Once I felt I looked mostly normal I strode back to my workplace sanctuary and plopped down for the remainder of the day. I never felt hungry anymore and rarely ate. I knew that eventually it would take its toll on my body, but for now I wouldn’t try to choke anything down. At the end of the day I waited until most of the noise around me had quieted down to steal away and make my way home. Knowing my way I let my body chaperon me and before I knew it I was 8 floors high and grabbing my keys. Standing at my front door my phone went off. I looked at who was calling and silenced it. After the voicemail dinged in, I received a text message as follow up. </p>\n\n<p>In the next few hours my phone lit up a few times yet again but I couldn’t bring myself to pick it up. Every time I thought of responding my chest would tighten up like I was on the top of a mountain and there was not enough oxygen to fill my lungs. I turned off my brain and watched The Office for the millionth time and even though I knew all the jokes I still chuckled in familiar response. When my eyes started to droop I knew I needed to go to my room and sleep but the thought of going back to the shell of a person kept me awake. I felt scared of my bed. I knew that if I let myself, I would just sleep until either hunger or dehydration killed me. </p>\n\n<p>I woke up with a jar and looked out the window. It was still dark outside. My eyes adjusted to the faintly lit living room awash with infomercials insisting that I needed whatever it was they were selling. I closed my eyes again and started to nod off when I heard something in my kitchen.  My arm hairs stood on end as I listened closer. Pans were being moved and banged together. I could hear a knife cutting something up on my counter. I sat and listened for what felt like an eternity before deciding to go look if anyone was actually there or if I had finally lost my sanity. </p>\n\n<p>As I rounded the corner I saw florescent lights were illuminating the usually dark corner of my apartment. When I looked up, confirmation that my rationality had fled was prevalent. My mother who had died a year ago stood there at the kitchen island, slicing what looked like potatoes even though I hadn’t had any food brought in for months. My mouth gapped open and I choked on words that never came out. She glanced up at the noise and motioned for me to sit opposite her at the bar. Without hesitation I slid onto the stool and watched her continue to slice and section potatoes just like when I was a child. </p>\n\n<p>She looked up at me and started to speak. “You look thin. You need to eat.” I tried to answer her but nothing came out again. She finished her task and set about doing others. Moving over to my stove and stirring what smelled like beans from another era she began to hum a lullaby I recognized from my youth. It was heavenly. I allowed myself to be towed into haze of her presence and finally spoke. “I miss you so much.” The words caught in my throat and a few tears fell from my face. She turned back towards me and rounded the island I was sitting at. She looked at me lovingly and wiped my face. I nuzzled her hand. It felt warm and soothing. “I know my dear. I miss you too.” She said in her warm tone. </p>\n\n<p>I began to sob and she took me in her arms. Patting my back and murmuring hushed assurances I felt safe and secure. I endorsed my mental break by holding onto her with all my strength, wishing I could stay forever in this crazed imaginary world I had invented for myself. When I finally calmed down she kissed the top of my head and went back to her cooking. She always was a great chef and made sure she fed her children well. I finally felt content for the first time since I could remember. In my moment of peace I didn’t feel the floor open up and swallow me whole. My body suddenly shifted down hard and I was falling for miles before hitting the ground. </p>\n\n<p>I sat up abruptly on my couch with infomercials yelling at me saying I needed the Slap Chop™ for all my cooking needs. I was drenched in sweat but felt like cotton was in my mouth. With horror in my eyes I leapt from my couch and bound into the kitchen. It was barren and dark. I collapsed onto the blue tiles consenting to the monsoon of tears flowing freely. My body heaved and I gasped for breath. I felt like the floor would open up again any moment and take me again, but it never did. I lay on the floor until the sun began to stream in the windows casting me in a soft light. </p>\n\n<p>It had all been a dream. I would have been happier to be haunted by my mother. The more my brain turned over the events of my nighttime vision the more resolute I became. That moment with her had been the only time I felt ok since she left me. I couldn’t be angry at her, she did everything she could to stay but between cancer and heart issues her body just couldn’t keep up. Her mind was a steel trap but her body had betrayed her and she passed two days before Mother’s day a year ago. My body was fine but my mind was gone so I was set on following her into the void. Even if I never saw her again at least my pain in this existence would be resolved. </p>\n\n<p>I laid out my plan of action for that evening and set to work. With a goal in mind I was driven to complete, I retrieved every item on my list. By the time the sun set again I was ready. I knew I couldn’t do anything violent so I filled my bathtub and had a wine glass and my book in hand. The pills prescribed to me for depression and anxiety stood guard on my sink beside the tub. These bottles were filled to the top that day. I knew it would be enough to let me sleep soundly before dying.  </p>\n\n<p>I slipped into the bubble frosted warm water and settled in. I sipped my wine and read a bit to relax and then reached up for the bottles. After grabbing the first bottle my fingers just barely grazed the orange plastic and the second bottle tipped the opposite way and fell to the floor. I sighed and sat further up in the effervescent cocoon I made myself to reach down to the floor. Once I had both bottles in my hand I began to shake with anticipation. I gulped down saliva and let out a loud breath, and then I felt a hand on my shoulder. I felt her warm presence around me like a guiding light. I knew I was making the right decision.   </p>\n\n<p>As I held the handful of pills that were going to end my life I heard a loud crack and people yelling. I shoved the pills into my mouth and washed them down with wine. My sister’s face appeared in the doorway of my bathroom looking pale and frightened. She screamed my name and almost jumped in the tub with me. I pushed her away screaming that mom told me to do this. She shook my shoulders and loudly proclaimed that mom would have never said that and I needed help. Tears welled and fell as she hugged me tight soaking her purple sweater and jeans. The men standing behind her quickly moved from the doorway and I could hear chatter on a radio as they called in an ambulance.</p>\n\n<p>My stomach was pumped and all the medication was pulled from my body before it was able to accomplish its task. I’ve been admitted to the local hospital in a ward I’ve become accustom to. There are locks on every door and no shoe laces allowed. However, they did forget this pen I’m holding. I have deduced they think it’s not a risk. They are wrong. I’m going to use it tonight once they have made rounds to assure we are all still breathing. </p>\n\n<p>I wanted to write down everything for you my dear sister. So you will understand why I cannot stay here any longer. I never thought I was long for this world from the start and once mother died I guess a part of me died with her. I want you to know it’s not your fault and I love you. </p>\n\n<p><em>This was the letter found in my sister’s room after she died. It was addressed to me. She shoved a pen into her eye socket so deep no one could see and the doctors didn’t figure out why she was crying blood until they performed an autopsy. I am racked with guilt and as I reread her letter to me I do understand why she killed herself. I too see our mother and hear her humming but I had assumed it was reassuring, telling us she is ok. Now I know she’s calling for us. My sister still had some meds in her cabinet. I found them while clearing out her apartment. I think I’m ready to go see them now, so we can be a family again.</em></p>\n</div>\n","author":"impressed_jess"}