{"rank":"243","title":"Room 325","id":"8jpe02","url":"/r/nosleep/comments/8jpe02/room_325/","time":"1526420001000","body":"<div class=\"md\"><p><em>The following is transcribed from a 2015 YouTube video entitled “My Friends and I Found a Door in the Woods,” posted by <a href=\"https://redd.it/8l5dhz\">Paradox57</a>.</em></p>\n\n<hr/>\n\n<p>[<em>Video opens on a sparse forest landscape. Orange sunrise shines through the branches of the surrounding trees, casting thin shadows over the ground. A figure wanders into the frame: GARRETT, a preteen boy with sandy hair who wears a blue winter coat. His face turns to the camera, but the image is too shaky to make out much more than his pale cheeks and a pair of green eyes.</em>]</p>\n\n<p><strong>GARRETT</strong>: It’s not much farther. This is where I found it last time.</p>\n\n<p><strong>BEN</strong>: (<em>offscreen</em>) You didn’t leave the trail, did you? They say you’re not supposed to do that.</p>\n\n<p><strong>GARRETT</strong>: Of course I didn’t, moron.</p>\n\n<p>[<em>The camera turns to see BEN, a scrawny boy in glasses and a navy fleece. He tries to step carefully across the forest floor, but his sneakers catch on a large root and he stumbles. When he sees the camera watching him, his cheeks redden and he quickens his pace.</em>]</p>\n\n<p><strong>GARRETT</strong>: You filming this, Jack?</p>\n\n<p><strong>JACK</strong>: (<em>offscreen</em>) Yeah, I am. Not seeing much so far though. Just a whole lotta trees.</p>\n\n<p><strong>GARRETT</strong>: It’s here, I swear, just a little - shit!</p>\n\n<p>[<em>The camera whirls around. GARRETT is pointing at a rectangular brown shape about thirty feet away, almost hidden by the foliage. The camera zooms in and focuses, revealing a door standing upright in the woods, its wooden surface embossed with the number 325.</em>]</p>\n\n<p><strong>JACK</strong>: What the fuck?</p>\n\n<p>[<em>GARRETT stomps through the underbrush, heading for the door. BEN reluctantly follows, with JACK picking up the rear. As they approach the door, an audio glitch occurs: the sound of birds and distant traffic cuts out entirely, leaving only the crunching of the boys’ footsteps on the leaves. None of them seem to notice this anomaly.</em>]</p>\n\n<p><strong>BEN</strong>: Did there used to be a house here or something?</p>\n\n<p><strong>GARRETT</strong>: No idea. The door’s not the weird part though. It’s what’s behind the door that’ll fuck you up.</p>\n\n<p><strong>JACK</strong>: There’s nothing behind the door, dude. It’s just standing there.</p>\n\n<p><strong>GARRETT</strong>: (<em>laughing</em>) Prepare to have your minds blown.</p>\n\n<p>[<em>He opens the door. Outside of the frame is nothing but trees and bushes, but inside, the camera captures a dimly lit room. The foot of a standard bed frame and a featureless gray rug can be seen through the door, along with the left half of a single window, its half-open blinds letting in pale white light.</em>]</p>\n\n<p><strong>JACK</strong>: Jesus Christ. How…?</p>\n\n<p>[<em>The camera circles around the door, revealing nothing but forest behind the door frame. From the other side, the door looks like a blank stretch of gray wall, with no hinges or doorknob. JACK circles back around and aims the camera back into the dim room.</em>]</p>\n\n<p><strong>JACK</strong>: Holy shit. Have you gone inside?</p>\n\n<p><strong>GARRETT</strong>: You think I’m some kind of idiot? Like hell I was going in there alone. Plus I needed you to take footage so people don’t think we’re crazy.</p>\n\n<p><strong>BEN</strong>: Not to be that guy, but going in there <em>at all</em> seems like a massively stupid move. </p>\n\n<p>[<em>The camera turns to focus on BEN. His cheeks have gone noticeably pale.</em>]</p>\n\n<p><strong>BEN</strong>: Who cares if you’re not alone? You have no idea what’s in there. This is uncharted territory, man, like… fuck. This isn’t supposed to exist, do you get that?</p>\n\n<p><strong>GARRETT</strong>: If you’re gonna be a wimp, you can guard the door. I’m going in.</p>\n\n<p><strong>JACK</strong>: Me too.</p>\n\n<p>[<em>Ignoring BEN’s protests, the two boys enter the room. The camera picks up a barely audible hum as it sweeps around the space. Along with the bed and rug, the room contains a nightstand with a telephone and a crooked lamp, a chest of drawers, a series of framed photographs, and a television set perched atop a wooden stand. Everything is a muted gray color. GARRETT crosses the room and peers through a gap in the blinds.</em>]</p>\n\n<p><strong>JACK</strong>: What’s out there?</p>\n\n<p><strong>GARRETT</strong>: Nothing. It’s just white.</p>\n\n<p>[<em>The camera wanders closer to the television. JACK’s hand appears in the frame and presses a few buttons, but the screen remains dark.</em>]</p>\n\n<p><strong>JACK</strong>: TV’s dead.</p>\n\n<p><strong>GARRETT</strong>: Phone too.</p>\n\n<p><strong>JACK</strong>: D’you think somebody lives here?</p>\n\n<p><strong>BEN</strong>: (<em>offscreen</em>) No. It’s a hotel room.</p>\n\n<p>[<em>The camera jerks around and catches him standing in the doorway. The scared look is gone from his face. He wanders over to the chest of drawers and opens the top drawer. From inside he pulls out a pristine copy of a leatherbound book with a golden cross on the cover. He laughs.</em>]</p>\n\n<p><strong>BEN</strong>: My mom had to travel for her job when I was younger, so we stayed in a lot of hotels. I got used to seeing rooms like this one. They always have a Bible in the top drawer, you know that? I started collecting them at one point. Like little souvenirs from each place we stopped at. It was totally stealing, but no one ever caught me on it. I’d stuff them in my backpack and hide them under my bed when I got home.</p>\n\n<p><strong>GARRETT</strong>: What the hell did you need a bunch of Bibles for?</p>\n\n<p><strong>BEN</strong>: I dunno, man. What do people need old stamps for? It was just a thing to do. Made me feel like those trips weren’t a total waste.</p>\n\n<p><strong>JACK</strong>: Hang on. If this is a hotel room, who’s staying here?</p>\n\n<p><strong>GARRETT</strong>: Doesn’t look like anyone’s used it in awhile. Bedsheets are a little stained, but they’re all made up and the pillows are fluffed and everything.</p>\n\n<p><strong>BEN</strong>: I… I don’t think it’s really a hotel room. I think it’s just pretending to be.</p>\n\n<p><strong>GARRETT</strong>: The hell does that mean?</p>\n\n<p><strong>BEN</strong>: Listen to this.</p>\n\n<p>[<em>He has the Bible open and is scanning the first page. Whatever he sees there makes his jaw tighten. He looks up at the camera, clears his throat, then looks back at the page.</em>]</p>\n\n<p><strong>BEN</strong>: “In the name of the Father, the Son, and the error error error. Insert memory here. Father cannot be found. Son is found but hollow. Attempts to reach Father have been met with error error error error. Prepare room for the next reset. Insert memory here. Father retrieval protocol has failed five thousand, seven hundred and thirty-four times. Son renewal begins in error error error error…”</p>\n\n<p>[<em>He flips through the rest of the book.</em>]</p>\n\n<p><strong>BEN</strong>: It goes on for like three pages. Then it’s all blank after that. </p>\n\n<p><strong>JACK</strong>: Why would someone put that shit in a Bible?</p>\n\n<p><strong>BEN</strong>: It’s like… a glitch. It’s not a real Bible, it just looks like one. I bet if you look at that phone a little closer it’s just a prop. The TV too.</p>\n\n<p>[<em>GARRETT examines the phone in his hands, squinting at the panel of buttons. JACK moves the camera over to the framed photographs lining the walls. From a distance they appear to be simple landscape shots. Up close, the finer details dissolve into pixelated blotches.</em>]</p>\n\n<p><strong>GARRETT</strong>: The phone’s just a hunk of plastic. You can’t even press the buttons.</p>\n\n<p><strong>JACK</strong>: So, like, what is this? Some kind of half-assed computer simulation?</p>\n\n<p><strong>BEN</strong>: Maybe. It’d explain why everything’s gray and none of the devices work. It might not have finished loading or something.</p>\n\n<p><strong>JACK</strong>: Fuck this Matrix shit, I’m leaving.</p>\n\n<p>[<em>The camera moves hurriedly to the open doorway and exits into the forest. It turns around to see the other two boys reluctantly leaving the room. GARRETT closes the door behind them, staring at the embossed numbers for a few seconds.</em>]</p>\n\n<p><strong>JACK</strong>: You guys want to go back in there, don’t you?</p>\n\n<p><strong>GARRETT</strong>: Dude, whatever this is, we can’t just ignore it. This is bigger than that dumb meme shit you post on YouTube. This is gonna make us famous. We just have to figure out how it works.</p>\n\n<p><strong>JACK</strong>: Ben?</p>\n\n<p>[<em>BEN is still holding the Bible from the chest of drawers. His thumb brushes the golden cross on the cover. Then he looks up at the camera.</em>]</p>\n\n<p><strong>BEN</strong>: I’m with Garrett.</p>\n\n<p><strong>JACK</strong>: Unreal.</p>\n\n<hr/>\n\n<p>[<em>The footage cuts suddenly to the interior of the gray hotel room. GARRETT and BEN are sitting cross-legged on the rug, surrounded by an assortment of objects: a lighter, a handheld radio, a cell phone, a walkie talkie, and a hammer. The insistent hum is a little louder than before. BEN waves hesitantly at the camera, while GARRETT lifts his right hand and flips it off.</em>]</p>\n\n<p><strong>GARRETT</strong>: What’s up, viewers? This is round one of what we’re calling the “Room 325 Super Special Playtest.” Today we’re going to test out a few devices from the outside world to see how they work inside the room.</p>\n\n<p><strong>BEN</strong>: If they work at all.</p>\n\n<p><strong>JACK</strong>: (<em>offscreen</em>) I can’t believe you guys talked me into this.</p>\n\n<p><strong>GARRETT</strong>: First test - will it burn?</p>\n\n<p>[<em>He picks up the lighter and flicks it until a flame appears. The fire is a bright orange against the gray of the carpet. GARRETT is about to touch it to a loose sheet of paper, but the flame suddenly loses all color and flickers out with a couple of gray sparks.</em>]</p>\n\n<p><strong>JACK</strong>: That would be a big fat no.</p>\n\n<p><strong>GARRETT</strong>: Disappointing, but eh. Whatever. Test number two - can it pick up radio signals from outside?</p>\n\n<p>[<em>BEN hands him the transistor radio. GARRETT starts fiddling with the dials, resulting in a loud hiss of static. He continues to cycle through the channels with no result, until at last the faint sound of electric guitar can be heard. He adjusts the dials until the song itself becomes clear: “Break on Through (To the Other Side)” by the Doors.</em>]</p>\n\n<p><strong>GARRETT</strong>: Ugh, so apparently the radio still picks up geezer rock in here.</p>\n\n<p><strong>BEN</strong>: (<em>hushed</em>) My dad used to love this song.</p>\n\n<p><strong>GARRETT</strong>: That’s what I said, geezer rock.</p>\n\n<p>[<em>BEN sits frozen on the rug, a look of shock on his face. GARRETT, who apparently doesn’t notice, turns the radio off and picks up the cell phone. The room falls into sudden silence. BEN’s fingers grow tense in the fabric of the carpet.</em>]</p>\n\n<p><strong>GARRETT</strong>: Test numero tres - </p>\n\n<p>[<em>He is interrupted by the sudden blare of a phone ringing. Both boys freeze, then turn to look at the nightstand. The prop phone perched on top trembles with each ring. GARRETT sits in stunned silence, but BEN rises from the rug, his hands shaking.</em>]</p>\n\n<p><strong>JACK</strong>: Oh hell no. Ben -</p>\n\n<p>[<em>BEN ignores him and picks up the phone, bringing it up to his ear. The shrill ringing cuts out at once.</em>]</p>\n\n<p><strong>BEN</strong>: (<em>hesitantly</em>) Hello?</p>\n\n<p>[<em>Whatever he hears makes his body stiffen. The camera picks up the faint sound of someone talking on the other end, but no specific words are discernable. Several seconds pass. The longer the voice continues to talk, the more BEN continues to shake, his face growing as pale as the light from the window. GARRETT rises from the rug with a look of alarm on his face.</em>]</p>\n\n<p><strong>GARRETT</strong>: Jesus, Ben, hang up! Hang up!</p>\n\n<p>[<em>He grabs BEN by the shoulders and tries to drag him away from the phone, but BEN appears to be rooted to the spot. GARRETT then attempts to pry the phone out of BEN’s viselike grip. He turns and looks desperately at the camera.</em>]</p>\n\n<p><strong>GARRETT</strong>: Fuck’s sake, Jack, help me!</p>\n\n<p>[<em>The camera grows shaky as JACK runs over. Together, he and GARRETT manage to yank BEN backwards, causing the phone to fall from his hand and clatter on the nightstand. The boys fall back on the bed, out of breath, while the camera picks up the voice on the telephone more clearly. It is monotone and vaguely accented, like a computer approximating human speech.</em>]</p>\n\n<p><strong>TELEPHONE</strong>: Father location protocol has achieved completion. Hello Son. Hello Son. Hello Son. Hello Son…</p>\n\n<hr/>\n\n<p>[<em>The footage cuts to GARRETT walking through the woods at night, bundled in his blue coat. His footsteps are rushed, and he keeps glancing from side to side, as if searching for something. The air is filled with the sound of crickets and rustling leaves.</em>]</p>\n\n<p><strong>GARRETT</strong>: We swore we wouldn’t go back there. FUCK.</p>\n\n<p><strong>JACK</strong>: We don’t know he went back to the room, dude.</p>\n\n<p><strong>GARRETT</strong>: Don’t be a fucking idiot. He never came to school and his mom hasn&#39;t seen him in hours. Of course he went back to the room.</p>\n\n<p><strong>JACK</strong>: Why would he go back there anyway? What was up with that freaky telephone shit?</p>\n\n<p>[<em>GARRETT looks back at the camera, his eyes hollow.</em>]</p>\n\n<p><strong>GARRETT</strong>: Ben never told you what happened to his dad?</p>\n\n<p><strong>JACK</strong>: No. I mean, I knew the guy wasn’t around, but I just assumed his parents were divorced or something.</p>\n\n<p><strong>GARRETT</strong>: It happened when we were kids, way before you moved here. Ben’s dad got in an accident down at the lumber mill - he got stuck in some machine and a saw sliced his hands clean off. Bled to death right on the sawdust. It really fucked Ben up. Can you imagine being a kid and knowing that happened to your dad?</p>\n\n<p><strong>JACK</strong>: Jesus, no.</p>\n\n<p><strong>GARRETT</strong>: He’s got some serious trauma, man. So when that phone started talking about fathers…</p>\n\n<p><strong>JACK</strong>: It triggered him.</p>\n\n<p><strong>GARRETT</strong>: More than that. I think it made him curious. He’s hungry for answers, and maybe the room has them, maybe it doesn’t. But he’s there. He’s gotta be.</p>\n\n<p>[<em>The crickets suddenly go silent. GARRETT pauses, then points somewhere offscreen.</em>]</p>\n\n<p><strong>GARRETT</strong>: It’s there. And it’s open. Fuck.</p>\n\n<p>[<em>He goes bounding into the woods. JACK follows him, leaves slapping the camera as he hurries through the underbrush. The open door comes into view, revealing the room beyond. Instead of white light, a dim blue glow now seeps from the window. GARRETT rushes inside. JACK follows him, stopping short in the threshold. BEN is standing in the center of the room, staring at the television, a hammer dangling from his right hand. The television screen is lit up with a series of swirling blue images: abstract shapes with sharp, shifting corners. The same monotone voice from the telephone now issues from the screen.</em>]</p>\n\n<p><strong>TELEVISION</strong>: I love you Son. I love you Son. I love you Son. I love you Son…</p>\n\n<p><strong>GARRETT</strong>: Ben!</p>\n\n<p>[<em>BEN doesn’t turn. JACK takes a step closer, and the camera picks up a feverish muttering coming from BEN’s direction. GARRETT walks over and grabs the other boy by the arm.</em>]</p>\n\n<p><strong>GARRETT</strong>: Ben, snap out of it -!</p>\n\n<p>[<em>BEN moves suddenly, bringing his right arm up and smashing the hammer into GARRETT’s forehead. GARRETT moans and lets go, staggering over to the bed and collapsing onto the sheets. Blood trickles from the wound on his head and stains the gray bed sheets.</em>]</p>\n\n<p><strong>JACK</strong>: Oh fuck, oh fuck!</p>\n\n<p>[<em>BEN turns to look at him. The other boy’s expression is blank, but a ring of vivid blue circles his irises, flickering with the images on the screen. The hammer drips steadily onto the carpet. JACK takes a clumsy step back, but BEN doesn’t move. The camera goes out of focus for a moment, and when it comes back, there is a thin tear trickling from BEN’s eye. He lowers the hammer and turns back to face the television.</em>]</p>\n\n<p><strong>BEN</strong>: (<em>whispering, barely audible</em>) I’m here, Dad. It’s your son. I’ve found you. I’ve found you.</p>\n\n<p>[<em>The television suddenly warps, its edges melting, its screen bending inward until it forms a convex tunnel of swirling blue. The tunnel grows slowly until it expands beyond the edges of the screen, enveloping the entire far wall. The camera begins to tremble.</em>]</p>\n\n<p><strong>JACK</strong>: Get the hell out of there, Ben!</p>\n\n<p><strong>BEN</strong>: Dad!</p>\n\n<p>[<em>The end of the tunnel ripples, and a humanoid figure appears in the sea of swirling shapes. Its silhouette is pitch black, but its head is hunched, and it has two stumps on the end of its arms. BEN falls to his knees and drops the hammer. He begins weeping uncontrollably.</em>]</p>\n\n<p><strong>JACK</strong>: That’s not your dad, Ben! Wake the fuck up!</p>\n\n<p><strong>BEN</strong>: I thought I’d never see you again…</p>\n\n<p>[<em>The figure in the tunnel shuffles closer, its body tilting from side to side with each step, its form remaining dark. When it is about ten feet away, it lifts its stumps and begins to gurgle. BEN rises to his feet and steps closer to the tunnel, ignoring JACK’s shouted warnings.</em>]</p>\n\n<p><strong>BEN</strong>: What is it? What are you saying, Dad?</p>\n\n<p><strong>FIGURE</strong>: (<em>garbled</em>) I LOVE YOU, SON.</p>\n\n<p>[<em>Inky black vines erupt suddenly from the figure’s back, shooting out from the tunnel and stabbing into BEN’s face and arms. JACK cries out, but BEN looks too stunned to speak. The vines begin to glow the same neon blue, pulsing outwards from BEN’s body into the dark figure. Its shape begins to change, shifting from small and humanoid to large and misshapen. Its limbs bulge outward, hulking fingers grow from the stumps, and the head bursts into a globular assortment of human eyes. The walls of the room begin to tremble and crack. JACK begins to scream incoherently as the vines drag BEN into the tunnel, the room collapsing around him. JACK turns to flee and trips over the threshold, sending the camera tumbling across the forest floor. It comes to rest at an angle, capturing a fallen JACK and the open door in the shot. JACK clambers back to his feet just as the door slams shut on its own. It wavers for a moment, like an image on a staticky screen, before flickering out of existence.</em>]</p>\n\n<p><strong>JACK</strong>: (<em>screaming, hoarse</em>) Garrett? BEN?</p>\n\n<p>[<em>There is no response. The air fills with cricket song as the video ends.</em>]</p>\n\n<hr/>\n\n<p><em>The preceding video was removed from YouTube shortly after being posted due to “Copyright Infringement,” presumably due to the use of the Doors song on the radio. Due to the lack of any last names or mentions of where these events took place, I was unable to track down Jack for some follow-up questions. As a result, it is impossible to know whether the events depicted in this video are true, or if it’s just a very elaborate hoax.</em></p>\n\n<p><em>No further sightings of the door in the woods have been reported since then.</em></p>\n\n<p><a href=\"https://www.facebook.com/davidfarrow5734\">DF</a></p>\n</div>\n","author":"-TheInspector-"}