{"rank":"1951","title":"First her husband went, then all the flowers in the garden followed.","id":"8jphxt","url":"/r/nosleep/comments/8jphxt/first_her_husband_went_then_all_the_flowers_in/","time":"1526420844000","body":"<div class=\"md\"><p>I felt bad for her, you know? You try to be friendly in this neighborhood, get to know the people who live only a few feet away from you in any direction. You try to be kind and sympathetic and convince yourself that talking about another person&#39;s misfortune isn&#39;t gossip, not really, not if you&#39;re clucking your tongue in an understanding way.</p>\n\n<p>“We all saw it coming,” Nancy told me over coffee the day after Sandra&#39;s husband Bill left, taking the cherry red convertible he&#39;d bought in the midst of his obvious mid-life crisis and fleeing in the night. I clucked my tongue.</p>\n\n<p>“Yeah, but to just sneak away like that? Just grab your bags without a word to anyone?” I sipped at my coffee and considered the statement. “You think he had someone waiting, if you catch my drift?”</p>\n\n<p>“Oh, absolutely. Didn’t you notice him losing all that weight? Buying new clothes? He may as well have had a neon sign above his head blinking ‘AFFAIR IN PROGRESS’.”</p>\n\n<p>I giggled. Nancy could be such a bitch. I loved it. Most of the time.</p>\n\n<p>“He started that new job a few months ago, too. Gone a lot. Must’ve just met someone there, it only makes sense.” I took another sip of coffee. Nancy’s Keurig needed cleaning. It tasted funny. I’d never tell Nancy that, she’s my friend, but I’d be sure to share it with my husband.</p>\n\n<p>“Well,” Nancy said in that way that let me know something really terrible was about to come out of her mouth, “it’s not exactly like Sandra’s been taking care of herself lately. She’s not even a makeover candidate, more like a burn the house down, salt the earth, and start all over situation.”</p>\n\n<p>“Oh my god, Nancy!” I said, horrified, but then I started to laugh because it was so true, and that got Nancy going. Before I knew it we were giggling like a couple of teen girls, our laughter echoing across the neighborhood in the early morning.</p>\n\n<p>I felt a sudden hard jab to my ribs that stopped me. Nancy gave me a quick gesture with her head towards Sandra’s front lawn where Sandra herself was standing, watering can in hand, staring at us.</p>\n\n<p>Her poor garden. It had been so pretty once, all irises and daffodils and tulips. Now it was just a sea of sad, dry husks, only a few buds hanging on for dear life. Sort of like Sandra.</p>\n\n<p>She was probably pretty too, once. I didn’t think she was that much older than me, maybe early 40s to my early 30s, but she’d started wearing these frumpy flowy dresses in muted colors. Just beige and grey and — I think they call it “taupe”? — and it did nothing for her figure. When we moved in her hair had been a very striking shade of auburn red but she’d stopped dyeing it at some point and the sad grey roots were sticking through.</p>\n\n<p>I pitied Sandra. We all did.</p>\n\n<p>“Hiiiii Sandra,” Nancy called, her voice taking a strange leap in pitch. “How are you this morning, honey?”</p>\n\n<p>Sandra shrugged.</p>\n\n<p>“Flowers aren’t looking too good,” she called back. She shook her watering can at them vaguely. “Keep trying everything I’ve seen on Pinterest, doesn’t seem to help.” Her cat Zara, a fluffy black grump with a tail that always seemed to be twitching, stared at us from the end of the driveway like it knew exactly what we were saying.</p>\n\n<p>“Don’t say anything about Bill,” I whispered. Nancy jabbed me again.</p>\n\n<p>“I think they look beautiful, Sandra, I really do!”</p>\n\n<p>Sandra shrugged again. She turned back to her dead flowers, effectively ending the conversation.</p>\n\n<p>Zara watched us for a moment more, then turned and retired to the porch, fluffy tail twitching the whole way.</p>\n\n<p>“That wasn’t nice,” I told Nancy. It was one thing to gossip about someone behind their back and entirely another to lie to their face.</p>\n\n<p>Nancy shrugged too.</p>\n\n<p>“What am I supposed to do, tell her that they’re bringing down the market value of our neighborhood? Might as well point out all the grey at her roots, too.”</p>\n\n<p>I set my mug down on the patio table. I considered telling Nancy that her coffee tasted like shit. Instead, I politely excused myself and went home to catch my husband before he left for work. I hoped there wasn’t someone there he was planning to pack his bags for and speed away with in a cherry red convertible.</p>\n\n<p>---</p>\n\n<p>Over the next week, Sandra’s garden died completely. No petals were left, not an ounce of green. And then the lawn started going yellow too.</p>\n\n<p>I’d watch her from my window, sipping coffee from my own kitchen that did NOT taste like shit (because I clean my Keurig, thank you very much) as she fruitlessly ran her sprinklers morning after morning only for the grass to keep drying out until it was just as stiff and bristly as the business end of a broom.</p>\n\n<p>She looked so sad. Just staring at her dead flowers and grass like she couldn’t understand it. Zara was never far, watching over her. I suddenly felt bad for making fun of her that one morning, and probably many mornings before that.</p>\n\n<p>“Poor thing should hire a lawn service,” Nancy told me one afternoon over lunch. We were having sandwiches in the shade of her porch and pretending like we weren’t sort of looking at Sandra every now and then.</p>\n\n<p>“Maybe she doesn’t have the money? Or there’s some kind of drought?” I wanted it to be true but I didn’t need Nancy’s raised, judgmental eyebrows to tell me to look around at the perfectly healthy lawns of every other neighbor in sight.</p>\n\n<p>“Maybe she’s cursed.” Nancy took a delicate bite of her sandwich as though I didn’t already know she was going to eat the whole damn thing and scarf down another when she thought I wasn’t looking.</p>\n\n<p>“That’s not nice,” I said, taking a big bite of my own out of spite.</p>\n\n<p>“My grandma always said bad things come in threes.” She ticked off each one on a finger. “One, husband leaves. Two, garden fails. Three, lawn dies. You don’t know, she could’ve pissed off a gypsy or something.”</p>\n\n<p>I watched Sandra out of the corner of my eye. The part of her hair that was still red glinted prettily in the sun, but it was hard to see past all that grey.</p>\n\n<p>Zara meandered through the dead lawn, expertly avoiding any of the water from the sprinklers.</p>\n\n<p>“Seriously, Nance. You wouldn’t want people talking like this if all these bad things were happening to you.” It had been sort of funny at first, like we were making fun of a celebrity in a magazine or someone in a TV show, but I guess watching her by myself in the morning had made her real. Without Nancy’s constant snark in the way, Sandra seemed… broken.</p>\n\n<p>“Well sure, but I’d probably expect them to.” Another delicate bite. Something about that really made me angry.</p>\n\n<p>“Why don’t you just eat your sandwich like a normal person,” I snapped, then shoved the rest of mine in my mouth and chewed furiously. I stood up. “I have laundry.”</p>\n\n<p>I went back home and tried not to look at Sandra on my way there.</p>\n\n<p>---</p>\n\n<p>The morning I went to the window and saw Sandra on the driveway, I knew what Nancy had said about bad luck in threes was bullshit. Because Sandra was crouched over the noodle-limp body of Zara, crying.</p>\n\n<p>He didn’t look like he’d been hit by a car but who knows. Usually when a pet gets hit they’re smashed or bloody or flattened. Zara was just… like he was sleeping. Even though I knew he wasn’t. His fluffy tail didn’t twitch.</p>\n\n<p>I wanted to go over and say something. Anything. But what could I say that wouldn’t sound like I was making fun of her? Sandra wasn’t stupid. She’d seen us snickering and whispering on Nancy’s front porch. Anything that came out of my mouth now would sound like I was rubbing salt in the wound.</p>\n\n<p>So I made another cup of coffee and watched as Sandra took Zara’s body inside. I didn’t go to Nancy’s that day.</p>\n\n<p>---</p>\n\n<p>Sandra didn’t come out again for a few days. But when she did, she was putting up hummingbird feeders.</p>\n\n<p>Four or five of them. She stuck shepherd’s hooks in the ground and hung the pretty red bottles very carefully from each side. The sun was shining through the glass, I remember, reflecting on her face. It made all of her hair look red again.</p>\n\n<p>She was smiling, a soft kind of smile that I took to mean she was hurting, but maybe this would be okay.</p>\n\n<p>I hoped so. I love hummingbirds.</p>\n\n<p>---</p>\n\n<p>We were in peak season for their flight so it didn’t take long for them to start visiting Sandra’s lawn. It looked kind of funny, this sad brown house with a dead garden and a yellow lawn and all those sparkling red hummingbird feeders with the constant flick back-and-forth of tiny green wings. I liked watching them from my kitchen window with my morning coffee, especially since I didn’t go over to Nancy’s anymore. Her grandma had said the thing about bad luck in threes, well, my grandma said if you don’t have anything nice to say don’t say anything at all and Nancy wasn’t the best person to be around for that.</p>\n\n<p>But it <em>was</em> Nancy who saw it first. I know it was, because I heard her scream.</p>\n\n<p>“What happened?!” she was crying from her front porch. She hadn’t even gotten out of her pajamas yet but as I ran next door in my own pajamas I could see Nancy was pointing across the street at Sandra’s house.</p>\n\n<p>“What’s wrong—“ I began, then stopped cold both in the middle of my sentence and in the middle of Nancy’s lush green lawn.</p>\n\n<p>Across the street, in the starkly opposing dead dry lawn, lay scores of dead hummingbirds.</p>\n\n<p>It was horrible. All those little emerald green bodies, ones you could only catch a glimpse of for as long as they’d let you, were still. Tiny wings crumpled. Pointed beaks aimed at the sky.</p>\n\n<p>Whenever you see hummingbirds, they’re always so quick. So full of life. Flicking this way and that, making the sun glint off them so perfectly. You so rarely see a slow one, and less yet a dead one.</p>\n\n<p>So still.</p>\n\n<p>I couldn’t speak. There were just so many of them.</p>\n\n<p>Sandra came out then. She must’ve heard Nancy’s screams. She looked around her lawn, slowly. Took it all in.</p>\n\n<p>Then she sat down on the step of her front porch, took a deep breath, and smiled.</p>\n\n<p>“You with your perfect little lives,” she said, loud enough for us to hear across the way. “You get things to stay. I don’t know how. Everything I have, leaves. Everything leaves.”</p>\n\n<p>I was just standing there, mouth open, my bare feet growing cold in the wet morning grass.</p>\n\n<p>Sandra looked at me. Turned that satisfied smile on me.</p>\n\n<p>”<em>This</em> way,” she said, quieter now, “they stay.”</p>\n\n<p>---</p>\n\n<p>She had mixed antifreeze in the hummingbird feed. The same antifreeze she used to kill her cat, Zara. For the flowers and the lawn, an herbicide containing glyphosate. And as for Bill we were sure had run away in the night, good old arsenic.</p>\n\n<p>Someone drove his cherry red convertible and clothes away. But it hadn’t been Bill.</p>\n\n<p>Sandra made it easy for the police. She waited there on the porch as we made what was supposed to just be a wellness check and turned out to be anything but. I mean, she was just sitting there, staring at the hummingbirds with that creepily satisfied smile, and what she’d said… what else were we supposed to do?</p>\n\n<p>She let them right inside when they arrived, just meaning to ask a few questions, and they found the decomposing body of her husband Bill face down in the last bowl of soup he ever had the misfortune of eating. Sometimes I think back on Nancy’s coffee and wonder if his soup tasted funny.</p>\n\n<p>I hope Sandra’s getting the help she needs now. I’m not sure exactly where she is, whether it’s prison or a psychiatric facility or a combination of both, but at least the people she’s with…</p>\n\n<p>Well, they’ll stay.</p>\n</div>\n","author":"mjpack"}