{"rank":"15","title":"My friend used to go hiking through the forests of Puerto Rico.","id":"8jpv6z","url":"/r/nosleep/comments/8jpv6z/my_friend_used_to_go_hiking_through_the_forests/","time":"1526423904000","body":"<div class=\"md\"><p>Many people don&#39;t know this, but Puerto Rico was once the sight of a grisly, tragic fire that wiped out an entire village off the map. Puerto Rican people are quite superstitious, and must have been convinced the fire was tied to a demon/supernatural occurrence because it was abandoned with no record left of it. It&#39;s been so long that almost no one remembers it.</p>\n\n<p>And theres a reason why i say almost no one. A friend of mine who took time off to go hiking around the forests of Moca told me in person that he wanted to try a new path that day, and tied a purple lanyard where he went off the path, walking solely in a straight line. It wasn&#39;t 5 minutes before he had stumbled along an old stone path in the forest, something peculiar since stone paths were a byproduct of the time Puerto Rico was under Spanish rule. Having heard nothing of such a path in the area, he decided to follow it. For the sake of retelling events, I&#39;ll be talking as though he were talking.</p>\n\n<p>&quot;I followed the stone path, which was surprisingly solid unlike the ones you&#39;d see in some parts of the Yunque. I thought I had seen most of that forest, but the path took me across this small split among the rocks. It was curious sure but nothing out of the ordinary. Until I saw the first cabins. Charred, black and almost entirely rotted out with vegetation growing all over, it wasn&#39;t until I passed the third one that I could start making out the foundation of a small village. There was almost nothing left standing, and the only clue I had was the stone path which circled around what must have been a plaza, with small charcoaled wood placed every few meters or so in a organized manner. The air smelled faintly of charcoal, which was odd since I wasn&#39;t near any of the plots. There was this large plot at the end of the path which I presumed to be the Alcaldia (in Spanish this is the mayor&#39;s place) went inside.&quot;</p>\n\n<p>He went silent for a moment, taking a deep breath as though he was steeling himself to remember what happened next. </p>\n\n<p>&quot;I- I thought it was a shelf... I thought there could be something inside...I didn&#39;t see the bones until...&quot;</p>\n\n<p>His hands shook a bit, his voice trembled. I held his shoulder, hoping to calm them down. He continued, trying to finish the story as calmly as he could.</p>\n\n<p>&quot;I felt it...the heat, the smell of burning skin, crackling like pork skin... I looked around, and the village was there. The entire village still standing, burning. I could hear the people screaming in agony, agony like nothing I have ever heard since... I ran, I ran as hard as I could out of there. I could see the people trapped inside, banging on the windows and doors with all their might. I didn&#39;t want to look, I tried not to look except for ahead... But there was a large building just beside the path, and inside I could see them... Hanging, clawing at their necks as they fought to get free. Hot ash bellowed from their mouths as hellfire consumed it all...&quot;</p>\n\n<p>He grew silent, breathing heavily, complaining about an upset stomach, but finished his story with one last detail which gives me chills to this very day.</p>\n\n<p>&quot;When I got out...when I passed that crevice in the rocks, it all stopped. The smell, the screams, the fire...just gone. I couldn&#39;t bear myself to turn around, but I did. I don&#39;t know why, but I did...and on a burnt out sign, etched in ash was the phrase &#39;Tumba De Los Dioses&#39;.&quot;</p>\n\n<p>I tried looking up any information about this page but nothing about a village burning down came up. What did come up was what was written on the sign; it means Tomb of The Gods. Attached to it was a small article about how back when the Spanish were still conquerors, there was an incident where a group of Taino indians took a Spanish man and drowned him, wanting to test his immortality. An incident which began rebellions across the entire island. </p>\n\n<p>My friend doesn&#39;t hike in that forest anymore, but he says he left the lanyard still tied around that tree trunk, five minutes from that stone path.</p>\n</div>\n","author":"Bustyturtlelover"}