{"rank":"4","title":"Satellite Office - Part IV - Final","id":"8jpwjh","url":"/r/nosleep/comments/8jpwjh/satellite_office_part_iv_final/","time":"1526424226000","body":"<div class=\"md\"><p>Part III here:\n<a href=\"https://old.reddit.com/r/nosleep/comments/8i9a0i/satellite_office_part_iii/\">https://old.reddit.com/r/nosleep/comments/8i9a0i/satellite_office_part_iii/</a></p>\n\n<p>[NSFW][Graphic Violence]</p>\n\n<p>I came to a couple of minutes later. It took me a minute to realize where I was, and then, in that moment, I scrambled to get out.</p>\n\n<p>The meat grinder wasn&#39;t plugged in to anything, but it would be the same feeling as if you had rested a circular saw on your lap. Sure, it&#39;s not on <em>now</em>.</p>\n\n<p>After hoisting myself out, I grabbed both of Maddie&#39;s arms and pulled her out. She was unconscious, and it took me a second to steady her over my shoulder and begin walking her back to the office, where the police and ambulance were waiting.</p>\n\n<p>Upon seeing me round the corner with Maddie over my shoulder, the paramedics immediately sprang into action. A police officer took me aside and began immediately taking a statement. I was trying to explain what I saw.</p>\n\n<p>&quot;...and then myself and Sheila discovered Annie&#39;s body.&quot; I was stammering through the events.</p>\n\n<p>&quot;...Okay, okay. Who was Sheila?&quot;</p>\n\n<p>&quot;The other office manager - the tall one with the short blonde hair.&quot; I reminded him.</p>\n\n<p>The officer seemed confused. He looked around. </p>\n\n<p>&quot;We didn&#39;t see her, is she still inside the building?&quot; He said warmly.</p>\n\n<p>My blood ran cold.</p>\n\n<p>I looked around for Sheila at the muster point, where even more emergency services and police were arriving. She wasn&#39;t anywhere to be found.</p>\n\n<p>&quot;She was coming out here to meet you guys!&quot; I insisted. &quot;Are you sure she&#39;s not with any of the other officers or with the ambulance?&quot; I pressed.</p>\n\n<p>&quot;I don&#39;t believe so, but I can check.&quot; The officer indicated. He signaled to one of the other officers and strolled over. I could see him explaining something, and I could see the other officer shrug and shake his head. A third officer wandered over and also shook his head fairly confidently.</p>\n\n<p>Acting on instinct, I immediately bolted back into the building. </p>\n\n<p>One officer called, &quot;Hey!&quot; But I had already reached the front door and was inside.</p>\n\n<p>I pushed past a group of residents gathering in the hall to survey the commotion. A few of them tried to ask me what was going on, but I just continued to quickly retrace the building.</p>\n\n<p>I took the path I thought Sheila would take. Out through the courtyard, back into building two.</p>\n\n<p>I ran back up the stairs, past the suite with the meat grinder, to the end of the hall, and checked the mechanical room. No sign of her.</p>\n\n<p>I checked the other mechanical room on the next floor, and the suite with the hole in the floor. No sign of her again. </p>\n\n<p>If something had happened to her, how would I find her?</p>\n\n<p>I came back downstairs, and it dawned on me that it would be a lot easier to find her with everyone out of the building. I pulled the fire alarm.</p>\n\n<p>I stood in the hall while everyone filed past me into the parking lot in a mass exodus. Emergency services was somewhat overwhelmed with the parking lot filing, but at least fire services were already on site - and now they&#39;d have to check every unit.</p>\n\n<p>A few hours later, the firefighters had completed checking the units, determined there was no actual fire, and had sent everyone back into their homes. Police were continuing there investigation, and had cordoned off sections of the building. However, if they had any suspects, they were being tight lipped about it.</p>\n\n<p>One of my colleagues arrived, and offered to relieve me, but I stayed behind and continued to help police in their investigation. They asked me questions about the tenants who lived there, or how long we had known them, who had recently been evicted, did we know so and so had a criminal record, and that sort of thing.</p>\n\n<p>I went back up to the suite with the meat grinder and demonstrated to the police officers exactly what happened, and showed them the suite of the evicted tenants with the hole in the floor. </p>\n\n<p>The police wrapped up their investigation at the site after arresting the two meth-heads we had evicted from their suite earlier, positing that they must have been the ones that caused this. The idea was that they were making some sort of snuff film.</p>\n\n<p>The problem was, of course, that Sheila was still missing - presumed dead.</p>\n\n<p>I went home that afternoon. I showered, and slept for a few hours, eating only lightly. I wasn&#39;t very hungry after what I had witnessed. </p>\n\n<p>I woke up in the middle of the night, after having a lot of nightmares about the incident. I checked my email. I was relieved to hear that Maddie was going to survive, and was in stable condition in the hospital. However, they still had not found Sheila, and the meth heads that had been arrested were still denying any knowledge of her whereabouts.</p>\n\n<p>I got back in my car and drove to the site. I didn&#39;t know what I was hoping to accomplish. Maybe I&#39;d figure out some clue as to where Sheila might have gone.</p>\n\n<p>By this point the random flurry of spring snow had melted, and a warm breeze had developed over the city, augmented by the scent of wet, dirty pavement and concrete. </p>\n\n<p>I parked my car in front of the building and lingered outside for a bit. I walked the perimeter of the building, noticing holes in the fences, and broken glass by the dumpsters. In one of the units, I could hear a man and a woman having an argument in another language. Or what I assumed to be an argument. </p>\n\n<p>I walked through the empty office, eerily quiet.</p>\n\n<p>I walked out to the courtyard and stood by where we had found Annie earlier. The snow had melted, and what remained was now just a section of mud, cordoned off by police tape.</p>\n\n<p>I walked over to building two, and started up the stairs. The buzz of the fluorescent lights in the stairway and in the hall seemed overwhelmingly loud.</p>\n\n<p>All the sites where we had been the previous day were cordoned off by police tape. The mechanical room, the suite with the meat grinder, the suite with the hole in the floor. </p>\n\n<p>I walked back into the hall. I shrugged. I figured we&#39;d never know what happened to Sheila. </p>\n\n<p>At that point I heard something banging in the stairwell again. I entered the stairwell to investigate. </p>\n\n<p>In the stairwell, the banging noise was quite loud, but difficult to determine where it was originating from. It echoed and bounced off the walls. I finally was able to determine it was coming from <em>up</em> the stairs.</p>\n\n<p>I gazed at the top of the stairs, into the blackness where they curled into a small outlet for the door to the roof. The door to the roof was open, and it was banging in the wind.</p>\n\n<p>I slowly and wearily made my way up to the stairs and surveyed the door. It was clear someone had jimmied it open with a pry bar based on the bent casing. I walked out on to the roof to check to see if anyone might be outside. </p>\n\n<p>The refreshing night air entered my nostrils. I stood motionless for a minute, looking out over the city lights, and the blowing branches of the budding trees. I felt helpless not knowing where Sheila might be, only that she was dead. I felt horrible that I wasn&#39;t able to protect anyone from what had happened. </p>\n\n<p>I knelt down, and started to sob. On my knees, I noticed something in the gravel on the roof. It was a shoelace.</p>\n\n<p>I stopped my crying, and stood up. The shoelace looked fairly new, and white. I stood, and then I could see a shoe.</p>\n\n<p>It was Sheila&#39;s shoe. </p>\n\n<p>I made my way to where the shoe was, and then I noticed the jacket Sheila had been wearing. I gathered that as well, and then made the grim discovery.</p>\n\n<p>Behind a roof-top cooling unit was Sheila&#39;s naked body. She had many cut marks in her skin. The flashlight she had with her had been used to knock her teeth out, and had been shoved down her throat. Someone had attached a post-it note to the end of it that read <em>Blow this bitch.</em></p>\n\n<p>With deep resignation I sat down beside her. I used my jacket to cover her up. I sat in silence for a while, before I finally mustered the will to pull out my phone and call the pleasant detective I had been dealing with who was investigating the case. </p>\n\n<p>I let out a great sigh while I was dialing his number, and then...</p>\n\n<p>...I saw white, and a sharp and a dull, inexplicable pain rang through my head. </p>\n\n<p>I awoke in the meat grinder, next to Sheila&#39;s lifeless body. Blood was pouring down my face, and I could taste the metallic pang of it in my mouth. I saw a shadowy figure holding a switch box, which he depressed, and then ran out the door. </p>\n\n<p>The meat grinder started.</p>\n\n<p>I pulled myself out with all my force, managing only to lose a shoe in the process. I grabbed the arm of Sheila and began to pull as hard as I can, trying to save her body from facing any more indignities. It didn&#39;t work though. The machine was too strong, and began pulling her in.</p>\n\n<p>Then there was a loud buzzing, and I was sprayed with what I thought was blood. However, it tasted of oil, and burned when it hit my skin. It was hydraulic fluid. The machine began smoking, and then caught fire. Sheila&#39;s body had jammed the machine, and the rickety implement had enough and was failing. </p>\n\n<p>Smoke poured from the machine, and then, flames burst out of the bottom and around it. </p>\n\n<p>I ran into the hall, and pulled the fire alarm once again. </p>\n\n<p>A few tenants sporadically began coming out of their units to see what was the matter. I began yelling with all my might, &quot;Fire! There&#39;s a real fire this time!&quot;</p>\n\n<p>Building two suffered $1.2 million in damages due to the blaze.</p>\n\n<p>Sheila&#39;s burned body was later positively identified with dental records.</p>\n\n<p>The meth heads were released after there was not enough evidence to convict them of anything. It was later believed that the hole in the floor was cut after they had already moved out. No one has been convicted of the crime. The police had many theories, from a gang initiation ritual, to many different suspects being involved in a connected plot, to a single serial killer. </p>\n\n<p>Of course, I left the company. I really loved a lot of the people I worked with, and I even enjoyed the job. But there was too many bad feelings. Especially after the company decided not to dispose of the site after everything that had happened there. </p>\n\n<p>I started my own management company after all that had happened. Maddie actually works for my new company. She has learned braille, and is really excellent overseeing many of the operations, including smart and systematic building improvements, and security. </p>\n\n<p>I don&#39;t buy any sort of ground meat anymore. I&#39;m sure you&#39;ll understand why. </p>\n</div>\n","author":"hearse83"}