{"rank":"133","title":"Just Another Day In Salem (Part 1)","id":"8jpzzy","url":"/r/nosleep/comments/8jpzzy/just_another_day_in_salem_part_1/","time":"1526425053000","body":"<div class=\"md\"><p>I live and work in Salem. Yes, that Salem, north of Boston. Witch City. The one where in 1692 nineteen people were hanged, and one guy was pressed to death with big stones, because everyone thought they were witches. Horrible. Also, very profitable. You see, I own one of those little shops on Essex Street, a place called The Celtic Cauldron. My grandmother started it back in the Twenties, then my Mom took it over, and now it’s mine. We don’t sell the tourist junk, only real spell components and books, the kind you could get results with if you knew what you were doing. Fortunately, most people don’t have the touch, so instead of conjuring up the dead they end up with some fancy crystals and nice potpourri. That’s a good thing. Even up here I can’t get insurance to cover me if some newbie can’t banish the demon they conjured up because they thought it would be a neat party trick.</p>\n\n<p>I’ve gotten to know my neighbors on Essex, and most of them are all right. There’s a bunch of other “witch shops”, sure, but there’s also a place that makes great candles (I use ‘em) and a gourmet foodie shop that has a killer chocolate selection. We all get along fine and watch out for one another when creepers or thugs make the rounds. That’s most of us. Then, there’s Kristobol.</p>\n\n<p>How do I describe Kristobol? He’s the guy who makes the rest of us groan. Shameless self-promoter. Have you seen his Web site? “America’s first vampire witch!” Or, something like that. He blew into town about a year ago and opened his own shop, Octal, immediately ticking off the rest of us by insisting his was “The Original, Authentic Witch Shop Of Salem!” with a huge sign in his front window. This, from a guy we all know is really named Eric Binglehoff and comes from Boise, Idaho. He’s a fake, but he knows how to work the rubes, and his shop does a lot of business. And, a lot of damage.</p>\n\n<p>See, most of us here in Salem are some flavor of Witch or Magi. You got your kitchen witches, your garden witches, and, yes, the ones that deal in good old-fashioned charms and spells. I’m one of the later, and I know most of the others. Some of us are crap at it, a few are really good, and a handful are amazing. Those of us that have the shops, we’re careful not to let the tyros buy stuff they can’t handle. </p>\n\n<p>Kristobol, on the other hand, will sell anything to anyone. Usually it’s a book or ritual that’s too advanced and will lead to frustration. But, every once in a while, I see someone walking past with an aura that all but screams DANGER, someone who might have been in my shop earlier and shooed out empty-handed, clutching a bag from Octal. That’s when I know to watch the news for the next few days. Remember that house fire in Innsmouth a few months ago? If you saw the picture in the <em>Globe</em> you saw the front lawn with all that stuff strewn over it. What was front and center? A black bag with OCTAL in big, red letters.</p>\n\n<p>Some of us tried to talk to Kristobol about his reckless ways, but he threw a fit and spent the next episode of his podcast ranting about us like we were a dark coven out to get him. If only! That might have brought results. The only thing this did was give him publicity and increase his business. Somehow, we’d made matters worse. But the worst was yet to come.</p>\n\n<p>Business had been slow and the customers a bit grouchy since Kristobol pulled his little stunt. So, you can imagine I was none too pleased when he came stomping into my empty shop one afternoon. Hard to miss a guy six feet tall in a black velvet cape and Three Musketeers hat. Gone was his usual attitude, his cocky swagger. He seemed nervous, even a bit paranoid, looking around as if he expected a bunch of ninjas to attack at any moment. I was at the counter when he came in and walked right up to me.</p>\n\n<p>“Oh, Natalie! Thank God you’re here.”</p>\n\n<p>I looked up at him coolly. “Hello, Eric. What do you want?”</p>\n\n<p>He didn’t even flinch at my use of his birth name. “I’ve, uh, I’ve got a little problem I was hoping you could help me out with.”</p>\n\n<p>I grabbed a broom and pretended to sweep some nonexistent dirt. “Do you, now?”</p>\n\n<p>“Oh, don’t be that way. This is serious.”</p>\n\n<p>“So is slander. You said a lot of nasty things about us on your podcast.”</p>\n\n<p>“Look, I’m sorry, all right? I’m sorry for everything I said. No, please, I need help!”</p>\n\n<p>I put the broom aside, looked at him with a sigh. “Okay, Eric. What’s the problem.”</p>\n\n<p>“It’s Bethany. Something’s wrong with her.” Bethany was his employee at Octal, the only person willing to work for him. She was an adorable and insanely cheerful PerkyGoth who always saw the good in things and made endless excuses for her employer. Kristobol would send her out to mend fences when he did something excessively rude because he knew we all liked her better than him. </p>\n\n<p>My concern for Bethany was genuine. “Is she injured? Is she sick?”</p>\n\n<p>He squirmed a bit in place. “No, uh, not like that. Not really.” Then he stomped his foot like a child. “Look, can’t you come over to my place and see her? I think you’ll see what I mean, right away.” Whatever was happening was bugging him greatly.</p>\n\n<p>“Fine, Eric. I’ll have a look. Not like there’s anything to do here right now.” That last I said with a bit of a growl over my lack of customers. Okay, it was a Tuesday in March, but I was still gonna zing him for running off at the mouth. I grabbed my keys and out we went, stopping just long enough for me to lock the door and put the “Back When I Feel Like It” sign in the window.</p>\n\n<p>It wasn’t that long a walk to his place, so I decided not to quiz him on what was so urgent till we got there. I did wonder if he wasn’t dragging Bethany out in some cockamamie scheme to backpedal from his rude display towards me and the others. If it was, he was gonna get a chukka to the knee. No, both knees.</p>\n\n<p>We got to Octal and I was surprised to see it, too, was closed. Things must be serious if Kristobal was willing to miss out on a sale. He fished around for his keys and, hands shaking a bit, finally got the door open. We walked in to an empty shop, but I could feel that there was someone there, hiding from us. “Well, where is she? You said she needed my help.”</p>\n\n<p>Kristobol frowned and called out, “Beth, sweetie, I’m back! I brought Natalie with me! She’s here to help you!”</p>\n\n<p>“Yeah, about that. What exactly am I supposed to be helping her with?” No sooner had I got the words out than I heard the sound of clopping hooves slowly and unsteadily come towards us from the back room. The doorway curtain parted, and Bethany came out to join us.</p>\n\n<p>To say she’d changed her look would be an understatement. Her blonde pigtails had been switched for a shoulder-length Betty Page cut in shiny black. It went well with her skin tone, whose once pallid sheen was now a fiery brick-red. Then there were the budding horns peeking out from her hair above her forehead, and the shimmering green eyes that almost seem to be glowing. The sound I’d heard came from the hooves that now replaced her feet. Classic devil look, and it would have been fierce were she not smiling nervously, or wearing only an oversized tee shirt with HONK IF YOU LOVE JESUS emblazoned on the front.</p>\n\n<p>Bethany gave me a little wave. “Hi, Nat.” She struggled a moment. “How’s things?”</p>\n\n<p>The look I gave Kristobol could have melted a cinderblock. “What. Did. You. Do!?”</p>\n\n<p>He moved back a step and raised his hands defensively. “It’s not my fault!”</p>\n\n<p>“It’s true!” Bethany stepped closer to us. “I was opening the mail this morning, and there was this thing in a little box that started glowing when I picked it up, and…” She waved her hands a bit to indicate her current condition.</p>\n\n<p>I gave her my full attention. “Sweetie, who was the package addressed to?”</p>\n\n<p>“No one. I mean, to the shop. Not either of us.”</p>\n\n<p>“Where’s the thing you picked up?”</p>\n\n<p>She got kinda glum. “It’s gone. When I picked it up it fizzled away, into smoke.”</p>\n\n<p>“And, was there a note?”</p>\n\n<p>Bethany brightened up. “There was! I mean, is! I mean, hang on.” She clopped back to the counter and picked up a small package. She pulled a folded piece of paper out of it and came back. “Here it is.”</p>\n\n<p>“You hold onto it a moment.” I focused on the paper and let my inner eye peer at it. “Hmm. It was sent by a woman. Jeez, it’s dripping with rancor. Who did you piss off this time, Eric? Cause you really picked a winner. Bethany, what does it say?”</p>\n\n<p>The newly-minted devil girl unfolded the note and read aloud, “Hi, Kristobol.” She stopped and gave him a sad look. “Sorry, boss, I didn’t mean to open your personal mail.”</p>\n\n<p>Kristobol cleared his throat and managed a quiet, “That’s okay” before Bethany continued.</p>\n\n<p>“Okay, so.” She read in a kind of sing-song way. “Hi, Kristobol. Here’s a taste of your own medicine for you. I hope you choke on it, you – there’s a bad word here – and learn not to mess with forces you can’t control. Signed, Denise. PS – The cops will be by any minute.” She turned the note around and held it up for us to see with an expectant look.</p>\n\n<p>I turned to Kristobol. “Okay, Eric. Who is Denise?”</p>\n\n<p>He looked mortified, and was obviously lying when he said, “I, I don’t know.”</p>\n\n<p>“You don’t know? She knows you well enough to want to do this to you. This is a major transmutation. Costs a lot in every possible way. So, try to remember who she is. What?”</p>\n\n<p>That last was for Bethany, who was squirming a bit and making a face. “I, my butt is itchy. I mean, really itchy. And, I can feel this bump, right here.” She rubbed the spot where her back met her backside.</p>\n\n<p>“Your tail is emerging.” I turned back to Kristobol. “The only person in this town who likes you is growing a tail. A tail meant for you. You want to man up and tell us what’s going on?”</p>\n\n<p>Before he could answer there was a loud rapping on the glass of the front door. We all looked over to see a pair of Salem cops standing there, looking rather impatient.</p>\n\n<p>“Well”, Bethany said, “the note did say they were coming.”</p>\n\n<p><a href=\"https://redd.it/8k4itg\">The story continues in Part 2</a></p>\n</div>\n","author":"TheAncientMarinade"}