{"rank":"218","title":"Emily's Envy","id":"8jq1tv","url":"/r/nosleep/comments/8jq1tv/emilys_envy/","time":"1526425472000","body":"<div class=\"md\"><p>Emily always aimed to be at the top. She just had to be number one. There was only one problem: Her sister Heather.</p>\n\n<p>Heather had it all. She was pretty, smart, athletic and by far the most popular girl in school. To top it all off, she did it without even trying.</p>\n\n<p>Emily herself was pretty and smart too, but Heather was on a whole different level. She always outshined her younger sister.</p>\n\n<p>I got to know the two of them when I was in second grade. They moved into the house next door with their dad. It was only natural for us to become friends. Especially Emily and I became pretty close, considering that we were in the same grade.</p>\n\n<p>It’s hard to say when Emily&#39;s envy began. It might have started during middle school, but now I think it did much earlier.</p>\n\n<p>Emily never showed it openly. In front of her sister and her father, she wore the mask of the ideal younger sibling. She pretended to be happy for her sister, to even admire her. Deep inside though, she was furious.</p>\n\n<p>I knew because Emily and I had become best friends during middle school. One late afternoon, when walking home together after school, she told me all about it.</p>\n\n<p>&quot;She is so goddamn perfect, it&#39;s unfair!&quot;</p>\n\n<p>&quot;Who is?&quot; </p>\n\n<p>&quot;Heather! It&#39;s always her. Today as well! &#39;Oh Emily, one day I am sure you are going to be as pretty as your sister&#39; Ugh, how I hate it!&quot;</p>\n\n<p>&quot;Oh look who is talking!&quot; I said laughing. &quot;You are stunning yourself.&quot;</p>\n\n<p>&quot;Oh shush, Lizzy! That&#39;s not the point.&quot;</p>\n\n<p>&quot;I was just trying-&quot;</p>\n\n<p>&quot;Just stop. Don&#39;t you think I know that?&quot;</p>\n\n<p>I didn&#39;t say a thing.</p>\n\n<p>&quot;How many times do you think I have to hear how I am <em>almost</em> as perfect as her? How do you think I feel when a guy I like asks me about her? I am sick and tired of it!&quot;</p>\n\n<p>Soon she was ranting to herself. There was no point to say anything. Instead, I kept walking next to her.</p>\n\n<p>It was only the first of many similar rants. </p>\n\n<p>Heather graduated at the end of the school year. She didn&#39;t move on to university. Instead, she followed her dream to become a professional dancer.</p>\n\n<p>It seemed Emily&#39;s time to shine had come. Finally, her sister had left the throne to her. At least that&#39;s what Emily had thought.</p>\n\n<p>Emily might have made it to the top, but Heather&#39;s shadow was still looming above her. Guys only talked about how they&#39;d kill for a chance with Heather. The trophy case still showed Heather&#39;s many accomplishments. Even the cheerleaders aspired to be just as good as Heather. No one talked about Emily.</p>\n\n<p>Two years later Emily and I graduated as well. The close friends we were, we decided to attend university together. Emily majored in fashion design, while nerdy little me went into the science field.</p>\n\n<p>We even moved into the same dorm. Sure, we weren&#39;t roommates, but we lived only one floor away from one another.</p>\n\n<p>It was during our second semester that Facebook&#39;s popularity exploded in Germany. I was quick to sign up. I had been on Myspace for years and had been a member of a few other online communities. It was only natural. </p>\n\n<p>Emily was more reluctant than me. Only after I annoyed her for weeks did she finally sign up. She was quick to discover that her sister had a profile too.</p>\n\n<p>Every once in a while, when I turned up at her room, I&#39;d find her glaring at her computer screen. She&#39;d be going through Heather&#39;s profile.</p>\n\n<p>She never admitted it, of course, but I knew she was stalking her sister.</p>\n\n<p>When Facebook launched the fan page feature, I played around with it a bit. I suggested to Emily that it might be a good idea to create one for her designs. At first, she was against it, but once I pointed out the advantages, she gave in. To her and even my surprise, she got quite a few initial fans. After some weeks this number had grown to more than a hundred. Two months later it was above a thousand.</p>\n\n<p>The next time I came over to her dorm room, I found her on the phone.</p>\n\n<p>&quot;Oh, you have no idea how happy I am. I mean, that is more than a thousand people. It&#39;s unbelievable. Who would have guessed that I&#39;d be so popular?&quot;</p>\n\n<p>When Emily saw me, I pointed at her and then at the phone to get her to tell me who it was. She looked at me confused for a few seconds before she understood.</p>\n\n<p>&quot;Oh, it&#39;s Heather!&quot;</p>\n\n<p>I frowned for a moment, then I said a quick hello and found myself a place to sit down.</p>\n\n<p>&quot;Yeah, Lizzy helped me to set it up.&quot;</p>\n\n<p>&quot;No, I think that&#39;s not it. It might just be talent, you know?&quot;</p>\n\n<p>She laughed into the phone. I sounded so fake and empty.</p>\n\n<p>&quot;Oh? Yeah, I guess. I mean, of course. I am happy to help.&quot;</p>\n\n<p>Her voice was as sweet as honey and her face distorted into a smug smile. It made me cringe.</p>\n\n<p>&quot;Oh, it&#39;s not hard at all. I could even invite a few of my fans to like your page.&quot;</p>\n\n<p>I sighed as she said this. Emily noticed and stared me down. I only shrugged in annoyance.</p>\n\n<p>&quot;What’s that, Heather? Yeah of course. Well, Lizzy is waiting. I got to go, sorry.&quot;</p>\n\n<p>I looked up at Emily who was beaming. Not at me, but at herself. I couldn&#39;t remember the last time I&#39;d seen her that happy.</p>\n\n<p>&quot;What was that all about?&quot; I asked her. </p>\n\n<p>&quot;I told Heather a bit about my fan page.&quot;</p>\n\n<p>She said it in the most innocent of voices.</p>\n\n<p>She told me she had called Heather because she missed her. She was the only family she had left after all. The topic of the fan page came up by sheer accident. Once it was out though, Emily had to tell her sister all about it. After a while, Heather wanted to know more.</p>\n\n<p>&quot;I had to offer her some help, you know?&quot;</p>\n\n<p>I nodded, but I knew what this was about. For the first time, it was Emily who was more successful. She&#39;d mentioned it a few times. \nNow she was the popular one, and Heather could use her help. I could see how she lavished the feeling.</p>\n\n<p>Every time Heather called, Emily was in a state of bliss. She&#39;d answer the phone in the same sweet voice as before. It didn&#39;t matter where Emily was or what she was doing. We were at the bar? She&#39;d rush off to the toilet. We were in the study hall? She&#39;d leave for half an hour. Even when the two of us were having a movie night or hanging out with friends, she&#39;d always rush off to answer the phone.</p>\n\n<p>I tried talking to her about it, but she&#39;d shrug it off. I was imagining things, she said.</p>\n\n<p>It was a few months later when I returned to the dorms one evening. There was a ruckus going on. A crowd of people had formed on Emily&#39;s floor. From the stairs, I could hear someone yelling and screaming.</p>\n\n<p>When I got closer, I saw people standing in front of Emily&#39;s door.</p>\n\n<p>&quot;That freaking bitch! Why the hell is it always her! It is always- Fuck!&quot;</p>\n\n<p>It was Emily. I could hear more curses, mixed with the sound of things breaking apart, from behind the door. I tried to open it, but it was looked.</p>\n\n<p>&quot;Hey! Emily? What&#39;s going on?&quot;</p>\n\n<p>I knocked on the door. First only a little, but then harder.</p>\n\n<p>&quot;Are you ok? What is-?&quot;</p>\n\n<p>Suddenly the door unlocked. Anger distorted Emily&#39;s face. Her eyes were puffy and bloodshot from crying. The room behind her was a mess. The floor was littered with Emily&#39;s belongings and the remains of her various designs and sketches.</p>\n\n<p>&quot;W-What the hell are you doing?&quot; I asked confused.</p>\n\n<p>&quot;You,&quot; she started. Then she took a step towards me and pushed me back.</p>\n\n<p>&quot;It was your goddamn idea!&quot;</p>\n\n<p>&quot;Wait, what are you talking about?&quot;</p>\n\n<p>&quot;I am talking about the stupid fan page! If you wouldn&#39;t have forced me to put this thing up, then Heather would never-&quot;</p>\n\n<p>&quot;This is about Heather?&quot;</p>\n\n<p>&quot;Of course it is! Not only is her page more popular than mine-&quot;</p>\n\n<p>I cut her right off.</p>\n\n<p>&quot;First of all, you were helping her all the freaking time. What did you expect? Second of all, who cares?&quot;</p>\n\n<p>&quot;I fucking care, Lizzy! I can&#39;t freaking deal with her anymore. Why is she always got to be better than me? Can’t she let me have anything!?&quot;</p>\n\n<p>&quot;You know why? Because Heather doesn&#39;t care about popularity or being better than others.&quot;</p>\n\n<p>That was the last straw. Emily went forward and pushed me once more, this time, hard. I tumbled backwards and hit my head against the wall.</p>\n\n<p>Without another word, I turned to leave. I made my way past the crowd that had been watching and went back to my room. When I tried to see how much better Heather page was doing, I saw that Emily had deleted hers already.</p>\n\n<p>I didn&#39;t speak with her for almost two weeks. One morning she called me out of the blue. I was reluctant to answer. I didn’t want to have any more insults hurled at me.</p>\n\n<p>&quot;Heather was in an accident!&quot; she said in an agitated voice before I could even say hello.</p>\n\n<p>&quot;Wait, Emily what happened?&quot;</p>\n\n<p>&quot;I don&#39;t know. I am not at the hospital yet!&quot;</p>\n\n<p>&quot;I am coming too!&quot;</p>\n\n<p>At the hospital, I gave Emily a long hug. It didn&#39;t take long for us to find someone who was able to tell us what had happened. On the way to one of her performances, a car crashed into Heather&#39;s. One of her legs was almost crushed in the collision, and she had to be taken to the emergency room. The doctors were able to save the leg, but it was paralyzed. There was the possibility that Heather might walk again. Anything else was out of the question.</p>\n\n<p>When Emily heard the news, I thought I saw the hint of a smile on her face. It was only there for a moment before sadness and tears replaced it. We hugged each other, waiting until the doctor allowed us to see Heather.</p>\n\n<p>Heather didn&#39;t look up when we entered the room. It seemed like all the life had left her. When I saw her like that, I started crying. I couldn&#39;t hope to understand what was going on in her mind right now.</p>\n\n<p>Having your dream taken away in a mere instant would drive anyone into depression and a state of apathy.</p>\n\n<p>Emily visited her sister almost daily. During that time I didn&#39;t see much of her. The few times I asked her if we could get together, she declined. She had to take care of Heather, she said. </p>\n\n<p>&quot;She&#39;s my sister after all. It shouldn’t matter what happened before. We only have each other, Lizzy. Since dad died, there is no one else.”</p>\n\n<p>Once Heather was released from the hospital, Emily moved in with her in their old home. She said she&#39;d take care of her sister and assist her in her daily life. To do that she took a break from university and left the dorms behind.</p>\n\n<p>Heather was still in the same depressed state when I visited them the first time. She’d talk to me, but I felt a deep sadness in her words.</p>\n\n<p>As the weeks passed, she started to improve. During later visits, I saw Heather smiling, and Emily, in turn, seemed to be happy. It had been ages since I had seen true affection between them.</p>\n\n<p>I visited the sisters quite a lot during that time. At first, I was only there to help Emily move, but this initial visit was enough to rekindle the old friendship the three of us had shared. We spent countless evenings talking about the fun we had had together as kids and teenagers.</p>\n\n<p>In time Heather&#39;s leg got better, and soon she was well enough to handle her daily life on her own. It allowed Emily to work on her fashion again.</p>\n\n<p>One evening, when Emily was working on a new piece, I had a long talk with Heather. She admitted that she still didn&#39;t know what to do with her life. With a sad face she looked down at her crippled leg. I was quick to suggest that she could try to help Emily with her fashion. Maybe the two of them could do it together? Heather protested. There was no way she&#39;d be any good at it, she said. She&#39;d never even tried. </p>\n\n<p>In the end, I still urged her to talk to Emily. I’d not be around for some time due to a paid internship at the other end of the country. It would give her enough time to work on some fancy cloth, I said laughing.</p>\n\n<p>It was two months later that Heather killed herself by jumping out of a window. I instantly made the trip back home.</p>\n\n<p>No one understood what had happened. When I heard about it, I couldn&#39;t believe it. It came out of nowhere. Heather had gotten so much better, hadn&#39;t she?</p>\n\n<p>At the funeral, Emily told me in tears that Heather had never gotten over the fact that she couldn’t dance anymore. Sure, Heather always put on a happy face, but eventually, it got to her. </p>\n\n<p>“I should have seen it coming,” she said to me with tears in her eyes.</p>\n\n<p>During the gathering after the funeral, Emily revealed that she&#39;d name her new collection after her sister. It was to honor her memory, she said.</p>\n\n<p>In the month to follow the collection turned out to be a huge success. Not financially of course, but the positive reception was overwhelming. Many people, both friends and strangers, urged her to put them up for sale online.</p>\n\n<p>Emily&#39;s career in fashion was going well. That was until I uncovered the truth.</p>\n\n<p>By now my internship was over, and I was living in the dorms again. One day I couldn&#39;t access my Facebook account. </p>\n\n<p>To restore my password, I had to access the email I used to sign up. It was an old one I didn&#39;t use anymore. When I logged in, I had a look through the emails. It was all spam, except for one by Heather.</p>\n\n<p>For a moment I got goosebumps until I saw that Heather had sent it almost half a year ago.</p>\n\n<p>I had no idea why she&#39;d sent me an email. With not a little anticipation I started to read.</p>\n\n<p>Heather thanked me for urging her to work with Emily. At first, she was happy to support Emily here and there, but soon she enjoyed it a lot herself.</p>\n\n<p>In the next paragraph, Heather said she&#39;d started to work on a few pieces of her own. She couldn&#39;t wait to show Emily, she wrote. Before that, she wanted a second opinion.</p>\n\n<p>Attached to it were a number of pictures. When I looked through them, I couldn&#39;t believe what I was seeing. They were almost identical to Emily&#39;s new collection. The one she named after Heather.</p>\n\n<p>I was furious. It couldn&#39;t be real. Only minutes later I was on my way to Emily&#39;s house. The same house in which Heather had killed herself.</p>\n\n<p>When she opened the door, I confronted her about it straight away. She denied everything of course. It was bullshit, a fake, an email sent by someone else. Why did I even believe something like that? I should have called her instead.</p>\n\n<p>The more I pressured her though, the more the story changed. At first, Heather had never talked to her. Then, she admitted that Heather had helped her a little. Suddenly, one of the sketches was by Heather. </p>\n\n<p>Finally though, when she had enough of my questions, she confessed everything.</p>\n\n<p>&quot;It was always just her. Heather this, Heather that. Everyone only talked about her. How she was oh so perfect. And then poor, little Heather had her accident.&quot;</p>\n\n<p>As she stood there, I saw the same smile I&#39;d seen in the hospital. It hadn&#39;t been my imagination.</p>\n\n<p>&quot;But you know what? Once her dream was shattered, she couldn&#39;t help but barge into mine. Finally, I&#39;d found something I loved. Finally, there was something I was good at. And you know what? You know fucking what, Lizzy? Here comes crippled Heather again.&quot;</p>\n\n<p>She was pacing left and right in anger, not even breathing as she spat out her sentences.</p>\n\n<p>&quot;Oh, how innocent she asked. <em>Lizzy said I should try fashion. Maybe I could try it on my own. I just want to see how things turn out.</em> And guess what? Things turned out amazing!&quot;</p>\n\n<p>She threw her arms up in frustration as she said the last sentence.</p>\n\n<p>&quot;Heather&#39;s designs were better than anything I ever did! Anything!&quot;</p>\n\n<p>Emily laughed for a bit and shook her head.</p>\n\n<p>&quot;She didn&#39;t even know what she was doing half the time. <em>Am I doing it right, Emily? Do you think this works?</em> Oh, it did, Heather. It was fucking great, Heather.&quot;</p>\n\n<p>She turned towards me again and took a step in my direction.</p>\n\n<p>&quot;Can you believe it, Lizzy? Can you?&quot;</p>\n\n<p>&quot;I, I don&#39;t-&quot;</p>\n\n<p>&quot;Of course you don’t. I couldn&#39;t either. But yet again Heather was better than me. Same as always. This time I wouldn&#39;t let her get away with it. Not this time.&quot;</p>\n\n<p>Emily still stared at me, but now her mouth twisted into a mad smile.</p>\n\n<p>&quot;You know what I did when she showed me her finished pieces? I laughed her right in the face. <em>Sorry Heather, but dear lord, those are terrible.</em> That&#39;s what I said!&quot;</p>\n\n<p>With that Emily started to giggle.</p>\n\n<p>&quot;I told her I had to hide them away before anyone could see them. <em>We wouldn&#39;t want people to think that not only your leg but also your arms are paralyzed, wouldn&#39;t we?</em>&quot;</p>\n\n<p>And with that, she broke into bouts of laughter, right in front of me.</p>\n\n<p>&quot;Oh, you should have seen her face! It was, it was-&quot;</p>\n\n<p>She had to break off to catch her breath. I just stood there, overwhelmed by this mad, insane rant.</p>\n\n<p>&quot;It was the best thing ever! The oh-so-great Heather was crying right in front of me.&quot;</p>\n\n<p>&quot;It felt so damn good,&quot; she said, face red, beaming at me.</p>\n\n<p>&quot;After that, I kept urging her to help me. It was the least she could do, I said. Maybe she&#39;d even learn a thing or two. And innocent, sweet little Heather agreed. Oh, how I enjoyed tormenting her. <em>This is no good, Heather. What are you even doing, Heather? Oh god, you are ruining everything, Heather.</em> Oh, how the tears kept flowing. She couldn&#39;t take it for long.&quot;</p>\n\n<p>&quot;Don&#39;t tell me because of that she-&quot;</p>\n\n<p>&quot;Killed herself?&quot; she finished my sentence.</p>\n\n<p>&quot;Of course! And you know what? I could have stopped her. I heard how she dragged herself up to the attic. I heard the creaking of the floorboards above me. I could have run after her, Lizzy. I could have told her I didn&#39;t mean any of it.&quot;</p>\n\n<p>And finally, her face distorted into a cruel smile.</p>\n\n<p>&quot;But I didn&#39;t. Instead, I leaned back in my chair and closed my eyes. Ten minutes later, I heard the impact.&quot;</p>\n\n<p>Now I saw the tears that were streaming from her eyes.</p>\n\n<p>&quot;Emily, you,&quot; but I broke up. </p>\n\n<p>&quot;I was... I mean... I was <em>so</em> happy, Lizzy. Finally I could be the popular one. Finally it would be me!&quot;</p>\n\n<p>She stood there, smiling in a state of bliss. Then her face turned hard again as her eyes focused on me.</p>\n\n<p>&quot;If it wasn&#39;t for this one damned email,&quot; she spat out.</p>\n\n<p>&quot;Things would have been perfect. But you had to read it, didn&#39;t you, Lizzy?&quot;</p>\n\n<p>She took a step towards me, then another.</p>\n\n<p>&quot;But you know, Lizzy, no one has to find out about anything.&quot;</p>\n\n<p>As she moved closer towards me, I took a step back.</p>\n\n<p>Then it all happened at once. Emily broke into a run. She rose her arm, and I saw something flash in her hand. Without thinking, out of sheer instinct, I raised my arms to protect myself. A piercing pain shot through me. I screamed out loud. Blood was running from my arm, and I saw the bloody pair of scissors Emily was holding in her hand.</p>\n\n<p>I could see her shaking. Her eyes darted from my arm to the scissors and back.</p>\n\n<p>&quot;Lizzy, I-I didn&#39;t mean,&quot; she started.</p>\n\n<p>&quot;Get the fuck away from me!&quot; I screamed at her. I ran from the house and to my car. </p>\n\n<p>I made it to a nearby hospital. Thankfully it was a painful but minor injury.</p>\n\n<p>Once I was back home, I revealed the full thing. I sent Heather&#39;s email to everyone I knew. Then I shared not only the email but also all the things Emily had confessed to me on social media.</p>\n\n<p>It didn&#39;t take long for people to turn on Emily. My phone rang day and night. Calls and texts by Emily kept flooding in. I ignored them all. It wasn&#39;t long before praise for Emily turned to condemnation.</p>\n\n<p>There was a lawsuit, but nothing came to it. Suicide is a divisive issue here, and my story could not be proven by one email and a minor injury I had failed to report. It was ruled that the driving force behind Heather&#39;s suicide had been her ongoing depression. </p>\n\n<p>I don&#39;t know what happened to Emily after all that.</p>\n\n<p>For a while, random accounts posted spiteful comments on my Facebook profile. The same happened to a memorial page Heather&#39;s friends had created. Everyone knew it was Emily. </p>\n\n<p>After a while, things got quiet about her. Some said she moved away. Others said her guilt finally got the better of her, and she followed her sister into an early grave.</p>\n\n<p>If she is alive, I am sure her envy still torments her. <a href=\"https://www.facebook.com/r.rehnwriter/\">Even now.</a></p>\n</div>\n","author":"Rakushasu"}