{"rank":"2","title":"This is part two of a situation that I've gotten myself into...It's been going on for a while, but I'm losing it...Please help...","id":"8jq5f5","url":"/r/nosleep/comments/8jq5f5/this_is_part_two_of_a_situation_that_ive_gotten/","time":"1526426354000","body":"<div class=\"md\"><p>I want to set the record straight with this writing. What I also want is for what I’m going through to be a horrible nightmare. I can’t explain how I feel about the past couple of weeks and events prior to where I am now. For starters I got that job my parents wanted me so desperately to get, but that&#39;s not where I want to start. What had happened in the last part of the story still haunts me, and if I’m honest it got worse later that same night. I’m not going to pretend that everything is okay either. After the man did his houdini act and then scared the shit out of my friend and I. I still had quite the drive ahead of me.</p>\n\n<p>Kyle and I stayed on the phone for a while and we both decided that it was best for us to keep the events that had just happened to us a secret between us two. Though I have to say I feel kinda bad about posting the first part of this story earlier, but i needed to vent...I’m sure you all can understand. Regardless, I was still on edge the whole ride home, and I couldn’t shake the feeling that I was being watched. I took it upon myself to not go straight home. I was followed for a bit in my opinion, though, they turned off some side road in my neighborhood I can’t name. I did get home though near 4:15 A.M.</p>\n\n<p>I was exhausted and barely got undressed before bed. I kept my jeans on, but no shirt. I was slowly getting at ease when I hear noises coming from the driveway. I get up and start towards the window. There were three men around my car...I couldn’t move. For context sake my home is fairly large and has one upstairs bedroom, and that is where I live. Just far enough to where I can avoid my family. I guess one of the men saw my blinds move or something because one of them stared right at me. I froze in fear. These men knew where I lived, and I just dragged my family into whatever shady shit these guys were plotting.</p>\n\n<p>They left  soon after that. I’m scared, no..I’m terrified of what I have fallen into. This unfortunate turn of events is causing me to watch over my shoulder constantly. I’ll never know if those guys come back or when...they could show and put my family in danger. I’m confused and I want some help...Please.</p>\n\n<p>I will keep you all updated on any other events that happen if they happen. </p>\n\n<p>I am doing my best to make sure I am never followed home, though I don&#39;t think that matters anymore. I don&#39;t exactly pray, but I may start. This is so fucked! I mean I just wanted to enjoy my summer and be with my friends and family, not feel like america&#39;s most wanted . This isn&#39;t fair...Why me...</p>\n\n<p>I&#39;ve cried myself to sleep a few nights in a row, and I don&#39;t think I can risk the live of my family by sleeping...I may have to just red bull up, and see what happens for a while.</p>\n\n<p>Part 1:</p>\n\n<p><a href=\"https://www.reddit.com/r/nosleep/comments/8j15s8/this_story_is_100_true_but_its_taken_me_a_while/\">https://www.reddit.com/r/nosleep/comments/8j15s8/this_story_is_100_true_but_its_taken_me_a_while/</a></p>\n</div>\n","author":"-MattCrag-"}