{"rank":"5","title":"Music is my life.","id":"8jq7ma","url":"/r/nosleep/comments/8jq7ma/music_is_my_life/","time":"1526426895000","body":"<div class=\"md\"><p>Music is my life.</p>\n\n<p>Now, when I say that - I don’t mean it like everyone else does. It isn’t some trite way of expressing my love for melody and harmony and all that bullshit. I mean exactly what I said.</p>\n\n<p>Music. Is. My. Life.</p>\n\n<p>If I listen to music - if I get a song in my head - somehow, it manifests itself in my life. Sounds great, huh? Maybe you’re thinking that I should play the Barenaked Ladies’ “If I Had A Million Dollars” over and over. Yeah… try and explain that to the IRS.</p>\n\n<p>See, when I was growing up, there was no music in my home. No radios. No television. No record players. My parents never sang to me as a baby. Nothing. I was homeschooled, and spent any leisure time I had reading or drawing. It wasn’t until I was maybe eight or nine years old before I actually heard music for the first time. I was sitting in the back of my dad’s car while he was running some errands. He never had the radio turned on when I was in the car with him, and being that age, curiosity about that strange thing in the middle of the dashboard with the buttons and knobs naturally took hold of me. I climbed over the back of the seats, started pushing the buttons, watching the orange needle slide back and forth across the rows of numbers, then twisted one of the knobs. Immediately, music filled the car.</p>\n\n<p>For the first time in history / It’s gonna start raining men\nIt’s raining men / Hallelujah, it’s raining men, amen</p>\n\n<p>Then I heard a loud thump outside the car, and someone screaming. I looked out the window, and saw a body lying on the ground, its limbs bent all wrong. The next body fell while I was looking, and its head slammed onto the hood of my dad’s car, rebounding the body backwards away from me, an expression of shock on the part of the face that was still recognizable.</p>\n\n<p>The next thing I knew, my dad was yanking open the passenger door. I thought it was to pull me out of harm’s way, but instead, he reached in and twisted the same knob I did, turning off the radio. He told me in a way-too-calm voice to get back into the back of the car, and I immediately obeyed. I sat there for what felt like hours, as police and ambulances and firetrucks choked the parking lot, and the police talked to a bunch of people, including my dad. Eventually, he got back into our car, and we drove home in silence.</p>\n\n<p>The newspapers the next day reported that a scaffold being used by some men doing brickwork on the building next to the store had failed, and two men fell to their deaths. They blamed it on bolts shearing off or something… but I know the truth. The music made it happen. I made it happen.</p>\n\n<p>Now, I wear earplugs anytime I go out, which isn’t often. I still read a lot, and draw a little. I work at home, copy-editing journals about marketing trends - it’s boring as hell, but it pays money. I usually get my groceries delivered, and Amazon is my best friend. Not the most exciting life, to be sure, but it’s for the best. For everyone’s sake.</p>\n\n<p>Well, almost everyone.</p>\n</div>\n","author":"JeffKochosky"}