{"rank":"65","title":"Our pot roast tastes like human","id":"8jqc2i","url":"/r/nosleep/comments/8jqc2i/our_pot_roast_tastes_like_human/","time":"1526427989000","body":"<div class=\"md\"><p>I get some weird customers on night shift including cannibals, apparently??</p>\n\n<p>So It&#39;s 2am and an elderly couple comes in. That&#39;s weird to begin with, I never see people over 50 come in on my shift (10p-6a). They order coffee and camp out for awhile and tell me they will order later. It&#39;s completely dead otherwise so I just sit in the back playing my 3ds. They order 30 minutes later with the man getting a burger and the lady getting one of our omlettes that has pot roast in it. </p>\n\n<p>They get their food and as I&#39;m walking nearby to go sweep something  off the floor i hear the lady go &quot;doesn&#39;t this pot roast taste like human?&quot; And i think hearing that gave me whiplash. I really wanted to believe I just heard wrong but my dumbass decided to say something and be like &quot;does it really?&quot; and fuckin. They both give me a worried loo k like they know they freaked me out. But then this sweet old lady just starts explaining to me that her and her husband have eaten human. Her husband worked in a morgue for 20 something years and would bring home &quot;treats&quot; for them and i just. Wtf. She asked me if I wanted to taste the pot roast because it genuinely tasted like human but fuck no I didn&#39;t. </p>\n\n<p>For some reason I ask for more details and the man says that he only took meat from bodies that had already been mutilated somehow like murder victims and what not. Okay at this point I think they&#39;re just fucking with me so I&#39;m like trying to play along I guess and ask if they season the meat. Apparently they season it with salt, pepper, basil, and rosemary but tell me that the pot roast tastes like unseasoned human.</p>\n\n<p>Okay like they&#39;ve got to be fucking with me. But then the old lady goes &quot;don&#39;t bother calling the police about us, this was years ago and we&#39;re not gonna tell you what morgue it was at. but if you do want to know what human tastes like your pot roast isn&#39;t far off.&quot; And SHE SMILES it&#39;s such a genuine and creepy smile and I&#39;m completely floored.</p>\n\n<p>I avoid them the rest of the time they&#39;re in the restaurant and they&#39;re the only ones here besides my cook who&#39;s out back smoking, and so i cash them out and what not and god i just wanted them to LEAVE but they camped there for another 20 minutes or so and after they left i go to clean up their table. They left a cash tip but sitting on top of the bills was a bit of the pot roast. I completely froze </p>\n\n<p>Never in the 10 months I&#39;ve worked this shift have I wanted to quit because of some customer. I&#39;m hoping, PRAYING, that they were just fucking with me. But it all seemed so genuine, too genuine. I&#39;m still freaked out about this and I think I always will be </p>\n</div>\n","author":"gemmynid"}