{"rank":"27","title":"Matthew [Part 1]","id":"8jqjai","url":"/r/nosleep/comments/8jqjai/matthew_part_1/","time":"1526429801000","body":"<div class=\"md\"><p>I don’t know what drew me to the small town of Grundy, but when I was offered the position of teaching high school math, I couldn’t refuse. I had been out of work for going on 4 years now, and my husband and I had almost drained our savings account.</p>\n\n<p>Our new house was a small, blue suburban that you would see on some hit Netflix series. We had gotten an unreal price on it, despite it being in an up-and-coming neighbourhood. There was only three other houses on the road but there was promise. It backed onto a nice pond and it was far enough from the downtown to see the stars.</p>\n\n<p>My first day at work at my new job was like any other; the “nerdy” students sat near the front whereas those who cared more about the next party sat at the back on their phones, probably snap chatting. I couldn’t blame them; I never cares about school when I was a student. Kind of ironic now that I teach.</p>\n\n<p>There was one student in particular that caught my attention. He wasnt wearing a football jersey or dressed in all black with lipstick. He just had an aura around him that made me uneasy. I don’t know a better way to describe it. He didn’t raise his hand in class, or even offer a smile. After the first few weeks I called him to stay a little after the class had concluded so I could figure out if he was just quiet, or maybe if something at home was happening. I wasn’t a stranger to abuse; my husband and I adopted our son after his mother was arrested for neglect and beating him when he was just 4.</p>\n\n<p>“Hello Matthew. I hope you’re enjoying my class”, I say offering a smile.</p>\n\n<p>No response, just a glare.</p>\n\n<p>“I’ve noticed that you tend to keep to yourself. I wish you would participate in discussions more”</p>\n\n<p>Again, nothing.</p>\n\n<p>“Is everything okay? Are you fighting with your friends, or is something happening at home?”</p>\n\n<p>The moment I said home, a smile crossed his face. As if only that word registered. I wondered if maybe English was his second language.</p>\n\n<p>“Home”, he said- with a smile.</p>\n\n<p>“Is everything okay, do you live with your parents?”</p>\n\n<p>“I wish to live with my mom” he said, sweetly. </p>\n\n<p>The expression on his face, and the way he said that did not register as someone who was being abused. I analyzed him for signs of bruises but he was wearing a sweater that only revealed his wrists. </p>\n\n<p>“I hope you are able to, Matthew” I said, with a smile. “You can talk to me about anything, I’m here for you”. </p>\n\n<p>With one last smile, he nodded and left the classroom. I felt a cool breeze down my spine that lead to goosebumps on my arms. I dismissed it as the A/C unit in my room, but I wish I hadn’t.</p>\n\n<p>Over the course of the 6 months we lived on Gallenby street, we got very familiar with our neighbours. </p>\n\n<p>Jean and Claudette often has us over for board games in the evenings. They had a girl that same age as Kevin. They got along as well as most 5 year olds do. Often fighting over whether to play princesses or spider man. </p>\n\n<p>Stacy and Brad were nice too. Stacy and I would go for walks around the pond in the evenings and vent about things our husbands said or did (more often what they didn’t do). </p>\n\n<p>Joan was an elderly woman who I only saw every now and then. Claudette said she visited her children often; Stacy said she hid bodies in her basement.</p>\n\n<p>It wa October 16th and was a particularly cold day. It had been about a week since my talk with Matthew. He was more upbeat in class. Would smile when I looked in his direction although he didn’t contribute to discussion. When I would ask him a question, his smile would fade. I moved on to the next student and his smile would return. I guess he was just shy.</p>\n\n<p>After work as I was was packing up my bag to leave, I heard a soft knock on my classroom door. I was a little confused as it was nearing 5:00pm and my door was wide open.</p>\n\n<p>“Hello?” I called out.</p>\n\n<p>Nothing. Must of just been another staff member in their own room. </p>\n\n<p>I grabbed the stack of papers I would continue to grade at home when I heard the same knock. This time, I went to go investigate. </p>\n\n<p>I peered my head out my door but no one was there. I could of swore I heard something. I walked back to my desk, picked up my bag, keys and phone.</p>\n\n<p>Again that knock. Without even turning around, I entertained the idea that someone was playing a joke so I yelled “come right on in”.</p>\n\n<p>When I turned out, I nearly collapsed.</p>\n\n<p>Behind me stood Matthew. </p>\n\n<p>Catching my breath for a moment, I finally broke the silence he had set.</p>\n\n<p>“Matthew, what are you still doing here?”</p>\n\n<p>He just stood there, staring blankly.</p>\n\n<p>“Are you okay? Does your father know you’re still here?”</p>\n\n<p>Nothing. The silence was making me uneasy.</p>\n\n<p>“Do you need a ride home?” I asked. I regretted it once the words escaped my mouth. Like before, the word home released a smile on his face.</p>\n\n<p>“Yes please” he said. “I’ve missed the bus”.</p>\n\n<p>Already having offered, I directed us towards the door and towards my car. He couldn’t live that far away; it was a pretty small town. The high school only had about 200 students, give or take.</p>\n\n<p>The drive was awkward. Trying to provide comfort for myself and him, I tried to strike up conversation but every effort was shot down.</p>\n\n<p>The address he had given me was an acreage on a road I was not familiar with. I let him lead the way since my phone was nearly dead and I didn’t want to drain the battery in case my husband called.</p>\n\n<p>“Turn here” he said, pointing to a path covered heavily by trees about 20 minutes away from the school. I slowed down as it was getting park and the only light offered came from my car. Slowly creeping, we approached an opening. But no house.</p>\n\n<p>He began to unbuckle his seatbeat.</p>\n\n<p>“I thought this was your home?” I asked.</p>\n\n<p>He paused for a moment then did his seat belt back up.</p>\n\n<p>“I must be mistaken. It’s late and I’m very tired.”</p>\n\n<p>How could a 16 year old boy who has lived in this town for his whole life (minus a few early years- I inquired with the school councillor) forget where he lived?</p>\n\n<p>Puzzled, I asked “do you have your fathers phone number? Well call him to pick you up” I offered.</p>\n\n<p>“No ma’am. He would be very angry” he said.</p>\n\n<p>I struck a nerve. His whole demeaner changed.</p>\n\n<p>“How about your mother, I’m sure she’ll come get you”</p>\n\n<p>His body relaxed and he looked at me with a smile I wish I hadn’t seen.</p>\n\n<p>“Yes ma’am”</p>\n\n<p>Looking at my phone, I only had 5&#37; battery left. I hesitated but thought it would be best to go straight home and let him use the landline. It was late and my husband would probably be worried.</p>\n\n<p>We backed out of the forrested path and I drove to our house. As we came to the last turn, I hesitated. But proceeded to my house. The lights on, familiar figures in the window. That gave me comfort.</p>\n\n<p>I took Matthew into the house and introduced him to my husband and explained the situation. I handed him the landline and gave my address for him to give to his mother.</p>\n\n<p>“She is on her way” he told me afterwards. </p>\n\n<p>A sigh of relief exhailed from my body. I began to prepare dinner, adding extra portions in case we had our unplanned visitor stay later than intended.</p>\n\n<p>Around 7pm, as the chicken was almost cooked, I heard my son giggling from the living room. I peered in to see him watching Tv with Matthew. The sound was off on the TV but graphic, gruesome images of pornography and war and bodily mutilation sprang from the screen.</p>\n\n<p>Kevin!” I snapped as I ran to the tv and turned it off. I couldn’t imagine my boy sitting there, watching such horrible imagines. Laughing at them. “Go to your room NOW” I yelled.</p>\n\n<p>I’ll never forget the words that escaped his mouth. </p>\n\n<p>“Bitch”</p>\n\n<p>My heart dropped. </p>\n\n<p>Matthew smiled. </p>\n\n<p>I was grateful at that moment when Matthew picked up his bag and declared his ride was there. I wanted nothing to do with him from that point on.</p>\n\n<p>In the new couple months, I made an effort to not look at him in class unless necessary. I didn’t even bother to call on him to answer questions. At the end of the day, I would pack up my work and leave as soon as the bell went. Every day on my walk to my car, Matthew was standing against the brick walls of the school, just staring at me with that grin on his face. </p>\n\n<p>My life was quiet until then end of January. Kevin hadn’t of had an outburst since the time him and Matthew watched that awful show together. My husband got a raise at work, and it was easier and easier to ignore Matthews presence. </p>\n\n<p>On January 3rd, it was announced that Joan had passed away. An estate sale was held and her house was cleared out. Shortly after Stacy got a job offer in a big city a state north from us and had to move away with her family. Claudette’s father was diagnosed with dementia around the same time so her and Jean flew to Florida to move her into a home.</p>\n\n<p>What was promised as an up-and-coming neighbourhood was eventually a ghost town besides my family. No one to walk with, no board games to play. </p>\n\n<p>It was the 27th of January when I sat outside and watched Kevin ride his bike. He was getting good at it without using training wheels. I was reading a magazine when I heard Kevin yell “brother!!”. </p>\n\n<p>I looked up to see Matthew, at the end of our driveway, smiling at Kevin. He patted him on the head, then looked up at me. For a split second, his eyes looked dead. </p>\n\n<p>“Kevin” I stuttered, “get inside now”. </p>\n\n<p>Kevin looked back with sad eyes, but then smiled. The same smile that Matthew had on his face.</p>\n\n<p>He obliged and slowly got off his bike and walked inside. </p>\n\n<p>“What the hell are you doing here?” I demanded. It was a fair drive to get to our house from the downtown, and there weren’t any sidewalks yet in the area. Why did he come here?</p>\n\n<p>That sinister look on his face. “I want to live with my mom” he said. </p>\n\n<p>“Well you can tell that to the school councillor” I cursed. “Get off my property now”</p>\n\n<p>Slowly, he backed away, all while keeping his eyes, and smile on me. It pierced through me like a million needles. </p>\n\n<p>The following day as I went for my evening stroll, I inspected Jeans house. It was nice, like ours, but unkept. There was some damage to the siding from a storm a few weeks back and a broken window. The paint was chipped and a the railing of the deck broken.</p>\n\n<p>I’d never been inside but figured it was the same layout as mine, as Stacy’s and Clausettes were, give or take. When suddenly, I saw curtains drawn closed in the blink of an eye.</p>\n\n<p>Was that real? I thought. Couldn’t of been. It was empty by now, and no realtors had picked it up yet. </p>\n\n<p>A light flickered off in the basement. This was too much of a coincidence to be nothing. Could be a child of Joan’s, or maybe someone would was just cleaning it really well though.</p>\n\n<p>I thought nothing more and continued my walk.</p>\n\n<p>That night, as I was brushing my teeth, I peered out my bathroom window onto the steet. I missed seeing my neighbours lights on. </p>\n\n<p>I bent down to spit when out of the corner of my eye, a light from Joan’s house flickered on. It was from the upstairs room. A figure staring out the window. </p>\n\n<p>I rubbed my eyes, I must be imaging something. It was going on 11pm, it couldn’t be a maid and there were no cars parked out front. But there was someone there.</p>\n\n<p>I quickly grabbed my camera from the dresser drawer. I pointed it at the window and zoomed in.</p>\n\n<p>Matthew. There was no question. It was him, standing in the window. But his arms were exposed for the first time of ever seen. They looked sickly. Thin and had deep crevasses in them. It had to be distortion from the windows. A big pile up of dust. </p>\n\n<p>“Hello, mommy” I hear him say. I drop my camera and turn around. But no one was there. I immediately run to Kevin’s room, but he’s asleep, cuddling his favourite toy. </p>\n\n<p>I return to the window, heart racing. To see that Matthew had vanished from the window. </p>\n</div>\n","author":"Comishia"}