{"rank":"1","title":"A girl who visits my dreams","id":"8jr32y","url":"/r/nosleep/comments/8jr32y/a_girl_who_visits_my_dreams/","time":"1526434483000","body":"<div class=\"md\"><p>I&#39;m new to this place but a few friends of mine never shut up about how this place is filled with paranormal whodoo so i thought you guys might be able to help me understand this &quot;dream girl&quot; so here is some context </p>\n\n<p>For about 6 years i have had really bad insomnia due to depression but when i sleep there is this girl who appears in my dreams when i do sleep \nShe has deep piercing blue eyes, blonde hair and blood red lips. She dosent scare me or she dosent harm me but surprisingly she seems to just be there to either give me advice or to comfort me.so im gonna tell you a few dreams she has appeared to me in.</p>\n\n<p>The most recent dream i had with her in started with me walking in to a bar and sitting at it, i ordered an old fashioned and sat drinking it in silence and smoking a cigarette just watching the plumes of silk like smoke twist and disappear  like tears becoming lost in the rain it was when i was half way through the cigarette when i had noticed her sat next to me staring at me with those deep dagger like blue eyes she leaned in closer to me and said &quot;something is coming and its going to echo through whats left of that dying soul of yours but dont worry you&#39;ll pull through you always do&quot; after she said that to me she looked at my drink and purposefully pushed it over then she proceeded to do the same to whatever she was drinking then she got up without a sound and so slowly like she was phasing through the reality of the dream and then she looked at me and said &quot;dont pour away you emotions like those drinks&quot; and she disappeared.</p>\n\n<p>I call this one lone hunter because this dream started with me in the african country side all by myself  with a rifle sat on a few rocks loading the gun and drinking from  a canteen, once i had finished loading the rifle i saw a deer or some sort of african deer thing i dont know what they&#39;re called   but that dosent matter anyway. I started to like up the rifle sights with the beast in my view and placed my right index finger on the trigger ready to take the shot but just as i was about to pull the trigger i feel a hand on my shoulder i turn and look up and there she is looking down at me with those haunting eyes with the sun splitting through her hair fragmenting its rays. She sits beside me and grabs my canteen and takes a drink theen proceeds to wipe of her mouth and while looking at the deer she says &quot;out here we are all alone not just you but everyone but dont worry youll find someone, youll find what youre looking for we all eventually do but right now you&#39;re willing to kill the natural and beautiful to find it but that&#39;s you in general, just be calm you wont be alone out here for long&quot; she then got up and walked out in to the desert , again slowly and almost like she was phasing through the reality of the dream </p>\n\n<p>This will be the last one i share for now.</p>\n\n<p>I call this one the city stalker, in this dream im walking in my city it has light foot traffic but it slowly starts to get heavier and heavier i start to feel boxed in and start to panic and  run in the dream it felt like i was running for hours still surrounded by a sea of people then all of a sudden she appears while im mid stride in the run right in front of me, i instantly stop and stare at her her dagger like eyes stopping me in my tracks and subduing me in place almost like my feet are glued to the floor she walks up to me slowly and she holds out her hand and in her palm is my favourite cigarette, a marlboro red, i take it from her palm and light it up she is still staring me down when she begins to speak and her words were as follows &quot; in a sea of faces no one knows we can only find comfort in familiarity but that dosent even matter to you much anymore does it?, just try to be calm in this sea of sorrow and you&#39;ll come out on top, you always used to anyway.&quot; She then slowly walks in to the flowing crowds and disappears.</p>\n\n<p>These are real dreams i have had and i thought i would share them here or on the chans /x/ board </p>\n\n<p>I have got more dreams to share of you want them </p>\n\n<p>And yes i dont use grammar ive been awake two days eo grammar isnt on my mind </p>\n</div>\n","author":"Johnny-retro"}