{"rank":"11","title":"Has anyone heard of a demon that breathes smoke? [Part 1]","id":"8jr4bs","url":"/r/nosleep/comments/8jr4bs/has_anyone_heard_of_a_demon_that_breathes_smoke/","time":"1526434777000","body":"<div class=\"md\"><p>My son Luke is 34 now and he’s been in the hospital since -</p>\n\n<p>Oh God, I can barely even talk about it. It took me so long to even open the box marked “EVIDENCE” in my attic, let alone read the transcript of the note he left on his cell phone. I hadn’t read it since his trial 10 years ago. </p>\n\n<p>I don’t think I can tell you what happened; you’ll just have to read what took me many nights and lots of tears to transcribe. Maybe someone, anyone, can understand what happened and help our family. Please, if any explanation comes to you, tell me. I know Luke isn’t crazy, but I can’t even begin to understand why he did what he did. Please, please help me and my family.</p>\n\n<hr/>\n\n<p>I don&#39;t know if I&#39;ll remember much longer, so I have to write this while I can. I got here, my grandparents’ old farmhouse, two nights ago. I started thinking about the place over the winter for some reason and I told Mom I could spend a weekend fixing up the place to finally sell since my grandparents have been dead for a few years. I talked to my brother Tom, and he agreed to come on the last day to help with the repairs and also let his daughter Mia see the old place. She hadn’t been born when Grandma was still alive and the place was in use. They had to go to a wedding this weekend, and Mia was the flower girl, so Tom said they’d join me on Sunday.</p>\n\n<p>I got here late on Thursday night, and it was cold for some reason. I didn’t think anything of it. I didn’t sleep well the first night, but I don’t know why. Every time I woke up it was silent; no wind and no creaking in the old house. </p>\n\n<p>I was on edge Friday morning. Miss Sally, the neighbor and my grandma’s best friend, brought me some coffee while I was inspecting the barn and the outside of the house for repairs. She was quiet, but finally told me something I’d never known: Her husband Franklin had died at the farm 30 years ago. He’d been helping my grandpa fix his old combine harvester, and it turned on unexpectedly and Franklin was killed. Miss Sally told me they never found his wedding ring.</p>\n\n<p>I was rattled, but shook it off. I hadn’t even been born at the time, so it made sense that no one would have told me about it. I promised Miss Sally I’d keep a lookout for Franklin’s wedding ring before I drove into town to pick up supplies from the hardware store.</p>\n\n<p>Back at the farmhouse I replaced the gutters and some broken shingles on the house and took a power washer to the siding. Around lunchtime I decided to take a walk in the woods where Tom and my cousins and I had played when we were kids. I followed the vague remnants of a hunting trail without thinking about where I was going until I came to a ravine: the ravine. It was where my grandpa had died.</p>\n\n<p>I hadn’t thought about it in ages, probably blocked it from my mind. I was four years old and he was taking me to pick wild strawberries. I don’t remember how, but he tripped or slipped and fell down the ravine, and by the time they found his body it was late at night. They didn’t find me until the next day; I’d wandered away and gotten lost after he fell. All I really remember is the rustling of dead leaves on the forest floor, then my grandpa disappearing over the edge of the ravine, and then just being cold and alone and in total silence until the next morning when the search party finally found me.</p>\n\n<p>I was standing way too close to the edge of the steep drop for some reason while I remembered what had happened. As soon as I realized it I jerked myself back, but slipped and fell. I panicked, my heart was in my throat, but I was fine and still on solid ground. Then I saw just what I’d slipped on. It was a rock about the size of a softball, but it had a handprint on it. A tiny, four-year-old’s handprint, and it was the color of blood.</p>\n\n<p>I scrambled up and ran back to the farmhouse, rushing from one task to the next until the sun began to set to avoid thinking about my grandpa’s death. Once it got dark I ate some ramen, then continued to work inside the house, checking all the plumbing and wiring and making any fixes I could.</p>\n\n<p>Finally I made myself stop working because I was shaking so badly. I tried to tell myself that the handprint on the rock couldn’t have actually been mine, and that it couldn’t be blood. I smoked a joint that I’d brought with me, and it didn’t really calm me down but it did make me sleepy, so I hurried back to my sleeping bag.</p>\n\n<p>I had a dream that night about my cousin Kelly and I playing in the barn. We loved to climb the stacks of hay bales then tumble down them, but this day was different. I was 14 and it was just me and Kelly, who was the same age. We were racing each other to the top of a mountain of hay bales, and we scrambled onto the top bale at the exact same time. But instead of stopping, I let my momentum carry me and I ran right into Kelly, shoving her. She fell in slow motion and the pile of hay bales I stood on seemed to rise taller and taller, until she hit the ground below with a dull cracking sound.</p>\n\n<p>Everything was silent. I stared down at the barn floor where she was sprawled out and bleeding, but she didn’t move and didn’t make a sound. Neither did I. But suddenly I was aware of someone or something standing behind me. I could feel a coldness radiating, like the opposite of body heat. I turned, and I saw a figure draped in a dark, rusted red robe. It was the color of dried blood. Two small tendrils of smoke or steam rose from the deep shadow where its face should be. Its hands were pure black, and clutching a small earthenware bowl.</p>\n\n<p>I was terrified, but I couldn’t do anything—couldn’t scream, couldn’t run. Suddenly in a blur of red the thing rushed at me, and the next thing I knew I woke up on the floor of the farmhouse, writhing in my sleeping bag and drenched in sweat.</p>\n\n<p>*</p>\n\n<p><a href=\"https://www.reddit.com/r/nosleep/comments/8k0fh8/has_anyone_heard_of_a_demon_that_breathes_smoke/\">Part 2</a></p>\n\n<p><a href=\"https://www.reddit.com/r/nosleep/comments/8k9our/has_anyone_heard_of_a_demon_that_breathes_smoke/\">Part 3</a></p>\n\n<p><a href=\"https://www.reddit.com/r/nosleep/comments/8kipcw/has_anyone_heard_of_a_demon_that_breathes_smoke/\">Part 4</a></p>\n</div>\n","author":"whathappenedtoluke"}