{"rank":"165","title":"Any tips for getting rid of forehead pimples?","id":"8jr8ez","url":"/r/nosleep/comments/8jr8ez/any_tips_for_getting_rid_of_forehead_pimples/","time":"1526435749000","body":"<div class=\"md\"><p>Ever since I first hit puberty, I&#39;ve had to struggle with being teased due to the copious amounts of pimples dotting my forehead and cheeks. I&#39;ve tried everything, from cheap wipes to $60 acne medication. Nothing works. I don&#39;t even wear makeup because I&#39;m so scared of it getting worse. This results in more teasing, since I can&#39;t wear cover-up or foundation. </p>\n\n<p>I used to be pretty. </p>\n\n<p>I wasn&#39;t always like this. Before puberty, I had a beautiful porcelain face. At night I like to reminisce how old ladies and other girls would &quot;oooh&quot; and &quot;ahhh&quot; over the clearness of my skin. Up until I hit high school, I was seen as the cutest girl in my class. I know that sounds vain (and it is), but it&#39;s the only thing that really keeps me going. I&#39;m in my 20s now. My acne has only gotten worse. They&#39;re large, red and cystic - yet the worst are the ones on my forehead. I have to balance between having bangs and keeping my hair up, because I can&#39;t decide what would be better. Should I keep my oily hair away from my skin, or cover-up the disgusting scars and lumps? </p>\n\n<p>I can&#39;t deny that this may be partly my fault.</p>\n\n<p>I&#39;m slightly addicted to skin-picking. Alright, that&#39;s an understatement. I&#39;m really addicted to it. I know it&#39;s bad for me and leaves scars, but for a few seconds I can look beautiful again. And let&#39;s all admit it, there&#39;s something so satisfying about squeezing and picking pimples, right? It&#39;s an amazingly addicting feeling. I love digging my nail right under the hard tip of the pimple and popping it off. It&#39;s like I&#39;m removing all the bad things in my face, and maybe, just maybe, if I do it enough it&#39;ll all be gone. After the initial pop, I squeeze. I squeeze really hard, because if you do it hard enough, it starts to bleed a bit. Squeeze harder and blood starts leaking out of the pore, but the best part is the pus. It can&#39;t fully mix in the blood, so it creates a disgustingly-satisfying colour akin to ketchup and mustard when it runs down my face. Or maybe more accurately, cheese and tomato sauce. Pizza-face, right? Ha. Well it definitely doesn&#39;t taste the same. </p>\n\n<p>So here&#39;s the main issue. I think I squeezed too hard last night during one of my nightly-popping sessions. You see, there was this monster of a pimple right on the center of my forehead. I swear to god, it was the size of half a golf ball. Touching it felt like someone was jabbing an ice pick into my skull. As much as I would love to do that to the pimple, I&#39;m not that stupid (and I don&#39;t own an ice pick, haha). So I sat in front of my vanity and decided yep, tonight is the night. I&#39;m killing this thing. As I brushed my finger across the peak, it felt almost like brain-freeze. I could feel this coldness and pain in my teeth, behind my eyes. It had to go. And I can definitely say, well... it&#39;s gone now. </p>\n\n<p>First I sanitized my hands (like I said, not stupid). I cut most of my nails, except for my pointer-finger. I like to keep one long to pick-off the cap - sounds gross I know, but it works. Carefully, I placed the under-side of the nail under the top of the cyst. Now, in retrospect, I know the pimple wasn&#39;t ready to be popped yet. There WAS no cap, but I really needed this thing gone. So ignoring that, I closed my eyes and I dug. There was no satisfying pop, or immediate satisfaction. Instead, I yelped as I felt a blinding pain arch through the back of my head. I opened my eyes after a minute to see I was crying, and the pimple had changed slightly. There was an indent where my nail had dug in, but it hadn&#39;t opened. And the tip had turned this horrible purple-red colour. It looked so, so much worse than before. </p>\n\n<p>I had realized I might have fucked up by trying this, but I needed to finish what I started. I was determined to win, no matter how much it hurt. Thank god I had the next few days off work. So, bracing my left hand on the table and placing my fingernail into the purple-indent, I closed my eyes. I counted down from five, and instead of doing an upwards motion with my fingernail, I went inwards. I knew there was no peak on this blemish, so I had to get to the source. I jabbed my long fingernail straight into the center.</p>\n\n<p>I actually screamed. Something warm rushed down my hand and coated my sleeves. I was quite literally blinded by the pain, as I couldn&#39;t open my eyes because I was crying so hard and something sticky was dropping onto my eyes and gluing my eyelashes together. I stayed in a fetal position on the chair for maybe about five minutes before I pried my eyes open with my fingers. There was something crusty keeping them shut. When I finally cracked them open, I screamed again, but this time not from pain. My right hand was covered in blood. Literally, covered. It was warm and was gradually becoming sticky as it began to dry. I was terrified, but I looked at myself in the mirror. I covered my mouth with my left hand as I began to sob. Something was hanging off of the pimple - a quarter-sized slice of skin dangling by a tiny piece of flesh. It was barely recognizable as it was also covered in blood. I remember thinking, &quot;Fuck, I&#39;m gonna have to remove that aren&#39;t I&quot;. I reached with my right hand and tore it off. It hurt like a bitch, but not as much as what happened earlier. I placed the bloody skin on my desk, and it soaked the wood. </p>\n\n<p>​My landlady was going to kill me.</p>\n\n<p>Gathering the last of my courage, I reached for a makeup wipe and slowly dragged it across the giant open sore on my forehead. It resembled a small volcano, with torn skin instead of rock and blood instead of magma. The stinging as I wiped the blood off was like getting a needle in my forehead over and over again. Yet what was worse was that there was something underneath all the blood, something snot-yellow and the texture of wet cake. I wanted to throw up - no wonder this pimple hurt so bad. How long had this all been growing here? I gently touched it with my finger, and surprisingly, it didn&#39;t hurt. And then the urge overtook me again. I could dig this out. I could dig this out, and finally be over with this hell of a night. </p>\n\n<p>So I dug. I pushed my fingernail deep into the spongy pus, and it came out in lumps. It was an incredible feeling. I know how gross this may all seem, but let me just say... without the agonizing pain, this was one of the best feelings of my life. I was amazed by simply how much pus was in there. I scraped it all onto my table cloth, and looking at it, it looked so much like damp cake clumps that I even felt a little hungry! Haha, don&#39;t worry, I didn&#39;t eat it. I&#39;m not gross. Though I did have a bit of an urge, I gotta admit. As the last of the pus was scraped away, there was a dense layer of thick red left. Satisfied with how close I was to the end, I dug my finger into it, too. It hurt, but I think I was kind of getting used to pain at this point. My god, did it bleed.</p>\n\n<p>After half an hour, my work was finally done. Red and yellow crusted and dried on my desk, and there was a gaping bloody hole in my forehead. As the last touch (and to make sure I didn&#39;t get an infection), I grabbed another sanitary wipe and cleared the blood off. As I did, I was confused. There was something underneath all the blood and pus, deep within the hole. It was white, and I tried to dig my finger into it but it was waaay too hard. ​I&#39;ve tried to take it out too, but it&#39;s simply too dense. What is it? Is this an infection? I&#39;m gonna try to hit it with something, see if I can break it and then remove it. If you guys have any tips or an experience like this please tell me. <a href=\"https://crookedreality.weebly.com/\">Thanks!</a></p>\n</div>\n","author":"mimirabbit"}