{"rank":"3900","title":"I'm Trying to Sell a Chair","id":"8jr9te","url":"/r/nosleep/comments/8jr9te/im_trying_to_sell_a_chair/","time":"1526436081000","body":"<div class=\"md\"><p>I’m looking to get rid of a chair. </p>\n\n<p>Perfect condition, only about six months old, no damage at all! It’s actually a very nice, comfortable office chair. I bought it for about ninety bucks, but I think we could make a deal. How’s sixty sound? </p>\n\n<p>It breaks my heart to get rid of the chair, but I just can’t stand to have it in my room a moment longer. I can’t move it to another room. Thing is, I live in a very small apartment and my office and bedroom are essentially the same thing, so even when I move the chair out of the space, it sort of just … finds its way back. </p>\n\n<p>I’m thinking of lowering the price to fifty bucks if that’s a bit more suitable. I just can’t shake this feeling whenever it’s around me. It sounds pretty silly, I know, but I think of this old superstition that an aunt of mine told me once. </p>\n\n<p>She said that if you leave a chair sitting in the room where you sleep, at night something will sit in it and <em>watch you.</em> Now, I don’t know what ‘something’ means, but of course it’s just a ridiculous superstition! I do tend to let my imagination get away from me, though. Maybe my silly imagination is what&#39;s been keeping me up at night, but making some extra space in my room should make everything more comfortable, I think.</p>\n\n<p>So, how does forty five sound? </p>\n\n<p>The chair is nice, I promise. It supports the spine well, the height adjusts, and the original box said it can easily take up to about 300 pounds. I’ve piled that chair up with books and boxes and everything I can get my hands on and it never has an issue! I do think it might be a little off-kilter though. Perhaps it’s just the way I’ve put it together. The last few nights I’ve had it, I’ve put all of my old college textbooks on the seat. But they keep slipping off in the middle of the night. All of them just slide off the end of the seat and onto the floor, leaving the seat empty but oddly … indented.</p>\n\n<p>So how does thirty dollars sound? More reasonable? </p>\n\n<p>Speaking of off-kilter, there’s an issue of the chair turning on its own occasionally, but this may be due to an uneven floor. Once you get it in your home, I’m sure it won’t be a problem. Now and then the chair happens to twist itself a little bit to the right or left, usually stopping once it’s directly facing my bed. Now and then it’s a full one-eighty, but then again, once it’s re-assembled, it’ll probably be just fine! Darn uneven floors...</p>\n\n<p>I’ll give it up for twenty dollars if someone wants to pick it up before this evening.</p>\n\n<p>I sincerely hope this chair gets some interest soon. I just really, really, <em>really</em> want it out of my house as soon as possible. I have trouble sleeping at night when it’s facing me, and even when it’s off in the corner, I always seem to wake up in the middle of the night to find it right at the side of my bed all over again. Uneven floors, you know? I think all the stress of losing sleep has been giving me some sleep paralysis issues when I do manage to doze off. Now and again, I’ve opened my eyes after hearing the chair creak and move, only to find a dark shape occupying the cushion for a few seconds until I blink. When I blink, it’s gone. Once, when I closed my eyes for an instant, it was standing up a little bit closer to my bedside. Then it was crouching down. If this happens to you, I suggest just closing your eyes and letting them re-adjust for a few minutes. It’ll probably be gone by the time you open them again, and if not, just … keep them closed! You won’t see it if you don’t open them, <a href=\"https://youtu.be/OeM5pRlCEDA\">right?</a> </p>\n\n<p>Jokes aside, I’m willing to get rid of it for ten dollars if that’s all you can manage. I mean, I’ll even have it shipped for free if you like! Really, at this point, I don’t mind if I don’t make anything off of it. I just don’t want to see it here anymore. </p>\n\n<p>Please, I really need some sleep. It’s been days. I’m not even sure if I’m posting this in the right place, but honestly all I care is that someone sees this. Someone <em>needs</em> to buy this chair. <a href=\"https://youtu.be/d5efBnBDEFg\">Like I said,</a>  perfect condition!</p>\n\n<p>So … how does a free chair sound?</p>\n</div>\n","author":"wendingus2"}