{"rank":"7","title":"Okashi (part one)","id":"8jra6w","url":"/r/nosleep/comments/8jra6w/okashi_part_one/","time":"1526436172000","body":"<div class=\"md\"><p>I used to live in a small town with a tiny castle by a stream. It&#39;s a quaint place; in fact, it&#39;s even in the motto. &quot;Autumnville, quaint but charming.&quot; Our shop (there&#39;s only one), was run by a quiet man who minded his own buisness. Our houses are strange; some treehouses, some made of strange material, some on stilts and even a bunker (I&#39;ve been there for a party and it&#39;s actually quite cozy). I never really got to  know anyone during my time here, as I never saw the point. I still don&#39;t know whether I regret that decision.</p>\n\n<p>It all started on a boring day. Nothing to do as there was a thunderstorm and most town activities are outside. The internet was spotty at best and unusable at worst, and the phone lines were always waterlogged, or cut, or whatever other excuse the mayor came up with for never getting around to fix it. I stared out the window, wishing for a soda or some cheesecake as I was on a diet and not handling it well. Out of the blue, as if answering my prayer, a delivery truck arrived at the store, sporting a brand name I&#39;d never heard of- &quot;Oshaki.&quot; I remember thinking to myself, &quot;God, does that sound Japanese.&quot; A quick search in Google Translate confirmed that years later, simply meaning &quot;sweets.&quot; I was immediately curious. The whole truck was pink, trailer and front, and not like a light pink either- bright hot pink, with yellow and light blue cartoony designs for the name. Not only do deliveries usually happen once a month only, but usually in plain or beaten-up vehicles. I remember regretting the diet in that moment (I mean, it could really only be something I couldn&#39;t eat- they wouldn&#39;t use what looks like a Barbie semi for vegetables), but I don&#39;t anymore.</p>\n\n<p>The truck left shortly after, and the sky eventually cleared. I, wanting a distraction from the new whatever that was, hiked up to the small castle. I will admit it now, the place was technically legally off-limits, but there was only one little broken-down sign and it was a great place for some solitude. It was crumbling and dangerous, but I was brave and stupid, thus, I entered into the first nightmare.</p>\n\n<p>I had never really left the first (main) room of it when &quot;exploring.&quot; There was always a coming storm, or something in the oven, or a new art idea, or a shift at the store as an interruption, no matter how desperately I longed to explore. I believe, in retrospect, that I was simply instinctually scared and making excuses, but now there was nothing to use to get out. The main room had a very rotted rug, a couple golden rods that I assumed were once for banners, and nothing else. A large door of wood, also rotting, was at one side of the chaimber, a trapdoor sat under the rug (Anyone who&#39;s watched a horror movie knows not to go in there) and a stairway to a second floor. </p>\n\n<p>I had quite the choice in deciding which to explore first, and decided on the adjacent room. Pushing open the doors, I encountered a four-poster bed with no matress or blankets, a small end table near it, and a desk in the corner with a diary on it. Immediately, I wondered why this hadn&#39;t been found or taken to a museum, but I opened it anyway.</p>\n\n<p>It was blank. Boooooriiiiing.</p>\n\n<p>Being the greedy little shit I am, (oops language), I took the diary, a little leather thing with dragon designs, and put it in my backpack. A nice little souvenir. I lay on the bed for a minute, but it was pretty uncomfortable and dirty so I left. Next, avoiding the trapdoor, I went upstairs. A kitchen awaited me- an old stone oven, a table and some chairs, and a metal cauldron. I sat in the chair and took out a protien bar, considering it fitting to rest and energize here. I took a bite- it tasted WAY better than the blasted things usually do- and swallowed with relish-</p>\n\n<p>until I heard the little noise.</p>\n\n<p>&quot;A feast, a feast, fit for a duchess!&quot;</p>\n\n<p>I was incredibly freaked out by this but forced myself to chalk it up to imagination. Maybe I was just tired. Deciding to explore the room further was a mistake. The little wooden slab with its handle was still in its place, and I pulled it out for a joke. God, if only I hadn&#39;t.</p>\n\n<p>&quot;A FEAST, A FEAST, FIT FOR A QUEEN!!&quot;</p>\n\n<p>A sight greeted me that makes my hands shake as I describe it today. A skull with skin peeling off it, strands of hair clinging on, and one eyeball still in its socket. I screamed at this, tripping over myself to get down the stairs. A crash sounded as my exit was blocked by falling stones from the ceiling. I ripped the rug off of the trapdoor and jumped down, slamming it shut behind me as I heard rocks and stones hit where I had just been. I knelt on the dirt floor, gulping in air and sobbing at what I&#39;d just seen. How could there be an eye in there?! No, it was a hallucination, I was telling myself. Stale castle air. I found a fault in the wall and dug at it with shaking fingers, eventually crawling through to the hillside and running down to my house without looking back. I slammed and locked the door behind me, leaping into bed and hugging my pillow tight.</p>\n\n<p>I couldn&#39;t sleep that night. That skull, that eye, would haunt me forever.</p>\n\n<p>Who could have known that would become the least of my troubles?</p>\n\n<p>(end of part 1)</p>\n</div>\n","author":"StardustedDaisies"}