{"rank":"2","title":"The Sleep Experiment","id":"8jrc24","url":"/r/nosleep/comments/8jrc24/the_sleep_experiment/","time":"1526436625000","body":"<div class=\"md\"><p>It all started on that night. I got a letter in the mail and I walked in my room without Mom seeing it. I knew she would want to see. When I opened it, I immediately grabbed anything I could carry and snuck out the back door. With the address clutched in my hand, my feet carried me swiftly to my destination. After 10 minutes, I got there. When I walked in, I told the woman, “I’m here for the sleep experiment.” She just nodded and pressed a button to open the metal door. I walked in.</p>\n\n<p>When I got inside, there was a balding man sitting at his desk. It seemed like he was waiting for me. “Ah, I see you’ve finally made it, Parker.” I just nodded and gave a wry smile. How the hell did this guy know my name? “...-KER...PARKER JONES!!!” The man seemed like he was trying to get my attention. “O-Oh...sorry.” I said in a kind of small voice. The now already frustrated looking man rubbed his temples and, after taking some deep breaths, gave me a smile. “I’m very sorry for ruining your daydream, but we have some important matters to attend to. Please, take a seat while I explain.” He said in a bittersweet tone gesturing to a seat I haven’t realized until now.\nAs I sat down, the man already seemed to be ready to explain whatever he wanted to explain. &quot;Now, I suppose you&#39;re here because of a letter I&#39;ve sent, correct? Now I am not explaining what I meant...yet. I just want to do a measly, little experiment if that&#39;s okay?&quot; I then nodded, now very curious as to what he wanted me to do. &quot;Alright! Now, I am a neurologist, a person who studies the brain. I am trying to find a solution as to why people get nightmares from their subconscience, rather than their conscience. And, you seemed like the best person for the job. Oh, and if you want to know how, a close friend of yours told me how frequent your nightmares are.&quot; Joseph, you bastard! How the hell could you tell someone when I told you not to?! &quot;Now, I don&#39;t want to waste anymore precious time, so let&#39;s go to the room where this will be conducted.&quot; He said before pulling me along to the mayhem that was soon to start.</p>\n\n<p>I...don&#39;t remember much before the experiment started. I just remember the sharp pain I felt in several parts of my head. And then I was surrounded by darkness. And then I saw my mom washing the dishes. She was speaking to me, but I really couldn&#39;t hear what she was saying. Suddenly, my eyes dragged to a door that appeared suddenly. The shape of a man was there, but it wasn&#39;t a man. It&#39;s skin was leathery and had some deep cuts on its face. And it had a knife in its left hand. My eyes went wide like a deer in the headlights when I knew what it was going to do. My voice couldn&#39;t come out when I wanted it to and my body wouldn&#39;t move. Even though it was stalking behind her naturally, like it was meant to do this. Right when it was about to chop her head off, that was when my damn body and voice came back to me, &quot;MOM!!!!!!!&quot; I yelled until my voice went hoarse... but that didn&#39;t help at all. Her head rolled up to my foot. With that same smile of hers.</p>\n\n<p>And then I jumped up panting roughly and sweating. Putting myself, it felt like I had my pajamas on. But... I didn&#39;t have my pajamas on when I left for the experiment. And then I remembered about my mother and burst out of my room into the kitchen. To my horror, she was dead like in my dreams. When I ran to her body with tears streaming down my face and harsh sobs coming from my mouth, the letter fell to the floor and showed the message inside. It said, &quot;Nightmares come from your subconscience and subconscience comes from the fears of life.&quot;</p>\n</div>\n","author":"kim0419ify"}