{"rank":"11","title":"RL BFFs","id":"8jrc12","url":"/r/nosleep/comments/8jrc12/rl_bffs/","time":"1526436618000","body":"<div class=\"md\"><p>When someone dies, they’re not really gone.</p>\n\n<p>    That’s what they tell me. Over and over. </p>\n\n<p>    When I first heard the news--that first line and nothing more.</p>\n\n<p>    When we were preparing for the funeral service to start: forced apologies for a hurt they couldn’t even pretend to understand; reflex smiles guiltily flashed and quickly smothered; and the smell of death and flower rot.</p>\n\n<p>    And when he’d been gone for two days.</p>\n\n<p>    Five.</p>\n\n<p>    Seventeen.</p>\n\n<p>    But sometimes, when someone dies, they’re not really gone.</p>\n\n<p>    Not really.</p>\n\n<p>    </p>\n\n<p>I always sucked at making friends. I still do. That’s why the internet is such a Godsend: you can talk to anyone, anywhere, anytime--whenever you like. That means, if you don’t like, you don’t have to talk.</p>\n\n<p>    Perfect.</p>\n\n<p>    So, though I’ve never been any sort of popular, I do have friends. Hundreds of them. Some barely even speak English, but, when we do talk, we both really try. Can you say that about your accidental, “real-life” run-ins? The people you have to entertain in line at the grocery store. That friend you stopped really liking months ago but don’t have the balls to tell to fuck off. Or even, God forbid, your family. “LYLAS?” So someone you have to love but secretly hope will always get that pimple, eat that cookie, and flub that standardized test?</p>\n\n<p>    My main outlet is Twitter. Though late to the party, I accrued over 6,000 followers in just three months. Turns out, people who don’t know me think I’m likable. Funny, even.</p>\n\n<p>    That’s how I got connected to Jake. At first, I didn’t even know it was Jake--he was AstroBot411. He, with his 19,876 followers, deigned to follow me when I sat pretty at 1,500. </p>\n\n<p>    He DM’ed me first:  </p>\n\n<p>AstroBot411\nCome here often?</p>\n\n<p>LionessAtH&lt;3t</p>\n\n<p>Now by reflex and default.</p>\n\n<p>    We never stopped DM’ing after that.</p>\n\n<p>    Slowly, the details came out. Oh, despite what both of our profiles said,</p>\n\n<p>AstroBot411</p>\n\n<p>Location:\nOut of this world</p>\n\n<p>LionessAtH&lt;3t\nLocation:\nWhere my long-gone pride isn’t</p>\n\n<p>we lived in the same town. And attended the same school district. And were only separated by one year--so we were in the same building.</p>\n\n<p>After 3 months of constant notifications, he risked it all--in 25 characters.</p>\n\n<p>Astrobot 411</p>\n\n<p>So...do you want to meet?</p>\n\n<p>And I didn’t. What we had was perfect: a no-strings-attached, witty, flirtationship. If we met up...then what? What if I was awkward? I always was. What if he was smelly--the bad or the Axe kind. What if, I didn’t know, we just...didn’t click?</p>\n\n<p>LionessAtH&lt;3</p>\n\n<p>What if I’m ugly?</p>\n\n<p>Astrobot\nYou can’t be ugly. I know you.</p>\n\n<p>So I took a deep breath and said okay.</p>\n\n<p>We met where the people weren’t: in the library. The head librarian enforced a strict no-talking policy with her swiss knife stare. So we still wouldn’t have to talk. Not really.</p>\n\n<p>I got there first. I was wearing skinny jeans and an oversized sweater. He was wearing khakis and a faux-tux t-shirt.</p>\n\n<p>Once he sat down, I picked up my favorite lavender pen and started writing.</p>\n\n<p>Glad to see you dressed for the occasion.</p>\n\n<p>The side of his lips tugged upward. I would come to learn that this was how he smiled.</p>\n\n<p>Faux tux for a faux friendship.</p>\n\n<p>But it was about to become as real as we were.</p>\n\n<p>“This isn’t real.”</p>\n\n<p>That’s what I said. Out loud. To myself. In my room. Three weeks to the day after it happened, I said to my phone screen,</p>\n\n<p>“This isn’t real.”</p>\n\n<p>I said it again, because I didn’t believe myself the first time.</p>\n\n<p>When someone dies, everyone feels like they have to give a shit. Especially if they knew them--virtually or otherwise.</p>\n\n<p>When Jake passed, his social media received a flood of attention. Notifications for his Facebook flowed like tears.</p>\n\n<p>Miss you, Jakey! Gone too soon! XOXO</p>\n\n<p>Only the good die young. Rock on where you are now, buddy.</p>\n\n<p>If not in body, we know you’re with us in spirit.</p>\n\n<p>I made myself scroll through them the same way you make yourself eat your vegetables. “Idiots,” I muttered. These people didn’t really know Jake. He hated his Facebook. His life was his Tumblr (the boy had poetry in him). Then came Twitter. Then came Insta. THEN came Facebook. In our mutual hierarchy, it was the lowest of the lows.</p>\n\n<p>So I reached out to him the proper way--the way he would have wanted.</p>\n\n<p>LionessAtH&lt;3t</p>\n\n<p>Block the posers.</p>\n\n<p>    I just...had to send it. Like talk therapy, but for my fingers.</p>\n\n<p>    The thing was…</p>\n\n<p>AstroBot411</p>\n\n<p>Lol. I already have.</p>\n\n<p>    ...he replied.</p>\n\n<p>    I stared at that DM for a minute. Maybe two. Then I shut my phone off and threw it across the room.</p>\n\n<p>    Two minutes after that, I was turning it back on, and it couldn’t power up fast enough.</p>\n\n<p>LionessAtH&lt;3T</p>\n\n<p>Is this some kind of joke? How did you get into Jake’s Twitter?</p>\n\n<p>AstroBot411</p>\n\n<p>Because his password is RoaringWithLaughter.</p>\n\n<p>    My heart pounded in my throat. Before I could even reply, they messaged me again.</p>\n\n<p>AstroBot411\nHe changed it to that November 28. The day he met you.</p>\n\n<p>In person.</p>\n\n<p>    I bit my lip so hard that it could have been why my eyes filled with tears.</p>\n\n<p>LionessAtH&lt;3t</p>\n\n<p>But only he and I know that.</p>\n\n<p>AstroBot411</p>\n\n<p>I’ve missed you, Lisa.</p>\n\n<p>People stay on this Earth in spiritual form for a couple of reasons.</p>\n\n<p>They suffered a violent, premature death they don’t yet understand.</p>\n\n<p>They’re held here by some negative emotion they can’t release, even from beyond the grave.</p>\n\n<p>They feel they have unfinished business.</p>\n\n<p>    Jake could have easily been staying around because of number one: he was 17 years old and died in an unforeseen car crash.</p>\n\n<p>    Most of me wanted to believe it was number three. And to believe that, whatever his unfinished business was, I could fulfill it and he could rest in peace.</p>\n\n<p>    The rest of me feared it was number two. And, because he contacted me, that his anger or pain or rage was directed at and/or directly involved me.</p>\n\n<p>    When you get a message from your recently deceased boyfriend, how do you respond?</p>\n\n<p>    I made a joke.</p>\n\n<p>LionessAtH&lt;3t</p>\n\n<p>So how’s the weather up there.</p>\n\n<p>AstroBot411</p>\n\n<p>Wrong direction.</p>\n\n<p>LionnessAtH&lt;3t</p>\n\n<p>You mean…?</p>\n\n<p>AstroBot411</p>\n\n<p>Laterally. I’m right beside you.</p>\n\n<p>    And, just like that, he was. I could feel him. The hum of energy. The dropping of degrees. The reality of a connection. </p>\n\n<p>LionnessAtH&lt;3t</p>\n\n<p>Why are you talking to me? Do you need my help?</p>\n\n<p>AstroBot411</p>\n\n<p>I just need you to talk to me.</p>\n\n<p>    In more than thoughts. In more than dreams. In more than inescapable wishful thinking. Via direct message.</p>\n\n<p>    Via fucking Twitter.</p>\n\n<p>    So I took a deep breath and said okay.</p>\n\n<p>The morning after he messaged me, I hadn’t slept. I walked around all day in a vacant daze.</p>\n\n<p>So about par for my usual, recent behavior.</p>\n\n<p>But, the day after that, excitement fueled me like Red Bull.  Jake was back! Not really, but back enough. To an extent, I had my friend back.</p>\n\n<p>LionessAtH&lt;3t</p>\n\n<p>Omg Dakota Specter just pretended to tear up while talking about you.</p>\n\n<p>AstroBot411</p>\n\n<p>Tell her to let you feel her boobs. In my memory.</p>\n\n<p>My parents, my only consistent, physical connections, noticed immediately. They were torn between relief and worry.</p>\n\n<p>    “Is everything okay, sweetie?” my mom asked me over a meal of grilled chicken and mashed potatoes. “Has anything...happened...recently?”</p>\n\n<p>    I barely looked up from my plate. I was in a hurry to finish because it was ‘rude’ to text at the table.</p>\n\n<p>    “Nope.” An easy lie. “Just busy.”</p>\n\n<p>    She looked even more concerned. “Okay.”</p>\n\n<p>But her tone conveyed that she clearly thought I wasn’t.</p>\n\n<p>It only took a few days for things to get weird.</p>\n\n<p>Okay. Weirder.</p>\n\n<p>Haikus</p>\n\n<p>Started to see him, flickers of him, at his desk. At his locker. In the hallway walking by.</p>\n\n<p>If she ignored him, she would find dimes. On the counter. In her locker. Once, after a particularly long pause, inside of her shoe.</p>\n\n<p>Items started moving. At least, they would turn up in places that I don’t remember leaving them</p>\n\n<p>Bed covers disturbed like someone had lain in it.</p>\n\n<p>Laptop browser history popped back to Twitter</p>\n\n<p>Lavender pen</p>\n\n<p>Just when I would forget about him, I would smell it:  peach schnapps.</p>\n\n<p>“You hate alcohol.”</p>\n\n<p>You preferred the aloof cloud of marijuana.</p>\n\n<p>“I was talking to Jake--” Parents immediately react and does a poor job of lying. Were they right? Was she really just losing it?</p>\n\n<p>Jake begins to Tweet, though he knows she’s the only follower who can see them. HAIKUS</p>\n\n<p>Bruises on upper-bicep</p>\n\n<p>What if your best friend\nCould move on and leave you Here</p>\n\n<p>Though they don’t want to.</p>\n\n<p>Most people fear death.</p>\n\n<p>You’re more afraid of living.</p>\n\n<p>Phones have no heartbeats.</p>\n\n<p>Sometimes memories\nAre crutches and delusions.</p>\n\n<p>How can you be sure?</p>\n\n<p>I once met a girl\nWho met all expectations\nOf those who matter.</p>\n\n<p>LionessAtH&lt;3t\nThen why are you here?</p>\n\n<p>I was angry now. And scared. And confused.</p>\n\n<p>LionessAtH&lt;3t</p>\n\n<p>Why won’t you move on?</p>\n\n<p>And I waited. With tears I was too angry to wipe away streaming down my face, I demanded the truth.</p>\n\n<p>    So he stopped replying.</p>\n\n<p>    The night Jake died, I wasn’t drunk. I was beyond stoned, but I wasn’t drunk.</p>\n\n<p>    But he was. Go-Talk-To-Dakota-Spencer-And-Cop-A-Feel drunk. She slapped him and he laughed.</p>\n\n<p>    After a few hours, the alcohol made him drowsy. He almost told me he wanted to go home without slurring.</p>\n\n<p>    “Okay,” I agreed. “I’ll drive you.”</p>\n\n<p>    He looked at me like I was being coy. “Lisa. You’re so beyond stoned.”</p>\n\n<p>    I was. “And you’re drunk.”</p>\n\n<p>    He shook his head and straightened his posture. He even went so far as to put his hands on his hips and thrust out his chest. “Nope. Barely even buzzed.”</p>\n\n<p>    I was only pretty sure he was lying. “Jake--”</p>\n\n<p>    He cut me off. “Are you really going to be a lame little bitch right now?”</p>\n\n<p>    Which is something he never would have said if he weren’t drunk.</p>\n\n<p>    But I loved him. I was a socially-weak introvert who didn’t want to give him any reason to be mad at me.</p>\n\n<p>    So I took a deep breath and said okay.</p>\n\n<p>    I know it wasn’t my fault. I don’t need the cliched therapy to tell me that. I was intoxicated too. Jake made his own decision that night. I tried to tell him no. Fuck ‘tried.’ I did tell him no. </p>\n\n<p>    Maybe if I had texted it, things would be different.</p>\n\n<p>    So now Jake’s dead. He’s dead, and he won’t stop messaging me.</p>\n\n<p>    Normally if someone is experiencing a haunting, the spirit is connected to a space or an object, like a house or a doll. But this was a haunted Twitter account. It only existed on the internet. Burning sage or performing an exorcism doesn’t work on something that exists in a virtual reality.</p>\n\n<p>    I could delete the account. But every time I pulled up the login page, every time I even thought of entering that password that no one else knew, I felt the anger. It was like a physical force, like something pushing at my back. </p>\n\n<p>    “Talk to me,” I murmured the hundredth time my fingers hovered over the keyboard. But all that happened was I found a dime in my bathroom sink.</p>\n\n<p>    </p>\n\n<p>    When I can barely be honest with myself, I turn to my Tarot cards.</p>\n\n<p>    I’m not an idiot. In the beginning, I promised myself I wouldn’t believe either. Then I watched as a “wicked” pack of cards unfolded to me all of the truths I was afraid to admit I knew.</p>\n\n<p>    So, especially given the paranormal activity of the reality, I figured it was worth a shot.</p>\n\n<p>    I washed my hands. Took my time getting zoned in. Focused with humility as I shuffled seven times.</p>\n\n<p>    I got Death.</p>\n\n<p>    The Tower.</p>\n\n<p>    And The Three of Swords.</p>\n\n<p>    So a life-altering transition. Facilitated by a horrible realization. That will result in some sort of heartbreak--but I need to view it as an obstacle being removed from my path.</p>\n\n<p>    My teeth clenched together so hard that my eye started to twitch. With shaking hands, I gathered the cards and tried again.</p>\n\n<p>    Once more, I received Death. The Tower. And The Three of Swords.</p>\n\n<p>    “Fuck you!” The disrespect flew unconsciously from my lips. Horrified, I gathered up the cards, said a farewell and a thank you prayer, and placed them back in their wooden box.</p>\n\n<p>    I crossed my legs and leaned back on my hands. My heart raced like I was caffeinated. What did it mean? I could feel something tugging at the edge of my mind, like a fluttering in your peripheral vision. What was it? What was I forgetting?</p>\n\n<p>    Just like that, a migraine hit me like a punch to the face. I groaned and rolled forwards, facedown on the carpet, my hands grasping either side of my head.</p>\n\n<p>    “What?” I was crying. This wasn’t him. This couldn’t be him. “What do you want?”</p>\n\n<p>    The migraine intensified. Behind my eyelids, I watched the lights overpower and then flicker. </p>\n\n<p>    He’s angry. My head hurt so badly that I could barely think straight. Why is he angry?</p>\n\n<p>    I needed to remember….</p>\n\n<p>    Suddenly, I couldn’t breathe. It was dark. The pressure on my failing lungs felt like drowning. But...this wasn’t water. Or the ocean. This was…</p>\n\n<p>    “Too much Peach Schnapps tastes like butthole.”</p>\n\n<p>    “Text me when you get home safe?” My hand was on his upper bicep. I could smell the Schnapps on his breath. I clung to his arm like I didn’t want to let go.</p>\n\n<p>    He shook me off. “Sure, sure.” Paging through his keyring for the right one. “You too.”</p>\n\n<p>    I forced a swallow. My mouth was dry, and I didn’t think it was just cottonmouth. “I’m not the one who’s been drinking.”</p>\n\n<p>    He rolled his eyes and inserted the found key. “Enjoy the party, Lisa.”</p>\n\n<p>    So, once he drove away, brake lights disappearing beyond the bend, I tried to. I even got a solo cup full of the highlighter pink jungle juice to see if a shot or two would help.</p>\n\n<p>    But I couldn’t focus. I couldn’t wait. </p>\n\n<p>    I pulled out my phone and started typing.</p>\n\n<p>Did you make it home safe?</p>\n\n<p>    He never replied.</p>\n\n<p>    Tears streamed faster down my face.</p>\n\n<p>    He never replied.</p>\n\n<p>    But he tried.</p>\n\n<p>    My memory, my delusion, my crutch, washed away with my mascara.</p>\n\n<p>    He never replied, but he tried to. When the paramedics found his body, twisted as un-naturally as his car’s wreckage, he was mid-reply.</p>\n\n<p>    “Ye”</p>\n\n<p>    Those were his last words. His last conscious thoughts. Recorded for all of the world to see. My guilt made visible.</p>\n\n<p>    “I’m sorry.” I could barely gasp it between sobs. “I’m. So. Sorry.”</p>\n\n<p>    And, as I knelt there, a position I should have assumed all along, I felt a breeze. Not a chilly breeze, the kind of cold I’d come to associate with him. A breathe like a sigh of relief: warm and alive. The gentle gust of a summer’s breeze.</p>\n\n<p>    When it passed, I straightened. I felt uneasy, but, this time, not because I felt like someone was there with me. The paranoia crept from feeling alone.</p>\n\n<p>    With a haste that bordered on frenzied, I tried to tweet at him.</p>\n\n<p>Houston to AstroBot411. Come in, over.</p>\n\n<p>    I received an error message.</p>\n\n<p>    This account is no longer in service.</p>\n\n<p>    My heart beat faster. I tried again.</p>\n\n<p>AstroBot411 Lioness here, come in, over.</p>\n\n<p>    My phone buzzed as it delivered the same error message.</p>\n\n<p>Jake?</p>\n\n<p>Bzzz.</p>\n\n<p>Jake. Are you there?</p>\n\n<p>Bzzz.</p>\n\n<p>Jake? Come in, Jake.</p>\n\n<p>Bzzz.</p>\n\n<p>I tried to expand my consciousness, to be aware of the vibrations and energies around me.</p>\n\n<p>I found none. It was the quiet that ensues once an echo has faded.</p>\n\n<p>I was really and truly alone.</p>\n\n<p>So I took a deep breath and said</p>\n\n<p>LionessAtH&lt;3t\nOkay.</p>\n</div>\n","author":"EllipsisDotAlright"}