{"rank":"16","title":"My best friend missing two weeks ago UPDATE","id":"8jrpnz","url":"/r/nosleep/comments/8jrpnz/my_best_friend_missing_two_weeks_ago_update/","time":"1526440027000","body":"<div class=\"md\"><p><strong>The original post</strong> <a href=\"https://www.reddit.com/r/nosleep/comments/8j6kwl/my_best_friend_went_missing_two_weeks_ago/\">here</a></p>\n\n<p>Hi nosleep. Just like in the last post, I&#39;m going to be honest with y&#39;all, the original post was just supposed to be a one time thing. The farthest thing from my mind was making more updates, I figured I would post the story, maybe check the comments a few times and just never get back on reddit and pray for May to contact me. Yesterday and today have made me rethink that.</p>\n\n<p>I&#39;ll try to keep this as short as possible, and I&#39;m going to apologize in advance for any mistakes as I&#39;m trying to type this as quick as possible.</p>\n\n<p>Yesterday I decided I was going to talk to the old fireman chiefs (lets call him Jim) family. When I said he skipped town in the last post, I mean his wife fell asleep with him and woke up the next morning with him and some of his clothes just gone. He hasn&#39;t contacted anyone since he left.</p>\n\n<p>After school I made my way over to their house, we live in a very small everyone knows everyone kind of town as cliche as that is, so I had been over to their house a few times and knew where they lived. Walking up their driveway was so strange, no matter what the weather was, if it was before dinner you could always see their eldest kid playing out in the front yard, but not yesterday. Probably not since his dad left. I knocked on the door and was greeted by Jim&#39;s wife, let&#39;s call her Carol.</p>\n\n<p>&quot;Hi Kendra, what can I do for you, dear?&quot; She asked me with a forced smile and watery eyes, her voice sounded mechanical, like she had rehearsed that line a million times , but obviously I blamed it on the fact that her husband pulled a Houdini. I told her I wanted to talk to her about Jim, there was no sense in me lying about it, she simply nodded as if she had expected me to say that. She invited me in and I walked in to see the oldest kid sitting on the couch staring blankly at the tv, with the two youngest babbling happily in their play pin. Carol ushered me into the kitchen where she was cooking dinner.</p>\n\n<p>&quot;Carol, I know this must be so hard for you, and I know the last thing you need is me bothering you with a bunch of questions that you&#39;ve probably heard from a million different people this week. It&#39;s just, I think he may have known something about May&#39;s case that the sheriff is trying to cover up,&quot; I said while wringing my hands nervously. While I was talking she had turned her back to continue preparing the food she was cooking.</p>\n\n<p>&quot;May was such a sweet girl.&quot;</p>\n\n<p>The way she said that made goosebumps cover my entire body and it was in that moment that I questioned if going there was the best idea.</p>\n\n<p>&quot;Do you know if Jim knew anything? Maybe he mentioned something to you?&quot;</p>\n\n<p>I must&#39;ve sounded so desperate, hell I was desperate. I am desperate. But she just ignored me, she walked past me to grab a dish towel on the counter next to me before turning back and getting a cake out of the oven. Her movements were so mechanical, everything about the situation was just creepy, but like I said, I was desperate. I was desperate and slightly annoyed and I started to tear up.</p>\n\n<p>&quot;Carol, please. If you know any-&quot; she cut me off mid sentence by whirling around so quickly I jumped backwards and hit my back against the counter (which has left quite the bruise).</p>\n\n<p>&quot;It&#39;s a little late, would you like to stay for dinner dear?&quot;</p>\n\n<p>I wanted to say no, but there was something about her eyes that made me say yes. I didn&#39;t really know what emotion they held then, but when I thought back to it, she looked absolutely terrified.</p>\n\n<p>Sitting at the dinner table felt weird to say the least, for almost thirty minutes no one said anything, even the youngest two (twins) who are only 10 months old didn&#39;t babble or cry the way babies do, they just just sat silently while their mom fed them mashed green beans. Finally the oldest, who&#39;s eleven, spoke.</p>\n\n<p>&quot;Are you here about my dad?&quot;</p>\n\n<p>I looked over to him in surprise but he wouldn&#39;t meet my eyes, he just keep pushing his food around his plate. I tried to tell him as kindly as I could that I just wanted to check in on his mom, he just nodded his head and I glanced at his mom to see tears streaming down her face. When I tell you all that I don&#39;t think I&#39;ve ever wanted to leave a house as badly as I wanted to right then.</p>\n\n<p>&quot;Your friend, May, did they do to her what they did to my daddy?&quot;</p>\n\n<p>I looked back to the little boy in alarm, he had stopped pushing his food around and had started to tear up. Before I could answer him, his mom replied in the same monotone voice.</p>\n\n<p>&quot;May was such a sweet girl.&quot;</p>\n\n<p>I looked at them both in complete shock, because what the fuck. I probably looked like an idiot with my mouth gaping open and my gaze switching between the two of them, but what could I say? I was so utterly freaked out and I had this sinking feeling in my stomach. What did he mean?</p>\n\n<p>&quot;They&#39;re going to do it to us too.&quot;</p>\n\n<p>The little boy was full on sobbing at this point, and the babies had started to cry too. I tried to ask him what he meant but Carol stood up from her spot at the table and walked over to me.</p>\n\n<p>&quot;Kendra, I think you should leave,&quot; her voice shook when she said this, and it was the first time her voice held any emotion.</p>\n\n<p>I&#39;m ashamed to admit it now, but I left. I didn&#39;t want to, that little boy looked so terrified. I didn&#39;t know what he meant by &quot;They&#39;re going to do it to us too&quot;. I could&#39;t have known. God I shouldn&#39;t have left.</p>\n\n<p>Last night I woke up around 10 o&#39;clock to sirens rushing past my house. Somehow, I just knew. And I don&#39;t think I need to tell you what it was. My parents were still awake so imagine their surprise when I ran out the door in my pajamas and into my car without as much as a goodbye. I started to cry before I eve reached their house, I just knew what was happening. It was May&#39;s house all over again, except this time they found bodies. Five to be exact.</p>\n\n<p>Carol, the oldest boy, the twins, and Jim.</p>\n\n<p>Yes, you read that correctly.</p>\n\n<p>They made the official statement this morning. Jim most likely came to town to see his family, he just happened to pick the wrong night to come back home. The fire was caused by faulty wiring. Nothing could be recovered.</p>\n\n<p>There&#39;s one more thing before I end this post. Take a wild guess at who I saw at the edge of the crowd around another burning house?</p>\n\n<p>May&#39;s brother.</p>\n\n<p>I&#39;m going to cut this short, I&quot;ll tell you all what happened today the next time I update. If any of you can make sense of what is going on or have any advice at all, please.</p>\n\n<p>May, if you&#39;re reading this, I&#39;m begging you to contact me or your family. I&#39;m going crazy not knowing if you&#39;re alive. I know you don&#39;t want me to get involved, but if it&#39;ll lead me to answers about what happened to you, then hell yes I&#39;m getting involved.</p>\n</div>\n","author":"kendrahargrove"}