{"rank":"37","title":"Countdown...","id":"8jrr8a","url":"/r/nosleep/comments/8jrr8a/countdown/","time":"1526440449000","body":"<div class=\"md\"><p>It started a year ago, I woke up and there was a sticky note with a number next to me. The number was <strong>365</strong> the amount of days in a year and also the amount of nights.</p>\n\n<p>I would wake up, and every day it would get lower. I think it was when five nights had past, so it was when the number was <strong>360</strong>, that I was convinced it <em>had</em> to be a prank. I decided to stay up one night, and see if I could scare who ever was doing this, I figured it was my friend Tammy. She isn&#39;t the type to do this kind of thing.</p>\n\n<p>I laid in bed, and tried to close my eyes and pretend to be asleep. My eyelids became glued shut, and I actually fell asleep. When I woke up there was the number, there was a yellow sticky note with the number: <strong>359</strong>.</p>\n\n<p>The next time I tried again was a few days later. I took some adderall to help me stay up. I knew I wasn&#39;t supposed to take it at night, but I thought it would be funny if I caught Tammy, I thought I could scare her. I managed to stay up the whole night, after a few hours (I am not sure when because my eyes were closed), I could feel it. I don&#39;t know how to describe it, but here is the text I sent Tammy:</p>\n\n<blockquote>\n<p>It was horrible Tammy, I thought you were pranking me, but when I stayed up the whole night I could feel something trying to bite me. It was like it had no gums, I could feel it licking my arms. But when I woke up, there wasn&#39;t even any hint of slime. Just a yellow post-it note had the number <strong>355</strong> written in blue ink on my nightstand.</p>\n</blockquote>\n\n<p>I tried to ignore it after that. I figured it was a night terror or something. That I was sleepwalking and doing this myself. I would believe anything except what was happening. That little delusion was broken soon.</p>\n\n<p>It was a yellow sticky note with the number <strong>300</strong> written, and it was written in purple ink.</p>\n\n<p>I jumped out of bed when I saw it, my vision still a little blurry. There wasn&#39;t a single goddamn fucking purple pen in this entire apartment. I looked. There was no way it could be me. I tore the whole place apart to find one single purple pen. I was starting to sweat. Such a weird thing to call the police over, the color of the sticky notes that have been showing up in your apartment changing, but that is what I did.</p>\n\n<p>They couldn&#39;t find any evidence of a break in. None of the windows had been disturbed, no door opened. There wasn&#39;t even so much as a fingerprint on the sticky note let alone DNA. One of the cops gave me an idea to record myself sleeping. The cop was being nice, but based of the tone of all of the other cops, the tone of voice a husband gives their &quot;hysterical&quot; wife when they tell them to calm down, that the nice cop was in the minority.</p>\n\n<p>I don&#39;t blame them. I was ranting about purple pens and someone trying to bite me with no teeth.</p>\n\n<p>I told the police that someone <em>had</em> to breaking in. I told them there was no way that it could have been me doing it, and it wasn&#39;t like I owned that many sticky notes, none of seemed to work. Now when I think about it, even if they believed me, what <em>could</em> they do.</p>\n\n<p>I tried to take the nice cop&#39;s advice. I turned on my laptop and opened the webcam. I set it down on the nightstand and hit record. I prayed that this would work. I actually prayed.</p>\n\n<p>Praying hadn&#39;t helped though. I woke up and the number <strong>297</strong> was written on a sticky note, in purple ink, and the sticky note was blocking the camera. It was taunting me now.</p>\n\n<p>I started staying over other people&#39;s places, Tammy even let me sleep on her couch (that was the <strong>288</strong>th night). It got the point where I even tried sleeping on a park bench outside during the rain. I thought I had beaten it that time, but when I got up, underneath me was a dry, yellow sticky note that had purple** 26**2 written on it. The notes followed me.</p>\n\n<p>At <strong>250</strong>, I decided to try staying up again. I had taken my meds, and I stayed up. I wrote down the following experience the next morning in a notebook:</p>\n\n<blockquote>\n<p>The last time I did this, it felt like it was trying to gum my arm. Now it feels like a toddler, teething. I could feel bulges poking out of its gums. It wasn&#39;t just tasting me, it was trying to chew on me.I try to keep from shivering as it ran its tongue against my arm. It was trying to nibble at my neck. It&#39;s breath was foul, I wanted to gag. My hair stood up on its end. It was so cold. I threw up just before I wrote this. It was like cold, rotten meat. It felt more real than last time. I want to throw up again just thinking about it.Morning came, and there still wasn&#39;t even a trace of it.What would have happened if I opened my eyes? Did it even care if I was awake or not?</p>\n</blockquote>\n\n<p>After <strong>250</strong>, I did this every few days, hoping to get answers. I eventually was able to open my eyes. I couldn&#39;t see it, but I could feel it. Soon just the sight of a post it note made me want to throw up.</p>\n\n<p>At <strong>239</strong>, my lack of sleep was starting to make me slip at my Job. At <strong>232</strong>, I was called into HR to talk about my recent poor performance. At <strong>225</strong>, it was HR calling me in to let me know that I was fired.</p>\n\n<p>At <strong>215</strong>, I couldn&#39;t afford to to stay in my apartment. At <strong>210</strong> Tammy&#39;s couch became my new home.</p>\n\n<p>At <strong>200</strong> was when the pen changed from purple to black. It was probably mocking me again. At <strong>199</strong> the nightmares started to get worse.</p>\n\n<p>After that, even when I sleep I could see it. I started keeping a dream journal regularly. Here is what I wrote after <strong>189</strong>:</p>\n\n<blockquote>\n<p>It started normal enough. I was with Tammy. We were on some pirate ship, except it was like my high school cafeteria if you moved all of the chairs and moved it on top of the deck of the ship. My parents were their to pick me and Tammy and me up. I remember joking about the day we met in college.My parents and Tammy started to have their limbs extend. I ran to the front of the ship. If I jumped off I would die. there was no water, just air. Their tongues started grow so long they were outside of there mouth. They held me down. I screamed. I begged them to stop. I pleaded that I was their daughter, and that Tammy and I were suppose to be friends. They said this was for my own good. I kept screaming. I woke up screaming and I flinched when Tammy came to check up on me.</p>\n</blockquote>\n\n<p>This was pretty normal for a dream to me actually. The only thing that was terrifying about it was that the thing, whatever it was, what they had been doing to me was what it was doing to me. Here is one that is a lot more recent.</p>\n\n<blockquote>\n<p>I was hiking with my friend Jack. We had hiked like this a lot one summer. We reached the top of the mountain, and Jack said we should fly to the next. He started to fly, I tried to catch up. Whenever I try to catch something in these sorts of dreams I almost never caught it. I realized that I was falling. But for some reason, I decided that if I didn&#39;t imagine I was a bird, I would die, even though Jack hadn&#39;t been a bird.I became a bird and started looking for Jack. I couldn&#39;t find him. I flew when I flew into a house I was a fly for some reason? I guess because I was a small bird it wasn&#39;t hard for my brain to make the leap. I landed in a spider web, and when I the spider started to wrap me up in a cocoon, I was back to being human.The spider started to drool on my, and I could feel its dull teeth trying to bite me. I squirmed. I couldn&#39;t break free from the cocoon. I woke up. I was in the in the sleepybag I borrowed from Tammy. The number <strong>143</strong>, stared at back at me. It shouldn&#39;t have been able to open it from the outside, but here the sticky note was, sharing a sleeping bag with me.</p>\n</blockquote>\n\n<p>I was trying to see what happened if I sealed myself up in a bag, you can see the results. At <strong>100</strong> I leither lost the ability to sleep or my dreams now only consist of me laying down in my bed (really Tammy&#39;s couch, and then later the bed in my jail cell). The ink had changed to red.</p>\n\n<p>I had been helping Tammy pay rent, and I sold a lot of my stuff. Now everything I owned could fit in a backpack. <strong>96</strong> when she officially broke the news that she had been fired. It was <strong>95</strong> when she told me it was because of work performance. It was <strong>94</strong> when she finally admitted it was my fault. I planned to sell my last bottle of Adderall to college kids to pay rent. I had lost insurance when I lost my job, so I would only be able to do this once anyway.</p>\n\n<p>I got caught on <strong>89</strong>, I was deemed to be a flight risk when they found out I was homeless. I was scheduled for a court date to appear after 90 days. I was going to explain how I don&#39;t think it would happen.</p>\n\n<p>Some of the guards thought my sticky note was &quot;interesting&quot; and a neet way to &quot;track the time&quot;. I guess I amuse them, so they were nice enough to let me keep my journal. They were confused when I asked for a pen because they assumed that I already had one.</p>\n\n<p>One guard even went as far as let me borrow my phone. It didn&#39;t have service anymore, but I was at least able to record the text I sent Tammy. I wrote a few others down too, it was something to read to remind me of what life was like before all of this started.</p>\n\n<p>The numbers get smaller everyday, not size of the numbers, those seem to get larger. Whatever the thing was, it liked taunting me. Last night was night <strong>1</strong>. This is my last night. If you are reading this, I either was killed by that thing or I killed myself before it could get to me.</p>\n\n<p>I am sorry Tammy. If you are reading this, I am sorry you lost your job because of me.</p>\n\n<p>Mom, Dad, I know I didn&#39;t always handle your death well. I hope I can join you. I am sorry if I don&#39;t.</p>\n\n<p>It hurts so much to think about. My tears have started to get on the paper. I&#39;m glad I might get some sleep after this.</p>\n\n<p>I have long since grieved my own death. I am prepared for what happens next. I can&#39;t runaway. I can&#39;t fight it. I might just have to let it eat me. I can&#39;t get around it, if I try to shut down maybe it will make the pain more bearable. That is what I do now at night, the teeth have gotten sharp, it rips through my flesh. It doesn&#39;t matter if I am alive or awake, I can still feel it. I will still feel it as it happens for real as well.</p>\n\n<p>I guess I will see you at <strong>0</strong>.</p>\n\n<p><em>This is a transcript of just one of multiple passages in the victim&#39;s journal. This passage has been selected due to it being believed that this entry was meant as a form of a suicide note. The victim was found dead, with their wrists had been slit and their stomach had gash.</em></p>\n\n<p><em>Forensics has reported also that the cuts to the wrists were most likely self-inflicted, but it is unknown if the gash was inflicted before or after the time of death, as the victim could have been dying from blood loss and still conscious at the time of the inflection of the gash. The victim died of blood lost, and forensics has put the time of death somewhere in the middle of the night due to the ambiguity of the wounds.</em></p>\n\n<p><em>A small yellow post it note with the number &quot;0&quot; written on it. Their was also a small colon and closed parenthesis written inside of the zero. It is unknown if this had been something that the victim had witnessed in other post it notes as only the ones from the last 90 nights had been saved. Some have speculated that this was why the victim described a feeling of being taunted throughout this account.</em></p>\n\n<p><em>One other detail which it should be worthy of note was that on the bottom of the final post it note, was the inclusion of the words: &quot;The Experiment was a success&quot;. The meaning behind this additional phrase is still being speculated.</em></p>\n</div>\n","author":"AnarachaAnon"}