{"rank":"60","title":"Zombies Are Real (Part 1)","id":"8jrsnf","url":"/r/nosleep/comments/8jrsnf/zombies_are_real_part_1/","time":"1526440851000","body":"<div class=\"md\"><p>What&#39;s the difference between a cannibal and a zombie? The answer might be more subtle than you think.</p>\n\n<p>At least, that&#39;s what I found out.</p>\n\n<p>Where I grew up, in rural Tenessee, a backwoods family swirled in rumor. Sumner Mountain, its southern slope nudged up against our property, stretched into national forest on the northern side. The Fowler clan hid there, as violent as any hillbilly fright show you&#39;ve seen in the movies.</p>\n\n<p>On one occasion, they got mixed up in meth production, from what I hear some nasty bathtub shit. Five of them went off to Bushy Mountain State Penitentiary.</p>\n\n<p>The place is famous for James Earl Ray escaping from it in the &#39;70s. They based an endurance race on his route called the Barkley Marathon. I was foolish enough to run it two years ago. That&#39;s when I stumbled across the worst of the Fowler&#39;s.</p>\n\n<p>The race lasts a hundred hours, looping a brutal path that rises and falls several hundred feet in elevation. Part of it runs through the sewers beneath the prison. Most of the rest is harsh, mountain woodland.</p>\n\n<p>I made it through two stages, took a brief rest at camp, and started out again. Six others, of the twenty-six who began the race, still continued at that point. I brought up the back of the pack, the last one to trudge into the woods.</p>\n\n<p>I had only moonlight and a grimy headlamp to light my way. By three in the morning I had become hopelessly lost. My mind played tricks on me. Footsteps seemed to follow me into the night. I heard whispers all around.</p>\n\n<p>I stumbled down a hill and tore open my knee on rocks. When I righted myself, I saw a fire about a quarter-mile off. I remember thinking that no one in their right mind would be out there. No roads led in. Only animals and crazy people like me should be around.</p>\n\n<p>But I was getting delirious. My knee swelled twice it&#39;s normal size and gushed blood. I fashioned a walking stick from a tall oak limb. Considering my situation, no other choice seemed available. I hobbled toward that fire.</p>\n\n<p>Lucid enough to be cautious, I clicked off my headlamp and circled the spot on approach. Five people, as scroungy looking as mountain men could be, hooted and jumped around. They had constructed a metal platform over the fire, which flickered almost ten feet high. Bonfire would be more accurate. Two of them knelt to the ground, one with a knife raised.</p>\n\n<p>A man wriggled underneath them. His mouth bound, all he could do was scream into his throat. I worked closer, hidden by underbrush, now on my hands and knees.</p>\n\n<p>It should have been the appropriate time to leave. I was too curious and too exhausted to think so wisely.</p>\n\n<p>With grunts, the two stood, the man wriggling in their arms. His arms and legs were tied. Blood that looked black against the fire dribbled from his torso. The men swung him by hands and feet three times and heaved him atop the platform.</p>\n\n<p>His skin sizzled on the already hot metal. When he tried to roll off, another of the men who had been standing off jabbed him in the ribs with a long, sharp stick. It stuck in several inches. The lancer&#39;s shove pushed the now flaming man back. At that point, he stopped moving and stared toward the sky and let out a muffled scream.</p>\n\n<p>The men chugged down something from a shared jug. They spoke, but I couldn&#39;t tell what they said. I guessed it had to do with how well done they wanted dinner.</p>\n\n<p>Though horrified, at that point I was scared to move. My knee, grown stiff crouched there, felt even worse. I&#39;m not sure how far I would have gotten.</p>\n\n<p>I didn&#39;t have to watch them cut down the platform and carve him up. But I did. The skinniest of them produced a meat cleaver. He was a little man that was comical compared to the rest. He was like an undertaker among football players. He swung that cleaver with precision though, and the meaty cuts pulled away with ease.</p>\n\n<p>They ate as you&#39;d expect zombies to eat: an entire limb in their hands, held out as if it was a massive corn on the cob. They grunted as they ate, and laughed, and tore stringy bits away with their teeth.</p>\n\n<p>Twigs crunched behind me. And to the left of me. And to the right. Moans cried out into the night. Within arm&#39;s reach, a man lumbered past to my right. I could see his face, all slack and wide eyed.</p>\n\n<p>&quot;Meahd,&quot; he cried, a long, guttural word.</p>\n\n<p>I saw at least a dozen more throughout the woods, their gray faces lit by the flaming fire.</p>\n\n<p>&quot;Goddammit,&quot; one of the hillbilly cannibals yelled. &quot;I told you they weren&#39;t gone.&quot;</p>\n\n<p>The lumbering ones picked up their speed, walking as I might if I could swallow the pain. One of the cannibals appeared with a shotgun and stuck the business end point blank in a lumberer&#39;s face.</p>\n\n<p>He pulled the trigger.</p>\n\n<p>The head exploded like an M-80 in a watermelon. &quot;Git &#39;em!&quot; he screamed.</p>\n\n<p>Right at that moment, a hand clutched my shoulder. It smelled like an outdoor latrine, the flesh marinated in shit. I peered to my arm, could see the ashen, flaking skin on its fingers. When I looked up, it&#39;s off kilter eyes stared through me, and its mouth opened to a mouthful of rotting teeth.</p>\n\n<p>I squealed, just like Ned Beatty did, like a little piggy. Surprisingly, I found I could move on that knee, though my movements mimicked these brainless fuckers wandering up as a mob now.</p>\n\n<p>In a split second decision, I staggered through the bushes toward the fire. Cannibals or zombies? It seemed an easy choice at the time.</p>\n\n<p>Probably because I walked so like them, as I got close to the fire I found a shotgun barrel pressed against my nose.</p>\n\n<p>&quot;I&#39;m human!&quot; I screamed and threw up my hands, not knowing if that would mean jack shit.</p>\n\n<p>The fat man eyeing me down that barrel squinted, and I thought for sure that meant my head would go watermelon before I could piss myself.</p>\n\n<p>&quot;Well, shit, fellas,&quot; he said, his beard wet with what I assumed was blood and brains, &quot;we got a live one. You&#39;d best use that stick and join in the fight.&quot;</p>\n\n<p>With that, I joined the circle of men. All around a horde encroached. I&#39;d seen enough zombie movies. I plunged my stick through the face of the first one on me, and then the second and third after that.</p>\n\n<p>More of those drooping faces than I could count swarmed us. It got to where the trees that filled my vision earlier had disappeared among the tight mass of their coming.</p>\n\n<p>&quot;What are they?&quot; I screamed.</p>\n\n<p>The one with the cleaver turned after he yanked the knife free from a skull. &quot;You&#39;re a dumb fucker, ain&#39;t ya?&quot;</p>\n\n<p>&quot;Fine,&quot; I said, knowing it was a dumb question before I said it. &quot;Who are you?&quot;</p>\n\n<p>The fat one answered this time. The other three were occupied on the other side of the fire. &quot;You&#39;re on Fowler land, boy. Looks like you&#39;re an honorary cousin tonight.&quot;</p>\n\n<p>He eyed me from the side. &quot;I sure hope you make it through, cuz you got a real perty mouth.&quot;</p>\n\n<p>Then he laughed so loudly everything froze for a moment, even the encroaching zombies. It only lasted a moment, and then things really exploded into mayhem.</p>\n\n<p><a href=\"https://www.reddit.com/r/nosleep/comments/8jz0g8/zombies_are_real_part_2/\">Part 2</a></p>\n</div>\n","author":"TMM306"}