{"rank":"8","title":"Weird stuff happens every time I walk my dog. - Part 2","id":"8js3xv","url":"/r/nosleep/comments/8js3xv/weird_stuff_happens_every_time_i_walk_my_dog_part/","time":"1526444070000","body":"<div class=\"md\"><p>Hey everybody, my name&#39;s Scarah pronounced scare-ah, I&#39;m a 24 year old female, and I&#39;m going to tell you about the weird shit that keeps happening to me. At first, I thought it was just in my head. I thought maybe I was just seeing things but there something strange going on around here. Everytime I walk my dog some weird shit happens.</p>\n\n<p>About a week after I moved here I noticed a park while driving down the street and think &quot;that would be a great place to walk my dog.&quot; He&#39;s a big Alaskan malamute/Husky mix named Milo so he needs a lot of exercise. </p>\n\n<p>I work afternoons and don&#39;t live very far from work. So I always end up walking him around 11:10 pm every night. The park is about a two-minute walk from my building. It just seemed like a great place to take him because it&#39;s close by and is bright enough in the evening to see due to the parking lots on either side with tons of lighting. It&#39;s a pretty basic looking park with an old play structure in the middle, a rickety swing set, and six or seven huge oak trees scattered throughout. Towards the back is a small forest area and a baseball diamond. </p>\n\n<p>So I&#39;m in the back area walking Milo near the tree line while he&#39;s sniffing around looking for somewhere to do his business and he just stops dead in his tracks staring off to the right. When I look up to see what&#39;s going on, thinking it&#39;s probably a rabbit or something stupid, I catch a glimpse of someone in a red hoodie stepping behind a tree. I too stop and think &quot;Ahh fuck someone hiding behind a tree at night is never a good sign&quot;. </p>\n\n<p>As I stand frozen with my heart pounding in my ears I see the person poke their head out. Their face is obstructed because of their hood. I can&#39;t distinguish any facial features, but then they smile the widest most inhuman smile. All I see is large white teeth reflecting the light. I start to back away slowly while Milo growls the deepest most guttural growl I&#39;ve ever heard from him.</p>\n\n<p>I just keep starring at this thing thinking &quot; oh fuck, oh fuck! This is not ok!&quot; As I continue to back away. I reach the edge of the parking lot that connects to my street. As soon as my foot touches the pavement I turn and haul ass out of there. Breaking my gaze away from this thing and Milo follows suite running ahead of me a little bit then looking back. I just keep running unable to look back, I just can&#39;t bring myself to look at that thing again. Yeah, that&#39;s a no for me.</p>\n\n<p>I finally make it to my building jamming my key in the lock of the exterior door and wrench it open. Milo scrambles in, his nails clicking on the tile flooring. I slam the door behind me, turn to look out the window, and I see the fucker standing at the end of my street in that stupid red hoodie. Still smiling that disturbing Cheshire cat-like grin. I give it the finger and mouth &quot;fuck you&quot;.</p>\n\n<p>I turn and head up the stairs too the second floor where my apartment is. I get inside, lock the deadbolt, look at Milo and say &quot;what the fuck just happened?&quot;. He sighs at me, then heads over to his bed. I say &quot; Yeah sounds good to me buddy.&quot; Then I put my PJs on, crawl into bed, leaving the lights on.</p>\n\n<p>I have so many questions: What the fuck was that thing? Where did it come from? What the fuck am I going to do? </p>\n\n<p>Anyways, I&#39;m tired. Goodnight Reddit. Oh, and wish me luck I guess, or don&#39;t. Whatever.</p>\n\n<p>-Scarah </p>\n\n<p>Update:</p>\n\n<p>Hey guys, sorry for not updating you sooner it has been been one hell of a week. I&#39;ve started taking Milo to the off leash dog park in the evenings at the other end of town. It&#39;s about as far away from where I encountered &quot;Smiley&quot; as I can get. It&#39;s a little out of the way but that&#39;s fine by me.</p>\n\n<p>I think it&#39;s been sitting on my balcony every night, but I am way too freaked out to go check. My balcony is just off the living room with large curtains to cover the sliding glass door. Milo just sits and stares at the door while growling softly. I keep trying to tell myself that maybe it&#39;s just a squirrel, or perhaps a trash panda. Then I hear something that sounds like fingernails rhythmically tapping on the glass and think otherwise.</p>\n\n<p>Anyways the other night as I walk out the front door with Milo by my side, I hear some rustling to my left just around the corner, in the direction I am going to be heading to get to my car. I stop and listen carefully, as I stare at the corner of the red brick building. Suddenly I hear someone ask in a deep hoars voice. &quot;Hey, you got a smoke?&quot; </p>\n\n<p>I turn to see a large burly disheveled looking man step out of the darkness. He has a long brown beard with some grey hairs peeking through. He looks to be in his late forties or early fifties. I stand there speechless for a moment staring at him. He repeats the question. &quot;You got a smoke?&quot;</p>\n\n<p>I sort of shake myself trying to regain my composure and reply. &quot;Umm, no sorry sir.&quot;</p>\n\n<p>His dark blood shot eyes meet min for a moment as he slurs out an. &quot;Oh ok. Sorry if I scared you, looks like you&#39;ve seen a ghost.&quot;</p>\n\n<p>I let out a soft chuckle and shake my head. &quot;Uhh, no just been a weird week that&#39;s all.&quot;</p>\n\n<p>As I try to shuffle past him he sticks out his baseball mitt of a hand and asks.&quot;Have you seen it too?&quot;</p>\n\n<p>I give him strange look. &quot;Seen what?&quot;</p>\n\n<p>He points just over my shoulder and exclaims &quot;That!&quot;</p>\n\n<p>I whirl around, frantically searching in the direction he&#39;s pointing. I see nothing, just the front of the old red brick building next to mine. I then hear a deep chuckle from behind me. &quot;Gotcha! I&#39;m just pulling your leg!&quot;</p>\n\n<p>As I turn around to scowl at the man, I see movement out of the corner of my eye just behind him. My eyes widen in horror as a hand grabs his shoulder. The hand is a grayish color with long yellow jagged fingernails. He turns to look but the thing is already pulling him to the ground. It begins dragging him off through the parking lot towards the forest behind the adjacent buildings.</p>\n\n<p>I stand there frozen as the man kicks and screams. The thing looks up at me with that impossibly huge smile plastered on it&#39;s face. I snap to my sense pulling the hunting knife from my pocket and yell. &quot;Let him go! You stupid smiley mother fucker!&quot; </p>\n\n<p>It stops for a moment, and slowly shakes it&#39;s head no. The man looks up at it as it smiles down at him. He then quickly looks at me with confused, pleeting eyes. I shrugg and hold up my knife trying to look fearless. Milo is completely losing it at this point wanting to go after this thing. It then tilts it&#39;s head and chops it&#39;s large white teeth at us still smiling. Then continues to drag the man into the bush and disappears out of sight. I can hear the man screaming as they get further into the thick forest.</p>\n\n<p>I was going to call the police but what do I tell them? &quot;Something dragged some drunk, possibly homeless guy away, and probably ate him?&quot; They would think I&#39;m insane and ship me off to a psychiatric hospital. No, I&#39;m going to have to stop this thing myself, but first I have to figure out what it is, and how to stop it. </p>\n\n<p>I gotta get my shit together and figure out what I&#39;m going to do. I think I&#39;m going to need more than a knife to fight this thing. I will update you guys when I can, or should I say if I can. Hopefully this thing doesn&#39;t kill me before I kill it. Goodnight Reddit, hopefully I can get some sleep.</p>\n\n<p>-Scarah</p>\n</div>\n","author":"scarahk"}