{"rank":"43","title":"I, The Hunter.","id":"8js57c","url":"/r/nosleep/comments/8js57c/i_the_hunter/","time":"1526444460000","body":"<div class=\"md\"><p>I am a hunter. Not a not a hunter animals though, nor a hunter of people. I am a hunter of creatures born to cause chaos. You have heard of these creatures, skin walkers, wendigo, goat men, demons, flesh gaits. </p>\n\n<p>I specialize is super natural. And i am in the tangible branch of my organization. Meaning that my focus is on creatures that can be touched, such and skin walkers or Sasquatch. I am not as well versed in spirits, and demons, these belong to the intangible branch. They take care of the intangibles with ceremonies and powerful blessed objects. Here in the tangible branch, we employ more direct action. </p>\n\n<p>It’s a wonder I’m able to tell any of you any of this but my higher ups have said we have complete freedom to speak about what we witness online, as long as we don’t give up our identity or any key locations, as well as a few other limitations. But those don’t really concern you do they. I bet you wanna hear about how i kill monsters, lucky for you, that’s exactly what I’m gonna tell you. </p>\n\n<p>I think we can start with a beast that the internet has become very fond of lately, skin walker. A while back we got intel that a skin walker was hunting outside a small suburb and two kids, as well as a special needs adult had gone missing in the last month. I hate this kind of beast. One that targets the weakest prey. They should’t even be considered a hunter. They are scavengers. Another annoying thing about the creatures that target easy kills is that they are a real pain in the ass to find. The bold ones will come right out to you a lot of times, but the weaker ones that choose easy targets, are usually skittish and aren’t willing to confront you. </p>\n\n<p>But this is my job, and we have our ways. My team and i reach the suburb two days later and begin to set up to execute our plan. We have to be slick though. Can’t spook the citizens, or the skin walker for that matter. Luckily, there was a neighborhood wide gas leak that warranted an immediate evacuation of the area. I hope you follow what I’m saying here. </p>\n\n<p>Now that the citizens were out of the way, we could really get to work. The next night i make my way into the woods. I had a backpack, knife, canteen, hammock for spending the night, and appropriate clothing for a hike through the woods. Sun starts to go down as i get a mile into the woods and I’m keeping my eyes peeled for the beast. The rest of my team is sitting in a strategic position that we picked out through satellite images before we even arrived here. </p>\n\n<p>I’m actually getting pretty bored by this point, usually we have at least some activity by now but the skin walker hasn’t shown any interest yet. Then shit hit the fan. While i was lost in thought i accidentally stumbled and went tumbling down a 40 foot near vertical cliff! As i tumble i can’t help but yell out in shock and pain. HOW did i let myself fuck up so bad! Im now to injured to walk and have to call in the team for evac over the radio and as I’m talking to support on the other end of the line i hear a small voice say “who are you?” From the bushes 30 feet to my right. Shit. “It’s here” i whisper into the radio but it speaks again. Now in a 11 year old boy’s voice “ WHAT ARE AHHHHHHH” then suddenly switched again to a grown man crying. </p>\n\n<p>Each successive voice getting closer and closer until it finally emerges from the brush. A 7 foot tall pale skinny humanoid with sunken milky eyes. It’s head was cocked curiously to the left a little as it sized me up. I was injured and he knew it. He had been watching me the whole time and saw me fall. I had no other choice. I yell. GUYS GUYS HE’S HERE HE’S HERE. No response. He liked that. So he started walking my way, never taking is eyes off of me. He even started to smile. What a dumbass. </p>\n\n<p>I quickly drew my Glock and put two rounds in him. One in the shoulder. And one in the forehead. See a regular bullet can’t really hurt a skin walker that much. Like a bee sting really. But seeing that I’m part of an organization that specializes in killing these creatures. We don’t use regular bullets. I don’t know the whole process but he hire witch doctors and medicine men to do something to the metals used to make the bullets that make them more effective against most beasts. We call them Nat rounds because they work on most Native American Monsters. </p>\n\n<p>Anyways those two bullets weren’t enough to end this guy. But what came next was plenty. Immediately after i fire my rounds the snipers do their job.  Only thing nastier than a nat round, is an incendiary nat round fired out of a .50 BMG sniper rifle. Four smoking holes suddenly appear in the creature. Two on the chest one through each of his eyes. Now the skin walker gets to screaming in his real voice which is about like 300 fingernails on chalkboard. But he’s still alive. Tougher than i though he would be. Stand up and empty the rest of my side arm clip into the still standing beast and call other the radio that he’s still up. Time to send the cavalry. I soon hear the welcome rumble of helicopter blades approaching from the distance but old skinny recovered a bit faster than i would have liked, i stand my ground as he furiously tried to approach me and both of his knees explode. Still got snipers dumbass. </p>\n\n<p>By this time the chopper is over head and proceeds to let down a molten rain of metal he’ll on top of the creature. We don’t like calling the chopper because it draws attention but we had to this time. Also let it be know that the chopper doesn’t fire nat rounds for money reason. But that doesn’t matter. Regular bullets my only be bee stings but 1000 be stings in under a minute is sure to end just about anything. The deed is done. And before anyone says “how did he stand up If he was hurt” i was never really hurt. It was all a set up to draw the skin walker out. </p>\n\n<p>We knew he targeted weak prey so i pretended to be weak prey. The snipers had already be set up 24 hours before i even started my hike and we knew exactly where i needed to go over the edge to minimize damage to myself, all the yelling, and calling for backup were just part of the act to draw him out and give him a sense of urgency to get me before help arrived. All part of the plan. When you are in a job field like this you have to operate flawlessly if you want to stay alive. I’m not saying it’s always perfect but we usually stay on point when we are on a job. </p>\n\n<p>That’s about it for that hunt. The recovery team got the body and took it away to dispose of it and i went back home. I will post more experiences in the future. Feel free to leave question in the comments and i will see you all next time. Good luck out there.</p>\n\n<p><a href=\"https://www.reddit.com/r/nosleep/comments/8kebwu/i_the_hunter/\">Part Two</a> </p>\n</div>\n","author":"LiquidGoatMan"}