{"rank":"1372","title":"Has Anyone Ever Heard of Phantom Social Workers?","id":"8jsd6s","url":"/r/nosleep/comments/8jsd6s/has_anyone_ever_heard_of_phantom_social_workers/","time":"1526446967000","body":"<div class=\"md\"><p>The summer before sixth grade, CPS started coming around a lot. I know kids are often blind to the failings of their parents, but even now, fifteen years later, I can’t figure out why they came.</p>\n\n<p>I lived with my mom and twin brothers out in the boonies. That rural neighborhood now commands top-tier prices. Back then, though, it was such an undesirably distant area that my police-dispatcher mother managed to buy a massive house with over an acre of oak forest. </p>\n\n<p>Mom worked nights and constant overtime, so I spent most of my free time babysitting. Part of me hated it, and part of me wanted to do it til the day I died. My best memories all come from that house. Summer evenings chasing my little brothers through the trees as twilight deepened to night. Winters spent huddling in front of the TV watching “The Secret of NIMH” while the fire I wasn’t supposed to build crackled merrily. I’d give anything to go back now.</p>\n\n<p>The first CPS worker came early one evening in mid-July. My brothers and I were on lawn chairs guzzling Kool-Aid Bursts as a spectacular lightning storm fractured the cloudy green sky.</p>\n\n<p>Our entire neighborhood was a slope. Our across-the-street neighbors lived at the top. We lived at the bottom; the road was almost level with our roof. It made me feel paranoid all the time. Watched. So when a nondescript black car parked on our easement, my hackles immediately went up.</p>\n\n<p>I batted my brothers’ shoulders. “Into the house, guys.”</p>\n\n<p>Phillip obediently folded his chair as the first warm drops of rain pattered to the ground. Patrick, on the other hand, gave me a look that could melt iron. The sea-glass sky reflected weirdly off his skin, painting him with sickly shades of green and grey. He shook his Kool-Aid bottle belligerently. “When I’m <em>done.</em>”</p>\n\n<p>Up on the easement, the car door slammed.</p>\n\n<p>“No, <em>now</em>,” I snapped.</p>\n\n<p>“Just listen to her,” Phillip said nervously.</p>\n\n<p>Patrick gave him an angry look that quickly faded to uncertainty. I watched my brothers anxiously, frustrated at being shut out yet again. I was the one who had to sacrifice everything for them, but I was still an outsider.</p>\n\n<p>Footsteps tapped down our long, steep driveway. I looked up and saw a woman. She wore a dark suit. Long hair glowed like spoiled gold under the stormy sky. </p>\n\n<p>When she saw us all standing there, she smiled and jogged forward.</p>\n\n<p>She looked nice and she was very pretty, but my heart fell just the same. She slowed to a halt in front of me, shoes squishing on the damp grass. I noted, to my surprise, that she was shorter than me. “Hi there. I’m Mrs. Milcom. I’m from Child Protective Services.”</p>\n\n<p>My heart felt slow and low somehow, like it had just fallen ill. “How come?” </p>\n\n<p>Phillip sidled up behind me and took my hand. Her eyes – what I can only describe as a burning hazel, almost the same color as her hair – flicked to him. “I’m responding to a report. Can we go inside?”</p>\n\n<p>A graciously helpless smile spread over my face. Conditioned response, I guess. We’re supposed to be nice to adults, after all. “Yeah. But my mom’s not home.”</p>\n\n<p>She gave me a conspiratorial smile. Her teeth glimmered in the strange twilight, unwholesome green subsuming the agreeable ivory. “Just between you and me, that’s the point.”</p>\n\n<p>Ms. Milcom sat us down at the kitchen table and I poured her some iced tea. She accepted it graciously, then began to ask questions while Patrick rammed his feet into the table.</p>\n\n<p>“Do you spend a lot of time with adults other than your mother?”</p>\n\n<p>“Mrs. Herrera,” Phillip piped up. </p>\n\n<p>“Who’s that?”</p>\n\n<p>“My teacher. I graduated kindergarten,” he said proudly. “I don’t know who my teacher is this year.”</p>\n\n<p>She smiled. “What about you, Patrick?”</p>\n\n<p>He looked down at his shoes and mumbled.</p>\n\n<p>“I’m sorry?”</p>\n\n<p>“Mr. Ball.” </p>\n\n<p>My temper flared. “She’s not talking about your imaginary friend, dude.”</p>\n\n<p>“He isn’t imaginary!”</p>\n\n<p>Ms. Milcom touched his hand gently. “Tell me about Mr. Ball.”</p>\n\n<p>Patrick aimed a particularly vicious kick at the table strut. “He likes cows. The kind with horns. And teaches me games.”</p>\n\n<p>My inward cringe was curling into knots at this point. “Pat, for real.”</p>\n\n<p>“How long have you known Mr. Ball?”</p>\n\n<p>“Like forever.” </p>\n\n<p>She turned her sharp, strange eyes to Phillip. “Have you seen Mr. Ball, too?”</p>\n\n<p>“A couple times,” he said unconcernedly. Embarrassment and rage roiled in my gut. Maybe they were talking about this nonsense at school and frightened a teacher or something. Then they’d called CPS on us and put my mom’s job in jeopardy, all because my baby brothers were dipshits. “But I don’t like him, so I don’t see him anymore.”</p>\n\n<p>Finally, Ms. Milcom looked at me. “And you?”</p>\n\n<p>Was she trying to make the boys feel validated? That’s what my mom always did. I hated it, and I wasn’t about to stop now. “I’m too old for imaginary friends, ma’am.”</p>\n\n<p>She smiled. </p>\n\n<p>She asked a few more questions. All were mundane, although a few – “Have you ever had an IQ test?” and “Do you know anything about your ancestry?” struck me as odd.</p>\n\n<p>All in all, she wasn’t there long. When she finished, I walked her back to her car. Not out of politeness, but to make sure she was really leaving.</p>\n\n<p>“I’m going to be telling my mom about this,” I said politely. “If it’s okay.”</p>\n\n<p>She gave me a sad smile. “Honey, you aren’t allowed to tell your mother.”</p>\n\n<p>Looking at her, being close to her, made my heart felt slow and sick again. “But –”</p>\n\n<p>“This is a classified investigation. If you tell her, we’ll have to take you away. We don’t really think she’s done anything wrong. But we have to make sure. And until then, it has to be a secret.”</p>\n\n<p>Panic fluttered in my chest. “What if the boys say something?”</p>\n\n<p>“They won’t.” She patted my shoulder. “Goodbye. I’ll see you soon.”</p>\n\n<p>Keeping that secret should have been difficult, but it wasn’t.</p>\n\n<p>It’s terrible, but part of me felt happy. Almost vindicated. I was eleven years old. It wasn’t right that I was my brothers’ primary caretaker. Maybe CPS would do something about it. Yell at my mom. Maybe make her get a babysitter sometimes.</p>\n\n<p>Ms. Milcom came several times that summer, at least a twice a week, and always in the evening after Mom left for work. That sick, slow feeling in my heart never quite went away, but I warmed up to her. She was so pretty, so nice, and somehow so motherly. She lavished most of her attention on the twins, but that was the dynamic I knew. Anything else would have felt wrong.</p>\n\n<p>I didn’t breathe a word to my mother. Neither did Patrick or Phillip. </p>\n\n<p>She came for the last time on Friday at the end of August. School had been in session for a couple of weeks. The boys were cranky, and I was fed up with them. On the first day of school, I’d made several friends. They’d invited me out for ice cream that night, but of course I couldn’t go.</p>\n\n<p>I said I didn’t have a ride. When several offered to have their moms pick me up, I had to admit I was stuck babysitting, and would be forever. It was the one thing my mom had told me never to do – “I’ll get in trouble,” she said - but I was tired of it. It was wrong of her to do that, to take away my whole life just so she could have free childcare.</p>\n\n<p>And it wasn’t just me who thought it was wrong. CPS thought it was wrong, too.</p>\n\n<p>Even Ms. Milcom’s smiling face couldn’t lift my spirits. She gave me a hug, then pulled back and gave me her trademark smile. “I have something exciting to show you!”</p>\n\n<p>“What?”</p>\n\n<p>“Get your brothers, and come see! It’s around the back!”</p>\n\n<p>I rolled my eyes and stomped inside. Phillip and Patrick were playing Sorry at the kitchen table, predictably bitching at each other. </p>\n\n<p>“You said it meanly, Patrick!” Phillip snarled.</p>\n\n<p>“I just said it like in the commercial, <em>Phillip</em>!” he spat back. “That’s how you’re <em>supposed</em> to say it!”</p>\n\n<p>“Guys,” I sighed, “come outside.”</p>\n\n<p>“How about <em>no</em>,” Patrick trilled.</p>\n\n<p>“How about Ms. Milcom’s here and she needs us all outside?”</p>\n\n<p>Something passed across his face. Dark and almost discolored. Like we were back in the middle of that lightning storm. “I don’t care.”</p>\n\n<p>“Well, I do. If you piss her off, she’ll take us away from Mom. So get up.” I kicked his chair. Phillip was already on his feet. Patrick followed suit, glaring daggers.</p>\n\n<p>We went outside. A million crickets sang, a musical, pulsing rhythm that echoed through the trees. Ms. Milcom danced again and beckoned eagerly. “Hurry!”</p>\n\n<p>She led us through the property, expertly sidestepping trees and fallen branches. Bracken and twigs crunched under our feet as darkness fell. It seemed early for full dark, but then again it was already two months past the solstice. Of course days were feeling shorter. We were just as close to autumn as winter.</p>\n\n<p>She led us all the way to the property line, near the barbed wire fence that separated our yard from the neighbor’s horse pasture. Our rusty, broken little shed huddled there. Well, it wasn’t our shed; it was an ancient relic from the 1960s, something the old owner had left behind.</p>\n\n<p>“We’re not supposed to go in there,” Phillip said nervously.</p>\n\n<p>“There are black widows in there,” Patrick added. “Mom said.”</p>\n\n<p>Ms. Milcom laughed. “Is that what she said?” She came over and dropped to her haunches in front of him. “Well, she’s wrong.”</p>\n\n<p>“She’s not. I saw them last summer.”</p>\n\n<p>“Black widows aren’t in there. But <em>someone</em> is.” Her smile threatened to split her face in half, stretching to wide it made my cheeks ache.</p>\n\n<p>“Who?” Patrick asked guardedly.</p>\n\n<p>She clapped her hands. “Mr. Ball!”</p>\n\n<p>Patrick immediately took several steps backward.</p>\n\n<p>“Don’t be a chicken.” She stood up and went to the shed. To my astonishment, I saw light spilling under the half-rotten door and through dry rot in the siding. Cool green and rich gold. </p>\n\n<p>And there was noise. I strained my ears. Faint but unmistakable: a triumphant procession of horns, like I was hearing a parade from very far away. </p>\n\n<p>Ms. Milcom opened the door. Some of it crumbled under her hands. The remainder creaked open, swinging from a single rusty hinge.</p>\n\n<p>It was a room.</p>\n\n<p>Far, far too big to be in the shed, at least ten times bigger than our entire house. Grand marble floors and distant walls that towered out of sight. I craned my head, and saw a hint of flower vines. </p>\n\n<p>Ms. Milcom waved the boys forward. “Come look!”</p>\n\n<p>We all crowded to the entrance, even Patrick, though he hid behind me. The horns were louder now, keeping time with the insectile song ringing through the night. It was beautiful inside the shed. Green, gold, white, and black, all smooth, glimmering surfaces and a breathtakingly beautiful indoor garden. </p>\n\n<p>“What is it?” Phillip whispered. </p>\n\n<p>“Somewhere wonderful,” Ms. Milcom said. “Do you want to come in and look?”</p>\n\n<p>Before my eyes, the shed suddenly went dark. Then it flickered back to life and light, like a bad projection. I rubbed my eyes nervously. Ms. Milcom noticed, and frowned. All at once, I felt dizzy and tired. The horns and bugs were overwhelming and painful, and her eyes, that warm orange-tinged hazel, were almost maddening.</p>\n\n<p>“What’s wrong?” she asked quietly.</p>\n\n<p>“I…I’m <em>mad</em>,” I said defiantly.</p>\n\n<p>Phillip and Patrick looked at me.</p>\n\n<p>“About what?”</p>\n\n<p>My chest heaved. I looked at them, my little brothers, the most important things in my life, my responsibility.</p>\n\n<p>And my shackles, too.</p>\n\n<p>“About them,” I snapped. Patrick withered. “And this whole things. It’s stupid. It’s all stupid.” </p>\n\n<p>The world swam. The horns swelled and the night bugs’ song became a fevered, painful screech. The rocky, leaf-strewn ground hit my head and the world went dark.</p>\n\n<p>I woke up in the morning, swarmed with ants.</p>\n\n<p>I hopped to my feet, screeching, and ran into the shed. Dark, cramped, thick with cottony webs and the glistening black bodies of spiders. Screeching again and wildly shaking out my hair, I ran up to the house. </p>\n\n<p>Empty.</p>\n\n<p>No Phillip, no Patrick, no Mom.</p>\n\n<p>I searched the whole house six times, praying I was crazy, before finally calling the police.</p>\n\n<p>Long story short, my mother and brothers disappeared. The official theory is Mom hightailed it with the boys to start a new life. She was on the hook for child abandonment, but they never found her.</p>\n\n<p>CPS, of course, had never once received a report or sent an officer to check up on us.</p>\n\n<p>I went into foster care. It was awful, but I think I did okay in the long run. I graduated college debt-free, and work in corrections. I’m not a guard (pardon my language, but fuck that shit). I’m a therapist. I do good things like trauma counseling, but because of AB 109 I also have to shitty things like teach parenting classes to baby killers.</p>\n\n<p>I guess that’s life. At least I’m paid well.</p>\n\n<p>Eventually I made peace with my plight. I’d misremembered everything, constructed some kind of Machen-esque, Hellraiser-fueled narrative that leached some of the sting from my abandonment.</p>\n\n<p>But I got a letter today, and now I’m not so sure.</p>\n\n<p>It was plain, water-spotted envelope. No return address. I rolled my eyes when I saw it. I’ve been getting these things lately, usually from car dealerships. I tore it open.</p>\n\n<p>A Polaroid slid out and plopped to the floor.</p>\n\n<p>It was a picture of my brothers. Patrick and Phillip, clear as day: down to the waves and mismatched eyes: the left one blue, the right one brown. They stood in room with a white floor. A figure stood behind them, cloaked in dusty shadows. Female, if I had to guess, wearing a ridiculous bull mask.  </p>\n\n<p>Grimly ignoring the hot tears in my eyes, I pulled a piece of paper out of the envelope. It rattled wildly in my trembling hands as I read four earth-shattering words: </p>\n\n<p><em>One is still alive.</em></p>\n\n<p>I uttered a high-pitched wail as my knees gave out.</p>\n\n<p>Of course I called the police. They took the letter and the photo. I’ve been at the station all night, but they’ve pretty much shut me out. “It’s probably a hoax,” the sergeant said. “But we’ll make sure.”</p>\n\n<p>I don&#39;t know what to believe. I don&#39;t know what to think. I&#39;ve been on Google all night and I came across this thing about phantom social workers. CPS officers would visit homes and do weird things. When parents called the department to complain, they were told no CPS official had ever been dispatched to their house. The general consensus is that the whole thing was a hoax.</p>\n\n<p>But I guess I know better.</p>\n</div>\n","author":"Dopabeane"}