{"rank":"8","title":"Little Mouse","id":"8jsfq8","url":"/r/nosleep/comments/8jsfq8/little_mouse/","time":"1526447793000","body":"<div class=\"md\"><p>I sat in the warm comfort of my car, driving down the pitch-black road. The night around me pushed on the metal frame of my old, used sedan, crept though the windows, and enveloped me. The night was much darker than I’d ever seen. The heavy clouds blocked out any light from the moon and stars, as if they were hording a prize. Even with my brights on, only a small portion of the road could be seen. The darkness was like a fog, think and impenetrable. Nevertheless, I could have driven to my destination blind. I’d taken this path far too many times, and I intended this to be the last.</p>\n\n<p>I was headed to an old abandoned apartment complex. The place had been out of service for many years. If I remember correctly, it shut down due to a huge fire that broke out. No one died, but he flames chewed through the wood and concrete and caused the place to be deemed unstable. The only reason it hasn’t been demolished is that the town has never had the funds to knock it down.</p>\n\n<p>The reason that I travel there so often is because of my idiot friend, Jake. I had known him most of my life, and he was a good guy back when he wasn’t spending all his time at that shit-hole of a building. Jake was a heroin addict. He and all his drug buddies spend the larger part of the week shooting up at the old apartment complex. Because Jake and I had a long history together, I was the one he’d always ask to come pick him up every damn time he wanted to leave. He couldn’t drive himself because he was always high or sick all the time, and even if he wasn’t, his license expired long ago and he sold his car for more drug money. How he manages to come up with cash nowadays I really would rather not know. The only thing he hadn’t sold was his dumb flip phone that he literally only used to text me to come get him.</p>\n\n<p>I’d told myself to let him go and move on with my life. Being associated with his was hurting my chances of getting a good job. We lived in a relatively small town, so everyone knew everyone else. Driving Jake around and just being associated with them hurt my reputation, even though I wasn’t stupid enough to even try stuff like that. I hated Jake&#39;s “friends” and I hated being the enabler, but we grew up together. He used to be like a brother to me, but once he became an addict, he felt like a pest. I was weak and I felt sorry for him, so I never denied his requests. Every few days I’d receive that stupid, unintelligible text from him. They almost always comprised of random letters and/or numbers, and words so misspelled that you had no idea what they were supposed to be. I knew what I meant though. I didn’t even bother reading them anymore anyway. I’d set Jake&#39;s texts to a specific ringtone so I knew what I had to do just by the sound, which would reverberate through me with a stinging annoyance every time.</p>\n\n<p>I was done. I was more than done. I was fed up, pissed, and disgusted at both him and myself. Even though I’d told myself to stop helping him many times before, this time was different. I wanted to quit my awful job at Wendy’s and get a better one—start fresh with better company. I knew what I was going to do. I was going to drive over there, haul his drugged-up ass back to his usual motel, and tell him enough was enough. As I pulled up to the abandoned building, my heart was pounding. I’d never been one to speak my thoughts when it came to negative things, so I was nervous, yet undeterred. I pulled in to the ancient, cracked parking lot of the building and checked my phone again. “New message from Jake,” It said. I rolled my eyes, sick of seeing that notification. </p>\n\n<p>“Impatient dumbass wants me to hurry up,” I thought as I put my phone away. I hesitated, just to spite him and to enjoy the last of my car’s warmth before switching the engine off. I reached for the handle of the door and froze. With the car’s engine off, silence engulfed me, pressing into my ears. I pulled the door’s plastic handle toward me and recoiled at the loud click it made. The door swung open and I stepped out into the cold, winter air. My nose stung and the snow crunched under my shoes. I took my first brave steps toward the ominously dark building and hopefully, toward a better life.</p>\n\n<p>I walked slowly, careful not to trip on any branches or trash that littered the overgrown lawn of the complex. The longer I walked down the path, the more unnerved I became. The darkness was relentless. I felt almost blind and my eyes seemed to refuse to adjust to it, as if fearful of what they might see. I’ve never been afraid of the dark, even though I was in the worse part of town. I knew the building inside and out as well, due to my frequent trips, yet the place still seemed more sinister than before. </p>\n\n<p>I quickened my pace, despite the litter, and ducked under the boards that blocked the upper part of the front doorway. The main lobby was small with a staircase in the far back. There were doors of the left and right, however debris blocked them both. Desks and chairs were broken and turned over and dust covered everything. I headed toward the remnants of the old staircase of the far wall, weaving through the discarded furniture. The thing had long since collapsed into the closet underneath it. The druggies had gotten a ladder from somewhere (probably stole it) and placed it on a desk at the bottom of the staircase so they can get to the second and higher floors. The tall, metal ladder contrasted heavily with the ashy, dust covered wood that made up the rest of the room. I always hated climbing the stupid thing. The desk under it was just big enough to fit all four legs. Each time I climbed the contraption, I pictured myself causing it to buckle and toss me into the piles of jagged wood and scattered bricks that lay all around it. </p>\n\n<p>I attempted to purge those thoughts from my mind as I climbed up the desk and onto the ladder. Each rung I ascended caused it to shake underneath me. I gritted my teeth and kept climbing. Step. Rattle. Step. Shake. The all too familiar clench in my gut began as my body grew more and more tense. I was only three rungs from the top when a noise sounded somewhere behind me towards the door; some kind of rustle or dragging sound. It was quiet, but I heard it and it terrified me. My head shot backwards toward the sound, pushing the unbalanced ladder over the edge. My scream was trapped in my mouth as the metal tumbled out from under my feet, falling sideways. I leaped for the edge of the top of the stairs and barely hooked my fingers onto it. The splintered wood dug into my hands, and my chin and pelvis slammed into the wall. I groaned and coughed as dust blew into my mouth and throat. Then I pulled myself up, swinging my right foot up and climbing to the safely of the second floor. I stayed there at the top for a bit, crouched on my knees and elbows so I didn’t further aggravate my hands any more.</p>\n\n<p>As I pulled the splinters from my hands, wincing at the sharp pain they emitted, my mind made the transition from fear to anger. I was in this awful situation because of Jake. My rage motivated me. I couldn’t wait to bring his ass back to his shitty disease-ridden motel and finally give him a piece of my mind. The confidence was nice to have, even though it was short-lived.I pulled myself to my feet and trudged through the doorway that led into the second floor hallways. Somehow, these halls were even darker than the outside. This was strange because all the human-trash that coalesced here would usually make their presence known from their moans, lit cigarettes, and cheap dollar store flashlights. Even with the lack of illumination however, I knew the scenery well. Used and reused heroin needles were scattered about the floor by the walls with food wrappers and other trash to keep them company. The litter, mixed with the patchy remains of the singed carpet, crunched and crackled under my weight as I walked.</p>\n\n<p>Once again, I moved slowly. The last thing I wanted was to fall on one of those needles. I didn’t want anything those sleazes were carrying. I made my way to each room that hadn’t collapsed downward, or been collapsed onto from above, to check for any signs of life. I found nothing. I was frustrated, but mostly I was confused. They were always on this floor. I almost called out for someone but I stopped myself. The place just seemed strange and it disturbed me greatly. I headed towards the stairs that connected the second through sixth floors. “Maybe they found a raccoon or something on the next floor and followed it,” I thought. Once I got to the stairs I stepped over the unhinged metal door that lay on the ground and ascended the concrete steps. I stuck to the middle of the stairs because the last time I went up there I moved all the broken boards and junk to both sides so I wouldn’t trip on anything.</p>\n\n<p>The second I opened the door and stepped through, a copper stench aggressively presented itself to me. I guessed that some pipes must have \nrusted or maybe some idiot brought some nasty chemicals up there. Nevertheless, it reeked so I pulled a bandanna from my pocket and wrapped it around my nose and mouth. To my disappointment and confusion, there was no immediate signs of anyone on the third floor as well. I started moving from room to room, looking for any noise or lights. With each passing empty room, my unease grew.</p>\n\n<p>To make things worse, the farther I walked down the halls, the more aware I became of this sticky substance on parts of the floor. Where the carpet patches were, my feet squished, and where there was wood, my shoes stuck slightly. Since I didn’t go up to the third floor often I didn’t know what litter was on the ground, but whatever it was it was soaked in that liquid to the point where it felt like I was stepping on a slimy sponge.</p>\n\n<p>Coming up to a fork in the hall I stopped, deciding whether to head left or right. I looked down the left hallway: nothing, then the right hallway: nothing—wait. There was a very dim light coming from a room on the right wall. I carefully maneuvered my way to the room, despising each noise the ground made under my shoes. As I came within a few feet of the open door’s illumination the spots of liquid ended, leaving my footsteps to be silent again. I began to hear someone muttering something in the room and shadows moved in front of the light source. </p>\n\n<p>I stepped into the light and looked into the room hoping to see Jake. Indeed I saw him in there, but to this day I wish nothing more than to unsee it. In the room, lit by only a single dim lamp, was Jake and another person—no, not a person—a thing. Some monstrous creature with the shape of a human man’s body. It was about eight feet tall and incredibly bulky looking. Its skin was neither black nor white. It was a shade of grey and it was holding Jake like a doll over a table, back turned to me. Jake’s horrified face was covered with a rusty, beak shaped metal muzzle that was leaking blood from the seams. Maybe it had blades on the inside or maybe his tongue was torn out, I don’t know. What I do know is that his arm was pinned in the monster’s enormous hands, blood pouring from a long cut down the forearm. The beast then twisted Jake&#39;s hand back, tearing it from the tendons and letting the bones of his arm be revealed. The muffled, gurgling cries Jake made still haunt me.</p>\n\n<p>Then it spoke. The monstrous thing spoke in a voice so low and gravely, that it sounded like it was speaking with rocks in its throat. </p>\n\n<p>“Now-now little bird, these bones are too heavy. How do you expect to fly with these? They must go.” With that, he began to pull. Jake&#39;s gurgled screams grew louder as the thing yanked his bones from his body. I heard the tendons snap and his skin tear with a sickeningly wet rip. I gagged silently and took a step back from the horror. Once the bones were all out, Jake&#39;s body went limp, most likely from shock. Then it spoke again, still facing away from me. “That’s better, little bird. However, you neglected to tell me that we were expecting a guest.” My blood froze, and I almost threw up from its words. It turned its lumpy, deformed head I my direction and grinned its yellow teeth at me. </p>\n\n<p>I ran. I ran like a bat out of hell down the hall and in the direction I came from. The problem was though, that I could get zero consistent traction from the floor. One step would connect perfectly with the sticky wooden floor and the next would slip over the slick, soaked carpet. I became more frantic and basically flailed my way through the blind darkness. Unfortunately, the monster had no similar issues and he simply stomped down after me, his footsteps thundering with his massive weight. It took no time for him to catch up and when he did, he laughed and swiped at me, sending my flying at the wall. I slammed into it and fell to the ground. My face landed on the “litter” on the floor. Getting a good whiff, and even taste of it, I realized it was blood and scattered organs that I was running over. No time to puke though, because the thing stood over me. I sat up instantly, grabbed its ankles and pulled myself through the gap between his enormous legs and bolted away. It chuckled more as I ran. “You’re a slippery one then, huh?” it said, resuming its chase. I got to the stairs and began to head down when it occurred to me: there was no way I could out run this thing all the way to the exit. I instead headed up to the fifth story, where the fire had weakened the floors the most. I hoped to send him through the floors and hopefully back to the hell it crawled from.</p>\n\n<p>My legs screamed at me to rest and my mind screamed back to shut up. My right shoulder ached from the impact and my hands still stung from the splinters. The thing’s head thudded and scraped on the ceiling and its shoulders bumped into the walls as we ascended the stairwell. I passed the fourth floor and the monster attempted to grab my arm, his meaty fingers barely latching on to my shirt before being torn away. My panic pushed me past my limit as I ran into the fifth floor door and down the hall.</p>\n\n<p>The unstable floor shifted and creaked under my stomping feet. I listened past my own terrified breathing and deafening heartbeat for any sign of the floor giving up under the thing. For a moment, nothing happened and I feared that I was overconfident in the buildings weakness. Then I heard it, the wooded floorboards began to loudly crack and splinter as the beast’s monstrous size betrayed it. It bellowed in rage as the ground around it gave in to gravity and fell onto and through the fourth floor and back to the third. Before relief could even wash through my mind however, the boards under my feet moved as well. I’d misjudged how much floor the thing would take with it and I found myself tripping over the boards that shot up under me. My body pivoted into the wood, my face connecting with the hard beams. I helplessly slid back and into the hole in the floor, falling into the fourth floor next to the second, smaller hole the thing made.</p>\n\n<p>My body smacked onto the chunks of rubble. Pain shot through everywhere and my vision blurred. I wanted to just lay there in agony but I knew I had to move. I sat up and was more than displeased to see a rebar piece sticking out of my right thigh. I inhaled rapidly at the sight and the realization brought forth a new, more intense wave of pain through my leg. I couldn’t help but scream so loud my throat hurt. I knew what I needed to do. I slowly lifted my twitching leg up the rebar and rolled over onto my stomach. The gore filled tunnel in my leg stung as the cold winter air licked at the open wound. This time I did throw up. I flipped over onto my hands and knees and wretched on the floor. The puke mixed with my blood and the dust on the ground. I needed to leave this place and drive to a hospital. My blood soaked hands pulled the bandanna off my face and tied a tourniquet around my thigh. I crawled over to the stairs and down to the third floor, writhing in pain. </p>\n\n<p>I hoped to God that the thing was dead. It fell two stories; there was no way it lived. It couldn’t have. My legs thumped behind me as I dragged myself down the cold steps. Once I got to the third floor and looked over to the wreckage down the hall. I crawled closer, through the blood and guts of what I assumed were the other druggies until I could get a good view. I made sure to lift my right leg in the air to keep the contaminated blood from entering my wound. Lying in the heap of rubble was… absolutely nothing. It wasn’t there. My heart dropped and terror took hold of me once more. It was down here with me, lurking somewhere, but where? I swung my head left and right, searching through the darkness for it. I couldn’t see it. It was either stalking or searching for me. Just in case I limped into a room and pressed myself against the connecting wall and peered outside. After a long panic filled wait, I saw a massive black shadow that moved through the halls in an impossible silence. Its footsteps were nonexistent, despite the gore that should’ve squished under it. It slowly lumbered down the hall and past my door, giving me an opportunity to leave.</p>\n\n<p>I slipped down the left side of the hall and made painful, careful steps so that I wouldn’t make any noise. I didn’t make it too far when the monster muttered, “Your scent is much cleaner than these poor addicts, my little mouse. Your blood is different than theirs.” </p>\n\n<p>It nicknamed me. I almost cried at the thought of sharing Jake’s fate. I didn’t want to be its next torture toy.</p>\n\n<p>“That wound must hurt. You had a big fall, little mouse. I enjoyed those screams, and intend to make you replicate them.” He said with a snicker. He was headed my way now. I scrambled into the nearest room to the right and crawled into the bedroom. I slithered through the rubble and squeezed under a broken hunk of a bed. The monster checked every room, including mine. He crept in and checked in the closet and bathroom, and I thanked myself for not hiding there. Once he had gone, I limped my way out of the room and into the hall. I moved down the sides on the hall, desperate not to make a sound. </p>\n\n<p>My body was in agony and my mind was slipping into hysteria. I was exposed out in the hall, unaware of where exactly the hulking thing was. Each time I heard a noise, I froze, terrified of the possibility of being found. It said that it could smell me, but was that just to scare me? I found the staircase and swiftly maneuvered down to the second floor. I was so close to the end. I just needed to make it down the hall and endure the fall down the broken staircase, which I was fully prepared to do. Again I made sure not to trip on anything, this time though so I didn’t make any noise. </p>\n\n<p>With only about thirty feet left I heard heavy footsteps thud down the stairs behind me. “You’re down here then!” it yelled. “I’ll sooner fall a thousand stories than let you escape with those limbs intact!”  I turned in horror as lightning blasted bright beams of light through the windows and hole filled walls. The illumination allowed me to see the thing storming after me. The fall had shredded its clothing and put gashes in its skin, which leaked a black liquid. I pushed my tired aching body into a limping sprint one more time, ignoring the pain in my leg, head, shoulder, and hands. The broken needles and glass bottles shattered under my feet and that of the monster’s, who was quickly gaining on me. I knew I couldn’t make it out the way I came in time so I put my body to the test again. I grabbed a lose brick mid run and hurled it at a window in front of me. The brick broke the glass but didn’t shatter it. I dove at the window head first and crashed out of the hell hole of a building and into the cold. I fell another story, twisting my limbs in an attempt to balance myself through the air. I landed like a sack of rocks on the sidewalk with my right shoulder, limbs following suit, slapping onto the pavement hard.</p>\n\n<p>I dragged my broken body to my car, which was luckily only a few yards away, and pulled myself in, crying out with each movement. My poor right arm was dislocated and broken, which made starting the engine difficult. I fumbled the key into the ignition with my left hand and screeched down toward the hospital. Driving was near impossible with a useless right arm and leg, paired with blurred vision and a large loss of blood.</p>\n\n<p>My heart felt like it was going to explode, but I couldn’t help but laugh like an idiot, despite my pain. I sped down the road as the first rays of morning began to shine through the dark trees. The clouds set aside their greed and let the sun bathe the earth in its warmth. My car continued down the street only a few miles away from help. I sighed in relief as a single little bird flew from the trees and through the air, bones light and intact. </p>\n</div>\n","author":"PappaPepps"}