{"rank":"2","title":"You're not real","id":"8jsjmv","url":"/r/nosleep/comments/8jsjmv/youre_not_real/","time":"1526449086000","body":"<div class=\"md\"><p>It was one night like any other at my house. My parents were in their room with my youngest brother, August, falling asleep, and the other four of us were upstairs screwing around until we got tired.</p>\n\n<p>At about 9:30 (21:30 for the more sophisticated individuals) everyone but me was laying down in bed, but not yet asleep. That&#39;s when I finally noticed knocking in between the walls. I was locking the doors and making sure everything is the house was ready in the morning so it didn&#39;t bother me much at the time but by the time I was laying down it got annoying. I went into the other room and woke up my brothers, Junior and Raymond to quit knocking on the wall but they had no idea what I was talking about. I turned on the light and their groggy faces told me that they have been asleep for some time.</p>\n\n<p>Where I live we have something called a &quot;skyuu&quot; (sky-you) which means ghost in English. They follow you home and play around with you if you stay in the grave yard past 3 PM (again 15:00 for you more sophisticated people) and if you leave your windows open at night they will come inside. I never believed it because it didn&#39;t make sense, but when I couldn&#39;t find out who was knocking in the walls, I quickly shut all the windows I could find, and put on music to ignore the knocking in hopes that if I ignore the spirit it would go away.</p>\n\n<p>It was an hour later since I noticed the knocking, and the room had suddenly dropped to colder tempuratures. It had to be at least 40ยบ/4ยบ. I was still listening to music, not knowing if the knocking was still happening or not, and that&#39;s when I was ready to wet the bed. A loud howl, followed by laughter came from under my bed. I jumped, terrified and sweating. It happened so fast that I didn&#39;t notice the door was more open than the crack I left it at. I ran to the bathroom in hopes to escape it by hiding in their until dawn. I drew back the shower curtain and that&#39;s when I saw it. It had the figure of a frail man and was as black as coal, had wild raggedy hair, and smelled of rot. I slammed into the bathroom door and ran downstair as fast as I could.</p>\n\n<p>Frozen with fear, I laid on the spare futon in the living room, cuddling my chubby, bulldog for comfort. I decided to watching something happy, and peaceful to settle my nerves. What else to watch besides Shrek? The fear had left me and sleep almost took me, but the scariest of all the creatures the world had to offer caught me. My father scolded me for being up at 11:30 (23:30 for you sophisticated folk) on a school night. I explained everything to him and how he needs to smudge the house with sage. Of course he didn&#39;t believe me, but like a good father he slept on the couch next to me to comfort me in my sleep. Finally, I let the night take me into a deep and dreamless sleep.</p>\n\n<p>As I lay there asleep, my father had his own encounter with the spirit that came to torture us in the night. He woke up suddenly and couldn&#39;t breathe. He described it like something was pushing on his chest. He reached out to me and tried to call my name, but no words could escape his lips. After a while of being choked it finally let him go and he fell to the floor. Finally convinced that something was in the house he grabbed some sage, the sacred plant of the Lakota indian that he is half of. He cleansed the house by burning and praying, or at least he thought, and went back to be.</p>\n\n<p>That morning my brother told me he felt like something was watching him while he slept and the door kept opening whenever he shut it. I told them all the story of what happened in their sleep, but they weren&#39;t as terrified as I was. Probably because they weren&#39;t raised as gentle as I was, being the first born and all.</p>\n\n<p>Months later, I came home from school, and decided to take a nap. Before I did I felt something watching me, and a thought crept into my mind. This wasn&#39;t my thought, it belonged to someone else, as though two people were inside me. &quot;You&#39;re not real&quot; I told the though, and that&#39;s when my breathing stopped, and my body wouldn&#39;t respond to my commands. &quot;I&#39;m sorry please stop this I don&#39;t want to die. You&#39;re really! You&#39;re really!&quot; I told the thought, and finally it let me go. I didn&#39;t have an encounter with the spirit since, but every once in a while I still feel the thought in the back of my mind. I don&#39;t know what the thought is, but all I know is that it doesn&#39;t belong to me.</p>\n</div>\n","author":"Cordelldogdello"}