{"rank":"60","title":"The Field Stalker","id":"8jskr8","url":"/r/nosleep/comments/8jskr8/the_field_stalker/","time":"1526449461000","body":"<div class=\"md\"><p>Field Stalker (Michigan)--&gt; <a href=\"https://redd.it/8k9dth\">https://redd.it/8k9dth</a></p>\n\n<p>These events took place almost twenty years ago in Indiana where I grew up. My father lived about an hour outside of Indianapolis in the middle of nowhere and I would visit him over the weekends as a kid. It was a nice, quiet town and he lived on a large plot of land. Vast, rolling fields stretched as far as my vision carried with deep, lively forests encompassing them on every side. Some of my best memories were spent hunting and working outside with my old man- breathing in the crisp, country air that sat undisturbed by the hustle and bustle of the city. It would have been the perfect place had it not been for that thing that inhabited the land. </p>\n\n<p>I still remember the first time I saw it. I was sick as a dog and my father yelled out &quot;Put those chickens up boy!&quot; before shutting the door and making his way to his night shift. He had a few dozen chickens that he would use for his eggs and the occasional family dinner. They were always a lot of fun to chase around and play with as a child but I digress. </p>\n\n<p>About an hour after he left I was able to force myself out of bed, my sinuses congested and head throbbing I made my way out the back door. Night was starting to fall as I rounded up all my little feathery friends into the coop before closing and barring the door. I glanced to my right at the enormous fields that stretched out of my sight to see a storm roaring way off in the distance. With such a huge area providing an open sky, any storm within dozens of miles could be seen as flashes of lightning rang silent as they illuminated the entire property with each flicker. </p>\n\n<p>I sat there, mesmerized by the beauty before something caught my eye. It first appeared in a flash of lightning a good distance away but a few seconds later, it was much closer and I made out a grotesque shape tearing through the fields parallel to me. It wore skin so pale that it glowed a faint blue in the moonlight and its limbs were jagged and disproportionate to its body. One leg seemed longer than the other and its arms were clenched against its body like a praying mantis. Long, wispy fingers hung down as it strode on through the blackness. </p>\n\n<p>I sat there in place as fear gripped me tightly- this thing was gaining distance so fast. With each sporadic interval of lightning it seemed to gain hundreds of feet. It wasn&#39;t until a particularly long stretch of lightning strikes that I got a good look at it. It ran in a way that still pops up in my nightmares. Its body trembled and convulsed as it glided across the grass- it&#39;s longer leg being made apparent as its sprint resembled more of a limp. But a limp that had to be speeding by at over thirty, maybe forty miles per hour. </p>\n\n<p>The one thing that stuck out more than any of this was the absolute silence. It was running by at an inhuman speed as its joints bent and twisted begrudgingly but it never made one sound. Each step was completely devoid of any noise and though it looked like its body was in agony, it flew by at the speed of a greyhound. With each flash of lightning it gained an impossible amount of ground and before I knew it, it was gone. It dissolved into the far away tree line without any disturbance. </p>\n\n<p>I ran back inside crying to my dad&#39;s girlfriend and was probably babbling incoherently as she tried to calm me down. I spent the rest of the night on the couch in fear, watching sitcoms with my future step-mother. </p>\n\n<p>For the next several months, what was normally a trip that I looked forward to, was now one that stewed anxiety in my gut as I dreaded possibly seeing that thing again. But as I came and went dozens of times, I hadn&#39;t encountered it and I was beginning to wonder if it was just a strange trick of the mind as I was extremely sick at the time of seeing it. </p>\n\n<p>Fast forward a few years and I was just entering high school and my father&#39;s house was a great place to have gatherings with friends as we had bonfires, cookouts, football games, you name it.</p>\n\n<p>I had all but forgotten my experience and my dad&#39;s home was once again a destination that I spent the entire week thinking about. Me and several friends; Wayne, Tim, Steve and Matt, had planned a time to go out there. After waiting impatiently for a few weeks the day had finally come to go out there and I was so excited to spend some time with my friends and dad. We packed up all of the essentials and made the trip without a hiccup. Once there, we proceeded to do all of the reckless things a bunch of partially supervised fourteen year-olds do. After wearing ourselves out a bit we started up a fire and chatted for a little while as the remainder of the day quickly passed. We talked about the typical things- sports, girls etc.</p>\n\n<p>As the sun was starting to set we were putting out the fire. Tim and Matt were feeding grass and fruits to an old horse that someone was paying my father to have set up in an enclosed area on his property. It was a very old horse named Jack and it pretty much just stood around all day as it was old and broken down. It would barely be able to shuffle up to us to accept our offerings of food. </p>\n\n<p>&quot;Finish up playing with the horse ladies!&quot; Wayne shouted at them as he shoveled dirt and ash onto the dying fire with his boot. &quot;It&#39;s time to get this started!&quot; Wayne was talking about playing flashlight tag. He enjoyed it a lot more than all of us and sometimes took it a little too seriously but regardless, it was always a good time.</p>\n\n<p>We gathered up in the center of the yard and played rock, paper scissors to determine who would be it first. The first person to be caught would end up being the next one it- all the basic rules like that.Tim ended up being the first person it and we watched him turn his head to the tree to begin his count to sixty. Once his back faced us, we all scattered aimlessly into the dark.</p>\n\n<p>Racing around the huge yard, I found a large pile of old logs and firewood that I thought was a great hiding place. I was always the guy who tried to find the best hiding spot and stay put rather than periodically moving spots as the seeker made their patrols. I knew this area like the back of my hand so I considered that an advantage. &quot;58.. 59.. 60!&quot; I heard Tim yell out as I saw the bright glow of the flashlight pierce into the night. </p>\n\n<p>I sat there, still as a statue as Tim slowly paced around the yard, waving his flashlight in every direction. Peeking through the logs, I had to stop myself from chuckling as I thought there was no way I would ever be found. I huddled up as tightly as I could and covered up any skin with all the loose shreds of clothing that hung off of me. </p>\n\n<p>Just as I was settled in I nearly had a heart attack as that horse abruptly cried out and began stomping around just ten feet behind me. It was normally so slow and quiet that I hadn&#39;t even noticed it standing in my vicinity before it lashed out. It surprised me so much that I jumped and caused a few of the logs surrounding me to go tumbling down. I saw the beam of light from Tim&#39;s hand swing over to me quickly as he briskly walked my way. I was crouched down under a bunch of wood so I wasn&#39;t really in any place to make a run for it so I just waited to be caught. </p>\n\n<p>&quot;Gotcha man!&quot; I heard Tim yell out triumphantly. &quot;Haha yeah man I didn&#39;t think anyone would get me here&quot; I said back. He came back with some juvenile trash talk and I made my way to the back porch, glancing back at the horse who was trotting around the electric fence nervously. </p>\n\n<p>I sat on the porch and sarcastically shouted &quot;You guys got this&quot; and &quot;Woooooh go guys keep it up&quot; as I waited- hoping I might get them to laugh and get caught so I could get on with the next round. I heard the excited screams of those idiots as they were caught and the sounds of some attempting to move through the dark as subtly as possible while giggling to themselves. All this time I couldn&#39;t help but look at the horse frequently to see it move around erratically, whinnying and snorting- something I had never seen it do before.</p>\n\n<p>My round being it went relatively quickly as I knew the area well and my friends even better. Matt was the first person I found and he was laying face down on top of a red car while wearing all black, thinking he could blend in. &quot;Hey dumb-ass&quot; I said as I shined the light over his body. His face slowly turned towards me as if to make sure I was actually talking to him. We laughed as he made his way to the porch. </p>\n\n<p>The rest of my round went quickly and we sat around talking for a little bit before starting up again. Matt kind of started to complain that he didn&#39;t want to be it and started pouting. He could be a bit of a wimp back then but he eventually complied after having enough guys yelling &quot;Pussy!&quot; at him.</p>\n\n<p>A few minutes into the next round I again nearly jumped out of my skin as that horse let out another outburst. Shortly after I heard Matt&#39;s voice ringing out &quot;Guys can we stop please? Seriously i&#39;m not kidding please get out here!&quot; I heard Steve yell out &quot;Yeah right!&quot; from somewhere and Wayne yell out &quot;Pussy!&quot; once more. &quot;Guys i&#39;m serious! Please i&#39;m not kidding please come out!&quot; he pleaded with us. After a few moments I decided to come out, seeing that maybe he was a little spooked being so far out in the middle of the night. &quot;What&#39;s up dude?&quot; I asked as I approached him. &quot;I saw something. I don&#39;t know what but.. I don&#39;t know I just saw something weird&quot; he said as Wayne and Steve emerged from the darkness. &quot;Whats up man you just trying to get out of being it?&quot; Steve said. &quot;Fuck you man!&quot; Matt spat back at him. &quot;Alright, alright&quot; Wayne mediated and calmed the two down.</p>\n\n<p>&quot;I saw something.. it looked kind of like a person but it was pale and didn&#39;t have any hair or clothes&quot; Matt said as he started to gain his composure. I felt my heart sink as I remembered that thing I saw running through the fields years before. &quot;What are you talking about dude?&quot; Wayne asked, seeming to get a little nervous. </p>\n\n<p>It was right then that Steve spoke out, &quot;Wait a minute.. where is Tim?&quot; We all looked in each direction to make a quick head count but we all went into a small panic. &quot;Tim!!!&quot; I called out of instinct and began quickly walking around the yard as the rest followed suit. That old horse was all but sprinting around the perimeter of its enclosure as we frantically called out to our friend. </p>\n\n<p>We had split up and were running at this point to find Tim. &quot;Where the fuck is he?!&quot; I heard Wayne yell out in frustration as minutes piled on. &quot;What is happening..&quot; I said to myself as I made my way around an old, worn down shed towards the back of the property. Just then I heard the familiar voice of Tim- &quot;Hey i&#39;m over here man!&quot; A huge wave of relief swept over me when I heard this but when I looked up I didn&#39;t see him anywhere. &quot;Hello? Tim?&quot; I called out. There was silence for about ten seconds before the same phrase repeated itself. &quot;Hey i&#39;m over here man!&quot; However this time I realized it didn&#39;t sound right. It sounded layered and like there was static seeping out of it. The voice seemed to come from every direction at once as i turned around over and over in desperation.</p>\n\n<p>&quot;Tim!&quot; I yelled out one more time before I looked towards the treeline and something caught my eye maybe fifty feet away. A Pale, disgusting figure stood out in the open just in front of the treeline. Its arms clenched tightly against its chest as its twisted body appeared to barely be able to keep it standing. I sat there frozen as I got a look at its face. It had no eyes, no ears or nose. No hair anywhere as it glowed that same faint shade of pale, white blue in the moonlight.  All that it showed was a huge mouth bearing a set of razor sharp teeth that seemed to bend in a distorted smile. It opened its mouth- &quot;Gotcha man!&quot; slithered through those disgusting teeth. I fell down to the ground, terrified.</p>\n\n<p>It stood there facing me for what felt like hours before it turned and sprinted into the woods in a flash- like before, making absolutely no sound. Moments after breaking through the treeline, an ear-splitting shriek erupted into the night that sounded as if it had blood and tar sloshing around in its lungs. This snapped me out of my state and I sprinted back to the house and the horse had all but lost its mind at this point. I found the others waiting by the porch, some on their phones while Wayne was talking to my dad about what happened.</p>\n\n<p>A search party was conducted and persisted for over a week but they never found Tim. I don&#39;t know what exactly happened to him but I am certain that thing took him away from us. I stay up at night in guilt wondering about his final thoughts and going over all the ways I could have saved him. I have never returned there as my father sold the property and moved on after the incident. To this day I wonder if it was that thing that made that horrible shriek, or if it was my friend Tim living his last moments.</p>\n</div>\n","author":"NamesJames0933"}