{"rank":"16","title":"The Shanghai Tunnel Experience.","id":"8jsmpb","url":"/r/nosleep/comments/8jsmpb/the_shanghai_tunnel_experience/","time":"1526450159000","body":"<div class=\"md\"><p>Portland Oregon is a great city with a great food scene, and I love living here. That being said, there is a part of this place that is very often ignored by the locals and kept guarded from average tourists. I am, of course, talking about the Portland Underground, known to some as the &#39;Shanghai Tunnels&#39;. Having a few personal experiences, I felt the need to bring a bit of attention to it. I also suppose you would like a little bit of background information.</p>\n\n<p>At the time of the story I am going to be sharing today I had just turned twenty one. I wasn&#39;t as wild as some of my peers, not really caring for the way being drunk felt. I did like to smoke a little bit of weed here and there, but that has nothing to do with the experience that I will be talking about. I was single at the time, and had a decent job that I was planning to leave for Basic Training at the end of the year. I eventually did, but again this isn&#39;t about that.</p>\n\n<p>I had been craving adventure for a couple of weeks, and I started messing around on the internet, looking for nearby ghost towns and like attractions if you want to call them that. That was the first time I discovered the tunnel system that ran under part of the city. I found an access point that allowed people to take a self-guided guided tour of a small section of the tunnels. The admission was also only five bucks.</p>\n\n<p>I went to work for the next two days, though my cabin fever only increased with every minute I was kept from my planned excursion. Finally the day arrived and I packed a small backpack with a few bottles of water, as well as a flashlight. I also grabbed my belt and a small hunting knife that my father gave me on my thirteenth birthday, securing the blade to my body with the aforementioned belt. I felt ready to take on the world as I walked out of my place.</p>\n\n<p>I considered driving myself to the small bar that would serve as my point of entry to the secluded underground passages. Ultimately I decided on Public Transportation, catching a bus that would carry me nearest my destination. I stepped off the big vehicle and followed the small signs that read Old Town China Town. Once I reached the top of the stairwell that would lead me down into the bar I felt the flutter of excitement and slight fear, the kind one might feel right before sky diving.</p>\n\n<p>I took a slow inhale and stepped down, letting the air out as I descended into the nicely furnished, well-lit bar.  The man behind the counter fit the burned out hippie stereotype perfectly. His gray hair was tied back into a loose ponytail, and he wore a pair of small, circular frames along with a tie dyed t-shirt and a pair of acid wash jeans. “Hey, welcome in. How can I help you today?” he asked, a friendly smile accompanying his words.</p>\n\n<p>I returned the expression, and gave a sort of shrug. “I heard I could take a self-guided tour of the tunnels that run under this place.” I said honestly and the old man&#39;s smile evaporated. He didn&#39;t get angry or sad, though he became slightly guarded for lack of a better term. “Yeah, it&#39;s five bucks, and you have to sign a waiver first.” he said, turning his back to me to open a drawer, handing me a pair of pages stapled together when he turned back around. I read over the statements which were pretty standard stuff, saying that I couldn&#39;t sue the bar if I got hurt.</p>\n\n<p>I signed on the line where I was meant to do so, and put a five dollar bill on the counter. “Entrance is over there. If you need a flash light I have them for rent for a dollar a piece.” he said and I pulled my left arm from the strap of my knapsack, withdrawing my small light, and made my way to the entrance, which was a pair of old style cellar doors. I opened the one nearest to me and stared down the dark stairs for a moment.</p>\n\n<p>Once again I felt a little thrill work through me. The emotion only grew with each step that I descended, tightening my chest a little bit as I reached the bottom, my narrow beam of light my only source of illumination. The air was slightly damp and very still in the subterranean path. The atmosphere itself was kind of eerie as well. I started walking after glancing around the initial little room which included a small bench.</p>\n\n<p>The walls were slightly damp in some places, water seeping through cracks in the semi-ancient concrete holding the crumbling bricks in place. The sound of dripping echoed from several places around me, and a small rodent scampered near my foot. I managed to keep my cool, but I definitely understood why there were people who wouldn&#39;t want to visit this place alone as my feet carried me to the first intersection.</p>\n\n<p>The path in front of me was blocked by a locked steel grate. I decided to go right, and as I walked, I caught sight of a pile of dirty blankets and shredded, dirty paper. A thick, musty smell deterred me from poking around the filthy cloth bundle. I almost thought I saw it move as I turned to move away, but it was probably my imagination, or even more likely another rat. I continued walking, the bobbing ray of blue-white light leading the way. I paused again as I noticed something on the wall. Faded slashes of color, about four inches high.</p>\n\n<p>It was a message, painstakingly written in coal-black ink that had faded and become a grimy gray. THIS IS THE END OF IT. Six words. A warning or a lamentation? That question burrowed its way into my brain and made itself extremely comfortable. It seemed to repeat with each step I took after that, clinging to my like the threads of an invisible spider web. This time when I sensed movement in the shadowy cavern behind me, I felt the cold grip of fear&#39;s digits encircling my stomach.</p>\n\n<p>I unsnapped the band holding my knife in its sheath as I wheeled, leading again with the narrow cone of luminescence. I felt silly for wanting to defend myself, confronted with an orange and white stray cat. It was skinny, but didn&#39;t look sick. It also didn&#39;t behave aggressively, freezing when caught in the glare of the LED torch.</p>\n\n<p>I felt legitmately dumb and laughed out loud at myself for the second time in less than ten minutes, turning back to follow the path I had chosen. The tunnel took a rather long turn and the walls were progressively wetter and wetter as I walked. The temperature around me dropped, and the painted words invaded my thoughts again. I shuddered and was grateful that none of my friends were around to see how scared I was getting.</p>\n\n<p>I had continued moving despite the added discomfort and fear that I was feeling. I came to another locked gate, the only other path to the left. There was a crude wooden chair with a modern-looking sign that said For Your Comfort sitting on the padded seat, and I took the opportunity to sit, digging a bottle of water from my bag, unscrewing the lid to take a couple of large swigs from it. I heard a sound from the tunnel that I can&#39;t describe. It wasn&#39;t quite a moan, but also wasn&#39;t exactly a scream, but some ghostly hybrid of both.</p>\n\n<p>Once more the thought of running back the way that I had come sprang into my mind. Whether it was bad judgment or simply foolishness, I didn&#39;t do so.  I took a couple of more drinks from the bottle of water before screwing the lid back in place, standing and continuing on my journey. I opted to hold the bottle of liquid rather than zipping it back into my knapsack. I followed the tunnel that had issued the rather unnerving sound a few moments earlier, the six painted words on the wall haunting my thoughts as I stepped further into the labyrinth.</p>\n\n<p>There was more scuttling movement at the edges of my vision and I could hear soft squeaks and responding chirps. I kept the beam of my flashlight focused in front of me, avoiding the rodents around me. A cold, foul breeze blasted me in the face, I gagged as the odor of mildew filled my nostrils and mouth. That was just about the straw that broke the camel&#39;s back and I prepared to turn, catching sight of another almost identical bundle of rotting blankets and other clothing.</p>\n\n<p>This time the pile did move, undulating in a way that made me feel sick, even through the sudden frozen spike of panic that shot through me. My feet were rooted to the floor as the pile began to rise, the shape below the tattered, filthy fabric becoming humanoid as it climbed out of the makeshift nest. That motivated me to start moving, running back the way that I had come.</p>\n\n<p>The thing let out another half scream half moan, the same sound that had almost deterred me earlier. I cursed my own stupidity as I turned the corner and nearly collided with a steel grate. I had apparently taken a wrong turn somewhere. I turned back quickly, reaching down to free my knife from its sheath as I heard the heavy, thudding footsteps of the thing under the blanket.</p>\n\n<p>I ran back to the last main tunnel that I could find, grateful that I had put some distance between myself and the beast right up until the point my foot slid in a pile of grime, knee twisting to the left, ankle rolling under my weight. I felt something go just before I came crashing to the ground, loosing a scream of pure agony as I fell. The impact on the ground sent my weapon and torch skittering away from me, the little LED light flickering as it bounced once, then went dead.</p>\n\n<p>I couldn&#39;t worry about the flashlight, or the knife, as whatever was following seemed to have increased its pace. I tried to get myself up, but my leg wouldn&#39;t hold my weight. Not that pain was a factor. I&#39;ll admit the one attempt I gave made me literally cry, though I stifled any further screams, but if it had just hurt, I could have hobbled my ass out of there. As it was, I crumpled to the floor, the thing behind me coming close enough for me to smell it again as well as hear its ragged breathing.</p>\n\n<p>I started pulling myself along the damp, grime-coated floor of the tunnel, trying to grope around in the dark as I belly-crawled, praying that my searching digits would find the handle of my Ka-Bar. It was lost to me, however, and just when I felt the thing closing the distance between it and myself and was about to abandon hope I heard another sound.</p>\n\n<p>It was otherworldly but unmistakably the low, guttural growl of a large canine. The sound was emanating from the opposite end of the hall as the nasty, dirty thing that was chasing me. That gave me motivation to crawl faster, using my good leg along with my arms to slide along the stone floor. The beast that had been pursuing me hesitated at the echoing rumble. A pair of eyes became apparent as I crawled closer to the source of the low noise.</p>\n\n<p>The two orbs shone in a familiar way, but the hue seemed a little bit wrong somehow, a little too bright, I think. The thing stepped toward me and I saw the purest white wolf I think has ever existed, its fur unspoiled by the dirt around it. Even its paws which sat in a shallow puddle of stagnant water, seemed as bright as new fallen snow.</p>\n\n<p>The wolf gave me a brief glance and tossed its head from side to side before loosing another chilling vocalization, this one a high, keening howl. It also let out a snort, and literally jumped over me, clearing the length of my prone form with preternatural ease. The thing under the blankets let out a vile, blood chilling hiss. Bad judgement overtook my urge to run and I pulled myself into a sitting position against one of the tunnel walls and watched the pair of creatures.</p>\n\n<p>The wolf began to pace, and the thing that had been nesting in the desiccating fabric hunched down, its long, spindly arms for lack of a better term, touching the ground. It screamed at full volume and the sound drove a spiral of pain into my skull. The wolf growled again and feinted toward the beast before lunging and biting into one of the scrawny entities shin. The thing let out an agonized vocalization that reminded me of nails on a chalkboard.</p>\n\n<p>The bipedal beast sent one of its balled up, deformed fist down on the canine&#39;s skull. The snow-white beast seemed almost unfazed, jaw clamping down tighter until a sick wet snap echoed through the stone chamber. The stench of rotting meat filled the hallway and I gagged, narrowly keeping what was in my stomach in place. The wolf began to shake its head from side to side, and the loser of the fight was squealing as the large animal began biting other places on its ugly, twisted body.</p>\n\n<p>The thing let out high-pitched squeals and shrieks, but I felt no sympathy for the foul, filth-streaked being that had been chasing me. The disgusting smell only grew more palpable and sickening when the creature went silent. The danger having passed the snow-white wolf took two backward steps, before pivoting to stare directly at me, green-black ichor coating its tongue, teeth and lips. Its fur too, was matted with the odious substance.</p>\n\n<p>The creature took a drink from the puddle as it approached me, and shook its head violently as most dogs do when they get wet, splattering the gross, oily liquid against the wall about a foot away from my form. The canine gave me a glance as it walked back the way it had come. It halted and turned its head back toward me and as I began to very slowly, crawl in its wake the shape of the creature began to shiver and waver like a heat mirage.</p>\n\n<p>When the form shifted again, and stood on its hind legs my heart nearly stopped. The apparition couldn&#39;t have been more than twenty five years old, raven black hair pulled away from a distinguished Native American face, adorned in little but a pair of ragged buck skin shorts. I stammered and tried to speak, but the man began to walk away, stopping just at the edge of visibility until I started to gain ground on him in my stunned, hurt, and exhausted state.</p>\n\n<p>The man brought me back to the steps that I had descended to enter the Underground. When I tried to thank him, the man simply smiled kindly and disappeared before my eyes. I managed to get my good leg under me, though the other one was practically useless. When I emerged into the bar, there were a few more people there than before. Many of them gave me horrified, almost nauseated looks. The hippie behind the bar rushed to me.</p>\n\n<p>He placed my arm around his neck and shoulders, helping me to one of the empty booths. He then quickly got me a glass of water. Once I had drained that and got his assistance going to the restroom where I voided my bladder, and actually managed to start hobbling around a little. He offered me a free plate of french fries and a beer and I accepted. While I ate and drank, I told the owner of the small bar the whole story.</p>\n\n<p>“That&#39;s.. Wow.. He&#39;s still down there.” the man muttered, almost to himself, rather than to me. “Who is still down there?” I asked, and though I pressed a few more times, the man clammed up. The ambulance arrived about twenty minutes after he left me alone, and they helped me onto a gurney. From there I was wheeled up onto the street and loaded into the van, and swiftly en route to a local Hospital.</p>\n\n<p>They x-rayed my knee and ankle, and fitted me with a knee brace as well as a smaller apparatus to help support the joint just above my foot. I kept my mouth shut about what I had seen in the subterranean maze, and was given crutches and a prescription for pain pills. I called a friend to come pick me up, and dropped my prescription off before having my buddy help me into the small studio apartment that I called home.</p>\n\n<p>Immediately after my friend left, I started diving deep into the lore of the Shanghai tunnels, looking for clues as to what exactly I had seen, and found more reports of the disgusting, desiccated nesting areas, as well as stories of people being chased much as I had been. Finding information about the phantom was harder, and very scarce. I became obsessed with the shape-shifting spirit as my leg healed, something urging me to return to the tunnels.</p>\n\n<p>I resisted as long as I could, but I eventually did return, but that, as they say, is another story entirely.</p>\n</div>\n","author":"Kendersarecooler"}