{"rank":"199","title":"A suicide in Starboard, Maine","id":"8jsx4b","url":"/r/nosleep/comments/8jsx4b/a_suicide_in_starboard_maine/","time":"1526453918000","body":"<div class=\"md\"><p>I was the first one to find her. I’d been worried sick about her. We’d had a talk on the phone a few hours before I showed up on her doorstep. She sounded hoarse, raving--I’d just wanted to check in, you know? I mean, it was a hard time for all of us, especially with how suddenly Vi passed. I’d lost a sister, she’d lost a wife. </p>\n\n<p>I thought I would just be checking in. But when I called her that day, it dawned on me that she was significantly behind me in functioning. I was suffering, sure, but I could go to work and the store and put on clothes in the morning. Maya, though...for the three months after it happened, I know for a fact she never tried to get more work. Hell, she barely tried to leave the house. </p>\n\n<p>I knew she was depressed, and I felt like a sponsor, of sorts; Maya was one of my best friends. I mean, she was special. She had the loudest laugh of anyone I knew and could toss back beers like nobody’s business. She cussed out me and Vi’s Bible-thumping body builder brother when he tried to tell them not to get married because it was against God’s will.</p>\n\n<p>She was normal, well-adjusted, full of life. I was confident she could get that way again--she just needed some help. So I kissed my wife on the cheek and made the drive out to Starboard.</p>\n\n<p>When I pulled up to her little yellow house I could barely park my car on account of all the snow in the road. I ended up just parking up in the middle of the street. I thought maybe using snow shovelling as an excuse to get her working out. To my surprise, the door was already open. Nobody home. </p>\n\n<p>This letter was on her desk, folded neatly in half. Here it is, in full.</p>\n\n<hr/>\n\n<p>My Dear Violet,</p>\n\n<p>Even though you’ve died, the walls of the house seem to heave with disease. The icy draft isn’t crisp Maine air, anymore. It’s a wet, rancid cough, hacking its way through the plaster. The buttercup wallpaper we bought at the hardware store is soaked with sweat and jaundice. We picked that cherrywood headboard on the bed where you died because you said it was like a soft blush. But I know it for what it is now, Violet; it’s the rosy delirium of a fever. I tried to wash the sick away with my tears. It was no good. They poured down my face like dribbling spit. Water doesn’t clean this house, anymore. It sputters from the showerhead like thick phlegm. The floorboards creak and they’re aching joints. Every inch of every wall is splattered and stained with the sick, Violet. I look down every drain and see the dark bruises that bloomed all over your body at the end.</p>\n\n<p>Before you died I was normal. I liked beer and sports. I wanted a clean house. I wanted a photo album of our honeymoon in Portugal. I wanted kids. Two of them, a boy and a girl. I wanted to hear their little footsteps on our floorboards like rain. Before we went out on the boat that day I loved the water; I loved you. I was normal. Then the storm descended. Then you fell in. I pulled you back up over the edge, but you weren’t the same. I hate the sickness, I hate it. Now I’m losing time and sleep and meals. I wake up in places and forget how I got there.</p>\n\n<p>There was something in that water.</p>\n\n<p>Jason called me crying, again. I couldn’t cry. Even for your brother, my best friend, I couldn’t endure the diseased spit flowing from my eyes. I hate the sick, I hate it. I consoled him. He asked me if I wanted to get dinner. He said he hadn’t seen me since the wake. I told him some other time. I hung up. I miss him, but when I see other people, I just see the sick. I see you falling over the edge of that boat into the churning water.</p>\n\n<p>I haven’t cleaned the bed since the night you died. The men in the surgical masks came in with their cool, gloved hands, and doused the sheets with a sweet, sharp disinfectant. Then they carried you out; I was wailing. Jason’s car screeched to a stop outside the house and the ambulance cast soft, dancing lights against the yellow wall through the window.</p>\n\n<p>I haven’t cleaned the bed, and the sweet, sharp smell has contorted into something like fetid, rotting bananas that I can’t quite place. When the heater comes on it diffuses into the living room where I eat and sleep and it gags me. If I run outside the wintry pines cleanse my throat like sacred fire. But then I come back in to the smell of perfume over hot manure.</p>\n\n<p>The smell coming from your bed was what drove me outside that first night. Stepping outside into the wintry dusk was like plunging into a cold sea, but I grew up in the water, so I hugged my jacket closer and lit a cigarette. I didn’t smoke before you died. Your mom and I bumped into each other outside of the wake, each smashing old menthols into an ashtray with shaking fingers. You were like the anchor of a ship, Vi, and without you we’re just floating.</p>\n\n<p>You and I met on the water. Of course we did. I grew up swimming in the Atlantic off the coast of Starboard, you in the Pacific. We were deckhands on that cargo liner, and your emerald eyes against the grey metal filled me with a joy, a longing, that started at the bottom of my stomach and then blossomed into my chest and knees and neck and fingers and lips.</p>\n\n<p>We were married a year and a half before that day on the boat. We sailed around the Iberian cost after the honeymoon, water so clear and smooth it was like polished turquoise. We were docked in Lisbon when I got lost in a roaming crowd, and when I found you hours later, sweaty and thirsty, you swept me into your arms and held me so tightly I thought we would mesh, meld, into some permanent sculpture, monument to love. I took a deep breath and you smelled  like fresh salt; I was warm and I was safe and I was home. </p>\n\n<p>I miss you, Violet. Fuck. I miss you. We only moved out here, back to my tiny hometown in Starboard, so we could sail freely and grow old together. That’s what was supposed to happen. I never wanted to write you an elegy, Vi, I don’t know how.</p>\n\n<p>We were on the water when it happened. But the water was always kind to us. Something is wrong. Something went wrong, that day. You were always healthy. The doctor say it was a bacteria or a chemical you ingested from the dirty Starboard waters. That something so mundane could have extinguished a cosmic kindness like yours.</p>\n\n<p>I don’t believe them. I felt it, that day, as the dark tempest rocked our boat and the lightning illuminated the dark mirror of the water in flashes that shook our craft. The thing is, Violet, the lightning flashed when it happened. You didn’t fall overboard. Something slimy wrapped around your ankle and yanked you into the inky black.</p>\n\n<p>There’s something down there. Something in the waters of Starboard. It’s angry. Angry at us. I feel it when the walls of our house hack their sick out at night. There are twisted faces in that plaster, knives and talons and hot, wet saliva. There are white bones ground to dust that drift down from the sky in freezing little pricks. They condense into piles and transform into thick, black mounds of jelly when night descends, blown into misshapen sculptures by the black wind.</p>\n\n<p>The smell has metastasized into something more horrific--decaying, squelching, old skin and fermenting shit. It was what drove me out of the house that first night. That first night was the first time that I felt it, a bronze dagger molded from dread that leapt out of the ocean and pierced my weak stomach. I walked toward the water. Toward you. </p>\n\n<p>There’s something down there; I felt it then, I know it now. Something that wants me. That has already kissed me and is spreading through me, slowly. There is hoarfrost growing in my blood, a vicious type of rot, of bacteria. Hoarfrost, rime, that glitters like glass and then tears at my flesh, hoarfrost, that chills me to the bone. That is spreading through me, slowly. Slowly, but steady as our ship went when you were at the helm.</p>\n\n<p>Violet. Violet, I miss you. I miss you more than my throat can swallow or my stomach can heave, and I miss you more than these footfalls I leave on the sidewalk like dark stains as I walk to the water that churns and moans and beckons me with purring little waves that belie the ravenous current. When we were together the water was smooth as fresh cream and bluer than sapphires. Now it’s murky. It’s the matted hair on the back of some sleeping beast, with claws, and fangs, and a roving, hungry tongue.</p>\n\n<p>That first night I made it halfway down the sidewalk before I snapped out of it and turned around. I remembered leaving the house and walking down the street, but it was soft-focus, like a dream. The second night I made it to the end of our street, and I only turned around when a car whizzed by me and a drift of snow smacked me in the face. You know the way to the water just as well as I do. Down our street, turn left down the boulevard, and follow that road east until the pier.</p>\n\n<p>Whatever took you that day wants me too. It’s confusing me. Half the time I don’t feel like myself. I wrote these words. But I only wrote them halfway. Something else guides my hand. There’s something off the coast of Starboard. I need to find out what. </p>\n\n<p>Sometimes I look in the mirror or the windows and I see a horrible piranha, with a human face and body and claws at the end of its arms. Its scales are the color of obsidian and in front of it dangles the single point of light of an angler-fish. It swims just beyond my reach. Some night I dream it wraps its arms around my neck like kelp and I sink and sink ninety leagues below and I drown.</p>\n\n<p>I talk to your brother on the phone more often these days. Last night he called me and he sounded worried. He wishes I would leave the house. Says he called our mutual friends in Starboard and they never see me at the supermarket anymore. </p>\n\n<p>They don’t see me there because they don’t know I’m eating the bones outside my window. I eat the arms of trees and the frozen soil. When the hunger gets fierce I’ll take a raw slab of meat from the freezer and feel the ice crack under my teeth.</p>\n\n<p>It’s hard to leave the house when the sun is out. It hurts my eyes.</p>\n\n<p>I identified the smell. It’s old fish. Their scales falling off into my hands.</p>\n\n<p>When I was a little girl in Starboard the water felt like velvet. I swam like a lithe little otter and spouted it out of my mouth like a fountain. When the water comes out of the faucet now it’s dark red, the color of old wine and young lipstick. It tastes like salt and flesh.</p>\n\n<p>When I was a little girl in Starboard I’d watch the pipes run off into the ocean and turn it thick with filth. When I was a little girl in Starboard I picked a fish up from the shore, still floundering. Its life leaked out into my hands and I felt the backbreaking weight of responsibility. I liked the boats because they took me to the good water, where the fish took easy gulps and swam and swam. The water off the coast of Starboard is full of coal and blood. The runoff from the factory looked like a black noose around the fish’s neck.</p>\n\n<p>The water was clean when I was young, with only the portents of the polluted soup it would become. I could have drank it. Now I can hardly even smell it.</p>\n\n<p>I liked boats because the water was vast. A promise of a horizon, of assuaging my hunger for something better than our empty streets and crumbling canning factories. I sailed to Venice, Greece. When I met you on that dark grey cargo liner I thought maybe I’d found it. That horizon. Now I am in a little bowl. A cruel, little ceramic bowl, swimming and swimming in my own brack. ‘</p>\n\n<p>Sometimes I’ll get it. I’ll know I’m starving. Wasting. Eating all types of shit in fits of psychosis wrought by grief. I’m grieving, Violet. I’m going insane. I invented all of this because I needed a reason. Needed someone to blame. Fuck. Fuck, I’m ripping my hair out. Holy fuck. Sometimes I catch a glimpse of that other face in the mirror, a half-second glimpse of something dark and terrible and hungry. I’ll see my own face and touch it with the careful compassion of someone handling a sick dog. I’m growing gaunt. The bags under my eyes are unfurling like purple butterflies. I get bruises and I don’t know how. There are strange lacerations and indentations on my neck. I’ve lost the distinction between memory and reality and dreams. I’m losing time. I am losing myself.</p>\n\n<p>I keep forgetting your face. I keep forgetting what it was like when you held me that day on the sunny streets of Lisbon. I’m kicking, and kicking, and kicking, but I keep sinking and I don’t know if I’ll be able to find the surface before I drown.</p>\n\n<p>Some days I wake up in the middle of the road and I’m naked. Naked in the snowstorm. I’m covered in scratches.</p>\n\n<p>Half the time I’m lucid. Fuck, less than half. </p>\n\n<p>It’s like I’m walking a tightrope made of barbed wire. And I’m going to fall off any second.\nI want to call your brother, but my phone doesn’t work anymore; no dial tone. Did someone cut the the lines? </p>\n\n<p>I am hungry. So hungry. I am wailing and howling and I can eat and eat and come up empty.</p>\n\n<p>There’s no moon outside. No streetlights. I wouldn’t know I was home if it weren’t for the smell.</p>\n\n<p>I exhale and little bubbles escape. There is a dark snake squeezing my ankle.</p>\n\n<p>It’s not just the smell of fish. There are fish in your bed. Dozens of them. Some of them still flailing, some barely more than dirty bones. </p>\n\n<p>I shut the door and heaved. I heaved and heaved. I can’t tell when I’m dreaming.</p>\n\n<p>I’m scared, Violet.</p>\n\n<p>Violet. There is a light coming through the window and without seeing it I know it is the light on the end of an angler-fish. </p>\n\n<p>There are scratches on the window. They’ve been piling up since you got sick. I denied it at first. But there are more now. So many I can barely see outside. Like the cold teeth of the wind are hungry and they bite and they want flesh and they are piranhas. </p>\n\n<p>I keep remembering what I saw that day in the mirror. It had so many teeth. It wasn’t a person or a fish, it was something else. Death seeped from its talons. It knocked at me from the other side of the mirror. Something’s tapping on the window now.</p>\n\n<p>Your brother called and said I’m grieving. He begged me to get help. Said he was coming over, now. </p>\n\n<p>He thinks I’m going crazy. But I’m not crazy. I’m not crazy. I’m just...scared.</p>\n\n<p>The world outside the window is cloudy with the runoff from the factory. My shoes and socks are soaking wet. The water’s seeping in from under the door; it looks like oil and it has teeth and teeth and teeth and it’s hungry it’s a piranha. It rips flesh, chunk by chunk, and stains the water with clouds of blood. I am scared. I’m scared, Vi.</p>\n\n<p>What did we do to Starboard? It wants us, I’ve realized. First, the people on the boats, the vile, electric boats that ejaculate plagued oil into the pristine water. And then it will creep ashore and get the rest of them. Starboard is not safe.</p>\n\n<p>The thing outside the window is not going to wait any longer.</p>\n\n<p>Violet, I am taking off my wet shoes and wet socks. I am going to walk to the end of the street. I am going to turn left. I am going to go to the water.</p>\n\n<p>Love always,</p>\n\n<p>Maya.</p>\n\n<hr/>\n\n<p>I sped down to the dock with the police on the phone. She never even took her boat. She was floating facedown in the shallow tide. I was an hour too late, at most.</p>\n\n<p>We all thought Maya killed herself. I thought the letter was a crock of crap--the writings of a grieving, psychotic woman. A woman who I failed. I got too caught up in my meaningless boardroom job and my own stupid troubles and I let my best friend, my sister-in-law, die.</p>\n\n<p>Starboard had always intrigued me. The name was so unusual. I mean, nearly everywhere on the east coast was found by boats of some kind. I wondered why it was so special to this place. So I did some research, and emailed the librarian at the Starboard Public. </p>\n\n<p>They called it Starboard not just on account of the boats--there were so many fish swimming beneath the water, their scales shining, it could’ve been a star map, a literal ‘star board’. But there were boats, too. And boats, and boats, and boats. Scores of them. Fishermen on the starboard of those boats scooped the fish up, again and again; the women salted them, the men sold them, and eventually the great Starboard Fishery rose up, a beacon of shining steel, the nexus of economics in the town. Houses sprang up around the factory like a rash of pimples, and Starboard was booming with a cannery to rival Monterey.</p>\n\n<p>Until it wasn’t.</p>\n\n<p>One day the townspeople woke up and there were no more fish. They sailed as far out as their little crafts would go. No fish. This wasn’t just overfishing--they were completely extinguished, vanished, like they had never existed at all, let alone been so abundant they looked like the night sky. They’d been massacred, been canned and chewed and shat out. The factory rapidly shut down its cannery operations and began to decline, the runoff from its old machines and ugly chemicals sloughing off into the dead zone just off the coast. Even when Maya was a kid, swimming in that chemical goop was ill-advised. </p>\n\n<p>I figured it was a coincidence. Maya must’ve known her town’s history, and in her grief she let it morph into some ugly, tragic psychosis.</p>\n\n<p>I figured. But when I found Maya that day, floating facedown, I reached down and touched her, in spite of myself, as I sobbed. My fingers got wet with the Starboard water.</p>\n\n<p>I woke up today and my index finger on my right hand is...purple. Like I took a hammer to it. I brush back my hair and notice odd, scaly dandruff. My armpits smell like fetid fish. It can all be explained, easily. My littlest son is having dreams about dark, hungry water, and graveyards, and bones. </p>\n\n<p>It’s probably coincidence. Paranoia. After all, I’m grieving, too. In all likelihood, Maya killed herself. That’s what we thought.</p>\n\n<p>But I’m wondering...I’m wondering.</p>\n</div>\n","author":"tamikaflynnofficial"}