{"rank":"6","title":"No Service - Part 2","id":"8jsysr","url":"/r/nosleep/comments/8jsysr/no_service_part_2/","time":"1526454479000","body":"<div class=\"md\"><p><a href=\"https://redd.it/8jjmmp\">Part 1</a></p>\n\n<p>After two quiet days with no incidents a series of interesting events transpired today that undoubtedly tie into the first posting I made last night. Let me just say, I am mortified.</p>\n\n<p>I woke up this morning and followed through with my routine of shower then get ready then attend class (today I had a final). I noticed in the morning that my scratch marks were beginning to heal minimally. I finished up my final and headed straight home in anticipation of hopping on my PC for some games.</p>\n\n<p>As I mentioned before - I never have experienced anything remotely paranormal nor do I really believe in such phenomenon until recent events. </p>\n\n<p>When I got home my roommate caught up with me on how his tests were going. Then he mentioned that I left my light and door open when I left for class which seemed unusual to him as this is something I never do. I was sure this was a mistake, but he has no reason to make up something so random. I also noticed y laptop had been in a different spot than I typically leave it, too. I didn’t think about it too much at the time.</p>\n\n<p>A few hours later after some games I pulled up our local newspaper to check out the sports headlines. But something caught my eye. The middle of the newspaper had a piece titled, “Missing Persons Case: Where is Judith Long?”</p>\n\n<p>My blood ran cold. There was no way this could’ve been a coincidence - was it the same Judith from the phone calls and tattered note? The article noted that her brother, Lance, had searched for her for eleven years before overdosing due to a heroin addiction that hindered his health for years. </p>\n\n<p>I didn’t know what to think at this point. Not only had the names matched up, but I stumbled upon this so soon after the recent events I’ve experienced. </p>\n\n<p>My immediate instinct was to return to where I had originally encountered the note as this could provide plenty of insight for law enforcement on the investigation. Every instinct told me to just let it go. I just had to know more. I hastily traveled to the location.</p>\n\n<p>There, as before, settled the same wooden box. The lock from before laid next to the box in the dirt. Footsteps led all the way up to the box that had been clearly distinguishable from my own. This time the old note had vanished and was replaced by a smaller piece of paper with an etching on it. In scribbled script it read:</p>\n\n<p>“Check the trees once more... the signs...”</p>\n\n<p>I didn’t know what to make of it. I was frightened beyond belief. As before, my phone that lacked service begin to ring again. I answered.</p>\n\n<p>“Three paces backwards... look left and walk twenty paces and witness my gift...young boy... so delicate and innocent... venture further, find your answers... grasp reality.”</p>\n\n<p>This time I decided to talk back:</p>\n\n<p>&quot;Who are you?&quot;</p>\n\n<p>After a brief pause and a clear and loud breath I heard in a deep raspy voice:</p>\n\n<p>&quot;Just... follow.&quot;</p>\n\n<p>The phone hung up.</p>\n\n<p>Due to my lingering curiosity I decided to comply with the order - I was too worried to do otherwise. After my pacing, the only thing before me was a large oak tree. I scrutinized the base of the tree for any evidence like the noose I had found before. I found nothing. But then I looked up.</p>\n\n<p>Scratched into the trunk on the reverse side of the oak was the word, “sink”.</p>\n\n<p>Now less frightened but more confused I made my way back toward my original path. I tried to remember the phone call from before. It said something about a “gift” and I’m so unsure of what that meant. I just kept walking. As mentioned before, I have a keen sense of direction and knew the direction I came. However, I begun to notice continuous etchings on each tree I passed. The words went in this order.</p>\n\n<p>“Into”\n“Boy”\n“The”\n“Grasp”\n“My”</p>\n\n<p>At this point I ran as quickly as possible. My breath was growing fainter and fainter but I eventually made it to the original trail. It really was time to head back home and try to put this behind me.</p>\n\n<p>But these events kept following one another.</p>\n\n<p>I got home and hopped in bed. My MacBook had been laid open on my bed and the screen was lit. I assumed my girlfriend used it last, but that doesn’t explain the still lit screen as she hasn’t been here since the morning. </p>\n\n<p>The tab left open on my laptop was blank except for words that were typed into the browser search bar:</p>\n\n<p>“Sink the boy into my grasp....I feel wonderful when we’re together. I feel so fine just to know that you are mine.”</p>\n\n<p>My heart sunk. I quickly closed the tab and called my girlfriend to tell her what had happened. She didn’t know what to make of it and she had suspicion I was just trying to scare her. I didn’t know how else to convince her, so I left it at that. </p>\n\n<p>After our call the screen on my laptop lit up instantly after being on sleep for the duration of my conversation on the phone. It was opened to a tab that was paused on a <a href=\"https://youtu.be/w5Fgp-KihIA\">song</a>.</p>\n\n<p>I played out the video and laid there still and cold. This was only about an hour ago and I recapped the events from the day and pieced this together. Again I’m left confused and now just scared as hell and don’t want to be handling with this stress given finals, etc. </p>\n\n<p>This has stretched way beyond any prank that could be carried out to scare me. The erratic behavior on my computer and disappearing of the original note from the shack are far too bizarre and I can’t compare or link these events to anything else from my past. I want further insight and information but I&#39;m very hesitant to look further.</p>\n\n<p>I will continue to post updates, bye for now.</p>\n</div>\n","author":"luckilemon98"}