{"rank":"27","title":"The Elevator.","id":"8jt10f","url":"/r/nosleep/comments/8jt10f/the_elevator/","time":"1526455277000","body":"<div class=\"md\"><p>We were walking through the corridor of rooms on the seventh story of the Gold Coast Casino when the lights began to flicker. Thinking nothing of it, my fiancé and I continued past the numbered doors and made our way to the elevator hall.</p>\n\n<p>As Annabelle and I turned into the elevator hall, we stood facing four elevators, two to our left, and two to our right. The two to our right, and the one nearest us on the left each displayed they were currently at floor 6. The furthest from us on the left stood open, but with its inside lights turned off and no floor displayed above it. We figured it to be out of order and didn’t get in. I reached and pushed the call button for an elevator to come up and take us to the casino floor.</p>\n\n<p>After we had waited only about thirty seconds or so, another couple, a well-dressed man and woman aged in their thirties, came into the elevator hall.  We exchanged nods. They looked at the elevators which displayed they were still on floor 6, and then noticed the elevator in the corner that had its lights turned off. Without hesitation, they walked into the elevator as if nothing was out of the ordinary. As soon as they stepped in, the lights turned on above their heads, brightening the elevator in which they stood. </p>\n\n<p>Annabelle and I exchanged confused looks and a smile. We didn’t have to say anything to each other to know we were on the same page. Was that strange? Let’s just wait for another.</p>\n\n<p>As we waited, the couple in the elevator were audibly growing annoyed. The man had pressed the floor button multiple times, yet the doors wouldn’t shut and take them down. I wanted to tell him it was obviously broken, but I held my tongue, thinking he’d figure it out eventually.</p>\n\n<p>A family of four came into the elevator hall, the father walking ahead of the mother and their two daughters. They were speaking Spanish which I can understand some of, but not enough in passing to know what they were saying amongst each other. They walked past Annabelle and I, and stepped into the strange elevator with the other couple. As they stepped in, I heard the familiar ping of the floor selection panel ping from inside the elevator. The well-dressed man said “finally”. </p>\n\n<p>The doors of the strange elevator began to slide shut. As the doors closed, I could still hear the Spanish speaking family from behind the elevator doors, but I paid no attention to what they were saying.</p>\n\n<p>“That was weird?” Annabelle said.</p>\n\n<p>“Yeah” I laughed. “No way in hell I’m getting stuck in that.” I pulled her in for a kiss while we waited alone.</p>\n\n<p>We waited for another minute and still, I could hear Spanish speaking coming from behind the now closed doors of the strange elevator. </p>\n\n<p>“Obviously its broken.” I said to Annabelle who agreed.</p>\n\n<p>We heard in English, assuming it was the first couple to get in, telling each other that they wanted to get out.</p>\n\n<p>That’s when the lights inside must have gone out.</p>\n\n<p>From inside the elevators closed doors, Annabelle and I heard all the inhabitants gasp almost all in synchronicity. </p>\n\n<p>“Get me out, get me out.” I heard a woman say.</p>\n\n<p>“Baby stay calm.” The man pleaded.</p>\n\n<p>The cries I didn’t understand must have been the two daughters of the Spanish speaking family.</p>\n\n<p>There was a flight of stairs through a door back down the corridor. I told Annabelle that she should run down to the lobby and tell the people working there that there is a broken elevator stuck on floor seven. She asked how come I wouldn’t come with her, and I told her that I wanted to make sure I could hear the people inside incase anything happened, not expecting what happened next, actually would. She said okay and took off towards the lobby.</p>\n\n<p>“My fiancé is headed downstairs to get help, are you all okay.” I yelled at the elevator doors.</p>\n\n<p>“Thank you. Were okay, the lights are off.” A man’s voice called out over the cries of the young girls.</p>\n\n<p>Within the next minute, their cries became screams.</p>\n\n<p>At first I heard the first man and woman express to each other how hot it was getting. I figured they were just nervous, and also standing in a cramped elevator, so of course it would be a little warm.</p>\n\n<p>“Is help coming?” The man asked.</p>\n\n<p>“They’ll be here any second.” I answered. To myself I prayed Annabelle would get back with help quickly.</p>\n\n<p>Then I heard the two girls and their mother begin to panic.</p>\n\n<p>“Hace calor, papa” a girl said. I knew she was saying Its Hot.</p>\n\n<p>Everyone in the elevator was clearly freaking out. Someone inside had begun banging on the elevator doors. A woman inside was bawling hysterically. </p>\n\n<p>“Ayuda me!” The Spanish father cried out for help.</p>\n\n<p>“It’s burning up in here, man! Help us!” The other guy yelled out.</p>\n\n<p>“Fuego! Fuego!” a ladies voice screamed.</p>\n\n<p>The scream of “fuego” felt like it stopped my heart. I knew that she was screaming that there was a fire.</p>\n\n<p>Beyond the screams of the women and children, I could hear the first man to get in yelling out in desperation.</p>\n\n<p>“Pry the doors! Help! It’s on fire! Pry the doors!”</p>\n\n<p>I placed my hands against the metal of the sliding elevator doors hoping I could pry them open. The skin of my palms and fingers singed against the metal as if I had placed my hand onto a burning frying pan. I pulled pack reflexively, sweating from the heat that was coming off of the elevator doors.</p>\n\n<p>I could do nothing as I listened to the screams of the people burning alive inside the elevator. The shrieks of the inhabitants tore through the hall. My palms still sizzled as their cries for help would go unanswered. Only one word was clear enough to make out amongst their screams and cries.</p>\n\n<p>“Diablo! Diablo!” A young girl’s voice cried out over and over again.</p>\n\n<p>I sat back horrified, frozen in place. I’m killing myself at the fact that I didn’t do more or act quicker to get help, but I guess it’s true what they say about life or death situations: until you’re put in one, you never know how you’ll react. </p>\n\n<p>I was on my knees facing the elevator, eyes closed, tears running down my face, when Annabelle came running up to me. I had been crying hysterically. The screams from inside the elevator had faded, and I knew everyone inside had been burned alive.  I could still feel the heat radiating off of the elevator doors against my face. </p>\n\n<p>“Sam, what happened?” Annabelle asked.</p>\n\n<p>I was hysterical and couldn’t compose myself. I tried to speak but couldn’t. I looked at Annabelle and pointed at the elevator. She looked at the elevator then back at me.</p>\n\n<p>“Sam it’s okay.” She tried to calm me.</p>\n\n<p>I found my words beyond my hysteria. “I heard their screams. They’re dead Annabelle.”</p>\n\n<p>She looked at me confused. </p>\n\n<p>“Sam, are you okay? I just passed them all on the stairs coming back up here.”</p>\n\n<p>I looked up in shock. From Annabelle, I turned my gaze to the elevator doors. It stood wide open, with the lights inside turned off.</p>\n\n<p>I tried to speak but was lost for words. Annabelle sat down next to me and put an arm around me as I tried to grasp what had happened. I heard their cries, I heard the screams of Diablo. I felt my hands burn against the door.</p>\n\n<p>My hands!</p>\n\n<p>I flipped my palms and stared at them in disbelief. The skin was perfect. There was no blisters, no pain, and no burns whatsoever. </p>\n\n<p>After my shock wore off and I composed myself, Annabelle and I took the stairs to head down into the casino. I was still in disbelief about what I had experienced, and tried to convince myself it never actually happened, but I couldn’t. I spent the night dinking away the thoughts.</p>\n\n<p>After hours of getting drunk and gambling away a couple hundred bucks, I stumbled over to the elevators with Annabelle, ready to head back up to our room. I tried to convince her to take the stairs, but she told me not to be so scared and that I could hardly walk a straight line, let alone 7 stories of stairs. I figured she was right.</p>\n\n<p>We waited for a few moments for an elevator to come. Three of them showed they were on floor six, the fourths display showed nothing. </p>\n\n<p>We waited roughly three minutes for an elevator to come, and finally heard the ping that one had arrived. When we looked up, we saw the fourth elevator had arrived at our floor, its overhead display showing casino floor. Light shined from inside the elevator, so we walked over to get in it.</p>\n\n<p>A blood curling scream shrieked out of Annabelle as we got close enough to see fully inside the elevator. On the ground, the burnt bodies of four adults and two children lay in a heap. They were all black as if they had been burnt to a crisp. The smell of burning flesh and sulfur fumed out from the open elevator doors. I went to grab Annabelle, to pull her way from the horror that lay before her, but as I gripped her arm, I jumped back with a pain that made me scream myself. My palms and fingers were blistered and severely burned.</p>\n</div>\n","author":"whothefuckisG"}