{"rank":"28","title":"The Graveyard Shift","id":"8jt8v0","url":"/r/nosleep/comments/8jt8v0/the_graveyard_shift/","time":"1526458367000","body":"<div class=\"md\"><p>I worked 15 years in a major metropolitan area ER as an x-ray tech on third shift. And not long after starting I discovered how that shift got its name. But before I go into that, some back story.  By the time I started this job, initially part time, I was in my late 20s and had worked in the field for 8 years, in doctors offices and walk-in clinics. I was a big guy, 6’4” 275lb. Now I’m a disabled wreck, but after I give some details you’ll probably understand why. Anyway, I was newly married, moved from out of state, and needed a second job to help with the bills. This job, every other weekend from 11p-7a on Friday and Saturday night was at a hospital that was actually closer to my house than my main job. What luck.</p>\n\n<p>The interview went well, I had good references and the department manager was a nice guy who said I’d be perfect. He described the job as an open all night ambulatory clinic. Even though it was a level 3 trauma center (the lowest), the bad stuff went downtown. Or so he said. The pay was good and even though I dreaded going back into the hospital environment, it was the least favorite part of my 2000 hr clinical training, it didn’t sound bad. </p>\n\n<p>My first night I work with a girl who showed me the ropes. She showed me the trauma and cardiac rooms, where the portable X-ray machine was kept. Ugh, the damn portable machine, I forgot about those when I applied, was my immediate thought. Anyway, she introduced me to the nurses, one who said, “fresh meat”, whatever that meant. One interesting feature was a “rubber room” for psych patients.  The door had been obviously ripped off its hinges recently and the hanging ceiling tiles and lights smashed in. And as we walked from the ER to the main x-Ray department, I noticed the morgue was behind the wall to the ER X-ray control area. Creepy. </p>\n\n<p>At the main department we went over all the important points and then we did a mini hospital tour. At 350 beds, it was a medium sized hospital. It had 3 critical care units. One for cardiac, one for pediatrics and another for everything else, ICU. She showed me the portable X-ray machine for the main part of the hospital and I was pretty much set. </p>\n\n<p>We worked for a few hours and the ER slowed down and so we chatted. I found out she had worked 2nd shift too, was pulling a double to train me. Shift differential and OT was going towards her taking a short vacation to the mountains. Everything was going well until I was telling her that my neighbor said my house was haunted. She immediately clammed up. I decided to change the subject and I then half jokingly asked what cyclone had been in the “rubber room”.  If she looked clammy after I mentioned my house being haunted, she now looked petrified. “They’re lucky I stayed to train you tonight. After what happened earlier I need a vacation more than ever”. She proceeded to tell me about the John Doe brought in. </p>\n\n<p>He was dressed all in black with tattoos all over his arms, neck, chest, even his face. Oddly, she described them as runes. Well, not tattoos she said, welts, raised skin.  Even more odd. He was brought in after someone noticed him slumped over by a road. He arrived unconscious via ambulance and they put him in a cardiac room. I found out later the ems here for some reason just transported him here, without doing their usual in field evaluation. </p>\n\n<p>Anyway, she tells me she went to do his portable chest X-ray and right when she leaned him forward to put the film plate behind him, he awoke.  His eyes were totally red. The whites were red! And he opened his mouth and all of his teeth were filed, apparently, into points!  And then he let out a yell/growl/scream that almost made her soil herself. At this point, she told me, she had recoiled and retreated to just outside the room. The nurse missed the eyes and mouth, her back was to the patient prepping an IV. When he screamed though she spun around in surprise and also retreated out the door. That left this “man” alone in the room with the X-ray machine. The bulk of the machine was by his left foot. In a fit of rage, he kicked the thing halfway over into the cabinets. “What”? I was stunned to hear this because a portable X-ray machine weighs hundreds of pounds, it’s filled with batteries and a lead lined area for film. I couldn’t believe someone could just kick one over.  She showed me the crease on the side that hit the cabinets. Luckily it was still working.</p>\n\n<p>Well, she went on, they lucked out in that Security, off duty police, were hanging in the nurse’s station. It took all 4 of them, and one of the male X-ray techs from the main department who was relieving her for break to subdue the patient.  Jeff, the tech, didn’t fair well, his arm was twisted and snapped like a twig. “Fresh meat”, I thought, although later I learned this was just the tip of the iceberg of the meaning behind that comment. Anyway, they put him into the rubber room after sedating him, locking the door. She overheard the head nurse and doctor saying things like, “unnatural, unexplainable, impossible “.  </p>\n\n<p>Then, she goes on, shortly after 7:45 she hears an ungodly racket coming from the rubber room. She is doing a portable X-ray in another part of the ER when a nurse frantically comes by LOCKING THE PATIENTS IN THEIR ROOMS. She said she hurried back to the ER X-ray control room and locks herself in. After a couple minutes the ungodly screams and crashing noises stopped. She then says she hears this loud thud. Then again, and again. It was so forceful it felt like the floor was vibrating. She said she called the nurses station to see what was making the noise. John Doe, on the camera feed before it went out, had picked up his stretcher, OVER HIS HEAD, and was using it as a battering ram on the steel door! At this point I’m sitting there with my jaw dropped and ask what happened after he knocked the door down. Well, the night Security manager had arrived shortly before this happened. His day job was head of the county sheriff’s SWAT team. He and his team tazered him and that subdued him enough to let the nurses pump him up with Thorazine. But all that caused a cardiac event and now he’s in the icu extension. </p>\n\n<p>What’s that, I ask. It’s basically an overflow for the times of year when we get more critical patients, but mostly it’s closed like it should be now was her description. She overheard they put him in it to keep him away from the other patients. No shit, I thought. And, she added nervously, there’s one other thing. She then tells me she’s heard whispers from the wall earlier tonight. The wall shared on the other side with the morgue. That’s why she reacted like she did when I mentioned my haunted house. Hmmm.</p>\n\n<p>So, I’m digesting all this, trying to think of a rational explanation. I glance at the wall clock, it says 3:00, the witching hour I think. No sooner has that entered my mind then blasting from the overhead com system, reverberating throughout the hospital is, “CODE, ICU EXTENSION, CODE”. “I’m not going “, was my coworker’s immediate reaction. I didn’t blame her. I told her no problem and as I left to head to the main X-ray department and that portable X-ray machine, I hear the control room door lock behind me.</p>\n\n<p>When I was in X-ray school, on clinical rotation, we get a call saying a victim murdered by a man with a machine gun was coming into the morgue. They needed the body completely X-rayed for the trial. The man, a young attorney, was gunned down by a man whose mother was a client. She had died and left him nothing. First he killed her dog, then took its lifeless corpse with him to the attorney’s office and gunned him down. I dreaded the thought of xraying a dead man, ended up helping a radiologist do a liver biopsy instead. I was dreading going to the Unit and being anywhere near John Doe or whoever, whatever he was. I’m walking down the long corridor thinking all this and as I pass the morgue door I notice black dirt tracked in from the door where they bring bodies from the hearses into the morgue to be pronounced dead by the ER doctor. Whatever. Have fun housekeeping.</p>\n\n<p>I get to the unit, head to the doorway that has the lights on and go in. There’s one nurse that was standing by the open window. The bed is empty, the cloth restraints torn apart. I ask her what happened. Well, he was literally on his deathbed all night, she said. His EKG showed “tombstones”, a term she explained that they called a cardiac rhythm that not only looks like tombstones on the monitor, they mean death is usually eminent. She didn’t know who made it or why the decision was made  but they were not to revive him if he Coded, so she let the window open so his spirit could find its way to the light.  I later learned that this nurse was also a “white witch”. </p>\n\n<p>Anyway, I point out they just called a code. Yes, she informs me, but apparently the hospital operator was so excited when contacted, she must have heard the scuttlebutt on John Doe too, she forgot to say Code BLUE which is a security code, not a medical emergency code. He opened his eyes and escaped his restraints AND JUMPED OUT THE WINDOW, she said. But we’re on the 4th floor, so I guess no more Mr. John Doe, I say. Well, not exactly, she says, he got up after landing in a flower bed they’ve been working on, and headed toward the ER side of the hospital. I look and see, illuminated by the nearby parking lot lights, in the flowerbed, dark dirt, like I just saw in the Hall by the morgue. Security is after him, she said. </p>\n\n<p>I arrive back in the ER. The on duty police are everywhere. I find out that Security was hanging in the ER earlier discussing several bodies brought into the morgue earlier that day, torn apart by apparently some type of animal.  And now apparently some of the bodies are missing. I also overhear that witchcraft or demon worshiping paraphernalia was found around the bodies. And apparently the dark clothing of John Doe was splattered with dried blood.</p>\n\n<p>All this happened over 25 years ago. John Doe was never found, his true identity a mystery. Nor were the bodies found. And none of this made the local news. Of course we heard rumors of things happening for years after, but who knows. Anyway we were told to shut up about it and signed non-disclosure agreements. Seems having patients jump out of windows can be bad for business, even if they’re superhuman or whatever. I worked there another 15 years, eventually going full time. Why? The money. But if I’m totally honest, this turned out to be the first of many strange events and even though many were horrible and frightening, some part of me found it irresistible. Anyway, I live even closer to that hospital than before. Found a nice house with some woods behind it. As I sit here writing this, not long after the witching hour, I can barely make out an ungodly howl. I think I’ll go and check it out...</p>\n</div>\n","author":"Slick1ru2"}