{"rank":"2","title":"I thought the broken clock was just a coincidence","id":"8jtdot","url":"/r/nosleep/comments/8jtdot/i_thought_the_broken_clock_was_just_a_coincidence/","time":"1526460264000","body":"<div class=\"md\"><p>I had been on a vacation recently, to a coastal town in Southern India. Unlike most of the large cities, this place was peaceful. We stayed at a resort by the beach and the view was stunningly beautiful. </p>\n\n<p>The weather was extremely hot during the daytime but the nights were pleasant. As the resort was fully booked, we were checked in to an old villa by the farthest edge of the resort. The villa was spacious and well maintained but it has that weird rusty smell like in old empty buildings.</p>\n\n<p>We had planned to just hang out in the villa during the daytime to avoid the sun and spend time talking about our lives and goals that we wanted to achieve. We planned on playing board games, cards, or truth or dare. A few games that we loved. On the third day, while playing cards is when I noticed the clock in the living room which had stopped working at 2:15 pm. I looked at my phone and it was 2:15 pm and I laughed at the co-incidence and pointed it out to my friends as well. </p>\n\n<p>The day went on and we got back from the beach shacks late in the night. I locked the door, turned on the lights and I saw the clock, still broken, but it had stopped working at 3:05 am and I looked at my phone and guess what, it was 3:05 am. This freaked me out. </p>\n\n<p>I do not watch horror movies as it keeps me awake at nights. I am that kind of a person and this incident had scared me to the bone and I couldn&#39;t think of what to do. What I hadn&#39;t realized is that I was frozen staring at the clock. It did not tick and that is when I realized that my friends weren&#39;t moving either. None of them were talking, no sound what so ever from anywhere. </p>\n\n<p>I wanted to look away but I found myself not able to do that. I don&#39;t know how much time had passed, but I heard a faint shrill. I was completely aware of where I was but I wasn&#39;t able to understand what was happening. The clock was still not ticking and the shrill scream grew louder and louder and then I saw the second&#39;s hand on the clock tick once and then complete silence once again. I was shouting my guts out for help. I knew I was screaming but nothing seemed to get me to look away from the clock. </p>\n\n<p>Still horrified, I was trying to comprehend what was happening and I heard the scream for the second time but it was sharper and seemed to be a lady&#39;s voice screaming, &quot;How dare you stop me&quot;. </p>\n\n<p>I had never felt fear like I did that day. The only thought that was running through my mind was that I was gonna die.  I don&#39;t know what happened the next moment but I had managed to look away and all the sounds from the surrounding came back. My friends had experienced something too. I could see the horror in their eyes.  We ran out of the villa with all that we could grab. </p>\n\n<p>We made up some excuses and the owners of the resort gave us another place to stay. We didn&#39;t dare see any more clocks there. It&#39;s been a month since that incident took place and I am scared to see any wall clock even now. I think I might have stopped time and it angered her but I cannot be certain. It gives me chills everytime I think about it and I just hope I forget about it soon. </p>\n</div>\n","author":"sourcedexter"}