{"rank":"4","title":"Tweed Tunnels. Nyack, New York","id":"8jtr9m","url":"/r/nosleep/comments/8jtr9m/tweed_tunnels_nyack_new_york/","time":"1526465345000","body":"<div class=\"md\"><p>I was visiting my friend Adam in the Hudson River Valley. We enjoyed hiking, climbing, and checking out the ruins of old Dutch farms and condemned mountain resorts. I’d never heard of the Tweed Tunnels until he told me he was taking me there. They were located in a state park, so I figured it wouldn’t be as sketchy as the times when we trespassed on private land to go see a ruined castle or the remains of an old stone mill. He told me that the Tweed Tunnels were built in the lead up to the First World War as a military training installation, that they were abandoned soon after. He didn’t tell me any of the legends of the Suicide Tunnels and Hell Holes, until after we had found the entrance to the underground labyrinth, which was merely a hole in the ground between gnarled tree roots.</p>\n\n<p>“There’s an armory room, barracks rooms, and a few tunnels up this way,” said Adam. “I haven’t explored much because I didn’t want to get lost.”</p>\n\n<p>Our flashlights shone the tunnel walls, revealing a variety of profane graffiti that one might expect. Curses, gang symbols, anti-government slogans, etc.</p>\n\n<p>“This place is pretty creepy, dude. I’m feeling a real negative energy down here,” I said.</p>\n\n<p>“Yeah, I know what you mean,” said Adam. “Kids come down here and commit suicide. Supposedly there are storage rooms beneath the tunnels where bodies are sometimes found—from suicides and mob hits. That’s another reason why I didn’t dig around too much last time I was here.”</p>\n\n<p>I shivered, thinking about what it might be like to discover someone’s body. We walked past the entrance to another tunnel, but it looked like it was impassable due to a collapse. Adam dipped into a room, and I followed. I assumed it was the armory room he had mentioned.</p>\n\n<p>“This wasn’t here last month…” said Adam.</p>\n\n<p>I stepped inside and the first thing that I saw was a pentagram on the floor, illuminated under Adam’s flashlight. There were a few melted red and black candles scattered around the barren room. One of the concrete walls was spray painted with a goat’s head with the words ‘Baphomet has risen!’ underneath it. I didn’t believe in the magick of Satanism. After the great Satanic Panic of the 1980s had passed, no one really took much stock in devil worship as anything more than a game that teens played—no more dangerous than using a store bought Ouija board.</p>\n\n<p>“Do you believe in the power of black magick, Adam?” I said it, jokingly, but he looked back at me in such a dead serious manner, that I felt bad about it.</p>\n\n<p>“This isn’t funny,” said Adam. “They might still be down here. Getting knifed or clobbered with rocks by a gang of sick kids is real enough.”</p>\n\n<p>“Okay, chill. Let’s get out of here.”</p>\n\n<p>We left the room and continued down the tunnel, as we could see a small pinprick of light ahead.</p>\n\n<p>“We’ll just go to the end of this main section,” said Adam. “I assume that’s daylight.”</p>\n\n<p>Adam led the way, he hesitated at a rusty metal door, inspecting it for a moment, but then continued on. I stopped at the door, and considered opening it, but Adam stopped me. “It’s not worth it, dude. I’m getting a real bad feeling about this place.”</p>\n\n<p>I paused and waited for Adam to continue on. When he did, I knocked on the metal door. <em>Thud Thud</em>. The sound seemed to pulse through the entire structure. Adam jumped, clutching his chest as he turned back to catch me chuckling at him. I had to do it, he was such an easy scare.</p>\n\n<p>“Dick move, man,” said Adam. He was pissed.</p>\n\n<p>“Sorry, bro.” He turned and continued on toward the square of light at the end of the tunnel, while I followed.</p>\n\n<p>I hadn’t taken two steps when I heard a <em>thud thud</em> on the same door behind me, clearly a response to my knocking. Adam whipped around. I could see the anger in his eyes and he was ready to let me have it, but I think he saw the look on my face because he held his tongue. We froze, staring at each other for a solid minute, listening, before we both heard a shuffling behind the door.</p>\n\n<p>“<em>What is it?</em>” I whispered.</p>\n\n<p>“We gotta get out of here,” replied Adam.</p>\n\n<p>As soon as we began backing away from the door, it swung open and out stepped a goat-headed creature. Our flashlights shook in our hands as we took in the full visage of the bare chested man-thing. I couldn’t describe much of it, as we both turned and stumbled into each other before running for our lives down the passage.</p>\n\n<p>“What the hell is <em>that</em>?!” I managed to scream as we rambled down the tunnel, trying to avoid tripping over rubble and not caring that we were splashing through fetid pools of water.</p>\n\n<p>“It’s following us!” Adam squealed, though it was unnecessary, as I could hear the beast behind me. I didn’t dare look back as I already knew it was close at my heels because I could hear the goat-man’s heavy, ragged breaths.</p>\n\n<p>The light grew ahead of us as we made our way down the passage. I knew if we could make it outside we’d be free. It was still the middle of the day, surely a demonic entity wouldn’t pursue us into the light.</p>\n\n<p>Adam was the first to enter the bright portal to freedom. He was faster than me and had practically dove through the door frame. Seconds later, I followed him in. However, we hadn’t returned to the surface, but a well lit chamber, and inside this room stood four hooded figures bearing long, serrated knives. They tackled us and forced us to kneel before their stone altar. I could smell animal ichor on the stone, which I assumed was from past sacrifices.</p>\n\n<p>Adam was trembling beside me. By now the goat-headed creature was in the room with us, though we could only hear the beasts labored breathing, as our heads were pushed down.</p>\n\n<p>“You two have trespassed upon the sanctum of our Lord. Now one of you must be sacrificed to He Who Has Risen,” said one of the figures.</p>\n\n<p>“Please, let us go,” said Adam, meekly. “We were only exploring…”</p>\n\n<p>An inhuman squeal filled the room, it sounded like something that would come from a tortured animal. It filled me with dread; adrenaline practically oozed from my pores. I panicked, having never before been in such fear for my life. What I did next was spineless, cowardly—but my new Master has come to show me the truth of Being…</p>\n\n<p>“Baphomet has risen! Spare me so that I may serve Him.” I couldn’t believe that I’d said it, nor could Adam, as he looked at me sideways, shocked by my pronouncement.</p>\n\n<p>“It is decided,” said the same hooded figure as before.</p>\n\n<p>With little ceremony, one of the men held Adam’s neck and head against the altar while another slashed his throat. We were eye to eye then, and some of my friend’s blood splattered on my cheek and across my forehead as I watched him struggle, then succumb to his blood loss. The hooded figures tossed me aside as the great goat-headed monstrosity approached the altar and fed upon the blood of the sacrificed. I was soon initiated into their abominable rites. Their Lord and their magick were too powerful to deny.</p>\n</div>\n","author":"EldraziHorror"}