{"rank":"25","title":"More than Snakes and Spiders on an Australian Mine Site (Part 4)","id":"8jtsu6","url":"/r/nosleep/comments/8jtsu6/more_than_snakes_and_spiders_on_an_australian/","time":"1526465868000","body":"<div class=\"md\"><p>If you haven&#39;t already please read previous parts.</p>\n\n<p><a href=\"https://www.reddit.com/r/nosleep/comments/8hmm65/more_than_snakes_and_spiders_on_an_australian/\">Part 1</a></p>\n\n<p><a href=\"https://www.reddit.com/r/nosleep/comments/8hvsz3/more_than_snakes_and_spiders_on_an_australian/\">Part 2</a></p>\n\n<p><a href=\"https://www.reddit.com/r/nosleep/comments/8jb2ng/more_than_snakes_and_spiders_on_an_australian/\">Part 3</a> </p>\n\n<p>“James…” </p>\n\n<p>“James… Wake up…” The voice sounded distant as if I was underwater.</p>\n\n<p>Coldness shocks me awake.</p>\n\n<p>“What the fuck?” I look up too see Baz holding an empty bucket.</p>\n\n<p>“Thank fuck, I thought you were out for the night. You took a heavy hit.”</p>\n\n<p>I stand up, slowly making my way towards Baz. All of a sudden I grab him by the collar, swinging him around and shoving him up against the trailer.</p>\n\n<p>“What the fuck were you doing? Merv is dead! James is fucken gone! You were nowhere to be fucken seen, what were you doing?” I screamed in his face, spittle flying past.</p>\n\n<p>“I… I was hiding in the trailer. I have kids man-” he choked out.</p>\n\n<p>“Merv had kids!” I swung, connecting a blow on his jaw, causing him to slump the ground.</p>\n\n<p>He looked up at me tears streaming down his face “I… I didn’t want to die.” </p>\n\n<p>“Sure Merv didn’t want too either.” I spat at his feet.</p>\n\n<p>I turned away from him, picking up the rifle from where it fell off to the side of Merv. The creature had now been pushed off Merv by Baz and was lying next to him. Up close this thing was even uglier. Its eyes and skin looked like that of a corpse. It had that sickly smell of decay on it as if it had been dead for days. I turned away from it walking inside to gather supplies.</p>\n\n<p>“What are you doing?” Baz was now standing at the door of the trailer, slight red welt growing on the side of his jaw.</p>\n\n<p>“I’m getting Joey.”</p>\n\n<p>“What? No, don’t be crazy man you can’t go after that thing. Anyway you have been out for about an hour. It and Joey are long gone and that thing doesn’t strike me as the type that keeps people alive long. I took the radio out of your pocket the rescue team is approximately an hour away if that, wait for them and then go after it.”</p>\n\n<p>“I’m not a fucken coward like you!” I yelled before taking a breath trying to calm myself down. “I made a promise to make sure he stayed alive and I don’t have any plans to break that. Even if it has killed him I need to see for myself.”</p>\n\n<p>I grabbed a blanket off one of the bunks. Making my way to the exit where Baz still stands.</p>\n\n<p>“Move.” </p>\n\n<p>He steps aside. I walk towards the body of Merv spreading out the blanket over the top of him covering his body. </p>\n\n<p>I take a knee looking into his lifeless eyes for one last time. “I’m sorry Merv... I really am sorry.”</p>\n\n<p>With that I got up. I started walking towards the drag marks made by Joey.</p>\n\n<p>Before trekking into the night I throw one more glance towards Baz, “You coming or not?”</p>\n\n<p>He looks down at his feet to avoid my eye contact. “I… I can’t, I’m sorry.” </p>\n\n<p>“Yeh, that’s what I expected.” With that I turned away and began following the tracks left behind by Joey</p>\n\n<p>I can thank god that Joey was a big bastard. These drag marks were deep, wide and easy to follow.</p>\n\n<p>I had been following the tracks for what felt to be about twenty minutes. Jumping at the slight rustle of every shrub and every moving shadow my eye glanced. I had the rifle at the ready when all of a sudden the tracks lead into an entrance going into the ground behind a boulder. </p>\n\n<p>Staring into the entrance of the tunnel I had never before witnessed such darkness. I could feel the adrenaline ramp up in my blood stream which was good because I had a feeling I was going to need it. Pulling out the flash light I brought I aim it towards the darkness flicking it on watching it struggle to keep the darkness at bay. </p>\n\n<p>I took a deep breath. “I’m coming Joey. You better be alive you bastard.” With that I began my descent. </p>\n\n<p>The tunnel must have only just been wide and tall enough for this creature. Walking along I felt like the walls were closing in on me waiting to suffocate me so the creature can come collect its prey. Every little sound caused me to nearly jump out of my skin but I needed to push on for Joey.</p>\n\n<p>I would’ve got lost down there if it weren’t for the drag marks left behind. Following them I came across many splits in the path, I was basically in a maze. Thank to Joey’s fat arse though I was able to follow where he went every time. </p>\n\n<p>I had been walking for about thirty minutes expecting to see this thing around the turn of every bend. I was starting to lose hope when I faintly heard something up ahead in the darkness. It was a moan.</p>\n\n<p>Not caring about staying quiet or careful anymore I sprint up ahead towards the sound with the light from my flashlight leading the way. As I turned around a sharp turn in the tunnel I came into a large room of sorts. </p>\n\n<p>Scanning my light across the room I shuddered at what I was seeing. Strewn across the room were bones of all sorts of wildlife but that’s not what had me concerned. As my light hit the glistening white of old bones I could see among the mixture of animal bones skulls that were clearly human. Some of these bones looked ancient which could only mean this thing had been alive for a long time and I was standing in its nest.</p>\n\n<p>Suddenly I heard a moan much closer to my right which stirred me from my stupor. Swinging the light around it landed on Joey holding his chest staring at me. His breaths were laboured but he was conscious somehow.</p>\n\n<p>“Joey you’re… thank fuck you’re alive.” I whispered while making my way to him.</p>\n\n<p>“What… the fuck… are you doing here…?” He was in bad shape. “It’s… going to… come back…” </p>\n\n<p>“More the reason to get you out of here mate.” I grabbed his arm throwing it around my shoulder as I lifted him onto his feet. “We gotta go.”</p>\n\n<p>I was ready to get out of here. I began to make my way towards where I had entered as a familiar shriek echoed through the tunnels.</p>\n\n<p>“It’s… coming back… leave me…” Joey muttered as his laboured breathing picked up.</p>\n\n<p>“We get out together, or we both die down here together okay? I made a promise to you so I’m not leaving you behind.” Panicking I began to scan the part of the nest I hadn’t seen yet praying to spot another exit. </p>\n\n<p>My prayers were answered as my light came across another exit tucked away on the opposite side from where I had entered. </p>\n\n<p>Basically dragging Joey behind me I rushed towards it. Both of us standing side by side made it for a tight squeeze as we entered the uncharted territory of the new tunnel. Shoulder scrapping along the wall as I ran with the flash light in one hand and my other wrapped around Joey doing all I could to hold him up. </p>\n\n<p>The luminescent glow of the flashlight was bouncing of the walls ahead of me as I could hear the scurry of something behind me get louder. As I took a bend in the tunnel I came across small streaks of moonlight coming through the roof. Glancing up I could see circular holes leading to the surface looking down I could also see holes leading down. That’s when I clicked that we had been drilling into this things home. </p>\n\n<p>Understanding I was underneath the drill site I picked up the pace hoping that by some miracle I found an exit around this area. That miracle was answered as all of a sudden a white glow could be seen up ahead, there was an exit. Dropping the flash light I felt the floor start to slightly incline as it curved. </p>\n\n<p>Finally making it to the top of the incline I saw a small hole at the top which even this thing must have struggled to get out of. Grabbing Joey with both hands and pushing him through it I heard a loud grunt as he slid out the exit. Diving threw after him I got half my body out as I felt something tightly clasp around my ankle. </p>\n\n<p>Before I could register what had happened I felt a force pull me back. I felt dirt flow into my face as my head bounced off the ground. I was being dragged at an extremely fast pace back towards where I had come from. </p>\n\n<p>With every slam of my head into the mixture of dirt and rock underneath me my vision got cloudier. All of a sudden I felt my my body drag over piles of sharp splintered objects. Laying on my stomach after the movement I glanced to see that I was laying on piles of bones. </p>\n\n<p>Finally understanding that I had been captured by this thing I let my head lull onto the cool surface of bones underneath me finally giving up after everything. </p>\n\n<p>Feeling a strong clawed hand wrap around the top of my shoulder rolling me over onto my back I came face to face with the nightmare that had been haunting me all night.</p>\n\n<p>“<em>Yousss… killed... my… friennnd</em>” Its faces inches from mine. I could smell the decay as its warm breath caressed my face.</p>\n\n<p>“Fuck you!” I spat in its face struggling to fight the darkness enveloping my vision.</p>\n\n<p>It let out a loud howl as it raised its hands above its head preparing to end me.</p>\n\n<p>Suddenly something that sounded like thunder rang out through the room accompanied with quick bright flashes. The sound was deafening but looking at the thing above me all of a sudden I saw little mists of black spewing from this things chest leaving behind craters where its skin once was. It convulsed shrieking in pain before finally tumbling down next to me where after a few twitches it ceased to move. </p>\n\n<p>All of a sudden bright flashlights flooded the room accompanied with the shuffle of heavy boots. </p>\n\n<p>Through all the commotion I heard. “The target is down and the civilian is secure. I repeat target is down.” </p>\n\n<p>One of the flashlights shone in my face as the person behind it began to approach me “You okay buddy?”</p>\n\n<p>“I think so.” I muttered as the darkness in my vision fully enveloped me and I lost consciousness for a second time that night.</p>\n\n<p>When I woke up to I was staring at a blinding white ceiling above me. Adjusting to a setting position I looked down too see I was lying in a hospital bed of sorts with stark white curtains surrounding me. </p>\n\n<p>“Where the fuck am I?” I mumbled too myself.</p>\n\n<p>“Holy shit, he’s alive!” All of a sudden to my left the curtain swung open to Joey lying in a similar bed. His chest was almost completely covered in bandages. “What you reckon makes me look like a bad arse?”</p>\n\n<p>“Where the fuck are we Joey? What happened?” </p>\n\n<p>“I can answer that.” An authoritative voice came from the entrance of the room as a man in a full black suit walked in. “Hi, good to see you are both up. I’m John Smith. I work for a specialized government organization.” </p>\n\n<p>“What government organization?” I replied. </p>\n\n<p>“That isn’t important.” He walked up to our beds placing down documents on each. “Here you will find a statement I need you to sign that states that while working on Drill Site Four some equipment malfunctioned which claimed the life of one Jason ‘Merv’ Mervin and left you both severely injured. If anyone ever asks you what happened this is what you will reiterate to them. Nothing less and nothing more.” </p>\n\n<p>I sat there mouth agape. I didn’t understand what was happening.</p>\n\n<p>“That’s fucken bullshit! It was no fucken accident! We were attacked my some fucken monster and you want to bury it!” He struggled to stand up to meet John’s eyes. “Fuck that! I’m not signing this shit!”</p>\n\n<p>“It would be unfortunate for a second individual to have also perished in this tragic accident.” A smile flashed across his face showing the first sign of emotion since he had walked in.</p>\n\n<p>As they were staring each other down I laid my hand on Joey’s forearm. Getting his attention I looked up to him with a pleading look in my eyes. “We have to sign it Joey.”</p>\n\n<p>Through clench teethed he muttered. “This is fucked.” As he turned signing the papers picking them up and slamming them into John’s chest before lying back down clearly done with this conversation.</p>\n\n<p>“Glad to see you guys have made the right choice. I inform you that you will be heavily compensated for the tragic event that you have both been involved and I thank you for you cooperation.” </p>\n\n<p>With that he turned and walked out the door and we never saw him again.</p>\n\n<p>We both eventually got out of that place heading back home. That is where I am today, sitting on my laptop typing this up.</p>\n\n<p>Now I agree with Joey this is all bullshit. Merv didn’t deserve what happened to him. Joey was always a hot head though and I knew there was a better way to do this. I have sent a letter to Merv’s wife informing her of the true events that took place that night. I do not know what consequences I face from what I’m doing but I do know that I am doing the right thing.</p>\n\n<p>I have also posted this for you guys as a warning. Beware as there are a lot more dangers than just wildlife in the Australian outback and someone doesn’t want the world to know about them. </p>\n</div>\n","author":"Korijay"}