{"rank":"5","title":"Man in the mirror","id":"8jtu0n","url":"/r/nosleep/comments/8jtu0n/man_in_the_mirror/","time":"1526466276000","body":"<div class=\"md\"><p>He&#39;s just...standing there. He&#39;s wearing a torn up dark jacket over a grey shirt. His jeans have been patched up with random material, and his shoes are covered in mud. He&#39;s around my height. In fact, I could almost swear he&#39;s wearing clothes that I had thrown out a week ago.</p>\n\n<p>I don&#39;t know how to react. He&#39;s just staring at me. But every time I look back, he&#39;s not even there. I look back into the reflection, and he&#39;s still standing across the room from me. But as I look back again, he&#39;s still not there. I stare at the reflection for a while. There are some other noticeable differences from the reflection and reality. Not only is the man not in my room, but the time on the clock reads 00:07, whereas the clock in the reflection reads 00:09. The other noticeable difference is that I&#39;m standing closer to my bed in the reflection than I am in real life. my phone is also lying on the ground next to me in the reflection, as opposed to sitting on my bed. suddenly, I see something move in the reflection. The man in the reflection, he says something, but I don&#39;t hear what he says. I look behind me again, only to find no man behind me. I glance at my clock, it now reads 12:08.</p>\n\n<p>I&#39;m unsure of what to make of this situation. I don&#39;t know if I&#39;m dreaming. Maybe I&#39;m hallucinating? But can something that seems so inconceivable feel so...real?</p>\n\n<p>As I am lost in thought, while still staring at the reflection, an alert goes off on my phone. The sound of the ringer breaks the silence in the room, and nearly scares me half to death. I unlock my phone to find a new email from someone. I check who sent it. The sender was me. The message simply read: &#39;run&#39;.</p>\n\n<p>I check the reflection again. I nearly have a heart attack from what I witness. The image is so shocking that It feels like I can&#39;t breathe, like I can&#39;t move. I drop my phone and stare in awe at the reflection. I&#39;m now lying dead on the floor, with blood leaking all over the carpet. The man. The man is now missing from the reflection.</p>\n\n<p>Suddenly, I hear a noise come from behind me. I take a quick glance at my clock. It now reads 12:09. I then slowly turn around. The man. The man from the reflection is standing there. Outside of the mirror. He opens his mouth, and this time sound comes out. All I hear is gibberish though. I can&#39;t really make out what he. says. I&#39;m too shocked to really care about what he says. I&#39;m too focused on the fact that he has a knife in his hands, and that he&#39;s slowly walking toward me. I&#39;m too focused on the fact that he has a striking resemblance to someone I know, to someone I once knew. Or maybe it was to someone that I am yet to know.</p>\n\n<p>Actually, I think I know what he said to me. It was something along the lines of:</p>\n\n<p>&quot;There can only be one&quot;</p>\n</div>\n","author":"_Illegal_Carrot_"}