{"rank":"12","title":"A weird incident with my grandson","id":"8jtwml","url":"/r/nosleep/comments/8jtwml/a_weird_incident_with_my_grandson/","time":"1526467218000","body":"<div class=\"md\"><p>Sorry for being silent - my audio recorder is not working for some reason when I&#39;m trying to play and write the story of John in the dark dimension. Next one is ok, but the dark dimension makes the device malfunction. My friend took it for repair, let&#39;s hope for the best. For some reason, I don&#39;t have clear memories of it either...</p>\n\n<p>Anyway, while I&#39;m waiting, I decided to call my grandson via Skype. And he told me about a weird incident with him - anyone experiencing a similar thing, or just having any suggestion what happened? I would be really grateful as I got worried. Also, the usual disclaimer applies - sorry for my English, it&#39;s hard to improve at my age.</p>\n\n<p>A bit of a background, my grandson is 30 years old, recently married and living in the capital of my country. I and my wife live in a big city 2 hours away. While I&#39;m in the USA, my wife has a caretaker because she can not be alone. My grandson and his wife are working as Linux system administrators and also busy most of the weekends and do not come to visit us often. I also have a younger granddaughter, at the age of 18.</p>\n\n<p>Yesterday was a Tuesday in my timezone and he was supposed to be at work. However, he told me he woke up in a bed for guests... in my home. He was very confused and for some reason scared, but soon the feelings disappeared. My wife and I were waiting for him for breakfast. We started eating and our granddaughter came too. My grandson was still very confused when apparently I told him that we are so grateful to have them visit us on a working day. He wanted to say that there is something wrong as he is supposed to be at work in the capital AND that I&#39;m in the USA. But he couldn&#39;t say it. He got distracted and forgot about this though. (he remembered details much later).</p>\n\n<p>They were spending the day relaxing in the house, watching TV, etc. My grandson was wondering a few times why his wife is not with him, but quickly he forgot those thoughts. At random he felt fear and dread, but those feelings again disappeared very fast. After lunch, he decided to check Facebook messenger for any messages from her, but there were none. She was not on his friends&#39; list! He got worried... but again quickly forgot. He checked later his profile, but he was not listed as married. Again his worries disappeared... like erased with an eraser. Later he remembered about her again and asked my wife - she said that he must have got confused as he never married. Again the worries disappeared and he forgot what he was talking about.</p>\n\n<p>I and my wife were telling him that he should be well prepared for dinner - to take shower. He asked if they expect guests, but &quot;I&quot; said no. And repeated that he must be very clean for dinner.</p>\n\n<p>My grandson asked if there is time to work a bit, and my wife told him that he was an hour. His laptop was with him, but he could not remember a single server that he could log in via terminal too. He did not have any files at all on his computer. He thought it&#39;s strange that I and my wife have wifi, but again the worries disappeared.</p>\n\n<p>At some point, my grandson managed to remember one IP address. He recorded it in a document, and file disappeared... He got worried... and forgot the IP. However, by chance, he managed to recall it later, downloaded the terminal application and decided to connect to it. He remembered password too.</p>\n\n<p>Connection failed, it said IP was not existing. But he tried one more time and managed to log in. There was a new mail for his administrator account from an unknown user. He tried to read it several times, and always there was a problem - connection dropped, wifi stopped, mail program crashed... He was very patient, and when he finally read the message, he panicked:</p>\n\n<p>&quot;WAKE UP\nPLEASE WAKE UP\nYOU HAVE TO WAKE UP IMMEDIATELY\nLove, (his wife&#39;s name)&quot;</p>\n\n<p>He stood there, shocked. &quot;I&quot; came to see him in the study room and insisted that he goes to shower immediately as dinner cannot be late. He told &quot;me&quot; he knows everything and demands to wake up. &quot;I&quot; stabbed him with a knife...</p>\n\n<p>And he woke up, on Tuesday morning in his bed at his home, next to his wife... After the initial shock, he woke her up and told her what happened. She had no memory of such event and assumed he just dreamed. But then she screamed when she saw blood in bed - blood was coming from the wound from the knife &quot;I&quot; used on him.</p>\n\n<p>They went to the hospital, and he is ok now, back at home. The wound was exactly from knife, and very fresh.</p>\n\n<p>But I&#39;m very confused. Working with dimensional travel, have no idea what this could mean. Would be really grateful if you can share some ideas.</p>\n</div>\n","author":"Dry_Nature"}