{"rank":"2","title":"Stadler House: Book One: Chapter Seven","id":"8jujzz","url":"/r/nosleep/comments/8jujzz/stadler_house_book_one_chapter_seven/","time":"1526474104000","body":"<div class=\"md\"><p>John pauses as an expression of confusion forms on his face. He detects wet CRUNCHING and GROWLING sounds in the direction of the dark corner of the game room, “The hell?” He approaches cautiously stopping to place his ham sandwich and glass of milk on the small table near the end of the sofa furthest from the darkened corner that holds his attention, “Tyler?”</p>\n\n<p>John’s thoughts race to his past as it all seems to become all too real. A past full of abuse and torture at the hands of his protector. He sees something in the shadows inside the corner of the room, “The fuck?”</p>\n\n<p>The shadows coals into a very familiar shape without fine definition.  “You Afraid Boy?” a voice from his past echoes inside John&#39;s head. The color drains from the young man’s face as he shakes his head in defiance of what he sees, “who are you?”</p>\n\n<p>The Shadowy form of a man lights a cigarette and takes a long puff. The illumination of the red tip of the cigarette reveals no features of the Shadow Man. The Shadow Man exhales a long steady flow of smoke, “Don’t you recognize family, boy?”</p>\n\n<p>The remaining darkness of the shadowy corner fades revealing two large dog-shaped shadow creatures chewing and tearing at Tyler’s remains. The horrified expression of his fate still hangs on Tyler’s face. The creatures give pause to their meal and turn their attention to John, as they both release long low guttural growls. </p>\n\n<p>“Tyler,” John whispers as shock takes hold of the young man’s awareness of his situation. He quickly snaps out of the stupor that has claimed him. He steps back away from the shadow man and creatures that now stalk him. John covers his nose and mouth to stop the assault of the pungent metallic odors that he only now recognizes as the remains of his friend Tyler.</p>\n\n<p>The Shadow Man walks directly towards John remaining veiled in his shroud of darkness, “I see you’re still playing at being a man.” The Shadow Man flows through the sofa losing no momentum until stopping just feet in front of John, “Well, aren’t you gonna run. That’s what you do isn’t it?”</p>\n\n<p>John’s confusion turns to anger summoning the strength to yell at the Shadow Man, “You Shut Up. You don’t know me.” John snatches a billiard stick from the rack and takes a bold step towards the Shadow Man, “Fuck You, then come get me.” John swings the billiard stick at the Shadow Man but becomes concerned as it passes through him.</p>\n\n<p>Shadow man takes a long slow drag from the shadowy cigarette then exhales and chuckles at the young man’s attempt to inflict injury upon him.\n“You forgot all about Uncle Paul’s lessons?” The Shadow Man pats his right thigh calling the dog-like creatures to his side, “You remember my puppies, don’t you?”</p>\n\n<p>John’s face contorts with fear, “No. Paul was put in prison. You can’t be him.” John tries to create distance again between him and nightmare that has manifest before him. “Paul’s dogs killed my dad and almost killed me,” tears of horrific torture stream down John’s face.</p>\n\n<p>The doorknob of the game room wiggles catching both John and the Shadow Man’s attention. John and the Shadow Man look to the opening door. Anna enters the room and closes the door behind her. “Go get help,” John pleads with Anna.</p>\n\n<p>Anna smiles ghoulishly and runs her hand along the wall. She slowly crosses the room until behind the Shadow Man. “Go Get Help. Why are you just standing there?” John points to the door as he pleads again with Anna. John moves against a wall as the dog like shadow creatures corral him, “Anna, stay away from them! They killed Tyler!”</p>\n\n<p>Anna strolls to the dog like shadow creatures and kneels to pet the creatures, “It’s okay John they are not going to hurt us... Well, me anyway.” Anna glares at John. Her hair turns white and her eye becomes dark soulless voids, “John, they stole you from us. You know you’re not part of this world. We are here to take you home.”</p>\n\n<p>“The hell with this!” John runs for the door only to have one of the dogs like shadow creature block his escape. The large dog-shaped shadow creature snarls and growls at John. He steps backward away from the creature bumping into the wall opposite the door to the house. He searches the room for another exit but finds none. “What are you?” He pleads with Anna.</p>\n\n<p>The Shadow Man walks towards Anna only to fade into Anna’s body. “Ankou, but you may call us, Anna. We collect those who cheat death,” Anna states as the corners of her mouth become a twisted grin. Anna smiles and rubs the head of one of the dog-like shadows, “You were never supposed to survive that dog attack.” </p>\n\n<p>The dog-like shadow creature separates itself into four equally terrifying creatures of immense size and ferocity. John stands in terror watching the dog like shadows, as one keeps him from fleeing. John lowers his head and tears stream down his cheeks, “Please, I don’t want to die.”</p>\n\n<p>John raises his head to watch Anna cross the room stopping next to him. Anna reaches out past the shadow dog creatures and takes John by the hand, “Come on now, John. It will only hurt for a moment.” Anna chuckles devilishly at John as he pleads, “Wait. What?”. </p>\n\n<p>The four shadow dogs pounce on John driving him to the ground with a THUD. John screams incoherently and raises his arms defensively in front of his face. Each shadow dog grabs one of his limbs and rips and tears at it. He pulls against but their strength is beyond his mortal frame. The last circles his head but does not strike. Instead, it looks to Anna patiently waiting for her command. </p>\n\n<p>John screams out in pain and agony as his flesh begins to separate and pull from bone under the sharp teeth of the shadow dogs. He begs for the shadow dogs to stop but no quarter is given as his lower left leg separates from his body. The shadow dog drags his lower leg away to consume it. John drops his head back against the hard floor of the game room. </p>\n\n<p>John opens his eyes to see Anna standing above him, “Nice to have you back, “John.” Johns eyes slowly blur as he feels his abdomen rip open under the powerful jaws of the shadow dogs. Everything goes dark as out of the corner of his eye he spots the last dog rush towards his neck. </p>\n\n<p>Anna pops up and happily skips to the end table holding John’s last meal. She pauses remembering her promise to bring Emily a drink back when she returns. She picks up the glass of milk, turns off light, and finally exits the game room. The wall holding the light switch ages, rots, and crumbles down to the studs beneath her touch.</p>\n\n<p>Across the group home in the master bedroom, Maggie quickly sits up with an expression of confusion as she looks around the room. Maggie pushes against Dr. Stadler, “Are you awake?” Dr. Stadler groans and pulls the blankets over his head. “Did you hear that?” She asks still examining the room for signs of what created the noise that awoke her.</p>\n\n<p>Doctor Stadler throws back the blanket and kisses her on the neck, “I am sure it was just the storm. Now go back to sleep.” Maggie pushes him away and looks around the room, I&#39;m “serious, Stephen, I know I heard something.” Dr. Stadler attempts to caress Maggie but she pulls away. “Fine I’ll go look,” He insists. </p>\n\n<p>Maggie points to the door, “Go.” She retrieves a flashlight from her nightstand and passes it to him. Dr. Stadler groans and exits the bedroom. Maggie leaps to her feet, closes, and locks the door behind him. The sudden boom of thunder and lightning frighten her causing her to leap back into bed. She shivers in fear pulling the blanket close around her.</p>\n</div>\n","author":"roger75lee"}