{"rank":"1466","title":"Everything Around me is Aging.","id":"8jukvd","url":"/r/nosleep/comments/8jukvd/everything_around_me_is_aging/","time":"1526474337000","body":"<div class=\"md\"><p>I am a danger to everything and everyone around me. For a while, I thought I was going crazy, but there’s no denying it now.</p>\n\n<p>It all started with an apple. I was late for work again, and I’d picked it up in place of breakfast as I rushed out of the door. Crisp green skin cracked between my teeth as I secured it in my mouth, whizzing around with too many bags and not enough hands as I fumbled to lock the door.</p>\n\n<p>As I fidgeted with the keys, my teeth slipped through brown mush. The apple fell from my lips and hit the ground with a soft crunch as it nestled into stone chippings. What remained in my mouth was like paste. It was a gritty, rotten mash, and I spat out brown globules onto the floor and scraped it from my tongue. As I walked to the car, I caught site of the discarded apple. A perfect bruise surrounded where I had bitten through the skin, which had started to shrink in on the hole like melted plastic. The yellow flesh had turned a sickly brown. You would have been forgiven for thinking it had been there for hours.</p>\n\n<p>At work, I opened a can of coke to find it flat when I went to take a sip. My fresh, out-of-the-box sandwich was stale right through to the cheese that cracked like chocolate when I tried to take a bite. When I hit the afternoon slump, I made coffee that boiled in the kettle but was cold when I tried to drink it. I knew something was seriously wrong, so I sent myself home with the ‘bug that everyone’s getting.’</p>\n\n<p>I got home and took a long shower - ignoring the green slime that grew on the porcelain under my feet – and went to bed early.</p>\n\n<p>Things were worse in the morning. Green and black mould had grown vigorously around me overnight. I woke up next to a thick black circle as big as my hand with lots of long, tiny needles with black beads at the end. They popped spore-clouds into the air, and then regrew at an incredible rate. I jumped out of bed, holding in the urge to be sick, and investigated the fungi from afar. I decided very quickly that I was going to buy a new mattress... and new sheets, too.</p>\n\n<p>I wandered downstairs with this bizarre string of events in my mind, and messaged my girlfriend that I was ill, not to come over tonight, and that Game-of-Thrones would <em>have</em> to wait until I was feeling better. My phone had been charging all night, but died just as the message was sent.</p>\n\n<p>I opened the fridge, and the smell hit me first. The entire contents were beyond gone-off. Milk had separated in the carton, chicken was growing <em>something</em> from beneath the packaging, and the whole thing was disgusting and coated in a layer of slime. I slammed the door in confused anger when, in a moment of horrid realisation, picked up a sunflower I had been growing from the windowsill.</p>\n\n<p>I had been nurturing the plant for the past few months, and I watched in frightened anticipation as new leaves grew upon the old. The plant grew taller and taller in my hands, until a small flower bud erupted from the stem and unfurled to reveal a radiant head. In seconds, the petals wilted and dropped from the dying flower. I shakily placed the pot back on the shelf and sunk into the sofa. Perhaps I should have called the police, but what was I going to say?</p>\n\n<p>When Maddy arrived I was in the middle of a horrifying experiment. I was sat on the grass out at the back of the house, staring at the blades. My path from the back door to where I was sat was marked out by long, unkempt grass.</p>\n\n<p>I sat, and I stared. It was undeniable.</p>\n\n<p>The area of effect I was producing was getting bigger. All around me, every twenty seconds or so, long grass was growing, seeding, germinating, and regrowing. It was kind of beautiful, like a wave that would erupt from between the dead, yellow grass to breathe... and then sink back into itself, adding to the layer that had accumulated. Every time this happened, the area was larger. More grass was joining the cycle.</p>\n\n<p>Maddy hesitantly approached me from behind. “Danny? What’s going on?”</p>\n\n<p>I spun around and leapt to my feet. “Woah, stay back!” I ordered, throwing my palm up to keep her from coming any closer. I retreated until my heels kicked at the wooden fence in my small garden, and the radius of growth moved with me. “Why are you here? I said not to come.”</p>\n\n<p>She put her hands up in surrender, “Okay,” she said, ducking her head. “Just... I thought you might have wanted me to look after you. Jesus, what’s going on?”</p>\n\n<p>She looked at me poignantly, and I threw my hands up in resignation. “I...” I stuttered, blubbering a little, “I don’t know.” I slid down the fence until I was sitting on the long grass, and let my head fall onto my knees. “Everything around me is... aging.”</p>\n\n<p>She watched the grass surrounding me come to life and flourish and die in seconds. I could see her wracking her brains. “Okay.” she eventually said, “Tell me what’s happened.”</p>\n\n<p>Emotion bubbled up inside me, and I started to cry. I lifted my head from my knees, and Maddy was giving me that ever understanding, sad smile. However, I was about to start when the smile quickly faded from her face, her eyes widened and her jaw dropped.  “Danny?” she whimpered.</p>\n\n<p>As I had started to cry, the grass had begun to grow and die faster than ever; each new growth erupting into life like white horses in a rough sea. I watched as my area of effect began to expand outwards, no longer at a snail’s pace, but spurred on by an unseen force. It lifted up new blades of grass into the cycle like dominos as it broadened its reach. Maddy used her heels to push herself backwards along the grass until it nipped at her shoes and she whirled around to run for the door.</p>\n\n<p>She grabbed onto the door handle. I shouldn’t have said it, but I did.</p>\n\n<p>“Please.” I cried.</p>\n\n<p>Like a small bomb, a shockwave raced out from me. Ivy grew up the sides of the house and rooted itself into the cracks in the walls, and the entire garden burst to life in a ripple that went over the walls and fences that I could see.</p>\n\n<p>Long, brittle hair grew down Maddy’s back until it swayed by her hips over threadbare clothes.</p>\n\n<p>With great effort, she limped around to look at me. Jaded eyes sat above large dark half moons, and her face displayed a wisdom I knew she hadn’t earned. Wrinkles lay etched into her skin, along her brow, her cheeks, and down to her chin.</p>\n\n<p>A gnarled, liver spotted hand reached out to me, fingers weighted down by disgustingly long nails. A sad smile overcame her face one last time, and she took one long, wheezing breath.</p>\n\n<p>She fell to her knees with a crack and a whine as the wrinkles in her face grew deeper. Her hands knotted and her back arched over into a hunch. Her hair went grey and her skin wrinkled like leather before she finally looked up at me one last time, and let her face fall to the floor.</p>\n\n<p>I was utterly petrified, as still as a statue up against the time-worn fence. Once my body finally allowed me to move, I silently waded to my girlfriend through years and years of dead grass.</p>\n\n<p>She was dead. Her skin was still growing taught around her body as she started to mummify by the back door to my house.</p>\n\n<p>I let out a long, single wail. A howl that couldn’t possibly display the pain I felt. As the anger overtook the sadness, the howl became a shout. This wasn’t fair!</p>\n\n<p>“NO!” I shouted to the sky. I screamed again, louder and in utter despair. And then another blast ripped out from me.</p>\n\n<p>The whole world fell silent.</p>\n\n<p>When I tore myself away from the skeletal figure on the floor, I made my way outside.</p>\n\n<p>Everyone and everything was dead. It’d been dead for years. Bodies were in cars that had freewheeled into walls or rusted to a stop, they were lying in the street with their dogs, leash still around their necks. They were in shops, cafes, offices. Flocks of birds had fallen from the sky and carpet bombed the land.</p>\n\n<p>I walked, and I walked, and I walked. When I finally came to the edge of the blast, a huge crowd had gathered, and police were attempting to corner off the entire area and on every street. An officer saw me and started to run into the ruins. “Hey!” he shouted, “You can’t be here!”</p>\n\n<p>“Please...” I whispered, “Please let it stop.”</p>\n\n<p>As he ran towards me, he stumbled and fell to his knees. He continued to move on all fours for a moment, until his arms and legs failed him. He writhed on the floor for a few moments, and then turned around to face the sky as a decrepit old man.</p>\n\n<p>I ran home. I’m writing this so that you all know what happened. I don’t know how many I’ve killed, but just know that I never wanted any of this to happen.</p>\n\n<p>I only have one thing <a href=\"https://www.facebook.com/inkdrop/\">left to do.</a></p>\n\n<p>Daniel Joyce.</p>\n\n<p>The below was found in a small town in an undisclosed country, scribbled onto the walls in permanent marker. Over two-thousand people were killed. The case is described as <em>closed</em>.</p>\n</div>\n","author":"chrisbird93"}