{"rank":"614","title":"chastitytemperancecharityDILIGENCEpatiencekindnesshumility","id":"8jupqg","url":"/r/nosleep/comments/8jupqg/chastitytemperancecharitydiligencepatiencekindness/","time":"1526475637000","body":"<div class=\"md\"><p>&quot;You only get what you put into something.&quot;</p>\n\n<p>That was my father&#39;s favorite saying. And god damn he was right. I failed at almost everything in my life because I had never given anything any sort of effort. </p>\n\n<p>Until I had a gun stuck up my ass and a cartel thug threatened to blow my balls off. </p>\n\n<p>Everything comes into clarity when you are bound gagged and naked in a wicker chair. I had worked for the Illinois cartel for almost 19 years and racked up an outstanding debt of nearly 13 million dollars. </p>\n\n<p>That was the day that my boss was ready to collect from my sorry ass. And the bullet in my balls was only the beginning, he promised; if I didn&#39;t figure out a way to cough up the money. </p>\n\n<p>Then I remembered the one thing I was good at: chemistry. \nBlame it on my dad for encouraging me to watch Breaking Bad, but I told the boss I could make him the greatest drug that the city had ever seen. And god help me he believed me.</p>\n\n<p>He gave me a month to make a miracle. It only took me three days.\nI called it Nihilism because of what it did to people. Turned them into mindless zombies, blubbering idiots. Even the strongest couldn&#39;t resist its pull. </p>\n\n<p>When I realized what I had made I knew it would change my life. I ran as far as I could and set up my own lab. In less than a year I was the one that everyone came to for their high.</p>\n\n<p>Men, women, old and young I didn&#39;t care as long as I got my cut. I deserved it for all the work I put into the products. </p>\n\n<p>I remember when my old boss came to me, spit dribbling from his lips, his hands shaking and his skin turning a dark gray like some kind of corpse. He wanted more. He wanted to keep taking it until he was nothing more than a festering mass of decaying flesh.</p>\n\n<p>I actually felt sorry for him. So I told him he would have to prove to me how bad he wanted it. I tossed him a knife and told him to show me what mattered most to him. \nI thought he would call my bluff. \nInstead I watched with both fascination and horror as he took the long knife and began to cut around his eye socket. </p>\n\n<p>He jabbed the knife deeper, cutting bone and cartilage. Puss from old sores and blood mixed together as he pulled it out from his face, a string of nerves dangling from the discolored organ. </p>\n\n<p>I had to give it to him, after all that it was what he deserved. \nI may have made Nihilism a bit too strong though. \nMy son has started asking for a few pills here and there, and I&#39;m seeing it take his toll on him. Sometimes he sits at the couch covered in his own urine for hours. He smells to high heaven and his skin is turning black in spots. </p>\n\n<p>It wouldn&#39;t be so bad if he was a little older. But as it is I&#39;m having a hard time explaining to the middle school why my son is missing days so often. </p>\n\n<p>I told the teachers not to worry about it though. It was his own fault and I have tried teaching him. \nYou only get what you <a href=\"https://m.facebook.com/Kyle-Harrison-2120650624830271/\">put</a> into something.</p>\n\n<p><a href=\"https://www.reddit.com/r/nosleep/comments/8i5vzr/chastitytemperancecharitydiligencepatiencekindness/?st=JH6OZQBW&amp;sh=4e2a1457\">CHASTITY</a><a href=\"https://www.reddit.com/r/nosleep/comments/8in119/chastitytemperancecharitydiligencepatiencekindessh/?st=JH6P05DZ&amp;sh=eca1d006\">TEMPERANCE</a><a href=\"https://www.reddit.com/r/nosleep/comments/8jfn63/chastitytemperancecharitydiligencepatiencekindness/?st=JH7TIOAM&amp;sh=8065c7ce\">CHARITY</a>diligencepatiencekindnesshumility</p>\n</div>\n","author":"Colourblindness"}