{"rank":"16","title":"I'm a bartender in the Limbo - Part 5 - The Laughter","id":"8jut5e","url":"/r/nosleep/comments/8jut5e/im_a_bartender_in_the_limbo_part_5_the_laughter/","time":"1526476471000","body":"<div class=\"md\"><p>Emily here.</p>\n\n<p>Apologies for not posting yesterday, I like to write so I had to take a break from my usual stories and jot down something independent. It was the <a href=\"https://www.reddit.com/r/nosleep/comments/8jkwq7/it_came_during_a_snowstorm/\">tale</a> of an old man who had strolled into our bar on a quiet night.</p>\n\n<p>Just for your information, time in the Limbo is different from earth’s. It’s flow of time changes constantly and everyone inside is always unaware of the current time, confused as fuck when they  seemingly drink for hours, only to walk out and see that it had been maybe a minute or a half since they entered the bar.</p>\n\n<p>Because of this, sometimes our bar’s one day stay feels like a whole week or a minute depending on the reality.</p>\n\n<p>Which is why I’m still downing Gray Zones, browsing Reddit while it stormed outside. The rain is always pretty chill. I’ve read all the new posts and checked for updates once I was done. I tried reading my book (The Lady with the Bear tattoo) for a while but it’s gotten into a boring, pages long yammering about some corporation’s corruption. People say that they get sleepy when they start reading a book, seemingly exaggerating their reactions to big bodies of plain, boring text. I now realize that it’s not a joke. The past few pages had me dozing off five freaking times. As you know, if I fall into slumber while in the bar, I would be pretty much offing myself. Trying to get myself up and running, I made myself a Chokehold (see part 3 for the menu). I downed it in one breath and after a few seconds, it felt as though someone had stabbed me in the stomach, rubbed salt on the wound and lit it on fire, only to put it out with lemon juice and then start scrubbing that wound with sandpaper.</p>\n\n<p>Holy shit, this is more than I can take, I should’ve just made myself a Gut Punch. As I fell to the floor, clutching my abdomen which still felt like a million rats feasting on my flesh, I realized my phone was ringing, it was the Boss.</p>\n\n<p>I accepted the call and Boss spoke to me in his usual playful tone.</p>\n\n<p>“Greetings, Emily. How’s the bar?”</p>\n\n<p>“Agh-I-I mean it’s d-doing pretty good you know, c-chilling n stuff…”</p>\n\n<p>“How does an inanimate object chill? Are you okay? You sound like you’re bleeding out. Why would you try to hide the fact that you’re bleeding, Emily? Shouldn’t you call for help?”</p>\n\n<p>Fair point, I thought as my stomach lit on fire from the inside.</p>\n\n<p>“N-No, no, I’m fine. The bar is just as it was w-HAHHH-when you—you left, Boss.”</p>\n\n<p>I slapped myself for that. “You’re pretty fuckin’ sensitive, Emilia” my inner voice said.</p>\n\n<p>Have I told you guys about her? My inner voice? I named her Elimia. She likes cats and when things are set on fire.</p>\n\n<p>No, wait, no, that’s just me being delirious from the pain, snap out of it.</p>\n\n<p>“Huh. Well, Ms.Emily, We both agreed on our contract that you would work here until you paid your student loans and if you had an…” he fixed his throat “An accident, then the establishment and its authorities wouldn’t be responsible.”</p>\n\n<p>“Yeah, yeah, I-I know. Hold on ple-fuck-please. I think we’ve got a client.”</p>\n\n<p>A woman walked in, dripping wet like any other guests this place has to offer. She looked around the bar with an unimpressed look on her face, then, started walking towards the bar counter.</p>\n\n<p>“Good e-evening, miss, can I get you anything?”</p>\n\n<p>“Um.Yeah. I would appreciate it if you gave me…let’s see, ah, a Love Bird.”</p>\n\n<p>“Certainly.”</p>\n\n<p>I got up from the floor. Yes, I know. Don’t mention it.</p>\n\n<p>As I was mixing the drink, the lady took two concerned looks behind her back and turned to face me, a fearful expression on her face. I asked her if something was wrong, still dying from pain. She was about to say something but hesitated.Then after a sip from her drink, she started speaking.</p>\n\n<p>“What do you know about the Hor—”</p>\n\n<p>Something barged in through the door violently and instantly bit down on the woman. The skinny humanoid figure was covered with void black fur, hollow white eyes and a single sharp horn on it’s head. One of the Horneds…</p>\n\n<p>I just watched as it dragged the woman’s corpse out of the bar. Blood smearing the floor as it did.</p>\n\n<p>“Shit. She didn’t pay yet.”</p>\n\n<p>I clicked the hold button again on my phone, my abdomen still getting seared.</p>\n\n<p>“I’m back.”</p>\n\n<p>“Okay then, Ms.Emily. I will keep paying you and you will keep working until your financial status is satisfied as per our agreement. I’ll be coming over this Sunday with a guest, so try to keep things at its best. Goodbye.”</p>\n\n<p>“O-ok.”</p>\n\n<p>I hung up and shook for a while. Then I screamed so loud that if someone was passing through, they would think a homicide was being committed in the bar.</p>\n\n<p>Then I started lying down.</p>\n\n<p>I laid there, on the cold, hard floor for five minutes, catching my breath. Sleepiness was a thing of the past. Still feeling the after effects, I sat back on my chair and tried to continue reading when the bar’s doors slammed open and Vaune strolled in with leisure. She wore her dark gray work clothes which was drenched with mud and rain water. Smells earthy.</p>\n\n<p>“What’s up, Milia, seen any 7”11, blue skinned demons nearby?”</p>\n\n<p>“Uhh, a demon?”</p>\n\n<p>“Never mind, how’s it going? I’m a bit hungover Mil, can you get me a drink?”</p>\n\n<p>“Sure, what do you want?”</p>\n\n<p>“Anything that can soothe my hangover. I drank some hard liquor yesterday, BUT, I still had you and this wonderful bar in my mind as I did, Milia.”</p>\n\n<p>It was obvious she was still a bit drunk.</p>\n\n<p>I bit my lip, held my breath. I had an idea. Barely holding my laughter inside, I mixed a Gut Punch for her.</p>\n\n<p>“What’s this? Looks delicious, is it made from the recipe that mountain dwarf gave you? Whatever, let me at it.”</p>\n\n<p>She took a single gulp and was sent flying back through the front door and I started laughing like a maniac, my stomach churning from the recent incident.  I couldn’t hold anything back, tears were running down my cheeks and I was flushed red from the lack of oxygen, almost dying. I actually felt the Reaper closing in on me but with god’s blessing I finally took a massive inhale and continued giggling.</p>\n\n<p>Vaune, once again, walked in through the door. Her scarlet hair dirty and muddy from the puddle she landed in. She was fuming. Her fury seemed to make her hair even more fire red. But as she walked closer to the counter, watching me laugh to myself like a moron, she started smiling. Then chuckling. Finally, she started bawling with laughter.</p>\n\n<p>“T- (breaths in) That was fucking hilarious! You-huh got me. You-huhuh got me so good.”</p>\n\n<p>I couldn’t even reply.</p>\n\n<p>But as I was wiping off tears of laughter, I suddenly saw something sliding in through the door. It had a pale blue, skinny frame and beady blood-red eyes. It looked like a wolf standing on its hind legs. The wolf creature was tall and its turquoise fur was stained red with what looked like blood. Dripping wet from the rain, the sanguine fluid was seeping into its fur.</p>\n\n<p>The…wolf? Demon? Wolf demon? Suddenly looked at me. Now I don’t know if animals can smile but this one did. It grinned, presumably gleeful that its prey was vulnerable. Then started creeping closer, still on its hind legs. I stopped laughing.</p>\n\n<p>Vaune was still howling with laughter. I patted her shoulder. She was an employee, so it was “OK” in the rule book. Then I pointed behind her, a concerned look on my face. She didn’t stop.</p>\n\n<p>The thing crept ever so close, almost inches from Vaune’s backside.</p>\n\n<p><strong>BLAST</strong></p>\n\n<p>All of a sudden I heard a loud gunshot, a flash of light and blood splattering on the ceiling.</p>\n\n<p>Vaune, still laughing, had decimated the creature’s head. It’s spine could be seen. The head was splattered into 5 pieces, shards of skull stuck to the counter and one of its violent red eyes had landed in a shaker.</p>\n\n<p>.55 Cal, custom-made Desert Eagle with a bible passage inscribed on it. Vaune was holding the piece, still chuckling, tears starting to form in her eye pores.</p>\n\n<p>I realized why Boss hired Vaune to be the bouncer for the bar.</p>\n\n<p>Well, Donny is hospitalized from yesterday’s incident so I’m going to cleaning all the mess Vaune made.</p>\n\n<p>To be continued.</p>\n\n<p>-Emily.</p>\n</div>\n","author":"rantleystalk"}