{"rank":"27","title":"Have you ever reached into a puddle?","id":"8juu4f","url":"/r/nosleep/comments/8juu4f/have_you_ever_reached_into_a_puddle/","time":"1526476718000","body":"<div class=\"md\"><p>Have you ever stared into a puddle? I don’t mean a vacant stare, nor with disgust. I’m talking about studying every bloody detail of it. </p>\n\n<p>&nbsp;</p>\n\n<p>If you have, then you realized plenty of them are so filthy that you just can’t see the bottom of it. Even if it’s only a few feet deep. It’s like a miniature ocean in your face that contains a whole ecosystem of microscopic predators and prey. </p>\n\n<p>&nbsp;</p>\n\n<p>However, to my young sister and her classmates, puddles weren’t simply mild curiosities; they’re portals to the darkest depths of their imaginations.</p>\n\n<p>&nbsp;</p>\n\n<p>I found this out when I arrived early to pick up my sister from elementary school. Her class was still in recess, and there was a crowd gathered on the edge of the playground. So, I walked over the muddy lawn toward her class to see what all the fuss was about.</p>\n\n<p>&nbsp;</p>\n\n<p>“Hey, Lindsey” I said.</p>\n\n<p>&nbsp;</p>\n\n<p>Lindsey’s glare was fixed on the stagnant puddle, as her classmates were chanting in unison.</p>\n\n<p>&nbsp;</p>\n\n<p>“thirty-eight, thirty-nine, forty, forty-one….” the kids mumbled.</p>\n\n<p>&nbsp;</p>\n\n<p>Damn, I didn’t remember kids being so weird when I was young. I grabbed Lindsey by the arm and shook her.</p>\n\n<p>&nbsp;</p>\n\n<p>“Hey! Where is your teacher? I need to sign you out, so we can leave early today.” I asked in an irritated manner.</p>\n\n<p>&nbsp;</p>\n\n<p>Lindsey stuttered and pointed to the puddle.</p>\n\n<p>&nbsp;</p>\n\n<p>“You’re telling me that she’s in the puddle? We don’t have time for this crap…” I muttered to myself.</p>\n\n<p>&nbsp;</p>\n\n<p>“fifty-two, fifty-three, fifty-four, fifty-five…” the kids chanted.</p>\n\n<p>&nbsp;</p>\n\n<p>Yeah, kids have crazy imaginations, but at this point I became suspicious. Maybe her teacher had fallen into the puddle…and maybe that puddle was a sinkhole. After all, it’s Florida and crazy shit always happens here. </p>\n\n<p>&nbsp;</p>\n\n<p>So, I removed my jacket (because Floridians wear jackets when it’s 70 degrees Fahrenheit outside) and reached into the puddle. I reached down into the puddle until my forearm was submerged, and I lied down on the ground. I knew something was wrong when my shoulder was wet, and I still couldn’t feel the bottom of the puddle.</p>\n\n<p>&nbsp;</p>\n\n<p>I cursed under my breath as I dipped my head underneath the surface. Unfortunately, I sucked down some of the rancid, viscous water into my mouth. My tongue felt slimy, and the liquid slithered down to my throat. </p>\n\n<p>&nbsp;</p>\n\n<p>The disturbance was so great that I lost my balance and fell into the never-ending puddle. My body sank lower into the abyss while I struggled to swim back up to the surface. I panicked and gasped – only to realize that I wasn’t being suffocated from the water.</p>\n\n<p>&nbsp;</p>\n\n<p>“Ms. Jenkins?” I called out as bubbles escaped my mouth.</p>\n\n<p>&nbsp;</p>\n\n<p>The water was cold and silent. There was a cylindrical ray of celestial light from the top of the puddle. It was only by this grace, that I was able to see just several feet away from my face. However, that was all I needed to see how odd my surroundings were.</p>\n\n<p>&nbsp;</p>\n\n<p>For instance, the bubbles around me were being pulled to the bottom of the puddle instead of rushing to the surface. The haze of the water was chromatic; the turbidity shifted from all visible colors sporadically. I didn’t see any obvious signs of life, but I didn’t feel alone. Drowning wasn’t a possibility in this new realm. Therefore, it was in my best interest to find Ms. Jenkins by swimming deeper.</p>\n\n<p>&nbsp;</p>\n\n<p>The astral currents were dazzling as they shimmered like rainbows in all directions. I began to suspect that I was no longer conscious and that I must have hit my head hard when I fell into that puddle. Wouldn’t that make me like invincible? Nobody can be hurt while in a dream, right? Unless you’re with Freddy Krueger.</p>\n\n<p>&nbsp;</p>\n\n<p>The guiding light from the opening of the puddle had faded long ago and I trudged on through the darkness. My doldrums were replaced by anxiety as I felt truly alone in the depths. However, I soon learned that I wasn’t by myself.</p>\n\n<p>&nbsp;</p>\n\n<p>I finally made out the bottom of the puddle; there were orbs of blue luminescence that twinkled like stars on the floor. It soon became apparent that the orbs were strategically placed to reveal a series of roads built through an aquatic forest. Yes, I had found infrastructure at the bottom of the vast puddle. The lights were shaped like snail shells and held on strands of kelp that soared meters high from a mixture of sand and soil. The roads were paved from copper-tinted stones that led in all cardinal directions from my position.</p>\n\n<p>&nbsp;</p>\n\n<p>“Ms. Jenkins!” I incoherently shouted underwater.</p>\n\n<p>&nbsp;</p>\n\n<p>The rhythm of the sparkling lights slowed down at the bottom of the pond. The water above me danced like the Aurora Borealis with blending shades of turquoise and the current was dead as a graveyard.</p>\n\n<p>&nbsp;</p>\n\n<p>The copper-tinted roads and the kelp forest wrapped around the base of an algae-covered mountain. The peak of the mountain sparkled like an iridescent pearl. I tried swimming up to the mountain to get a closer look, but I found that endeavor too exhausting. My only option was to traverse through the hidden paths of the kelp forest. </p>\n\n<p>&nbsp;</p>\n\n<p>The safety of the roads was limited; silhouettes of pincers and eyestalks decorated my view of the forest. Every so often, I heard a gargling scream that blasted through the nearby foliage, followed a loud clicking sound that pierced through the forest. </p>\n\n<p>&nbsp;</p>\n\n<p>I only knew the right way when the ground became elevated and I found a steep incline that led to the base of the shining mountain. As I climbed, the road became narrow as it constricted the side of the mountain. The last stretch of road led me to a blinding refraction of light. </p>\n\n<p>&nbsp;</p>\n\n<p>The pearl-white dome structure at the top of the mountain was magnificent like Mount Olympus. Every piece of architecture was polished without a single mark of algae or film. The massive doors were ajar, and I crossed through the threshold to explore.</p>\n\n<p>&nbsp;</p>\n\n<p>There were rows of pew style benches made from stone on both sides of the chamber. A semi-circular stage was at the end of the room with a figure hunched over on the stage. I slowly walked through the aisle, but I stopped halfway through the chamber. The sound of tearing flesh and the cloud of red water that engulfed the figure made my blood freeze. The creature slowly turned its head toward me as my brain terribly failed to process what I observed.</p>\n\n<p>&nbsp;</p>\n\n<p>&quot;Miss....Jenkins?&quot; I cowardly asked.</p>\n\n<p>&nbsp;</p>\n\n<p>Ms. Jenkins&#39; smile slowly crept across her face. At least, the woman looked like Ms. Jenkins but her lower body resembled a serpent. The creature squirmed through the aisle as she approached me.</p>\n\n<p>&nbsp;</p>\n\n<p>&quot;Is recess already over?&quot; The creature asked while her tail slowly wrapped around my legs.</p>\n\n<p>&nbsp;</p>\n\n<p>&quot;Uhh, I think so. Listen, I don&#39;t know what the Hell this place is or -&quot; I explained as I gasped from her tail slowly constricting my legs.</p>\n\n<p>&nbsp;</p>\n\n<p>&quot;Or, like, whatever is going on... I just want to get out of here!&quot; I managed to say just before I pissed myself.</p>\n\n<p>&nbsp;</p>\n\n<p>&quot;Don&#39;t be afraid. You&#39;re very special, do you know that?&quot; Ms. Jenkins seductively whispered as she began to squeeze the blood from my thighs.</p>\n\n<p>&nbsp;</p>\n\n<p>&quot;Oh yeah, sure. Totally cliché.&quot; I sarcastically muttered as an impulse for my potential last words.</p>\n\n<p>&nbsp;</p>\n\n<p>&quot;What?&quot; Ms. Jenkins inquired as she paused from strangling me.</p>\n\n<p>&nbsp;</p>\n\n<p>&quot;Oh, come on! The erotic and charming predator is an abused trope. Like, stop beating the horse - it&#39;s already dead. Just eat me or whatever.&quot; I bravely demanded as I bowed my head and accepted my doomed fate.</p>\n\n<p>&nbsp;</p>\n\n<p>Ms. Jenkins chuckled and her grip slightly relaxed over my body. Her face lit up with color as she smiled.</p>\n\n<p>&nbsp;</p>\n\n<p>&quot;Why would I kill you? Think about it. Do you realize how rare it is for someone to be compatible with this realm? Don&#39;t you realize that you should already be dead?&quot; Ms. Jenkins challenged me. </p>\n\n<p>&nbsp;</p>\n\n<p>&quot;Well I guess so...&quot; I muttered unexpectedly.</p>\n\n<p>&nbsp;</p>\n\n<p>&quot;I&#39;m not going to kill you. I&#39;m going to groom you!&quot; Ms. Jenkins maniacally laughed.</p>\n\n<p>&nbsp;</p>\n\n<p>Ms. Jenkins squeezed hard and scratched her claws across the side of my neck. My blood slowly pulsed from my neck as Ms. Jenkins rubbed her claws over the wound. A deep rush of liquid flowed in and out of the wound like a set of gills.</p>\n\n<p>&nbsp;</p>\n\n<p>I awoke up to a crowd of people standing over me. My wet hair was matted down, and I was soaking wet. I puked up some brown water that was mixed with phlegm. </p>\n\n<p>&nbsp;</p>\n\n<p>&quot;Uhh...&quot; I groaned.</p>\n\n<p>&nbsp;</p>\n\n<p>&quot;It&#39;s alright. I resuscitated you.&quot; Ms. Jenkins said with a honey-sweet voice.</p>\n\n<p>&nbsp;</p>\n\n<p>My short-lived relief was spoiled when I felt the crushing ache and the jagged scratches around my neck.</p>\n\n<p>&nbsp;</p>\n\n<p>&quot;Now you take good care of your brother, Lindsey. OK?&quot; Ms. Jenkins calmly asked.</p>\n\n<p>&nbsp;</p>\n\n<p>&quot;Yes, Ma&#39;am.&quot; Lindsey answered with a sullen voice while she anxiously kept her arms close to her chest.</p>\n\n<p>&nbsp;</p>\n\n<p>&quot;See you soon.&quot; Ms. Jenkins said before I meekly feigned a smile as we departed.</p>\n\n<p>&nbsp;</p>\n\n<p>Ms. Jenkins was right. There was a large storm over town for the next few days that brought tons of rain. There were plenty of puddles for Ms. Jenkins to conceal herself. It didn&#39;t matter if I walked to my car after a late shift at work, or if I went grocery shopping in the evening. Ms. Jenkins&#39; serpentine silhouette was always visible from a puddle&#39;s edge as she gestured with a webbed hand to move towards her.</p>\n\n<p>&nbsp;</p>\n\n<p>&quot;Aren&#39;t you ssssscrumptious?&quot; Ms. Jenkins hissed with forked-tongue as she teased me.</p>\n\n<p>&nbsp;</p>\n\n<p>My true fate was intertwined with Ms. Jenkins’ nefarious schemes. Over the next few months, I ensnared many victims for Ms. Jenkins’ unyielding appetite. It’s easier to do than you think; all I had to do was snatch unsuspecting pedestrians from the sidewalk as they walked home in the rain. Almost nobody ever sees it coming, and those that do have wild eyes as they see a webbed hand grab them by the ankle and drag them into the puddle. Yet, somehow, I’ve resisted the urge to feast since my transformation has gradually worsened. </p>\n\n<p>&nbsp;</p>\n\n<p>“You’re just not ready yet. You’ll see.” Ms. Jenkins scoffed at me while her fangs sliced through her prey’s corpse.</p>\n\n<p>&nbsp;</p>\n\n<p>So, this is it. This is my last shred of humanity – and my final warning – that I offer to you. Heed my advice and stay away from puddles if you can. Perhaps, some of you will search for our world yourselves in belief that you are destined for it too. In that case, if you are so lucky to be chosen, then I can’t wait to embrace you with my <a href=\"https://old.reddit.com/r/Torpenta/\">fins.</a></p>\n</div>\n","author":"Torpenta"}