{"rank":"9","title":"I heard a whisper in my ear during an exam","id":"8juw7n","url":"/r/nosleep/comments/8juw7n/i_heard_a_whisper_in_my_ear_during_an_exam/","time":"1526477223000","body":"<div class=\"md\"><p>My school is fairly new, and to my knowledge, no one perished during construction, no on-campus suicides (that I know of, at least), and there was never any ghostly rumours that seemed convincing enough to prevent students from walking into that awkwardly positioned toilet of the emptiest hallway. I&#39;m also not one to believe in ghosts. </p>\n\n<p>So an hour and a half into recalling mathematical formulas and aggressive calculator-button-punching, you can imagine my surprise when I felt a breath hot on my left ear. </p>\n\n<p>You see, in an exam condition the tables are a significant distance from one another, so the only thing to enter your 1 meter radius would be the occasional disapproving eyes of the invigilator, or the person next to you getting up for a toilet break. In my situation, I glanced around for a bit and saw nothing out of the ordinary. I panicked, almost considered raising my hand but what would I report? Paranormal activity? </p>\n\n<p>After a full minute of head turning, I decided I wasn&#39;t to be accused of cheating, and dismissed it as a passing wind. This is a catholic school, I mean, there is a crucifix pinned next to the exam clock and a painted portrait of St John hanging from one of the pillars. Just outside this hall there is a chapel where morning mass is held every Friday. We clasp our hands in prayer as a cohort before each test. The guy to my right is an altar boy. Everything was fine, until I heard it again.</p>\n\n<p>This time the breath was a whisper-toned word, but even then I could make out that it belonged to a female, shrill enough to serve as a soprano in the choir. I jumped, of course, my heart was pulsing from my throat. This time it was definitely not a passing wind.</p>\n\n<p>Being the catholic school girl I was, my hand shot up. <em>Get the invigilator to know about this</em>, was my first thought. But receiving no attention, my second thought was, <em>what did it say</em>? </p>\n\n<p>It said a single one-syllable word, &#39;don&#39;t&#39;. </p>\n\n<p>Now to think about it, it probably said the same thing the first time. It&#39;s easy to mistake the &#39;o&#39; vowel for a breath or a yawn. But here it was clear as day, even as a whisper it enunciated the consonants well enough to produce what seemed like a warning, &#39;don&#39;t&#39;. </p>\n\n<p>Or maybe it could have been just a breath, or really just a passing wind, I don&#39;t know. I was already afraid of the ticking minute-hand against my unprepared standard of mathematical knowledge, and now this. What is this? Don&#39;t? What?</p>\n\n<p>I had to be out of my mind, or something, because I started to think of everything the voice was trying to warn me about. <em>Don&#39;t...apply this formula? Don&#39;t...move on to the next question yet?</em> </p>\n\n<p>And just like that I went back to my exam. I was a rational human being who had forgotten what rational numbers were despite learning about them in third grade. I was a rational human being who didn&#39;t believe in ghosts. </p>\n\n<p>When there was but one question left empty, I received another surprise. </p>\n\n<p>I saw your name. </p>\n\n<p>Carved into the last sheet of paper with black printed ink, I saw your name. </p>\n\n<p>I always liked your name! It had an oriental ring to it when said in full and you went by acronyms because I guess it sounded cool to you. I always liked that it was unique, your acronyms spelt out a function notation. </p>\n\n<p>And now here it sat, disguised as a solvable equation in the midst of all my panic, serving as some form of consolation. I loved you, it made me happy to see your name like that!</p>\n\n<p>And when the papers were passed up and my small encounter with the passing wind fled my mind, there you were, I could see you past a sea of heads, could swim through all of them to get to you and tell you how I managed to solve the equation with your name in it but then I remembered. </p>\n\n<p>You never loved me back, not even the smallest fraction of the devotion I had towards you. You would never look at me the same way I was afraid to rest my gaze on your coffee coloured corneas, you would never want me the same way I fell in love with your every charcoal eyelash bat. I was only good enough to listen to your voice like a sweet silicone daydream from distances away. But you had the softest smile. You were too beautiful to love me back.</p>\n\n<p>So I watched you walk away, the glow from the sticky summer light clinging onto your shoulders like a lover. Even in leaving you looked like magic. </p>\n\n<p>And then I was back in the toilet of the emptiest hallway, the woman standing behind me in the mirror flashed a sad smile. </p>\n\n<p>&#39;Don&#39;t.&#39;</p>\n</div>\n","author":"abortedwhore"}