{"rank":"53","title":"A Game (part 4) \"Not Recommended\"","id":"8jveg4","url":"/r/nosleep/comments/8jveg4/a_game_part_4_not_recommended/","time":"1526481363000","body":"<div class=\"md\"><p>Things started out smoothly after we killed team yellow. We completed three minor objectives and were getting out of the slump we&#39;s been in for the last few months. But as the days went on, the team leader&#39;s infection from that bear trap continued to worsen. He fought well, but about a week after he got infected, he was unable to walk and it was clear he&#39;d have to go to a hospital. </p>\n\n<p>After a week in isolation with only my team for company, it was odd to be a part of normal society again. Me and one of the soldiers carried the team leader into the hospital and he was in a room within a few minutes, thankfully. </p>\n\n<p>Visiting hours were over at 6:30 that evening, so we had to go back to home base at that point. We had a long night of waiting before we could see the results of all the blood work the doctors had run on the infection. We halfheartedly planned objectives and did other work, but in the end, nothing really got done.</p>\n\n<p>In the morning, when we were finally able to go see the team leader, the doctors brought back the lab results. Obviously, they hadn&#39;t just taken our word for it that it was MRSA, but of course that&#39;s what it was. And as we&#39;d suspected, none of their treatments could kill it.</p>\n\n<p>So we waited for three long days to see if things would improve. They didn&#39;t. The infection was spreading now, and he had already lost a toe. </p>\n\n<p>The fourth day was a Saturday, and visiting hours were all night on Saturdays, so we were able to stay with our team leader that night. At exactly 10:47 that night we got a message from the game operators.</p>\n\n<p>&quot;Duck&quot;</p>\n\n<p>A swarm of bullets came crashing through the window, over our heads, and landed in the opposite wall. That lasted a solid ten seconds before we heard the first blast downstairs. Then there were screams from the lobby, and we heard footsteps coming up the stairs a few doors away from us. </p>\n\n<p>Remember how I used to think that the whole &quot;don&#39;t feel pain until the adrenaline goes away&quot; thing was fake? Well, I&#39;d thought the same about crawling through air vents and things like that. Once again, I was proven wrong. Weapons girl, one of the soldiers and myself went through the air duct leading into our room, while the other two soldiers stayed behind to help the team leader, who obviously wouldn&#39;t have been able to crawl around in the vents.</p>\n\n<p>A hospital is a big place. It needs a lot of air. So as we approached the main ducts, we found it easier to move around in as the vents got larger. Every now and then, we&#39;d find an air filter to catch airborne diseases, but they were pretty easy to snap out of place and set them back as we passed by them. We eventually got to a position behind where our attackers were at the moment. They were in the process of searching rooms, trying to find which one we were in.</p>\n\n<p>We broke off the vent above the doorway, in the hall. We each dropped behind them and stood in that hall beside the doorway, just out of sight until all three of us were ready. Then we grabbed hold of one of our attackers who was standing right by the doorway. I put my hand over his mouth to stop him from calling to his teammates, just to buy us a few seconds before they were after us. The soldier grabbed the man&#39;s gun.</p>\n\n<p>Then we heard more people from the other direction. We ducked into our own room and locked the door, although it wouldn&#39;t hold them off long. We closed the blinds, tuned off the lights and didn&#39;t stand, just in case those shooters were still outside.</p>\n\n<p>Our only weapons were the gun we&#39;d taken from our prisoner as well as two handguns that weapons girl was smart enough to bring. Meanwhile both groups of attackers were making good progress in breaking down the door. We got ready for them to barge in. Anyone without a weapon hid, and those with guns stood ready to start firing as soon as the door was down.</p>\n\n<p>Then one of the soldiers made a bold move. He unlocked and opened the door just before our attackers could break through it. Three people fell through who had been in the process of knocking down our door, but now they were easy for the soldiers to quickly kill. The rest of the attackers stayed in the hall for the moment. It was at this point we stated to hear the sirens. The powers that be had been notified of what was happening up here. Luckily the real authorities sent a message to all of us that the police had the wrong location and were about to search the floor above us, and we&#39;d all have a good five minutes to get out if we were smart.</p>\n\n<p>It was back into the vents for my team, sans leader, and we crawled towards the staircase. We dropped from the vents and ran down the stairs. Apparently our enemies had found another way out.</p>\n\n<p>Or apparently not, as we could hear more gunshots from the fourth floor. The five of us continued out of the hospital around back, and hid behind one of their ambulances. The fight on the fourth floor was getting worse, and judging from the commotion on the squad car radios near us, the cops were losing. Then we began to hear more blasts like the one our first attackers had used to get in. Glass windows shattered and smoke began billowing out from the lower two levels. The side of the building opposite from where our leader was had begun to buckle, and then collapsed, putting the whole structure at a twenty degree angle. There were less gunshots now, but far more screams from patients like our own leader who couldn&#39;t evacuate. We had to go back in but before we did we got another message from the game operators.</p>\n\n<p>&quot;Since you are in compliance with our recommendation not to kill civilians, we have chosen to assist you. Please acquire the weapons stationed behind the counter in the lobby&quot;</p>\n\n<p>There were two more guns, lots more ammunition and a small explosive charge behind that counter. We climbed the staircase up to the third floor. The building was now tilted so far that one side of the stairs almost went down, and the other side was nearly vertical. But eventually, we made it up to where we needed to be. There was a massive amount of dust in the air from the collapsing building. Then we realized it wasn&#39;t dust. It was a smoke screen.</p>\n\n<p>We walked slowly along the walls until we reached our target. We entered together and searched all the places we&#39;d hidden earlier. There was nothing and nobody to be seen, save for our team leader, still safe and sound. Two of the soldiers carried him and we started heading back. </p>\n\n<p>Suddenly, another round of gunshots came our way. Apparently, out attackers had found the vents as well, after killing all the police officers. We started running. At this point, EMS had started evacuating all the patients and the hospital was basically empty aside from us and our enemies. Weapons girl set the bomb to explode in ten seconds, and threw it far into the building as we left.</p>\n\n<p>It turned out, the blast was slightly bigger than we&#39;d expected. The building, hopefully along with the other team, collapsed completely. We were on our way through the parking lot towards the car we drove to get there when the shrapnel started to hit us. Shards of glass shot into our backs and we ducked below the rows of vehicles. The ambulances, with patients inside, were engulfed in the debris. We kept crawling towards our car. As soon as we reached the row where we were parked, we heard the metallic noises of bullets hitting metal against the sides of the cars around us. We started running again. As we drove off, more shots broke each of our windows and rang off the roof and sides of the car. Then one of them hit a tire. The car was slowing down. We huddled down below the windows as the car rolled to a stop. Then all of us at once opened our doors and fired into the night. </p>\n\n<p>There were too many of them. Within minutes, they had forced us back into the car. Even after everything, there were at least as many of them as they were of us. We were trapped. They encircled the car and grabbed each of us and dragged us onto the road. They lined us up standing beside the car. Our team leader had to stand on one leg. And then everyone got a new message from the game operators.</p>\n\n<p>&quot;It is now Sunday. All players be advised - do not attempt any hostile behavior. Refusal to comply will result in death of offending player(s)&quot;</p>\n\n<p>Our attackers fanned out and we got ready for a long walk to home-base. Me and weapons girl went to get the team leader out of his seat tom start carrying him with us. He didn&#39;t respond. We shone a flashlight on him, expecting to see a bullet hole in his head. But there were no obvious signs of injury. It must have been the infection. After that whole fight, our only casualty was caused by people who weren&#39;t even there and had died more than a week ago.</p>\n\n<p>We had to leave his body behind. Whoever showed up to deal with everything would assume he had nothing to do with the attacks. We arrived at home base around six in the morning. Around 7:30 we got another message from the game operators.</p>\n\n<p>&quot;To the members of team orange - due to your partial success in the fight yesterday evening, we have decided to give you full information about the events leading up to the attack. Teams Red and Blue joined to exterminate team green, who we had told of your location in a tip after they had completed an objective. Green used that as a bargaining chip and all three attacked you together. During the fight with yourselves and the police, team red was exterminated. When the building collapsed three blue and three green players were killed. Also, after the fight one green team member died of blood loss. Finally, seeing as she is your most experienced team member, Tracy will take the Team Leader position and be relieved of her duties as weapons specialist.&quot;</p>\n\n<p>Obviously, we couldn&#39;t be certain that its story was true, but we never could with these tips and so we decided to believe all of it. The game operators sent another email just an hour later. And of course, there was the little piece about weapons girl being team leader now. Anyway, another message came out later that was addressed to all players.</p>\n\n<p>&quot;Due to suffering heavy losses during last night&#39;s events, the teams Blue and Green will be combined. They will be addressed as team purple from now on. Also, Approximately twelve minutes ago a new player accepted the invitation to join the game. His contact information can be found below. Any team that successfully returns him to their base may have him as a team member in any position they choose.&quot;</p>\n</div>\n","author":"awesometimmyj"}