{"rank":"54","title":"Who do real Hoo Doo?","id":"8jvg5e","url":"/r/nosleep/comments/8jvg5e/who_do_real_hoo_doo/","time":"1526481748000","body":"<div class=\"md\"><p>You probably know it as Voo Doo. Some people call it witchcraft, or spiritualism, and in Africa they call it by all sorts of names. I call it Hoo Doo, and I used to use it as a noun for the group of religions I just named. Now I know Hoo Doo is actually a verb.</p>\n\n<p>Most of the stuff you read about or see on TV is fake. Most of the “witch doctors” selling healing remedies are really just herbalists. Most of the “curses” or “hainted tours” are just tourist traps, selling some of the spiritualism native to our New Orleans culture for the price of admission.</p>\n\n<p>I grew up surrounded by its influence. The ever present Voo Doo doll, doors painted blue, glass bottles on trees in the yards of the superstitious locals to catch the evil spirits…  as if an empty coke container could cage the real thing. </p>\n\n<p>I never really bought into any of it. To me, it was all just a hand-me-down from our great, great grandparents who used Voo Doo as a religious catchall.</p>\n\n<p>There were always rumors though, among the old ones who still remembered a time before Mardis Gras became a tourist attraction. If you listened to them, they’d tell you in a hushed whisper that - every once in a while - you can still find someone who can actually Hoo Doo.</p>\n\n<p>For your sake, I hope you never do. You’re better off sticking to the hocus pocus. </p>\n\n<p>Got a stomach bug? Brew some of these leaves into a tea and drink it. Want to catch the eye of that pretty girl down the street? Here, I’ve got a potion for that. Neighbor’s dog keeping you up at night? Kill a chicken and curse that son-of-a-bitch. </p>\n\n<p>It was all just a little too convenient if you ask me, just a way for people to feel a little more powerful and significant or explain the inexplicable things in life.</p>\n\n<p>That all changed today when I met Désirée.</p>\n\n<p>I was walking home to the rundown house I had shared with my Grandmother ever since my Grandfather passed away. The quickest path back from my job busing tables downtown took me past a large outdoor area where local artists and musicians gathered to try to squeeze a few dollars out of the tourists. </p>\n\n<p>I was exhausted, but the night air felt good after working in the kitchen all night, so I stopped for a few minutes to listen to a middle-aged woman playing jazz on her guitar. I dropped a precious dollar of my tips from the night into her instrument case.</p>\n\n<p>I was just about to continue on my way, when I noticed a large crowd had gathered a couple of booths down, completely blocking the next alley I needed to turn down. I had to stand on tiptoes to see what was causing all the commotion. </p>\n\n<p>There was an ancient looking man with a skull painted on his face, wearing a colored robe beneath a banner painted with skeletons and Voo Doo dolls. He was chanting in a sing-song voice and dancing around behind a wheelchair bound old woman. I guess he was “healing” her.</p>\n\n<p>The way the old woman stretched her arms and straightened up her crooked back as she stood up from her wheel chair impressed the crowd. Their show was pretty good. I might have taken my place in the line for a $10 blessing, except I’d seen the Voo Doo doctor and his patient before.</p>\n\n<p>They were a married couple who came to the restaurant some Thursday nights for karaoke.</p>\n\n<p>Their theatrical side-hustle was making me late getting home. I let out a frustrated sigh and heard a warm ripple of laughter from behind me, over the almost-melodic wandering of the street musician’s guitar.</p>\n\n<p>“I see you got the eyes too, boy. They should know that ain’t real Hoo Doo. He’s too old.”</p>\n\n<p>Even though I didn’t really understand the joke, I smiled my agreement back at the woman. “What do you mean too old? They’re all like that… no young person believes in that stuff anymore.”</p>\n\n<p>“No one who do real Hoo Doo lives to that age. Want me to make you believe?”</p>\n\n<p>Did she take me for another tourist? I didn’t appreciate her mistaking me for one. I responded with my most scathing sarcasm. “Oh yeah, and what’s your price? He’s charging $10, but you’re the real thing, so it’s probably more like $20, huh?”</p>\n\n<p>“No price. The dollar you already gave is enough. My name is Désirée, and I can Hoo Doo for you if you’re curious. Though I warn you! There is a reason you don’t see old timers doing the real thing. It can be dangerous, reaching into the world beyond. Never know what you might bring back.”</p>\n\n<p>Oh, what the hell. I had already missed dinner. My Grandmother was probably already well on her way to sleep by now. I might as well see if this woman’s trick was any better than the usual charades. I told Désirée to Hoo Doo for me. I figured if her illusions were as good as her guitar, at least it’d be entertaining.</p>\n\n<p>She smiled, then just started singing, picking her way up and down the guitar with the fluid grace of practiced fingers. Her voice was pretty. Very pretty. I had a vague thought that her voice was probably prettier than she herself had ever been. </p>\n\n<p>I couldn’t understand the words to her song, but they made me think it was very, very old. I’m not talking classic rock old or even Beethoven old. It was like I could hear the truth of centuries in her voice, although I didn’t speak the language itself.</p>\n\n<p>I was so wrapped up in the drifting waves of music, it took me a while to notice the changes. They were subtle at first, just fluctuations in the depth of her vocals that I took to be the strange inflections of the unfamiliar vocabulary. </p>\n\n<p>Over time though, the timbre became more and more distinctly different, yet familiar at the same time. Her voice was deeper and richer. It reminded me of the smoke rising from my Grandfather’s BBQ pit when we used to sit out together for hours on Saturdays.</p>\n\n<p>The voice continued to change until it was far too deep for the woman from whose mouth it was echoing. It was raspy, but strong, and in a shocking revelation, I realized why it had seemed so familiar from the first. It was my Grandfather’s voice. </p>\n\n<p>He’d been dead for years, but I was sure it was his voice. The impossible reality of what I was hearing shook me. It must have shown on my face, because my Grandfather - or Désirée in my Grandfather’s voice - started laughing.</p>\n\n<p>“How many times did we sit by a fire and sing together, and you still afraid of me? Don’t worry, boy. Désirée ain’t hurtin’ me. I volunteered cause I wanted to see the look on that big head of yours. Ha!”</p>\n\n<p>“Is… is that really you, Grandfather?”</p>\n\n<p>“Course it’s me! Who else would I be, eh?”</p>\n\n<p>“It’s just. Well, you’re dead you know? How is this even possible?”</p>\n\n<p>“Ah, death ain’t so bad really, long as you steer clear of certain – ah never you mind all that. Ya know..? I’ve missed you, boy. Talkin’ with you was always my favorite part of the day.&quot;</p>\n\n<p>&quot;I miss you too. It&#39;s not the same without you.&quot;</p>\n\n<p>&quot;I wish I could stay awhile longer, but I gotta go now. It ain’t good to stay still too long, in case somethin’ else come along and catch me talkin,’ and Désirée will probably be wantin’ her body back. You take care of my Lima now, you hear?”</p>\n\n<p>And like that, the music stopped, and he was gone. Désirée blinked slowly a couple of times, then picked back up her usual song, the one I’d heard playing when I first came along. I began to walk away, dumbfounded. I needed to get back to something safe, something normal. She stopped me and handed me a paper with an address on it. “If you want to learn, come see me. I’ll teach you.”</p>\n\n<p>I took the paper and nodded at her. She started playing again in the same nonchalant way, as though we hadn’t just communicated with the spirit of my dead Grandfather. </p>\n\n<p>This was too much for me to process while standing in the middle of this crowded street. My entire life, I’d thought Voo Doo was just a parlor trick and an illusion. Part of me <em>still</em> thought that – but the other part of me knew I&#39;d heard my Grandfather’s voice saying things only my Grandfather would say.</p>\n\n<p>For the rest of my walk home, I replayed the events of the night over and over in my head, trying to make sense of them. When I got to the house, I slowly creaked open the door and crept quietly to my bedroom, so I wouldn’t disturb my Grandmother. </p>\n\n<p>I was so worn out, I didn’t even bother to see what was in the kitchen. At long last, I lay my head on the pillow thinking maybe this would all make more sense after a good night’s sleep. If only I’d gotten one…</p>\n\n<p>My dreams were feverish, inspired by the excitement of the night before.</p>\n\n<p>I could see my Grandfather, but I wasn’t actually present with him in the dream. It was like watching a video filmed from behind him. He was running down an endless corridor, like the hallway of a school or a hospital, only there were no doors or windows. </p>\n\n<p>On the ceiling was a long row of rectangular lights which gave off a dim fluorescent glow, flickering in intervals down the hallway as far as I could see.</p>\n\n<p>I couldn’t see far enough ahead to know what he was running toward, but he was clearly moving as fast as his old legs would carry him, feet pounding in a frantic rhythm onto the nondescript tile floor. He kept glancing back over his shoulder as he ran.</p>\n\n<p>He wasn’t running <em>toward</em> anything. <em>He was running away from something.</em></p>\n\n<p>I tried to look behind him to see his pursuer, and – to my surprise - the perspective of my dream seemed to shift. The “camera” – if you will – remained centered on my Grandfather, but it rotated in a clockwise circle until the view showed Grandfather’s front side and the stretch of hallway behind him… or what was still visible of it.</p>\n\n<p>I could only see the length of hallway lit by the nearest six fluorescent lights on the ceiling. Beyond them was only darkness, but not the normal gradient of light diffusing gradually into the shadows. No, this was a clear line across the hallway, just a few feet beyond the sixth light fixture. A barrier of impenetrable, pitch black beyond which no light could penetrate.</p>\n\n<p>As Grandfather continued to run, the lights behind him shut off one by one, advancing the territory of the terrible void down the hallway. He would pass a new light, and an old one would shut off in the distance behind him. Only, as time passed, I began to notice they weren’t quite in sync…</p>\n\n<p>What had begun as a length of six lights behind him was now down to only five. Grandfather was wheezing now, out of breath, and his speed had slackened a little. Whatever was causing the lights to blackout was catching up to him.</p>\n\n<p>He continued running, trying to gain his second wind, but his aged legs could only carry him so fast. I watched in dismay as the lit corridor behind him grew shorter again. </p>\n\n<p>Only four lights left.</p>\n\n<p>He chanced one more glance behind him, although, without light, there was no hope of seeing anything within the hideous shadow. </p>\n\n<p>When his face turned again to my direction, I saw on it a depth of fear I had never imagined a man as courageous and strong as my Grandfather could feel. He looked straight at the “camera” – straight at me – with pleading in his eyes.</p>\n\n<p><em>He could see me!</em> He couldn’t muster the breath to speak the words, but his message was clear.</p>\n\n<p><em>Help me.</em></p>\n\n<p>Then, as he ran, Grandfather raised both hands and clamped them firmly over his ears, as if trying to drown out some terrible sound. Just moments before I was jerked from the dream back into the reality of my bedroom, I heard it too…</p>\n\n<p>A constant drone beneath the resounding echoes of my Grandfather’s footfalls. It creeped into my eardrums, unobtrusive but inexorable. </p>\n\n<p>A slithering whisper in the dark.</p>\n\n<p>I awoke with a start, sitting straight up in bed. My heart was pounding, and I was drenched in cold sweat. I couldn’t shake the feeling that I hadn’t dreamed at all. I’d really seen my Grandfather, wherever he was, just as I’d really heard his voice the evening before. But how could I possibly help him?</p>\n\n<p>I opened the window then sat back on the bed, hoping some fresh air would help wash away the panic I still felt. A subtle breeze began to blow, shifting some of the papers on my nightstand. It gently lifted one piece of paper, and I watched it swirl and drift as it fell into my lap.</p>\n\n<p>The address Désirée had given me. </p>\n\n<p>I knew where I had to go.</p>\n\n<p><a href=\"https://www.reddit.com/u/Deesco5/?st=JGNPKE94&amp;sh=a169fb49\">Deesco5</a></p>\n</div>\n","author":"Deesco5"}