{"rank":"18","title":"I Loved Him for the Worst Reasons...","id":"8jvmbq","url":"/r/nosleep/comments/8jvmbq/i_loved_him_for_the_worst_reasons/","time":"1526483071000","body":"<div class=\"md\"><p>“You were a fool, Gabriel.” I peered down at the corpse, crumbled onto the street. “Though, as was I. As was I.”</p>\n\n<p>In the beginning, I knew this man as only a victim. I had watched him for weeks; for his blood would pump in an atrocious pattern, matched by the wind’s arbitrary flow. I’d breathe the scent in deep. Recollecting the feeling of wind. And I’d laugh. To myself, of course. There was nobody else.</p>\n\n<p>This man . . . this . . . fiend, was a brute. Even as long as I have lived. . . existed? As good a term as any, I suppose. Even so long, I have never known of a beast to act towards its own species as this. . . “man”. Every week, I followed him. Every other night, he relapsed to his negative demeanor. He was merciless. It did not matter who accompanied . . . or approached. Beggars in the street: he spat in their faces. Women he’d take to bed with him: he bruised them with the “passion” he felt for them that evening. Even his own gang, friends: one night, I witnessed him beat one of his protege to such an unrecognizable mass of flesh, that I heard the suffering’s heart stop. For only a moment, however. Then his plasma swam, slowly, unstably, through his veins, once more. This creature, known later unto me as “Gabriel St. Vincent,” turned his back to the bleeding, begging, near-dead “friend,” and walked.</p>\n\n<p>I’ve seen cold-hearted. I’ve seen heartless. But until I happened upon this. . . Gabriel. . . I’ve never, never seen anything like him. Thinking back now, had I ever told him this, it might have only gone towards his ego even more. But, this being’s blood: hateful but strong, bitter and brutal, I had to taste it. I had to have him. So, one evening, when he was alone, I approached him. He would soon be mine.</p>\n\n<p>The night was uncomfortably warm. Moist. Humid. The gathered storm clouds just outside the limits reeked of piss. Acid rain was swarming into a funnel-cloud two cities over. I could hear the screams. I could hear the news reporters at every corner of the surrounding localities, claiming “this could be the worst storm we’ve seen in decades.” What a pathetic herd of cattle. “Decades?” The Dark Ages, the Plague? Those were fun. This. . . this was child’s play. Still, with the coming weather, the screams of the citizens, the smell of urine and the taste of gravel from lack of feeding in a couple hours. . . Yes. . . I wanted to savor this man’s blood. I’d have gone the entire month in which I stalked him without eating, if it was possible. Just to make the meal sweeter. Greater. More. . . perfect.</p>\n\n<p>But no. I needed my strength for this one. He hadn’t gotten to be the cruelest human being I’ve come across by being a scrawny fellow. I knew he would put up a fight. Even as cunning as I could be; he was no fool, then. One more whiff of his flesh-coated blood cells, and I appeared.</p>\n\n<p>I was behind him; I mimicked his footsteps perfectly. Light left foot, heavy right heel and toe. Quickening. Stridefully. I chopped my steps in a dance. I knew he was going to hear me. I wanted him to. I wanted him to take me; torture me: as he would his friends. Because, the more I made his veins pop, the more swollen his capillaries, the more perfectly I could dine. He hurried further. He wasn’t going anywhere. Ahhh. Reminiscing on that crescent-moon night, now, still feels. . . beautiful. But now I know better. I’ll never know another like him. I’ll never have another like him. But I rest well knowing, no other creature will, either.</p>\n\n<p>He stopped after only 3 minutes 27 seconds and twelve shuffling feet. I breathed deep as he turned. </p>\n\n<p>“What’s your prob--” light bounded from his widened eyes.</p>\n\n<p>VANISH! Everyone knows this trick, by now, I’m sure. </p>\n\n<p>He staggered, slightly, before pivoting back. Now was the most amazing . . . most exhilarating moment of my entire. . . existence. The veins in his neck protruded past the tendons. </p>\n\n<p>“Wake up, S. V.” I heard him mumble to himself before raising his eyes to behold my majestic figure before him. Gabriel was tall, so I had to be just a little taller. I clasped him by the sides of his head, taking in every fast reaction, and reflex as if it was a frame-by-frame projector reel.  For splash value, I lengthened my knuckles, so I could interlock them around his head. Or, that’s what I made him feel was happening. Just behind his sweating vertebral derm, a street lamp shined like a long-expected dawn. I drew him sideways. I made sure he could see his attacker. I wanted this moment. I had wanted it for seven-hundred, twenty hours. This man was my well-deserved reward. Patience really is a virtue!</p>\n\n<p>As he gazed upon my ever-down-streaming teeth, and my hollowed out irises to take in the night, I felt him begin to pump more intensely. And his adam’s apple swelled, the way one does when the tears well in the pits of one’s eyes. But the tears were not coming from this one. That hastening of the blood, that swollen jugular, that was his fear evolving. Changing. Into Anger. Wrath. This was the blood I had longed for. I widened my mandible to latch onto that ballooning gullet. </p>\n\n<p>A twang pierced my diaphragm, before I could enjoy his fluid, though. I looked down. Then back up. And smiled. The man had knifed me, just beneath the sternum; lucky me: he missed my heart. I lunged back at his tight throat. And I was right. When I sunk my teeth into his carotid artery, the juice just came in its warm, fast, sweet, bitter, angry, scared, greatness. And, my god, did it come! </p>\n\n<p>I’ve said this already, and I will forever say it: I had never prior, nor ever after, had a creature such as this. . . Gabriel. Nobody has ever produced, much less projected, as much life-giving liquid, as this man. </p>\n\n<p>But, as they say: all good things must come to an end. He had never been so unpredictable the moment he turned that blade at my throat, and sliced me. Clear through my trachea. Naturally, I had to release him. Not before, though, my own spray entered his mouth. He lay beneath me, gurgling. Groaning. I stood hunched over him; closing my own wound. Trying not to laugh, so I could heal more quickly. We both silhouetted as blood-drenched shadows against that shimmering, sun-like, street light. </p>\n\n<p>Was the “near-death” experience worth it? </p>\n\n<p>It was.</p>\n\n<p>Was the “new life” I unintentionally gave this cruel beast?</p>\n\n<p>Hell no.</p>\n\n<p>I healed. But the dawn was quickly arriving. What was I to do with this infant abomination? Passed out in the recessing blood and its stains. He had started to heal, as well. I was the fool, that night. I should have just left him there. The sun perches most-admirably over that alley, this time of year. It wouldn’t have taken any time at all for this man to crisp like pig fat. I paced around the blood-pool. Mucking up my already stained boots. </p>\n\n<p>“Damn it all!” I thought as I grabbed his collar and dragged him down through the nearest sewer covering. But I wasn’t gentle. This bastard did slit my throat, mind you. I carried him home. If nothing else, he would serve very well as a blood-sack. I could have chained him up in iron and drained him nightly. An unlimited supply of the most sultry plasma I’ve ever wanted feed on. And that’s exactly what he was. For about two nights. The ungrateful brute.</p>\n\n<p>After he woke up at about 2 in the afternoon, he tried to speak. He hit syllables, well enough. But the words were only, “AAAAARRRGGGGHHHH!” and “NNNNGGGGGHHHH”. Or something to that respect. I saved the fiend. Foolish me. So, I had to keep him alive. Foolish! Foolish Me!!! I fed him my blood from a goblet. His wrists continuously sizzled from the iron. And when he sizzled, he screamed; and when he screamed, his veins popped. And when his veins popped, I felt that urge again! He sweated his last fever that night. And I didn’t let a drop hit the stone below. I’ve never had anyone or anything like him, again. But he was mine now. And nobody would ever have anyone or anything like him, again. Because he was mine!</p>\n\n<p>That night, I seduced a young coed and her little sister to come home with me. After all these years, I’ve found the easiest way to do this is. . . </p>\n\n<p>. . . to be. . . us! </p>\n\n<p>The mortal sensory organs are so naive to the scent, the aura, the flavor, of a renewal of dead tissue, that the signals between those nerves and the brain quickly becomes familiar with it. This is why we “put off” such a pleasing allure. And this is exactly why we must feed as regularly as we do. The longer we go without feeding, the more our flesh, our organs, our fluids begin to ripen. Deteriorate. Decay. And we become the compost masses that Gabriel reduced his “friend” to for such few moments. This is why dead blood is poison to us. Why would we want to ingest what we despise to turn into. It only hastens the process. Anyway, I digress.</p>\n\n<p>My “gifts” for the man fell as wasted fruit, because when we to him, it would seem he had expired. His blood did stop flowing. His pupils did release. </p>\n\n<p>I laughed, “I knew you were an abomination!” </p>\n\n<p>I released his shackling, allowing his body to splat onto the floor. I turned to the hypnotized young ladies and waved my hand. They, too, collapsed to the concrete. I took the younger sister upstairs to feed on. The trouble with the adolescent body: It doesn’t contain as much nutrients as a plump and supple college student who eats regularly, but eats well. Red meats. Proteins. Real real food. But That was alright, because I had precisely one of those just downstairs.</p>\n\n<p>So, I tossed the girl down into the furnace, and headed right back to get that voluptuous brunette. When I scooped her into my arms, her flesh chilled in bumps like she’d just been jolted by an electric shock. I knew this reaction: she was coming to. But then, that feeling shivered me. I turned. The man wasn’t where I left him. I laughed again. Only this time, I had my guard up. Then, that scent hit me again; Gabriel was back from the dead, and standing right behind me. </p>\n\n<p>“Don’t do this,” I tilted my head in his direction. “You wouldn’t know what you’re doing anyway.”</p>\n\n<p>My voice shook the girl in my arms. She awoke with a squelching cry. She fought to get out of my possession, I wasn’t going to fight back. My fight was sizing me up as my back faced him. She ran to the bottom of my stairs before about-facing to see a “hero” in the making.</p>\n\n<p>I joked, “Aw. And she was such a good year.”</p>\n\n<p>He retaliated, “I don’t give two shits to listen to yours! How do I get out of here?”</p>\n\n<p>“Again, son” I turned, fully towards him, “You do not want to do this!”</p>\n\n<p>He stepped at me, “Shut your mouth, goddamn it! You don’t know me!”</p>\n\n<p>I lowered my head at his ignorance, “Gabriel.” The got still, but not his blood; that was pumping so strongly. It wasn’t disappointing. </p>\n\n<p>He didn’t want to know. “How the fuck do I get out of here?!”</p>\n\n<p>“Such language,” I really was offended. In all my life, I’ve never had anyone swear in my own house! But then again, I’ve never had anybody like him in my house.</p>\n\n<p>He pulled his knife, again, “Forget it! I’ll find my own way!”</p>\n\n<p>“No. Please. Wait.” I feigned desperation as he ran past me. And, as a “good” hero does, he took the coed’s arm and led her upstairs. And as a good host, I met them up there. He tried flailing the razor at me again, but I was ready this time. We danced at the top of the stairs. I checked the time: there was about 45 minutes before the dawn would crack the sky open, so I let them pass. </p>\n\n<p>“Run run,” I called behind, “as fast as you can! The sun is coming  and it looks like your end!”</p>\n\n<p>They ran. And they ran. The sun rose, more quickly, it seemed, than it had in so long. Then, in the middle of the street, that brutal “hero”, Gabriel began to slow. His forehead sizzled as his wrists had in those chains; but this was different. A cherry developed on his brow, quickly rolling into ash. And the ash fell to soot. And the soot enveloped the abomination, leaving his crackling flesh to smoke and fade into the wind. The girl, however, got away with only a second degree burn mark around her forearm. She screamed and ran, and cried and screamed. </p>\n\n<p>But who would believe a story about a vampire abducting her and her baby sister; followed by this guy she’d just met turning into smoldering statue? Not cops. Not her parents. Not. . . the doctors. So, when they lock her away in that padded cell, I’ll be waiting there. Just for her. </p>\n\n<p>From beneath my umbrella, I laughed in the middle of the street,</p>\n\n<p>“You were a fool, Gabriel.” I peered down at the corpse, crumbled onto the street. “Though, as was I. As was I.”</p>\n</div>\n","author":"JGWillikers"}