{"rank":"9","title":"The Man at the Bus Stop","id":"8jvnct","url":"/r/nosleep/comments/8jvnct/the_man_at_the_bus_stop/","time":"1526483283000","body":"<div class=\"md\"><p>It started with the man in a suit at the bus stop. I’m not sure exactly what it was about him, but there was something off. He just sat there, with his legs crossed and his briefcase on his lap, staring at me - at least, I think he was staring at me. It was dark, so I couldn’t make out the white of his eyes, but his head was definitely facing towards me. I turned away as my bus pulled up, got on, and for about a week I forgot the whole incident. Then I saw him again. </p>\n\n<p>He was dressed differently this time, and I don’t just mean he was wearing different clothes, his entire style was different - the bright Hawaiian t-shirt draped over his shoulders, the oversized khaki shorts that hung low around his hips and the loose leather sandals that must have been at least a size too big. He had a camera slung over his back, a cigarette tucked behind his ear and was facing a shop window - stooped over to look at something in the display. I thought it was just a coincidence, in fact I didn’t even recognise him at first, not until I caught his gaze in the reflection. </p>\n\n<p>Looking someone’s reflection in the eye is a strange feeling. They’re both there and not there at the same time. If you look someone directly in the eye you know that they see you, but when it’s a reflection you can never be sure.</p>\n\n<p>After that I saw him more and more, and not just out on the street either, I’d see him in specific places. I once saw him walking along down the stairway of the block of flats opposite me, another time I saw him on the train home to my parents’ house, each time dressed in completely different clothes, as if he thought I wouldn’t notice.</p>\n\n<p>Three months ago my girlfriend and I decided to take a trip to Spain. We drove down through the Pyrenees on our way to Zaragoza and took the scenic route through a little place called Aragnouet, right on the border between France and Spain where the road winds its way up the valley between two giant mountains before passing through a tunnel across the border. At the top, there’s a giant cliff face with a thin line of trees that hangs over the entrance of the tunnel. If the time of day is right, the sun silhouettes the cliff in such a way that the trees look like a line of spines running up the back of a giant stone lizard. And that’s where I saw him. Parked at the side of the road in a beat up old Peugeot. </p>\n\n<p>I only caught a glimpse of him in my rear-view mirror before we passed into the darkness of the tunnel, but I’m sure it was the same man. I have no idea what he was doing there, but I was scared. The whole way through that tunnel I gripped the steering wheel as if it were suddenly about to fall through the dashboard, I’d say my knuckles were as white as snow but it was so dark I couldn’t see them. I kept waiting for a pair of headlights to appear from behind, but they never came.</p>\n\n<p>After that I began to pay more attention, whenever I saw him I’d try to remember exactly what he wore, and exactly what he was doing. He never approached me or waved at me. He’d just be there. Watching me. Until one day, I think it was a Tuesday, I noticed something. I started to realise there was a pattern. Each time I saw him he’d be on the other side. First my left, then my right, then my left, then my right. I never saw him twice in a row on the same side, and every time I saw him he’d be a little closer than the last. Not by much, only an inch or so, not enough that you’d notice the first few times. But after three months it’s pretty obvious. The bus stop I first saw him at had been on the opposite side of a wide road, at least fifty metres or so, by the time I saw him on holiday it was about twenty metres. </p>\n\n<p>This morning it was two.</p>\n</div>\n","author":"ModeHopper"}