{"rank":"18","title":"Sometimes, I dream of death. (Part 1)","id":"8jvp2i","url":"/r/nosleep/comments/8jvp2i/sometimes_i_dream_of_death_part_1/","time":"1526483641000","body":"<div class=\"md\"><p>When I was 12, my dreams turned into warnings of the future.</p>\n\n<p>It&#39;s little things mostly, and not even warnings, more like random, unimportant moments that would happen that day. The most mundane are in class, or someone speaking to me and I&#39;ll know what they&#39;re going to say.</p>\n\n<p>But some dreams are long and detailed.</p>\n\n<p>One dream was where it was foggy and cold. I couldn&#39;t feel my fingers as I walked the path I took to school. Because the fog was so thick, I couldn&#39;t see past my hand stretched out. So my hand is stretched out as I cross the road, my hand is stretched out as I turn and I see the headlights price through the fog and I&#39;m in sudden pain.</p>\n\n<p>I woke up terrified, gasping, and I look out my window and I shrieked in alarm. It was foggy. The weather had gotten cold, yes, but my area had never gotten so much fog before in my life. I was practically pushed out the door by my mother. I couldn&#39;t see anything past my outstretched hand.</p>\n\n<p>I waited for it to clear up. It wasn&#39;t. I walked as slowly as I could, anything to keep me from the road. It didn&#39;t occur to me to ditch, now I realize that I could have. I was a good student, that was always on time and had never skipped school before. I could wait it out.</p>\n\n<p>It wasn&#39;t long before I saw the flashing red and blue, and neon vests bobbing in the distance. A police officer saw me coming and stopped me from getting close to the road.</p>\n\n<p>&quot;You need to go around.&quot; He told me, but I was looking past him, at the dented car hood, the blood, the white sheet covering something on the ground. The fog was clearing up now, and I wish it wasn&#39;t. I knew him. He was in my year and walked the same path as I did to get to school. We weren&#39;t friends, and he would usually go early to hang out while I usually went later.</p>\n\n<p>I was 14 when that incident happened. It hasn&#39;t been better since. I noticed a trend very quickly with the sparse deaths throughout the years, is that they were all violent and brutal and christ it always hurt. Sometimes I was nonfunctioning, the scene playing in my head, over and over. I experienced falling from a window and being impaled with the falling shards,a lot of car accidents, some not immediately and dragged out. Impact, swerve, tree, bleeding out with my legs pinned up against my chest. People I knew, not all that well, but I saw nearly every day. The worse are the suicides. I feel the thoughts, the numbness. They linger when I wake, and I want to die.</p>\n\n<p>It has affected me. When I say I stop functioning I mean I go catatonic. There is only one person I&#39;ve told and I trust, I&#39;m sure anyone else would call me crazy, and worse if I go into detail about it. How do you know? I don&#39;t please understand I don&#39;t want this. My friend is my lifeline. I would text him, saying I had a bad night, and he would be over to make me breakfast, to hold me and keep my close, reminding me I was alive, that those thoughts weren&#39;t mine.</p>\n\n<p>But now... I don&#39;t know what to do.</p>\n\n<p>A week ago, I experienced slowly being choked to death, a stranger&#39;s bearded face, up against mine. We had fought, I scratched him up, digging my fingernails deep in his arms and drawing blood. It doesn&#39;t bother him, I kick and flail and he&#39;s pinning me down,saying how he likes a fighter, but it&#39;s time to be quiet now. He breathed heavy, sweating and smiling as he slowly killed us, I take in his features, his eyes, thinking, &quot;he&#39;ll burn in hell, he has to.&quot; and everything goes dark.</p>\n\n<p>When I wake, I go through the drill. I text my friend, tell him what happened, and he&#39;s coming over. I wonder who died, i&#39;m always terrified it&#39;s someone I&#39;m close to. Sometimes I&#39;m scared that it&#39;s my friend, and he&#39;s never going to text me back because he&#39;s wrapped around a tree or dead in a house fire.</p>\n\n<p>Two days ago, the body was found.</p>\n\n<p>Two days ago, the same man kills another woman. I had barely recovered from the last death. He strung us up in a tree. Our toes scrap against the dirt, the rope burning around my neck and christ we were wishing for death by the time it took us. The thing is, I didn&#39;t know either of these women. Completely random women. I go to the police, I have to at this point, if I stay silent, he&#39;s going to kill more and i i could have done anything about it, it would be my fault. I always see the death, and it&#39;s always too late to help. I can help now.</p>\n\n<p>I&#39;m clever in how I do it. I tell them this man attacked me, that he nearly killed me and I knew his face. I give them his description, they collaborate my story, my sobbing and crying fueled by the recent murder didn&#39;t make them look to closely into it as they took my statement. By the night, his face is in the news. They found the second woman&#39;s body later that night.</p>\n\n<p>I&#39;m scared to go to sleep tonight. I&#39;m staying at my friends, I have been since the second murder. I&#39;m scared there is going to be a third. I don&#39;t think this man is stupid enough to kill when he&#39;s got cops looking for him, and frankly, that scares me too. Where is he now, What is he doing? I hope he gets caught soon.</p>\n\n<p>I realize that will be a second part to this. I&#39;ll try and keep you guys posted on what&#39;s going on.</p>\n</div>\n","author":"RedChessQueen"}