{"rank":"9","title":"The Medium - Part 1","id":"8jvyc1","url":"/r/nosleep/comments/8jvyc1/the_medium_part_1/","time":"1526485600000","body":"<div class=\"md\"><p>Part 2: <a href=\"https://new.reddit.com/r/nosleep/comments/8k5bcd/the_medium_part_2/\">https://new.reddit.com/r/nosleep/comments/8k5bcd/the_medium_part_2/</a></p>\n\n<p>Part 3: <a href=\"https://www.reddit.com/r/nosleep/comments/8kenmj/the_medium_part_3/?utm_content=title&amp;utm_medium=user&amp;utm_source=reddit&amp;utm_name=frontpage\">https://www.reddit.com/r/nosleep/comments/8kenmj/the_medium_part_3/?utm_content=title&amp;utm_medium=user&amp;utm_source=reddit&amp;utm_name=frontpage</a></p>\n\n<p>Part 4: <a href=\"https://www.reddit.com/r/nosleep/comments/8l2mk6/the_medium_part_4/\">https://www.reddit.com/r/nosleep/comments/8l2mk6/the_medium_part_4/</a></p>\n\n<p>The thing about being a spirit-medium is, it’s horseshit. I should know.</p>\n\n<p>Those crummy late-night infomercials, with Madame Cleo connecting middle-aged women with their dead aunts? Yeah, that’s what I do. Few people know this, but Madame’s other name is Corvette Mama. And Christina Garcia. And Janet Snyder. This can be found on Wikipedia. What you won’t find is that she also has a degree in marriage counseling.</p>\n\n<p>I majored in theater design.</p>\n\n<p>Don’t bother looking me up, though. I’m not nearly as successful as those other televised conmen—and women—you see channeling some long-dead housecat for a weepy pre-teen. Look at it this way: if I had Madame Cleo’s money, I’d throw mine away. Who’s even heard of Victor Voltair?</p>\n\n<p>My real name is Gary Pimmel.</p>\n\n<p>Some theater savvy comes in handy when you’re hosting your own open-house séance. Especially with all the smart-home technology out there. Public access channel aside, most of my income starts off as palm reading. A pair of tipsy 20-year-old girls come giggling in through the beaded door, and you know they’re just looking for a laugh, an experience. No repeat business to be found there. Take the cash, tell them to avoid bald men in yellow convertibles, and shove’em out the door. But when a woman sits down, clutching her purse with both hands to her chest, eyelashes stuck together with dried tears—now you’re in business.</p>\n\n<p>She’ll say, “I—“</p>\n\n<p>Interrupting I’ll say, <em>I know. You’re looking for something. You’re desperate</em></p>\n\n<p>Nodding feverishly, she’ll pull a handkerchief from her sleeve with those dried, leathery old people hands. Cracked from over use, calloused at the forefinger and thumb—all of this just wear and tear from repetitive motion over years.</p>\n\n<p>Observing this, I’ll say, <em>how long have you been knitting? What do the women in your knitting circle think?</em></p>\n\n<p>Then the face of astonishment. Then the weeping. She’ll spill the beans on her abusive husband, her long lost daughter, her porcelain angel collection. I had this one ancient chick describe, in full detail, her love affair with TV celebrity Brent Spiner—the guy that played Data in Star Trek. One observation, one question.</p>\n\n<p>This is the power of theater design.</p>\n\n<p>In the entertainment business, we call this the “willing suspension of disbelief.” When you sit down to watch Hamilton, you’re fully aware that the people you’re watching aren’t reanimated corpses of historical figures dropping fresh rhymes in the middle of a revolutionary war. You give up your rights to doubt and scrutiny as soon as you take your seat. The set design, the lighting, the ambience—all this designed to help the suspension of disbelief along. Make it easier to buy in. When someone walks into my parlor to finally say goodbye to uncle-so-and-so, or flip the bird to their suicide-ed brother—they’ve already decided to let doubt take a backseat. With enough heat-resistent gel lighting, enough forethought in your incense selection, you can stuff doubt right into the trunk.</p>\n\n<p>One trick is, keep all your candles under a vent. Keep it warm when they first come in. Then, when something super natural is supposed to happen, slide your thumb across your smartphone to drop the A/C. </p>\n\n<p><em>Cue atmospheric disturbance.</em>  </p>\n\n<p>The candles will go out. Old ladies fucking hate the cold. This leaves them vulnerable and confused. Same strategy the police use during an interrogation.</p>\n\n<p>Another trick is, buy a beat-up circular table. Then buy a thin slab of sheet metal and have it cut down to size. Glue that down to the top of the table and cover the whole thing with wood patterned laminate—the really shitty, thin kind. You can buy this stuff whole sale. Run a wire from the hidden metal plate all the way down a table leg and into an outlet. Wire in a foot pedal. This way, in the middle of a séance, with everyone holding hands—their elbows on the table—everyone gets a tiny shock when you put your foot down. Not enough to do any damage. The laminate will provide just enough insulation to allow everyone a jittery tingling sensation. Make sure that none of the sheet metal is exposed though. Otherwise, it’s manslaughter.</p>\n\n<p><em>Cue other-worldly presence.</em></p>\n\n<p>This old lady, the next day, she’ll tell her friends about me. All those knitters. She’ll tell them I changed her life. I saved her. By the end of the week, their whole circle is there, asking to speak with lost husbands. Missing children. Hearing how all these loved ones die, it’s no wonder I’m terrified of getting into a car. Nowadays, I’m constantly checking my testicles for cancer.</p>\n\n<p>These old ladies, forking over that retirement cash, disability cash, pension cash—these kind of scores are far and in between, so I run a second business. Give anyone enough closure, enough emotional relief, and they’ll feel obligated to give you something sentimental. Something homemade.</p>\n\n<p>These old ladies will swing back sometime with award-winning jams. Homemade scarves. Hand-crafted jewelry. For them it’s a hobbie. For me, it’s a booming Etsy account filled with artisan goods. Two weeks back, I sold some woman’s homebrewed perfume, $300 a pop. A quarter of my yearly income is made this way.</p>\n\n<p>Look, I don’t need your judgment here. I really don’t. Am I a liar? Sure. Who isn’t? People slide me twenty bucks and I keep them entertained for half an hour. They slip me a hundred bucks and leave feeling like death isn’t the end. Psychological validation has <em>always</em> been a high commodity. Stepping out my beaded doorway, they’re taking away an improved quality of life. Have you seen what credentialed therapists charge? Are you kidding me? I’m providing a public service for peanuts. </p>\n\n<p>I’m the Patron fucking Saint of Counselors.</p>\n\n<p>But as far as the real deal goes—ghosts, spirit worlds, whatever—like I said. Horseshit. I need it to be horseshit. I spent my childhood being numbed by Catholicism. Early morning mass. Stand, kneel, bow, read, listen, repent. I couldn’t take an eternity of that shit. If I die in my sleep tonight, and wake up tomorrow in an everlasting <em>anything</em>, I’m going to be sorely disappointed.</p>\n\n<p>That’s why I’m writing this. Over the last few days there have been occurrences I can’t explain. </p>\n\n<p>It all started with a phone call.</p>\n\n<p>More to come.</p>\n</div>\n","author":"DRP22"}