{"rank":"4","title":"Keratoconus","id":"8jw0bp","url":"/r/nosleep/comments/8jw0bp/keratoconus/","time":"1526486006000","body":"<div class=\"md\"><p>Once upon a dusty evening in a lonely worn down place, a boy was born holding a handful of blood. His mother cried tears of pain and joy as a new life was ignited. The world still spun and spun as the boy cried and cried.</p>\n\n<p>Mother and his son and a man.</p>\n\n<p>He was to be a tall and hardworking young man. That, he became. Alone with his beloved mother, handling life as it came each day. The father, an abusive brute, his hits grew harder each night.</p>\n\n<p>The boy fetched water, hunted rabbits as the mother cried to herself, unable to help her poor son, could only offer soothing words. She held him each day, each time after the man’s ruthlessness. The boy never knew how to cry. But he knew his mother did. A small splinter in his heart, a splinter made from understanding their misery. How each day passed ever so slowly and ever so slowly, it became harder and harder to bear. He could tolerate any hardships that may come his way but his mother couldn’t. Fragile old woman who was bed ridden and a worried son. The son never knew his mother’s presence was the only thing which held the string of sanity together for him.</p>\n\n<p>One gloomy evening, on a particularly difficult day scarce of food and stale water, the boy sat on a tree stump near his home. The sky’s theme was that of beautiful roses’ torn leaves, painting the sky scarlet. The sun was succumbing to sleep as the yellow leaves flew about. One of these leaves barely brushed the boy’s nose. Clouds hung low with a depressing gray tone, ever so prepared to release its sorrow. </p>\n\n<p>As he sat there, pondering about what’s to come. Thinking about if there’s a way for him to seek help and to save his mother. The one who had been his only friend, his only companion,his only mother. She was letting a fraction of her soul slip day by day and he couldn’t do anything to keep it in place. The boy noticed a figure heading towards the door which led into the worn down place. The man. With an emotionless expression on his face, the boy kept watching. The man was holding a half empty bottle, an attribution to his moronic mind. He donned a dirty black jacket stained with puke and booze.</p>\n\n<p>As he walked on, the boy bared his teeth. Isolated and alone with but just one burden. Food and water could be found but if it’s always stolen, what is the purpose of even attempting to survive? Life could improve but if a shadow kept tugging at it, pulling it back into the mud, what’s there to try?</p>\n\n<p>The stars were starting to shine beautifully in the evening sky like candles being lit as the wind blew even more fiercely and the man was finally at the door. Another night of torment? Another day of misery? Another…tear?</p>\n\n<p>For the first time, the boy was crying. He was in utter disbelief. The wet drop slowly passing down his cheek. An astray leaf brushed past his cheek, wiping it away with grace. The boy stood up, confused feelings brew inside his heart. A cocktail of sorrow, anger, hatred and desperation.</p>\n\n<p>With a violent leap, he was already beside the man who had not the briefest idea about what’s to come. As his weak mother lay in bed, dreaming of twin birds, the boy pummeled the man. A fight uses fists. A struggle for life uses everything. He clawed at the man until there wasn’t a single sign of his repulsive face, driving his hand into his filthy body with such force that in the woman’s dream, she heard twigs snapping as a deer graciously hopped around the twin birds. A decade of torment was given back to the man in one payment and it was too much for him to put in his pockets. A fight would leave bruises. A struggle leaves a body. As the boy bit down and tore the man’s cheek, spraying blood across the muddy dirt, he had two thoughts in floating in front of him. </p>\n\n<p>It wasn’t a tear at all…the muddy dirt was once just earth but after the evening rain’s single drop had landed on the boy’s cheek, it had gotten muddy shortly after.</p>\n\n<p>The soft parts tasted delicious.</p>\n\n<p>That evening, dreaming of a peaceful garden, the woman passed away and so did the man. And with his mother, the boy’s string was snapped.</p>\n\n<p>Years and years later, the neighborhood kids chatter amongst themselves of a skinny man. A man who was born clutching a handful of thick blood, he who feasted on another man. Never seen in daylight but spotted glancing outside behind his window at night. His eyes a pointy pair. His smile, that of a crazed soul. The kids dare not to wander too close to his worn down place. The faint metallic scent always lingering around it. A tattered jacket lay in front of the door. The pointy eyes glaring at whoever passes by.</p>\n</div>\n","author":"rainglaze"}