{"rank":"33","title":"Under the Weather","id":"8jw31j","url":"/r/nosleep/comments/8jw31j/under_the_weather/","time":"1526486567000","body":"<div class=\"md\"><p>I think I&#39;m sick.</p>\n\n<p>Two weeks ago, my roommate came home looking pale; she struggled to maintain a smile. After she got settled into bed, I asked her what happened. Apparently she was at a party and someone had slipped something into a lot of drinks. People were ill and it was shut down quickly. She insisted she&#39;d be okay and I nodded in hesitation. I hoped it wasn&#39;t serious.</p>\n\n<p>I woke up that night to the sound of her retching. The retching turned to groaning, which quickly turned into screaming. &quot;Are you okay?!&quot; I yelled, scrambling out of bed to see her.</p>\n\n<p>&quot;Don&#39;t come in!&quot; Her voice was shaky and there was desperation. If I had known at the time, I would have done something, anything! I went back to sleep.</p>\n\n<p>The following morning I went to see the bathroom, praying it was clean. Luckily, it was spotless; the last thing I wanted to do that morning was clean up a day-old mess. My roommate, on the other hand, looked terrible. Skin pale, eyes tired, mouth stained with... pink? She gave me a tired smile and said she didn&#39;t want to go to work today. I went out to work and let her rest.</p>\n\n<p>The cycle continued for the next few days. Every time, she would retch, groan then scream. She threatened me if I dared to go near her; come morning, her skin would be a shade paler and eyes darker. She drastically lost weight, at which point I grew even more worried. Looking back, I think her hair had started to thin as well?</p>\n\n<p>I came home early one day. I could hear her being sick once again. I didn&#39;t say a word, as I thought it would be a good opportunity to see what was really going on. As I walked through the living room, I noticed something. There was a cube on the coffee table, a white cube with a rubbery texture and what felt like random objects sealed inside. &#39;Did she order something from online?&#39; I thought to myself.</p>\n\n<p>After a busy day, I went to my room to freshen up. When I came out, the cube was gone and my roommate was there with a nervous smile stained a sickly shade of pink. Something wasn&#39;t right.</p>\n\n<p>That night, things were the same. Retch, groan, scream. Once I was sure she was asleep, I snuck into her room. In the corner of her room, I saw a mound of cubes. Different sizes, but all rubbery with something inside. I had to know what was so special about them! I took one out and carried it to the kitchen quietly; I set the cube down, grabbed a knife and cut into it.</p>\n\n<p>Organs, meat and bones spilled out. They looked fresh and smelled like they had been left in the blazing sun for days. I tried to keep it together, but ultimately I was sick. I cleaned up the mess and went back to bed.</p>\n\n<p>The next day, she flew into a frenzy. Searching high and low for &quot;something.&quot;</p>\n\n<p>&quot;A rubber cube?&quot; I asked. &quot;About...this big? It&#39;s gone.&quot;</p>\n\n<p>She stood there, stunned.</p>\n\n<p>&quot;Sam, please! What is going on?!&quot;</p>\n\n<p>After a moment of silence, she said to me in a hushed voice, &quot;Come with me tonight. But don&#39;t touch anything, not even me.&quot;</p>\n\n<p>Night came and the two of us were in the bathroom; I sat on the toilet while she was hunched over the sink. After five minutes of silence, her eyes widened. She threw up shortly after. Instead of a chunky earthy mass of stomach acid, a clear pink liquid stained the sink. It looked more like mouthwash than vomit; what the hell?</p>\n\n<p>Without warning, she doubled over and groaned. She lifted up her shirt to reveal a large incision spanning from the centre of her chest to her stomach. All I could do was stare in disbelief; did she do this to herself? Her groans turned to screams as the gash convulsed.</p>\n\n<p>She slowly forced out a large cube from the wound, stainless. The moment it fell to the floor, she collapsed next to it. I carried her to bed, tucking her in. I went back to the bathroom to clean up the mess. Before I washed it away, though, I dipped a finger into it without thinking. It had the consistency of melted cheese and smelt strongly of rotten meat.</p>\n\n<p>The next few days were awkward. Every day, my roommate became dull-looking and withdrawn. She barely spoke and looked like death: abnormally thin, balding, eyes sunken in and almost pure white. I wanted to help her, really. I tried. But ultimately, it was a failed cause.</p>\n\n<p>One night, I woke up in pain. My chest felt so tender, as if a cat had clawed it at such depth. I slowly began to realise that something was wrong. Silence. No retching, groaning, screaming... It felt unsettling. I went to check up on her, but her door was locked. In my tired state, I couldn&#39;t do anything to help. I gave up and went back to bed.</p>\n\n<p>She didn&#39;t show herself the next morning. Her door was still locked. Despite my banging and yelling, there was no reaction; I had to resort to breaking the door down. I broke a meat cleaver trying to get in. By the time I got in, I was nowhere near ready for the sight.</p>\n\n<p>My roommate sat on her bed, surrounded by cubes. Hairless, white, black eyes, thin like a sapling... It was as if I was face-to-face with a living cartoon character. She just stared at me, nothing said or done. Not even a blink or mouth movement.</p>\n\n<p>My roommate was gone. All that was left of her was a walking corpse. I was devastated.</p>\n\n<p>Hours later, I went back to see it. Not a single movement. Or so I thought; the gash on its torso had expanded, revealing a mass of pinkish blobs where...</p>\n\n<p>...bones, muscle and organs should be. Oh God. The cubes.</p>\n\n<p>That night, I woke up to a piercing pain. I tried to get out of bed but I collapsed on the floor from the intensity. I had never felt so much pain until that point. The moment it stopped, I went to a mirror and looked at myself. A large gash, spanning from my chest to my stomach, had appeared. The wound looked clean, not a single drop of blood could be soon.</p>\n\n<p>It has been a week since it began. My hair is falling out, my skin is turning pale and every night I wake up nauseous and go back to sleep with a new cube by my bed. It&#39;s as if I am in Hell.</p>\n\n<p>My former roommate hasn&#39;t moved, and...I let my morbid curiosity get the better of me. I cut that thing to pieces and found disturbing things: anyone infected eventually has their blood replaced with the pink liquid and everything (brain and heart included) is removed and cubed. How they remain alive after this, I don&#39;t know.</p>\n\n<p>I don&#39;t know how long I may have or who else might be infected, but please. If you know anyone who has these same symptoms, don&#39;t touch them. Run. Run and don&#39;t go back.</p>\n</div>\n","author":"MidnightKrohe"}