{"rank":"20","title":"Not everything abandoned is empty.","id":"8jwcqx","url":"/r/nosleep/comments/8jwcqx/not_everything_abandoned_is_empty/","time":"1526488571000","body":"<div class=\"md\"><p>I&#39;ve just recently moved to upstate New York.  Coming from the city , it is  as beautiful and quiet as I had been led to believe. Up in the Catskill mountain range, a person could walk all day and never see another living soul, of course I would not be writing this if I hadn&#39;t seen another soul. </p>\n\n<p>I was on a hike down a familiar trail behind my house, when i decided to take a route I hadn&#39;t seen before. After several hours I found myself lost, my phone had no signal and the landmarks i used were nowhere to be seen. It was as if i had walked into another time, everything was choked with overgrowth. The trail vanished and i could see no sign of human activity, no forest clear8ngs, roads....anything. Now that I think about it, there was no wildlife either, not even a single bird call.</p>\n\n<p>After about 15 minutes or so of looking for a road l, I came upon an abandoned house. The front door was gone and all the windows busted out but it still retained some of the charm of an old colonial mansion. It must have been at least 200 years old. Now, I have heard of antiques being found in old places like this being worth thousands of dollars, so with a new sense of adventure I walked in.</p>\n\n<p>&quot;Hello?&quot; I yelled as I crossed the threshold, unwilling to trespass just in case some squatter had made his home here. No answer. I entered.</p>\n\n<p>It was even more grand than i could have imagined. Though the windows were broken, letting the elements in to do their damage, there were many untouched antiques about. Silver trays sat on a table that could have sat 10 or more people, books from the 1700&#39;s that somehow had stayed safe from the rain. All manner of items,any one of which would fetch a tidy sum of money from a collector.</p>\n\n<p>Having inventoried the first floor , I made my way upstairs. More lavishness, iron-wrought beds , silver hair brushes and all mannr of objects. Hell with selling to a store, I could start a store with all I had found.</p>\n\n<p>With thoughts of money running through my head,I hadn&#39;t noticed the second set of stairs until I heard a creaking sound above me. I looked around, located the stairs to the attic and made my way up.</p>\n\n<p>Right about now you are probally saying to yourself &quot;Dont go in the attic dummy, every horror story starts in the attic&quot; Believe me,dear reader,  I wasnt thinking like that at the time. My mind was so filled with dreams of treasure it did not occur to me that my life might be in danger.</p>\n\n<p>I walked up the stairs making no attempt to be quiet, I was convinced noone was here. Opening the door at the top of the stairs I was met with foul, musty odor.I walked in and looked around.</p>\n\n<p>There were all manner of chairs and furniture stacked around the walls. A window with unbroken glass faced the door, and another door to  my left. Turning left i opened the door and tried to walk in. </p>\n\n<p>I made it about 2 foot in the room and could proceed no further because the floor was covered with ...with doll heads hundreds of porcelain doll heads....all propped up to look at the door...at me. Then i saw the shelves... dozens of shelves holding dozens..hundreds of decapitated doll bodies all carefully positioned with outstretched arms...reaching towards the door...towards me.</p>\n\n<p>Completely freaked out i stepped out of the room and closed the door. Then I heard a creak of wood behind me and to the right. I turned around.</p>\n\n<p>I didn&#39;t notice the rocking chair beside the window when I had first walked in nor had I seen the hunched figure slowly rocking in it, back and forth, back and forth.</p>\n\n<p>I was paralyzed with fear, i literaly couldn&#39;t move, couldn&#39;t even apologize or speak a word. The figure rose unnaturally as if gravity didn&#39;t matter to them.I couldn&#39;t make out any features except grey-matted hair poking out from a shawl the figure wore.</p>\n\n<p>The figure was standing, facing me while looking at the floor, I could not see a face...only two flicks of grey-blue light where the eyes should have been.</p>\n\n<p>Then it spoke.</p>\n\n<p>&quot;VISITORSSSS&quot; It said in a voice not quite male or female but very very old.</p>\n\n<p>Arms poked out from each side the shawl..muscular bare arms that were so long they reached the floor while the figure was still standing.</p>\n\n<p>&quot;VISSSIIITOOOORSSSS!&quot; The voice said again triumphantly, this time an arm made a fist and slammed it to the floor, blood, old and black stained the floor and dripped from the fist.</p>\n\n<p>&quot;VISSSSSSITOORRSSSSSS&quot; The other fist slammed down on the floor,  then the other over and over.. repeatedly it hit the floor slowly increasing in tempo and ferocity until both hands were bloody pulps.</p>\n\n<p>I took a step back, terrified at what i was witnessing, then the thing charged me.</p>\n\n<p>With a wail , a high pitched scream that could not have been made by a human voice it lunged at me.</p>\n\n<p>I felt a cold stab in my arm as it grabbed me with a strength i didnt think possible ,I smelt a disgusting fetid odor coming from it as it came close....to smell me. As it slowly sniffed I came out of my petrified state and yanked arm from its&#39; grip.</p>\n\n<p>Unbalanced from the action i fell backwards and down the stairs. The thing screamed in agony ,almost like a child you take a toy away from. </p>\n\n<p>Clutching my arm,I got up and ran to the first floor, it didn&#39;t follow but the walls began to shake from the thing once more beating the floors. </p>\n\n<p>As I made it outside the banging stopped, the house once again silent. After several hours i found a road and eventually a state trooper that took me to the hospital to fix my arm.</p>\n\n<p>Noone i talked to had ever heard of this place, and they might not have believed at all, if it hadnt been for the two inch long fingernail they pulled out of my wound.</p>\n\n<p>So as i said, not all that is abandoned is empty and not all trails lead home.</p>\n</div>\n","author":"Cthulu-Azathoth2020"}