{"rank":"190","title":"Canadian Paranormal Encounters: The Spectres of Sparks Street","id":"8jwfma","url":"/r/nosleep/comments/8jwfma/canadian_paranormal_encounters_the_spectres_of/","time":"1526489159000","body":"<div class=\"md\"><p><em>This is the third instalment of a series where I investigate real paranormal encounters in my home and native land. You can read the first two instalments here: <a href=\"https://redd.it/8jblkr\">Panic at Manic-5</a> and <a href=\"https://redd.it/8jkzyz\">Vision in the Rare Books Collection</a>. These encounters are all stand alone, so you can also jump in any time without needing to read the rest.</em></p>\n\n<hr/>\n\n<p>I was out to lunch with my colleagues the other day, and I asked them if they’d ever experienced anything paranormal. When they asked why I was asking, I started to explain my project, but you know how conversations with larger groups of people go: tangents come in like tides and drag topics away to a watery grave. Someone said something about writing back in college, and then someone else made a joke about construction, and splash, there goes my sandcastle.</p>\n\n<p>As we were walking back to the office, Dan crept up behind me.</p>\n\n<p>“BOO!”</p>\n\n<p>He was cheerful, as he always is. He gestured to come closer, so I got on my tippy-toes to bridge the distance. In a whisper, he proceeded to tell me he had a story for my little project.</p>\n\n<p>“It’s a creepy one,” he said, “but you can’t tell a soul.”</p>\n\n<p>“That kind of defeats the purpose,” I replied.</p>\n\n<p>He laughed and said I could share it, just not with anyone at work. (Here’s hoping none of our colleagues go on Reddit.)</p>\n\n<p>“No one’s going to believe you anyways,” he added.</p>\n\n<p>We’d just reached the office by that point and we were running a little late, so he told me to come get him during break time. A few hours later, we were sitting by the fountain in the atrium, and he was telling me this story.</p>\n\n<hr/>\n\n<p>Dan had been out with friends one evening in Ottawa about a month ago. He was, admittedly, a little tipsy when this happened, but nowhere near black-out drunk. He was a couple beers in when one guy suggested they migrate to a pub a couple streets down where they made better wings. Being a wing connoisseur himself, he enthusiastically approved of the change in venue. The group paid their bill and staggered out the door.</p>\n\n<p>They were at the intersection of Sparks and Metcalfe, headed down Sparks towards Bank St. I’ve personally walked that stretch of road a million times, and I can tell you from experience, it’s only a five-minute walk. Eight, if you’re a little drunk…ten if you’re <em>really</em> drunk and have a limp. Between points A and B, there’s just one other intersection, and that’s Sparks and O’Connor. Point being, it’s a very short, very easy distance to transverse, sober or otherwise. Plus, since Sparks is a shopping street closed to anything but foot traffic, it’s also pretty safe.</p>\n\n<p>Dan was lagging behind as the group arrived at the intersection of Sparks and O’Connor. He said he never actually <em>saw</em> the street sign, but there was really no other intersection it could have been. Like I said, there’s just one street between Metcalfe and Bank, and that’s O’Connor. His buds crossed the street just as the pedestrian light flashed red, and he got stuck on the other side. He wanted to run over, but there was a car roaring its engine impatiently, so he waited and pulled out his phone, sending his friends – and I quote here – “dank memes”. You know, so they wouldn’t miss him during his short absence from the group.</p>\n\n<p>From the corner of his eyes, he noticed the white flash of the crosswalk signal activating and sprinted across the street while fumbling to turn off his data plan.</p>\n\n<p>When he finally looked up, now on the other side of the intersection, he was stunned to find his friends weren’t there waiting for him. Thinking they’d gone ahead, he peered farther down the street to find them, and instantly felt his stomach drop.  That whole stretch of Sparks St. was completely empty. Not just devoid of his friends, but also of any other passerby one would normally find meandering around at that hour. His stomach’s second bottom, a secret trap door bottom only he knew about, gave out as he realized he couldn’t recognize any of the buildings, either. Some buildings were larger, some shorter, some wider, some narrower. Where there had been a patio with chairs earlier that very same day, there was now a large man-made hole and digging equipment. Instead of the Tim Hortons where he got his coffee in the morning, there was an abandoned-looking store taking up the space of <em>two</em> Tim Hortons. The gym was no longer a gym: it was an empty space obscured by scaffolding. None of the street lights were on, all of the businesses looked vacant. Less “Closed for the night” vacant, more “Abandoned for twenty years” vacant. </p>\n\n<p>At first, he thought it was construction rearing its ugly head again. They’re building a light rail transit system in the area right now, so it’s not uncommon to come to work one morning to find your street blocked off for construction, then go home that evening and finding a big hole at another intersection.</p>\n\n<p>Construction explained the change in scenery, but not his missing friends. He looked around for any sign of them, listened for any drunken laugh, but got nothing. He pulled out his phone to text them, but he’d somehow lost his signal in the middle of downtown Ottawa, where even the crappiest service providers reached.</p>\n\n<p>What else could he do but keep walking and hope to rejoin them on Bank St.?</p>\n\n<p>It was one block, just <em>one</em> block away.</p>\n\n<p>He quickened his pace, but as he did, more buildings came into view replacing the ones he’d passed. There were far too many buildings for the small stretch of road he was on. Long past where Bank St. should have been, there were bistros, gift shops, restaurants --- none of which he recognized, and all of which were empty and abandoned. Some of the signs had fallen off, some of the awnings were torn in two, and some of the doors were wide open and hanging off their hinges. He glanced behind him, and he could only see more buildings stretching out into an infinite void.</p>\n\n<p>Confused, he stopped and asked himself the questions you’d expect someone in his situation to ask: how much did I have to drink? Is this a dream? Did someone spike my drink?</p>\n\n<p>As he pondered these things, he noticed something in the window of the nearest storefront. From the look of the empty and cracked displays, it seemed it had once been a jewelry store, though there wasn’t even the smallest trinket left. Square in the middle of its large, store-wide window, was a figure standing in the darkness, black eyes shining like a cat’s in the night. Dan felt the cold grip of fear wrapping around his throat as he tried to avert his gaze, but found himself incapable breaking his stare. It was only when the hairs at the back of his neck started to prickle from an increasing fear that something was standing behind him that he managed to turn away. When he saw the dozens of silhouettes staring back at him from the storefronts on the other side of the street, he wished he hadn’t turned at all.</p>\n\n<p>They were everywhere: behind every window, standing at every door, sitting on every rooftop. Indistinct and uniform, melting into one another shadows, except for those big black eyes locked on him and him alone.</p>\n\n<p>Dan sprinted down Sparks St. trying to get away from the spectres, but with every step, they seemed to get closer. No longer content with just standing behind the windows, they began appearing on terraces, benches, next to statues… They’d move without movement, like animations in a flipbook with batches of missing pages between the actions. The street went on and on, the figures coming closer and closer, until he could feel a breath right at the back of his neck. Panting breathlessly, Dan closed his eyes, swallowed hard, and ran blindly.</p>\n\n<p>The honk of a car horn made his eyes shoot open. He stopped so abruptly he nearly gave himself whiplash. The car drove by, momentarily illuminating the street signs: Bank St., Sparks St. He turned around, and there was the Tim Hortons, the gym, the usual stores with their normal wares in the windows, and more importantly, his friends.</p>\n\n<p>“What the hell, man? How’d you get there? I thought you were behind us,” one of them said.</p>\n\n<p>They all looked pretty confused. He tried to explain what happened, but they were a little too drunk and way too loud to listen, so he just followed them to the pub and ate his wings in peace.</p>\n\n<p>Here’s the thing, I couldn’t tell if Dan was being serious or not. He had this big ‘ol grin on his face the whole time, like he always does, but I admit, it was a little more strained than usual. I don’t know if what he said is even <em>possible</em>, but I think about it every time I need to walk down that part of Spark Street, and I usually wind up going one block farther down to avoid it now just in case.</p>\n\n<hr/>\n\n<p><em>If you&#39;re interested in more Canadian paranormal encounters, check out the other instalments:</em></p>\n\n<ul>\n<li><p><a href=\"https://redd.it/8jblkr\">Panic at Manic-5</a></p></li>\n<li><p><a href=\"https://redd.it/8jkzyz\">Vision in the Rare Books Collection</a></p></li>\n<li><p><a href=\"https://redd.it/8l9pt5\">Last Ride of the Night</a></p></li>\n</ul>\n</div>\n","author":"manen_lyset"}