{"rank":"37","title":"Strange Davie's Bucket List","id":"8jwgxi","url":"/r/nosleep/comments/8jwgxi/strange_davies_bucket_list/","time":"1526489408000","body":"<div class=\"md\"><p>The bucket list challenge was the glue that was keeping us altogether. </p>\n\n<p>We were all different people and we all had varying, and sometimes contrasting, interests. By interests, I mean a lot of things. For example, Lily was competitive. In a bad way. She did so much to reassure herself that she was always the best. Majority of us didn’t like that. Mostly because she was arrogant about it. \nAnother example, maybe a little more on the romantic side. Henry was interested in Julie, but Julie was more intrigued by Kyle who often gave deep, thought-provoking arguments in #the-debate-table. However, I didn’t (and I still don’t) know about Kyle’s view on all of that.</p>\n\n<p>I could talk all day with that tea set, but if I had to offer up a suggestion on what made the glue so suffocating, I should talk about Strange Davie. </p>\n\n<p>To set things straight, I did not give him that title. He chose it for himself. I actually DMed him along the lines of “Are you sure you really want others to call you Strange Davie?”. Honestly, I couldn’t care less if he wanted to be known in that way. I wasn’t one to judge, especially about stuff over the internet. Some people use the internet for escapism. Maybe being strange was something he liked. The only thing that made me want to ask him if he really wanted the title was the lack of reaction when he introduced himself as such. </p>\n\n<p>Normally when new members join our server, there would be lots of cheers and ‘hellos!’. Yet in his case, the moment he entered the words – “Call me Strange Davie!” -, there was just silence. Majority was from the states, and it was late into the night for them, so they were online. There were chats ongoing in other channels. But on the #bucketeers-introduction, not even Julie mentioned a thing. It was pretty obvious that he was in immediate distaste.</p>\n\n<p>We were a small community of 10. Strange Davie made 11. If he was going to get ignored, things were going to get awkward for all of us very quickly. I wasn’t going to create a whole new group without Strange Davie to lecture the rest about it, or go through the trouble to DM them separately. So I thought the best way to do it was to ask Strange Davie about it privately. You know, voice out my concerns. Make sure he knew what he was getting himself into. </p>\n\n<p>Everyone in the community was nice. But the bucket list challenges were really what was keeping us altogether. After all, we all didn’t know one another before I opened a new server. We had never met one another IRL either, because we all lived in different countries or states. Just making friends online, ignoring what our parents used to tell us about not talking to strangers. It was fine. We were all adults. All with that barely-reached level of maturity. </p>\n\n<p>Maybe all, except for Strange Davie. </p>\n\n<blockquote>\n<p>:joy: :joy: :joy: You are against me being strange !!! :joy: :joy: :joy: </p>\n</blockquote>\n\n<p>Seeing his reply, I got a tad bit annoyed. I sent back a single smiley emoji. Not really wanting to start an argument, I decided to just fuck it and head to class (It was the afternoon. Time zones, remember?). There wouldn’t be much time to get onto discord when I’m supposed to be focusing on the lesson. I could deal with whatever shit Strange Davie was bringing onto himself once the day ended. <em>There’s still time</em>, I told myself. </p>\n\n<p>I opened my app that night to an inbox flooded with complaints from every single member. </p>\n\n<p>Except for Strange Davie.</p>\n\n<p>It was such a mess reading through the messages. After the third DM from Kyle who simply told me to check #the-hall and everything on #honey-talk-café after 11am in my time, I decided to do exactly that. Usually I don’t read through older messages because there would be so many, and even though I don’t have bots, I trusted everyone to keep themselves and one another in check. I headed to #the-hall first. For context, #the-hall is the place where we keep our bucket lists and we can edit our own for updates. </p>\n\n<p>Not everything can be on the bucket list posted onto this server. I didn’t want to promote ridiculous and harmful behaviour, so I banned anything that was explicitly sexual or designed to maim/kill others or had a high risk of hurting the bucketeer. The rules were pinned, and meant to be followed. Broken rules meant being banned for life. </p>\n\n<p>Now, Strange Dave’s bucket list was just… </p>\n\n<p>Actually, there was nothing wrong with it. </p>\n\n<p>It was just plain, albeit a little childish. Not really on the wavelength of extreme as other people. In fact, it felt like it was made by a kindergartener. If I hadn’t came with the assumption that maybe Strange Davie was rather simple or young, I would have thought it was a whole joke. I was just very confused.<br/>\nNext, I went to #honey-talk-café which is the place where we all hung out and chit chat about things that may be irrelevant to bucket lists. In other words, to make friends. </p>\n\n<p>Just like what Kyle said, the drama started at 11am. Which was when Henry sent a screenshot of Strange Davie’s bucket list and basically told him to be serious or fuck off. Henry was rather passionate in everything he did. And he expected everyone to be the same too. I was wholly amused at first, because I love drama. But when it grew more heated, I started getting a little more concerned again. While Henry was calling Strange Davie out on the list, the latter simply replied with: </p>\n\n<blockquote>\n<p>:joy: :joy: :joy:</p>\n</blockquote>\n\n<p>Just that set of emojis. It pissed Henry off even more, naturally, and he went on to @ me, asking me to kick Strange Davie out. Which only caused Strange Davie to reply with the same thing. Other members then came online to either fan the flames or try to calm them down, the key figures being Kyle, Julie and Clarissa. Kyle and Julie asked Henry to calm down, while Clarissa sent stupid stickers to ‘diffuse the tension’. Henry was still pissed and his threats were becoming personal. Again, Strange Davie only replied with:</p>\n\n<blockquote>\n<p>:joy: :joy: :joy:</p>\n</blockquote>\n\n<p>After about 50+ messages, Henry stopped. I figured he must have went offline to cool his head. Clarissa was trying to get Strange Davie to send anything else other than the emojis. She stopped when Lily came online and sent a gif (I can’t remember what, but like what I said in the beginning, not a lot of people liked Lily and Clarissa was one of them). </p>\n\n<p>When Lily sent that gif, weirdly enough, Strange Davie stopped sending the emojis. Instead, he sent a: </p>\n\n<blockquote>\n<p>Hello ! Can we start the game ?</p>\n</blockquote>\n\n<p>If Strange Davie was looking for a game, he was in the wrong channel. But Lily was apparently looking for a show, because she replied with: </p>\n\n<blockquote>\n<p>Sure! What game?</p>\n</blockquote>\n\n<p>Usually people ask “What game?” before going “Sure!”. But not Lily. That annoyed me a hell lot. </p>\n\n<p>I started typing out a long message, along the words of telling Strange Davie to tone his emojis the fuck down and that he now has his first strike for spamming (the first time someone has received a strike on their first day), and that no one should be entertaining such shitty behaviour. Halfway through my third-ish sentence, I stopped and realised that no one has messaged the channel since Lily’s message. Which was at 11:20am. When I checked it all, it was already close to 11pm. For the channel to be quiet for a little more than 8 hours was crazy. I know my people. It was hard to shut them up. </p>\n\n<p>And everyone was online. </p>\n\n<p>I went back to my DMs to message Kyle, in hopes of asking him if he knew why everyone was so quiet. The last message from him was also just after 11am. I hesitated. </p>\n\n<p>Everything felt very off. </p>\n\n<p>Now keep in mind that looking through those messages at that time, I wasn’t alone. I was out with my friends at a noisy restaurant and I was looking at those messages through my android screen. Nothing could have got to me. But looking at that screen, I couldn’t help but feel as if all sense of safety had been stripped away from me with the snap of the fingers. </p>\n\n<p>I opened the rest of the private messages from the members. Everyone was complaining about not being able to send messages on the channel, Henry was being particularly vulgar, but what stood out the most was Lily’s. It was a video clip. Just sent.</p>\n\n<p>The unease was setting in rapidly, but I had to see what it was. Taking out my earphones and plugging it into my phone, none of my friends took any notice of me. Which I was very grateful of because I wouldn’t know how to explain to them what happened on my screen next. I tapped on the video. </p>\n\n<p>The person shooting the video was definitely Lily. I heard her voice before – strong, confident and loud – in the karaoke channel. And if not for her voice, I could tell it was her because she turned the camera towards her face. Curly brown hair, freckles, and a humongous grin. I never told her but she was nearly ten years older than me. Who would listen to me if they knew I was barely in college? </p>\n\n<p>She was trying to hold in her laughter. It looked like she was in an office, judging from the working cubicle around her. Her office. She was still wearing a smart blazer and a tight black skirt. From the lighting, it looked like it was early in the morning. The place seemed empty, saved for a blonde man who was crouching right in front of her. I couldn’t recognize him from the array of fine colleagues that Lily boasted about previously. He even looked out of place, with his informal dark clothing.</p>\n\n<p>“This is my thirty-seventh challenge on my bucket list,” she breathed out excitedly, putting her face too close to the lens. I felt my heart drop into my stomach as I hurriedly tried to recall what was challenge #37. Lily was also up for those stupid challenges. Always doing too much for everyone’s own good, but too little for me to actually call her out on anything. But what would she do in her office? </p>\n\n<blockquote>\n<h1>37: Win at the annual Office Hide-and-Seek</h1>\n</blockquote>\n\n<p>Oh. That stupid office teamworking event. She started to run, blurring the video in the process. Even though it wasn’t necessary, she was recording everything from her phone. The blonde man continued to be in front of her, his black hoodie darting in and out of the screen. I could hear screams and laughter, but they didn’t seem to be near Lily. Frankly, I would have a heart attack if any of her colleagues jumped out to catch her. </p>\n\n<p>“We’re going to go higher up where not everyone has access to,” said Lily. I never understood who exactly she was directing the commentary at. They creaked open the door and crept up the stairs, moving ever so slowly. The whole time I tried to catch a glimpse of the guy’s face but I never succeeded. Who was this man? Lily rarely fulfilled challenges together with other people. \nShe lifted the phone up so that I could see their surroundings. It was a wide empty hallway with windows and doors to meeting room. Along the walls were cabinets and closets. It felt surreal looking at this empty office. From the digital clock, I saw that it was 7am in her time zone. Three hours before I met my friends. \nLily began fiddling with all the doorknobs, twisting and turning them. They were all locked until she reached the end of the hallway. The filing closet’s door opened. It exposed an empty space cosy enough for a grown woman. </p>\n\n<p>“I’m going to hide here until the game ends,” said Lily. This time, it was clear that she was speaking to the guy. The screen was dark. She had left her hand hanging by her side, swinging the phone every so slightly so that I could catch movement through the changing textures. The guy replied to her in murmurs. It was strange. I could tell that he was speaking, yet I couldn’t hear what he was saying despite Lily’s voice coming in strong and clear. He definitely had an accent. Something that crunched through his words. But before I could place what it was, the conversation was over. </p>\n\n<p>And then, I was looking at his face. </p>\n\n<p>He was your ordinary youth. In his early twenties. Blonde hair, blue eyes, a cheeky smile on thin lips. Long eyelashes and freckles on his dimpled cheeks. I wouldn’t call him handsome, but he was pleasing to look at. Friendly, charismatic. The type that you wouldn’t mind sharing a drink with. The type you would tell all your deepest, darkest secrets.</p>\n\n<p>His face was striking not because of what he looked like, but because he was a sudden presence. Someone unexplained. That was why I remembered those details. It felt important, as if he was going to play a bigger role somehow and sometime soon. \nThe door closed. There was a click. The camera left his face and switched to the perspective of the door shrinking in size as he walked away. I checked the timeline of the video. Ten seconds left. I expected something to happen within that little space of time, but the last frame was nothing out of the ordinary. \nI closed the video and returned to my DMs. Lily was online.\nI messaged her light-heartedly. Asked her if she won the game. There was no reply. But the #the-hall channel was highlighted, which meant that someone had updated their list or completed one of their challenges. I thought that it would be from Lily, but it turned out that Strange Davie had completed his first challenge. </p>\n\n<blockquote>\n<h1>1: Play Ring-Around-the-Rosie (Completed)</h1>\n</blockquote>\n\n<p>I hesitated to congratulate him. Something felt very off, and my gut was usually never wrong. Everyone was still online, yet no one was messaging at all. It just felt so weird. After a minute of thinking through my options, I pushed away the dread and sent a thumbs-up emoji. It was just moderator courtesy, right? </p>\n\n<p>The #honey-talk-café channel turned white. </p>\n\n<p>Lily had sent a news report on a fire outbreak in an office building. There was one death. </p>\n\n<p>And all the messages came streaming in at once. Confused, panicked, worried, angry. Many spammed on how nothing they sent was coming through. Apparently, I wasn’t the only person that received that video from Lily. They forwarded Strange Davie’s message from #the-hall with a full stop. Some replied the news report. </p>\n\n<blockquote>\n<p>Isn’t that Lily? </p>\n</blockquote>\n\n<p>I’m not ashamed to say that I closed the discord app. I returned to my IRL friends and temporarily lost myself in their frivolous gossip. There was no way I was going to deal with all that paranormal dead shit in discord out of all places. It was probably a troll. I could fact-check in the morning. The moderator needed her rest. </p>\n\n<p>For the entire night, I muted the notifications. And I think with all of what has happened since then, that night was the only peace I was ever going to get in the longest time. </p>\n\n<p><a href=\"https://www.reddit.com/r/nosleep/comments/8kbf4d/strange_davies_trial/\">Update: Strange Davie&#39;s Trial</a></p>\n</div>\n","author":"snekcact"}