{"rank":"3","title":"Horned","id":"8jwhk9","url":"/r/nosleep/comments/8jwhk9/horned/","time":"1526489543000","body":"<div class=\"md\"><p>He stood alone, battered and bruised, bleeding profusely from his right shoulder. The scenery that of a scarlet nightmare. Souls flew up and down, heaven to hell. Eyes almost closing from tiredness and pain. Everywhere around him there were corpses, still bleeding from the fatal wound they received, pouring onto the scorched earth. The man was at his last stand.</p>\n\n<p>He bared his teeth, stiffened his muscles and got into a posture. The cause of the bodies, the root of evil right in front of him. Just a step forward and he could get in range to slash it.</p>\n\n<p>One. Just one swing of his axe was all the man needed to end this event of hell.  A single attack with all of what’s left of his strength. Sweat and blood seemed to be endlessly flowing from him. His mind in a daze but his will steeled and sharp. The once sharp and deadly axe now dull but still able to inflict grievous wounds.</p>\n\n<p>The clouds were smoky red and the sun behind it searing everything. No crows were idiotic enough to watch but curious ravens sat upon the broken spears of the broken soldiers. No battle in the history of mankind was this gruesome. If God had glanced upon this scenery from the heavens, He would turn back with repulsion.</p>\n\n<p>Humanity itself knew that there was only one way out of this curse. There was no option of retreating. Blood was sure to be spilled.</p>\n\n<p>Hot wind and burning ground caused the man’s skin to meld together with the metal plate covering it, making him flinch. But his focus wasn’t altered. This was the moment of truth and not even the ravens dared to blink.</p>\n\n<p>The behemoth in front of him, the creature of Satan himself. Named by men, the Horned. It’s hooves burned with a radiating black fire. It’s claws like obsidian swords. The horns a jagged spear.It’s eyes which spoke of the Devil.</p>\n\n<p>Three million twenty five hundred thousand forty five thousand nine hundred seventy four soldiers. Five million sixty six hundred thousand twenty one thousand five hundred twenty one lives. This creature walked a path of blood. It stained the continent red. The prophecy foretold of the Horned.</p>\n\n<p>It stood in front of him. As battered as he is but still breathing in the ashes. The man didn’t realize the predicament he was in and it made the mammoth chuckle. As soon as the man heard the smug laughter, he brought down the wrath of millions upon its head. Fire burst out, melting his sword and face but he immediately retreated, hand on his wound, exhaling sparks of flame.</p>\n\n<p>With a decimating attack, the harbinger was no more.</p>\n\n<p>The knight didn’t roar a victorious shout nor did he show any sign of happiness. Relief. Relief that came from a single second of victory but vanished after his thoughts returned, haunting him, mocking him.</p>\n\n<p>___________________________________________________________________________</p>\n\n<p>In a town, built in the name of the Knight, a boy would be born.</p>\n\n<p>Years and years later, the boy would find a scroll that the Knight had found when he was still on this earth.</p>\n\n<p><strong><em>One</em></strong> <em>of the Horneds.</em></p>\n</div>\n","author":"BartenderInLimbo"}