{"rank":"0","title":"Sleepless Dreams [Part 1]","id":"8jwohk","url":"/r/nosleep/comments/8jwohk/sleepless_dreams_part_1/","time":"1526490910000","body":"<div class=\"md\"><p>When adolescent life starts, a flood of feelings and the longing for new sensations are welcomed into an individual. With peers being overly critical to both themselves and others, depression is more likely to happen during adolescence than after the age of 23. My mother thought adolescence was the cause of my suicidal thoughts when I was 15, but it wasn’t.</p>\n\n<p>I mostly saw the world with a pessimistic outlook. I looked at people and I see their faces, judging me. Those secretive eyes with their hands on their mouths, whispering in reply to my awkward, insecure body posture. Every night, my dad would come home drunk to my mother who was bent backwards raising me not to be him. So it wasn’t entirely my fault when I say I mostly focused on the negative aspects of everything.</p>\n\n<p>I used to ask myself why the world is so dull and harsh without looking at it from another point of view, but I was right; the world is harsh. The world can do anything it wants to you because she doesn’t have a conscience. She hits you everywhere you already hurt and leaves you in a dark, wet alley to suffocate in your own blood, whimpering because it is nearly impossible to call for help.</p>\n\n<p>That was my world, or before it stopped spinning, rather.</p>\n\n<p>I open my eyes and see what looks like the interior of a small cabin in a winter night. It was nothing if not a tiny lodge perfect for a recluse. One of its windows were broken, revealing a faint, yellow light dimmed by the heavy snowfall through the stone-sized hole.</p>\n\n<p>I saw a rope, a pocket knife, and a six-shooter appear on my hands as a taste of metal suddenly rushed to my mouth. All of these sensations come at me at a fraction of a second. </p>\n\n<p>I felt like I couldn’t breathe. Next, a twinge occurred on my wrists as the wind enters the cabin through the small crack on the window. It was freezing.</p>\n\n<p>They all engulf me as I am hovering over the ground, terrified of what is around my neck and the objects within my trembling grip.</p>\n\n<p>I woke up, screaming, quivering as my clock was about to hit 6:00am. It was exactly 5:59am.</p>\n\n<p>I raised both of my trembling hands, also relieved that the horrifying ordeal was a creation of my mind.</p>\n\n<p>I shook my head quickly, trying to forget the oddly vivid nightmare I went through.</p>\n\n<p>I get up from my bed, and I dress up to get ready for school.</p>\n\n<p>————————————————————————————————————</p>\n\n<p>I never liked school. Being with people your age, especially when you’re 13, weakens your vulnerable self-esteem with people especially capable of targeting your insecurities easily and preying on them to assert power. It was hard to make friends for me at that age. I was comfortable being alone.</p>\n\n<p>I usually sat on the lunch table and read a variety of books like crime-mysteries and the occasional manga while eating a slew of food.</p>\n\n<p>I notice a 5”6, red-haired girl wearing a graphic shirt, blue jeans, and thick eyeglasses.</p>\n\n<p>For some reason, I don&#39;t remember her face clearly.</p>\n\n<p>I sense trouble when I see it.</p>\n\n<p>“<strong><em>Hey.</em></strong>”, said the mystery girl.</p>\n\n<p>I sat there in silence.</p>\n\n<p>“<strong><em>You read cybercrime too?</em></strong>”</p>\n\n<p>“<strong><em>I read everything.</em></strong>” I replied abruptly, irritated by her presence. I raised my copy of <em>The Fallen</em> in eye level to exclude her from my view.</p>\n\n<p>I then hear a loud thud on the practically unoccupied table.</p>\n\n<p>I put down the book in surprise, and she’s gone.</p>\n\n<p>Out of curiosity, I flip the piece of paper ripped from a math notebook.</p>\n\n<p>It said “<strong><em>How cold was the breeze?</em></strong>”</p>\n</div>\n","author":"7PackFlans"}