{"rank":"0","title":"THE HOUSE","id":"8jws0k","url":"/r/nosleep/comments/8jws0k/the_house/","time":"1526491618000","body":"<div class=\"md\"><p>Hi my name is Adam I have to get this off my chest it&#39;s a story of my first summer job. I got hired as a Land ranger for a national park all I did was drive around and tell unwanted guest to leave the unmarked trails and get back on. One day I was riding the land rover we used to drive around I was on my normal route when I passed a tall black figure I stopped and yelled at him sir get back on the marked trail. The figure left and I drove by an old house I got a weird feeling every time I drove by it but it was only storage for us, as I raced back to the camp I heard a distress call saying missing 14 year old girl last seen on the main trail that was a trail I checked on my way to the house. When we get a distress call we shut down the trail they went missing on. When I radioed back it didn&#39;t work so I drove to the main trail drove up and down it but I didn&#39;t see any other worker there I drove a mile around looking in the trees for signs of torn clothes or blood marks but i didn&#39;t see anyone but I turned my head and saw smoke like a fire started it was at the storage house so I raced there and when I got closer the smoke just stopped and when I said who&#39;s there no reply so I walked into the house a tight little path was the only way to get through so when I came to the fire place which was tucked behind an old dusty winter holiday set.</p>\n\n<p>I looked into the fire place and saw nothing to show a fire was started or stopped. I walked out the house and hoped in the land rover and drove back to the trail looked once more for the girl nothing, so I drove back to the station and said to my boss her sir I didn&#39;t find the girl and a smoke was coming from the old house but I checked it out and nothing was in there My boss pale as a ghost said NO NEVER GO IN THAT HOUSE in a small scared voice. I asked why and he said nothing but Adam go back to work just stay away from that house I said okay sir and went back to work I drove on the main trail and say a small black figure standing next to a tall black figure like the one I say before I said please leave this trail and get back to another this one is closed. I watched them slowly go into the air almost like they were going and flying I just looked at them and then looked at my watch my shift was over.</p>\n\n<p>The next  week I drove the main trail and saw a small piece of a shirt hanging in a tree so I walked to it picked it up it was the girls I thought how could this be the girl went missing a week ago and I searched this place three time each more  carefully then the last. So when I saw this i walked that path and saw a bloody hand print on an old tree I flowed it further and further and saw more blood but I didn&#39;t find the body at all. I got mad at myself more then anything else because I did check this area. I drove the trail and saw the storage house with smoke coming out of it again this time I just went to it and looked in the window saw no one and nothing so I drove away. I kept seeing the black figures roaming the path like they were looking for someone or something never the less I said sir do you need help finding something no reply I got mad at this and drove to them, they didn&#39;t even move i drove through them. I got a chill down my spin and drove away. </p>\n\n<p>The week we found the girl was the week I got more intense of the hunt for her body I took the land rover through the woods where I found the the clothes and blood trail i followed it more and it led to the house. I drove up to the front door and I walked into the house all the items were moved and I saw no blood but out the window I saw the 14 year old blonde girl I ran out the house after hearing a scream as I left the house I saw a vision of a man he looked like me but a tall dark shadow with a gun shot to the head like a suicide not a murder, I yelled sir are you okay he looked back and I saw only a bullet hole in his face I fell to my knees and cried a little and as I looked I saw him drawing closer and closer and the girl crawling with her organs dragging behind her I started to panic and crawl back but it didn&#39;t do anything I sat there like a statue. I came to at my house with a note saying the house you shouldn&#39;t have entered you&#39;ll be haunted by those visions ALL OF YOUR LIFE with the all of your life in red ink. I sat up and dressed to go back to work but when I showed up it wasn&#39;t the same I saw only the black figures and only the girl crawling around. I told my boss sir I can&#39;t do this I have to quit my boss told me You can&#39;t once you seen the vision you can&#39;t leave you are stuck here for life. I ran to the house and took a good look at it it had changed and looked newer and said welcome home Adam. I cried and criend fell to my feet and the figures grew and grew around me like a jail cell.</p>\n</div>\n","author":"captainspauldingsson"}