{"rank":"72","title":"My sister is coming to visit? But I'm an only child (Part 1)","id":"8jwxsb","url":"/r/nosleep/comments/8jwxsb/my_sister_is_coming_to_visit_but_im_an_only_child/","time":"1526492773000","body":"<div class=\"md\"><p>  So it&#39;s time that I think I should share, what still is the scariest thing to ever happen to me. I should start by letting you know I was 15 and wasn&#39;t a believer of the paranormal in anyway at the time. I&#39;m a seer to believer and what I saw back then definitely made me a believer. I was always very interested in the paranormal, despite the fact I didn&#39;t believe it. I always loved reading about urban legends, windigos, skinwalkers and poltergeists. I was a big fan of horror stories and the like.</p>\n\n<p>  So a couple years ago my Grandma&#39;s health took a turn for the worst and needed constant care. She lived in Georgia and my family lived in Florida, but family comes first in our family. So luckily my mom and dad found a house in Georgia for a reasonable price; not too far from Grandma&#39;s and actually found branches of their already current jobs about 30-45 min drive. So as you can tell my parents were relatively busy at the time. I&#39;m an only child and had a great relationship with my parents. Especially my dad who was just a big a nerd as me. We play pranks on each other and love gaming together.</p>\n\n<p>  Now the property we bought didn&#39;t look out of the ordinary. 3 bed, 2-1/2 bath. Big yard and the woods behind that. We had neighbors, but seem to mostly keep to themselves; we weren&#39;t social neighbors ourselves, so no complaints here. There was so much land in between the houses that even if one of us were hosting an outside party you would barely hear anything next door. We spent the first week trying to get everything together, my new school, our furniture and checking in on Grandma. So we didn&#39;t get our cable and internet setup for a while. </p>\n\n<p>   My first week of school was terrifying, as it would be for any kid going to a new school. I made a couple of new friends Jason, Carlie and Sam. The seem very nice and was even kind enough to show me around and help me find my classes. But, when I return home to my still unfinished house, nothing was set up and no one will be home till late evening because after work my parents always went straight to Grandma&#39;s and spent some time there before heading home. So with nothing to do or anyone to talk to I decided to check out the area.</p>\n\n<p>   First I walked around the neighborhood; ghost town was more like it. Barely any sign of life except for the birds flying. Cars in driveways but the houses always look vacant, very rarely I saw any of my neighbors and when I did they were always in a rush to go back inside. Not like running, but more of fast walking while always looking at me like I was stupid for actually enjoying the outside world, but I brushed it off as just lazy people with more important / unimportant things to do inside. </p>\n\n<p>  The woods behind our neighborhood reached for miles, but as long as I don&#39;t venture too far in I can always find my way back. I was no stranger to the outdoors and knew how to spot land marks to find my way back, so I had nothing to fear...or so I thought. Everything seemed normal at first, saw a couple deer, wild rabbits, the occasional bird squaking for a mate. Then after about 30 of wandering everything stopped. Suddenly the woods were dead quiet; I was immediately unsettled. &quot;Something&#39;s not right&quot;, I thought. I stopped dead in my tracks and panned the area. Nothing. Absolutely nothing. No sign of even the smallest hint of life.</p>\n\n<p>   That&#39;s when it hit me. An odor so foul and sudden I gagged and threw up almost immediately, it hit me by complete surprise and without warning. It smelled rotten and sour, slightly metallic too. I&#39;ve never smelled anything to compare to this stench. I looked around, still silent as a graveyard. I walked a little ways back to escape the smell; it wouldn&#39;t leave. Like it was imbedded in my nose and not fading in the slightest. Trying to hold back what&#39;s left in my stomach I decided it was time to head back. Still the smell followed and as I was walking back I stumbled and almost tripped over a huge root protruding from the ground.</p>\n\n<p>  I stared at what cought my footing, still trying to cover my nose and mouth from the lingering stench. This &quot;root&quot; was....off. It sticking upwards, reaching up from the ground. Brown and thin, now slightly bent from my accidental stumble. Maggots fell from the now broken part. &quot;What the fuck&quot;, I said quietly out loud to myself, as my eyes moved upwards from where the root was coming from. That&#39;s when I noticed. What I was looking at wasn&#39;t a root and what I thought was possibly a rock or some kind of small lumber under some leafs above this root. Was in fact a now unearthed face; the eyes were long gone and its skin was now browned and dry, like its been there for ages.</p>\n\n<p>   My eyes were locked looking into what looked like two black caves where its eyes once were. Its final strands of hair barely holding on to this cracked paper thin skin.  This corpse looked as if it was screaming at the heavens. But it&#39;s hand has changed, what was an open reach for the sky...is now a closed fist. I was looking at this thing for awhile, frozen in fear of what my brain is trying to process. I know, even after I tripped over it, its hand was open. I remember because I thought the fingers were the smaller ends of the root. Not wanting to stick around, I ran home.</p>\n\n<p>  As soon as I got back I called the police and reported the body, I then called my parents to inform them of what I found as well. Not 10 minutes pass before my parents and the police arrived and I started leading them to what I found. With dogs leading, me right behind to lead the way and also with my parents and the cops following. Now I know it was getting dark, but I showed them as best I could the area I found the body. Of course we find nothing, no smell, no protruding hand and no body to be found. After hours of searching around, angered faces of the cops and disappointed faces of my parents for wasting everyone&#39;s time. We decided to head back. That&#39;s when I noticed, there, without a doubt in my mind, I see the exact spot where the body was. Was now just some disturbed dirt. </p>\n\n<p>  &quot;That&#39;s not possible&quot;, I said as my skin went white and my blood went cold. That body clearly has never been moved and I know that no one saw me see the body, there was absolutely no sign of life when I found it. So I knew no one could have possibly moved it after I found it. Suddenly I heard a branch snap in the opposite direction of where the cops and my parents were walking to head back to the house and a sickening yet familiar smell fills the air. Deep in the woods almost too far to see, I see something slightly peeking from behind a tree in the distance. There it was, standing, watching me. As still as the surrounding trees, it watched me with its vacant eyes. My mother yells for me to catch up in an annoyed tone. A split second distraction, just enough time for it to disappear apparently. </p>\n\n<p>  I looked around, searching for what I knew I couldn&#39;t have possibly seen; before sprinting to catch up with the cops and my parents. After having a serious conversation with the cops for filing a false report. I waited for the inevitable scolding by my parents, but they seemed too upset to talk now. Now the 3rd room in the house was gonna be me and my dads game room. We had about 5 consols together and were gonna make our dream man cave in this new house. So I was extremely upset when I see my dad emptying the room. Trying to plead with my dad not to punish me by getting rid of the only thing I was looking forward to in our new home, he stared at me clearly aggravated. Then he starts the inevitable rant about what just happen before ending it with something that confused me more than anything I&#39;ve ever heard. At the end of his speech he said, &quot;Plus your sister is gonna need a place to sleep when she visits.&quot;</p>\n\n<p>  There was a long silence as I stood in the doorway watching my dad put the few things we put in the room in the box we took it out of. Confused I asked, &quot;Sister?&quot; He looked at me with a combination of confused and annoyed, &quot;Yes genius, your sister, I told you she was coming to visit and stay with us for awhile, she&#39;s also gonna babysit you since now we can&#39;t leave you unsupervised apparently without getting into trouble.&quot; I just stood there, still trying to process what my dad was saying. &quot;She&#39;s done with her hiking trip and will be home soon, she&#39;ll just be right next door to your room just like when you were kids.&quot; When my dad keeps talking about my sister, he sounds like he&#39;s reading a script. His voice losing all emotion like it&#39;s on auto pilot when he speaks. He talks with wide eyes, like he can&#39;t even believe what he&#39;s saying. He forms a smile too big for his face. As he starts looking up at me with bloodshot eyes, tears running down his face and a face so red and veiny that you would guess he was either just now laughing way too hard or was angry beyond compare. As he states, &quot;And she&#39;s been waiting; so long to see you again.&quot; He finishes his sentence and his normal face returns. He then goes back to packing everything away like normal. I was shaking in fear, crying silently and only was able to say, &quot;But dad, I don&#39;t have a sister...?&quot;</p>\n\n<p>Sorry for how long this is, but I want to best recount this time in my life without the unimportant details. The next part takes place in about 4-5 days after that night. </p>\n</div>\n","author":"delgalu"}