{"rank":"1923","title":"You have new DNA relatives","id":"8jx1b6","url":"/r/nosleep/comments/8jx1b6/you_have_new_dna_relatives/","time":"1526493515000","body":"<div class=\"md\"><p><a href=\"https://www.reddit.com/r/nosleep/comments/8k7dje/you_have_new_dna_relatives_part_2/\">Part 2</a></p>\n\n<hr/>\n\n<p>A few years ago, I had one of those DNA kits done, since I never knew my father. Through the DNA relatives feature, I had gotten in touch with two cousins, an aunt, and even a half-brother. So when I saw the email – <strong>You have new DNA relatives</strong> – my heart began to skip.</p>\n\n<p><em>Maybe it’s a half-sister,</em> I thought. <em>I always wanted a sister… to swap clothes with, talk about boys with, and –</em></p>\n\n<p>I stopped.</p>\n\n<p>There was just one entry in the email.</p>\n\n<p><strong>Anonymous – 100% of DNA shared</strong></p>\n\n<p><em>Wait. That doesn’t make sense,</em> I thought. <em>How could someone share 100% of my DNA?</em></p>\n\n<p>I fiddled with my hair. Tapped the computer desk. Scrolled through the email all over again; up and down, up and down. <em>Wait. If they share 100% with me, wouldn’t they…</em> be <em>me?</em></p>\n\n<p>And then an even worse thought crawled into my mind.</p>\n\n<p><em>They’d be an identical twin.</em></p>\n\n<p>I grabbed the phone and called my mom. She was never one to lie, but who knows? Maybe she had twins, and put the other one up for adoption.</p>\n\n<p><em>Riiiing. Riiiiing.</em></p>\n\n<p>“Hello?”</p>\n\n<p>“Mom, I got the strangest email,” I said, accusation creeping into my voice. “The DNA service – it found another family member.”</p>\n\n<p>“Oh, that’s great!”</p>\n\n<p>“No. Mom.” I took a deep, shuddering breath. “It says I share 100% of my DNA with them.”</p>\n\n<p>“What?”</p>\n\n<p>“They’re <em>identical</em> to me.”</p>\n\n<p>“I don’t understand, Callie.”</p>\n\n<p>Anger bubbled up inside of me. “It’s a twin, Mom. It has to be. How could you lie to me, all this time? You <em>know</em> I always wanted a sister –”</p>\n\n<p>“Callie, stop. You’re acting crazy.”</p>\n\n<p>“Don’t lie to me, Mom!”</p>\n\n<p>“Callie – ever since the accident, you’ve been freaking out over every little thing. If you put as much effort into your classes, maybe you wouldn’t be failing.”</p>\n\n<p>“Mom –”</p>\n\n<p>“You don’t have a twin. End of story. Now, I have to get back to work.”</p>\n\n<p>I didn’t believe her. But I said goodbye and hung up the call.</p>\n\n<p>Well, it turned out she was right. Because the next day, I got another email. <em>You have new DNA relatives.</em> And this time, when I clicked on it, there were more.</p>\n\n<p><strong>Anonymous – 100% of DNA shared</strong></p>\n\n<p><strong>Anonymous – 100% of DNA shared</strong></p>\n\n<p><strong>Anonymous – 100% of DNA shared</strong></p>\n\n<p>Yes. There were <em>three more</em> of them, now. And I doubt my mom had identical quintuplets – if that’s even a thing – so I called her back and apologized.</p>\n\n<p>“It’s probably just an error with the software, Callie,” she said. “I wouldn’t worry about it.”</p>\n\n<p>But I <em>did</em> worry about it. And I was still angry with her. Maybe if she had known who my birth father was, I would’ve met him before he passed. And maybe he would’ve had some kind of answer. It was far-fetched, but I had no one else to blame.</p>\n\n<p>That night I slept poorly. My dreams were addled with strange, vivid images of the four of them. Four twins, four clones, all looking exactly like me. Green eyes. Pointed chin. Large feet. Tiny hands.</p>\n\n<p>But each was <em>slightly</em> different. One had a mole on her cheek. Another didn’t have bangs, because she didn’t have that scar on her forehead. A third was skinny and svelte, like I had always hoped to be. The fourth was missing the tip of her pinky.</p>\n\n<p>I awoke at 6 am – my heart pounding, nearly out of breath.</p>\n\n<p>And that’s when I heard it.</p>\n\n<p><em>Clack. Clack. Clack.</em></p>\n\n<p>Someone was at the door.</p>\n\n<p>I raced down the stairs, stumbled over the rug, and raised my eye to the peephole.</p>\n\n<p><em>No.</em></p>\n\n<p>Green eyes.</p>\n\n<p>Staring back at <a href=\"http://blair-daniels.com/\">me.</a></p>\n</div>\n","author":"BlairDaniels"}