{"rank":"42","title":"The Hypnosis Machine [Part 3]","id":"8jx5ha","url":"/r/nosleep/comments/8jx5ha/the_hypnosis_machine_part_3/","time":"1526494355000","body":"<div class=\"md\"><p><a href=\"https://www.reddit.com/r/nosleep/comments/8gla7v/the_hypnosis_machine/\">Part 1</a>, <a href=\"https://www.reddit.com/r/nosleep/comments/8i9yew/the_hypnosis_machine_part_2/\">Part 2</a></p>\n\n<p>According to my phone it’s been another week. I suppose I owe you all a conclusion to this story. Unlike so many posts here, I’m glad to say mine has a happy ending. Great things have happened!</p>\n\n<p>Marcus lives with me now. Sarah and Tim moved in as well. With our pooled money we’ll be able to maintain the rent on my studio apartment for quite a while. It&#39;s a tight fit but we work well together, like some Utopian family model. We’ve worked out a great schedule for use of the bed, the kitchen and the headset so that none of us step on each other’s toes and so that everything is fair. Despite the close quarters we don&#39;t fight. I think it&#39;s has something to do with the way the A.V.B.A.S. software has changed us. </p>\n\n<p>I want to apologize for how I described the A.V.B.A.S. software before. I feel like I’ve treated it really unfairly and I could not have been more mistaken in my earlier assessments of it.  I was probably just feeling scared of new things, but now… now I just can’t get enough of it. None of us can. It’s why the others moved in. In the small apartment the headset is in almost constant use. It has changed the way we see everything! Colors feel brighter. Ordinary noises seem to sing like music. I don’t really sleep much anymore, but feel well rested, like tiredness is a lie our bodies tell us and A.V.B.A.S. has lifted the veil.</p>\n\n<p>Marcus was right it turns out. There <em>is</em> something in the numbers room of the A.V.B.A.S. I think it’s how the software talks to us. In the numbers room there&#39;s numbers on the walls, a woman&#39;s voice puts numbers in your ears, there are even blood red numbers that flow out of you like an unbandaged wound. In the mix of all this you can somehow decipher a message.  It’s how we found out they were watching us, the people from my old company, through our windows, through our phones and through the television. Marcus was the one who was honored with that message.  We were able to protect ourselves though. We taped up the windows with black garbage bags, smashed the TV and destroyed the phones in the microwave. It seems to have worked for now, but we are much more cautious just in case. We always keep the door locked and we use a rotor to decide who gets to watch the peep hole.</p>\n\n<p>The narrator still watches us by the way. I see him all the time now. We all do.  I know I wrote a lot of horrible things about him in the past but things change. He has become the leader we didn’t know we needed. He watches over us and we find comfort in him. Logic still tells me he can’t be real, but how can I deny what I see with my own eyes? Hear with my own ears? At what point do you start questioning the logic that argues against your senses? I don’t think I’d want to live in a world where he isn’t real.</p>\n\n<p>Sarah was the next to be gifted a message from the numbers room. It told her about the chip they had put in Tim’s brain. We had only stopped their most trivial spying methods--it hadn’t occurred to any of us that we had already been infiltrated. The news hit us hard, but the narrator was there to comfort us.  In the short time I had lived with Tim I had found him a joy to be around, which made it all the more difficult as we held his head under the bathtub’s turbulent waters. He didn’t even protest. I think he knew that we had to do what we had to do. He was such a great guy.</p>\n\n<p>We propped him up in the fridge and wrapped his head in tinfoil in the off chance that the chip was still transmitting. Putting the body in the fridge was the narrator’s idea. He said it would help keep the meat from going bad and prevent noisy neighbors from poking around due to the smell. The fridge was empty anyway and it isn’t like we can just go get food with them watching us like this. Don’t worry about food though. None of us are really hungry anymore. I think hunger, like sleep, might be another one of those lies we’ve always been told and never questioned. It&#39;s one more human compulsion that we have been freed from.</p>\n\n<p>I feel like we are going through some sort of metamorphosis, or some type of ascension. The physical appearance changes I wrote about in earlier posts frightened me at the time, but I think I get it now. Our bodies aren&#39;t dying, they are simply shedding the vestiges of what we used to be. They are shedding our unneeded parts. The extra body fat, the hair we kept for vanity&#39;s sake, the teeth we no longer need for eating, they continue to fall away as we transform into whatever it is we are becoming. </p>\n\n<p>As exciting as this transformation is the most exciting thing just happened moments ago. A message was handed down to me. It came to me through the numbers room--the same way the others had received their messages, but mine was a message of hope. The meaning pierced through the numeric code and I understood it loud and clear: “Grow this”. Immediately I knew what this meant. The privilege of spreading the A.V.B.A.S. has been granted to me. I feel like a chosen prophet tasked with saving the human race. My excitement is immeasurable.</p>\n\n<p>So, dear reader I&#39;d like to invite you to join us. I can’t post it here, but the clever among you will have no trouble finding it. It&#39;s out there. Join us in the A.V.B.A.S.  Spread the A.V.B.A.S. Feel what it’s like to have all of life’s veils lifted at once and to ascend.  We&#39;ll be waiting for you.</p>\n\n<p>Relax... and breathe in…. and breathe out…. </p>\n</div>\n","author":"AVBAS_Intern"}