{"rank":"79","title":"i began calling him the window man.","id":"8jxf89","url":"/r/nosleep/comments/8jxf89/i_began_calling_him_the_window_man/","time":"1526496405000","body":"<div class=\"md\"><p>This happened when I was seven years old. I was living in an old farmhouse in Pennsylvania that was surrounded by acres and acres of woods. Our neighbors were the McKellen’s, and they lived five minutes down the road by car. When I would climb onto the roof from my bedroom window at night, I often got dizzy from the silence. Even the bugs fell asleep after 10 p.m. in my town. \nIt’s the way my mother liked it, and except for meeting me at the end of the hill where my school bus stopped, she didn’t leave that house for six years. My mother was afraid of people and the open air. She’d be shaking and whispering to herself when she picked me up at my stop, and we’d spend the walk back doing breathing exercises together.</p>\n\n<p>My grandma would bring us groceries from her local store 45 minutes away and occasionally I would sleep over at her place and we would go to the park and play dominoes. I remember being so awestruck by the crowds of children and parents grilling and reminiscing in that park. It seemed so loud, a severe feeling that I never got at home. </p>\n\n<p>This is all to say that me and my mother lived in solitude. An open desert of wilderness and quiet. </p>\n\n<p>So the day that I saw the man outside of my bedroom window I knew that something was off. I had been playing with my barbies on my dresser when I saw movement outside the window and I looked up to see this figure in the distance. He was very distant, at least a mile back through the clearing in the woods. He was just a pinprick in the scenery, his body moving in a way that suggested running, though he didn’t seem to be getting any closer. I attempted to figure out the details of his body but the distance was too far to make out anything. </p>\n\n<p>I remembered then that my mother would watch birds with binoculars out of the kitchen window, and that she kept them on a hook in the pantry for quick access. So, I walked downstairs quietly and slipped past my mother. Though I wasn’t scared at this point, I still knew better than to tell her about someone approaching the house. It would work her up into a panic and he likely wouldn’t even be here for us. </p>\n\n<p>As I returned to my room with the binoculars, I looked quickly out the window closest to my door and noticed immediately that the man was gone. The clearing was empty, not even birds or deer crossing the gap. In a way I was disappointed—this was going to be something cool, a mystery to solve while waiting for school to begin again on Monday. I walked across the room and set the binoculars down on my dresser, prepared to get back into whatever barbie soap opera I was currently creating. Except, through this window, I saw him again. He was in the same place, once again flexing and twitching as though he was running, but not making any progress. It was as though he was stuck or being held back by something. </p>\n\n<p>It didn’t make any sense. Not 10 seconds earlier I had looked through the window and he had disappeared. I picked up my binoculars and looked more closely at the figure. It was at this point that I felt goosebumps rise on my arms. The man was completely dark, the absence of light in the shape of a man desperately running for his life. I still couldn’t see him very well, but what I did note was that he was not moving forward at all. It was like I was staring at someone being projected on the screen that was our backwoods. Like he wasn’t even connected to the outside world. </p>\n\n<p>I put the binoculars down and made the decision that I had to tell my mother, if only so I would no longer be the only one aware of this strange thing. This time, once again, as I walked across the room, I stared out the window closest to my door and saw an empty clearing. I stepped back in shock and paused while I thought about what I was going to do. </p>\n\n<p>Then a thought occurred to me. Taking a step back toward my bed I was looking back out the original window. There he was. Same place. Same dark space. I moved again closer to my door. Gone. \nTrembling, I went back to my window where I could see him and attempted to open it. Gone. I closed it again. He was back.  I pressed my finger to the part of the window where I would see him, covering the space he took up with my index finger. I suppose I was trying to see if he was a smudge on the glass that I had given too much thought to, or a fly on the other side. I rubbed the pane and felt nothing. When I pulled back, I could see him again, still moving like he was tied to ropes behind the streak of oil that my finger made. </p>\n\n<p>I began to cry. This was too much for me to handle at 7 years old. I didn’t have the anxiety that my mother had but now the world was becoming a dark and scary place and all I wanted was my grandmother. I stopped looking out the window. I shoved the binoculars in my desk and slammed the door shut, and I stayed in my room on the floor the rest of the night. </p>\n\n<p>I didn’t want to tell my mother. I couldn’t. I knew I must have been making it up and if I scared her it would be my fault. She would go away again, and I would have to live at my grandma’s house. I loved playing dominoes with my grandma, sure, but I thought about how musty her furniture was and how my eyes itched around her cats and I continued to cry. </p>\n\n<p>I closed the blinds on the window man that night, scrunching my eyes closed so I wouldn’t see him as I pulled the curtains together and slid back down to the floor. </p>\n\n<p>That night I had the worst dream I’ve ever had before or since then. I dreamt that I was in the field in front of the window man. It was dark out and when I turned around I could see the lights on in my windows and I saw myself walking back and forth in my room. The window man had terrible breath, it stank like mustard and my mother’s ash tray after it rains, and his breathing was raspy and shallow. I tried to hide but I couldn’t move, my legs like lead below me. </p>\n\n<p>And I knew he had seen me. Through his breathing I could hear him smiling. He was trying to gain on me but when I looked at him I couldn’t tell if he was moving closer. He was so dark, and the night was so dark, that he became invisible but still so present to all of my other senses. I screamed, feeling the tips of his fingers in my hair and wanting to move so badly, hoping that the me that was in my room would hear me and call back or come see me. \nBut I knew I wouldn’t. I knew that even if I was able to hear the screaming in the dark woods, even if I knew that it was me out there calling for help, that I would just hide under my covers, singing songs to myself until the screaming died down. \nWhen I woke up the next morning I was crying and the pillow was wet underneath my face. I grasped my hair and felt for any signs of him on it—mud or ash or something, but there was nothing there. </p>\n\n<p>Sliding out of bed, I made my way over to the covered window. I opened it the tiniest bit and checked to see if, perhaps, the whole thing had been a dream. Except it wasn’t, because there he was, still running and still stuck in place. </p>\n\n<p>I was beginning, perhaps out of exhaustion, to wonder if the fear of it all was made up in my mind. Sure, yes, there was a figure that was not entirely human within a mile of my home, looking as though he was running toward me—directly at me, really, and didn’t seem to stop. Yet, he didn’t move. He was stuck, held by something that did not allow him to come any closer. Perhaps if he was left alone, if I were to stop thinking about him, he would go away. </p>\n\n<p>Like Tinkerbell. </p>\n\n<p>That was when I remembered that yesterday, I had noticed the man was exactly parallel to one of my favorite trees—the one that grew blue flower in the springtime, the ones I would bring home to my mom after playing. This morning the man was eclipsing the tree in my line of sight, about five feet ahead of it and seemingly just as tall. </p>\n\n<p>He was bigger than I thought. And he was getting closer. </p>\n</div>\n","author":"robtheoleander"}