{"rank":"43","title":"The house across the street: the stain (Part 3)","id":"8jxjc7","url":"/r/nosleep/comments/8jxjc7/the_house_across_the_street_the_stain_part_3/","time":"1526497287000","body":"<div class=\"md\"><p><a href=\"https://www.reddit.com/r/nosleep/comments/8j33oy/ive_been_getting_a_little_worried_about_the_house/\">Part 1</a></p>\n\n<p><a href=\"https://www.reddit.com/r/nosleep/comments/8je8g0/the_house_across_the_street_getting_ready_for/\">Part 2</a></p>\n\n<p>I&#39;m sorry I didn&#39;t update you guys yesterday. I spent most of the day asleep and then when I woke up, well...I&#39;ll explain. </p>\n\n<p>On Monday night, we finally began exploring the house. Marvin left at about 3 AM, just after the lights started flickering; we figured that it made sense to head over then. I watched him head across my lawn and across the street, then up to the porch. I sorta winced when I heard the sound of breaking glass, although it was pretty quiet. &quot;Sorry. Lock was too hard.&quot; I rolled my eyes. I was already regretting involving Marvin in this. He&#39;s a nice guy, but maybe this wasn&#39;t a good idea. Maybe we should just leave it be. Setting aside my misgivings, I reminded him to update me on his progress. He spoke in a whisper, barely audible above the distant thunder which heralded a spring storm. </p>\n\n<p>&quot;OK. So, in the living room now. Typical old person decor. Looks like it hasn&#39;t been cleaned in a long time though. Dust on everything. All the lights are off, but...there&#39;s a light at the top of the stairs here. Wait, did you hear that?&quot; I had. It was the sound of movement; not footsteps exactly, instead a sort of thud, following by a dragging noise, than another thud. It was like someone was trying to drag themselves along the floor and falling off of something every few seconds. &quot;It&#39;s coming from upstairs, for sure. I&#39;m heading up.&quot; The floorboards creaked over the walkie-talkie as he went up. As an aside, I fucking hated myself at that moment and fucking hate myself now for not having gone over. It felt like it was impossible then but I could have done it, if I had the right stuff and I had thought in advance. I guess it helped me in retrospect, but I still feel like a coward.</p>\n\n<p>He got to the top of the stairs and I heard a doorknob turn. There was silence over the walkie-talkie all of the sudden, except for that thud and dragging sound, which had grown much closer. As the silence drew on, I tried to get his attention. As I spoke, I was interrupted almost immediately by a scream which I could hear both from the walkie-talkie and from the house. It was definitely Marvin, but I had never heard that kind of noise come out of a human being. There was so much fear. I shouted over the walkie-talkie for him to come back, but all I got back was a clattering noise and then a kind of squelch. I was in a blind panic. That little inner scream kept saying, &quot;YOU DID THIS TO HIM YOU FUCKING SHIT YOU DID THIS WHAT IS WRONG WITH YOU YOU COWARD&quot; but when I ran to the edge of the driveway, the panic attack hit me so hard I couldn&#39;t breath. I had to fucking crawl back to the porch, tears in my eyes from the fear, before I could look back at the house. </p>\n\n<p>As I did, my panic melted away, although I was still breathing hard, replaced by surprise. He was there, walking across the lawn towards me, only there was something...odd. His breathing seemed heavy, and he was limping. Something, I thought blood at first but it was too dark for that, dripped off of his leg onto the grass and the street as he walked past.  He sat, heavily, as he got to the porch on one of my lawn chairs, and it was only then that I could see what was dripping. It was black, thick, like oil, and where it had touched his skin, it had left burn-marks. He didn&#39;t seem to notice. After a minute, in which we sat in a sort of stunned silence, he had caught his breath and explained. </p>\n\n<p>When he opened the door to the second floor, he had thought at first that he was in a black, dark room, no windows. But then he had seen, faintly from one direction, the lights of the street, and realized no, it was <em>covered</em> in something, completely covered, even the windows. The dragging thud was here, in this room, and as he turned on his flashlight and looked around, he realized that it was the stuff on the walls. It was <em>moving</em>. Almost like it was breathing. He had screamed because as he stepped into the room, the stuff had started covering his left boot and his ankle, and he had barely been able to pull free, dropping the camera and the walkie-talkie in the struggle. It was only when he waved the lit cigarette he carried at it that it had let go, recoiling like an animal. When I pointed out that there was some on his leg and boot, he stared at it dully. He didn&#39;t even look up when the two howls rang out from the other house, and the lights switched off. That was my first indication, beyond the story, that something was really wrong. With nothing more to say, he told me good night and headed over to his house. That morning, after I had fallen asleep, I dreamed of whispering and soft, squishy noises in a dark room. </p>\n\n<p>Yesterday afternoon, I woke up to find that Marvin was dead. </p>\n\n<p>The cops were all around the house, carting out covered bodies. There were three of them, and with my heart sinking low, I could already guess who they were; Marvin, his wife, his daughter. Steve was there this time. He&#39;s fairly high-up in the local police, but he usually comes by if there are deaths. It&#39;s important to him to &quot;show solidarity&quot;, whatever that means. He told me that Marvin had killed his wife and daughter that morning. &quot;It was a knife.&quot; He said that plainly, meaning very little, but in my mind I could see Marvin slashing them to pieces, howling in inarticulate rage like the howl from the house. I saw the black oil seeping over everything in his house, eating up their bodies, their--Steve interrupted my train of thought. </p>\n\n<p>He needed to take my statement, figured I had seen something since he knew I was awake most of the time. I lied, hard, and told him I barely knew Marvin, that I hadn&#39;t seen anything, that we never talked. I mean, what the fuck was I gonna tell him? That he got mindfucked or possessed or <em>something</em> by living fucking oil? He seemed uncertain most of the time, but Steve is a good guy. He likes to believe. And he believed me. I know he did. I wish he hadn&#39;t. </p>\n\n<p>This is my fault, guys. This is my fault. If I had just dealt with this myself, it would be me. I let a good man and innocent people die because I was a fucking coward. I was deep in this line of thinking when Steve left, so deep that I barely noticed that I sat down in the chair where Marvin had been sitting the night before. I let my gaze drift down to the floor and, to my horror, noticed that there was a stain, a stain that seemed to be <em>moving</em>, inches from my foot. I jumped away, but after a second of thought knelt down near it and watched it move. If I really listen, and I mean REALLY listen, I can hear something coming from the stain. Like a whisper. I strained to listen to it, and was almost getting there when I was distracted by a sharp pain in my knee. Standing, achey, I noticed to my shock that it was the night already. I had knelt there for <em>SIX FUCKING HOURS</em> trying to hear this thing. I hadn&#39;t even noticed. When I looked down, I realized it had grown. </p>\n\n<p>I slept after that, and dreamed again of whispering and movement in a dark room. The howl woke me up at 4:28 exactly, and I&#39;ve been awake ever since, trying to listen to the stain. </p>\n\n<p>I&#39;m afraid, guys. But I think I have a plan. I let Marvin down, and I let his family down. That little girl isn&#39;t going to...god, I can&#39;t even write it. It doesn&#39;t matter. Not now. The point is that they died because of me and that <em>thing</em>, and even if I can&#39;t make up for my part, I can at least destroy whatever that shit is. </p>\n\n<p>I&#39;ll get back to you. </p>\n</div>\n","author":"xnyrax"}