{"rank":"830","title":"My Odd Roommate","id":"8jxy60","url":"/r/nosleep/comments/8jxy60/my_odd_roommate/","time":"1526500416000","body":"<div class=\"md\"><p>I found myself laying in bed, wide awake and pondering life. I&#39;ve never had issues with insomnia until recently. I have no idea what caused it; I didn&#39;t start on any new medicine or change my diet. Who knows. All I do know was that each night brought about an intense cycle of restlessness, frustration, tossing and turning, and exhaustion. </p>\n\n<p>At least I had my roommate to talk to. Every now and then, he would be awake in the late night as well. Being broke college students, we shared a bedroom--not a bunk bed thankfully. He usually didn&#39;t talk much, but we had a handful of deep conversations in the wee hours. They would range in topic from the mundane (how well our characters were doing in a video game) to the serious (the  global implications of North Korea and South Korea having peace talks).</p>\n\n<p>I was extremely tired, but I did have a small desire for one of these conversations. It had been a almost a week since we had one. Talking with someone would surely beat staring at the ceiling. I tried my best to get comfortable and relax, but my body was having none of it. My mind was tired to the point of delirium, but my body felt awake enough for a marathon. </p>\n\n<p>A familiar voice calls over.</p>\n\n<p>&quot;Having another rough night?&quot;</p>\n\n<p>&quot;Yes! I swear, this is the most annoying shit ever man.&quot; I replied back, attempting to hide my happiness at some human interaction to pass the time.</p>\n\n<p>&quot;Well bro, I&#39;m kinda awake myself. You end up talking to that one girl?&quot;</p>\n\n<p>Our conversation went back forth from that point. As you can see from first question, we started discussing my dating life, or lack thereof, and moved on to random topics. With it being so late, I have no idea how long we were talking before the conversation took a weird turn.</p>\n\n<p>&quot;I&#39;m so glad to be a part of you. I think we made a great team.&quot; He said to me in complete seriousness.</p>\n\n<p>Obviously, this caught me off guard. Him and I were very good friends, but why the fuck would he say he&#39;s a part of me? That&#39;s pretty damn creepy. I wonder if it&#39;s a joke, but he&#39;s never been one to joke like that before. </p>\n\n<p>&quot;Part of me? Umm, what do you mean by that bud?&quot;</p>\n\n<p>&quot;Exactly what I said. We are one and the same.&quot;</p>\n\n<p>&quot;Look dude, are you trying to be funny? 3 o&#39;clock in the morning is not the best time to deliver your first creepy joke to me. If you&#39;re gonna keep saying weird shit, I&#39;m forcing myself to sleep.&quot;</p>\n\n<p>After I said that, he just stared at me. It was as though he was staring into my soul, as cliche as that sounds. Then the asshole started to mimic me. I threw my hands up in silent frustration at him and he did the same thing to me. Of course, this pissed me off, so I flipped him the bird, but he did the same to me. At almost the exact same time. Weird. </p>\n\n<p>He finally said, &quot;Please stop. Any insult or anger you have towards me is only going to reflect onto you.&quot;</p>\n\n<p>I don&#39;t know if he was trying to egg me on or not, but it worked. &quot;Who the fuck are you to give me that psycho-babble bullshit after you start saying this weird shit to me out of the blue? Especially in the middle of a late-night conversation. If you&#39;re trying to be funny, you really need to re-evaluate your sense of humor!&quot;</p>\n\n<p>My words seemed to have no effect on him. He just stared at me with those cold, yet familiar eyes. I studied him in that moment and noticed another creepy detail that somehow had evaded my senses until then; the fucker was wearing my shirt!</p>\n\n<p>I had a drawer full of old t-shirts that I used as pajamas. Like I said before, I&#39;m a broke college student and I don&#39;t have extra money to spend on luxuries such as pajamas. So I make do with what I have. My anger reached a boiling point.</p>\n\n<p>&quot;WHAT. THE. FUCK. Literally a few hours ago, I thought you were one of the coolest people I knew. But now you sit there and start acting crazy as hell; saying off the wall shit to me, mocking me, and wearing my damn clothes? Look man, I know both our names our on the lease, but tomorrow morning, one of us is leaving. Fuck this.&quot;</p>\n\n<p>I didn&#39;t realize, but I had an audience at that last outburst. An audience consisting of one soul: my sister. She had a key to my place and had apparently let herself in. The apartment is very new, so there were no creaks or cracks to announce her presence to me. </p>\n\n<p>The look on her face was pure terror. I didn&#39;t understand. I look at her and say very bluntly, &quot;Can I help you, oh sister dearest?&quot; The term of endearment at the end was very sarcastic. </p>\n\n<p>Her terror does not go away. She looks as though she is fumbling for her words and they are difficult to get out. She pulls out her cell phone and I see her press 3 numbers on it. Three numbers? Is she calling 911? Because my roommate and I are arguing? </p>\n\n<p>&quot;Sis, what the hell? Are you really calling the cops right now? Just because you saw my roommate and I arguing? You need to put the phone down and relax.&quot;</p>\n\n<p>She puts the phone down for a moment and looks at me. The next words out of her mouth explain everything. </p>\n\n<p>&quot;Brother, I love you. But where have you been? No one has heard from you in two weeks. I finally decided to come over and check up on you and I know it&#39;s the middle of the night, but you&#39;re blood. I&#39;ve been standing here for a few minutes now, watching you.&quot;</p>\n\n<p>Her eyes well up with tears as she chokes the next words out.</p>\n\n<p>&quot;You don&#39;t have a roommate. You live alone. You&#39;ve been arguing with your reflection in the mirror this whole time.&quot;</p>\n\n<p>I look over and no longer see my roommate&#39;s side of the room, but a huge, antique mirror; reflecting myself and my area of the room. I gaze at my reflection and freeze as my reflection gives me a slight smirk and wink. </p>\n</div>\n","author":"therudyshow"}