{"rank":"3","title":"Aunt Mary's Farm (Part 2)","id":"8jy0pj","url":"/r/nosleep/comments/8jy0pj/aunt_marys_farm_part_2/","time":"1526500928000","body":"<div class=\"md\"><p><a href=\"https://www.reddit.com/r/nosleep/comments/8j6gji/aunt_marys_farm/\">Part 1</a></p>\n\n<p>I once wet myself in high-school. I was 15 years old at the time and crippled by the usual insecurities and self-loathing that couldn’t even be undone by the inexplicable hatred of my peers. I tried, desperately, to understand the root of their loathing, intending to immediately rectify any identified oddities so that they might become a little civil. Unfortunately, the reputation of my family was rife among students and teachers alike. Sam&#39;s attendance there was perceived as some sort of disastrous occurrence with the curse of his past presence lingering in the halls. The only time my fellow students ever deigned to speak to me was usually an inquiry into the authenticity of his legendary acts. I could neither confirm nor deny for the most part. Sam was efficient in preventing undesirable accounts of his school career from reaching our parents ears. I wasn’t even able to revel in my sudden access to these secrets. I had my own issues to worry about. </p>\n\n<p>I used to sweat a lot. Indeed, I sweat so much that my school shirts would soon be decorated with unsightly yellow patches, all around the arm and towards the back. There was no hiding them and even the teachers would spare me pitying looks seasoned with a pinch of pure disgust. Once, during History, Brian Hubson leaned over his desk to position his mouth right next to my ear. </p>\n\n<p>“You should kill yourself,” he hissed in a voice sharp with delight. “Do us all a favour.”</p>\n\n<p>I’m not sure what reaction he expected. I suppose I could have confronted him or maybe notify the teacher of my sudden suggested expiration. Instead I sat perfectly still and peed all down my trousers legs. I hadn’t meant to do it, nor had I felt any inclination that I may have needed to urinate. Somewhere inside me a switch had been triggered and, on response, my body immediately and unexpectedly began vacating my bladder. The flow seemed to go on for ever...but it didn’t quite feel like long enough. The sudden warmth, spreading across my lower half and pulling the material of oh-too-short trousers against my increasingly moist skin; it felt good. It felt satisfying and I couldn’t conceal the pleasurable shiver that danced up my spine when it was over. </p>\n\n<p>It’s odd that I should be ruminating on such an incident again. However, for whatever reason my overnights at Aunt Mary’s farm always seemed to bring back the most ancient of memories. I usually slept in the downstairs guest room at weekends; that was where Sam and I had resided when we visited as children and the room was still stocked with our creaky beds and pitiful book shelf. It hadn’t felt at all strange to be climbing back onto my childhood bed, although the metal frame had screamed a shaky protest at my increased weight being dropped on its elderly body. I usually pressed down all the more in response, pushing my body further into the musty mattress and stretching the springs until it ceased in its distress. I would sleep well after that initial battle. Being so active in my renovations during the day sapped every last ounce of energy my body could hold and I would fall, eagerly, into the bottomless abyss of sleep each night. </p>\n\n<p>That night I did not sleep well. </p>\n\n<p>I dreamt strange dreams, pleasant at first and filled with satisfying images of charred, fur-less flesh and bloodied whiskers. But my joy was short-lived as I soon found myself standing in the entrance of my subconscious&#39; own representation of hell. The barn was barely recognisable in my dreams, at least not at first. The more I was able to interpret that environment the more the setting became familiar and the more my attention would soon be drawn to the shape in the centre of the barn. The pale, lifeless body was so peaceful and perfect that I found myself drawn towards it. Before I could take a step, however, a shadow would fall across the space between us and, in looking up to investigate the source of the interruption, my mouth would fall open in a silent scream as the dark shape hovered in the air before me. In my haste to escape, I would immediately forget the broken body discarded on the floor and just as my eyes spun and landed on the rotting corpse it sat up in one, swift movement with a sickening <strong>SNAP!</strong></p>\n\n<p>Perhaps it was the way I woke with sweat pouring, liberally from every active pore on my body that reminded me of times best forgotten. The river of perspiration was the only evidence of my inner terrors. Otherwise, I woke very peacefully, considering the trigger. My eyelids separated themselves in the laziest of speeds and I found myself staring at the faded, white wallpaper. It was still dark in the room; I guessed I hadn’t slept for very long before my subconscious began to play its torturous game. The house was very still although there was an intensity in the air that almost buzzed like a swarm of angry bees; it suggested there was some sudden noise beforehand to leave such a hovering remnant. In an inexplicable second of realisation I suddenly didn’t feel very peacefully any more. </p>\n\n<p>There was someone there. Someone in my room standing right behind me, swaddled in darkness, studying the back of my huddled form on the bed, pressed up against the not-quite-white wall. I couldn’t fathom why I would suddenly become aware of such an ominous presence, I only knew that it was there. I could feel the pressure of its stare on my body and became rigid in my current position and my brain became dominated by the overwhelming sense that I should stay very, very still.</p>\n\n<p>“I know you’re there,” I murmured against the wall. My voice was intended to be dangerously low but in the swarming silence it seemed thunderous. While I still had the nerve to do so, I whipped myself round to face the intruder. Dark shaped leaped out of the darkest corners of the room. Each one was a potential enemy, a dangerous form that now gazed at my waking self with unperturbed stillness. I lay with my back to the wall for the rest of the night; the better to survey my watchers. Time passed slowly until morning and I found myself forcefully dragged down memory lane while I kept a cautious lookout and watched the shadowy strangers dissipate in the rising sun. </p>\n\n<p>Morning found me hunched over the kitchen table, my preparations for breakfast already lay forgotten across the discoloured surface. I had retrieved Aunt Mary’s diary from under my pillows with no memory of how it had gotten there. While the sun busied itself in climbing the cloudy sky I poured over Aunt Mary’s shaky writing, absorbing myself in each entry with eagerness.</p>\n\n<p><em>September</em></p>\n\n<p><em>I was awake when I heard a disturbance downstairs this morning. I had thought, at first about that horrible scene in the kitchen cabinets and wondered if the rat had friends. The sounds were far too noisy to be made by anything so small, though and the familiar feeling of fear built up inside me. I tried to pull the blankets further over my head to block out the world around and my hands became tangled in long strands of greying hair. It had been falling out in more substantial patches now and no wonder. It’s only a matter of time before my entire body collapses on itself with stress. I wouldn’t leave my room today.</em></p>\n\n<p><em>I must have fallen asleep. The heat builds in my room throughout the day and makes me feel drowsy. I woke to a dull ache along my back and my arms and legs felt stiff and sore. I reached up to scratch my chest and found something blocking my access. My first thought was of a ball of hair and grimaced as I went to pull it away. Only then I realised it was much tougher and matted, slick with an oily substance that slipped through my fingers. I pulled myself up in bed to inspect the mystery object more and found it to be worse than any nightmare I had experienced recently. Even with its crushed and broken face it still felt as if the rat was staring right at me. Tiny shards of glass were still stuck in its bloodied flesh and its mouth was pulled back in a permanent sneer, revealing little, jagged teeth. I wasn’t thinking straight. It would be impossible to. I threw the beast across the room and wailed in terror before I could stop myself. Then the terror swelled again as I realised I may have angered ?????. I lay still, barely daring to breath. I had the horrible feeling that ????? was in the room, seeping from the cracks in the wall or lurking in the wardrobe. I’m weighed down by the expectancy of such a cruel presence.</em></p>\n\n<p><em>I force fed myself porridge for dinner. Each spoonful left a bitter taste in my mouth and my stomach rumbled, threatening to return each bite. It’s all I have, though and I ate it in bed while staring at the greasy stain on the wall where the rat corpse had struck it. The body was gone now and it seemed impossible that it ever existed. I considered that the entire thing had been an awful dream but the stain on the wall convinces me otherwise. If only I could ignore it. Writing is only a fleeting distraction and I find myself wishing I could get to the books in father’s room. He always had the best selection of literature. Maybe tomorrow. Maybe.</em></p>\n\n<p>I scratched at my chin, absentmindedly, as I read and re-read the diary entry. I wondered, blithely, just how many generations of rat had passed through this house. My eyes flickered to the trap in the corner where the latest victim was pinned against the wood, neck snapped clean from the force of the metal lever. I had been a little disappointed to find that there had been no live catches in the night this time and wondered if the beasts had been just as spooked by my night time visitors. I thought about Aunt Mary and her own apparent encounters with an unseen presence. All this time I had thought it was her own anxieties that compelled her to live a life of isolation but it would seem there was another more dangerous factor involved. Her story of the rat made no sense to me whatsoever, primarily because the greying stain on her bedroom wall was caused by my own attempts to cover up crayon drawings I had, somewhat artistically, scrawled across the surface as a child. Aunt Mary had caught me in the act of scrubbing at my creativity with a pair of tights dipped in warm water and shampoo. </p>\n\n<p>“Why did you do this?”, she’d asked in a delicate voice. Even as children we were just another perceivable threat to my dear Aunt.</p>\n\n<p>I probed at a spot on my chin while contemplating the chances of old age playing a part of Aunt Mary’s apparent dip into detachment from reality and reached across the table with my other hand to grasp the box of cereal. Like a jolt of electricity my hand jerked back from the container which shook, precariously, on the surface. I blinked and stared at the box of Rat Poison that faced me, studied it’s ragged edges and scowled at the moronically grinning housewife plastered across the cardboard, exclaiming the apparently ingenious product name (<em>Rodent Riddance!</em>) in garish lettering. In that moment it was if the world fell silent to witness the inexplicable event. Even the birds paused in their ceaseless twittering and the very wind that usually crackled through the leaves on the surrounding trees blew silent. </p>\n\n<p>It wasn’t possible. I rose, slowly, carefully, from the table and turned to inspect the barn where it sat across the clearing. The doors were closed. Of course the doors were closed. Suddenly, there was anger; sharp and invasive on every inch of my skin. I&#39;d put it off long enough and, after all, I had already resolved to make an appearance in my father&#39;s place of death last night. I snatched the diary from the table and stuffed it down the back of my trousers. After a moment&#39;s hesitation, I reached out and grabbed the box of rat poison before marching out the door. The journey to the barn should have only taken moments but even in my rage it seemed to take a lifetime to get there. My chest was aching from the eager beats of my heart against its wall and the sight of the huge, looming, red structure with its white rims and black, rusty roof sent a wave of heavy grief against my body, slowing my progress considerably so. The tress on either side waved, energetically, in the morning wind as if warning me away from the inevitable heartache I was about to endure. I stepped up to the doors and found the lock intact. That was encouraging at least. I took a huge breath of, what was intended to be, calming air and slid the bolt free of the catch. </p>\n\n<p>The air inside was thick with the musty stench of disuse. Cobwebs hung from every wooden beam above and unidentifiable wisps of debris floated down, through the air to join the carpet of dust on the stone floor. I grabbed an empty oil bin and placed it on its side towards the middle of the barn. It was just strong enough to withstand my bulky frame as I perched myself on the cold metal. The barn door swung closed behind me and only the faint rays of light that trickled through the gaps in the wooden walls served to disrupt the murky surroundings. He was sat at the back, surrounded by mouldy boxes filled with unwanted trinkets and useless junk. With the shadows cast across his face he seemed almost inhuman, his eyes reflected back the fury of my own. Surveying him now, huddled in a pile of filth, it seemed incredible that I could ever be frightened of him. He was a shrunken husk of what he was before; his face was drawn and stained with muck and infected sores. His clothes hung loose on his skeletal frame, his thin, pointed fingers twisting over one and other in a compulsive movement that sent little flakes of dirt and skin fluttering to the floor. I watched him exist from my improvised seating with a certain level of satisfaction. </p>\n\n<p>&quot;Did you miss me?&quot; I asked, my voice soft. </p>\n\n<p>He grunted an intelligible response and dragged himself forward, out of the shadowy corner. He looked terrible, I noted with glee. In answer to my question, he reached up at the rusty bucket sat atop one of the soggy cardboard boxes. It fell to the floor with an angry clattering and rolled a few inches before turning back on iself. </p>\n\n<p>&quot;Water,&quot; he croaked, the hatred ever present in his eyes. &quot;I&#39;ve no more water.&quot;</p>\n\n<p>&quot;Yes, it&#39;s been a while hasn&#39;t it?&quot; </p>\n\n<p>No response to that. How was it possible that he could become less sociable with time? I placed the box of poison on the floor and kicked it forward with my foot. A flurry of little green pellets scattered across the floor, rolling in all directions, reveling in their sudden freedom. He stared at the deadly mess with undisguised shock and then turned his face to mine. </p>\n\n<p>&quot;You don&#39;t expect me to eat that?&quot;, he asked with an incredulous huff of air. </p>\n\n<p>&quot;You must be hungry.&quot;</p>\n\n<p>He looked back to the colourful display around him and managed a grim smile and shake of the head. </p>\n\n<p>&quot;You&#39;re fucking crazy, you know that?&quot;</p>\n\n<p>&quot;I don&#39;t think you&#39;re in any position to judge me.&quot;</p>\n\n<p>&quot;Crazy bitch&quot;.</p>\n\n<p>I rose to my feet, unable to contain the satisfied smirk that crawled across my face. There was a flash of panic then, shooting across that pitiful face. </p>\n\n<p>&quot;You&#39;ve got to get me food and water,&quot; he insisted, his voice cracking. &quot;What do you think is going to happen?&quot;</p>\n\n<p>&quot;I&#39;m surprised you didn&#39;t help yourself last night.&quot;</p>\n\n<p>&quot;What are you talking about?&quot;, his voice was desperate now. He reached up and tugged at the matted, oily thatch of dark hair on his head.</p>\n\n<p>&quot;There&#39;s cheese in the fridge. Some bread and milk too. You&#39;re telling me you didn&#39;t see it? Didn&#39;t think to look, maybe?&quot;</p>\n\n<p>&quot;I haven&#39;t been near your fridge, you stupid-&quot;, he paused, sensibly so. I allowed him a moment to draw breath and consider his next words very carefully.</p>\n\n<p>&quot;Look at me,&quot; he started, holding his hands out and letting the sleeves fall down like wings across his arms. &quot;You think I&#39;d come all the way up to the house and <em>not</em> take any food?&quot;</p>\n\n<p>&quot;It had to be you,&quot; I told him, sharply. He wouldn&#39;t trick me. Not now. Not this time. &quot;You took the cereal. Have you eaten it already or is it stashed away?&quot; </p>\n\n<p>&quot;What-! How can you-! I&#39;m <em>dying</em> here you stupid bitch! What the hell makes you think-? I mean, how could I possibly-?&quot; He was faltering now, his speech fading off in the middle, his breaths becoming sharper. I couldn&#39;t help it. My heart melted as I watched him kneel there on all fours, hand grasping at his chest as he pushed and pulled each new breath with laborious effort. Tears streaked down his face leaving fresh pattern across the dirt. I shuffled my foot around in the dust and waited for the episode to pass. </p>\n\n<p>&quot;I&#39;m sorry,&quot; I choked at last. Emotion was inflating in my throat and tightening my airways. I swallowed, hard and continued. &quot;You know why I do these things.&quot;</p>\n\n<p>He shook his head at the floor but said nothing. No doubt he felt he had said enough already or maybe his words were of no help to him now anyway. </p>\n\n<p>&quot;I&#39;ll bring you water, ok?&quot; I assured, my own hands wringing over each other now. &quot;And some food? I know I shouldn&#39;t have...It&#39;s just that you really scared me before. I&#39;ve been reading...Well, it doesn’t matter. Not right now. I&#39;m sorry, ok? Ok?&quot;</p>\n\n<p>He was breathing easier now; I could see it in the movements of his shoulders as he took in each supply of air. I waited until he had calmed himself enough to look up at me and I gave him my most apologetic smile, my eyes sparkling with tears. </p>\n\n<p>&quot;Fuck you&quot;, he croaked. </p>\n\n<p>The drive home Monday morning was far too quick. I had anticipated a good few hours of contemplation and resolution before I was forced to fall in line with the monotony of casual conversation but I found I barely had time to think on the weekends events before I was pulling into the office carpark. I had been doing data entry for most of my life now. The predictability and consistency of hitting a cluster of keys in certain patterns to birth narrative was perfectly suitable to my line of thinking. I shared my office with two other women; a forty-year-old handbag enthusiast who&#39;s only other passion in life was the sound of her own obnoxious drone of a voice and a twenty-nine-year-old student who seemed perfectly content to allow whatever notion our co-worker was absorbed with to dictate the rest of our day. Today it was the morning news and the oh-so-terrible stories of terrorist attacks over-seas, an elderly woman who was scammed out of a small fortune, a nine-year-old girl gone missing and presumed dead, the rise in cases of younger onset dementia and, most importantly of course, the latest acidic trivialities of whichever puerile mutt of a celebrity that was considered choice of the month. I sat back in my cushy office chair and stared the hand-bag wielding narcissist right in the face, spaced out while in the pretence of listening to her excitable babble, and slowly released a stream of hot urine down the leg of my trousers.</p>\n\n<p>How I wish I could stay at Aunt Mary&#39;s farm. </p>\n</div>\n","author":"LarleneLumpkin"}