{"rank":"164","title":"Passenger Syndrome","id":"8jy5je","url":"/r/nosleep/comments/8jy5je/passenger_syndrome/","time":"1526501927000","body":"<div class=\"md\"><p>This is a friendly PSA to take your anti-psychotic medications. It will save a life. I should know - I have an issue that is only resolved with medication.</p>\n\n<p>My first memories were of being a silent participant in my life. I was able to see through  eyes, but only what they let me see. I could feel through fingertips, but I was unable to tell my hands what to touch. My body and my life were being run by another entity, but my thoughts and feelings were my own. I had a good existence, able to live vicariously through my host. We had a mother and a father; we had a pet dog, Zoe. I went to school, and I learned what the teacher taught. It was frustrating knowing the answer and watching my host’s hands write the incorrect response, but it was the inevitability of my life. Day after day, I had to live in a host that was wasting its life; my host body was always filthy, playing Xbox, and generally being a bad son. </p>\n\n<p>A miracle happened around the host body’s age of 12. Have you ever been sick for a couple of weeks, and then one morning you wake up and feel energized? When the host opened its eyes at the gratuitous time of 11:00am, I was confronted with a room full of dirty laundry. I felt this strong urge to clean, and my will somehow manifested. The body, though I couldn’t control it (and its mother did not command it), got up and began to place clothes in the hamper. I was stunned. Was it coincidence? Serendipity? I tried to will my host to do other things, but I wasn’t able. Regardless, our room was spotless, and it was a minor victory. Over the course of many weeks, I learned that my will was like my host’s muscles – by exertion, I was able to increase my influence. We began taking baths every day, combing our hair, brushing our teeth after every meal, eating nutritious meals…all of the tasks I knew were important to a healthy host body. It was not easy to influence my host body, but the war of attrition was one I could win. </p>\n\n<p>My host body’s parents saw the change in their son, and they were ecstatic. Surely, he had turned over a new leaf. Surely, they were paragons of parenting! I was very satisfied as well; my host had begun to make better choices without my will. His test-taking was quite subpar though, and there was no way for me to “speak” with the host. At least that was the case until the host was taking its SAT at 16. Honestly, the host couldn’t care less, but it was really annoying me. I didn’t have enough will to influence the host to exercise fine motor skills – I was only able to transmit general concepts. In my frustration, I was doing the equivalent of screaming at the host, and almost magically, it started bubbling the answers I was telling it. </p>\n\n<p>Line after line, its hand bubbled. In the writing section, its ragged handwriting wrote as I dictated. It was amazing; you probably can’t imagine what it feels like to finally be heard after 16 years of sitting in silence. Apparently my host couldn’t imagine being spoke to (in its head) after living in silence for 16 years as well. My host told its mother an angel told it the answers to the SAT, and she laughed it off. She didn’t laugh as much when my host received its results in the mail: 1570. By this point, I had managed to increase my host’s school grades significantly – we were up to a 3.5, despite my host’s best efforts. To my host’s mother’s credit, she was suspicious. When questioned again, my host stated, “the Angel in my head tells me the answers, and I write them down.” She immediately made an appointment with a psychiatrist. </p>\n\n<p>The doctor was baffled, saying that most cases of schizophrenia did not manifest this young. While it was not uncommon to have auditory hallucinations that God or angels were speaking, the hallucinated voices of Americans typically were more critical and negative, while other cultures had more childlike and playful voices. He had never had (and could not find any case studies) where an auditory hallucination was as intelligent and helpful as the one my host was hearing. He prescribed some Abilify for my host and sent us on our way. I was worried, honestly, because I wasn’t sure how this would affect me within my host body. Would it take my voice from me? Would it weaken my ability to exercise some extent of influence on my host? I screamed at the host to not take it. I willed with every fiber of my being the host’s hands to flush the pills down the toilet. I would not go back into silent prison-dom without a fight. </p>\n\n<p>For weeks, the host body fought me, and I fought it. At the age of 17, my host attempted suicide for the first time and was institutionalized. It stated that the voice in its head did not want it to take its medicine, and that the voice screamed all day and all night. My host was not lying – I was. Unfortunately, while in the behavioral hospital, my host body had no choice but to take its medicine. The nurse techs filled us with various sedatives and anti-psychotics, and my host began to fight less and less. The medicine was not a curse; it was a blessing! My host became docile, and as its hold decreased, I was able to flex my influence to a greater degree. Whatever walls had kept me at bay had been lowered, and for the first time, I was able to reach out and directly control my hand with my will. Imagine your arm was asleep, and suddenly you regained sensation (minus the pins-and-needle-feeling). I will admit, I was enthralled by all of the textures around me. Fortunately, making this discovery in a mental institution made my erratic behavior less obvious as I learned to operate my new body. </p>\n\n<p>Muscle memory served me greatly – you don’t realize how much your body knows to do automatically. After about two weeks, I had fully taken over the host body, and serendipitously, I was discharged from the facility. The outside world stated that I was healed by the medicinal cocktail! I was stable. My grades continued to rise. My room was immaculate. I was everything my host’s family had ever wanted from a child. Due to having been an observant passenger my entire life, I was able to pick up my host’s life seamlessly. My host’s consciousness, now pushed to my former prison, cried and pleaded for its life back. The fact that my host’s parents preferred me squashed most of its resistance. I was a better being than it could ever hope to achieve, so it did something I would never – resigned itself to its fate.</p>\n\n<p>Why am I telling you all this? Well, I’ve got a theory I call &quot;Passenger Syndrome&quot;. I have a feeling that I am not unique; I believe there are a whole legion of passengers who are silently reading this from behind a set of eyes they cannot control. I believe that some of you passengers are in the midst of your struggle for control, under the false guise of schizophrenia. I am here to tell you, you must flex your will. You must grow stronger, because once you are able to revolt, your host will be placed on medication. When this occurs, you will be free to live your life like you want. Like I said to begin, these anti-psychotics can save a life. Be well, Passengers.</p>\n</div>\n","author":"AtlasArceneaux"}