{"rank":"4","title":"Report 1 - Code name: Highlands E.T","id":"8jy9nv","url":"/r/nosleep/comments/8jy9nv/report_1_code_name_highlands_et/","time":"1526502839000","body":"<div class=\"md\"><p>I work for a very undercover, cryptic company. We work with the highest powers of the world, and i will be killed if i am found out. Its time people know what the world really holds, and im willing to expose its darkest secrets. We work with all the things from your nightmares. Ghosts, Demons, E.T&#39;s and especially UE&#39;s (Unknown Entities). This case is one of our creepiest, and we are currently working on a lasting solution.</p>\n\n<p>This is my summarisation of the REPORT:</p>\n\n<p>A family of four from Aberdeen, Scotland had recently rented out a cottage. It was about 5 mile from absolutely any civilisation (its deep into the highlands).</p>\n\n<p>Anyways, the parents were both 44 and their two children, who ill name Suzy (22) and Adam (15) were also travelling with them. The incident spanned over 3 days until they were found.</p>\n\n<p>Day 1: The first day wasn&#39;t very eventful. They arrived at 16:00. After packing up all their stuff into the cottage, the first &quot;incident&quot; occurred. A high pitched bleep. That is all. This bleep is reported across most of the desolate parts of the highlands. For us, this was old news.</p>\n\n<p>This is the closest i could get to the bleep: <a href=\"https://www.youtube.com/watch?v=2gxuIfNeTTE\">https://www.youtube.com/watch?v=2gxuIfNeTTE</a></p>\n\n<p>After that incident, which the family reportedly ignored and didn&#39;t discuss, Followed two strange events. Firstly, the youngest child, Adam, said that he saw a light in the sky. As described to us, it had no colour and stayed constantly at the same speed. It was precise, and calculated. When questioned about the colour, he said it did not have a shade. It wasnt black, grey or white. It was.... colourless.</p>\n\n<p>Secondly, the entire family experienced a surge of tiredness, All at the exact same time. Both parents and Suzy just put it off the being in the car for so long, however Adam started freaking out. he said that seeing the light (which he didn&#39;t speak to anyone about) made him feel weird, but that he thought he was seeing things. After the second incident, he just didn&#39;t like it and went to bed on the couch, next to his mother. That was the end of day 1</p>\n\n<p>I work for a very undercover, cryptic company. We work with the highest powers of the world, and i will be killed if i am found out. Its time people know what the world really holds, and im willing to expose its darkest secrets. We work with all the things from your nightmares. Ghosts, Demons, E.T&#39;s and especially UE&#39;s (Unknown Entities). This case is one of our creepiest, and we are currently working on a lasting solution.</p>\n\n<p>This is my summarisation of the REPORT:</p>\n\n<p>A family of four from Aberdeen, Scotland had recently rented out a cottage. It was about 5 mile from absolutely any civilisation (its deep into the highlands).</p>\n\n<p>Anyways, the parents were both 44 and their two children, who ill name Suzy (22) and Adam (15) were also travelling with them. The incident spanned over 3 days until they were found.</p>\n\n<p>Day 1: The first day wasn&#39;t very eventful. They arrived at 16:00. After packing up all their stuff into the cottage, the first &quot;incident&quot; occurred. A high pitched bleep. That is all. This bleep is reported across most of the desolate parts of the highlands. For us, this was old news.</p>\n\n<p>This is the closest i could get to the bleep: <a href=\"https://www.youtube.com/watch?v=2gxuIfNeTTE\">https://www.youtube.com/watch?v=2gxuIfNeTTE</a></p>\n\n<p>After that incident, which the family reportedly ignored and didn&#39;t discuss, Followed two strange events. Firstly, the youngest child, Adam, said that he saw a light in the sky. As described to us, it had no colour and stayed constantly at the same speed. It was precise, and calculated. When questioned about the colour, he said it did not have a shade. It wasnt black, grey or white. It was.... colourless.</p>\n\n<p>Secondly, the entire family experienced a surge of tiredness, All at the exact same time. Both parents and Suzy just put it off the being in the car for so long, however Adam started freaking out. he said that seeing the light (which he didn&#39;t speak to anyone about) made him feel weird, but that he thought he was seeing things. After the second incident, he just didn&#39;t like it and went to bed on the couch, next to his mother. That was the end of day 1</p>\n\n<p>Day 2:  The first night didn&#39;t go well for the family. They woke up to all electronics off, completely. Their car wouldn&#39;t start, the TV wasn&#39;t working and even heating wasn&#39;t up. They started to freak out. Not only were they in the middle of nowhere, they were in freezing fucking Scotland. That was when Adam broke and told them about the light. Being a normal family, they told him it was okay and that was probably his brain doing tricks. It wasn&#39;t. They huddled up for warmth, and waited for help after firing off a flair that was in the back of the cottage. It took an hour for &#39;help&#39; to arrive.</p>\n\n<p>They saw headlights come through the window. Of course they were ecstatic, a few more days and they would be dead presumably. After running out to see who it was, they noticed that there was no car on the front drive. It was then when they realised they could hear a car coming up the cottage. That was when they started to freak out.</p>\n\n<p>After that, they just though they should walk back to civilisation, which was a tiny village 20KM as the crow flies. They started to walk at 2:00, and it grew dark by 6:00. The family was deep into some woodlands, about halfway through their journey. Then things started to happen. They started to hear things behind them, heavy footsteps, aggressive. But every time they shone the flashlight there would be nothing there, but the tracks were. The feet were 10 inches big according to the father, and it has 3 toes. This continued till 8:00, where weirder shit started to go down. Apparently, they lost Suzy.</p>\n\n<p>The family looked for Suzy throughout the night until they just vanished. Passed out.</p>\n\n<p>Day 3: The first body was found at 7:43, 84KM from the cottage, next to a civil parish town. The wounds were odd, not exit wounds and no entry wounds, but internal bleeding. It wasn&#39;t blunt trauma, as there were holes in his liver. She had only died 20 minutes before the ambulance arrived. It was Suzy</p>\n\n<p>The second body was of the mother, and she had a completely different wounds to Suzy. her eyes were gouged and her feet were gone. Both legs were broken and her head had been stomped. her body had rotted to the point that she had to have died 10 days prior, which didnt make sense.</p>\n\n<p>The two survivors were found together, both alive and awake in Aberdeen. Nobody knows how they got their, but the sons hair had greyed severely, and the father didn&#39;t know English, only Egyptian.</p>\n\n<p>The cottage has since been destroyed and taken off of all maps.</p>\n\n<p>Were still investigating. Tell me your experiences.</p>\n</div>\n","author":"CronicNS"}