{"rank":"20","title":"Beginning My Game","id":"8jyexc","url":"/r/nosleep/comments/8jyexc/beginning_my_game/","time":"1526503978000","body":"<div class=\"md\"><p>It was a quiet night in August, and I was riding my bike back from my friend Kyle’s.  He lived just down the street, which was nice seeing how everyone else had already gone off to college.  We lived in a quiet, hilly area of Wisconsin; the home of Jeffrey Dahmer, Ed Gein, and others as I had often joked. So, yeah, i was leaving, and that journey changed me.</p>\n\n<p>When I was rounding a curved corner, I saw a red truck coming from the opposite direction.  I tried to swerve to avoid it, but the truck tried to avoid me by doing the same.</p>\n\n<p>I was told by doctors I was lucky to be alive, let alone have the use of all my limbs and function in a perfectly normal way.  After some physical therapy and painkiller prescriptions, I was released from the hospital.  My senior year of high school went pretty well, and I got into a school with an award winning engineering program.  My only complaint was that my high school best friend, Kyle and I didn’t talk much anymore. </p>\n\n<p>Myself and six other colleagues were essential in combating the spread of climate change, “The Seven Saviors” is what the media called us. Outside of work, I had an incredibly supportive wife, and three brilliant, kind-hearted children.  Everything was going perfectly, until it wasn’t…</p>\n\n<p>You know that feeling you have when you graduate, or being laid off from a job? That feeling of not being exactly sure of what to do next?  I had that feeling one night when I returned from a convention in the Philippines.  </p>\n\n<p>About a block from home, a plume of smoke floated above the rooftops.  Being July and assuming it was a really large bonfire, I paid it no attention.  Turning onto my block, where my house once stood, I saw a heap of wooden planks and roaring flames.  In that moment, all I could think about was my family, and I jumped out of my car and ran toward the burning building.</p>\n\n<p>“I’m afraid I can’t let you any closer, sir.” a firefighter cautioned.</p>\n\n<p>“That’s MY house! Can you at least tell me if my family is ok?”</p>\n\n<p>“The investigation is still ongoing, so you’ll have to wait over there with the media trucks” the man carelessly stated while coldly smoking a cigarette.</p>\n\n<p>Ignoring his order, I stormed past him and sprinted closer to the raging, crackling inferno.  I thought that maybe, with all that equipment on, I’d have the advantage and get away and find out what I needed to. All it actually did was make his tackle more painful.</p>\n\n<p>“Daniels, get off that man, now!” Barked a scratchy voice about ten feet back. A tall, thin man in a suit and jacket approached, extending a hand, “So sorry about that, Dr…” he paused searching his notepad “Mort. That firefighter’s new to the unit; was previously enlisted in the Marines.  Hopefully I can answer any questions you may have. Follow me.”</p>\n\n<p>He led me to the side of the nearest firetruck, out of earshot from the nosy reporters. “Robert DeLanely, FBI” he said, flashing a badge. “To answer the question most pressing right now, it doesn’t appear as though any of your family made it out.”</p>\n\n<p>My eyes welled up with tears...I thought of my children, Rebecca was planning for her first year of college in a few months.  Stacy (my wife) and I were planning a new business...had it really all ended so abruptly, and for nothing?  Shaking, I collapsed by the rear tire of the truck and started crying.</p>\n\n<p>I felt a hand on my shoulder “The bureau extends its sincerest apologies. As hard as this must be for you right now, I’m sure you realize that’s not why I’m here.  While combing through the contained areas, we found a note that leads us to believe this wasn’t an accidental event.” He unfolded a piece of paper and handed it to me. “Does this make any sense to you”</p>\n\n<p>I tried to steady my shaking hand to read it…\nThroughout life, the only reliable companion is yourself.  In success and failure. \n    -Yours Truly,\n        The Despots</p>\n\n<p>“No, no it doesn’t.”</p>\n\n<p>DeLanely frowned a bit and rubbed a small snake tattoo on his wrist “Didn’t think so.  Let us know if there’s anything you can think of that may help our investigation. Here’s my card. Do you have family or friends nearby you could stay with?”</p>\n\n<p>I told him yes, and while the investigation was wrapping up, I stayed with my folks about an hour away.  </p>\n\n<p>A few months went by, and that note always stuck with me.  What could it mean?  Who were these people? Why did they want to come after me?</p>\n\n<p>One Saturday morning, I was unpacking at a new apartment; it would’ve hurt too much to rebuild on the spot where my loved ones died. I decided to take a break and spend extra time looking at photos I left with my parents a few years back.  As I turned the pages of an album, something fluttered to the floor.  Picking it up and reading it, it answered everything.</p>\n\n<p>Back in my undergrad days in college, myself and a few other students helped a professor conduct research.  Three of these students were the stereotypical college frat douchebags who you wondered how they managed to stay alive for so long; let alone get into college.  A couple of times, I jokingly referred to them as “The Despots” as a way to blow off steam. With that realization, a fire grew inside me which I didn’t even realize I had. These dipshits, who barely graduated, were the ones responsible for MY depression? MY almost quitting the field of engineering? MY FAMILY’S DEATH? </p>\n\n<p>I went berserk for awhile; throwing things, screaming, and even punching a hole through the wall, only to be stopped by a pipe. </p>\n\n<p>I sat on the floor, staring at the moonlight cutting through the blinds of the patio.  I felt something I hadn’t in a long time.  Not just happiness, but great joy. Grinning widely, I realized I lived in the technological age! I was capable of finding these jealous bastards and do something about them.</p>\n\n<p>By six that evening, I had the info I needed in order to track two of them down.  I was smart though.  I had seen enough documentaries, and YouTube videos to know ways people were caught.  I waited.  Conveniently, I had professional engagements in areas close to where they lived in the coming months. It would be suspicious if I visited the area abruptly and they went missing. If I waited, I had an alibi.</p>\n\n<p>The following six months went off perfectly fine..at least for me.  As for those douches; Ralph and Hector, well..let’s just say those engineers met their engineer. Ralph was easy enough to track down at a casino in Reno; a few drops of liquified sarin in his drink seemed to do the trick.  </p>\n\n<p>Hector a was bit trickier.  I don’t know if he was worried I would track them down or not. Turns out he was in Buffalo since graduation, and lived in one of those houses with the fancy “smart furnaces”, where you could control the temperature with an app.  Puncturing a gas pipe proved to be fairly easy, easier than hacking the app he used at least.  Should’ve seen his head flying down the street like a baseball.  </p>\n\n<p>I still hadn’t found Rick though...there wasn’t much I remembered about him that I could use to track him down.  I knew he hadn’t moved terribly far from me.</p>\n\n<p>At first, I didn’t feel anything about what I did.  I did what needed to be done.  They no longer deserved to live, though whether they ever deserved to can be debated by a class of philosophy students too busy stroking their egos to realize their degrees will get them nowhere.</p>\n\n<p>You see, however, I developed a problem.  I became addicted to killing.  Hookers, kids, old fucks with dementia? All too easy to lure in and get rid of.  Knowing you have that much power over another person’s existence is truly exquisite.  They were all going to die, don’t get me wrong, but the more they squirmed, the worse it got for them.  A slice to the throat for those I pitied, and slowly placing them in acid after being drugged for those I really wanted to watch suffer.  I now understand why people hunted, you know? I loved the thrill of doing it and not getting caught, avoiding evidence being traced back to me...nothing else was as exciting anymore.</p>\n\n<p>I must’ve gotten a bit too sloppy, because a year later, I was driving back from a summit in New Mexico on renewable energy when I was pulled over.  Praying it would all go smoothly, I complied. Hands on the wheel until asked to do something. I reminded myself.</p>\n\n<p>“License and registration please” demanded an officer</p>\n\n<p>I turned to face him, and, it was that agent, DeLaney. Shit.</p>\n\n<p>“Hey, small world! How’s it going?” I said, trying to stay calm.</p>\n\n<p>“Great. How’re you managing?”</p>\n\n<p>“Surprisingly, pretty well overall.  Have a new place, traveling again for work.”</p>\n\n<p>“That’s good to hear.  Well, listen. I recognized your car from that night, and wanted to warn you. We believe there’s been a serial killer active in a couple..” He glanced to the back of the car\n“Wait, what’s that?” he asked</p>\n\n<p>“What’s what?” I replied, trying to act dumb</p>\n\n<p>“Do you mind if I check out your car?”</p>\n\n<p>“Go ahead” I knew I cleaned out that car before I left Albuquerque. He wasn’t going to find even a strand of hair.</p>\n\n<p>As the detective opened the car door, I saw the snake tattoo again, and it was in that moment it clicked.  Rick, the douche from college, had a snake tattoo on his wrist as well.  Tonight I was going to finish what he started...</p>\n\n<p>He leaned into the car’s backseat, and pulled out a knife from under the front passenger seat. \nHe looked shocked and turned to me “Do you want to explain something?”\nTrying to move before he could process, I punched him, and in his dazed state grabbed the knife from his hand. I got in one good stab to the side before he drew his gun. “Drop the knife. I don’t want to use this on you.”</p>\n\n<p>“I know who you are, and you’re going to see your buddies soon enough .” I yelled pointing the knife in his direction, as a crowd started to gather on an overpass bridge.</p>\n\n<p>I heard the gunfire as I fell.  Detective DeLanely stood over me as I lay on the road, bleeding out. </p>\n\n<p>DeLaney bent down and used the gun barrel to move my face to see him “Tell them I say hi” he smirked as I took my final breath.</p>\n\n<p>Or, so I thought.</p>\n\n<p>I heard the sound of heart monitors and people talking.</p>\n\n<p>“Hey there buddy!” It was my mom sitting in a chair by the window.  Wondering where I was, I shot up and glanced around. “Aghhh” my head was on fire.</p>\n\n<p>“Careful! That car did quite a number on your neck, sides, and forehead. It may still be a few days before you can get out of bed.” A doctor standing in the doorway stated, scribbling on a notepad.</p>\n\n<p>“Car? Wasn’t I shot?” I asked, looking around the sterile hospital room.</p>\n\n<p>My mom laughed, “Shot? Haha, no luckily not.  You were riding back from Kyle’s and a car hit you.  You’ve been in a coma for almost a full day.” She started choking up, “We weren’t sure you’d ever wake up to be honest.” </p>\n\n<p>In that moment, I experienced what horror truly was.  My world, the next 27 years of my life, were all made up.  I was devastated..my dear kids, my loving wife, my career; all a hallucinogenic lie.    Kyle stayed by my side until I was ready to check out of the hospital.</p>\n\n<p>1.7 million people sustain a head injury every year.  Some die, most don’t, and if you’re really lucky, walk away completely unharmed. </p>\n\n<p>Eventually, I learned to make peace with the world my head built in those few short hours of a coma.  I’d never meet my children, my wife(I actually still love her; as crazy as that sounds), or maybe even make some great contribution to the world.</p>\n\n<p>I did make peace with everything..except one thing.  Nothing was as pleasurable as being in control of another human’s life.  I longed for it once more.  Except, this time I would be far more careful than in that fantasy world.  I decided to call up a friend I hadn’t seen for a little bit in this world, or decades in the one I dreamed up.</p>\n\n<p>Grinning widely, ready to begin my game, I asked “Hey Kyle, do you want to hang out tonight in the woods?”</p>\n</div>\n","author":"mrdarkpasta"}