{"rank":"5","title":"town","id":"8jyjcw","url":"/r/nosleep/comments/8jyjcw/town/","time":"1526504901000","body":"<div class=\"md\"><p>I’d been going to Eddie’s for a a few years now. Not as often as I did in middle and high school but I’d make the pilgrimage back to the basement where he lived in Garnet, Ky. We both been born in the same hospital, went to the same schools and had our parents divorce for the same reasons. He was as close as I had to a brother, really. He had a couple of years on me though and would try to impart knowledge here and there in the visits back. </p>\n\n<p>We don’t know where are choices and our vices will take us and ,in the years leaving Garnet, I’d dropped out of college, gotten engaged, gotten unengaged, started drinking, stopped drinking, protested this and that, worked a few dozen retail jobs until I found a call center where I could climb the ladder. I’d gotten out of Garnet and I’d not conquered the world or anything but I’d had experiences.\nEddie and I, when we were youngins’, had always gotten together in his basement and watched horror movies, played Super Nes and then PS2 and the like, talked about girls and the lack there of as teenagers. Eddie didn’t like to leave the house though. He didn’t like people and he started smoking pot, early and often. He was always the lovable sort of curmudgeon, until he wasn’t.\n I’d always make time to see Eddie once or twice or year, just make time at Christmas or what have you. To have this little playset of the good old days to come back too. Blame it on being a bad friend, blame it on adult concerns, but I didn’t think of Eddie that much when I wasn’t around him. I took it that he’d always be there. A universal constant. \nSure he was a little bit fatter and a little more surly every time I saw him but he was, like I said, a brother. Same posters on his wall, same movies on his shelf, same Gundam models we had put together decades ago, dusty and resin slick. I had always treated these visits like looking into an old attic toy chest, a rush of wonder. </p>\n\n<p>But Eddie lived in that toy chest. With the dark, dust and mold. Waiting for me. To take him out and make him feel useful.  </p>\n\n<p>He let me in the back door to his basement, bathrobe and a Dragonforce T-shirt. He’d put on the pounds again, and he was already a big dude. He’d shaved his head recently and keep feeling the bur of it. He was glassy eyed and slow to respond.</p>\n\n<p>“Hey Man I missed your face.”</p>\n\n<p>“I missed yours too man.” I hugged him, not really making my arms around. </p>\n\n<p>I sat down in the tattered hand me down wingback that was designated as “My spot” even when I wasn’t there.  He sat in the love seat he always sat in, indented next to him was where his faithful pitbull had always laid, but it was empty.</p>\n\n<p>“Where’s Chance?” I enquired. </p>\n\n<p>He gestured to a little urn at the center of his coffee table. All around the table where hundreds of signatures.symbols, quotes and initials a party tradition he used to love. I hadn&#39;t seen anyone on the table for well over a decade. I don’t think he had either. He grabbed his bored and grinder in went to work with what seem like over dry buds.  </p>\n\n<p>“I’m sorry about your dog, Eddie.”</p>\n\n<p>“Yeah, it hurt. Was a few months back.” He sighed, “You wanna hit this?”</p>\n\n<p>“Naw I’m okay man.” </p>\n\n<p>He had always smoked but these brown, wooden and thorned tumbleweeds looked like something out of a craft store or a terrarium, not the luscious, verdant dank that had permiated all our meetings. </p>\n\n<p>“She went right after mom did. Pancreas cancer, her and Chance both.”</p>\n\n<p>“Oh my god dude, Your mom passed? Man....I really didn’t hear, I don’t really talk to anyone here besides you and ...well you know not often. Are you okay?”</p>\n\n<p>“Ah. I’m holding it together. Funeral took most of the money she left me. Then well I couldn’t afford the burial so I went with the cremation for both Mom and Chance.” He gestured with his lighter again toward the urn and then took a hit. </p>\n\n<p>“Wait, Your mom and chance are both...”</p>\n\n<p>“Yeah together on the table. My aunt thought it was inappropriate then I asked her to pay for a coffin and she blocked me on FB.”</p>\n\n<p>“Fuck dude I would have thrown in...helped pay to help...put her to rest.”</p>\n\n<p>“Naw man It&#39;s aight she liked the dog. Hell she liked it better than me most of the time.”</p>\n\n<p>He took another hit. I flexed my hands and tried to find something to say.</p>\n\n<p>“You seein&#39; anyone lately man?”</p>\n\n<p>“There was this one chick but she didn’t like my living arrangement or Chance. Guess she should have rode it out.” He coughed out a laugh.</p>\n\n<p>“Well man why aren’t you upstairs? Instead of still down here?”</p>\n\n<p>“Still my mom’s house man. Doesn’t feel right. I was thinking about selling it but the real estate agent quit their job while I was on the phone with them. Guess that’s the price of being an anchor.”</p>\n\n<p>“Wait what?”</p>\n\n<p>“Yeah estate agent hung up the phone when I asked about them doing a walk through. I read in the paper they walked out and jumped face first into the pavement until their skull cracked. It was Danny Masterson. Think yall had some classes together?</p>\n\n<p>‘What the fuck? How did I never hear about that ? What do you mean anchor?”</p>\n\n<p>I didn’t realise how tired he looked until that moment. </p>\n\n<p>“I stayed here man. The rot got my mom, it got Chance, It can’t get me yet. That’s why I’m still smoking man, these are the Leafs of Grandeur. I found them right after you graduated. I thought my guy was fuckin’ with me at first. But I saved my seeds and i’ve been growing it in the ashes.”</p>\n\n<p>“Eddie man are you okay?”</p>\n\n<p>“Hey I know it’s not the best but I like being away from it all. I got the internet, I’ve got my boxsets, still hate gaming online though.”</p>\n\n<p>“What are you even talking about Eddie.”</p>\n\n<p>“Maaaan, well I hate that you know this now. But well I’ve done it all for you. I love you man, you always came back to sit with me. When no one else would. I dunno if it’s Garnet, or the house or hell, this bud but no one makes it out of here. Nobody in town leaves their basement anymore. The longer you stay out the worse it gets here. No work, no sleep just down here for everyone. Hiding away.  Pancreases turning to slim. You know everytime someone dies in town, i think you get laid out there in the world? Nobody knows what’s going on but I do. I wanted you to have a real life, experiences, I was always gonna be trapped here. So I talked to my dealer, he said I’d get the Leafs of Grandeur and he’d see toothis town. See that everyone died slow, and painful because you couldn’t stand being here. I turn the worst of it into the best luck I can give you.”</p>\n\n<p>“Who’s....who’s your dealer?”</p>\n\n<p>Eddie thought about it and shrugged. “Some guy.”</p>\n\n<p>I didn&#39;t think how dark the town was when I pulled in. It was always dark. It’s only a thousand people it’s not like... </p>\n\n<p>“Eddie why man. Your dog, your mom, the town? Why do this?”</p>\n\n<p>“Cause your my best friend. And I missed you. Now hit this so I can have my turn.”</p>\n</div>\n","author":"Waco22"}