{"rank":"380","title":"The scariest story in the world","id":"8jyjoe","url":"/r/nosleep/comments/8jyjoe/the_scariest_story_in_the_world/","time":"1526504960000","body":"<div class=\"md\"><p>Though the wind bellows fierce across my face like the howl of a nameless beast, though the moon twists shadows into abyssal creatures and the gates of Hell within my companion’s eyes, I am not afraid. I will be, he promises, but not yet.</p>\n\n<p>You see this is not the scariest story in the world. This is just a tribute.</p>\n\n<p>My brother Jake read the fabled story on an ancient scroll, or so the old man swore to me. I believe the psychiatrist preferred the explanation of “sudden onset psychosis”.</p>\n\n<p>All I know for sure is that last week I met Jake for a drink after work and listened to him complain about his wife for an hour. The way she bossed him around, the way she never considered his feelings, then on to ramble about his job and a camping trip he and his coworkers had planned to get away from it all.</p>\n\n<p>Three days later, I received a phone call from the police station. Did I know Jake? Of course, he’s my brother. Did I know why his naked body was covered in blue paint, or why he was running down main street screaming at pigeons?</p>\n\n<p>No, officer. I’m not sure why he was doing that.</p>\n\n<p>Speaking to Jake in the hospital was the most difficult thing I’ve ever had to do. His eyes were milky pools which bulged so disgustingly from their sockets that I was afraid they’d fall out. His breathing came in short bursts of ragged gasps as though he was constantly forgetting and then being reminded that he was being chased. Even his skin seemed to have aged, fresh wrinkles threatening to melt off his face entirely.</p>\n\n<p>“I never knew a nobody. Nobody never knew a me.” He repeated that line frequently, sometimes looking in my direction though never seeing me.</p>\n\n<p>It was punctuated with other nonsense such as:</p>\n\n<p>“You see ‘em born but you never see ‘em unborn.”</p>\n\n<p>Or</p>\n\n<p>“I felt it drinking me. Like I was a bottle and it couldn’t be quenched.”</p>\n\n<p>I couldn’t make heads or tails of it. Neither could our parents, or our relatives, or any of the long line of doctors who paraded through the room. By the third visit I was seriously considering leaving and never returning. What was the point? Whatever had happened to him, my brother wasn’t in there anymore.</p>\n\n<p>I wrestled with that thought all day, making excuses to delay until finally near midnight the guilt overpowered my hesitation. I decided to drop by for just a moment to see if his condition changed.</p>\n\n<p>It hadn’t. But something had. There was an old man sitting beside his bed, endlessly wringing his hands and muttering to himself. His stained trench-coat and wild matted hair suggested a homeless person, and I wouldn’t have been surprised if he had his own room in the psyche ward.</p>\n\n<p>“Do you know Jake?” I asked.</p>\n\n<p>“Does anyone, anymore?” the old man replied with the articulate, measured words of a stage actor.</p>\n\n<p>“Do you know what happened to him?” I asked, still standing by the door.</p>\n\n<p>“Mr. Sandman,” Jake’s voice gurgled like wet mud. “Mr. Sandman, dream me a dream…”</p>\n\n<p>“I do,” the old man answered. It was almost surreal to hear such an even, intelligent voice from such a disorderly man. “He read something he oughtn’t to, and it’s driven him quite mad.”</p>\n\n<p>Convinced by my companion’s certainty, I sat in the chair beside him and searched his face for answers. The eyes which met my gaze, as I have already mentioned, were akin to the gates of Hell. I suppose such a fanciful description requires elaboration. It’s not that his eyes were abnormal, just as an arch of stone may seem quite natural almost anywhere. I simply had the feeling that the world on the other side of those eyes had very little in common with our own.</p>\n\n<p>“What did you read?” I asked my brother, needing an excuse to look away.</p>\n\n<p>Jake’s breath was coming fast again. His fingers gripped his bedsheets on either side of him as though he were hanging from a precipice and clinging for his life.</p>\n\n<p>“The scariest story in the world, that’s all,” the old man said. “Would you like to read it too?”</p>\n\n<p>Jake was practically convulsing at the words. I was about to call a nurse, but the old man ran his long fingers down my brother’s face and his breathing immediately eased.</p>\n\n<p>“You can’t get through to him if you don’t know where his mind has been,” the old man’s voice had grown as melodic as a lullaby. “Read the story, and if you keep your wits about you, then you will find the words to call your brother home.”</p>\n\n<p>“Okay. Sure, yeah,” I said. Part concern for my brother, part sibling rivalry in wanting to test myself, but mostly it was just morbid curiosity. “Is there a chance I’ll end up like that?”</p>\n\n<p>The old man smiled and stood. Saying nothing, he turned to exit the room.</p>\n\n<p>“You can’t expect me to follow you if you don’t answer,” I called after him.</p>\n\n<p>“I absolutely can,” he replied, and he was gone. And of course he was right. How could I not follow that begging question mark?</p>\n\n<p>And so the wind howled as I walked into the night with my companion. I asked his name, and his voice betrayed nothing when he answered “Mr. Sandman.” I assume it was in jest, but I can’t be certain. While we walked, he told me the tale of the demon scroll.</p>\n\n<p>“The story was written over the course of four generations, beginning in the 6th century. After the man had fathered a son, he would take up the story and pour all he knew of fear into the manuscript. Once he had contributed what he was able, the man would collapse into insanity, passing the manuscript onto his heir when he came of age.”</p>\n\n<p>“If they knew the thing was evil, why wouldn’t they just destroy it?”</p>\n\n<p>“Will you destroy it?”</p>\n\n<p>“Not until I’ve read it…”</p>\n\n<p>“Ah,” Mr. Sandman said, tapping the side of his nose. “And so it passes. Each son thought they could save their father through their own sacrifice, yet each fell as their fathers had into madness.”</p>\n\n<p>The old man had taken a turn on a street I didn’t recognize, but I was too absorbed in his tale to pay it much mind.</p>\n\n<p>“Well maybe I will destroy it then. If everyone who has ever read it—”</p>\n\n<p>“Not everyone,” my companion interrupted. “Four generations passed the scroll, until one son endured the trial. He maintained his sanity, helped his father to recover, and even prospered for his greater sight into the heart of terror. Such was his love for the fear he found that he kept the scroll hidden and safe. Until your brother discovered it by accident, of course.”</p>\n\n<p>“What happened to the boy? And how do you know this?”</p>\n\n<p>The old man smiled over his shoulder, saying nothing.</p>\n\n<p>“Well what made him different that allowed him to prevail?” I pressed.</p>\n\n<p>“The boy wasn’t brave like the others.” Mr. Sandman had left the road entirely and was now walking along a dirt path through a dark copse. I was helpless but to follow. “When you are brave, you fight against fear as though to conquer it. Only the cowardly know how to make fear their friend as that boy once did. Here we are though, just where your brother left it.”</p>\n\n<p>Mr. Sandman reached inside a rotted stump to produce a scroll. It was a length of animal hide, about three feet tall, its surface yellowed and edges burned or tattered by age. He offered it to me freely, and I accepted.</p>\n\n<p>“Can’t you give me any idea what to expect?” I asked. The thing was clenched in my hand, still rolled.</p>\n\n<p>“I already have.” His eyes didn’t waver, fixed on my own. The wind held its breath as I held mine. I nodded, my mind made at last. Still meeting Mr. Sandman’s eyes, I took a lighter from my pocket and set the flame to the scroll.</p>\n\n<p>If his eyes were the gates of Hell, then now they were opened. An animal snarl escaped his throat as he launched himself at me. Decrepit fingers clawed at my face, feeling like shards of bone digging into my skin. I tried to fend him off, prompting him to dig his yellowed teeth into my defensive forearm.</p>\n\n<p>There was no chance to reason with him. I couldn’t flee with him latched onto me. All I could do was pummel his scruffy head with my free hand, over and over, each blow harder than the last as his teeth sank deeper into my skin. By the time he let go his mouth was a fountain of blood which spurted between his rotten teeth.</p>\n\n<p>“You’ve read it, haven’t you??” I demanded, looming over the crumpled body. “Tell me what’s inside!”</p>\n\n<p>The wet laughter was nauseating. Then it stopped, and that was even worse. The wind started to whistle again, finally daring to breath.</p>\n\n<p>The thick animal hide was slow to light, but I got it going with a little kindling. The stump, the scroll, and Mr. Sandman’s body all joined in the pillar of flame. Fear is an evil thing. That’s what I told myself in the heat of the moment, my bloody arm in agony. That it was a cursed knowledge the world would do better without.</p>\n\n<p>But each night as I lie awake my thoughts are bound to what was inside that scroll. And when my brother took his own life in the hospital, I had to wonder how things would have been different if I had striven to understand fear rather than flee from it.</p>\n\n<p>Maybe fear is an evil thing, but the <a href=\"http://tobiaswade.com\">fear of fear is even worse.</a></p>\n</div>\n","author":"TobiasWade"}