{"rank":"12","title":"Outcast (Part 1)","id":"8jykvc","url":"/r/nosleep/comments/8jykvc/outcast_part_1/","time":"1526505222000","body":"<div class=\"md\"><p>Oh boy, where do I begin? There’s a lot to recap as this has taken place over the course of a few years. It’s the kind of thing you just… get used to, I mean, at least I did. So the time flew. And who am I? I guess the simplest way to introduce myself is that I’m an adventurer. I live in a fishing village in Alaska where I own a small plot of land. I love a good beer with a good laugh, and more importantly, I live for stories.  </p>\n\n<p>You would think that in this day and age there’d be few - if any - places left that leave genuine mystery. But Alaska is one of those places that certainly leave more questions than answers. It’s a bit Wild West and a bit Cousteau and just a bit… <em>unknown</em>. I mean, just recently an accurate mapping of our northernmost coastlines was recorded. Isn’t that a wild thought? Knowing the edge is there but also knowing that its specific details and navigation have been unseen? What if you got there expecting a gentle, protected bay and found, instead, an abysmal pit to certain despair where the edge of the map is simply swallowed by angry teeth? There’s not too many places left like that… left <em>unknown</em>.</p>\n\n<p>Anyways, perhaps all of that is what draws people to Alaska. And no, the cruise ship towns do not count. They’re a mockery and bring hoards of obnoxious wankers to this wild land. But they also bring the jobs. So in 2013, I packed my bags and flew to Alaska on a whim for a job, a job catering to those parasitic asshats that flock in false luxury for prepackaged adventures. I distinctly remember standing in a small bus stop in the pouring - I mean absolute pissing and <em>pouring</em> - rain, shit eating grin from ear to ear, waiting for a ride to my new home from my new boss. And I guess I never really left after that. </p>\n\n<p>I wandered the state for a few years. I flew back down and brought my Jeep up north. For the first time in my vagabond ways, I felt I had found a possible home. Fast forward, and I checked the first item off my life goals list: buy land. It was bliss. Ever since I was a little girl I dreamed of owning a plot of land, of nurturing the trees and knowing the birds by name, of dreaming under flowers I sowed, and of creating a haven for wayward souls. And I had finally done it. </p>\n\n<p>It was a small plot, just under 5 acres with neighbors rarely seen; close enough to town that the winter roads were tolerable, but far enough that the galaxy absolutely glowed when darkness finally reached the land of the Midnight Sun in the winter months (midnight sun in summer, and noon moon in winter). On the plot perched the remnants of an old cabin. It was built in the 70s and was since failing, as the creek opted to redirect itself underneath the cabin’s foundation. I’d be building a new one, but for the time being this one at least remained standing, although crookedly, and offered shelter. </p>\n\n<p>Worth mentioning: the door. It was hand made, and remarkably sturdy. It was smaller than an average door but it was dense, not anything you’d easily break into. It opened and closed with a sliding board that locked, not a simple twist and hitch. Comically, two significantly smaller locks adorned the door as well - as if the behemoth of a lock wasn’t enough... so add two more in humorous contrast. </p>\n\n<p>Once inside, one would see the cabin was essentially one large room, it was sectioned off into a small kitchen, a sleeping area, and a large living area. A huge wood burning stove fueled this tinder box between the kitchen and room, and by its size it could easily cook you out of the home. The first window directly opposite the door was savagely cracked, an angry scar that ran diagonally up the window, and the child of the house tenderly placed stickers of horses along the crack as if they were climbing up the glass slope to some unseen destiny.</p>\n\n<p>The first night in that cabin was - for lack of a more original word - unsettling. I felt as though the former owners may walk in at any moment. They left in a flash, possessions still in place as though they (<em>)would(</em>) be home that night. The cast iron skillet lazily perched on the stove, its protective oil long since aged beyond use. Posters and pictures now collecting dust seemed bewildered to greet the new face. Even the kids’ corner had paper and pencils ready for use but hastily cast aside. They had clearly been here recently, but apparently nothing warranted collection. There were books, photographs, albums and the like of the family before. I spent that entire day exploring this history left behind. But what most made me pause was a scribbled note on the table under the cracked window: “good luck.”</p>\n\n<p>Warning aside, the night went without genuine problem. And in my typical, headstrong fashion, the letter seemed less ominous and more mocking as time progressed, as if the previous owner expected me to fail homesteading this dump… I took it as a challenge. I scoffed. That eery house seemed less abandoned the more I clung to the thought that the note was merely a challenge. And I began to become settled in the cabin. Time marched on as lazily as the moose marched through my meadow. I loved my cabin, even if it was fated for eventual demise. </p>\n\n<p>Opening the door the following morning, my eyes caught a detail I originally missed. Someone had tried to break into the cabin at some point before me. The massive sliding lock had been splintered vertically and since reinforced. The sheer amount of force required to break the lock the way it had been broken was a daunting thought. It’s as if whatever hit it had been strong enough to nearly rip the entire door off the cabin’s frame, not just crack a hinge. I ran my fingers along the jagged edges of the crack and pondered what could have caused it. With no plausible answer, I went about my day.</p>\n\n<p>The weeks brought comfort. I unofficially adopted a lady moose that frequented my land, and I named her Barbara. Tucked quietly out of civilization, I made friends with moose and yelled at birds. While my rugged home was far from luxury, it was still my home. Golden light filled the eaves of trees with all manner of wildlife, and one was hard pressed to hear over the symphony of birds. I invited many folks to come and go as they needed. I was once a vagabond, and nothing meant more to a wayward soul than a roof over your head, if even for the night. Carl eagerly took the offer. </p>\n\n<p>Without hesitation, he made himself at home and plopped himself on my couch, thanking me profusely. I smiled back. I was happy to have the opportunity to help. </p>\n\n<p>“What’s that?” He questioned, looking up to the ceiling. Yet another detail I had missed: the finely hidden creases of an attic door. </p>\n\n<p>“Is that… is that an attic? I have an attic? How? There’s no space up there! Crawl space maybe but why?!” I questioned as well.</p>\n\n<p>“Let’s check it out!” </p>\n\n<p>I wasn’t entirely keen to the idea of seeing what was up there, but I also wasn’t content to not know. I was mostly concerned with <em>how</em> we’d accomplish getting up there. The surprise door was high above our heads. There was no ladder or footing to brace against. At best, one could step on the wood burning stove, but they’d still have to hoist themselves up higher than my weak arms would allow. Plus, the stove wasn’t perfectly under the door. It was a few feet off.</p>\n\n<p>“I’ll go up. I can pull myself up there.” Carl eagerly volunteered. </p>\n\n<p>Standing on the stove, he shoved the attic open. It took effort, but with some force it slid out of its locked position, and he tossed it to the side above the ceiling with a thud. A flurry of spruce cone seeds tumbled out of the opening, perhaps the work of a highly productive squirrel. And with little difficulty, he pulled his weight over, up, and into the attic. His feet sent more seeds to the earth below as they disappeared into the darkness. </p>\n\n<p>He was silent for some time in the aerial abyss, which, judging by how the darkness swallowed him whole, was much larger than I could have anticipated. Soon, his cell phone light offered some queues to his location as it shimmered through cracks in the bedroom.</p>\n\n<p>“Dude…” he spoke solemnly. </p>\n\n<p>“What? What is it?” My heart raced. His meager description was all I had to satiate my crushing curiosity. </p>\n\n<p>“… someone was living up here.” </p>\n\n<p>“Living up there?!?” I was flabbergasted. “How can you tell?”</p>\n\n<p>“There’s a mattress,” Carl started. “and some toys and other things. A few boxes and pillows.”</p>\n\n<p>“So what, the bastard child the family wanted to forget about lived up there?”</p>\n\n<p>“There’s one other thing…”</p>\n\n<p>“What? What is it???”</p>\n\n<p>“There’s blood all over the mattress.”</p>\n\n<p>“What the fuck. Get a picture.”</p>\n\n<p>“This is so fucked up.”</p>\n\n<p>“I want to seeeee! Does it look like a murder?” Morbid curiosity overtook me as I laughed. </p>\n\n<p>Carl’s phone sounded the familiar shutter noise and his flash sent light bounding from the attic like a lightning strike. There was silence, and I nearly screamed when his face suddenly appeared in the square entry above my head. He carefully lowered himself to the ground, allowing himself to fall the final two feet. </p>\n\n<p>He handed me his phone. In the poor light of his crappy phone picture, it made the scene even more eery. A single, filthy twin mattress rested askew to the wall. Cardboard walls closed off the other side of the attic that lacked true flooring, exposing the fiberglass insulation. A few soiled pillows nested against the wall, and everything had large stains of a reddish black color. Spruce cone seeds were piled several inches thick, coating the ground except for a clear trail to the attic door. </p>\n\n<p>My smile faded to a grimace. </p>\n\n<p>“Dude, that is fucked up. I don’t want to think about that.” I groaned.</p>\n\n<p>“It’s been above you this whole time.” Carl jabbed.</p>\n\n<p>“Shut up, I’ll never sleep again!”</p>\n\n<p>Carl and I spent the rest of the morning theorizing outlandish possibilities for what the hell happened up there. For each brutal idea I reached down and pet my young puppy, Dagon, as if to comfort him from such horrors. The leading theories were that the previous owner either had a deformed, outcast child living up there, or kidnapped and tortured someone up there. And as shameless as he was, Carl was content to store some of his belongings in the attic. Amidst our laughter, I realized I was going to be late for work. I grabbed my things and took off.</p>\n\n<p>Carl left later that day without my knowing, leaving all his things behind. I returned that night to an empty house. And I never saw him again. In daylight the next day I found his truck wrecked in a ravine near my house. There was no sign of him. Just his toppled truck. Neither the hospital nor local police had had any record of his wreck. For my own sake, I could only assume he was okay. Somewhere, but okay. Vagabonds did that, after all, they just disappeared.</p>\n\n<p>EDIT: apparently I suck at formatting... fixed?</p>\n\n<p>EDIT2: <a href=\"https://www.reddit.com/r/nosleep/comments/8k8c9n/outcast_part_2/\" rel=\"nofollow\">Part 2</a></p>\n</div>\n","author":"ckjm"}