{"rank":"135","title":"I've found something really weird at the bottom of my grandma's well (update)","id":"8jylii","url":"/r/nosleep/comments/8jylii/ive_found_something_really_weird_at_the_bottom_of/","time":"1526505361000","body":"<div class=\"md\"><p><a href=\"https://www.reddit.com/r/nosleep/comments/8izkbx/ive_found_something_really_weird_at_the_bottom_of/?utm_source=reddit-android\">Part 1</a></p>\n\n<p><a href=\"https://www.reddit.com/r/nosleep/comments/8lek1d/ive_found_something_really_weird_at_the_bottom_of/?utm_source=reddit-android\">Part 3</a></p>\n\n<p>Hey everyone, I&#39;m really glad to see so many people as intrigued by the situation as I am. Anyone who left some advice, it&#39;s thoroughly appreciated, especially if you were one of the people worried for my safety.</p>\n\n<p>For those who are new to the situation, I recently inherited my grandma&#39;s crumbling residence after her recent demise and there&#39;s an old well in the yard. I used a camera to see what was down there and I found that there&#39;s some kind of tunnel at the bottom, boarded up.</p>\n\n<p>I haven&#39;t gone down there yet but I have got in contact with my cousin, he&#39;s said he can help me out with some abseiling gear and guidance but that&#39;s not until the weekend.</p>\n\n<p>Some people have suggested it might be some kind of civil war tunnel, and the rotting smell is just from an animal that fell down there. I&#39;m inclined to believe believe this over the suggestions of her hiding dead bodies down there but who knows, she always was an odd one.</p>\n\n<p>Another thing a lot of people suggested was that my grandma probably didn&#39;t want us going near the thing because it&#39;s a really fucking deep well and not because of something hidden down there. I don&#39;t disagree that it&#39;s probably the case, the reason I ended up lowering the camera down there was just to see how deep it was, not because I was expecting to find anything.</p>\n\n<p>This update’s purpose is twofold however, firstly to keep people updated on how close I am to going down there and secondly to get people&#39;s thoughts on something else that&#39;s been freaking me out.</p>\n\n<p>So yesterday I was repainting one of the walls and I thought I&#39;d get some music going to keep me entertained. I grabbed an old radio from amongst grandma June&#39;s old stuff in the basement and was playing about trying to get a radio station (the reception is garbage out here) and I found something.</p>\n\n<p>I was moving the dial up and down and I hit a point where the static quieted down a little so I assumed I was close to an actual station and tried to focus it in. Instead, there&#39;s a sudden shrill ‘pop’ and it goes silent. I waited a few seconds to see if it had broken or something and I hear someone breathing. It&#39;s just 4 breaths, in and out, heavy, like whoever it was had just been running. Then it just faded out.</p>\n\n<p>I don&#39;t know what it was but something about it just sent a chill down my spine. The sound was so distinct in a way it shouldn&#39;t be on that old radio. If you&#39;ve ever watched those ASMR videos where people play around with specially built mics, it had that kind of feel. Like something is moving around inside your ear.</p>\n\n<p>I don&#39;t know why but after that I left it on that station and just got back to painting with it on the window ledge. Every now and again it&#39;ll make some kind of noise or even a broken, out of context sentence. At some point I decided to grab a notepad and start jotting down what I heard. I don&#39;t know if it&#39;s at all pertinent to anything else that&#39;s going on with the well, so if anyone&#39;s not interested, fair enough but here&#39;s what I wrote down:</p>\n\n<p>01.44 - Two loud popping or snapping sounds</p>\n\n<p>02.12 - “Hey”, echoes like it&#39;s in a cave, voice is heavily slurred or lilted</p>\n\n<p>02.36 - Sound like a metallic wind chime in the breeze, lasts for ~40 seconds</p>\n\n<p>03.09 - Woman&#39;s voice fades in, “Fair, faith, fake, fake, fake, fall, fall, false…” continues speaking but fades out.</p>\n\n<p>03.16 - Gruff voiced man, “Sorry about the skin, kid.” followed by quiet chuckling as the voice moves away. </p>\n\n<p>03.18 - High pitched squealing like microphone feedback.</p>\n\n<p>03.38 - Monotone man, “Seven billion, six hundred and twenty eight thousand” something something, I didn&#39;t catch the end.</p>\n\n<p>03.58 - About four bars of Johnny Cash’s hurt, pitch shifted down a few octaves.</p>\n\n<p>04.27 - Female, sounds young, “Oh, ooh, ooooh, oh, oh oh, ooooooooh,” each time she says it in a different register.</p>\n\n<p>04.36 - Something being thumped against a piece of wood about fifteen times, small echo.</p>\n\n<p>04.50 -  Loud, single snap.</p>\n\n<p>05.03 - Ear rape style screeching, behind it I can hear someone singing “Ring a ring o’ roses”.</p>\n\n<p>05.21 - Chorus of voices, multiple ages and genders “<em>long ‘s’ sound</em> it&#39;s going to be today, oh you bet it&#39;s not going to be today, <em>another hiss</em> spider, spider.”</p>\n\n<p>05.45 - Sound of something falling with a thump three times.</p>\n\n<p>06.03 - Hushed, “Come on, he won&#39;t be here forever. Let&#39;s do it now, now.”</p>\n\n<p>06.28 - Distant rumbling, sounds like thunder but echoing for a long time.</p>\n\n<p>06.31 - Two men argue in a European language I don&#39;t know</p>\n\n<p>06.36 - Little boy, “It&#39;s dark. Please don&#39;t leave me. Don&#39;t leave me. Don&#39;t leave me. (Intense buzzing for several seconds) You&#39;re too late. It&#39;s dark. Don&#39;t leave me.”</p>\n\n<p>06.52 - Lapping of water, a lot of echo</p>\n\n<p>07.13 - Male, angry, “Against self slaughter, weary, stale, flat and unprofitable seem to be … that grows a seed, this rank engrosses nature.” fades out.</p>\n\n<p>07.35 - High pitched beeping on and off for about two minutes.</p>\n\n<p>I&#39;ve heard a few more things since but I&#39;ve stopped writing them down. Do any of these remind anyone of anything because it seems like random gibberish to me. Anyway, as I said it doesn&#39;t have anything to do with the well it&#39;s just kept me captivated all afternoon. Seems like someone nearby has there own test signal and these are just filler phrases or something.</p>\n\n<p>Quick question for anyone who knows what they&#39;re talking about, a lot of people suggested I check the oxygen levels down  there, could anyone let me know what kind of equipment I nrd for that and maybe send me an Amazon link? It would be a world of help. I&#39;ll keep you all updated on anything, but hopefully I&#39;ll be going down there on Sunday, God willing.</p>\n</div>\n","author":"Twofailedactors"}