{"rank":"5","title":"I think something is coming.....","id":"8jyplm","url":"/r/nosleep/comments/8jyplm/i_think_something_is_coming/","time":"1526506262000","body":"<div class=\"md\"><p>It was the winter of seventh grade for me. The weather was turning colder, the grass crunching under our feet as we walked on the frost-tipped blades. Sweatshirts and hoodies were being wrenched out of closets after months of sitting around. The school year was going by relatively quickly, and I knew that it would be Christmas in no time, and with it, Winter Break. </p>\n\n<p>“Alright, kids, pack up your stuff before the bell rings.”</p>\n\n<p>We all rushed to get out stuff, and me as usual hurrying a little faster than the other kids; my bus was unusually crowded, and everyday me and my friends had to sprint to the bus to guarantee a seat. I grabbed my pencil and shoved it into the pencil case in my backpack, swinging the sack over my shoulder and waiting by the door. My heart thumped with anticipation. When I heard the bell ring, I yelled a swift goodbye to my teacher and ran out of the classroom. I swerved around the stampede of kids rushing to get to their busses. </p>\n\n<p>Once out of the school I streaked across the ground, my feet pounding against the dirt. As the grass gave way to concrete, I jumped onto the first step of my bus, 4. Plopping down in a seat, I tried to catch my breath. </p>\n\n<p>*  *  *  *  *  *  * </p>\n\n<p>As I settled into bed that night, I let out a sigh. Today had been a good day. I didn’t have any homework, like usual, and I had had some peaceful alone time with my brother at baseball. My eyelids drooped, and my limbs felt suddenly tired. Strangely exhausted, I let the calmness of sleep take over me.</p>\n\n<p>For a second I thought I was dreaming, but with an odd feeling I realized I wasn’t. That was weird. Hadn’t I just fallen asleep?</p>\n\n<p>Wait, no, I couldn’t be asleep. I could still hear the chirping of the crickets outside, and my mother snoring in the next room. Trying to open my eyes, I felt my stomach drop when they stayed closed. I tried again, but nothing happened. </p>\n\n<p><em>Shit….</em></p>\n\n<p>Instantly, I tried to move the rest of my body, but it wouldn’t move either. A wave of fear descended over me as the realization of what was happening hit me. I knew what this was. </p>\n\n<p>This was sleep paralysis.</p>\n\n<p>I started to panic, but quickly calmed myself. Hadn’t I wanted to experience this? Now that it was actually happening, I knew that I had made a mistake when I wanted this. </p>\n\n<p>Then, I heard them. The heavy, creaking footsteps coming down the hallway. </p>\n\n<p><em>Someone’s in my house!</em></p>\n\n<p>With all of my young child heart, I wished that it would be over. I knew from research that sleep paralysis made you hallucinate, but it felt so real.</p>\n\n<p>The footsteps were coming closer. My heart began pounding in my chest so hard I was surprised it didn’t wake up everyone in the house. </p>\n\n<p>They paused outside my door. I was so god damn scared that I was having a panic attack. Suddenly, a blood curdling shriek pierced the still night air. Redness spilled over my vision, and the image of a demented little girl with filthy, matted hair appeared. </p>\n\n<p>Gasping, I sat bolt upright in my bed, sweating profusely. A pool of the nasty smelling body product lay around me. </p>\n\n<p>I looked around, searching for the girl, but no one was there. The sky was still dark, stars shimmering in the night. I wrapped my arms around my knees and began sobbing. </p>\n\n<p>*  *  *  *  *  *  *</p>\n\n<p>The next day at school, I gathered all my friends at recess and told them about the dream. I explained in great detail the girl and the frightening red vision. I noted the bags under all of their eyes, but blamed that on middle school; everyone had bags.</p>\n\n<p>The second I finished telling them, their jaws dropped, and their eyes widened. I listened with horror as each of my friends in turn said that they had had the exact same dream. The even filled in the parts I had left out perfectly, as if it were some story on the internet. </p>\n\n<p>I was frozen with shock. How could this happen? This isn’t possible! </p>\n\n<p>When I got home, I threw my backpack on the floor and sat down at the computer. I scoured the deepest parts of the internet, but I found nothing. </p>\n\n<p>Or so I thought.</p>\n\n<p>I stumbled upon a website that was talking about unsolved murders. One of them was of an 11 year old girl that got murdered 30 years ago. They said the parents came home to find the a bloody trail of footprints and the daughter missing. Carefully, I clicked on the picture, and felt a wave of shock.</p>\n\n<p>It was the girl from my vision. My bloodied, horrifying vision. </p>\n\n<p>My hands shaking, I looked at the date missing/murdered and the place where it happened. I felt bile rise in my throat when it said my address, and my birthday the year before I was born. </p>\n\n<p>As I stared into her gray eyes, I remembered the sound of the heavy, creaking footsteps from my sleep paralysis. I knew she was coming, looking for someone to place the blame on, trying to get revenge for her untimely death. And, since I was a convenient target, I knew that it was only a matter of time before she found me. </p>\n</div>\n","author":"AffectionateCourt"}