{"rank":"90","title":"What I found wandering around the halls of The Medical Center","id":"8jyvia","url":"/r/nosleep/comments/8jyvia/what_i_found_wandering_around_the_halls_of_the/","time":"1526507591000","body":"<div class=\"md\"><p>I was recently in the hospital for a minor injury. I have a bleeding disorder, my blood does not clot, so when I take a big tumble I sometimes end up in a room for a few days while they watch me and administer factor 8. I’m pretty clumsy so they typically see me at least once a year.</p>\n\n<p>I’m a good patient if not a bit bored at times. I take care of myself and don’t usually need any assistance getting around so the nurses love me. They just have to check vitals and sign off. While they may enjoy having a patient who is self-sufficient, I kind of hate it. I almost wish I was limited to my bed.</p>\n\n<p>As long as I don’t have any injuries in my knees or ankles they allow me to roam the halls. I walk around and see a lot of different kinds of reasons for people to be here.</p>\n\n<p>The nursery is a favorite. Getting to see the babies, even the crying ones, is a treat. Sometimes the mothers will be generous and allow me to hold one. I cannot have any of my own with the bleeding disorder, so it’s nice to get to share the moments with others.</p>\n\n<p>The chapel is another favorite. It’s the quietest place in the whole hospital. It’s small but still very regal. There is stained glass and a few statues. The pews even have a pull down pad for you to kneel on to pray. I am not religious and mostly just use to think and the chaplain knows me well enough to not try and win my soul.</p>\n\n<p>I’ve even watched some operations from the theater! It’s very interesting and the doctors will talk about what they are doing. Sometimes I feel like I could do one of the more frequent surgeries I know them so well.</p>\n\n<p>I was roaming around one day and stumbled upon a door I hadn’t paid much attention to before but for some reason today I was drawn to it. The plastic blue and white sign glued to the wall by it stated it was the ‘Viewing Theater’. I wondered if it was a new surgery viewing room and pulled at the door. It stayed firmly shut. I assumed it was closed to the public and moved on.</p>\n\n<p>As the day went on, I couldn’t stop wondering what was behind the door. I asked my charge nurse Sandra if she knew. She said it was probably a doctor’s only but had never seen or heard about it before. I prodded my tech Nancy who is the floor’s biggest gossip to only be disappointed that she hadn’t heard of it either.</p>\n\n<p>As the day turned into night my curiosity bloomed to an unreasonable level. I decided to make my way back down and try the door again. Maybe I pulled the wrong way, or maybe a doctor had locked it while checking something out.</p>\n\n<p>After my 2AM vital check I feigned sleep while my night nurse shuffled out and began chatting with the others at the nurse station. I slipped right by them and took the stairs down to the bottom level where the door was located.</p>\n\n<p>As I approached the door I suddenly felt a chill down my spine. During the day the hospital seems bright and lively, but at night it was dark and all of a sudden I was frightened.</p>\n\n<p>Standing in front of the ‘Viewing Theater’ I began to shake. I had worked myself up too much and felt silly shaking my head. I reached out to the knob and twisted to the right and it did not resist. I gasped at my fortune and pulled the door slightly. It came towards me and I started feeling excited rather than fear.</p>\n\n<p>It was dark in the room past the door so as I crossed the threshold I patted the wall to attempt to find a switch or light source. My fingers fell on a wide flat switch and I pushed it up. I heard a terrible whirling initiate and I screamed out in terror. I pushed the switched down and the loud noise subsided. I kept feeling and another switch appeared. I squinted in anticipation and pushed it up expecting another loud noise.</p>\n\n<p>The lights flickered for a moment and then light the small room fully. As my eyes adjusted to the stark white everywhere from the ceiling to the walls and floor I noticed the room was almost barren. In the middle of the room was a white desk. On that desk was a white monitor. I didn’t seen any cords or plugs but just assumed the IT was really OCD about appearances and walked up to the desk. There was no keyboard. Only a white mouse that looked minimal at best.</p>\n\n<p>As I stood in front of the computer it suddenly flickered and the hospital logo appeared. I jumped back in surprise. I guess the light switch also controlled the power to the computer. As the logo faded into black the screen populated with what looked like an agreement to sign in. I quickly skimmed the text about how this was the hospital’s property and yadda yadda.</p>\n\n<p>In my eagerness I didn’t read very thoroughly and just clicked on ‘I Agree’. The screen then went to a desktop with 3 icons. One was the recycle bin, one was Internet Explorer, and the last was a file folder named videos. I scoffed that the hospital only had Internet Explorer. If the IT department can hide wires surely they could download Chrome. I hovered over the last icon named videos.</p>\n\n<p>Hesitating for the first time in this adventure I wondered if I was breaking any laws looking through this stuff. More than likely there would be patient information that I should not be allowed to see, but the computer did not require any passwords so I soldiered on. Opening the video folder I saw hundreds of video thumbnails appear. All of them were too small to see what they were about so I clicked on the first one.</p>\n\n<p>The video booted up and the giant play button in the middle teased me to click it. When I did a hospital room filled the screen. A frail looking man was in the bed, what looked like his son sitting next to him. You could hear the wheezing through invisible speakers and a soft sob most likely coming from the man sitting next to the bed. I watched intently unsure of what was going to happen.</p>\n\n<p>After a long time of wheezing and the occasional sniffle I thought this might be a security video but the son stirred a bit when another man joined him in the room. The man was in a doctor’s jacket and the muffled talk looked bleak. The son shook the doctor’s hand and glanced down at his father again before leaving the room.</p>\n\n<p>The doctor stood looking over the old man still gasping for each precious breath before turning to look the camera straight on. I was frozen there feeling chills all over, like the doctor could somehow see right through to me sitting in the stark white room.</p>\n\n<p>The doctor turned back towards the man in the bed and placed a fluffy pillow on his face. After a beat he picked up the pillow and placed it back on where he found it. A tear I didn’t know had been growing in my eye fell on the desk. My mouth hung wide open in shock and denial. The doctor turned back towards the camera and held one finger to his lips in a shushing signal and then walked out.</p>\n\n<p>I felt bile begin to rise in my throat and fled the white room. I made it about 10 feet to a trash can and emptied the contents of my stomach. Hospital food was way worse coming back up than going down. I held the trash can like an old friend as my body convulsed until it was too weak to continue. I sat in the floor for a while before I found the strength to stand again.</p>\n\n<p>In a haze I made my way back to my room and lay down. I didn’t sleep, but my body still weak from throwing up shivered under the thin blankets and my eyes began to droop. I didn’t even hear the nurse come check my vitals at 6am and woke up around 8am.</p>\n\n<p>I felt scared and shook up but didn’t know what to do. I didn’t know if I should tell anyone what I saw. I have never felt so frighten. When breakfast came wheeling around I wasn’t sure if I could eat but I knew I should try. Smelling the bacon I began to relax a bit. Food was always a great comfort, but as I lifted the plate cover something was on top of my eggs and bacon.</p>\n\n<p>It was a white card with bold black lettering. ‘I KNOW YOU SAW.’ was printed almost threateningly. I screamed out and the nurses came in questioning me. I suddenly covered the plate and quickly said I just saw a bug in the corner but that it was gone now. The nurse clicked her tongue at me but walked back out to leave me to eat.</p>\n\n<p>I picked up the cover again praying the card wouldn’t be there but it was. I slipped it onto the bed and under the cover. Shaken up I felt bile rise again and swallowed hard. I looked around the room and wondered if there were cameras in here too.</p>\n</div>\n","author":"impressed_jess"}