{"rank":"23","title":"Someone has been using my Toilet Paper [Part 4] - Pray for me","id":"8jz282","url":"/r/nosleep/comments/8jz282/someone_has_been_using_my_toilet_paper_part_4/","time":"1526509203000","body":"<div class=\"md\"><p>Part 1: <a href=\"https://www.reddit.com/r/nosleep/comments/8exoxl/someone_has_been_using_my_toilet_paper/\">https://www.reddit.com/r/nosleep/comments/8exoxl/someone_has_been_using_my_toilet_paper/</a>\nPart 2: <a href=\"https://www.reddit.com/r/nosleep/comments/8ftnle/someone_has_been_using_my_toilet_paper_part_2/\">https://www.reddit.com/r/nosleep/comments/8ftnle/someone_has_been_using_my_toilet_paper_part_2/</a>\nPart 3: <a href=\"https://www.reddit.com/r/nosleep/comments/8g5vda/someone_has_been_using_my_toilet_paper_part_3/\">https://www.reddit.com/r/nosleep/comments/8g5vda/someone_has_been_using_my_toilet_paper_part_3/</a></p>\n\n<p>I apologize for the long wait in between updates, between working on my grandmother’s estate and dealing with this thing I have not had much time to sit down and write. </p>\n\n<p>My father and I drove the rest of the way home and were greeted by my very concerned mother. She had not expected us home so early and was definitely not expecting us to be as shaken as we were. My father remained silent, despite her pleading with him to tell her what happened. He shook his head and walked inside, brushing her off. My mom looked at me with a sad yet confused expression, as my parents have always had a good relationship and it is rare for my dad to ignore her like that. I sat with her on the front porch, explaining to her what had happened. As my story progressed, her face grew pale and I could tell she was as worried as I was that my father had acted so out of character. The whole time the dogs sat at our feet, sensing our uneasiness, releasing a few whimpers every now and then and contributing to an overall unsettling feeling.</p>\n\n<p>After telling her my story, I decided I didn’t want to think about this thing, as the more attention I gave it, the more power over me I thought it had. We continued about our life for a while, going through boxes of my grandmother’s stuff that we had been avoiding for a while. All this time though, I was unsettled, kept all my curtains closed, avoided mirrors for fear that I would see that thing staring back at me, and would not stay in the house alone – if my parents went out, I went out with them. I was so afraid to be left on my own and have something happen.</p>\n\n<p>During this time, after a few days of deciding what clothes to give to Goodwill, what knickknacks to keep and what were just “old lady hoarder junk” my parents found old photo albums and such of my grandmothers to go through, and we sat down that night (about a week after the incident with my father) to reminisce on all the bittersweet moments captured in the images. </p>\n\n<p>We went through the book, looking at baby photos of my father, images of my grandfather holding him, and just overall photos of a happy, normal family. My father seemed visibly upset by the sight of his dad; as I had mentioned earlier he passed away when my father was quite young. I realized I had never heard much about him aside from that my father resented his alcoholism and felt abandoned by him – a touchy subject so I had never wanted to bring it up. However, after the happenings at my grandmother’s house of late, I deemed it and appropriate time to ask. </p>\n\n<p>“Dad…” I said “Can you tell me more about your father? I know it’s… not easy…” suddenly images of that thing started flashing through my mind and I could not shake the feeling that I was being watched at the very moment “I think it might help with, you know, what’s been going on” referring to the events of the past week. I felt that I needed to figure out what this thing was, and obviously it was tied to my family in some way. As much as I didn’t want to think about this creature, I knew the only way to shake my fear was to figure out what it was. Maybe it was a relative of some sort and finding out it was someone looking after me (who just happened to be deformed and scary) might make me feel better and regain my independence. </p>\n\n<p>My father looked at me with sadness in his eyes. I will summarize for you what he said to me, as it was an hour-long conversation and I don’t want to bore you with the irrelevant details. I also do want you to keep in mind that this is a lot of secondary information from my grandmother – she had told my father about this once he grew up, but some of this is his own memories. However, what is to follow should help justify what I have been doing recently.</p>\n\n<p>He told me that his father was around for the first five years of his life before he passed (at the time my father was five and his brother seven). He had fond memories of him up until his fourth birthday – his dad had missed the party, and did not come home until the next day reeking of booze and wearing the same clothes he left the house in the day before. His mother, my grandmother, screamed at him – my father later found out that while she was pregnant with his older brother his father had a drinking problem and they almost split because of it, but he got in under control to raise his family – he was not allowed back in the house until that night, when my grandmother let him in to shower and sleep on the couch. He had sat on the front steps all day patiently waiting for her – he knew she would soften up and let him in. </p>\n\n<p>I guess that was how their relationship continued until his passing; my grandfather coming home after hours, days, or even weeks a couple times smelling horrible and looking like death. He would sit outside and wait for my grandmother to let him in, which she always did in time. Sometimes it took an hour, while in more severe times he would sleep on the steps and come in the next day. During this time, my grandmother was working her ass off providing for these kids. She had been a stay at home mom for a while, but after a few months of her husband’s bullsh*t she decided to get a job because he was blowing through their savings at an alarming rate. </p>\n\n<p>This was when the business trips would start – since she was new to the company (she had gotten a sales job) my grandmother was often the one made to go on the trips that no one wanted and did so as she needed to hold down the job for her sons. This often meant leaving them home alone since their dad was nowhere in sight and she had to provide. At ages seven and five, this was a big risk, but she could not afford a babysitter and they had no family in the area. My grandmother resorted to asking a neighbor to check on them in the morning and at night, as they were in school so had someone to watch them for much of the day. These trips could last anywhere between 2-5 days, but were usually on the shorter side. My father told me he would always remember his mom coming home looking extremely worn out, as if she did not sleep while she was on these excursions. </p>\n\n<p>This is pretty much all I got from him, but it intrigued me. Where would she stay, what was this company, what did she sell? I asked my dad all these questions, but he had no answer. He told me how odd it was that his mother never told him where she was going – she would say to a new headquarters to work on sales training; even as an adult she wouldn’t tell him the company (she would say she didn’t remember which my father found odd because her mind was always sharp right up to the end). He did tell me that she had once brought him a postcard per his request. He had asked her for one as he missed her, and wanted to picture his mom in a pretty place to know she was safe (kid logic, I know). I asked him to keep an eye out for it, as I was curious to see what my grandmother had been doing all that time. I admired her for working so hard for my father and uncle, and as a writer I love details like that.</p>\n\n<p>From there I asked about his father’s death and what he remembered. He said it was one day after his mother came back from a business trip in late January. She sat him and his brother down in the living room and told them that while she was away, a police man called her hotel phone and asked to see her. She went to the station where she was told he passed away. My father said he didn’t really remember much after that as a kid; he had tried to block it out and succeeded. </p>\n\n<p>However, he had asked his mother about it as an adult and she gave him a little more information. The story was the same that she had been called to the station on a trip and had learned of his passing. She said it was an accident, that somehow, he had passed out from drinking and possible drug use and suffered from hypothermia. His body was found in the woods somewhere in Maine. This was shocking for two reasons: the first being that he must have been really drugged out for him to just not wake up. My grandmother also told him that he was probably at a bar and had gotten in a fight, as his hands had cuts all over them and he had bruises on his face. The brutality and harshness of his death was horrifying.</p>\n\n<p>The second reason I was so disturbed by this is the fact that that house is in Maine. Knowing that he passed out there made me think that his binges may have involved that house, and that was why my grandmother kept it secret from my family – she didn’t want anything to do with the house that killed her husband. I don’t blame her one bit. </p>\n\n<p>This knowledge comforted me somewhat at first, and I decided that whatever was at the house could be connected to one of my grandparents – either my grandfather or grandmother watching over me. I decided to return to the house later that week, which is where I am while writing this. It is my first day back, and I was about to settle in for the night when I figured you could use an update. Nothing has happened here since, but my parents let me take both dogs up with me just in case. I also am only staying one or two nights to test it out, just to make sure I don’t invade whoever is here’s space. </p>\n\n<p>As I am writing this to you now though, I realize the gravity of my mistake. I forgot one crucial detail in my logic in coming back up here. My father had seen the same creature while his mother and father were both away, but before either of them had passed on. Whatever this thing is, it’s not one of them. I wanted to leave as soon as I figured this out, but my car is low on gas and nothing is open at this time of night. I plan to be awake all night and leave at the earliest hour possible. I should never have come back, and I know every one of you reading this is telling me to leave, but I’m only human. I made a mistake coming here, but now my curiosity has the better of me. I know what the thing looks like, and I have my two dogs. I am going to remain awake and alert all night and will let you know if anything happens. Until then, pray for me.</p>\n</div>\n","author":"insomnia_storyteller"}