{"rank":"1070","title":"Flight 347 Came Back","id":"8jz7gp","url":"/r/nosleep/comments/8jz7gp/flight_347_came_back/","time":"1526510501000","body":"<div class=\"md\"><p>I watched the somber faces of families, huddled and sniffling as they waited eagerly for news about their loved ones. It was a standard, daily flight from Detroit to LGA in New York, but the storm had caused delays. As the reports came in from air traffic control that the flight crew was not responding, the rumors spread throughout the airport and before long, the situation unfolded into panic as wailing mothers, sobbing fiancees and praying grandmothers filled the gate with a dismal chill. My eyes watered and nose streamed as well with the rumors of a problem, my sister Sam was on board the plane.</p>\n\n<p>Each passing hour it became more apparent a tragedy was unfolding. I offered some tissues to a whimpering mother who wouldn’t stop saying “my baby”, over and over again. As the hours ticked slowly by, the realization we were dealing with a devastating loss of lives became realer and more upsetting. Families began to trickle out to find hotels for the evening. As the evening sank into the full of night, more and more left, but I waited for my sister, eventually falling asleep on the vinyl seating of the gate’s waiting area.</p>\n\n<p>The next day, I awoke to a mess of people demanding answers, and they had none. When the pilots had been in contact, nothing out of the ordinary was mentioned, and no flights had gone down anywhere along the flight path. “You are just hiding the truth from us to save your ass!” screamed an irate, balding man awaiting the arrival of his wife and daughters. The mob grew angry, but it soon became clear the uniformed woman behind the counter knew nothing we didn&#39;t already. The patient woman shared each communication as did the customer service managers, and we had no option but to wait for news. By the end of the day, most families had stumbled out of the airport defeated, realizing their loved ones were likely dead in a crash.</p>\n\n<p>I scoured the news feeds daily, refreshing for any development the first few days. There was nothing of note aside for news of the missing plane with every detail we already knew, and soon the media began covering the plane’s disappearance as a disaster, stating it the largest missing commercial flight since flight 370. It became clear my sister was dead and I began drinking a bit more and lashing out at my friends and coworkers, unable to truly process my grief. Sam had been my best friend my entire life, a tomboy rocker with a comedian’s wit and a heart of gold. It all felt so unfair, yet still I tried to come to terms with her loss.</p>\n\n<p>I began talking to my parents in Michigan daily, reliving memories of childhood, graduation and holiday blunders. After a week of talking with my parents on the phone, they began discussing funeral arrangements, and reality slapped me hard once more. I was ready to accept it this time, however, and agreed to fly back home to help them with the planning.</p>\n\n<p>I’d booked a flight online and cabbed to LaGuardia after work that Friday, a bit uneasy about flying but far more concerned with having to say goodbye to my sister via an empty grave. When I arrived at the airport and saw the news vans parked outside, I pushed through and began to overhear earfuls of gossip and rumors that floated about in growing confusion as I pieced the news together about what the commotion was about. Flight 347 had returned.</p>\n\n<p>I listened to the gray-haired man with rolled sleeves yell to the gathered crowd as he explained everything he knew. The plane just popped up on the radar and was cleared to land. He said no known damage had occurred and as far as he knew, everyone was likely on board and accounted for. I listened in disbelief, there was no way that flight would have enough fuel to stay aloft for such an extensive period of time. And what had it possibly been doing, circling for a week straight? Mostly, however, I was overwhelmed with the possibility that Sam was actually alive.</p>\n\n<p>My information came in pieces, and soon the families I had waited alongside that first, dreadful night showed up, eager to be reunited with their loved ones. I saw familiar, tear-streamed faces and heard many use the words “miracle”, “impossible” and “guardian angel”. I smiled and thought of there being some kind of higher power that somehow brought our families back, and soon we received news that the missing flight 347 was to be deboarded and the crowd erupted in celebratory cheers.</p>\n\n<p>I cancelled my flight and excitedly relayed the news as it occurred to my parents, who cried with joy at the unexpected miracle. I accepted a plastic cup of wine from a mother I’d shared tissues with that first, harrowing night. It felt surreal, almost like a dream, and in reality I knew it was like a dream, these things simply don’t happen. People simply don’t come back from a week missing from their flight pattern. Still, I cheered and hugged those eager to see our beloved missing families. We clapped and cried as the plane arrived without a hitch and waited by the doors as the passenger boarding bridge was brought out. The first of the arrival crew headed to greet them and excitement built, but then we heard a scream.</p>\n\n<p>Minutes slowed as we waited until finally, the staggering employee, holding herself up with the wall, came into view. She was pale and wide-eyed, a thousand yard stare frozen on her freckled, previously smiling face. A help desk employee tried to assist her, but she seemed vacant and detached, and soon a security officer joined the side of the help desk employee as they headed into the skyway to the plane that came back. After a few long minutes, they too returned, pale, sweaty, uniforms stained with  fresh vomit. The woman from the desk was rocking and shaking her head and soon began scratching her eyes until the security officer physically restrained her arms to prevent her from blinding herself. We all stood by and gawked with growing concern. When the passengers finally began to emerge from the skyway, screaming and crying echoed through the gate as my eyes fought to adjust to what I was looking at exactly.</p>\n\n<p>They came back, every passenger on that flight and they all came back wrong. My mind tried to understand the sickening forms of legs that folded too many times and hands that festered with rot and decay. Malformed limbs dragged misplaced bones and entrails, none of which belonged where they now resided, streaking the carpet black as those terrifying figures emerged. The disturbing collages that once were humans now spilled into that gate, staining the minds of each one of us as sanity teetered and crashed into crumbs at the horrors of what had become of them.</p>\n\n<p>I bit my finger until I bled, stumbling backwards as one by one, they approached, each somehow more ghastly than the last. I collapsed to the carpeted floor when I saw that hideous thing I knew was once Sam from her clothes drag its torso, now more of a clumped, bone-filled mess behind that warped, nightmarish head that howled a sickening moan. There was only one collective thought all the waiting family members shared now that Flight 347 came back, and it was that we all wished more than anything that it had <a href=\"https://youtu.be/WkkB47RlQ3M\">not.</a></p>\n</div>\n","author":"mrmichaelsquid"}