{"rank":"22","title":"My Demon","id":"8jzbbq","url":"/r/nosleep/comments/8jzbbq/my_demon/","time":"1526511436000","body":"<div class=\"md\"><p>My name is Casey. I&#39;m nineteen, and I work at a local gas station in Northern Virginia. Not many cars pass down my street, not many cars really pass through my little town, really.</p>\n\n<p>I&#39;m typing as quickly as I can because I&#39;m afraid it is coming for me. You may be wondering what <em>it</em> is exactly, and I can&#39;t really describe it. I&#39;m just going to describe it as a demon. </p>\n\n<p>I saw the car pull up into the parking lot. This was only one week since I started this job, and this was my first time even getting a customer. After all, this was the latest shift. 11 pm-3 am. I looked up from my magazine as I saw someone slowly striding over to the store, his black hood up enough just where the light created a shadow upon his face, which I could not see. I silently put away my magazine as the person walked in. He, or she, I couldn&#39;t tell, walked over to the counter and stared at me. I blinked, awkwardly turning my face away. </p>\n\n<p>&quot;How may I help you, sir?&quot; I said in a shaky tone. </p>\n\n<p>He only stared. I cleared my throat, backing up. He never even looked up from what I saw him staring at. He was staring over my shoulder, outside. I shot around, looking to find.. nothing. I turned back, seeing that he was gone. I would&#39;ve heard him run, or I would&#39;ve heard the bell on the door go off. &#39;Where did this fucker go?&#39; I thought to myself as I eagerly looked around for him. I grabbed the phone and began dialing my boss. I know, it was stupid not to dial 911.</p>\n\n<p>My boss never answered. The phone never rang. The buttons didn&#39;t work. I looked over to the cord which was cut. I booked it away from the counter, over to the door. I was about to leave when I noticed another man out there. He was tall and lanky. I could see his hands which were strangely pale. I backed up, but his head shot over to me like a chameleon spotting a fly. He flicked away the cigarette that he had and began walking over. I could see his face now. His eyes were gray, and his lips were the same color. He tried to open the door, but in the split second that he was walking over I managed to grab the keys and lock it. It glared at me. It walked out of view, and I instantly ran over to an angle which I thought I could watch him. Gone.</p>\n\n<p>I shot around, hearing shuffling behind me. There it was again, and it was slowly stalking towards me. I turned around, trying to unlock the door. I turned it the wrong way, I flipped it over, flipped it back. I couldn&#39;t figure out the way to do it. I felt a hand on my shoulder, which pulled me backward and slammed me into a shelf. A few items fell on my head, causing me to fall into a quick daze. I looked up, spotting it again. I scrambled backward, standing up and running for the back door. I decided it&#39;d be stupid to run into the parking lot or call for help, since no one would even see me. Every house was at least in one mile away from me.</p>\n\n<p>I ran into the dark forest behind the small station, lying down on my stomach in a large group of bushes.</p>\n\n<p>Now, I lie here in these bushes with terrified eyes and a very big anxiety attack. I&#39;d call the police but.. it&#39;d hear me. I&#39;ll get back to you soon. It&#39;s coming. I have to go.</p>\n</div>\n","author":"yeet_demon"}