{"rank":"23","title":"Dissonance","id":"8jzmwd","url":"/r/nosleep/comments/8jzmwd/dissonance/","time":"1526514292000","body":"<div class=\"md\"><p>Have you ever just felt not real? Like, yes, you’re aware that you exist but things don’t always feel like they are correct. You don’t think the way your mind works is correct, certain things you see seem wrong for some reason, you look at yourself in the mirror and it feels more as you are looking at a picture of someone else rather than yourself. Dissociative disorders are not a fairly common mental illness but to those it affects it takes a toll more than anyone can know. The toll ranges from both mentally to physically. I noticed the toll beginning to take to my psyche when I had come home from work one day to notice the pictures on my wall had been rearranged. The thing about being in a dissociative state is that you sometimes will do things but not remember doing them. I chalked the rearrangement up to just that.</p>\n\n<p>Allow me to introduce myself, I am Harley Szczuka, and I’m probably the most boring person you will meet. I work in an office, answering customer calls, sorting through files in the sea of cabinets, eat lunch at my desk, and very rarely interact with my coworkers. Don’t get me wrong, though, I’m very happy doing this. I was always very awkward when it came to socializing and happily spend my weekends eating popcorn alone on the couch while rewatching old movies. I don’t know if I was always anti-social, but it definitely increased when I started experiencing dissociative episodes more frequently.</p>\n\n<p>The most frustrating part of dissociation is that I forget a lot. I try to think back to my childhood and often can’t remember anything. I will occasionally forget the name of my mother, my only living relative. I don’t talk to her much regardless, I live in a completely different country and the time zones make it difficult to communicate.</p>\n\n<p>As I already said, I came home after a usual day of work to notice that the three paintings that I have on the north wall immediately once you enter the house, were not in the same arrangement I had last remembered them being. They looked better this way, so I thought to myself that I must have changed them one day and simply forgot. Minor things like this are not rare occurrences, but I usually think the same thing. ‘I forget everything, even sometimes my own name; I must have moved it and just forgot.’</p>\n\n<p>However, the concern began the day I woke up and my bedroom was not set up the way it had been when I had gone to sleep. My bed, usually perched centered under the window of the East wall (I like the rising sun to wake me), was now in the corner; my night stand moved with it; my dresser stood adjacent to where my bed once was. Now, I know I move things and forget, but I know for sure that the dresser is too heavy for me to move by myself and I definitely didn’t have anyone over last night. I called the police who came to inspect and found no signs of a break in but couldn’t come up with a conclusion as to what happened. The lead officer gave me his card and told me to call if anything else happened.</p>\n\n<p>I felt myself slip back into that ghost-of-a-shell feeling of nonexistence and the next thing I knew it was two weeks later. I’m sure I went to work during those missed days, since I didn’t have any missed calls, but the days had slipped passed me more intensely than they usually had. The only thing I knew for sure was that I was so hungry. I felt as though I hadn’t eaten in that entire two weeks. I went into the kitchen and attempted to gorge myself, yet nothing seemed to do the trick. I felt weak and slowly crept to the bathroom. The girl in the mirror was about 10 lbs. lighter with hollow cheeks and dark, sunken eyes.</p>\n\n<p>As I sulked around the house I felt as if something was off, but I couldn’t quite tell what it was. A sensation of sorts that there was something different, but I was too tired and too weak to focus on what it was, or to even care. My stomach rumbled loudly as I sat on the couch and turned on the television. I knew I could find comfort in being distracted.</p>\n\n<p>I must have dozed off on the couch because I awoke to a nightmare. I was strapped to a hospital bed, my wrist restrained so tight and I couldn’t move them at all. My ankles were the same, and two large straps went over my chest and my hips. Three men stood around me, though a bright light above me made me squint and unable to see them clearly. I moved my head to the side to look around the room and felt a cold metallic band on my head and wires to my temples. </p>\n\n<p>“Look who is finally awake. If you help us today maybe we can finally get you something to eat, I know you are hungry.” One of the men said with a chuckle. One of the other doctors pulled out a scalpel and made an incision in my leg. I screamed out in pain, the more I screamed the deeper he cut. After it felt like he had cut halfway into my leg, he stopped. All three men stepped back and stood in silence, the third man scribbling on a clipboard. The first man, the one who had spoken to me earlier, furrowed his brow and looked a mixture of angry and disappointed.</p>\n\n<p>“A shame,” is all he said before pressing a button on the wall. A surge of electricity flowed from the metallic band into my head. I felt like my brain was going to melt or explode, then everything went black.</p>\n\n<hr/>\n\n<p>I woke up with a start on the couch. I usually don’t remember my dreams, but I do know that I do have nightmares of torture occasionally, I just try to ignore and forget them. I tried to stand and felt a phantom pain in my leg from where the man had cut into me. Inspecting it, though, I realized that it was all in my head.</p>\n\n<p>The following few weeks were uneventful. Nothing seemed out of place when I got home from work, I had the occasional phantom pain but didn’t have any nightmares, I didn’t even seem to dissociate too often. I was surprisingly mindful and active throughout the week. I even talked to some coworkers who then invited me out for a drink after work one Friday. Things seemed fine until one night, in my usual spot on the couch I felt as though I was not alone in my house. I had that stomach wrenching feeling of being watched by someone, someone that was just out of sight. Against my instincts I got up from the couch and looked around the small house to see if anyone was there. The house itself is not large, a kitchen, living room, one bedroom, one bathroom, and an office. A sweep of the house took less than five minutes. My hyperawareness from paranoia finally dissipated as I searched the final inch of the house, no one was there. I decided that I had watched too much TV that night and should head to bed. As I walked down the short hallway I caught a strong whiff of bleach that made me gag. The smell filled my nose and shoved itself down my throat. I ran to the bathroom and threw up in the sink. After the bile cleared and the dry heaving stopped, I looked up at myself in the mirror, a dark black figure stood behind me in the door way. I spun quickly, and to my relief, there was nothing there. Honestly, I don’t know what I would have done had something been there. The only thing I did know is that I wasn’t sleeping that night.</p>\n\n<p>Throughout the night I kept feeling the sensation of being watched. I grabbed my laptop and began searching the web for stuff like this. I searched everything I could think of, the solid black figure, putrid smells with no source, sensations of being watched, rearrangement of furniture, and losing days to weeks of time with no recollection.</p>\n\n<p>For everything I searched I looked at multiple pages before searching again, after searching everything I could think of, and then combinations of those things, I spotted an explanation in common. Ghosts were notorious for moving things, giving people uneasy feelings, causing smells, and obviously apparitions. Possessions can lead to loss of time. I did another search: How to get rid of spirits. I found cleansing rituals with burning sage, I saw things about laying salt in doorways, and several other things that made me feel at ease, knowing I could at least get rid of this entity that had been driving me mad.</p>\n\n<p>I woke up fresh the next day, new energy filled me, and I set out with a make shift shopping list of things necessary to ward of the entity. For the first time in a while I felt like I had total control. Not just over the situations at hand, but my own mental state. I felt that maybe this entity may have had a part in my increasing episodes of dissociation. If, maybe, I got rid of it, I could then begin to live the life I wanted to.</p>\n\n<p>I purchased sage and several large things of salt, lined my windows and doorways with the salt and lit the sage. The instructions I had found stated to start at the north-most wall of the house and work yourself clockwise until every inch of every room had been bathed in the smoke. I felt the house feel clean in a way I can’t describe. The entire energy inside the house shifted into one of peace. </p>\n\n<p>The next few days I developed a routine of salting the entrances before going to bed, it helped calm me before I fell into a dreamless slumber. On the morning after the fifth day of this ritual I woke up to a chilling discovery. All the salt had disappeared. Not a trace in any of the places I had placed it, not even embedded into the carpets.</p>\n\n<p>I tried to sense around the house, see if anything felt different, but it didn’t. Nothing was misplaced in the house except the salt, and upon searching, even the containers of the salt weren’t anywhere in the house anymore, like they had never been there in the first place. I went out and bought more salt to line my house and more sage to cleanse it once again. As I opened my front door coming back from my errand run, I was greeted by a wall of that intense bleach smell. My head spun, I ran back outside and vomited in the bushes, the smell was so powerful that I could smell it even from outside. It smelled like a hospital room after a bloody surgery, chemically scrubbed to rid of all spilled bodily fluids. From the bushes I looked in the living room window, a hazy black figure walked up to the window and examined me. As the figure got closer to the window it solidified and I could see it writing vigorously on a clipboard.</p>\n\n<p>‘Why does a ghost need to take notes?’ I thought to myself, and a moment later pain exploded in my shoulder blade. The pain was icy and sharp but at the same time felt like fire cutting deep into my shoulder. I collapsed to the grass, crying out in pain coming from an unknown source. A second figured stepped into the window and the two stood, watching as I writhed on the grass. As the pain cut deeper into my back I felt it slice into my lung. The sensation of blood filling my lungs was almost more painful than the cutting. Each breathe hurt more and more and I felt myself slipping under. The edges of my vision turned hazy and colors tuned dull until finally everything went black.</p>\n\n<hr/>\n\n<p>Suddenly a bright light burned through my eyelids. ‘I must be dead, this is the light they talk about when you are dying.’ I opened my eyes. I was not in a paradise made of white fluffy clouds, I was face down on a cold metal table. I tried to move, my body was tightly bound. Panic filled me as I tried to make sense of the situation. ‘I’m dead’, I thought, ‘and I went to Hell’. The confirmation came in the form of pain radiating from my back, into my lungs. I coughed hard and covered the table with blood. I squirmed hard against the restraints with no success. </p>\n\n<p>Suddenly, the pain stopped. I coughed hard, expelling the remaining blood from my lungs, but I felt no more blood flood back in. The large cut stemming from my left shoulder down to the bottom of my shoulder blade no longer hurt, I could feel the wound slowly mend itself together. \nI exhaled a deep sigh of relief, only to sharply inhale as I became aware of the fact that I was not alone in this room. I craned my neck as far as possible to see the three figures from my dream huddled a few feet from me. I strained to hear what they were saying.</p>\n\n<p>“Incredible”</p>\n\n<p>“Quickest timing we’ve ever seen”</p>\n\n<p>“I told you she just needed the right incentive.”</p>\n\n<p>The man closest to me turned around and approached. As he got closer he crouched down and I saw his face. He had tired brown eyes atop a crooked nose. The stubble on his face creating a subtle 5 o’clock shadow. He looked both foreign and familiar. As I looked at him, the pain subsided but something else surfaced. </p>\n\n<p>Memories. </p>\n\n<p>They began first as flashes. Hospital rooms. Legal documents. A cell-like room. Needles, scalpels, and other surgical equipment on a table.</p>\n\n<p>Longer memories began to flash, involving the man standing in front of me.</p>\n\n<p>He and a beautiful woman dressed in a yellow sundress smiling at me at a beach. </p>\n\n<p>A finely furnished living room and a dog licking my cheek as the man sits at a desk watching me.</p>\n\n<p>The woman, now dressed in wrinkled clothing, yelling at the man while standing between him and me. The word “monster” resonates as the memory shifts to me on that cold metal table and the man leaning over me. </p>\n\n<p>“Shhh,” he sooths, “it’ll be okay, honey, this is going to hurt a little bit, but you are my special girl and you’re going to do great.” The memory ends as a tall scientist looms over me with a knife and reaches down to make the first of many incisions.</p>\n\n<p>I come back face-to-face with my father, his smile beaming with success. He moves over to the other scientists begins discussing how this is a huge step in the experiment and that they should step up the next trial. As they begin to talk shop, my rage boils from my stomach and engulfs my entire being. I try at the restraints again, the left one gives, and I scramble to undo the one across my waist. The men turn to me, I wasn’t as quiet as I had hoped to be. Fortunately, the tray of surgical equipment is within reach of my free hand. I grab a knife and pull it over to my right hand to severe the restraint. I was lucky that because of the location of the incision they had failed to strap down my chest. I worked myself to my knees just as the tall scientist approached the table. I slashed hard at his neck, making contact. He staggered backward, grasping his throat as blood seeped through his fingers and poured down his neck.</p>\n\n<p>The man with the clipboard rushed to walk where the button that was to send 1000 volts to the contraption on my head was located. I was able to remove it before he pushes the button, however I am grabbed from behind. My father tightly wrapped his arms over my arms, pinning them to my side. I turned the knife in my hand to face the blade towards this monster behind me, and in a quick thrust plunged it into his side. He yelled out in pain and struck me while he stumbled back.</p>\n\n<p>I fell from the table, and my legs, still restrained, pulled the table down with me. I quickly tried to undo the final bond and was finally free. The clipboard man walked warily towards me. I could tell he was used to collecting data and never interacting with his subjects, especially in a physical sense. I started at him and saw him flinch. I used his hesitation to make for the door. I threw it open and ran down the corridor. After three turns I saw an EXIT sign and I followed the sign and burst through a door. The sunlight burned my eyes, but I kept running. The hard ground hurt my bare feet, but I still ran. I didn’t know where I was or where I was going, my only thought was to escape the nightmare that turned out to be the true reality.</p>\n\n<p>I ended up running for only about 20 minutes until I collapsed. I was malnourished, barefoot, and naked running through the desert. I sat in the dirt, planning my next move. I had stepped on a sharp rock during my escape and I examined it and watched in horror as the gash mend itself. At least I can understand what the experiments were about. </p>\n\n<p>I found my strength and walked towards the only landmark I could see, a mountain range in the distance. I hoped that it would allow me to stumble across a road, or at the very least, the mountains could provide some sort of shelter and the possibility of food. My prayers answered as I arrived at the base of the mountain and a road wound into the mountain side about a quarter mile away. The sun had begun to set, and the temperature began dropping. I found a small cave and gathered some leaves and pulled up some vegetation to coat the cave floor to keep myself warm in the cold night, or at least from the frozen stone floor.</p>\n\n<p>I curled up on the ground but knew that sleep was not coming. I thought of the life I thought I had had. My cubicle at my boring job. My small house that provided so much comfort and left me with fond memories of peace. This entire life was fabricated by my own mind to help myself deal with my horrific reality. An escape into my mind as an act of self-preservation.</p>\n\n<p>More memories came back that night. My mother had been a very kind-hearted and loving soul. I was the apple of her eye. She loved me more than anything in this world. She hadn’t learned of the evil things my father had done to me while I was still in her womb until one day when the golden retriever we owned had bitten me hard and she saw my father holding my arm, watching with fascination as the wound closed. He told my mother what had been done, she was horrified. She called him a monster and told him that she was leaving him and taking me with her. My father got angry, telling her that she didn’t understand, that this was so much bigger than anything she could imagine, he was helping the evolution of the human race. I don’t remember what happened after that, I do know that I never saw my mother after that. I do know that after that my permanent residence became that cold cell-like room and I was subjected to torture on a regular basis to see how far my abilities could go. </p>\n\n<hr/>\n\n<p>When the sun came up I headed towards the road and walked down it, away from the mountain. Hopefully a passing car would see me, and hopefully it does not belong to anyone who spent the past ten years torturing me.</p>\n\n<p>I was lucky and a passing RV containing a delightful family saw me. The woman quickly gave me clothing and they agreed to take me to the closest city, turns out I was in New Mexico. As I dressed in the cramped RV bathroom I looked at myself in the mirror and now understood why I never felt like I was looking at myself in my dream home. The dream version of me had cascading black hair, full cheeks, and symmetric features, but the reality was a shaved head, a skinny, hollow face that the skin tightly stretched over and a crooked nose, though apparent that it wasn’t genetic like my fathers, but from a failed attempt of regeneration when broken during experiments.</p>\n\n<p>I am now in a library typing this up, as a warning, do not believe everything. Not every monster has fangs, they sometimes have a kind smile and tuck you into bed.</p>\n\n<p><em>Every once in a while, when humanity stares into the abyss, it gets scared of how dark we are, and it runs.</em></p>\n</div>\n","author":"kazielynn"}