{"rank":"65","title":"Case #7- The Village of Lost Souls- Part 2","id":"8jzpg7","url":"/r/nosleep/comments/8jzpg7/case_7_the_village_of_lost_souls_part_2/","time":"1526514943000","body":"<div class=\"md\"><p>(Part 1 can <a href=\"https://www.reddit.com/r/nosleep/comments/8jfhq7/case_7_the_village_of_lost_souls_part_1/\">be read here.</a> )</p>\n\n<p>“This is a terrible idea.”</p>\n\n<p>I shrugged. “You’re not wrong.”</p>\n\n<p>“Like, a really fucking terrible idea.”</p>\n\n<p>“It’s the only way I can think of to contact Hannah. We could ask Donnie to track her down for us but I don’t want to involve him and risk her trying to kill him again.” Little by little I chipped away at Moxxy’s doubts. “Besides, she likes me more than anyone else we know.”</p>\n\n<p>Moxxy scoffed. “And you think that makes you safe, Emily? It just means she’ll kill you faster than me.”</p>\n\n<p>Mark, who was sitting next to me on the couch, marveled at us. “Wow. You guys have some pretty intense friends.”</p>\n\n<p>“She’s not going to kill anyone. Well, okay she’s probably going to kill more people someday but it won’t be us. We’ve got a truce going on, remember?”</p>\n\n<p>Moxxy looked at Mark. “We appreciate you being willing to help us but you should know that we’re contacting someone very dangerous. We will understand and not hold it against you at all if you don’t want-”</p>\n\n<p>“No, I’ll do it!” Mark grinned. “This is the most exciting thing I’ve ever done! And if there’s a chance it’ll help my mom, then there’s no choice, is there? What do you need me to do?”</p>\n\n<p>“Just hold my hands, and I’ll do all the work.” I reached my hands out to him and he took them. “Your psychic sensitivity kind of boosts mine. All we need to do is be touching.”</p>\n\n<p>I ignored Moxxy’s juvenile sniggers at my statement and closed my eyes. I visualized Hannah’s face, reflected on her personality and the feel of her aura. Slowly, other things started to come into focus. A sink, a toilet, a shower. We were in a bathroom. Hannah’s face was in the mirror. Her features changed. Her eyes glowed orange and narrowed in confusion, her hair became green. She opened her mouth and spoke. “Emily? The fuck are you doing in my head?” Then her expression of confusion became one of anger. “You try anything like this again and I’ll kill you.”</p>\n\n<p>She snapped her fingers and a massive force pushed me back into my own mind. I didn’t stop there, though. With a yelp I flew up off the couch, smacked into the ceiling, and crashed back down to the floor.</p>\n\n<p>“Jesus shit!” Moxxy rushed to my side. “Are you okay?”</p>\n\n<p>She helped me to my feet. I moved each limb, testing them. “I don’t think anything’s broken. So… I don’t think Hannah’s interested in working with us.”</p>\n\n<p>“I could have told you that. In fact, I did. Many times.”</p>\n\n<p>“Holy shit, that was awesome!” Mark was on his feet, looking like he was ready to start bouncing. At my raised eyebrow, he sobered and said: “I mean, no it wasn’t. Poor choice of words. I only meant I’ve never seen anything like that! Do you guys do stuff like this all the time?”</p>\n\n<p>We were patient with Mark and let him fanboy for awhile but there was business to attend to. Without Hannah’s help, Moxxy and I were sitting ducks for an enemy who had command of magic forces. Discretion was our only hope of avoiding being cursed so we came up with a plan to hide our identities. If anyone asked Mark about us, he would say we were two cousins from out of town who came to help care for his sick mother. With our asses sufficiently covered, that left actually dealing with the curse and the man who cast it. But I didn’t have a plan, I was making things up as I went along. I asked myself “what would Jacob do?” but I was pretty sure he made everything up as he went too.</p>\n\n<p>We tried contacting the spirit of Mark’s father again, to no avail. With no other avenues of investigation open to us, I asked Mark to show me around town. Specifically to take me to any sites with a dark history. It was a long shot, but sometimes the past had a lot to do with the supernatural events occuring in the present. We left Moxxy to care for Mark’s mother and a note from him explaining that we were the grandchildren of some great aunt or another, there to help him out with his caretaker duties.</p>\n\n<p>“...and that’s Ms. Kristie’s house. She says aliens abducted her from her bedroom in 1989.” Mark slowed his car and pointed to an old one family house. “Of course, she also says Obama is a gay Muslim reptilian or something, so maybe she’s not the most reliable witness.”</p>\n\n<p>We spent most of the day like that, driving from one place to another. So far, Dodgerton Village had at least six haunted houses, one water monster sighting, two alien abductees, and one man who claimed to have impregnated a female sasquatch. I didn’t have much hope for finding a clue in the community history until Mark pulled up to a burned out building next to a cemetery. “That’s the old Kingston Mortuary.”</p>\n\n<p>The dark aura surrounding the building made me nauseous, even from a distance. It reeked of rage and terror and, most of all, suffering. “What’s the deal with this place?”</p>\n\n<p>“It happened before I was born but I think the story goes like this: Dr. Kingston used to be a mortician in Madison. At some point he moved to Dodgerton and started his own funeral practice. He had a wife and a daughter. The daughter’s name was Wren. She was fascinated by dead bodies and wanted to follow in her father’s footsteps. But she started to love the dead too much and… uh, what I heard is that she started to… play with them.” Mark blushed and I understood what he meant. “Dr. Kingston found out about it and locked her in the basement. He thought she was possessed by demons and everyday he’d go down there and flog her while reciting bible verses. One night, she broke out and killed her father and mother while they slept. I don’t know what happened after that or how the fire started. It’s probably just a story.”</p>\n\n<p>“Well, something happened here. This place is full of dark energy.”</p>\n\n<p>I couldn’t yet see how the mortuary or its history tied into the case, but Jacob would say two major supernatural events occurring in such a short distance from each other are almost certainly related, so I filed it away for later. Perhaps the person casting the curse set up his altar in the Kingston Mortuary.</p>\n\n<p>It was getting dark out, so we returned to the house. Moxxy reported that Mark’s mother had only woken a few times to eat and use the bathroom and hadn’t seemed to notice a stranger was helping her.</p>\n\n<p>Sleep was troubled that night. My nightmares robbed me of any real rest and what was worse, I knew they weren’t actually nightmares. I dreamt of a dark power entering the house while we slept. I dreamt it entered the master bedroom to see Mark’s mother. I remember the feeling of recognition when I figured out what the dark power was, but by the time I woke up, I’d already forgotten the identity of our foe.</p>\n\n<p>(Case #7 will <a href=\"https://www.reddit.com/r/JacobMielke/\">continue in an update.</a> Updates are posted every Monday, Wednesday, and Friday. Mielke Investigations is an <a href=\"https://www.facebook.com/jacobmielkeswriterprofile/\">ongoing account.</a> )</p>\n\n<p>Update: Part 3 <a href=\"https://www.reddit.com/r/nosleep/comments/8kgtiv/case_7_the_village_of_lost_souls_part_3/\">can be read here.</a></p>\n</div>\n","author":"JacobMielke"}