{"rank":"540","title":"Nightshift At The Plant - That's not a pony ...","id":"8k041i","url":"/r/nosleep/comments/8k041i/nightshift_at_the_plant_thats_not_a_pony/","time":"1526518656000","body":"<div class=\"md\"><p>The day I found out I was pregnant, my husband shot himself.</p>\n\n<p>I had gone to my doctor’s office to find out the results of my tests – I’d been unnaturally tired and dizzy lately, and didn’t know why.  When he told me I was expecting, I was elated.  Micah and I had been trying for a year to have a child, so I was excited to get home to break the news to him.  He was going to be such a good father …</p>\n\n<p>The house had been silent when I walked in the door.  Usually, I’d hear whatever Micah was watching on television or listening to on Pandora, but not that day.  There was a funny tang to the air, something I couldn’t identify and didn’t like the smell of.  It wasn’t until I walked into his office that I realized what it was.</p>\n\n<p>Blood, brain matter, and clumps of hair and bone spattered the wall behind where he slumped at his desk.</p>\n\n<p>I don’t remember calling 911.  I don’t remember the paramedics having to forcefully pull me from Micah’s body, or me screaming at them that he couldn’t be dead, not my Micah, he was going to be a father.  I don’t remember my best friend showing up – Luna was a dispatcher with the county, so she’d heard the call.</p>\n\n<p>I only remember the pain.  It felt like someone had torn out my soul. Micah had been my entire world.</p>\n\n<p>Now he was gone, and I was alone with a baby on the way.</p>\n\n<p>I was alone, and for the first time since I’d been married I would have to find a job.</p>\n\n<p>If it hadn’t been for that piece of him I was carrying, I would have joined him.</p>\n\n<p>I had a degree in accounting, but the market was flooded.  We lived in a small town, and jobs were scarce.  Luna suggested that I look at jobs outside my qualifications, so I gave it a shot.</p>\n\n<p>An industrial security firm wound up hiring me, a month after I’d buried Micah.  It was a twelve-hour overnight shift at a steel plant on the outside of town.  My duties were simple – log the trucks that came in and out, deliver the mail to the administration building, stamp the outbound mail, and the rest of the time I could do as I pleased.</p>\n\n<p>They paid well, the benefits were good, and they knew I was expecting.  I would get paid maternity leave, when the time came.  They provided the shirts, and I provided my own black pants, belt, and shoes.</p>\n\n<p>I was put with a craggy old man who chain-smoked to be trained for the first week.  Thankfully, once I told him I was expecting, he went well outside the guard house to smoke.  He was grouchy, cursed like a sailor, and didn’t seem to think I should be working there.  “What the hell they were thinking to hire a little chit like you, I don’t have a god damned clue,” he complained.  “One of them truckers comes in here sassing you, why, you’ll just cry.”</p>\n\n<p>The first time I went toe-to-toe with a trucker who stood a head taller than me and outweighed me by a hundred pounds, he changed his tune.</p>\n\n<p>Cliff finally deemed I was good to go, and they transferred him to another plant.</p>\n\n<p>I had never really been a night owl, but it grew on me after a time.  The wee hours of morning were peaceful, quiet.  I learned to appreciate the solitude of the guard house when all of administration had left for the day, and the last trucks had gone as well.\nMy immediate supervisor was in his seventies, and worked the day shift following me.  Every morning that he came in, he’d always ask “how’s my sweetheart?”  I’d stay for a little while to talk to him, filling him in on anything that had gone on overnight and discussing my impending motherhood.  I think he was more excited about it than I was, telling me him and his wife would watch the little one for me if I ever needed them to.</p>\n\n<p>Gradually I learned the men who worked there, and befriended a few of them.  The night shift supervisors, the mechanics, electricians, forklift drivers … they all liked to migrate out to the guard house to sit and talk with me.  All of them made sure I understood that if I ever needed anything, just call one of them.  I can’t tell you how many came through and told me if I  needed to borrow a gun, I’d find it in the door, or under the seat, or in the glove box.</p>\n\n<p>They were good to me, and made me feel like I belonged there.</p>\n\n<p>As time went on, and I began to show, they grew pretty protective of me.  Even the truckers softened up – they’d walk in with a good head of steam going, and the second they saw my very pregnant belly, all that mad would just go away.  Some of the regulars would bring me little things – rattlers, stuffed animals, teething rings.</p>\n\n<p>My eighth month, when I found out I was having a girl, they went behind my back and bought baby clothes, nappies, bottles, a car seat, and a front-loading carrier.</p>\n\n<p>I bawled when they brought it all in to the guard house.</p>\n\n<p>My daughter would be in good hands when she was born, I knew that then.  She had so many foster daddies, it wasn’t funny.  Foster grandparents, too.</p>\n\n<p>I was sitting by the CB, my laptop on a rolling desk in front of my chair and an instrumental playlist going, when something caught my attention out in the admin parking lot.  It was going on four in the morning, and no one was parked over there except the supervisor for that side of the plant.  I looked up from the book I was reading, and froze in my seat.</p>\n\n<p>It was the size of a Shetland pony, and that I was sure of.  But it had paws, not hooves, and its fur was moth-eaten looking.  It wasn’t walking right, either.  It was walking really slowly, like moving hurt.  I could only see the hind end, as it was walking directly away from me, but then it turned to go down the road leading out of the plant.</p>\n\n<p>Every hair on my body stood on end when it turned.</p>\n\n<p>There was no head.  Not even a neck.  It was a torso with legs and a tail.</p>\n\n<p>I blinked, sure that I was imagining things.</p>\n\n<p>It was still there.</p>\n\n<p>My blood ran cold as I realized that this was a real thing I was seeing.  I’m a little embarrassed to say that I wet myself.  I’d been working there for seven months, and I had never seen anything even remotely like this before.  I didn’t even know what it was!</p>\n\n<p>When Fred came in for his shift, I let him know I’d had an accident and he’d have to use one of the other chairs.  He smiled and told me those things happened when I was that far along – his wife had wet herself in the middle of the store when she was carrying their son.</p>\n\n<p>But I didn’t tell him what I’d seen.  I was positive he’d think I had lost my mind.</p>\n</div>\n","author":"RhapsodyinVelvet"}