{"rank":"10","title":"Has anyone heard of a demon that breathes smoke? [Part 2]","id":"8k0fh8","url":"/r/nosleep/comments/8k0fh8/has_anyone_heard_of_a_demon_that_breathes_smoke/","time":"1526521629000","body":"<div class=\"md\"><p><a href=\"https://www.reddit.com/r/nosleep/comments/8jr4bs/has_anyone_heard_of_a_demon_that_breathes_smoke/\">Part 1</a></p>\n\n<hr/>\n\n<p>Everyone told me it wasn’t my fault when it happened. I didn’t push her like I had in the dream, but when we were 14 Kelly had slipped and fallen to her death while we goofed around in the barn. I’ve always felt guilty about it, but until then I thought it hadn’t affected me that much. Tears were stinging my eyes after reliving it in the dream though, so I guess I was wrong.</p>\n\n<p>I wiped my eyes and got up to get to work. The sooner I finished fixing things around the farmhouse, the sooner my family could sell the property and I’d never have to think about the terrible things that had happened here. But things were starting to get to me—especially the silence. I couldn’t remember seeing or hearing any birds or barn cats prowling the property, and I hadn’t even heard any of the neighbors’ dogs barking.</p>\n\n<p>I went to my truck and turned on the radio, and cranked the volume almost as loud as it would go. Then I turned my attention to the area I’d been avoiding because of the memories of my dead cousin: the barn.</p>\n\n<p>There were several windows and rotted planks of wood that needed replacing, so I got to it. The windows took most of the morning, then I took all the measurements I needed and started cutting the lumber I’d bought in town the day before. I used a crowbar to pry loose the rotted planks and screwed the new ones into place on the north, west, and south walls, but when I pried loose the first board of the east wall I stopped cold. There was writing on the inside of the board.</p>\n\n<p>It was too fucking weird. Without even thinking about it I ran inside the barn. The part of the wall I’d been working on was behind an ancient mound of hay bales, and I frantically threw them aside. Finally there was a patch of bright sunlight where the plank I’d pried loose had been, and I could see the surrounding wall. I propped the wood fragment that I’d removed back in place, and used the flashlight from my phone to read the undeniably blood-red writing scrawled on the wall:</p>\n\n<p>“May 18 1988: I think I killed Franklin. We were fixing the combine and he was checking it out, and I threw the switch. He’s dead. I knew he was there but I couldn’t stop myself. Everything is quiet. Something in a red robe was watching me. He scooped up Franklin’s blood in a bowl and drank from it, now he’s standing there and all I smell is smoke. I don’t know what to do. I didn’t mean to kill him. But I think I’m forgetting. Things are foggy already. -JE”</p>\n\n<p>John Ellis. My grandfather.</p>\n\n<p>My knees felt weak. I staggered back a few steps, feeling like I couldn’t breathe, like my lungs were frozen. That couldn’t be true. Grandpa couldn’t have killed Miss Sally’s husband. He and Grandma had been best friends with Miss Sally and Franklin. </p>\n\n<p>I had to call my brother. I don’t know what I was going to tell him, but I had to talk to him about what I’d found before we could tell Mom. My vision was blurry, but I looked at my phone screen. No signal. </p>\n\n<p>I ran to my truck and drove down the road to Miss Sally’s farm. It was a dumb place to go after I just learned that my Grandpa might have killed her husband, but I wasn’t thinking straight. Miss Sally could obviously tell that something was wrong, but I brushed it off and asked to use her phone to call Tom.</p>\n\n<p>There was no answer. Of course, by this time in the afternoon the wedding he was attending had probably started. His voicemail was full like always, so I hung up.</p>\n\n<p>I practically ran out of Miss Sally’s house and back to my truck. There was no telling when Tom would be able to receive my call since reception was spotty at best on the drive to the farmhouse, so I would just have to wait it out until the morning when Tom would arrive and I could show him what I’d found.</p>\n\n<p>I was still shaken up driving the mile or so back to the farmhouse. I thought I saw a flash of red by the side of the road a few times, but there was nothing there when I looked back. </p>\n\n<p>When I made it back to the farmhouse the sun was starting to set. I threw most of my tools back into the truck so I could leave as soon as Tom got there in the morning. I went back inside and started packing up my stuff. By the time I finished it was dark outside. I went to the front door to take everything but my sleeping bag to my truck, but I stopped cold. </p>\n\n<p>The demon in the red hood from my dream and from my grandpa’s note was standing on the front porch, looking straight at me through the window on the door. I could smell the smoke that curled into the air from where its nose should have been, and it held the small bowl perfectly still in front of its chest. I knew it had to be what killed Franklin, my grandpa, and Kelly.</p>\n\n<p>I think I screamed, “Who are you!? What the fuck are you doing here?!” But the thing was totally still. My hands trembled as I fumbled through my bag and pulled out my grandpa’s old hunting knife, then clutched it with white knuckles.</p>\n\n<p>My feet felt rooted to the ground but I managed to take a step towards the door. Then, without a sound, the demon turned and glided out of my sight.</p>\n\n<p>I didn’t know what to do. I know what I saw. I wasn’t going crazy. That red-hooded thing had been right on the doorstep with its bowl. I forced myself to approach the door. The porch light was on, but I couldn’t see the demon’s red hood anywhere. The smell of smoke lingered in the air, but there was no other sign that anything had been there. I couldn’t bring myself to go outside to check; who knew what the fuck that thing was or what it could do to me. </p>\n\n<p>Maybe it was stupid of me, but I decided to stay and wait for Tom to get there in the morning. If the thing was still there by then, or if it broke into the house, I’d have to come out and fight it, but I couldn’t just leave with no way to reach Tom and tell him not to come. I left the rest of my stuff where I’d dropped it on the floor and ran upstairs to the master bedroom, slamming the door and locking it. </p>\n\n<p>I looked out the window, and I saw it in the silver moonlight: the red-hooded thing standing silently next to my truck. It was gazing right back at me (I couldn’t see its face, but I know it was staring at me), and it shifted slightly to extend the little earthenware bowl in my direction.</p>\n\n<p>I dropped to the ground out of sight and sat under the window, just clutching the knife and hoping and praying that the demon would go away. I was losing my shit. I don’t know how long I sat like that, but the faint tinge of smoke in the air seemed to grow stronger, and with it my eyes started to droop I grew more and more tired. Eventually I couldn’t help it; I fell asleep.</p>\n\n<p>*</p>\n\n<p><a href=\"https://www.reddit.com/r/nosleep/comments/8k9our/has_anyone_heard_of_a_demon_that_breathes_smoke/\">Part 3</a></p>\n\n<p><a href=\"https://www.reddit.com/r/nosleep/comments/8kipcw/has_anyone_heard_of_a_demon_that_breathes_smoke/\">Part 4</a></p>\n</div>\n","author":"whathappenedtoluke"}