{"rank":"110","title":"DO NOT CLICK ON THE VIDEO TITLED \"Is it Yanny or is it Laurel?\"","id":"8k0mwe","url":"/r/nosleep/comments/8k0mwe/do_not_click_on_the_video_titled_is_it_yanny_or/","time":"1526523616000","body":"<div class=\"md\"><p>I&#39;m not sure how many people are affected or if this is just all in my head, but I know what I witnessed was real. Here&#39;s what happened.</p>\n\n<p>Last night I invited my friend John over to hang out with me so we could play some Fortnite together. I had taken the day off due to a doctor appointment and was just taking it easy. We decided to order a pizza and pick up some beers, (I play better when I&#39;m tipsy).</p>\n\n<p>About 2 hours in, the pizza had been devoured and we were down to our last 2 beers. I offered to make a beer run on my bike, but John insisted he&#39;d just have someone stop by to drop some off. I thought it was a bit unusual that he had someone on standby just to get beer, but whatever.</p>\n\n<p>His friend Carlos comes through with the beer. What I also found unusual was that John had invited Carlos to hang out with us. I voiced my displeasure quietly to John and basically told him that I wasn&#39;t comfortable with Carlos because I didn&#39;t even know him. John assured me that Carlos was cool and that it wouldn&#39;t be a problem.</p>\n\n<p>A couple hours go by and we find ourselves in my apartment drinking and gaming. Suddenly, John asks &quot;have you seen that video that&#39;s going around facebook?&quot; I said &quot;no, what is it?&quot;</p>\n\n<p>John suddenly gets excited and exclaims &quot;dude, it&#39;s so weird! Like, apparently it has something to do with your brain waves or something.&quot; I asked him to pull it up so I could see it. The video was titled &quot;Is it yanny or laurel?&quot; I asked him to play it. &quot;Laurel. Laurel. Laurel. Laurel. Laurel.&quot;</p>\n\n<p>I said, &quot;that&#39;s it? A voice saying Laurel over and over?&quot; John told me he hears laurel too, but that only certain people can hear yanny. Puzzled by the video, John asks Carlos, who has his back turned playing Fortnite, what he thinks it is. Nothing. Carlos is motionless.</p>\n\n<p>John raises his voice, &quot;Carlos, you with us bro?&quot; I go to tap on Carlos&#39; shoulder, but right before I do, he slowly turns his head towards me, and shouts. &quot;YANNY. YANNY. YANNY. YANNY. YANNY.&quot;</p>\n\n<p>He wouldn&#39;t stop. I tried snapping him out of it but he only grew more aggressive. He began foaming at the mouth, all while still shouting. &quot;YANNY. YANNY. YANNY. YANNY.&quot; I asked John what the hell was wrong with him, but John could only stare at Carlos in disbelief. Then the unthinkable happened. Carlos, still shouting, stood up and ran out of the room.</p>\n\n<p>Fearing for our lives we tried to find a way out of the apartment without him seeing us. Then I hear something. Like steel utensils clanging together. Suddenly, it hits me. &quot;THE KNIVES.&quot;</p>\n\n<p>Scrambling to our feet, we open my window and are about to climb out when suddenly Carlos appears at the doorway. This time holding a freshly sharpened butcher knife. Still foaming. Still shouting. He charged us, but John kicked him in his knee and he went down. John kicked the knife away and stomped on his hand, breaking it. We left the apartment, ran to my truck and left.</p>\n\n<p>I&#39;m currently writing this at a motel on the outskirts of the city. John is holed up with me. We&#39;re not sure if we should keep driving or stay here and see what happens. I have no clue as to what happened with Carlos. Why did he suddenly go berserk after listening to that stupid video? Was it some kind of mental trigger for him? Or is there a much darker meaning behind it?</p>\n\n<p>I have no clue who else is affected, but please feel free to contact me through here if you see or hear anything pertaining to what I witnessed. Thank you.</p>\n\n<p>EDIT: link to a news article that someone just sent me. God help us. <a href=\"https://imgur.com/a/1PeGMMi\">https://imgur.com/a/1PeGMMi</a></p>\n</div>\n","author":"ZeroDesert91"}