{"rank":"159","title":"I can't leave this stretch of sidewalk","id":"8k15um","url":"/r/nosleep/comments/8k15um/i_cant_leave_this_stretch_of_sidewalk/","time":"1526528741000","body":"<div class=\"md\"><p>Hi <a href=\"/r/nosleep\">r/nosleep</a>. Things aren&#39;t making sense, and I&#39;m wondering if any of you might be able to help me.</p>\n\n<p>Today was like any other day, until about 10 minutes ago. I got up, got ready, and walked twenty minutes to work. Said hi to Charlotte, the receptionist, and Wesley, the only coworker who I&#39;d consider a friend. I didn&#39;t notice until later, but both of them seemed a bit on edge. I worked all morning, and while I didn&#39;t think it was odd at the time I didn&#39;t see or hear any of my coworkers for the entire morning. The clock finally struck twelve, signalling the start of my lunch break. On my way out, I went to say bye to Wesley, he usually eats at his desk. He stared at his computer and didn&#39;t respond. I decided not to bother him and left. Charlotte didn&#39;t look up or acknowledge me when I passed her desk.</p>\n\n<p>At the subway across the street, it took several minutes just to get someone to come out of the back and help me. The third time I rang the bell, I was about to leave. The clerk poked her head out of the back and curtly said &quot;We&#39;re closed.&quot; I was a little offended, but since there was nowhere else nearby to eat and I didn&#39;t have my car, I decided I&#39;d just see what snacks we had in the breakroom.</p>\n\n<p>When I arrived at the office, Charlotte, Wesley, and all my other coworkers were nowhere to be found. I thought it was odd, I hadn&#39;t seen any of them leave. I found some stale granola bars in a drawer next to the coffee machine, and browsed reddit on my phone while I ate them. When my lunch break ended, I went back to work.</p>\n\n<p>My coworkers didn&#39;t return afer lunch. My worry only increased as the clock struck 2, then 3. I just assumed there was some reason they weren&#39;t back yet. I sent the boss an email:</p>\n\n<blockquote>\n<p>Hi Steven,</p>\n\n<p>I&#39;ve noticed that nobody is at the office. Is there an event I missed the email about?</p>\n\n<p>Sincerely,</p>\n\n<p>John</p>\n</blockquote>\n\n<p>He responded right away with:</p>\n\n<blockquote>\n<p>Hi John,</p>\n\n<p>Lately there&#39;s been a lot of stuff to do.</p>\n\n<p>Even I have had to stay late.</p>\n\n<p>All of us need to pitch in to get it all done.</p>\n\n<p>Very soon, overtime could become the norm.</p>\n\n<p>Everyone needs to contribute. The</p>\n\n<p>Next couple of days are going to be busy,</p>\n\n<p>On their days off, people might need to come in, but</p>\n\n<p>When it&#39;s done, there could be bonuses on top of the overtime pay.</p>\n\n<p>Sincerely,</p>\n\n<p>Steven McGill</p>\n</blockquote>\n\n<p>I was confused by the cryptic nature of the email. He didn&#39;t answer my question, so I assumed there was a reason for it and didn&#39;t follow up. For a moment I worried that he might have had a stroke or something, but I didn&#39;t know where he was to call 911.</p>\n\n<p>By the time 5:00 came, I was seriously worried, but looking forward to getting home and unwinding. I instinctively said bye to Charlotte&#39;s empty desk on my way out, and began to walk home.</p>\n\n<p>There is an abandoned house on my street. I remember that there was a single man who lived there when I moved in, and I remember noticing that he wasn&#39;t there anymore a year or two ago. I never saw him much or paid much mind to him or his house, I only noticed his absence when his next-door neighbor told me that she hadn&#39;t seen him in some time.</p>\n\n<p>The house was small and run down, siding covered in chipped white paint. One window was broken, revealing a living room filled with dusty furniture. The door always remained firmly shut. I never paid it much mind when I walked past it on my commute.</p>\n\n<p>That brings me to ten minutes ago. I stepped onto the section of sidewalk in front of the abandoned house. I remember getting to the end of the stretch of sidewalk in front of it, only to flinch because of a loud noise just as I stepped across the line between the abandoned house&#39;s dying, overgrown lawn and the neatly trimmed green grass of the neighbors. I looked back after flinching to find that I had just stepped onto the section of sidewalk in front of the abandoned house. I thought it must&#39;ve been Deja Vu or something, and kept walking.</p>\n\n<p>After the third time, I started to worry.</p>\n\n<p>I couldn&#39;t leave the sidewalk in front of the house. I&#39;d get to one end only to find myself back at the other end. I even took video of it, but I could never get the transition from one end of the property to the other to look smooth - I&#39;d always jerk the camera or block the lens no matter how careful I was, just like I&#39;d always flinch or zone out for an instant.</p>\n\n<p>That brings me to now. I&#39;ve still got 25% of my phone&#39;s battery left, so I decided I&#39;d stop walking and post here for help. If anyone knows what&#39;s happening or how I could escape from this loop, please tell me. I&#39;m getting thirsty, I didn&#39;t drink before leaving the office since I thought I&#39;d be home soon, and the sun is hot. Please help.</p>\n\n<p>UPDATE: I walked a couple more circuits. I tried stepping into the road, but whenever I tried I found myself stepping back onto the sidewalk. I took a step onto the abandoned house&#39;s property, it seems like I can do that with no issues but since that house seems to be the focus of whatever I&#39;m experiencing I don&#39;t want to approach it.</p>\n\n<p>UPDATE 2: I walked along the sidewalk again. I read back over my earlier post. I&#39;m not sure why I talked about a neighbor, or mentioned this house like it was special for being abandoned. All the houses on this street are abandoned. The door to the house is still open, like it was when I got here. Not sure why I said it was always closed. And I don&#39;t have any neighbors. Never did. In fact, I think I&#39;m the only person I know. I think I&#39;ll go inside, the shade looks so nice and cool. I just hope I don&#39;t fall over something, it&#39;s far too dark to see anything in there.</p>\n</div>\n","author":"robots914"}