{"rank":"29","title":"Gullible","id":"8k167b","url":"/r/nosleep/comments/8k167b/gullible/","time":"1526528830000","body":"<div class=\"md\"><p>I was in class, eyes firmly planted on the window, when the person next to me tapped me on the shoulder. They asked me how to spell the word &quot;gullible&quot;.  I let out a quick grin, I turned toward them and said it was spelled: G - U - L - L - A - B - L - E.</p>\n\n<p>The person cocked their head. I reassured them that the trick was that you are <em>able</em> to be tricked, thus you are gull<em>able.</em> Their shoulders dropped, and they flashed me a friendly smile. They thanked me for such a helpful trick.</p>\n\n<p>The key to any good lie is actually to be specific and not vague. If a lie is vague it isn&#39;t real. If I tell you that I am really good at psychology, you might not believe me, even if it is true. If I tell you I went to harvard you might not believe me because it isn&#39;t true. But if I tell you in middle school I was voted most likely to be a psychologist, you might not even notice that most middle schools don&#39;t <em>have</em> superlatives, and if you do, will probably want to talk to me about that than the lie itself. </p>\n\n<p>It is actually the people who are the most perceptive that get tricked by these kind of lies, because if I don&#39;t know shit about psychology, you are sure as <em>hell</em> I will talk to you about how weird my middle school was, even if it didn&#39;t have superlatives, because <em>everyone</em> has can relate to a middle school being weird. </p>\n\n<p>I might ask if your middle school had printed its year book in black and white or color, and now we are talking about that and suddenly I have merged the world where I was elected most likely to be a psychologist into our real world.</p>\n\n<p>I mention this because the person who was sitting next to me might have been one of the most <em>perceptive</em> people of all. And that meant they were also the most gullible. They noticed the trick I gave them was a mnemonic, and because of that, trusted in my tricks believability, and when they wrote down the spelling that I gave them, they internalized it. Let&#39;s call this person Gulliver.</p>\n\n<p>Gulliver wasn&#39;t stupid, and he wasn&#39;t trusting either. That might sound impossible, but that was  what was so fun about messing with Gulliver. Gulliver was the kind of person who was so smart, he had no sense of himself. He was aware that in theory he was smart, but if you called him smart he would argue with you. If you said he was dumb though he would argue that he was smart. If you pointed out the contradiction he would lose it. Gulliver was aware of just <em>how</em> vulnerable he was to be easily convinced that he set up barriers for certain things.</p>\n\n<p>You couldn&#39;t convince him about something he had declared he made up his mind about, even if that conviction would waver everyday. You couldn&#39;t convince him of something that he hadn&#39;t made up his mind on. The thing is, the only way you <em>could</em> convince him was if he <em>asked</em> you a question. He had to <em>believe</em> that you might know more about a subject than him. The other way though, was through trivia.</p>\n\n<p>I have been sitting next to him all year, and the one thing that Gulliver has always latched onto was trivia. When we was in fourth grade he was at the same lunch table than me, and I remember someone telling him about how the word &quot;trivia&quot; meant &quot;useless knowledge&quot; and that whenever someone pointed out his love for random facts he would mention it.</p>\n\n<p>That was someone telling him a fact that should have came at the core of his being, and there he was, soaking it up like a sponge. Or really, like a parrot. And when I gave him a trick to remember to spell gullible, I knew he internalized it because he mentioned that random fact about how mnemonics help people study a lot better. </p>\n\n<p>He says that <em>every</em> time without fail. And if you follow up the conversation he will start talking about how if you study while chewing gum, you should chew the same flavor gum while you take the test. And he says <em>that</em> every time without fail.</p>\n\n<p>So I thought it would be fun to see if I could convince him to think life wasn&#39;t worth living just using random trivia facts. I figured as long as some of them were real, it would work. Everyday in class I would tell him a fact that goes something like this: they say that the higher your IQ, the more likely you are to kill yourself.</p>\n\n<p>I didn&#39;t know that was true, and he didn&#39;t even know his own IQ, the point was to make him think that being smart made you want to kill yourself. This was what I would say every 30 days, in between the other facts, I knew I was successful when he said &quot;Oh, I knew that, you already told me about that&quot; because it meant he internalized it.</p>\n\n<p>I would say other ones too like &quot;people who have high grades in school, tend to be the ones that are most likely to be successful, and that most stories that you hear otherwise are actually so rare that only 40 percent of people who get even a C or lower make it even to the upper middle class, and 90 percent of those people were people that had wealthy or double income households.&quot; This one was just destined to pray to every single one of the anxieties I&#39;ve noticed he had.</p>\n\n<p>He never really did well in school, because he never did his homework on time, and his mom works hard just to put food on his plate. If I just said one of the statistics, it would have been unbelievable, he likes to think he would be like of person who wins with 5 percent odds. But making it two different groups really fucked with him.</p>\n\n<p>The rest was a bit more work, I actually would memorize quotes from philosophers, and I would try to convince him life was worth living so he would argue with me. The rest just fell into place. In some ways, I was a lot like him, I actually liked to share trivia myself so it was pretty easy to talk to him. I don&#39;t know why we hadn&#39;t become friends earlier.</p>\n\n<p>I never figured I would succeed. When he was found dead only a few weeks before graduation, I was a little shocked. He had hung himself. I guess it was his fault for being so gullable.</p>\n</div>\n","author":"AnarachaAnon"}