{"rank":"9","title":"The same woman dies in all of my dreams.","id":"8k1eos","url":"/r/nosleep/comments/8k1eos/the_same_woman_dies_in_all_of_my_dreams/","time":"1526531188000","body":"<div class=\"md\"><p>This is my first time doing this but I need to get this off my chest, I guess? Oh boy where do I start.. I have some wacky dreams! Not sure if it is because of the medication I am on for epilepsy but that’s besides the point. </p>\n\n<p>Most dreams I have are quite vivid. I wake up in the morning feeling like I’ve just watched a movie either in 3rd or 1st person. The first person I tell my dreams to is my mom, she suggested I begin writing them down therefore I am copy and pasting what I’ve had saved in my notes on my phone from the past year and a half or so. There have been more dreams like the one I am about to tell you so I’ll try my best to share more if you all are interested. </p>\n\n<p>Today, I was reading some of my “dream journal” to my friend and I realized the same woman dies in most of my nightmares... </p>\n\n<p>The first time I saw her: So I was living in a house with a &quot;significant other&quot; (I didn’t have a boyfriend at the time when I had this dream therefore I don’t know who this person was but he was comforting tho) but whatever. We lived in this house together in like a quiet neighborhood. It was summer time and our front door was open with the screen door letting in a nice warm breeze.  All of a sudden this woman was running down the street towards our house screaming, she was in trouble. </p>\n\n<p>Now about this woman, she was maybe about 5’5”-5’6”. I’m 5’3” and she was slightly taller than me. She had medium length brown hair and greenish blue eyes. (I on the other hand have thick dirty blond hair down to my butt and brown eyes) She looks nothing like any of my friends or family members. Her face wasn’t all that clear in this dream but when I think back she seems more and more familiar in most of my dreams (which I’ll get to later)  </p>\n\n<p>So, my husband and I wave her into our house to try to help her. She begins to tell us how her husband is looking for her to try and kill her. Therefore we hide her in a cabinet in the kitchen. Then her husband comes by looking for her. We tell him she&#39;s not here but he raids our house regardless. We then move her to some closet by our back door. </p>\n\n<p>This guy is freaking the fuck out on me, telling me he knows she’s here while also waving a knife in my face. To save me, she runs out the back and he runs after her but finally catches up with her. </p>\n\n<p>Now other neighbors outside and are trying to stop him from causing a scene but we all lose sight of both of them. From a distance we hear a saw of some sort. (I’m pretty sure in the real world my neighbor was mowing his lawn, I sleep in a lot) We all follow the sound to find that he&#39;s got her arm tied down to a table saw in a very run down garage and he&#39;s cutting her fingers off one by one. By the time we catch up, he moves to her forearm. The neighbors then try to stop him while I try to loosen her out. There&#39;s blood everywhere now. I remember looking down at myself to see my once white T-shirt soaking red. </p>\n\n<p>Now, while they tied the man down, I am holding the woman while also calling the cops. (I smartened up at this point I guess) but the dispatch wasn’t  answering me and blew me off. In the mean time the man broke out of the duct tape and zip ties that my genius neighbors thought was a good idea to use to tie him up! He looked like the friggen hulk! Then he grabs her! This time he has a hatchet.  He begins hacking away at this poor woman’s body while I, in complete shock, just stood there watching him. It was at this point I realized everything was just a dream and I woke up, frozen with fear. </p>\n\n<p>This dream is one of many, all of which have a woman who looks the same dying in some horrific, tragic way. Some of which she is trying to kill me or trying to save me. If you would like to read more I’ll post more but now, I am going to sleep. Maybe I’ll dream of her tonight! Who knows. </p>\n</div>\n","author":"Pleasewatchthegap"}