{"rank":"0","title":"What Happens in dreams effects you in real life?","id":"8k1mh1","url":"/r/nosleep/comments/8k1mh1/what_happens_in_dreams_effects_you_in_real_life/","time":"1526533395000","body":"<div class=\"md\"><p>I have dreams that would effect me in real life like when I once dreamt of me falling off a building, I woke up on the floor in a weird position. Oddly enough I was sleeping on a bunk bed, my brother sleeps on the other bed at the bottom and I would sleep on the top bed. Its weird because of course bunk beds has those arm rest or whatever they call on the side of the bed which would keep you from falling from the top of the bunk bed, but I seemed to have found myself on the floor either way... (Long time ago)</p>\n\n<p>I also once dreamt about looking at a clock or watch and it would hit 9:31 and I would hear a slight noise of my mom calling me... It was creepy because it could be anybody, my brother, sister, dad, anyone could call me in a dream from a distant and everytime their voice will distort turning into some kind of demon scream or something, so of course I woke up, I did not need to see the rest of that dream... Anyways I woke up at 9 twenty something AM, I was a little bit tired so I was going to rest for a little bit more, suddenly my mom opens my door just a crack and calls my name silenty to ask me to help my dad carry some boxes of water upstairs. As soon as my mom calls me and wakes me up, I look at my phone, its 9:31. </p>\n\n<p>I also would have these strange reflex every time I’m about to wake up from a dream. like I could be dreaming about fighting someone or kicking or whatever, and whenever I’m bout to kick or punch I would be waking up and become half awake and would kick or punch the air in a quick manner or something. </p>\n\n<p>Last but not least a really creepy one, so my door to my room has a problem when its not fully shut, like you really need to put force to it to shut it completely. I’m having a nightmare, me and my whole family trying to escape this abandoned house. But most of the time we would hide from these demon like ghosts. When we finally decided to run to the exit, they began chasing us, of course I fall over and look up, my family already gone, I turn around and I see a dead girl with no eyes and her mouth stretches wide screaming in my face... I eventually woke up in the middle of the night, everything dark as hell, and my heart beating fast as fuck, but then afterwards, I feel a cool breeze on my neck and I didn’t know what the fuck that was, but I sat up on my bed, and then my door to my room opens by itself and I saw a person standing in the dark... Dude as a man, I nearly broke in tears fuck that... This was eventually my sister who walked passed my door which causes my door to open by itself because it wasn’t shut completely... If my door isn’t shut completely, a gust of wind usually someone walking by my door causes it to open...</p>\n</div>\n","author":"IEatzTeaBecuzICan"}