{"rank":"35","title":"I think it is going to kill me","id":"8k1prs","url":"/r/nosleep/comments/8k1prs/i_think_it_is_going_to_kill_me/","time":"1526534347000","body":"<div class=\"md\"><p>It is hard to describe the Road to someone who hasn’t seen it. To be quite honest, I still do not even really know if it is real. For your safety, I will only refer to it as the Road, as opposed to its real name to prevent you from venturing down in. </p>\n\n<p>It all started Sophomore year, when I got my drivers license. I was driving my best friend, Nick, home. He lives in a suburb that borders the boonies. I’ve always known he was a huge fan of NOSLEEP and creepypasta, and being the dick that I am, I drove right past his community, down the Road. </p>\n\n<p>Have you ever driven down a corn field right before the harvest? Huge stocks of corn fly past you as you fly down the narrow country road. The corn always used to creep me out, but at least it hid what was hiding in it. Oh God at least the corn covered what was really out there. I wish they never took the corn away, but the harvest soon came, and I wasn’t the wiser. </p>\n\n<p>I took Nick down the Road again, and again, and again. It was always a thrill. We even started making it a thing to do when we were bored. We would always see how far we dared to go down the road, before we freaked out. We started taking all our friends down it, making stories about what lives in the corn. Nick and I created a set of rules, for the Road. Looking back, there were kind barbaric. \nYou must never stop on the road for any reason, or the creatures of the corn will get you.\nIf you see someone walking alongside the road, you must go faster.\nIf you feel like someone in the friend group has wronged you, you can drop them off ANYWHERE along the road, and they must find their own way home. Bikes are allowed.\nIf a member of the friend group attempts to assist the abandoned friend, they will get dropped off twice as far down the road, with no bike. </p>\n\n<p>Oh, how I fucking hate rule three and four. I thought it was just a fucking game but I never could have been more wrong. But we’ll get back to that later. </p>\n\n<p>Our Junior year soon started, and life was better than ever. My parents allowed me to borrow the van, which fit 8 passengers. Nick and I sat in the front of the car, and prepared a horror story to scare our friends with. It’s not essentially important, but the other passengers were named Alyssa, Omar, Sam, Xander, Scotty, and Matt. </p>\n\n<p>I was driving, and Nick looked back at the passengers to tell the story. All I had to do was drive and listed for the key word. As soon as we lost sight of Civilization Nick started, “Look to the left, and look to the right. You might think this corn stretches for miles on end, and you’d be correct. What you don’t realize, though, is amongst the densely grown corn there exists other beings, of the kind you cannot believe. Imagine white silhouettes that can warp time, and your perception of reality. Now, these beings never kill. Well, they never actually kill. But they can warp your reality and make you believe you are dying over and over again. They can make you believe and feel like you are in pain. They can make you believe your friends never existed, and in fact, you are alone on this road. In their natural form, they are pale white, with webbed hands and have slimy, featureless heads. The most distinct thing about them is their bright red lights for eyes. It&#39;s said they hide in the fields until the harvest. By the time they come out, they have spent months alone in the corn, just waiting to be able to fuck with travelers again. I’ve always wondered, why they don’t come out sooner, the corn is hardly an obstacle.”</p>\n\n<p>That was my cue. I turned on my red LED’s that I put behind my glasses, slammed on the brakes, and whipped my head around to the passengers. I then spoke. “What a clever boy, the corn has never been a problem.” I then turned off the car, and it was completely dark. I disposed of the glasses, and pretended to come back to reality, like nothing happened. I looked at my terrified passengers, and asked them, “what they hell just happened? I blacked out for the last 10 minutes or so? Maybe we should turn around.” They all agreed. </p>\n\n<p>One week in October the Road closed down and didn’t open up unit late November. Apparently, no one ever used it and it was decided it would make the harvest easier. By November the road was opened again, and Scotty owed some debt. He was dropped off only 500 meters away, but when we found him at the rendezvous point, he was a wreck. We wanted to believe that he was faking it to scare us, but when the shock failed to wear off, we had to call an ambulance. </p>\n\n<p>Next it was Matt who had wronged. Apparently he looked at Omar’s girlfriend the wrong way. His punishment. Five miles. He returned scared, but sane. He brought his bike and was able to flee from the terrors he soon described. We asked him what was wrong, and he described seeing the same figure over and over, as he was biking down the path. He also attempted to describe a kind of time dilation, that made it feel like he was biking for days. It was then Nick and I caught on, he was simply describing the creatures Nick talked about in his story. </p>\n\n<p>We tried to shake him off insisting he was shitting us, but he was persistent; these creatures were real to Matt. I looked over at Nick and he was beaming in pride. He must have been proud of his story scaring Matt so much. </p>\n\n<p>A few more friends had to right wrongs, but I never much cared. They always returned in shock or in fear, but I laughed it off. </p>\n\n<p>But then, Nick was punished. His distance? A marathon. No bike. I never really found out what he did, no one told me. But I couldn’t take him being punished like this. I simply cared too much. I decided to save him. I couldn’t allow the one I love to this doom. </p>\n\n<p>I was caught, but instead of double the distance, I was only about a mile further. I got thrown out of the car, and I think I have been walking for miles I think, but now I think I am going to die. I stepped aside to write about this, cause you need to know. You need to know about the corn. I don’t know how much time I have.</p>\n\n<p>I keep seeing it in the corner of my eye. It is everywhere. It is in front of me, behind me, fuck no it is in me. </p>\n\n<p>I am so scared right now.\nAll I can do is type this story because I won’t make it. And you need to know about this. </p>\n\n<p>Don’t venture down a road that goes nowhere. Just don’t.</p>\n\n<p>Guys, I see fucking Nick thank god.</p>\n\n<p>Guys, Nick is walking towards me.</p>\n\n<p>Guys, I see Nicks smile.</p>\n\n<p>He’s almost here, we’ll be safe now.</p>\n\n<p>Wait.</p>\n\n<p>Guys, something is wrong with Nick. </p>\n\n<p>I think there is something wrong with his eyes.</p>\n\n<p>They seem to be glowing. </p>\n\n<p>He is pale now.</p>\n\n<p>He is only a few feet away.</p>\n\n<p>Guys, Nick is It, oh my god nick is fucking it.</p>\n\n<p>He’s talking</p>\n\n<p>He’s saying something.</p>\n\n<p>He is still a few feet away, is he not moving?</p>\n\n<p>It spoke.  </p>\n\n<p>“It is so much easier to scare people when the stories are true. But there was one thing I lied about, we do kill, and the corn really doesn’t really stop us. You know Matt? Scotty? You might have thought they returned, bahaha, but my dear, think hard? Wasn’t something off about them? It&#39;s almost like they weren’t there after being punished, or maybe they never were there, and you were always traveling down the road, with me. It’s almost like their existence was fabricated and a manipulation of reality. Tell me, Sara? What’s Matt’s favorite color? Does Scott have any pets? What about the others?”</p>\n\n<p>I really can’t answer these questions. I started to believe him. I don’t know what to do? I don’t even know what is real anymore. Was anything?</p>\n\n<p>My name is Sara Everstien, and I need you to find me. I think I need to post this now, he is walking towards me again. </p>\n\n<p>I guess it can shapeshift; it&#39;s white arm is morphing into a shiv.</p>\n\n<p>I am scared to go, but I need to. Goodbye.</p>\n</div>\n","author":"SaraEverstien"}