{"rank":"2","title":"The Most Dangerous System of Magick","id":"8k22lv","url":"/r/nosleep/comments/8k22lv/the_most_dangerous_system_of_magick/","time":"1526538257000","body":"<div class=\"md\"><p>Okay. Here it goes. </p>\n\n<p>I know that there are many of you out there, wanderers of the world, who hold this so-called suspension of disbelief. </p>\n\n<p>I&#39;m here to tell you a short tale of when I realized disbelief was worth less than a pile of horseshit in a Texas summer. </p>\n\n<p>First off, how many of you are familiar with the Enochian system of magick? Besides from shows such as Supernatural or the too-soon cancelled season of Constantine, I mean. </p>\n\n<p>I&#39;d wager few. And fewer still, I&#39;d wager, would have any experience in this system. </p>\n\n<p>Don&#39;t get me wrong, I&#39;m <em>really</em> not trying to come across as a pretentious prick, however my experience - combined with my pure, unadulterated, passion for the craft - may come across as such. However, if my gruffness dissuades any of you from delving too deep into this sect of magick, so be it. </p>\n\n<p>Enochian, without a doubt, is in the upper tiers of the most dangerous of magicks. Perhaps not the most difficult, nor the most complex, nor the most elongated, but most certainly one of the most trepidatious of systems, for one reason alone: Angels, whether Divine or Fallen, are nigh impossible for mortals to discern which is which. </p>\n\n<p>That is to say, no matter how strong in the craft you think you are, no matter how much experience in summoning or scrying you have, do not think for a fucking minute that you think you have an almighty ability of discerning whether you summoned an Angelic King of the Corners of the Earth or the Celestial bodies, or a Fallen who is more than ready to rip you soul limb from limb just for bothering it. </p>\n\n<p>Although, I will not - no, I cannot - deny that any success in this system of magick is wholly addictive. </p>\n\n<p>This is where I find myself now. </p>\n\n<p>About a year ago is when I first began my research and experimentation with the Enochian system. I have always placed much stock in my dreams (I have been a medium since a child, always having dreams that were regarding cosmic/divine forces all the way as small as something small that was bothering me about my immediate personal life). As such, when I began envisioning a bright, warm entity leading me away from a horde of cold, dark entities in my enteral subconscious, I of course sought consul on it. </p>\n\n<p>My spiritual/personal advisor told me to err on the side of caution, as Lucifer and his most high have been known to masquerade as bright-light saviors. I never figured myself for any sort of prophet, but for a time I heeded this advice all the same. I took to mindful prayer more often, calling upon Christ to bless and protect my home, my soul, and the souls of those whom I love. </p>\n\n<p>Unfortunately, as time went on, and manifested malevolent entities were brought forth and exorcised, as I cleared homes and people, my pride got the better of myself. This is something I curse myself for every time it crops up, but this time it resulted in something most unfortunate. </p>\n\n<p>Many months down the road, my curiosity on the exploits of Dee and Kelley attempting to be satiated, at some point I began attempting what I felt was a necessity to connect to the Higher Planes. </p>\n\n<p>My best friend - Thom - and myself began in earnest, though not without first consulting every text, every near-creditable source that we could come across. He scryed, while I performed the rites. At this point, I was fluent enough in Enochian to fluidly perform the rituals, all the way from blessing our magickal instruments, to opening each Tablet, and the grand finale of the Opening of the Watchtower. It matters not that I describe these in detail to you, for each is so precarious and detail-oriented that I doubt 99.8% of you would care to even try it, let alone believe in it. </p>\n\n<p>That isn&#39;t written to make me sound all machismo and badass. In fact, what came after was more terrifying than any creature with sharp teeth and no eyes, or whatever else is made up in the majority of the tales on here, for the Revelations that came unto us were...well, they were not for us to force out of the Host. If they were the Host. </p>\n\n<p>The first that came to me was Auriel, or Uriel. Or - at least - it was a Fallen that claimed to be Uriel. I cannot be sure now, and that is the most maddening facet of this whole painstaking rite. But enough on that. I am teetering, to be sure, yet still altogether whole. This is why I believe that at least some of the entities that contacted us were of the Divine. </p>\n\n<p>Auriel came to me in yet another dreamscape, and came with a message. </p>\n\n<p><em>I was near a burnt out city, on the outskirts of it. I was leading a group of close friends into a building, and as we gathered into a circle and began holding each other, I glanced around and came to the realization that none of whom I was with were what they seemed to be.</em></p>\n\n<p><em>In an instant, everyone around me turned to grey-black smoke, in the shape of humanoids. Within that moment, I chose flight. I ran, ran out the building, ran across the ashen ground, ran though decrepit alleyways and dense urban jungles.</em></p>\n\n<p><em>I ran until I knew that I could run no more forever</em></p>\n\n<p><em>In that moment of extreme failure, extreme duress, she appeared. Auriel - Uriel - appeared as a long-lost statuette that I once had in my room. She came to me, flourishing her wings, throwing the darkened figures away forevermore. Now, I could not speak in this vision, though she spoke to me. Unfortunately, I could discern less than I hoped for. What I gathered was, in effect, a warning. A warning against what was out there. A warning that the Great Manipulator hopes to take hold of my soul</em></p>\n\n<p>And then I awoke. </p>\n\n<p>But this was not the last time that the Son of the Morning tried to wreak havoc on me. Not by a longshot. </p>\n</div>\n","author":"Grimfrost785"}