{"rank":"273","title":"I have teeth growing in my throat","id":"8k231u","url":"/r/nosleep/comments/8k231u/i_have_teeth_growing_in_my_throat/","time":"1526538392000","body":"<div class=\"md\"><p>It started about six months ago. I woke up to a dull, aching pain in the roof of my mouth, just behind one of my canine teeth. I felt around with my tongue a bit, but didn&#39;t feel anything; so, I figured it was a toothache, took a couple Tylenol, and carried on with my usual daily routine.</p>\n\n<p> The pain persisted for the rest of the week, growing stronger by the day. After a couple days, I also noticed a small lump behind my tooth; almost like a new one was growing in. This, of course, was ridiculous; I’m 26, decades beyond my teething phase, and I&#39;ve long since gone through the adolescent rites of braces and wisdom teeth removal. As odd as it was, I brushed it off. I kept popping Tylenol throughout the day, and ignoring the pain the best I could.</p>\n\n<p> After another week, I awoke to a pleasant surprise; the pain had finally eased. My relief was short-lived, however, as my tongue brushed across something hard in my mouth.</p>\n\n<p> I rushed to the bathroom to examine myself in the mirror. As I widened my jaw and peered inside, I felt a dull pang of fear; there, behind my canine, was a new tooth. Not just the tip of one; a full tooth, crammed into my jaw behind the existing one.</p>\n\n<p> Eventually, I managed to calm myself down. Sure, it was weird, but there had to be a rational explanation. A late tooth coming in, or something. It didn&#39;t hurt, and wasn&#39;t really noticeable when I smiled, so I decided to continue to ignore it.</p>\n\n<p> That was a stupid decision.</p>\n\n<p> Of course, even if I&#39;d wanted to check it out, I don&#39;t have insurance or the pocket money to cover it. I’m unemployed, and my parents cut me off a couple years ago. Therefore, I had no choice but to soldier through my bizarre predicament.</p>\n\n<p> After that, things quickly got… unsettling. Within two days, the pain was back; this time, much worse and far more widespread. After six more days, I had two more new teeth; then three, then five, then seven. Soon, I woke up with a new tooth every morning. At first, they only grew behind existing teeth; but, as they ran out of space, they began spreading further back on my jaw.</p>\n\n<p> I know, I know; why didn&#39;t I go to a dentist? Look; like I said, I didn&#39;t have the money. Besides, what would the dentist have done? Yanked them all out? That would be horrendously expensive, not to mention painful. That, and I was worried about becoming some sort of medical spectacle. I’ve never liked being the center of attention.</p>\n\n<p> After a couple months, they began spreading under my tongue; by this point, chewing was basically impossible, so I was reduced to smoothies, yogurt, and ice cream. I tried not to think about my teeth too much; I know, that sounds ridiculous, but I was terrified. I mean, how would you have felt with dozens of new teeth in your mouth? Eventually I learned to block out the feeling of my teeth against my tongue, and it became easier to ignore my problem.</p>\n\n<p> Well, until three days ago. On Wednesday, I woke up with a sore throat; as I got up and got a drink of water to try and soothe it, I felt something small and hard in my throat.</p>\n\n<p> A tooth.</p>\n\n<p> I awkwardly tried to take pictures of my throat to confirm my theory. I won&#39;t share them here, as they&#39;re pretty gross; but it turned out I was right.</p>\n\n<p> Since then, my teeth have been spreading even more rapidly. I must have at least twenty in my throat now. Every time I swallow, I taste blood. It&#39;s getting hard to breathe, and eating is excruciating. This morning, I woke up with a visible lump under a part of my neck where some teeth have grown in a cluster. I can practically see their outlines.</p>\n\n<p> After paying rent and buying my groceries last week, I have almost no money in my bank account.</p>\n\n<p> What should I do?</p>\n</div>\n","author":"frenchgut"}