{"rank":"24","title":"Something's In the Walls","id":"8k2ls7","url":"/r/nosleep/comments/8k2ls7/somethings_in_the_walls/","time":"1526544888000","body":"<div class=\"md\"><p>It all started on a Sunday. My Sunday usually consists of waking up anywhere but my bed, groggy with a pounding hangover with blurry memories from the night before. It was a ritual I always performed with my roommate and best friend Simon, my stereotypical gay best friend. </p>\n\n<p>I found myself passed out in the closet, a new one for me. But not for Simon. My headache was worse than ever, a constant throbbing in both temples that started as soon as I came to. I forced myself out of the awkward neck-breaking position I had been in with my face against a pair of heels, my body cracking. A pair I had never seen before in my life. I stood, a bit wobbly on my feet and stretched to reach the cord to turn on the light. What I saw made my blood run cold, my eyes widen as I recoiled from the string in horror.</p>\n\n<p>&quot;SIMON! WHY IS THERE A USED FUCKING CONDOM HANGING IN THE CLOSET?!?!&quot; </p>\n\n<p>I don&#39;t wait for an answer, dodging the offending rubber as I burst from the closet. I freeze, taking in the destroyed apartment as I search for a familiar head of red curls.</p>\n\n<p>I spotted a half naked blonde guy hanging half-on and half-off the couch, realizing I didn&#39;t recognize the model-like male. Alrighty then, I thought in my best Jim Carrey voice as I move on to the kitchen. Nothing was amiss in there, as the room was always a mess. I suddenly snap my fingers, realizing he was probably in his usual Sunday spot. I move towards the bathroom and sure enough, there was a skinny pale guy with crazy curly red hair with his head hanging in the toilet. And not the dyed kind, but high quality ginger, I thought.</p>\n\n<p>Simon was well and truly passed out, which was okay because my attention was on the wall across from the toilet. There against the floor was a fist sized hole, which I wouldn&#39;t have given another thought other than the fact it was against the floor. I knew the partying would catch up, the place was always a mess so we were bound to get pests of some type eventually. </p>\n\n<p>Maybe I should have given it more thought.\n...</p>\n\n<p>After a few hours I cleaned up best I could after some coffee, and shooed out the blonde guy without asking any questions. I really didn&#39;t want to know what happened Saturday. I even dared to get the condom down, closing an empty pizza box on it and using it as makeshift tongs. </p>\n\n<p>I sat at the kitchen table nursing a cup of coffee with both hands, slouched to make myself small as if that would help chase off the headache.</p>\n\n<p>&quot;I feel as if I swallowed glass.&quot; A voice croaked from the bathroom doorway, causing me to jump. I grin when I see Simon swaying dramatically in the doorway, and nudge my coffee his way. He gratefully grabbed it as he collapsed in a chair, taking a large chug even though steam still rose from it. </p>\n\n<p>&quot;Who knows, might have deepthroated the whole Cactaceae family.&quot; I mutter, earning a blank look from Simon.</p>\n\n<p>I sigh.</p>\n\n<p>&quot;Cactus, Simon. Cactus.&quot;</p>\n\n<p>He snorts, leaning back with his chair causing it to tip precariously. </p>\n\n<p>&quot;Next I&#39;ll hit up the succulents.&quot; He wiggles his eyebrows, and I don&#39;t bother correcting him.</p>\n\n<p>&quot;We really need to cool it down next Saturday.&quot; I say without feeling, the words sounding hollow even to my ears. Sure enough he grins, and I&#39;m ready for the returning comment. </p>\n\n<p>&quot;Don&#39;t you say this every Sunday, Dee? Only to be the first one to break out the Jägermeister the following Saturday?&quot; </p>\n\n<p>I ignore this, standing to begin the dishes making sure I swipe the coffee he had been in mid-sip with and dumping it saltily down the drain. So what, I liked to drink. Black licorice is a weakness of mine, and unfortunately for my body and head Jäger tasted just like that.</p>\n\n<p>My cleaning sluggish attempt as washing dishes was interrupted by the buzzing signaling someone wanted in the apartment, and I quickly placed a soapy finger against my nose so fast I splashed myself in the face.</p>\n\n<p>&quot;Not it.&quot; I sputter through suds, attempting to use my oversized t-shirt to wipe it. My usual Sunday garb, a t-shirt so big it fell to my knees, and nothing else. </p>\n\n<p>&quot;Fuuuck. Fine bitch, but next time it&#39;s on you.&quot; Simon peels himself from the chair and disppears, buzzing up the person without even asking who it was. We didn&#39;t have to wait long to find out, as minutes later a familiar hellish sound was heard. The sound of heels against the tile in the hallway outside the apartment. I release the longest, most frustrated groan in my arsenal. Even Simon looked perturbed, and without a word moved to lock himself in the bathroom. I only wish I could join him.</p>\n\n<p>I paste on a smile as I open the door, revealing my mother in mid-knock. As soon as she saw me her lip curled and she wrinkled her nose as if she smelled something rank. Which, granted, she probably did. </p>\n\n<p>&quot;Oh Deidra, you look a wreck.&quot; She murmurs as she sweeps inside without even asking, her crimson dress swishing as she moved. </p>\n\n<p>&quot;Thanks Mom, good morning Mom. Nice to see you too Mom.&quot; I mutter between clenched teeth, shutting the door with a bit more force than necessary. </p>\n\n<p>&quot;I&#39;ll make this quick, just wanted to wish you a happy twenty-first birthday.&quot; As she spoke she eyed the living room with obvious distaste, her eyes lingering towards the kitchen. Where Simon was holed up in the bathroom. </p>\n\n<p>I blink, shocked in silence for a few moments as I quickly count the days on my fingers. Well I&#39;ll be a monkey&#39;s bare-assed Uncle.</p>\n\n<p>&quot;Oh, of course. Thanks I guess.&quot; I play it off as if I didn&#39;t totally forget my own birthday, reminding myself to get on Simon for not giving me a heads up. </p>\n\n<p>&quot;So... Wh- Er I mean to say, How is the apartment treating you?&quot; My mother stammers a bit, but collects herself nearly instantly. I narrow my eyes, as she had never stammered a day in her life.</p>\n\n<p>&quot;Good. I actually need to clean, so thanks for stopping by.&quot; I shut it down, not up for small talk. Besides, I knew Simon wouldn&#39;t come out until she left. Which, I didn&#39;t blame him. Though I did express if she said one more homophobic comment to or about him I wouldn&#39;t allow her over ever again. </p>\n\n<p>It shut her up for some reason at the time, but Simon never tested it out. Really, he just didn&#39;t want me to cut off contact with my mom. Sweet, but unnecessary.</p>\n\n<p>&quot;Oh, well alright. Call me if anything happens.&quot; She says with a tight smile, taking the cue and heading for the door. I wait until she leaves before heading towards the bathroom, talking as I go.</p>\n\n<p>&quot;Clear, come on out.&quot; I call, pausing to try the door. It was locked, which again wasn&#39;t unusual. The lack of response however was.</p>\n\n<p>&quot;Simon! You fall in, dork?&quot; I bang on the door, but again nothing. Now I&#39;m picturing him having fallen out and cracking his head against the sink in a pool of his own blood. </p>\n\n<p>I decide against knocking down the door like in cop shows, instead I fetch a knife and use it to jimmy the lock open. Takes me a few tries and lots of cursing, but finally I get it. I pause, a sudden deep and foreboding feeling appearing in the pit of my stomach. I tighten my hold on the knife, slowly swinging the door open.</p>\n\n<p>This time, I scream. And I don&#39;t stop.</p>\n\n<p>...</p>\n\n<p>Usually when one sees blood on TV it seems fake and unreal, something that one couldn&#39;t help but scoff at. This was nothing like that.</p>\n\n<p>Crimson smeared the walls, the ceiling, all over the floor and mirror. It especially surrounded the hole in the wall, a hole that somehow was now several feet in diameter. My breath was coming in ragged gulps, and I noticed distantly that the edges of the hole were ragged. But as I grew nearer I realized it wasn&#39;t that they were ragged, oh no. The edges were stuck with bloody chunks of something.</p>\n\n<p>Hair. Human hair.</p>\n\n<p>Simon&#39;s hair.</p>\n\n<p>Now I was near hyperventilating, I forced myself to slowly back out and shut the door, and I even went as far as moving the table to barricade it from the outside.</p>\n\n<p>I&#39;m currently in the closet again, writing this. I&#39;m scared, I don&#39;t know what to do or what the fuck happened. </p>\n\n<p>I think something&#39;s in the walls.</p>\n</div>\n","author":"AnnabeeBuzz"}