{"rank":"17","title":"The Passenger","id":"8k3all","url":"/r/nosleep/comments/8k3all/the_passenger/","time":"1526553969000","body":"<div class=\"md\"><p>It is the evil that speaks directly to you. It comes close to your ear and whispers sweet nothings into it, making everything seem ok. </p>\n\n<p>It hides from you and wants you to come find it, like I used to hide from my daughter. She would run around the house with her tongue gently pressing up against her upper lip grinning ear to ear, eyes wide. Now I am the one searching in the endless and eternal game of hide and seek. </p>\n\n<p>It has been that friend that only takes from you, giving nothing back. You sit content, waiting for it to give you something, to make you feel satisfied, but you’re stuck reaching for anything it’s willing to give you. </p>\n\n<p>It leaves you shaking out in the cold without offering a jacket to keep you warm. The only jacket it provides are the claws of its nails surrounding you like a straitjacket. Constricting itself around you so tight that nobody can hear your screams when you shout out for help. </p>\n\n<p>It takes control of you. It seeps through your skin and crawls throughout your veins. Slowly at first. It doesn’t want to come on too strong. But soon enough, it has spread too far. Roots too deep. It’s now out of your control and now you’re switched to the passenger seat while somebody else drives. You’re forced to watch your life pass by you through the windshield. You quickly grab for the wheel and try to divert the car, but your strength is nothing, your will too weak.</p>\n\n<p>You see your daughter being born, but there’s a half glazed look on your face. Your wife tries to hold your hand while she’s giving birth, but you offer no grip. The windshield is foggy. You can see blurred images. Sounds are muffled. </p>\n\n<p>Your wife is screaming your name. Throwing whatever she can grab. Books are smacking into your face. A wine glass broken across your bare chest. She wants a reaction out of you. She wants emotion. She wants you to talk. She wants something. Anything. You look through the windshield and sob, hoping she can see the emotion. But she can’t. Nobody ever will. It places its cold, decrepit hand and rests in on your lap. You turn to look at it, but it’s looking down. You can’t see the features of it. Not even the side of its face, its head is veiled with a large hood. </p>\n\n<p>The car keeps driving. You don’t know where it’s taking you. You can’t ask questions, it will never answer. You’ve tried. You’ve asked others for help, but they can’t hear you. They ignore you and hope someone else deals with you. They can’t be bothered.</p>\n\n<p>The car suddenly stops. This is the first it’s stopped in days, months…or is it years? You don’t know. You’ve lost track of time. Days blur together like an abstract painting. Why has it stopped? </p>\n\n<p>I look over to it but it’s looking out its window. I try to open the door but I can’t, my brain isn’t agreeing with the action I’m trying to command. I look through the windshield once more, still foggy and in patches. I see myself. I’m in some sort of room. The lady in a gown is pointing her finger at me with anger, almost hatred. My wife is at an opposite table, chin touching chest, eyes closed; tears streaming down her cheek. I reach for the image that I’m seeing, but it quickly swats my hand down, never raising its head up to acknowledge me. All I can do is sit in this passenger seat and watch. </p>\n\n<p>People are beginning to stand. I’m not sure what is happening right now, I can only see bits and pieces of what it allows me to see. I suddenly see my daughter. She’s coming my way but another man directs her to my wife. Why can’t I hug my daughter?</p>\n\n<p>I begin to scream. Spittle is coming out of my mouth, the veins in my neck are about to burst. I’m making my own ears throb, but the driver seems perfectly at peace, now looking down to the floor of the vehicle once more. I turn my head to it. I want to hit it as hard as I can, but it would be of no use. I know I’m too weak for that. I use my voice. I shout at it for hours it seems. It doesn’t flinch. It doesn’t acknowledge me. It finally puts its foot on the wheel and we begin driving. </p>\n\n<p>We are driving through some forest. Dark, red trees are enveloping us from either side. Crows are cawing and hyenas are laughing. Are they laughing at me? I can’t see anything anymore. The visibility of the windshield is getting less and less. I’m trying to make out the details outside, but I can barely see out the small slivers are glass that aren’t clouded. It looks as if dead grass is everywhere. The trees are all but dead.  </p>\n\n<p>We stop abruptly. I glance down at my hands and see them shaking. I look over to the driver and watch its decaying hand glide over my lap and push open the door. I don’t run. I sit in shock. It feels like I’ve been in this car for a lifetime. Its head is still hung low. The long, baggy hood drowning out its facial features. Even though I have so much anger and hate toward it, I feel like I’m leaving a friend. It’s the only friend I’ve ever had. It has guided me throughout my life. I ask if it’s coming with me, but I’m met with silence. </p>\n\n<p>I step out of the car. I take in the new world around me. I no longer have to see through its windshield anymore. I can see with my own eyes. </p>\n\n<p>Trees are collapsed around me. They are blackened and thin, like somebody trimmed them into sticks. I notice the crunch below my shoe. It’s a crow. A crow had fallen out of the sky. I continue looking at the ground around me and notice there are many crows grounded. Some are dead, others are on their way. The ones that are still alive are trying to helplessly flap their wings, but it’s of no use.</p>\n\n<p>The air is thick and musty. It’s difficult to breathe. I look up to the sky and notice…nothing. Nothing at all. It’s complete darkness. No stars littered in the sky, the moon hiding behind the shadows, almost as if it’s afraid to look at me. But how am I seeing? I look off in the distance. </p>\n\n<p>A cabin.</p>\n\n<p>A lone cabin out in this death and despair. The lights on it are dim, but they’re enough to light my way. I walk toward the cabin, incapable of avoiding the crows. I’m wobbly, but I’m not drunk. I try to steady myself but it’s no use. I fall to the ground and join the crows. I am now looking at a dying crow, our eyes gazing at each other. I can see the flicker of life receding in its eye. The crow’s eyes are shut longer and longer with each blink, until they open no longer. I bid farewell to my friend. I feel we have a bond with each other. I watched its last moments, we are forever entwined. </p>\n\n<p>I palm the ground and find what little strength I have to hoist myself up. I begin to walk once more toward the structure. I walk slower, knowing my wobble will throw me to the ground if I walk too fast. I feel as though I’m on a tight rope walking across a canyon. </p>\n\n<p>I arrive at the cabin. The door is open, as if the cabin was expecting me. </p>\n\n<p>I walk through the door and see someone sitting in the corner of the room. The cabin is one big room with nothing in it. Spider webs flow throughout the room, dust coats the floor. The windows are drenched with dust, mold is growing in the corners of the structure. This is a miserable place, why would anyone want to sit in this cabin?</p>\n\n<p>I call out to the person sitting in the corner of the room, the light is too dim for me to make out the features. I step closer to get a better view. It’s the driver. My friend. He was sitting in here alone. His head is bowed and his hood draped over his skull. I ask if he needs help. </p>\n\n<p>He raises his head for the first time since we’ve crossed paths. His hood drops to his shoulders. I can see his face now. His cheeks bones are high, his face sunken in. His eyes look like pool balls in the pocket of the table. His face is wrinkled telling me he is far older than I realized. I look closer at this poor man’s face. He has a mole underneath his right eye and a scar marked like an L on his temple. I feel for my own face and touch the scar that is on my temple, the mole under my eye. This man is me. I glance down and notice he has a syringe pointed at the crease of his arm. I go to pull it away, but it’s as if I’m a ghost, my hands go through his body. He lunges it in his arm and rests his head against the wall behind him. His eyes closed longer and longer between blinks, just like the crow. He opens them once more. A single tear rolls down his face. There is no smile, no laugher. His face is the canvas for sorrow, misery, regret and helplessness. His eyes close once again, but this time, they never open. </p>\n\n<p>I hear a loud slam, the door behind me shuts. I reach for the door as if my arms will suddenly grow long enough to open it from my position. I fall to the floor, somehow knowing I will never get back up. My eyes begin to slowly close. I try to keep them open, but it’s like someone is forcing them closed with their hand. I see the image of my daughter in the blackness of my lids, but now she’s fading. I try to open my eyes back up, but they seem glued shut. My breathing becomes less and less. I begin swimming in nothingness. I feel my body leaving the plane of existence, until I realize there is nothing left of me on the floor. I slip away and begin another life-long countdown until I can hug my child again.</p>\n\n<p><a href=\"https://www.facebook.com/Manobutler/\">FB</a></p>\n</div>\n","author":"Mano369"}