{"rank":"3","title":"Demon Scars [Part 4]","id":"8k3b5m","url":"/r/nosleep/comments/8k3b5m/demon_scars_part_4/","time":"1526554163000","body":"<div class=\"md\"><p>Part 3 of 8 - <a href=\"https://www.reddit.com/r/nosleep/comments/8jlzxf/demon_scars_part_3/\">https://www.reddit.com/r/nosleep/comments/8jlzxf/demon_scars_part_3/</a></p>\n\n<p>Over the next few weeks winter had turned to spring. </p>\n\n<p>We had received a grade of A on our Vietnam War assignment with many glowing comments such as: &quot;well researched and documented&quot; and &quot;Flawless Victory.&quot; </p>\n\n<p>Randy and I made a winning team. We were thrilled. </p>\n\n<p>Randy&#39;s confidence was through the roof. He joked about stapling the report to a shirt and wearing it around town. \nDespite all his weirdness, Randy could be very inspirational, with a high potential for leadership and persuasion. </p>\n\n<p>If he happened to be as knowledgeable of something like sports as he were of witchcraft and shit, he would be among the school&#39;s most popular students.</p>\n\n<p>While this was not the case, I felt good knowing that I helped him with something that he got recognition for. \nHe seemed like a completely different person with the report under his belt, and I could tell that the girls at school took note of our academic victory. </p>\n\n<p>Mind you, my high spirits didn&#39;t last long. </p>\n\n<p>Randy started getting angry that I hadn&#39;t identified an offering yet. </p>\n\n<p>He said that I promised to go through with the ritual but I no longer appeared interested. </p>\n\n<p>I told him to shut up and that I would find someone when the time was right. </p>\n\n<p>I still considered myself new to the school and wanted to casually assess our targets. His desperation was getting to me. I let him know this and told him that he was risking all our efforts by being reckless. </p>\n\n<p>By questioning his dedication, he grew even more hostile so I shoved him out of the way and left. \nOur class pictures were ready and handed to us in sealed envelopes. Everyone was already looking at theirs in the hallway but after my dispute with Randy, I didn&#39;t care. </p>\n\n<p>I wanted to get home to watch wrestling. </p>\n\n<p>Later that night, I began getting ready for bed when the phone rang. Knowing who it was, I told my mom that I didn&#39;t want to talk, but she said it was urgent. </p>\n\n<p>I took the phone. Of course, it was Randy. </p>\n\n<p>He asked if I had seen the class pictures. He sounded so ecstatic you would have thought the school had given him a Penthouse magazine instead. </p>\n\n<p>His mood swings were annoying but it was hard to remain mad at him when he was this overjoyed.</p>\n\n<p>I took the envelope containing the pictures and went into my room. I pulled the photos out and what I saw next chilled me to the bone. </p>\n\n<p>In the 8x12 photo all the students were placed neatly on the podium and smiling for the camera. </p>\n\n<p>In the back row, Randy and I were standing next to each other. </p>\n\n<p>Between us was a shadowy shape, like a dark human-shaped stain on the photo paper. \nTo the other side of the picture, Mike was seen smiling normally. </p>\n\n<p>Except his leg, the one he allegedly injured on account of Randy&#39;s curse, appeared distorted and broken. </p>\n\n<p>The final and most significant oddity was a kid from our math class, Shane. His face was completely blurred. </p>\n\n<p>At this point, I became painfully aware what Randy had called about. His sense of joy and triumph made it very clear. </p>\n\n<p>We knew who our victim would be. The one we would sacrifice to the forces of darkness in exchange for untold power. The one who would die by our hand in cold blood. </p>\n\n<p>Shane, another fucking douchebag name. </p>\n\n<p>With the target in place, Randy and I were quickly back on good terms. This kid Shane, would be easy to convince. </p>\n\n<p>Even for a teenager, Shane had bad hygiene. He never wore deodorant and seldomly brushed his teeth. </p>\n\n<p>He was also into Star-Wars and Nintendo, a fan-boy and most likely a virgin. I also owned a Super Nintendo game console.  </p>\n\n<p>Shane and I both played Super Mario Kart which led to our first few hangouts. Randy came along but he wasn&#39;t very good at the game. Shane and I were very competitive. </p>\n\n<p>I favored Donkey Kong Jr. due to his top speed and punishing racing style. Shane always selected Koopa Troopa.</p>\n\n<p>Shane was an okay guy, but I grew tired of his lack of cleanliness. Not to mention his sickening love of science fiction and Nintendo mascots. </p>\n\n<p>Plus, he never talked about girls and wasn&#39;t very fond of wrestling or NHL video games, something that was sacred between Randy and I.</p>\n\n<p>I was beginning to long for the ritual just so I could do away with Shane. </p>\n\n<p>Randy didn&#39;t spend as much time with him and seemed amused when I complained of Shane’s foul ways. </p>\n\n<p>I think Randy enjoyed listening to my rants because he felt I was channeling the raw energy necessary for the sacrifice. </p>\n\n<p>At this point everything was about the sacrifice with Randy. He would fill countless notebooks with drawings and stories that grew more and more fucking deranged. </p>\n\n<p>For instance, he told me one morning that he saw a severed head roll down his staircase while he was seated on the couch. </p>\n\n<p>He also said that his inhuman visitors were arriving nightly and he would stay up into the early mornings conversing with them. He began coming to school increasingly late and run down. </p>\n\n<p>He also got the name of the demon, Admant, during one of his nocturnal seminars. </p>\n\n<p>He had done research in his various books as well as with a pen pal regarding the credibility of this alleged Admant character.</p>\n\n<p>Based on his research, Admant was a mid-ranking demon who was known to be a merchant. According to Randy, this was to our favor and the powers were guaranteed to be granted. </p>\n\n<p>As the school year wound down, Randy and I became more and more detached from the general school population. </p>\n\n<p>Both our grades were suffering and we were singled out by the teachers to address this problem. </p>\n\n<p>I agreed that we were neglecting our studies and would have to push through in order to pass.\nThere was no reason for either of us to fail the school year. Despite our dedication to the ritual, it&#39;s not like we were actively working on it. </p>\n\n<p>We were just getting distracted and lazy. </p>\n\n<p>It was possible for us to succeed at both school and extra-curriculars. However, it was difficult getting the point through to Randy. He was almost living entirely in a different world. </p>\n\n<p>Of all the times I spent playing Mortal Kombat after school and on weekends with Randy, I never once saw his parents. </p>\n\n<p>I was beginning to believe he was the only resident of his house, the only living or human one at least.</p>\n\n<p>Either way he always seemed to have money for electronics, movies, and his obscure books. </p>\n\n<p>Hell, he was even the first person I knew who had a high-end computer with home internet! So it was apparent that someone was paying the bills at home.</p>\n\n<p>As the snow was disappearing, we limped through the school year with a last-minute cram along with strong grades in English, social studies, and art. </p>\n\n<p>Needless to say, Randy was one of the top students in art despite his gory submissions. \nThankfully for him, the art teacher was a hippy who felt strongly against censorship in the arts. </p>\n\n<p>While the images of death and destruction weren&#39;t his cup of tea, he praised Randy&#39;s artistic insight and recognized that he had spent a lot of time on his assignments.</p>\n\n<p>Summer holidays were upon us and with it began the unholy countdown to the ritual. Randy and I continued to obsess over video games and movies. </p>\n\n<p>Randy&#39;s current fixation was on the 1987 film, Hellraiser. An adaptation of the Clive Barker book, Hellraiser follows an evil puzzle box that has the ability to summon hellish creatures. </p>\n\n<p>One of the characters is ripped apart by the demons but is subsequently brought back when blood is accidentally spilled on the site of his demise. </p>\n\n<p>The man&#39;s accomplice lures victims to the room where they are killed and the man revives himself by feasting on their blood.</p>\n\n<p>Randy insisted that the movie was textbook and the sacrifice in the film was identical to the one we were to perform. </p>\n\n<p>He was also quick to share other tidbits of &quot;useful&quot; information, such as if someone ate a human heart, they would grow powerful enough to stop their enemies with words alone. </p>\n\n<p>He also suggested that we should cut out the offering&#39;s eyes (Shane&#39;s) and crush them into the walls. </p>\n\n<p>Doing this would give us the power of the &quot;sixth sense,&quot; allowing us to see ghosts in our world. I grimaced at the thought of this and explained that the cleanup would be excessive. </p>\n\n<p>Either way, he stressed that the ritual had to be bloody since that&#39;s what had worked in the movie. </p>\n\n<p>Randy was growing increasingly paranoid as the date drew nearer. He insisted that everything had to be perfect. </p>\n\n<p>He collected the required materials such as special candles and a ceremonial knife. We discussed how we would lure Shane to the ritual location (Randy&#39;s basement) and subdue him.</p>\n\n<p>Randy produced a piece of paper covered in some archaic-looking writing. He cut himself with a knife and slopped some blood on the paper. </p>\n\n<p>He handed the blade to me to follow suit. I made a cut along my palm, up the left thumb, and wiped my blood on the paper.</p>\n\n<p>The reason the allies referred to Viet Cong soldiers as “Charlie” is because of the phonetic alphabet. </p>\n\n<p>VC. Victor Charlie, or Charlie for short.</p>\n\n<p>I believed the killing should be easy. Invite Shane over to Randy&#39;s house and knock him over the skull. After that, Randy would handle the rest. </p>\n\n<p>I still didn&#39;t want to do it but it only made sense that someone must die. Man, I was hungry. I wish Randy had food in his place.</p>\n\n<p>As I left Randy&#39;s home for the night, I looked up at the house. There was a light on in the attic. </p>\n\n<p>We had been in the basement all day and Randy&#39;s mom must have came back while we were scheming. </p>\n\n<p>Part 5 of 8: <a href=\"https://www.reddit.com/r/nosleep/comments/8kcave/demon_scars_part_5/\">https://www.reddit.com/r/nosleep/comments/8kcave/demon_scars_part_5/</a></p>\n</div>\n","author":"Rich_Brady"}