{"rank":"2489","title":"I Shared A Room With Abigail","id":"8k3g1j","url":"/r/nosleep/comments/8k3g1j/i_shared_a_room_with_abigail/","time":"1526555701000","body":"<div class=\"md\"><p>Abigail Winters had died 75 years before we met. </p>\n\n<p>She was seven, like me, and she liked dolls and needlepoint and wearing pretty ribbons in her hair. I didn’t like any of those things, but I liked Abigail all the same. </p>\n\n<p>My family had lived in the large Victorian house at 23 Grofford’s Field Lane for almost six months when I first found her in my bedroom closet. She was huddled against the back wall, a simply made cloth doll hugged to her chest. My initial reaction was shock, but not fear: she was just a little girl, after all, in a navy blue dress with a lace collar and a satin ribbon in her hair. She stared up at me with wide eyes and put a finger over her lips. </p>\n\n<p><em>Shh.</em></p>\n\n<p>I stepped back and closed the door again quietly.</p>\n\n<p>The next time I saw her, she had tucked herself behind my dad’s easy chair in the living room. She was peeking out at me, just her eyes and the top of her head visible. When she realized she’d been noticed, she ducked out of sight with a soft gasp. Dad, who had been sitting in the chair at the time, simply turned his newspaper’s page without any reaction. I waited for him to get up and leave the room before I tiptoed over to the chair and peered behind it.</p>\n\n<p>There was no little girl.</p>\n\n<p>At that time, the word “ghost” was not in my vocabulary and the only spirit I knew of was the holy kind. To say I was sheltered was a bit of an understatement; I’d only ever been homeschooled and my only interaction with other children came from day trips to the park or at church. So when I started seeing Abigail, I was confused, I didn’t know what to make of her. I tried asking my parents about the other girl in the house, the one in the dress with the long hair, but they just seemed confused, too, even a little upset at the prospect of me “seeing things”, so I didn’t bring her up again. </p>\n\n<p>It’s easier when you’re a child to just accept things as they are.</p>\n\n<p>For the next few weeks, I’d see her hiding behind furniture or off in some corner. If I tried to speak to her, she’d motion for me to be quiet and then hurry away to hide again. I was never able to keep up with her when she did that. Eventually, I just started to sit with her, neither of us speaking, and when she seemed to get used to that, I’d bring toys and set them down in front of us. Abigail never touched them, she preferred her own doll or working on a floral needlepoint she sometimes had with her, but we’d play silently, side by side.</p>\n\n<p>“I’m Dawn,” I dared to say one day, about a month after I’d first found this strange girl hiding in my closet.</p>\n\n<p>She smiled, it was a soft, pretty expression, and bobbed her head while dancing her doll around one of my Tonka trucks.</p>\n\n<p>“What’s your name?”</p>\n\n<p>She paused in her play long enough to pull a silver locket from beneath her collar and show me the back of it. “Abigail” had been etched across it in thin, looping letters. She tucked it back into place after I’d had time to sound it out and we resumed our quiet game of doll and dump truck driver, content as only children can be in each other’s company.</p>\n\n<p>Not every day was so peaceful, however.</p>\n\n<p>Sometimes I’d find Abigail hiding somewhere again and no amount of coaxing would get her to come out of her chosen spot. She’d look so small, then, and she’d be trembling and pale, obviously afraid, but I didn’t know of what. I tried to ask, but, as always, she was silent and would just stare at me with an expression I didn’t recognize. </p>\n\n<p>“Do you want me to get my mommy? She’s good at making you feel better,” I offered, but Abigail just shook her head, her little satin ribbon flopping against her hair.</p>\n\n<p>“Do you want me to stay with you?”</p>\n\n<p>Slowly, hesitantly, she’d nod, and I’d take a seat next to her and we’d wait for whatever was bothering her to pass. </p>\n\n<p>After so many minutes out of so many days spent in my closet, her favorite spot to go when she was scared, I finally asked her what she was hiding from. </p>\n\n<p>Abigail stared at me, indecision flickering across her face, and before holding out a small hand. I took it without a second thought, the blind trust of youth, and I was shocked by how cold her fingers were when they closed around my own. She motioned for me to be quiet and then pushed herself to her feet. I followed suit and she pushed open the bedroom door, inch by inch, peeking carefully out. When she was satisfied, she gave my hand a tug and we crept out of the closet.</p>\n\n<p>The room we stepped into was not my own. Instead of my purple unicorn bedspread and toy box and white dresser with all my stickers on the side, it had become a more somber space. A four poster bed with heavy velvet drapes took up much of the middle of the room and a large dresser was against the far wall. The world outside the window across from us was dark. I started to ask Abigail where we were, where all of my things had gone, but she squeezed my hand and shook her head with tightly pursed lips. </p>\n\n<p>For the first time since I had met her, I could feel the flutter of nervous wings beating in my stomach.</p>\n\n<p>She led me on tiptoes out of the bedroom and into the hall that had only moments before been lined with family portraits and a long rug that went the length of it; now it was all hardwood floors, with a single painted portrait of a family hanging at the top of the stairs. I recognized Abigail immediately in it even though she was quite obviously younger, and I guessed the two expressionless adults standing to either side of her were her parents. </p>\n\n<p>Again, I started to ask what was going on, but again, she gestured for silence.</p>\n\n<p>A floor board beneath our feet creaked.</p>\n\n<p>“Abigail!” A woman called from a half open door down the hall. It should have been my parents’ room, but I didn’t recognize the shrill voice. It certainly wasn’t my mother’s. </p>\n\n<p>Abigail’s hand had begun to shake in my grasp.</p>\n\n<p>“Abigail Winters!” The voice called again.</p>\n\n<p>Reluctantly, my friend slid away from me and, with a hand held up to tell me to stay, she walked down the hall. As soon as she entered, the shrill voice started to speak, but it was low and muffled and I couldn’t hear what was being said. Despite Abigail’s obvious wish for me to remain in place, I inched towards the door, until I was just outside and could peek through the crack Abigail had left open behind her.</p>\n\n<p>A woman was seated in front of a vanity. Even then, she looked tall and slender, with an unusually elongated neck that gave her a vulture like appearance. She was turned away from the door, but speaking to Abigail.</p>\n\n<p>“You haven’t been in Mother’s things, have you?” She was asking.</p>\n\n<p>Abigail shook her head mutely.</p>\n\n<p>“You better not have! The good lord knows I’ve sacrificed so much of myself for you as it is; I should be allowed to have what few pleasures I still retain to myself.”</p>\n\n<p>As the woman spoke, she spun on her stool to face Abigail and I almost shrieked aloud. Half of her face was a beautiful porcelain mask, pure white with lips painted a bright red, but the other half, where the mask had fallen away, revealed sunken, shewish features: a swiveling, oversized eye, and squashed, piggish nose, and large mouth that, when opened, revealed a line of jagged teeth.</p>\n\n<p>When she stood, she loomed over Abigail, an imposing figure in a high necked black gown. </p>\n\n<p>“I can’t find my jade comb. If you’ve taken it again, I will have your father deal with you!”\nFat, silent tears had started to roll down Abigail’s cheeks and the woman clicked her tongue in disgust.</p>\n\n<p>“You have no reason to cry, child,” she sneered. “If anyone were to weep, it should be me, should it not? I, who ruined myself to bring you into this world. I, who gave my youth to you. I, who have had to raise such an ungrateful creature.  How can I stand to look at the thing who takes and takes and takes, yet gives me nothing in return? Get out of my sight, begone!”</p>\n\n<p>When Abigail didn’t immediately move, the woman raised a hand as if to slap her and my friend skittered frantically out of reach while the woman laughed, a cruel, hateful sound that quickly turned to angry sobs.</p>\n\n<p>“What I wouldn’t do to be rid of you and return to my former self! You’ve ruined me! You’ve ruined me!”</p>\n\n<p>Abigail darted out into the hallway and slammed the door behind her. She was breathing heavily, her chest heaving, and the pain I saw twisting her face was unlike anything I had ever known. I didn’t know what to say or do, I just wanted to get out of this place that was a strange, terrible altered version of my house. My friend must have sensed my rising panic, because she grabbed my hand again and started to tug me back towards what should have been my room.</p>\n\n<p>Something snorting at the bottom of the stairs made her freeze.</p>\n\n<p>There was a man, or something like a man, coming up towards us. Instead of a face, he had a large pig snout with flapping lips and flaring nostrils, and his chin was wet and stained red. I could smell him from all the way at the second floor landing, like one of my parents’ wine bottles they opened at the holidays, and he stumbled up one step, and then another. The hands that poked out from the end of his starched white shirt were huge and and curled into fists. Veins throbbed across the back of them. </p>\n\n<p>“Abigail,” the pig snout slurred, “you misbehaving again? You wretch, get down here. Get down here and I’ll teach you to honor your mother and father!”</p>\n\n<p>He staggered up another step and raised one of those meaty fists towards us.</p>\n\n<p>“Come here, girl!”</p>\n\n<p>It was my turn to yank Abigail along. We fled down the hall and the pig faced man released a furious roar. The whole house seemed to shake around us as he stampeded up heavily up the staircase. Abigail threw me into the bedroom ahead of her and then slammed the door. She grabbed a chair that was leaning against the wall beside it and jammed it beneath the knob. The door shuddered when the man threw himself against it with another howl. </p>\n\n<p>We were both crying, both so frightened, and we scrambled to get back into the closet, where we shut the door and held each other tight in the dark. </p>\n\n<p>Gradually, the snorting and the slamming and the bellowing slowed, until it had become quiet, and a light crep under the closet door. Abigail’s grip on me loosened and, although I tried to hold her in place, she leaned forward and pushed it open.</p>\n\n<p>Sunlight was filtering in through my bedroom window in the early afternoon. All of my things were exactly where I had left them. From somewhere downstairs, I could hear the sound of the vacuum cleaner running. I shoved my way past Abigail, who watched me go with a forlorn expression, and bolted down to my mother, who looked confused when I threw myself against her, but wrapped her arms around me all the same and held me tight.</p>\n\n<p>That night, I tried to tell my parents about Abigail, about the tall woman with the broken mask and the pig faced man, about how I’d gone into my closet and come out in some other room, but they assumed I’d had some kind of nightmare while napping brought on by watching too many cartoons. They calmed me down with gentle back rubs and hugs and told me that it was ok, they were there and they wouldn’t let anything happen to me. </p>\n\n<p>It was both incredibly frustrating and incredibly comforting.</p>\n\n<p>I refused to be alone in the house for the next week and stuck to my mother like glue. I even slept on the floor in their room. I didn’t see Abigail again in that time and, it was only concern for my friend, the one my parents’ didn’t believe existed, that finally lured me away from Mom’s side and back into my room.</p>\n\n<p>Abigail was sitting in the back of my closet, the same way she had been the first time we’d met.</p>\n\n<p>“Those were your mommy and daddy?” I asked in a whisper after I’d joined her on the floor.</p>\n\n<p>I remembered the couple from the portrait, stone faced, stern looking, cold, and recognized some of their features in the man and woman we’d encountered.</p>\n\n<p>She nodded, and it was an agonizing, slow motion.</p>\n\n<p>“They’re not nice,” I said.</p>\n\n<p>She just looked at me sadly.</p>\n\n<p>I didn’t know what to do or what to say, I was just a child myself, so I did the one thing Mom had always done for me when I was upset: I wrapped my arms around her and held her tight.</p>\n\n<p>Abigail continued to visit me for the next year. I didn’t know, really, what she was or where she came from, but that didn’t matter to me. All I cared about was that she was my friend. She never spoke, she never touched me again, we never returned to her version of reality, and I never mentioned her to my parents; we just played together, enjoyed one another.</p>\n\n<p>We were simply two children, unburdened by anything else.</p>\n\n<p>And then my parents decided they wanted to renovate the bathroom beside my bedroom, which required taking down part of the wall between the two. The wall at the back of my closet.</p>\n\n<p>I’ll never forget the way the contractor screamed when he first opened it up. Balls of wadded up old newspaper had fallen at his feet and, in his hurry to get out of the closet, he kicked one across the floor and out into the hall. I’d followed my dad upstairs to see what the commotion was and, after being told to wait while Dad checked it out, I picked up that ball of newspaper and turned it curiously over in my hand. </p>\n\n<p>It was dated November 19, 1905.</p>\n\n<p>The paper was knocked from my grasp a moment later when Dad came back out, scooped me up, and practically ran down the steps, shouting for Mom to call the police.</p>\n\n<p>My family vacated the house for the next month and lived with my grandparents’ on the other side of town and, despite my near constant questioning, no one would tell me why. </p>\n\n<p>When we finally moved back in, Abigail was nowhere to be seen. I spent days looking, but I never saw her again. I never got to say goodbye.</p>\n\n<p>Years would pass before my parents finally let slip what the contractor had found that day. They said they didn’t want to scare me, but I still think it was also partly because they didn’t want to admit to themselves. It was a horrible thing to think about. </p>\n\n<p>The skeleton of a young girl, about seven years old, had been discovered in the wall, nestled in a bed of newspaper. She’d been there a long time. When they extracted her, they discovered the cause of death had been a hard blow to the head and that there was also a fracture around one of her eye sockets, the kind you might get from a big, meaty fist. Against her chest had been clutched a plain cloth doll and, around her neck, she’d worn a silver locket with the name “Abigail” etched on to the back.</p>\n\n<p>If my parents remembered the name of my “imaginary” childhood companion, they didn’t say anything about it.</p>\n\n<p>I didn’t need them to, though. I remembered.</p>\n\n<p>I remembered my friend with her large, bright eyes and her gentle smile. I remembered the way she never spoke. I remembered the horrors she had shown me. </p>\n\n<p>And I understood.</p>\n\n<p>Abigail had lived a terrible, short life with cruel parents who had haunted her even after they’d hidden her away behind a thick wall. Voiceless, unable to seek out help, the very people who were supposed to love her above all else had become the very monsters they were meant to protect her from. She had shown me her reality as she had experienced it. She had reached out and shown me those who had killed her.</p>\n\n<p>I can only hope that, in our friendship, she found some of the relief in death that she’d never gotten while she was alive and that, having been found, she’s was able to rest in peace.</p>\n\n<p>I can only hope that, when she left this world, she did so knowing that she was finally loved the way she was always meant to <a href=\"https://authorshcooper.com/\">be</a>. </p>\n</div>\n","author":"Pippinacious"}