{"rank":"2173","title":"I Was Fucking Fat - Part 3","id":"8k3jty","url":"/r/nosleep/comments/8k3jty/i_was_fucking_fat_part_3/","time":"1526556902000","body":"<div class=\"md\"><p><a href=\"https://www.reddit.com/r/nosleep/comments/8jbgth/i_was_fucking_fat/\">Part 1</a></p>\n\n<p><a href=\"https://www.reddit.com/r/nosleep/comments/8jku53/i_was_fucking_fat_part_2/\">Part 2</a></p>\n\n<p>People assume that time is a strict progression of cause to effect, but <em>actually</em> from a non-linear viewpoint – it’s more like a big ball of wibbly wobbly… timey wimey… stuff. I just don’t know how else to explain how things felt in the cell. </p>\n\n<p>We mark the progression of time by how events unfold around us. People get up during the day and go to bed at night because they believe they <em>must</em> get up during the day and go to bed at night. The reality is that we simply seek comfort in the walls that we create; if the view were unobstructed, most would prefer to close their eyes rather than accept that nothing is in front of them. </p>\n\n<p>I lost the luxury of that wall, and assumed I was losing myself with the absence of other people. </p>\n\n<p>I mistook the shock for a gradual decrease in my sanity – or I did at first. In the beginning, I believed that I was formless and empty, that the darkness over the surface of the floor was an absence of <em>Janelle.</em> There was no one to call me ugly, or to stare as I walked past, or to pretend they didn’t notice <em>when all they did was notice.</em> Without anyone to feel ugly in front of, I stopped <em>feeling,</em> and the ugliness began to disappear. I assumed that if I couldn’t feel ugly, then I couldn’t feel at all.</p>\n\n<p>So what was the itch in the back of my mind? Why wouldn’t it leave?</p>\n\n<p>But each day/moment/week/second that ticked by made the itch grow stronger. It just wouldn’t stop. </p>\n\n<p>I tried to focus on other things. The hunger – God, it was overwhelming. I wanted food more than I wanted freedom.</p>\n\n<p>Well – at first I did. The thing is that I accepted the hunger as part of my imprisonment. After the acceptance, it was just kind of <em>there,</em> like an annoying background noise to endure. Most people feel a lack of having enough money throughout their lives, and are okay with the reality that the need will always be there. Once it became <em>obvious</em> that I couldn’t will the food into existence, there was no point in latching onto the craving. It wasn’t a conscious decision to make the shift; I simply utilized the part of me that had embraced passivity to the point where I weighed as much as three baby walruses.</p>\n\n<p>I gave <em>up</em> on the hunger in the same way that I had given <em>in</em> to it.</p>\n\n<p>But the itch remained.</p>\n\n<p>The water bottles always appeared. I tried to find out how they were finding their way in at first. But when you don’t know the difference between sleeping and waking, it’s impossible to know what dreams may come.</p>\n\n<p>Does that make sense?</p>\n\n<p>The itch became more real. </p>\n\n<p>Itches aren’t good, are they? We try to rid ourselves of them as soon as they appear. They’re not <em>real,</em> of course; the itches that you feel as you’re reading this exist only in your head, as does the belief that we’re really scratching things away. It’s probably a genetic holdover from so many ancestors who died of mosquito bites – but we <em>act</em> as though they’re real, and the relief becomes factual in the believing of it.</p>\n\n<p>But I couldn’t stop my mind from feeling the itch. I couldn’t passively accept it. And when there is nothing but time, and the hunger and cold and even the piss and shit become passively accepted, there’s nothing that can be done other than to turn to the itch and scream </p>\n\n<p>“What do you want?”</p>\n\n<p>And feel it flair. And in the moment, I knew that it <em>wanted,</em> and couldn’t be passively ignored. It followed me when I was asleep, because the itch on my scalp prodded my dreams. I looked up at who was prodding me and <em>saw</em> me, even though it was dark. I was still naked and still fat, but only fat in my belly. I asked if I was pregnant, but I knew the answer was yes because it was me who I was seeing. And I cried because I knew a long time ago that my body was too ravaged ever to carry a baby, and Mom had said that it wasn’t fair for me to <em>attempt</em> responsibility when I couldn’t take responsibility for myself. She blamed herself; she looked at me and said “this is what happens when a mother fails.” But here I was, pregnant, and I asked what the baby’s name was, and pregnant me said “Janelle,” and I knew that wasn’t possible. Then I reached out and scratched my scalp, and I said to stop making me itch. And the pregnant me said “no, I won’t stop,” so I sat there and passively accepted the itching. She reached down and said “it can’t grow with this thing on” and rattled the metal ring. It was impossible to tell her no, so I didn’t explain why I couldn’t take it off.</p>\n\n<p>I realized that I was awake when I found myself alone. The itch was worse than ever, and I thought “maybe I should listen to myself” and the itch <em>tore</em> through my scalp but it felt <em>wonderful.</em> I stood on shanking legs.</p>\n\n<p>The ring rattled. It slipped.</p>\n\n<p>How long had I been here?</p>\n\n<p>What was the duration of time when measured in calories?</p>\n\n<p>I grabbed the ring and spun it back and forth. I could feel it coast on a thick layer of grime, sweat, and shit.</p>\n\n<p>It didn’t hurt to spin it.</p>\n\n<p>I exhaled and wiggled it downward. It slid. One inch, then two inches, then four.</p>\n\n<p>Then it stopped. It was wedged around my ribcage. I took a deep breath.</p>\n\n<p>But I couldn’t. </p>\n\n<p>It was impossible to expand my lungs. Each breath was tiny. Adrenaline roared through me. I twisted the ring. It didn’t move. I tried to breathe. Just a <em>little</em> air came in. I gasped. I panicked. I was drowning. In that moment, I would have picked death if it were an immediate option. Drowning was one of my worst fears. I gasped. Once. Twice. Three times. The pain and panic overwhelmed me. I couldn’t get enough air to start crying. I only wanted death. Please.</p>\n\n<p>But there just enough air to keep me alive. I was stuck in the moment. Perpetually.</p>\n\n<p>The itch flared up again.</p>\n\n<p>Through the pain, a thought emerged. ‘Why not move the ring off of my lungs?’ Despite the panic, it was somehow impossible to dismiss.</p>\n\n<p>‘You want to say it’s impossible to remove the bond,’ the itch said. ‘You <em>want</em> to say it. Accept it.’</p>\n\n<p>The passive part of me succumbed to drowning at that point. Only the cold, practical itch endured.</p>\n\n<p>‘Take it off,’ the itch said plainly.</p>\n\n<p>I had been spinning the ring back and forth like I was trying to unscrew a jar. For the first time, I attempted pulling opposite ends up and down in different directions, like it was a teeter totter.</p>\n\n<p>It seemed like the sensible thing to do.</p>\n\n<p>I shimmied it down as I did so.</p>\n\n<p>And it slid off of my ribs, past my diaphragm, and landed snugly onto my waist.</p>\n\n<p>I gasped for air, but the itch told me to keep going, not to stop, that there was enough thick coating to end this imprisonment right now. The thought terrified me for just a moment, but I was pushing down before I realized that I had decided to do so. </p>\n\n<p>My hips gave the staunchest resistance. It was clear that the task was impossible. A no-go.</p>\n\n<p>But to my shock, I kept pushing. </p>\n\n<p>It was like trying to lift a house. My skin burned as I forced the metal into my tender flesh, but hardly any progress was made. I screamed and fell to the floor. </p>\n\n<p>I would have given up at that point if it had been a conscious choice. But the scream perpetuated, and I saw my hands moving in the sliver of light, <em>fighting</em> against the ring like they were in their death throes. I twisted the ring, see-sawed it back and forth, but there was so much skin, so much ugly fat, that I stopped and burst into tears.</p>\n\n<p>I wanted my arms to take over once more. I needed them to work for me. I didn’t want to decide. </p>\n\n<p>But you know what? I didn’t want to <em>decide</em> to <em>die</em> there either. The thought of a skeleton in chains fucking pissed me off. </p>\n\n<p>I grabbed the ring once more and <em>pushed</em> against the skin and against the fat in a totality of fury, spinning, twisting, leveraging the ring as I shook with force. I hated the fat that was holding me in place, and I hated the screams of pain that it offered as it fought against me. I loved the <em>tearing</em> of the flesh, I drank in the white-hot pain as my skin sloughed from my body, I pressed the nastiness and shit and infection into the open wounds, because it was <em>my</em> body, and I would burn it before someone else touched a match to me. Once shorn, my flesh peeled in ribbons away from my hips, strips of skin and ugly fat curling away like sliced cheese, ripping away whole slabs as I slid the ring past my hips, over my ass, <em>scraping</em> so much of me as I inflicted the greatest and most wonderful physical pain of my life, sliding it past my loins and down my thighs, shooting past my feet and onto the floor with sheer force as I birthed Janelle, crying inconsolably, <a href=\"https://www.reddit.com/r/NoSleepInterviews/comments/8jc5zt/may_14th_2018_byfelsdisciple_interview_part_1_of_2/\">into the world</a>.</p>\n\n<p><a href=\"https://www.facebook.com/P-F-McGrail-181784199029462/\">FB</a></p>\n\n<p><a href=\"https://www.reddit.com/r/ByfelsDisciple/\">BD</a></p>\n\n<p><a href=\"https://www.reddit.com/r/nosleep/comments/8kcxjv/i_was_fucking_fat_part_4_final/\">Part 4</a></p>\n</div>\n","author":"ByfelsDisciple"}