{"rank":"10","title":"the man who can take pictures of people that are missing","id":"8k3vbb","url":"/r/nosleep/comments/8k3vbb/the_man_who_can_take_pictures_of_people_that_are/","time":"1526560180000","body":"<div class=\"md\"><p>It’s strange how people go missing like how they could be part of the community and be so visible to everyone and then all a suddenly they go off the grid. They leave behind so many questions and so many of their loved ones worrying and suffering from emotional and psychological stress. In the last couple of years there has been an increase of missing people and an increase or presuming people to be dead. You never know what someone is feeling or thinking on the inside and even though they could give an award-winning smile behind it is a pile of misery built up over the years. </p>\n\n<p>My area is a poor neighbourhood and its no stranger to suicide or people going missing and its so common that its not surprising anymore just more depressing. A couple of families who have had loved one going missing or off the grid received pamphlets and its what the pamphlets said which was so harrowingly bizarre. The person who posted them said that he can take pictures of missing people who have been missing for 10 years or more. I mean if a person has been missing for ten years then clearly that person is dead or gone forever. </p>\n\n<p>Now some people were disgusted by this and posted it on facebook but none called the police and some were hopeful. It had a medium or psychic type of vibe to it all and one woman decided to check him out and her son has been missing for over ten years and here comes a stranger saying that he can take pictures of missing people. She went to his house on a weekend and she was all sober so that she can be fully alert for any con at play. </p>\n\n<p>This guy lived in a small house and from what the woman had told everyone this man would take his camera and go into a small private room and she herself has seen this small private empty room and he starts to take pictures. When this guy starts taking pictures inside the small private empty room she is now outside and when he shows her the pictures he has taken to her shock and disbelief it showed the picture of her smiling and exactly the age when he disappeared. She started to cry and she couldn’t believe it and when he started taking more picture inside his small empty room it showed more pictures of her son doing other positive things and enjoying life. </p>\n\n<p>He showed her his camera before taking the snap shots and he had no photos of her son before and he didn’t know what he looked like. More people started to go to his small house discreetly and all were stunned to find pictures of their missing loved ones all in a positive mood but all at the age when they went missing. No body was really questioning how he was doing this but I decided to go and check him out even though no one in my family gone missing nor my circle of friends. </p>\n\n<p>I went into his small house and he went into the small private empty room and when he started taking picture inside his small empty private room he had a surprised look on his face. It was of my father but it was all fuzzy and smudgy and the image wasn’t clear like the others. I phoned my father and I asked him if he was ok and he said yes but something didn’t feel right at all and when I got home my father wasn’t there anymore. My whole family tried to phone our father but he wasn’t picking up anymore and we went to the police and my father was put onto the missing persons list. \nAfter a month when my father was put on to the missing persons list that guy posted a picture of my father but the image was much clearer now and it was of my father smiling and full of relief. I just hope my father would come back to us. </p>\n</div>\n","author":"shortstory1"}