{"rank":"80","title":"The True McKowell Family - Part Two","id":"8k3wdc","url":"/r/nosleep/comments/8k3wdc/the_true_mckowell_family_part_two/","time":"1526560470000","body":"<div class=\"md\"><p>Part One</p>\n\n<p>Every family has a secret. Some small. Some large. My family secret, the McKowell family secret, is on another level. I’ve never told anyone outside of the McKowell family tree this secret, I had hoped I would never need too. However in light of recent events I find myself in a position with no exits than one guided by the truth. I do believe that lives are at stake – though I honestly hope my imagination is over active.</p>\n\n<p>..</p>\n\n<p>I was twenty three when my Great Grandfather Louis passed away, my dad came into my room at 5:18 in the morning to tell me. It sounds harsh but I never knew why he couldn’t wait to a less ungodly hour to tell me this news, I was never close to Louis and my dad mentioned him less times than the digits on his hands.</p>\n\n<p>Still I listened to my dad as he recanted the events that took place. He had followed his evening routine like usual, a small glass of whiskey and a chapter of a Sherlock Holmes book in bed before dozing off. Only when his daughter, my great aunt Margaret, when to check on him before she went to bed she found him stone cold dead with the glass of whiskey shattered on the wooden floor by the bed.</p>\n\n<p>The funeral took place two weeks later, it was a simple and sombre affair – it perfectly captured the spirt of Louis. Only Margaret cried, comforted by her brother, my grandfather, Mitchell. Every family member I could remember that came from Louis surrounded the hole in the ground as the coffin was lowered.</p>\n\n<p>I was just bored and annoyed that I had to spend a rainy day outside in some boring old grave yard when I knew my warm bed was just a couple of hours drive away. The wake took place in the McKowell mansion. Not like the mansions on the TV with large swimming pools and glitzy walk in wardrobes. It was more of a grand shack. Four stories high, five if you included the basement. It was so old, and had been passed through the family for years. The land it lived on was vast and full of trees and ponds. I remember being younger, playing on the verge with my cousins at one the annual family reunions. We had kicked a ball too far into the bushes and trees, and when we went to go retrieve it my great aunt Margaret bellowed at us to stay away from the trees.</p>\n\n<p>The living room, ironic, was full of McKowell family members, some of them I knew and some I didn’t. I sat on my own by the large bay window whilst my dad reconnected with a few of his siblings. Our little family, my mum, my dad and me, weren’t really like the rest of the family. My dad married my mum and they had one child, where as everyone else seemed to have three or four or five children. I was glad to be an only child, too much noise and more attention.</p>\n\n<p>A knock at the door was answered by some Aunt or other, and in came an old man in a suit. A lawyer. Typically dressed in an ill-fitting suit whilst carrying a briefcase that had seen better days. Margaret greeted him with a confused puzzled look on her face. ‘’I wasn’t expecting you till tomorrow Mr. Neil.’’</p>\n\n<p>Mr. Neil gave a short nod ‘’I understand Ms. McKowell but I’m afraid the reading must take place today. Your father’s wishes were that everyone listed in the will be present and it seems that they are all here today.’’</p>\n\n<p>Margaret was not happy by this news, I found it amusing to see her thin lips purse up like some shrivelled old prune. She had never mastered lipstick, the colour always seemed to melt outside the lines of her lips and it was made all the worse by the pout she gave off.</p>\n\n<p>‘’Very well, perhaps in the dining room?’’</p>\n\n<p>He nodded, and everyone followed Margaret out of the living room. The dining room was large, the long narrow table stretched the length of the room. There were enough chairs around the table to seat 30 people though it was never enough when family reunions took place, which often meant the youngest of the family were relegated to make shift tables in the living room. Today though everyone crowded into the room like sardines. I found myself having to perch up on top of the buffet table, my mum joined me.</p>\n\n<p>If it wasn’t for the fact this this was a funeral I would have found the whole ordeal rather funny, I know mum did as she smirked at the sight of 40+ McKowell’s all dressed in black waiting to be bequeathed something of monetary value. She must often wonder what she married into, glad though that dad never cared for this charade of family love.</p>\n\n<p>The lawyer sat at the head of the table with Margret at his side of course. He opened his briefcase and pulled out a few files, and when he found the one he needed he opened it up ready to read.</p>\n\n<p>‘’I am going to recite the will left by the late Louis Grantham Bridle McKowell in which he has divided up his assets among various family members’’</p>\n\n<p>Get on with it I thought.</p>\n\n<p>‘’I, Louis Grantham Bridle McKowell, of sound body and mind make this will to bequeath my possessions to the people in my life who I believe will make the right decisions regarding it outcomes. May whatever choices you make reflect the true McKowell family.</p>\n\n<p>To my eldest child, Henry Bridle McKowell I give you my collect of mint condition pins valued at £500,000 along with the McKowell cottage in Scotland’’</p>\n\n<p>I looked at my great uncle Henry who sat at the table stunned into silence.</p>\n\n<p>‘’To his descendants you shall each receive £10,000.’’</p>\n\n<p>‘’To my second child, Mitchell Grantham McKowell, you shall receive the fine china and ivory boxes. Your descendants shall also all receive £10,000.’’</p>\n\n<p>I looked at my mum, my eyes wide open… £10,000… holy fu-</p>\n\n<p>‘’To my third child, Tiffany Hope McKowell-Mile, your mothers jewellery and her sewing box are now yours. Your descendants shall also all receive £10,000.’’</p>\n\n<p>‘’To my youngest child, Margaret Hope McKowell, who devoted her time and love to my care I give to you my library of first edition novels along with the McKowell land in Whitby along with its tenants which shall give you a steady income of £40,000 a year. As you are the only McKowell of my flesh to not have children I give you a lump sum of £250,000 to attain new dwellings for the remainder of your life.’’</p>\n\n<p>Silence filled the room, a question hung on everyone’s lips. What about the four walls we all stood in at that moment? Margaret also had this question, and pressed the Lawyer to continue. He look at the will in front of him with nerves and worry.</p>\n\n<p>‘’Finally, the McKowell Mansion and remaining assets. I give this to my great-granddaughter – Lucy Hope McKowell.’’</p>\n\n<p>In the flash of ten seconds a number of things happened.</p>\n\n<p>My mother gasped so loudly I felt my ear pop. Everyone turned to look at me at the exact same time. My father looked as if he was about to faint. My great-aunt Margaret stood up so quickly that she almost stumbled and the lawyer had to hold her steady.</p>\n\n<p>‘’WHY DO YOU GET THE HOUSE?!’’ Margaret bellowed, her bony finger pointed at me.</p>\n\n<p>..</p>\n\n<p>The next few hours flew by in a blur. The Lawyer answered every question he could to the best of his ability.</p>\n\n<p>‘’Was he really of sound mind?’’</p>\n\n<p>‘’Surely we can contest this?’’</p>\n\n<p>‘’I looked after him for all of his life, this is my house no?’’</p>\n\n<p>‘’What are the costs of owning this house because my daughter is only 23!’’</p>\n\n<p>Soon he had to make his escape, and I felt no wiser as to why I was given this mansion. The large Victorian establishment was so big that I don’t believe that I had ever seen each and every single room before. Now I owned them? Why me?</p>\n\n<p>Margaret had clung onto the will all afternoon as if doing so would change the entire outcome, and at some point my dad had managed to pull it out of her hand. He didn’t understand anything about wills or inheritance, he was just an IT manager for some big fancy office – but he thankfully knew a few people who did.</p>\n\n<p>‘’I’m going to get this looked at, and to try and fully understand what it means to own this place.’’</p>\n\n<p>‘’Yeah and we should really think about what we’re going to do with it as well because it’s too much. How much do you think its worth?’’</p>\n\n<p>My mum and dad spoke back and forth, seemingly ignoring me for the entire duration as we sat huddled in the corner of the kitchen away from the crowd. Finally I had enough.</p>\n\n<p>‘’Guys?!’’</p>\n\n<p>They looked at me.</p>\n\n<p>‘’I’m pretty sure I’m going to decide what happens to this place, not you two? I appreciate your help but maybe I don’t want to sell it!’’</p>\n\n<p>‘’Lucy this place is ridiculous, why don’t you just give it to Margaret?’’</p>\n\n<p>‘’Louis gave this place to me for a reason… I don’t know why just yet but I know he would want to me to think this through properly rather than rushing into any decisions. Let’s just think about it before we decided to sell it off. Don’t forget it is McKowell.’’</p>\n\n<p>..</p>\n\n<p>That night as we drove back home I found myself looking at the will for what must have been the 9th time that day. One line stood out to me. The passing light of the street lamps did not help me read it, I didn’t need to read it to hear the Lawyer say ’’I, Louis Grantham Bridle McKowell, of sound body and mind make this will to bequeath my possessions to the people in my life who I believe will make the right decisions regarding it outcomes. May whatever choices you make reflect the true McKowell family.’’</p>\n\n<p>Why me Louis?</p>\n\n<p>Part Two</p>\n\n<p>A few months had passed since the reading of the will, and I was no closer to understanding why I had inherited the mansion over my aunt Margaret. All the legal stuff went by quickly with me signing a bunch of documents officially making the property my own. My parents and I had felt for Margaret at first, guilt quickly set in by the time we had arrived home from the funeral as I realised that I had been given something that wasn’t rightly mine. </p>\n\n<p>Margaret had dedicated her life to looking after great grandfather Louis and when he fell ill in the last five years or so she became his nurse. So surely she should have been given the mansion? </p>\n\n<p>But that guilty quickly subsided within a week when every few hours the landline would ring from dawn till dusk, Margaret was determined to get the house and was going to contest it… that failed though when it was made clear that wills were pretty iron-clad. We disconnected the landline and then she would start ringing our mobiles, and then ringing my office demanding to speak to me. </p>\n\n<p>One day mum and dad and I decided it was time to go back to the mansion, hopefully a visit would jog some idea in our heads that would explain this whole ordeal. So one bank holiday weekend we packed our cases and headed north. </p>\n\n<p>..</p>\n\n<p>We arrived just as it began raining, Margaret stood on the porch waiting for our arrival with a face only a mother could love. She was dressed all in black like some widow, and what made it worse was that the dress was fit for only the Amish. I was pretty sure that there was a Bon Marche in the town only a half hour drive away. My mum had called her the day before to tell her we were coming and apparently that was a very undignified and rude thing to do. It took mum explaining that we could drop by at any time if we so chose as it was at my generosity she was still living there. </p>\n\n<p>I had thought about moving in myself – it seemed it could be easily done. I would only have to pay bills and the council tax for the area was pretty good so I knew I could afford it. Mum and dad seemed to like that idea as well, but I think that was because I was 23 and they really wanted their house to themselves. </p>\n\n<p>But we all agreed that it wouldn’t be fair on Margaret, and even the idea of rooming with her was laughable. </p>\n\n<p>.. </p>\n\n<p>She had been kind enough to set up the guest rooms for us, my parents slept in their usual room and for the first time ever I didn’t have to room with them as there were many other bedrooms free for me to use. I figured I would be in the room next door, so when Margaret guided me up to the third floor of the house I was a bit confused. </p>\n\n<p>The landing of the third floor was more of a room in of itself, whereas the landing to the second floor was just one long corridor. I had only ever gone to the third floor a handful of times and never in any of the bedrooms. I was taken through the double middle door of three on the landing. It was clearly Louis’s bedroom. </p>\n\n<p>‘’Auntie?’’ </p>\n\n<p>‘’You own this property, you have the room of the master. It is fitting.’’ </p>\n\n<p>I shook my head, this was too eerie to be in the room of a dead man. It was a large room with a grand four poster bed and a bathroom attached along with a walk in wardrobe. Nothing really had been touched besides the bedding which was freshly laundered. That didn’t change the fact that Louis died in that bed. </p>\n\n<p>‘’Auntie I’m not sleeping in here, at all. It’s not right. I’ll have the room next to mum and dad.’’ </p>\n\n<p>I turned to leave but Margaret gave a little cough, ‘’Not possible I’m afraid. The rest of the rooms are locked up and only opened when people visit. I spent all afternoon yesterday cleaning your parents room out, it will take me too long to clean another room.’’ </p>\n\n<p>I rolled my eyes. ‘’Then I will have the single bed in their room.’’ </p>\n\n<p>She chuckled darkly, ‘’Lucy you are 23, are you really going to sleep with your mummy and daddy when you have this room all to yourself?’’ </p>\n\n<p>..</p>\n\n<p>I found myself debating if to sleep on the floor or not once Margaret had left, it felt wrong to sleep in a dead mans bed. I also didn’t like the fact that Margaret was in the room next to this one. But even I knew that was silly, so to distract myself I decided it was time to learn more about this mansion, to try and uncover why it was now mine. </p>\n\n<p>Dad had spent a lot of his youth here, his dad and Louis were very close and back then there were maids in the house who would look after the children whilst the adults spent their time drinking and eating and laughing. Still he didn’t know much of the layout, so he was neither use nor ornament when it came to employing his navigating abilities. </p>\n\n<p>So mum, dad and I were as naïve as each other when we began to look around the house. </p>\n\n<p>Margaret didn’t like the like the fact that we were all walking about the house so freely, before Louis died there was an order to things. Now order was restricting to me. \n.. </p>\n\n<p>‘’I do not want to look in the attic.’’ Mum exclaimed clearly ‘’Shit will be haunted I bet you.’’ </p>\n\n<p>I chuckled, ‘’Come on, this isn’t a horror movie.’’ We were stood at the open door leading to the stair case for the fourth floor. More of an attic than a place to use daily. It was converted into a room but still the slanted roofs made it a rather inhospitable environment. </p>\n\n<p>‘’Dad you’ll come up?’’ </p>\n\n<p>He nodded but seemed unsure of it himself. ‘’I never went up there, I was kept in the nursery until I was 7 and then I was allowed in the play room. By the time I was 10 we didn’t really visit all that much besides for the family reunions.’’ </p>\n\n<p>‘’If it isn’t haunted there will be some dead bat or something, spiders at the latest. I can’t handle it.’’ </p>\n\n<p>I sighed and made my way up the stairs. Unlike the larger, grander stair cases this one was much more rickety. The walls were unfinished and the flooring was exposed wood. Dad followed me using the torch on his phone to light up the way until we found the light switch. The bulb barely lit up the room well enough but it did the job enough. </p>\n\n<p>The room was covered in boxes, chests, and a fine layer of dust. A mannequin of all objects stood at the far end of the room covered in a sheet. I pointed it out to dad who shrugged and seemed to have no idea what was going on.  </p>\n\n<p>We had barely been up there for five minutes before mum ran up the stairs and came into the room panting. </p>\n\n<p>‘’I was freaked out being down there on my own, don’t judge. Felt like something was looking at me.’’</p>\n\n<p>I was judging. </p>\n\n<p>The attic really didn’t reveal much in the way of any secrets, everything was pretty standard family storage. There was a box of old photos with a few albums nicely pieced together but they were generic family pictures. Some of the faces I knew, others were of people passed long before my time. There were some Christmas trees and some Christmas decorations all stored up at one end. </p>\n\n<p>I did find a large box of leather belts which had all been well used and loved, we found that strange and pretty funny. But something else struck me as odd, besides the mannequin was an empty spot and evidence by a dust free circle that something had been sat here for a while and recently moved. </p>\n\n<p>What was it? </p>\n\n<p>Later that night during dinner I felt myself thinking that I had missed something. We had explored all the unknown rooms hadn’t we? Questioning Margaret was futile, she was not willing to help us understand her father’s decisions at all. Maybe she thought I would grow bored and just let things be, but something in me felt that that idea would hinder her more than help her. </p>\n\n<p>..</p>\n\n<p>We retired to our prospective rooms later on, tired and full and relaxed with the idea to start exploring the more used rooms in the morning. Before I got to my room Margaret pulled me to one side, seemingly appearing out of nowhere. </p>\n\n<p>‘’I don’t want to tell you the secrets Lucy, I don’t know them all myself. But what I suspect is too much for someone so young. This house needs to die with me.’’ </p>\n\n<p>I frowned, ‘’Die?’’ </p>\n\n<p>‘’When I die this house must be destroyed, let all of its secrets leave with me.’’ She had gripped my arms at some point unbeknown to me, and I tugged myself free from her grip. </p>\n\n<p>‘’What secrets?’’ </p>\n\n<p>Margaret shook her head, she didn’t say anything else as she scurried away to her bedroom. I tried to follow after her but she locked her door quickly. For the first time ever in my life I saw fear in my Aunts face, her eyes wide with horror.</p>\n\n<p>..</p>\n\n<p>I couldn’t sleep no matter how much I tried. Everything about the situation made it impossible to sleep. The new environment, lying in a bed a man died in, the conversation with my aunt, the secrets of the house… </p>\n\n<p>At some point during the night I found myself walking around the bedroom. I found it odd how much life it had when its former occupant was so stoic and cold. Pictures littered the wall, some of them of family members and others of old paintings. There were two large bookcases up against the wall filled with books upon books. There was a set of drawers with a large box TV on it with a bunch of old VHS tapes and DVD’s to the side. Though no VHS player in site there was a battered DVD player. </p>\n\n<p>Facing away from the large bay window of the room was an old desk, one of those seemingly posh ones with a fancy green boarder. The chair was also grand and large, rather fitting for Louis. I sat in the chair, on the desk was an open journal filled with posh calligraphy writing. It was dated three days before Louis’s death, and it detailed his mundane routine for the day. I skimmed it hoping there would be something else of interest but alas I learnt nothing more of use than how Louis had had a prostate exam at the doctors. </p>\n\n<p>Then something caught my eye that I really surprised me. There was only one framed photo on his desk, and it was of me and my parents. He had a dozen family members so why us? I leant forward to pick it up and as I did I wacked my knee off of the corner of the drawers than from the desk. I cursed out loud, knocking over the photo in the process. </p>\n\n<p>I kicked the drawer out of frustration, and in doing so the bottom one opened up slightly. A beige box in the bottom of the draw caught my eye, so I opened the draw and pulled it out. It was the only thing in the drawer. A once locked drawer I might add, now unlockable due to its stupidity to hit me in my knee. </p>\n\n<p>Now what I am about to detail is sickening, but I feel it is important to relay the whole truth. I would not be doing so if I didn’t think it was pertinent… unfortunately it is. I often think back to this day, about all the ifs, ands, buts… If this hadn’t happened then maybe the next thing wouldn’t have happened and so on, all of which led me to that very moment of discovering this beige box. Beige on the outside. Not on the inside. </p>\n\n<p>I opened the box, inside it were neatly packaged and dated photos. They were bound up in string and stacked so the pictures couldn’t be seen. They seemed to be grouped in periods of five years or so. There was also a VHS tape unlabelled. There were also lots of documents dating back all the way to the early 1800’s. I couldn’t really tell what was on the earliest dated documents, the writing and the paper was too aged for me. However when it came into the 1940’s I could.</p>\n\n<p>They seemed to detail rituals, human sacrifice, ways in which people were tortured. I felt sick. I didn’t understand. No. I lie. I did. I just didn’t want to understand. </p>\n\n<p>I knew what was on the photos, before I had even began to untie the string I knew. </p>\n\n<p>I didn’t want to know. </p>\n\n<p>I hoped as I pulled the first photo out that I was wrong. </p>\n\n<p>I wasn’t. </p>\n\n<p>I didn’t know if it was a man or a woman, but I knew that it was human. Its heart was missing, it’s intestines hung out of its open body. </p>\n\n<p>I don’t know why but I was telling myself over and over that these weren’t real, they couldn’t be. That Louis had them because he was a fan of the horror genre maybe. But that wasn’t the case. They were real, because a young teenage Louis was in the photos. He was grinning in some as he held the organs of people. </p>\n\n<p>I came across one that for some reason made me gag. A young girl, strapped upright to a wooden cross of sorts. Holding her up were leather belts. My god. The ones I had found in the attic just earlier that day. I had touched them, and they had touched her… Just that connection was enough to make me want to burn myself. </p>\n\n<p>The box lay on my lap, almost proud of its contents. I pushed it off and stood up dry heaving. I couldn’t breathe. I didn’t want too. </p>\n\n<p>.. </p>\n\n<p>I managed to calm myself down after scrubbing my hands raw in the bathroom for ten minutes solid. I would have liked to shower but the bathroom was outdated and I couldn’t figure out the taps on the wall. When I finally emerged back into the bedroom I looked over at the mess on the floor I had caused from pushing the box off of me. I hadn’t noticed the black leather book earlier, and even though I didn’t want too I felt the urge to pick it. </p>\n\n<p>Engraved on the cover was the title: History of the McKowell Mansion – 1945. This book was 73 years old. The same age as my Margaret if I recalled correctly. </p>\n\n<p>You know when you get that feeling someone is watching you? Well at that exact moment that feeling shook through my body like nothing ever had before. I was hot and cold all at the same time. The hair on my body stood up on end. I looked up and by the door to my room was a woman in white – a blink later and she was gone. </p>\n\n<p>Dread filled me up, and I fainted onto to the contents of the box. </p>\n\n<p>..</p>\n</div>\n","author":"ITry17"}