{"rank":"12","title":"and beggars shall ride: a monologue","id":"8k3zdg","url":"/r/nosleep/comments/8k3zdg/and_beggars_shall_ride_a_monologue/","time":"1526561273000","body":"<div class=\"md\"><p>I am sitting on my couch, in the living room of my home, watching some terrible program on the television I bought myself two Christmases ago.</p>\n\n<p>I am so far from my home that the English language doesn’t have words to describe where I am.</p>\n\n<p>Both of these statements are simultaneously true.</p>\n\n<p>My name is Alastair Cole and I am a fool.</p>\n\n<p>I know this now, and rather wish I’d known it before I ended up in this place that both is and is not my home. I wish I’d known it in time to let the me who belongs to this world live out his pointless existence in peace.</p>\n\n<p>I have stolen my own life. </p>\n\n<p>Or rather, I have stolen the life of another version of myself, and I want nothing more than to return it to him. Wherever he may be.</p>\n\n<p>That’s something I don’t really care to dwell on, but that torments me nonetheless: what happens to the version of me who belongs to a given universe when I take his place? Does he swap to the world I’ve left? Go into some sort of cosmic stasis until I’ve left his life back to him? Vanish entirely into the void, never to be heard from again?</p>\n\n<p>If all this sounds like complete and total lunacy, believe me, you have my full support. After all, I thought I was going mad at first too. From that first morning that I awoke in a bed that both was and was not mine, I have doubted my sanity, questioning reality with an ever-increasing skepticism.</p>\n\n<p>But it is true and undeniable: I have fallen through space or time or something else equally science-fiction-esque and ended up in a parallel universe, living out a parallel version of my life. And not just once nor entirely by accident, at least not in the end. </p>\n\n<p>It began with a wish. A curse. A stupid bit of childish whining about everything in my life that hadn’t gone to plan. I don’t even recall what had happened to put me in such a state but there I was, feeling short-changed by the universe. I drifted off to sleep that last night with my brain turning over every failed business move, every unhappy relationship, every bit of embarrassment and humiliation and regret and examining their dark undersides, like children picking up rocks to squeal at the dirty squirming things underneath.</p>\n\n<p><em>“Things should have been different.”</em></p>\n\n<p>That’s the last thought I remember having before sleep claimed me - and yes, it sounded as petulant then as it does now.</p>\n\n<p>And when I awoke the next morning, things <em>were.</em> Different, I mean, not petulant. Only in small ways - the sheets on my bed, the lunch I’d packed the night before, the arrangement of items on my desk at work. Little things, the kind you justify without a second thought. <em>“You changed the bedclothes and forgot,”</em> my mind assured me. <em>“You must have been on autopilot when you were doing your meal prep.” “Josie probably stole your pens again.”</em></p>\n\n<p>Occam’s Razor, right? The simplest answer is probably the correct one. And frankly, absent-minded sheet-changing is a <em>lot</em> simpler an answer than, “Obviously you dimension-hopped in the middle of the night, welcome to your new life.”</p>\n\n<p>But that was, of course, exactly what had happened. While trivial issues like missing stationary supplies could be explained away, I had no such rational explanation when I realized that entire <em>people</em> were missing from my life. </p>\n\n<p>I noticed that particular fact when I tried to email Josie about messing with my desk. Typing “j” was usually sufficient to automatically pull up her email address, but this time, the screen only displayed results for the dozen or so other employees whose names begin with the letter J. I scanned them, looking to see if maybe her address had changed, but there was no Josephine Gilmore to be seen on the list. I tried her last name to similarly unhelpful results.</p>\n\n<p><em>“Someone’s done A Thing and it mucked up the directory,”</em> my helpfully denialist brain supplied. I wasn’t sure what that Thing might be, but that was hardly <em>my</em> concern, now was it? I was an accountant, not an IT professional. I manually entered her email address, along with a message that I’d buy her a pack of pens of her choosing if it meant she left my things alone, and sent it.</p>\n\n<p>It popped back seconds later as undeliverable. “Invalid address” it said. “No such user.”</p>\n\n<p>And that’s when things got weird. Or rather, that’s when I accepted that weirdness that had been thrust upon me. It turned out Josie - whose number also no longer appeared in my phone -  wasn’t the only person to have seemingly vanished from my life. On my return home, the new security guard by my building’s front door looked at me very strangely when I asked where the usual night guard, Frank, was that evening.</p>\n\n<p>He didn’t know any Frank, and assured me, rather nervously, that he was just manning his post like he did every evening. He wasn’t wearing a name tag. I didn’t ask about it, since he clearly knew me and thought I was crazy. I made up some unconvincing lie about mixing him up with the guard at work, muttered something entirely truthful about it being “one of those days,” and hurried inside.</p>\n\n<p>And so life went on like that for nearly a week. I noticed more changes. Some, like the contents of my shoe rack and the brand of detergent in my cupboard, were small. Others, like my brother suddenly being unmarried and childless, were larger and harder to ignore. I managed to <em>really</em> piss off my mother by asking after George’s kids when I called her on the first Sunday of my strange new life.</p>\n\n<p>“That’s not funny, Alistair!” she shouted at me, and I knew I’d screwed up because my mother hadn’t used my full name since she caught me sneaking in late as a teenager. I’d always been Aly to my family.</p>\n\n<p>“I - ” I stammered. “Sorry mum, I wasn’t trying to be funny. I just wanted to know how... You know what? Never mind.”</p>\n\n<p>She shouted at me for a moment more about my brother’s evidently recent and messy divorce and custody battle before petering out. She sounded tired.</p>\n\n<p>“Sorry, Al,” she sighed. “It’s just been so hard since - well, since your father...”</p>\n\n<p>And that was how I learned that, in this sick version of reality, my father was dead. I made my excuses and ended the call.</p>\n\n<p>My dad — my healthy, happy, just-retired-and-loving-it father — was dead in this world, and I hadn’t known. By the sound of it, my brother’s life was in shambles, and my little nieces were gone, too. Add to that Josie’s vanishing, and this world was no better than the one I’d came from. It was, in fact, considerably more horrifying.</p>\n\n<p>I went to lay down, counting on sleep to make everything go away for a little while.</p>\n\n<p>When I awoke, my sheets were back to the way I was certain I had left them. For a moment, I felt like Ebenezer Scrooge at the end of <em>A Christmas Carol.</em> It was all a dream! I could still be saved! Quick, lad, run and fetch the prize turkey! Grabbing my phone, I scrolled through the contacts. Josie was back, as was my sister-in-law Claire, complete with a picture of the girls as her contact photo.</p>\n\n<p>My father answered on the first ring, and hearing his voice brought a rush of tears to my eyes.</p>\n\n<p>“Aly? What’s the matter?” he asked, sounding concerned. </p>\n\n<p>I tried to make my voice sound as normal as possible before telling him that I just wanted to check in and see if all was well. He said things were fine, that he was about to head out the door to attend a fitness class at the community center. </p>\n\n<p>“That’s new!” I laughed. My aimless gaze settled on a painting hanging next to the closet door. Strange, I thought I remembered hanging it out by the - </p>\n\n<p>“Well, after your mum passed, your brother thought it would be good for me to get out a little,” replied my father. A high-pitched ringing settled into my ears and damped the sounds of the world</p>\n\n<p>And just as I had done with my very-much-alive mother earlier that day, I made some stupid excuse and hung up on my father.</p>\n\n<p>“This isn’t better!” I shouted at the ceiling, startling a pigeon away from my window.</p>\n\n<p>And so began my wandering. I’m practically a professional dimension-hopper these days, a cosmic vagabond. I keep going, keep looking for the one place where everything is perfect.\nThe jumps seem to be triggered by emotionally-fraught wishes, like a twisted sort of genie. All I have to do to pop out of one reality and into another is really, really want it. But that is the limit of control I seem to be able to exert over the proceedings. I can initiate leaving, as long as I’m both falling asleep and in mental shambles over wanting to be anywhere else, but I cannot control where I end up. And no matter where I go, I never end up back in my original life.</p>\n\n<p>Some of the universes haven’t been too bad. In one, I was CFO of my company. That was pretty neat until it turned out the original me in that universe was embezzling heaps of money and left me to take the fall for it.  I left that world from a jail cell. Most universes, my job remains unremarkable, although the details change. Occasionally there are major differences - I’m a dentist or a postman or unemployed. The changes are never anything exciting or adventurous. I try not to think what that might say about me as a person.</p>\n\n<p>In a few of the universes, I have a boyfriend or girlfriend. In one I had a wife <em>and</em> a boyfriend. That was interesting. These partnered worlds are the hardest to assimilate into seamlessly, as there’s so many more little nuances I have to be able to perform correctly. There is no room for error. More than once, I’ve ended up feeling like I was starring in some terrible, wacky body-swap comedy film, but without the witty dialogue - and <em>with</em> a partner who was convinced I was cheating on them.</p>\n\n<p>Family comes and goes, though thankfully not with the devastating frequency of my first two jumps. In some places, my brother is my sister; the children fluctuate. In a few, I’ve had additional siblings, which was <em>weird</em> to get used to. Most people don’t suddenly become big brothers at the age of 35. By and large they’ve all been lovely and I’ve left them all behind.</p>\n\n<p>Every place has held me for at least a few days, with the exception of the one where I popped in to find a noose and readied chair sitting in my closet. I got out of that one in a matter of hours, and try to forget it, lest I give myself nightmares.</p>\n\n<p>All of these worlds, all of these alternate lives and glimpses into the what-may-have-beens of my existence, have brought me to this moment, on this couch that both is and is not mine, in this living room in a house both familiar and utterly alien. I am looking at the television that I bought two Christmases ago as it airs an episode from the 24th season of Friends. I wonder who I am.</p>\n\n<p>My name is Alistair Cole, and I have lived a thousand lives in less than a year. Some things are better now, some are worse, and all feel increasingly remote and pointless. Why bother learning the particulars of yet another set of relationships? It’ll only take a few wrong details before they start to get <em>concerned.</em> Why bother doing my job? If I’m successful, it’s on another man’s merits; if I’m a failure, I’m taking another man’s blame.</p>\n\n<p>From my seat on not-my-couch, I can see out the window. It’s a beautifully sunny day, warm and inviting.</p>\n\n<p>The grass here really does look greener.</p>\n</div>\n","author":"HephaestusHarper"}