{"rank":"5","title":"Mirror, Mirror.","id":"8k48tl","url":"/r/nosleep/comments/8k48tl/mirror_mirror/","time":"1526563682000","body":"<div class=\"md\"><p>Is this thing on? Look we have to get this right, down to the letter because I may not get another chance. I thought you said you knew how to run a board? Look, it&#39;s a simple mic setup, just hit record when I tell you, okay....are you sure?</p>\n\n<p>Okay, well, my name is David, my last name is irrelevant, it&#39;s gonna change soon anyway. Maybe my first name too...look, what I&#39;m about to tell you is gonna sound crazy but I need you to listen. The more people that know...okay, get to the point...I&#39;m trapped in a &quot;loop.&quot; I&#39;m recording this so my friend here can transcribe it out online for me when I&#39;m gone and I don&#39;t have a clue what you can do to help, but it&#39;s what I thought of after, damn what&#39;s it been now, 20 years? </p>\n\n<p>In 1998 I lived in a house with a lot of mirrors. My parents rented the place from a crazy old man that thought it was an interior design masterpiece, but it always creeped me out. I even had the damn things in my room, but we were told we couldn&#39;t take them down. After about 5 months I started waking up in cold sweats and having sleeping problems. A couple months after that, I woke up in the middle of the night and in one of the mirrors I could see...well, me...but it wasn&#39;t me...I know how crazy that sounds. I was lying in bed but the other me was standing there, staring at me from the other side. He had a smirk, almost a full grin but dark black eyes and his skin...it had what looked like tattoos...red tattoos that looked like scars from a lightning strike. He stared at me for what seemed like hours then started taking steps backward until he was out of sight. The next day I begged my parents to take the mirrors down but they wouldn&#39;t do it. They never believed me about what I saw. </p>\n\n<p>A week went by and I didn&#39;t see him again, but I was still having trouble sleeping so I hung a sheet over the mirror with push pins and tried to forget about it. About 2 hours later I felt someone slap me in the face hard enough to knock me out of bed. I crawled backward until my back hit the wall and frantically reached up, feeling for the light switch until bright white filled my unacclimated eyes. There was no one in my room with me as I looked around in a level of fear I haven&#39;t felt before or since. What I did see was the sheet I had pinned to the wall moving, as if were hung on a clothesline, blowing in a non-existent breeze.</p>\n\n<p>I stood up on shaky legs and walked over to the mirror, pulling the sheet off to reveal my other self staring at me with contempt. I froze, unable to run or even move. He just stared into my eyes, that eerie grin still present and what I had thought were tattoos were now clearly veins and capillaries showing through his pale skin. I watched as his hand moved slowly as he touched the glass of the mirror, making a sound like someone tapping a wine glass. He kept hitting it harder and harder until the glass shattered all over my floor. I silently prayed that my parents heard the crash and would soon be at my door to save me from this nightmare, but they never came. My other self was soon walking through the aperture, grabbing me by the wrist and dragging me back. He forced me through the mirror frame, and the glass slowly reformed, piece by piece from the floor, glowing orange like it had been heated. Looking back I should have tried jumping back through, but regret does nothing for me now. What&#39;s done is done. </p>\n\n<p>I watched as my doppelganger stretched his arms wide and yawned, the red veins disappeared and his eyes turned from black into my green eyes. He shut off the light in my room and I watched as he got into my bed and fell asleep. The bastard took over my life and I want it back. </p>\n\n<p>I&#39;ve been in this living nightmare longer than some of you have been alive. That first...What would you call it, dimension? World? It was pretty bad, sort of a mix between a dream and a horror movie, everything was dusty, paint was peeling off of buildings, cars were broken down....and the fog....the fog was endless. I learned to &quot;jump&quot; through mirrors after about a year, but never ones were I could see other people. I&#39;ve been arrested for &quot;burglary&quot; after getting caught on security cameras but I always plead guilty so I can get a cell and ask for a full length mirror. What&#39;s the harm in that, right? I&#39;ve been through countless dimensions in 20 years but the loss has been that some of my family is dead and once they&#39;re gone, they&#39;re gone. No matter how many &quot;jumps&quot; I do, whoever dies is always dead in the next jump as well. I&#39;m done jumping. I&#39;m only having this transcribed because I want you to know that if you see someone climbing through your mirror tonight, don&#39;t be afraid. That is, of course, the person coming through looks like you. </p>\n</div>\n","author":"DeusEx-Machinist"}