{"rank":"78","title":"Just Another Day In Salem (Part 2)","id":"8k4itg","url":"/r/nosleep/comments/8k4itg/just_another_day_in_salem_part_2/","time":"1526566102000","body":"<div class=\"md\"><p>Part 1 is <a href=\"https://redd.it/8jpzzy\">Here.</a></p>\n\n<p>I spoke aside to Kristobol. “You gonna open the door, or what?”</p>\n\n<p>“Uh, right.” He moved to the door and unlocked it so the policemen could enter. It was Officer Lang and Sergeant Kalashnikov, a new young guy and an old hand, respectively. We all called Kalashnikov “A.K.” for obvious reasons. Kristobol tried to act cool, and failed. “Oh, hello Officers. How can I help you?”</p>\n\n<p>A.K. brushed past him and walked in as he spoke, Lang close behind. “Good afternoon, Mister Binglehoff. Everything all right in here?”</p>\n\n<p>“Uh, sure is! Why, uh, why do you ask?”</p>\n\n<p>“We received a call from a concerned citizen, asking us to make a wellness check at this shop. They said you might be in distress.” He looked over at Bethany and I and made a scrunchy face. “Hi, Nat. Who’s your friend?”</p>\n\n<p>Bethany spoke first. “It’s me, Sergeant Kalashnikov! Bethany!” Then she looked at Officer Lang and got all shy. “Hi, Denny.”</p>\n\n<p>Officer Denny Lang blinked hard and looked at Bethany in surprise. “Bethany? Is that you? Wow, I never would have recognized you. You look great! Are you going to a party?”</p>\n\n<p>Even with her new deep-red complexion I could see that Bethany was blushing. “Oh, no, nothing like that. I -”</p>\n\n<p>I cut her off. “She’s doing a photo shoot for the Halloween Ball! Getting a head start on things. Don’t you love the shoes? Like real hooves.” I stepped in front of her to keep them from getting a better look, Bethany peeking out to catch Lang’s eye.</p>\n\n<p>“OK”, AK said. “Looks like we got another prank caller. Sorry to bother you all.” They made to leave, but AK stopped on the threshold and said to Bethany, “Best you don’t go traipsing around Salem like that, Bethany. Someone might throw the Black Book at you.” He was smiling when he said it, but there was a look in his eye that was harder than it needed to be. Lang gave Bethany a little wave as they left.</p>\n\n<p>Kristobol locked the door behind them. “Phew, that was close. OW!” He got a chukka to the ankle from me.</p>\n\n<p>I was livid. “Close? Are you dense? AK saw right through us. When a Salem cop mentions the Black Book, you got trouble.” Most of you don’t know that there’s a separate book of laws in Salem called the Black Book. It was composed over a century ago to give the town a way of dealing with reckless magic use, “reckless” being defined as anything that might tamp down the tourist trade. “If she had been out on the street he would have taken her in. That was probably what Denise was hoping for you, sending the cops here.”</p>\n\n<p>“I can’t stay like this”, Bethany said with a worried clop of her hoof. “I have to take my grandma to church on Sunday. I don’t think they let devils in church.”</p>\n\n<p>Kristobol gave her a thumbs-up. “No worries, hun, we’ll change you back.”</p>\n\n<p>I snorted. “We? When did you get crafty? Don’t make promises you yourself can’t keep. And, I’ll ask you again, who is Denise?”</p>\n\n<p>If circumstances were better I would have enjoyed watching that pompous ass squirm. As it was, it only annoyed me more to wait until he finally mumbled, “…my girlfriend.”</p>\n\n<p>Bethany’s eyes went bright. “Oh, wow! You have a sweetheart? That’s so great! Wait, how come you never talk about her?”</p>\n\n<p>More squirming. “Because she’s my ex-girlfriend, from Idaho. Well, really, she’s my fiancé. Ex-fiancé. She’s the reason I left Boise and came here.”</p>\n\n<p>I looked him right in the eye. “Did you get her pregnant?”</p>\n\n<p>“No! No, I would never do that. No, I…I kinda stood her up.”</p>\n\n<p>Bethany and I said in unison, “At the altar!?”</p>\n\n<p>It’s a weird thing, to watch a tall man cringe. “No, not exactly. We had about a week to go. But, I had to do it! I couldn’t marry her! Not after what she told me about…”</p>\n\n<p>I tapped my chukkas on the floor. “About what?”</p>\n\n<p>“About her family.” He paused again, a mournful look on his face. “After high school my life went nowhere. Five years of failures not even worth talking about. So, when Denise walked into the used bookstore where I worked part-time and asked me out it floored me.  I thought, this was it, my life was about to make a big turnaround. </p>\n\n<p>“Her dad was rich, really rich, but he welcomed me into his home like an old friend. Her mom was the same. Denise is an only child, so all their hopes and dreams were on her being happy. I thought I’d ended up in some romance novel, living happily ever after.” He stopped, and sighed.</p>\n\n<p>I gave it some thought. “Okay, let me guess: Satanic bargain? He got all his money by selling his soul?”</p>\n\n<p>Kristobol shook his head. “Older than that. Pre-Christian, pre-Jewish. Some kind of god-monster from the desert. I couldn’t pronounce the name if I tried.”</p>\n\n<p>“Best not to, you might get its attention.”</p>\n\n<p>“Yeah. Anyway, her great-granddad began worshiping it when he was over there in the Army in World War 2. He kept it up when he came back to the farm after the war. Seems he did real well for it. Each son kept it up, but now there are no sons, only Denise. I guess this old demon is kinda sexist. Male priests only.” </p>\n\n<p>Now he went real quiet for a moment. “I had to attend one of their rituals in prep for the wedding. It was the big one they do every spring, to ensure good crops. I don’t know who the fella was they brought out, but when I saw what they were gonna do to him, I left in a hurry. NOT my scene!”</p>\n\n<p>“No one tried to stop you?”</p>\n\n<p>“Not that big a crowd. Only them, a few friends and some people from the farm. They were all busy when I ran for it. Her dad was actually kinda understanding afterwards. Said I’d get used to it. But I didn’t want to. I got in my car and I drove ‘till I got to the east coast. Then, I came here. Figured Salem was the best place to go. You know, hide in plain sight. Guess it didn’t work.”</p>\n\n<p>I was about to point out that, as far as hiding in plain sight goes, the international podcast might have been overkill, when Bethany started prancing in a little circle, her hooves making little clip-clop sounds, while scratching her stubby tail and muttering, “Itchy bum, itchy bum, itchy bum…” </p>\n\n<p>I shook my head, turned back to Kristobol. “That explains a lot. But what’s all that in the note about messing with forces you can’t control? What did you do before you left?”</p>\n\n<p>He threw up his hands. “Okay, I didn’t just leave. Her dad had given me a copy of one of their spell books, and I thought I’d use their own magic against them to break off the engagement. You know, something like a Neighbor-Be-Gone spell or something. Most of what was in there was pretty harsh. What I could read, anyways. Not a lot in English, and most of that was useless. I didn’t want to turn them into muskrats or anything, I just wanted them to leave me alone! </p>\n\n<p>“Then, at the back, I found a few pages in French on how to make this charm. I took a year of French in high school so I thought I could hack out a translation and give it a go. The description was something like, ‘Make a person start a new life with the Devil’. I figured, she’s already worshiping a devil, this devil, so what’s the harm?”</p>\n\n<p>“The harm”, I interrupted, “is that you screwed up the translation, didn’t you?”</p>\n\n<p>“Beyond belief. I found out later the charm wasn’t to begin a new life <em>with</em> a devil, but <em>as</em> a devil. And I found it out when she picked up the charm and…” He waved a hand in Bethany’s direction, then slapped both his thighs in exasperation.</p>\n\n<p>We all stood in silence as I thought things over. Denise was bound to learn sooner or later that her plan had backfired. What would she do next? Nothing good, that’s for sure. She was a magical adept with some kind of ancient demon as a patron. The damage potential was immense. Then, we had Bethany to worry about. The transformation seemed to be purely physical, thankfully, but her troubles didn’t stop there. We had to protect her from the local commerce wardens and their Black Book. And what was her Gram gonna say when she pulled up on Sunday and, and – </p>\n\n<p>“Bethany, smile for me, will you? Thanks.”</p>\n\n<p>– when her granddaughter pulled up and flashed those fangs at her? No, this had to be fixed, and fast.</p>\n\n<p>“Okay, this is going to require some work. We need protection spells, countermeasures, and a way to change Bethany back. Do you still have that book they gave you?”</p>\n\n<p>“Yeah, it’s at my apartment.”</p>\n\n<p>“Go get it. Bethany, where are your clothes?”</p>\n\n<p>“They fell apart when this happened.” She pouted. “Those were my favorite boots.”</p>\n\n<p>I glanced at her hooves. “Yeah, well, try not to think of that right now. Grab your coat, you’re sticking with me.” She nodded and went into the back. To Kristobol, “We’re going back to the Cauldron. Come over when you have the book. I need to make some phone calls. First priority is to find someone who reads French better than you.” </p>\n\n<p>Bethany returned wearing a knee-length puffy red winter coat and wielding a handbag with Chococat waving from the side. “Ready.”</p>\n\n<p>“Good. Let’s go.” I turned towards the door but faltered as a wave of black light swept my vision and an unpleasant taste coated my tongue. A moment later it faded and everything went back to normal. It took a moment to shake it off and focus.</p>\n\n<p>The others looked on, concerned. Kristobol asked nervously, “What is it?”</p>\n\n<p>I turned to look at them both. “She’s here.”</p>\n\n<p><a href=\"https://redd.it/8kl28o\">The story concludes in Part 3.</a></p>\n</div>\n","author":"TheAncientMarinade"}