{"rank":"10","title":"Don’t Deal with the Devil","id":"8k4p1o","url":"/r/nosleep/comments/8k4p1o/dont_deal_with_the_devil/","time":"1526567561000","body":"<div class=\"md\"><p>I’ve always been on the fence about religion, magic and things like that. I believe more in science than those things, but I still wear a cross and go to church and all that. I’ve always had that creeping fear when I go into a dark room, or when I’m home alone at night, but now it’s just been emphasized. </p>\n\n<p>Anyway, that doesn’t come in until later. A few months ago I had a major falling out with my friends. The 7 of us have been close friends for years, always hanging out chilling and that kind of stuff. Anyway, one of my friends had a twin sister who I started talking to. We had a pretty good thing going until I managed to mess things up. As a result, her brother, let’s call him P, stoped talking to me. This crushed me and soon after I was able to muck things up with the rest of my friends.</p>\n\n<p>It all climaxed one night when all of us were together. Words were had and in my rage I charged P.  We fought and I ended up kicking the shit out of him. I went home and had a near mental breakdown. The rest of my friends began to shut me out completely and I had lost my only friends. I tried to find a solution any way possible, but they all turned up dry. Then I did something I didn’t think would ever work. I looked up multiple ways to make a Pact with the Devil. </p>\n\n<p>After hours of searching, I settled on one, making sure it would have the least amount of consequences. I drove to the nearest paper store and bought Parchment, Ink, and a Feathered Quill. I went to my room and made sure I was indeed home alone (It was 12 at night and my parents were away for the weekend and my brother was sleeping over a friends’ house). </p>\n\n<p>I sliced my wrist, dripping the blood into a bottle with the ink. I dipped the Quill into the bottle and began to write my request on the parchment. </p>\n\n<p>“I (John Smith) Request to be sent back to February 15, 2018 to mend the relationships between myself and my friends in exchange for my mortal vessel.”</p>\n\n<p>I folded the parchment over and burned it with a lighter. The first sign that things were going strange was that the paper immediately dissolved into flame, not leaving a speck of ash. I waited for an hour but nothing happened. I thought the wish was a dry well so I went outside and got stoned. </p>\n\n<p>After watching a few movies, I went to bed around 3:30 in the morning. When I walked into my room I saw a black mass in my corner. I was high as a kite so I thought nothing of it. I believe my exact words were “hahaha nice” As soon as I dropped on my bed I was out cold. </p>\n\n<p>That night I had a dream. More of a nightmare actually. I was watching me and P go at it, but from a 3rd person perspective. After the fight was over I followed myself to my car. It was hard to see with the snow pounding, but under the streetlight, I saw a dark figure. The past version of me noticed the figure and froze. </p>\n\n<p>The figure lunged at me, enveloping myself in a smog of dark smoke. I could feel a weight in my chest as I tried to scream. I screamed as loud as I could. But nothing. No sound was made. The mass slowly made its way into my mouth and down my throat. I could feel it too. Choking me. As it finally disappeared into my body, I watched myself turn around, almost looking at me, as if I knew I was there. </p>\n\n<p>Then it smiled, the grossest smile I’ve ever seen. And my eyes. Oh my god my eyes. I’ll never forget the horror of my eyes. Where the white should be was the darkest black on the planet. So dark it was absorbing all the light around it. My piercing blue eyes, crimson red. I blinked and my eyes turned back to normal, but they looked duller than usual. I tried to move, screaming as loud as I could and with everything I could muster. </p>\n\n<p>Then I woke up. I knew something was wrong when I felt the empty void in my chest. My mom was standing over me frantically asking what’s wrong. I asked her what she meant. She said She could hear my screaming from down the hall, and that’s when it hit me. She’s still supposed to be down the cape. I asked her what the day was. She said it was Friday night/Saturday morning. I looked at the clock. 3:30. </p>\n\n<p>I told her I just had a nightmare and she went back to bed. I started panicking. I put on sweatpants and a sweatshirt and decided to go for a walk. When I opened the door, I was horrified by what I saw. </p>\n\n<p>Snow. </p>\n\n<p>It was May.</p>\n</div>\n","author":"godleftme_unfinished"}