{"rank":"0","title":"The Carnival of Fools Part Three","id":"8k4w00","url":"/r/nosleep/comments/8k4w00/the_carnival_of_fools_part_three/","time":"1526569152000","body":"<div class=\"md\"><p>All stories are related - please read up on any or all from my page as I can&#39;t link it - I&#39;m super bad with computers but it makes a lot more sense if you read all the stories in any order.  Some are true, some are blended, but all relate.  Hope you enjoy.</p>\n\n<p>We get set up onto the stage and it’s just the two of us and as far as I can tell there is no backdrop. </p>\n\n<p>The faceless men throw formless objects into the middle of the stage, and my first instinct is to jump on anything that’s offered here.  I want to cause pain and death’s giggle echoes in the background. </p>\n\n<p>I grab mine and it immediately begins to transform.  It’s a remote, like for any television that would have existed way back in the day – just a few buttons on the thing.  At the top of it is says ‘Amy’ and at the bottom ‘Langler’.  I assume this is her full name and I think I get the gist of the remote now but I shift my gaze over to Amy to see what she got her hands on.</p>\n\n<p>Fuck.  </p>\n\n<p>Amy’s begins to materialize as a bottle but I want to go first so fucking bad I’m fuming because I know what lies at the bottom of that bottle and I won’t feel it now, not when I’m so close to fucking up Amy.  </p>\n\n<p>I decide to press play and Amy stops dead in her tracks.  </p>\n\n<p>“Dad?”</p>\n\n<p>She stares right past me and I can’t see a goddamn thing but I can hear something, an echo of a voice.</p>\n\n<p>“Why did you do that to your mother Amy?”</p>\n\n<p>“Dad – I’m so sorry, I, I don’t know what to-“</p>\n\n<p>“Did you enjoy it?”</p>\n\n<p>A body materializes wearing jeans and a tee shirt and I hear the fucking smile behind the back of this thing, knowing full well who just jumped in.</p>\n\n<p>“No dad, of course I didn’t, I never wanted to bring this to you and mom, this group seemed so natural for me I would have never hurt you!”</p>\n\n<p>“But you hurt me so bad!” </p>\n\n<p>Death can barely finish that little sentence before everything shakes with his laughter but an octave lower which makes it a bit sinister but it’s still basically an adult giggle so I just stare as Amy screams and throws the bottle to the floor in frustration and it shatters.</p>\n\n<p>Ah, I’m totally fucked.  Can’t wait for death to come in and say hi.\n“Well hello then!”</p>\n\n<p>I stare up at a human liquor bottle.  There’s no other way to explain it, it’s like a human body that’s see through but pretty, like all our organs were done by human artists and there’s color and of course the unmistakable tint of whiskey.  </p>\n\n<p>Wonderful Mr. Death is only recognizable because of the goddamn hat and I see Amy is breathing in a corner and I begin to get furious.  I can’t have this bitch beating me, or letting her let death beat me.<br/>\nFuck that.</p>\n\n<p>With these thoughts I lunge at the bottle, trying to break any part to drink.  I do and it comes surprisingly easily, but instead of liquor it’s gore.  And there goes the whole body.  It’s still booze in there, just, well, it’s sitting with your stomach and kidneys and all.  </p>\n\n<p>But still, it was like the arm was made to come off and the finger for a shot glass.  It’s filled with gore but I won’t back out of this challenge so I take sip after sip from the finger until I’m drinking from the hole of where the arm came off, so satisfied, so drunk, covered in gore, and so much more angry.  </p>\n\n<p>This is that kind of drunk that gets in your blood, in your brain, gets you into prison or killed and I see death grinning from his seat in the audience.  </p>\n\n<p>“Thatta boy.”</p>\n\n<p>The thought reverberates in my skull and I almost lose balance but remember the arm.  And then I remember Amy.  I smash the arm on the ground where it breaks like glass – shit I was just testing to see what it was actually made of up here on the stage – and now I have a shard of glass the size of my forearm in my hand.  Amy lunges for the body and breaks the whole thing, toppling it to the ground.  She grabs a shard, running at me when I press play again.  </p>\n\n<p>Never forgot that remote.</p>\n\n<p>She falls backwards like someone pushed her and starts to scream and as I hear death laughing I run forward and plunge the shard into her stomach, then again, and she groans and starts to bleed from her mouth so I stab her in the neck with all the anger I ever felt from all my lifetimes and she falls back, seemingly dead.</p>\n\n<p>“Well done John!  How about we give a hand to our victor here!”</p>\n\n<p>A huge round of applause fills the stadium and I turn to look at the crowd, beat to hell, frightened, furious, and confused and see Amy sitting in the seat she was in before the fight, looking absolutely sick.  Like she might die again sick.</p>\n\n<p>“Not possible as you know Mr. Brutal!  You absolutely killed it out there John, I am so proud of you.  I just might let you come into the bowler hat with me one day, just to show you the true circle of the dead.  Some places are nicer, really.  And you might see them.  But you’ll always come back here.” </p>\n\n<p>He cackled and I just started forward blankly, now magically from my seat again, at the stage and seeing a new fight play out.  </p>\n\n<p>I couldn’t even feel angry.  I just felt exhausted.  Death put his arm on my shoulder and just stayed like that for what seemed like an eternity.  I have to get out of here.</p>\n\n<p>“I’m sorry John, it just doesn’t work like that.”</p>\n\n<p>“Then how the fuck does this work?”</p>\n\n<p>At this point I’m completely exhasparated and have no idea what to do.  I feel like I’ve lived lifetimes in the kingdom of death.  Everything I’ve been through feels like it’ll break me to the core.</p>\n\n<p>“No way son!  I’ve got a surprise for you.  You won’t enjoy the first part but it’s necessary for you to continue onwards if you want to see the other plains of the dead.”</p>\n\n<p>With that, death left in a flourish and I was once again on a stage but a new one.  One that extended into a beach.   A beach I know very well, where I used to boogey board with an old friend.  And now \nI know the plan.</p>\n\n<p>I start walking towards the water and see two young kids boogie boarding and laughing and building sandcastles and I recognize myself there, happy and sincere.  I bite my lip so I don’t tear up in front of death but he knows and laughs and offers a very kind ‘ohhh my boy’ before becoming smoke again and disappearing.  All I see is a happiness I couldn’t get back even with the bottle.</p>\n\n<p>I see Joshua die.  This time I see it.  When I was a kid I just lost him and I never meant to, I tried to kill myself because of this but I guess survival and drugs are in my genes.  All I know as of now are the waves sucking Josh under, taking his board for a minute and then releasing it without him.  I see him crack his head underwater on some rock and the blood, god there was so much more blood than I could have imagined and I fall to my knees and cry and I hear </p>\n\n<p>Amy laugh and the fury gathers but it isn’t for now.  </p>\n\n<p>Death nods at me from behind the beach.</p>\n\n<p>I can do nothing but watch.  Josh is dead and instead of me crying and losing my mind with all the adults I laugh, I laugh until I cry and have deaths face on my tiny body and he screams ‘SURPRISE!’ at me and I crumble.</p>\n\n<p>“That’s all for now son.  You deserve something more interesting than memories.  Come with me and you’ll understand the reason for this.  Trust me John.”</p>\n\n<p>And I did.  I had to trust him.  There was no one else.  </p>\n</div>\n","author":"nonoseknowsme"}