{"rank":"4","title":"Music is my life, 2nd verse","id":"8k4xrb","url":"/r/nosleep/comments/8k4xrb/music_is_my_life_2nd_verse/","time":"1526569518000","body":"<div class=\"md\"><p>I saw her again last night, and I know that I shouldn’t.</p>\n\n<p>No, I didn’t listen to The Mamas and The Papas recently - it’s just funny how sometimes, even with my… condition… song lyrics do a better job explaining my life that I can do myself.</p>\n\n<p>Anyhow, I’ve received quite a few messages and questions after I talked about that incident in my childhood, and I wanted to address them. First off, to everyone who is suggesting that I listen to this song or that song… I’m going to respectfully decline. I did read the lyrics for one suggestion, “The Thing That Should Not Be”, and… no one should want that. And no, reading the lyrics of a song don’t have any effect on me. It’s only when I hear the music.</p>\n\n<p>Some people asked me if I can listen to instrumental music, like classical or jazz. I tried, and most of it just gives me headaches. There was one exception, though; the only time I’ve ever listened to the 1812 Overture. When it got to the finale, and you hear the cannons going off, a gas main down the street from where I lived exploded, and destroyed part of a retirement community. I find it best to not tempt fate further.</p>\n\n<p>Which is why what happened is so damned frustrating.</p>\n\n<p>I was at the one place outside of my home where I can feel relatively safe - the library. No music, no talking, just books. Anyhow, I was in line to check out, putting my books up on the counter, when I accidentally jostled the woman in front of me. I didn’t think anything of it, and was getting ready to apologize to her, when she turned around, and took out the earbud that was hidden by her long auburn hair. Apparently, she must have been a fan of New Wave, because she was listening to The Police.</p>\n\n<p>Every breath you take / Every move you make / Every bond you break / Every step you take / I’ll be watching you</p>\n\n<p>Fuck.</p>\n\n<p>I turned and ran, digging my earplugs out of my pockets and jamming them in before I got out the doors. I started walking out to my car, but I couldn’t help craning my neck around to look back into the building through the glass doors. To look at her. Banged my damn shin on a bench because I wasn’t watching where I was going. I slowed down enough to not injure myself further, but I kept watching her through the glass as she collected her books and made her way outside. Fortunately, by then, I was far enough away that she wasn’t likely to see me for another confrontation. I got to my car, and sat in it, silently watching her walk past the parking lot and down the street.</p>\n\n<p>I couldn’t help it. I got back out of my car and followed her. I had to. The music said I had to.</p>\n\n<p>Her name is Angela, and she lives in a fourth floor apartment on Thurstman, facing the street. She has a cat. I haven’t seen any roommates, but it’s only been a couple days. Angela works as a barista at the Starbucks on 9th and Crown. She seems nice.</p>\n\n<p>…</p>\n\n<p>Seemed.</p>\n\n<p>She seemed nice.</p>\n</div>\n","author":"JeffKochosky"}