{"rank":"3","title":"Monster Hunters Anonymous Part 2","id":"8k510m","url":"/r/nosleep/comments/8k510m/monster_hunters_anonymous_part_2/","time":"1526570243000","body":"<div class=\"md\"><p>“My family used to be the most important thing in my life, but that stopped when I lost everything.</p>\n\n<p>First, I think I’ll explain what the main issue was. There were weird signs that something was wrong.Most of the lights in my house would flicker on and off randomly, and there was this ever-droning, continuous low hum that could be heard at all times when inside the house. Hell, I wasn’t even the first one to notice that. My daughter, who was six years old, came to me one morning and said that the buzzing was hurting her ears. I listened carefully and could just barely make out the drone of what sounded like an electrical or venting issue. Figuring that it must be based in the attic that stemmed off from her room, I promised her that while she was at school I would check out the problem and perhaps even have it repaired the same day. </p>\n\n<p>Off to the bus she went, drowsy but otherwise fine, and that is how I want to remember her. Smiling, waving to me from the front seat of the school bus, toothy grin fading out of sight with the growing distance between us. My last good memory in general. </p>\n\n<p>That day I started my normal routine. I went to the shop to get ingredients for dinner, sweeped the kitchen floor, handed in a few job applications, and grabbed my toolbox to fix whatever was causing the strange humming that was now even starting to hurt my head, quiet as it may be. It was starting to drive me a bit insane at this point. It seemed to be coming from the attic, which made sense, as that’s where our circuit breaker is. I figured it was a routine electrical issue, and having maybe a few years experience in the electrical field, I was fairly sure that I could resolve the issue on my own. If not, I’d swallow my pride and call an electrician the next morning, sending Emily to her mother’s for the night if she still couldn’t sleep well. </p>\n\n<p>Her room was quiet as I walked in, save from the low drone that plagued my ears, making more annoyed by the second. I almost tripped over her area rug, the loud thud of my boot on the wooden floor in front of me momentarily drowning out the incessant buzzing. Once again bringing myself upright by way of her bedpost, I steadily walked over to the access door. </p>\n\n<p>The access door to the attic was residing behind her arts and crafts table. As I moved the child-sized desk, a few stray crayons dropped to the floor, and one rolled underneath the attic door. Reaching to open the access door, I realized the door had no handle. I vaguely remember removing it some years ago when Emily was a baby, her crib once belonging to the spot that now held the craft table. </p>\n\n<p>I used my screwdriver to jimmy open the door, my almost-basic level of handiness assisting me. A dank, musty odor met me as I felt around for the light switch. My hand was only about six inches away from the door frame when it encountered something sticky. Up until then, I had encountered only the normal wooden framing, so I was taken aback by the thick, slimy substance that now covered my finger tips.The same substance seemed to be covering the light switch, which I flicked on without much trouble. Either the light was out or the sticky matter covered the light and made the switch useless, because nothing happened. Without the light, I couldn’t see more than two feet in front of myself, even with the light from Emily’s bedroom flooding in from behind me. It’s as if whatever was in that attic was absorbing the light. </p>\n\n<p>Nothing happened, except the fact that the buzzing stopped. I didn’t require much of an explanation, the fact that the drone was gone at all was good enough for me. I thought ‘screw it,’ and shut the door. I had no idea what had caused it, but it was gone. My main idea, albeit being my only one I had, was that by opening the door I had released some sort of pent-up air pressure which was making the noise. That being said, I didn’t pay too much attention to the substance stuck to my palm. I did notice that it smelled sweet, like honey, but I figured that we probably had a few bee hives up there, and promised myself that I would buy some bug repellant next time I was at the store. I washed my hands and was done with it. That was good enough for me.</p>\n\n<p>I continued the day as per usual, picking up Emily after school, which I almost never did, because I figured she’d need a pick-me-up after being exhausted all day. She usually rode the bus, but I didn’t mind being out and about, so why not? She was really sleepy, so I let her nap when we got home. She went up to her room, barely awake enough to make it sluggishly up the stairs on her own. </p>\n\n<p>I commenced with cooking dinner while listening to some very loud classic rock music, and was just taking the chicken out of the oven when I heard her scream. Her ear-piercing, horrid, absolutely terrified scream. If there was a true sound of fear, that would be it. What worried me more, though, was the fact that her scream was cut off abruptly. I dropped what I was doing and ran as fast as I could to her room. I noticed the buzzing was back, which I wasn’t able to hear before because of the music. It was louder than ever, and  if I had to assign it an emotion, I could’ve sworn it sounded angry.</p>\n\n<p>I slammed open the door to her room, and nearly fell to my knees. I saw something I won’t ever be able to forget as long as I live. I saw her, my daughter, the most important person in my life, dead. She was as white as a sheet, no, paler than that, it that’s even possible.</p>\n\n<p>Holding her by her neck was what looked like a giant wasp, but huge, red, and pulsing. Pulsing like a human heart. I screamed, barely able to keep myself together enough to get up and try to run. It dropped her, her body slumping to the floor like dead weight. </p>\n\n<p>Dead. </p>\n\n<p>In that moment, my brain had finally gotten over the initial shock, breaking through to pure, untapped, adrenaline-filled rage. I wasn’t just angry, no, that thing had stolen the one most important person in my life and then dropped her like she meant nothing. Like she was nothing. </p>\n\n<p>I ran. </p>\n\n<p>I wish I could say that I looked that thing in the face and told it to do some unsavory things, going out in a blaze of glory. But I shrieked like a child and ran for my life. Looking back, I wish I had just shut her door, and waited for the authorities to get there. Or, you know, anybody that could deal with whatever the Hell I was witnessing. </p>\n\n<p>Truth be told, I found this group by accident. I did call the police after running out of my house, and they were there right away. So were some men in suits, and I didn’t quite catch what agency they said they were from. They handed me a business card and left. Thinking back now, I don’t even think they were from any sort of agency. I think they just showed up and nobody really noticed.</p>\n\n<p>Anyways, I called the number on the card. That was your number, Eddy, and you’ve helped me. You’ve helped me mourn my daughter, learn what things exist out in the dark, and most of all, helped me share my story. Thank you. And thank you, everybody here tonight, for listening to my story as well.” </p>\n\n<p>Hearing the alarm sound from Ryan’s phone, the group started to disperse, some without a word. Some went towards the elevator, some took off towards the stairs, and some, a few, stayed behind to have a word with the group’s leader. A man in his late twenties, well-built and strong, and he was also wise. This very select group of people needed him the most, his guidance, his help. He smiled to himself as he thought about all the people he was saving by educating these men and women. He also had a forethought, of all the people that were lost in order to educate them. A silent thanks went out to all who died to serve the purpose of creating this group.</p>\n\n<p>They asked questions. John, who had just shared his story, was supported by the few who stayed. Gentle murmurs of “It’s alright,” and “You did all you could,” surrounded him. For the first time in the two years since the loss of his daughter, he felt exonerated of all guilt and shame. He felt supported, but best of all, he felt he belonged here, with people whose stories were similar to his own but still so different. This was the group he needed, this was Monster Hunter’s Anonymous. </p>\n</div>\n","author":"britic1223"}