{"rank":"103","title":"Thanks, Satan.","id":"8k57n8","url":"/r/nosleep/comments/8k57n8/thanks_satan/","time":"1526571665000","body":"<div class=\"md\"><p>She walked through the halls, one after another as soft moaning sounded in the distant murky darkness. Her tiny figure not making the faintest of noises as she quickly approached the still bleeding corpse filled room. The rain outside was still heavy, bombarding the tin roof with it’s relentless droplets of water, filling the gloomy house with a temporary atmosphere of tranquility.</p>\n\n<p>She glanced around, her eyes still adjusting to the utter darkness. A flash of lightning momentarily lit the room, revealing a scene from a nightmare. Men and women were scattered about, laying on the floor, bleeding out from countless cuts on their body, still desperately trying their very best to seek any kind of savior. That’s when they saw the small figure of a girl standing in the hallway. When death is near, any sense of dignity, pride or morality is completely lost and only the survival instincts remain. Seeing an option other than demise in the girl, they all struggled to crawl towards her, violently clawing at the floor, hoping for another shot at life.</p>\n\n<p>As they approached her, their wounds painting the wool carpet sanguine with blood, all of them suddenly stopped, their gazes all focused on the girl’s face. The tormented moans abruptly stopped, leaving only the rain to emit its tunes. “Pat, pat, pat” went the drops hitting the stained glass, decorating it shimmering wet.</p>\n\n<p>Gasps of realization and recognition filled the room and the girl grinned. Then the grin turned into a frown. From being pleased her tormentors were being sent to hell, to remembering all the putrid shit she had to crawl through. The actions of the damned had broken her mind, leaving only a husk that looked human. A lingering though of revenge was the only string connecting her body with her brain, not quite insane but dangerously near the edge, she was threading on needles. </p>\n\n<p>Imagine tearing a ragged cloth in half. The lines of string connecting it rapidly separating in the middle from outside force, creating a fissure and finally the single sheet of linen would become two smaller sheets of linen. That was her sanity being torn. Each day, she would barely hang on to a few strands of strings, protecting her sanity from the evil she was being subjected. Each night she would sew her own sanity together, only for it to be detached later that day. Born in the so called house of god. A fitting title would be house of hell. Holy people, they claimed themselves but the girl knew better than to trust their hollow words. It was always in the eyes. The innermost crevices of their souls can be seen as clear as a mirror through the eyes. It may be the reason why she tried to run away twice on the same day after her transfer in the Holy Church of Saint Julian. Her parents were mangled corpses after the vehicle had crashed into an oncoming wood transportation truck and the place she was sent to was not a pleasant one.</p>\n\n<p>At first, the popes seemed friendly as did the pastors and the nannies. Despite of their obvious gestures of kindness, she took her distance from them. There was something wrong with their eyes. It looked almost savage. Their smiles were that of a predator baiting their prey. Her assumption weren’t too far fetched, she realized. Because when the time for supper came and as she walked to the dining hall, she saw pastor Matthew in the distance. He was obviously approaching her with a quick pace. She didn’t like the feeling he was emitting and she turned back to run. </p>\n\n<p>“Come back here girl, I just want to talk with you!” yelled the giggling maniac.</p>\n\n<p>She was young but she still knew enough not to believe that obvious lie. Opening the big, wooden doors took some time but just as the pastor reached out to grab her hair, she ran out into the open parking lot, screaming for help. Late in the Monday afternoon, not a soul was in the earshot of her cries. And just like the night time comes, putting out the daylight, she was slowly dragged back inside, her consciousness slipping.</p>\n\n<p>She woke up vulnerable. Clothes are such a commodity that it’s ability to cover ones privacy and blend into society is often forgotten. Until it is reminded again, such as breathing. That night was the first of many to come. The next day, she tried to open the locked doors but couldn’t. Her legs were shaky. She saw the open window, a small glint of hope in her mind. As she climbed up the bed covered with dirty sheets, she put one foot out and followed with the other and fell down a short distance. But fatigued from the torture, she slowly but desperately ran towards the parking lot. She saw people walking along the streets, unaware of the horror an innocent girl was being subjected to. As she started to inhale air in to scream for help, her mouth was covered by the brawny hand of a sinful man. Matthew.</p>\n\n<p>And for months to come, she wouldn’t get an opportunity like the one she got that day. </p>\n\n<p>3 years later. She sat on a creaky chair, biting down on a hardened and putrid slice of stale bread, not even minding the rot. She was mumbling names to herself. “Santoro, Jermount, Julliane, Christian, Roman, Anna, Alice, Hannah and <em>Matthew</em>”. They tried to give her the bullshit about adding Father and Sister to their names. She bit her lip until it showed a small droplet of blood, squeezing out from the wound. Last night was the same and so were all the nights, it included her being a doll for their drives. If god existed, then why hasn’t he smitten these cretins to hell? </p>\n\n<p>If god won’t do it, I’ll gladly take the responsibility.</p>\n\n<p>Her eyes were what one would call that of a person on the verge of breaking. But she knew better than to succumb to her momentary wishes to crack open one of their skulls. That would mean she only gets to erase one of them from existence but what about their partners in crime? WHAT ABOUT THEM?</p>\n\n<p>Now. In the present. The girl stood in front of them. Harrowing groans and scream overwhelmed the girl’s ears as she started chanting. She was covered in a soaked wet, cloth cloak and under it was her naked body, parts of it cut open but because of her own will. Around her belly button was the Pentagram. Clutching a bloody knife, she cut her palms open, *once again.</p>\n\n<p>Suddenly a spine appeared in the middle of the room. It seemed to be floating but it was still like it was glued onto that spot. After a single moment of utter shock in the observers&#39; expressions, strings appeared from the spine. Upon closer look, one would see that it was a network of nerves and cells. After a moment, flesh started sprouting from the spinal cord, tendrils of bloody muscle fibre appeared from inside of the spine which, after forming, was covered with bleached white skin. Rapidly the spine turned into an unnatural figure.</p>\n\n<p>The thing that had appeared in the church on that night had spawned once again from the shadows that covered the place.</p>\n\n<p>One by one, the screams started as they realized what they were in for that night. </p>\n\n<p>The figure floated closer to the girl as she held her arm out. She held the stained edge of the cold, sharp dagger while the hilt was sticking out. A polite gesture of respect and agreement. And after just a second of holding the blade, the figure turned back and started the symphony of pain, the requiem of the tormented, the melody of despair.</p>\n\n<p>The girl stood and watched with a gleeful smile on her face, her frown long gone. Then she started giggling. </p>\n\n<p>“Thank you, Lucifer.”</p>\n\n<p>A man crawled towards the open door where she stood, presumably taking the opportunity to wriggle out of the hellhole while their accomplices squirmed around in anguish, keeping the towering figure busy. As he got near the door, he saw a muddy boot, it’s heel covered red with blood. Following the possessor of the tiny legs, he turned his head up to see a pair of eyes one would describe as that of a predator’s. It shimmered with pure hatred. And with a hard smack, the boot connected with his face, sending him rolling back. The haunting figure looked at the girl then at the man. And it started approaching the dazed Matthew.</p>\n\n<p>“P-Please, you have to HELP me!”</p>\n\n<p>The girl stared at him as a he did all those nights.</p>\n\n<p>“Try screaming. Maybe someone will come to help.”</p>\n\n<p>“EMILY, PLEASE! YOU HAVE TO HELP ME, EMILY! PLEA—”</p>\n\n<p><em>The stormy night’s unrelenting rain covered the streets with it’s water, washing the blood off of Emily’s cloak and boots.</em> </p>\n\n<p><em>The church was still and silent as the rain poured down.</em></p>\n</div>\n","author":"rantleystalk"}