{"rank":"9","title":"The Medium - Part 2","id":"8k5bcd","url":"/r/nosleep/comments/8k5bcd/the_medium_part_2/","time":"1526572482000","body":"<div class=\"md\"><p>Part 1:  <a href=\"https://www.reddit.com/r/nosleep/comments/8jvyc1/the_medium_part_1/?utm_content=title&amp;utm_medium=user&amp;utm_source=reddit&amp;utm_name=frontpage\">https://www.reddit.com/r/nosleep/comments/8jvyc1/the_medium_part_1/?utm_content=title&amp;utm_medium=user&amp;utm_source=reddit&amp;utm_name=frontpage</a></p>\n\n<p>Part 3:  <a href=\"https://www.reddit.com/r/nosleep/comments/8kenmj/the_medium_part_3/?utm_content=title&amp;utm_medium=user&amp;utm_source=reddit&amp;utm_name=frontpage\">https://www.reddit.com/r/nosleep/comments/8kenmj/the_medium_part_3/?utm_content=title&amp;utm_medium=user&amp;utm_source=reddit&amp;utm_name=frontpage</a></p>\n\n<p>Part 4: <a href=\"https://www.reddit.com/r/nosleep/comments/8l2mk6/the_medium_part_4/\">https://www.reddit.com/r/nosleep/comments/8l2mk6/the_medium_part_4/</a></p>\n\n<p>The key to being a spirit medium, the key for <em>any</em>  conman, is to know when you’ve almost warn out your welcome. I mean,  I’m good—real good—but eventually people wise up and walk away.</p>\n\n<p>Or worse, run out of money.</p>\n\n<p>For  instance, every once in a while, I’ll get invited to someone’s home to  hold a “séance party”. Mrs. Whats-her-face is a long-time client. She  came to me when her father died of liver failure. She came to me when  she thought her daughter was pregnant. She came to me when Trump was  voted into office, asking about “omens of doom.” Whatever the fuck that  means. About six months, this woman was in and out of my parlor, coming  to hear me say things like, <em>Your aura is bruised. The spirit world is communicating, but are you failing to listen?</em> Again, all of this horseshit.</p>\n\n<p>So  I get a phone call, the one I was telling you about, the phone call  where everything turns to shit. This chick, Whats-her-face, calls and  says, “My husband is out of state for a conference. Is it possible to  book you for a small gathering at my place?”</p>\n\n<p>I  immediately know this is the beginning of the end of our  customer/provider relationship. The best thing to do here is to charge  triple—even quadruple—what I’d usually charge. <em>In advance.</em></p>\n\n<p>In  the early 90s, McDonalds was really blowing up. A drive through ended  up on every major street corner, the big golden arches spaced about  twenty miles along every interstate. The big wigs in home office know  that maintaining quality food with this many chains would be nearly  impossible. Not to mention how difficult it is to provide a dining  experience for people eating inside, and speed for those getting it to  go. They approached this problem with a psychological solution. Hard,  cheap plastic seats. Sit and eat for more than five minutes, and your  ass is so sore, you can’t wait to leave. In every McDonalds, high  quantities of bright yellows and reds—colors denoting *urgency*.  Everything about the layout screaming <em>go, go, go</em>.  Google “hostile architecture.” Google “aggressive interior design.” The  trick to getting more money, the trick to not pissing off scores of  customers, is to get them in and out of their own volition before they  have time to complain. High quanitity customer experiences, not high  quality.</p>\n\n<p>When working away from my  parlor, in some hostess’ house, with all her skeptical friends drinking  white wine and judging each other’s nails—I know my presentation will be  shit. Without the theater design, without the diffusion of saffron oil,  without a track of chanting monks playing at low volume, my whole  shtick is nearly impossible to pull off. Suddenly, under the lighting in  this chick’s dining room, my mysterious goatee looks… glued on. With  everyone around me at the table dressed in GAP, my second hand robes  look dingy. I’ve got a little more eye liner on one side than the other.  Don’t look too close, because—yes—I’m wearing silver-tinted contacts.  Before the séance even begins, I’ve already lost’em. This is why I  charge so much for home visits. The big bang marking the end of steady  income.</p>\n\n<p>Our hostess says something like, “Guys. I promise. Victor here is the real thing.” But there’s a hint of doubt in her voice.</p>\n\n<p>Lighting a cigarette, I say, “So, are we gonna do this?”</p>\n\n<p>One of these Gucci soccer moms looks over, appalled, and says, “Tobacco is <em>really</em> bad for your health.” Yeah, with the inflection and everything.</p>\n\n<p>And blowing smoke, I’m like, “I’ve read your palm, sweetheart. Between you and me, <em>I’m</em> not the one who should be worried about cancer.”</p>\n\n<p>Half  way through the séance, and people are rolling their eyes.  Whats-her-face is bright pink, and drunk, the bottle of pino grigio  sitting a few inches from her glass. I stand up and bow, saying,  “Ladies, the mysteries of the spirit dimension must wait. I need a  piss.”</p>\n\n<p>I make my way to the bathroom, up  polished wood stairs. A few minutes later, I’m wiping my hands on a  monogrammed towel when I hear something. Singing. A low, croaking kind  of voice singing in what sounds like Russian. Cocking my head to the  side, I’m walking down the hall towards a partially shut door, lamplight  from inside spilling out from underneath. Behind me, from downstairs,  Whats-her-face is apologizing to her friends between hiccups. I press my  ear against the door to catch the tune being sung—something familiar,  but unnamable. The singing stops. My hand flat on the door, I push it  open.</p>\n\n<p>This is where I first meet the  Glass-Eyed Woman. Sitting on the edge of a twin bed, wrinkled and veiny  hands resting shakily on her lap. She’s ancient. Decrepit. Barefooted In  a pail nightgown, I can make out the shape of her tits, sunk low,  sitting heavy against her stomach. Where she’s not balding, her hair is  grey-white and thin. Her lower lip stretched up halfway to her nose,  she’s rubbing her gums together, staring down at the patterned carpet.</p>\n\n<p>Then  there’s me, standing there in the doorway, entirely uncomfortable with  that monogrammed towel in one hand. “Sorry, I-I didn’t know—I just heard  you singing, so I—“</p>\n\n<p>She turns to look at me, and her eyes look off. Not crooked or anything, just <em>wrong</em>. The way prosthetic eyes, no matter how good they are, always look too glossy and unfocused.</p>\n\n<p>“Well, I’m gonna—I’m just going to head back down—“</p>\n\n<p>Weak, shambling, she starts to push to her feet, mumbling that now <em>incredibly</em>  fucking creepy Russian song. Coming at me, she smiles, and her mouth is  the color of raw beets. Me, I’m just paralyzed with discomfort.</p>\n\n<p>Google “fight, flight, or freeze.”</p>\n\n<p>A  foot away from me she puts her ice cold, skeleton-like hands on either  side of my face, and for a terrifying moment, I think she’s trying to  kiss me.</p>\n\n<p>Instead, smiling she says, “You  don’t see. Not really, no,” and then, nodding, “But you will. Then, you  will know.” And she takes my hand and gives it an affectionate squeeze.  Shambling away, back towards the bed, she’s singing again.</p>\n\n<p>I  step out quietly, shutting to door behind me, dropping the towel there  on the hallway floor. I take a minute to compose myself. <em>What the fuck was that?</em></p>\n\n<p>Back  down stairs, it’s dead silent around that dining room table. Quiet as  death, no one making eye contact. Whats-her-face’s mascara is running.  I  clap my hands together, and say something like, “Well! Thank you for a  wonderful dinner. But alas, the witching hour is at hand. I’m off!  Please, no one get up, I know the way.”</p>\n\n<p>Fishing for keys in my inner robe, halfway towards my car, someone says, “Hey, asshole.”</p>\n\n<p>Turning around, there’s our gracious host, holding my jacket. “Forget something?”</p>\n\n<p>“Right.”  She hands me the jacket and I smile, saying thanks. She’s so pissed,  she’s radiating heat. “Hey, you’re mother… does she speak Russian by  chance?”</p>\n\n<p>Arms folded, she says, “My mother died when I was thirteen. You told me her presence was what got me through grad school.”</p>\n\n<p>“Of course.” <em>Shit. Forgot about that one.</em> “So the lady upstairs, who—“</p>\n\n<p>“I  think you should know that I intend on calling my lawyer tomorrow. I  have never been so mortified in my entire life. I had this dinner party  planned for months, you dipshit.” And putting both hands to her forehead  she says, “I knew I should’ve just gotten a magician. I hope you know  an a-fucking-mazing defense attorney, because my husband--”</p>\n\n<p>And  in that moment, it happened for the first time. I feel a knot in my  chest, and momentarily I can’t breathe. My teeth are vibrating the way  they do during hyperventilation. In front of me, Whats-her-face was  still speaking, but instead of words, a stream of clear water pours out  from between her lips, splattering down onto the sidewalk between us.  Her face is blue. Suddenly, her hair, her clothes—it’s all soaked.  Ounces of carefully placed makeup run down her face in sheets to the  collar of her top. I watch as her eyes roll steadily upward until only  the bottom edge of each iris can be seen.</p>\n\n<p>Then it all stopped.</p>\n\n<p>Dry as anything, arms crossed, she says, “Are you listening to me, asshole?”</p>\n\n<p>“W-what?”</p>\n\n<p>Turning on her Prada flats, without looking back she says, “Expect a call from my lawyer.”</p>\n\n<p>That night, I didn’t sleep. The next morning, there in the Weekend Express:</p>\n\n<p><strong>UPPER EAST SOCCER MOM JUMPS FROM RIVERBANK BRIDGE</strong></p>\n\n<p>More to come.</p>\n</div>\n","author":"DRP22"}