{"rank":"1","title":"I want to be wrong (Pt 2)","id":"8k5fak","url":"/r/nosleep/comments/8k5fak/i_want_to_be_wrong_pt_2/","time":"1526573318000","body":"<div class=\"md\"><p>Part 1:</p>\n\n<p><a href=\"https://www.reddit.com/r/nosleep/comments/8hs5gv/working_in_a_care_facility/\" rel=\"nofollow\">https://www.reddit.com/r/nosleep/comments/8hs5gv/working_in_a_care_facility/</a></p>\n\n<p>I eventually moved on from the care facility I started at, and took what I assumed was a better job. It payed better, was closer to home, and the patients were more independent. Overall, it just seemed like it was going to be a better move for my family. Everything seemed like it was going to work out for the best. I was excited to experience a different side of the care world. I was expecting something totally different than what I had experienced with my old care facility, and in hindsight I never realized how naive I was.</p>\n\n<p>I came to my first day of work in navy blue scrubs, because they were my favorite, and when I got there I was told to change. I shrugged it off and assumed it was just part of a dress code that allowed patients to tell who was staff and who wasn’t.I took the grey scrubs the woman handed me( never did learn her name) and changed in the nearby bathroom. I told myself again, that is was probably nothing. I was just barely seeing the tip of the iceberg.</p>\n\n<p>As soon as I moved past the entrance, I noticed just how bleak the building was. Every wall was a pale grey color, and there was nothing there. There were some books, and maybe a few board games, but it was basically a giant padded cell that was painted grey. I told myself first impressions aren’t always everything, and I started my first day with enthusiasm again, but this time it didn’t last longer than a few minutes into my orientation. I followed a woman names Sharon, as she showed me the ins and outs. We walked past rooms, that to me looked more like a padded cell than a room, and she explained each patient, and how to approach them. She was grazing past each room, just giving an overview of each patients scenario, and then would move onto the next. I barely had enough time to get it all processed or written down.</p>\n\n<p>We got to the end of the hall, and she stopped in her tracks. She told me the story of how this girl had been found, nobody knew where she came from, and that she wouldn’t talk to anyone.Sharon said she had been here for a few months, and that the police had just found her wandering. At first, I was curious, but then, I just began to feel sad for the girl. I couldn’t imagine what it would have been like to just be found wandering, especially because she couldn’t have been more than fifteen years old.</p>\n\n<p>I should probably clarify that where I am from, this is unfortunately not completely unheard of. My family lived in the middle of a swamp, and then the swamp was further swallowed by forest. It’s the exact kind of place you imagine when you think small town hicks living in woods. I never minded living in this area, and happened to enjoy the solitude at times. The only downside of living here was that it was ridden with strange things and occurrences we couldn’t always explain.</p>\n\n<p>Unfortunately then, this girl’s scenario wasn’t completely unheard of. Sharon continued to explain how we are never to treat her unless we are in multiples because she is sporadic, and has attacked a few caregivers. I looked at the girl again, and I should have been frightened, but instead I still just felt sorrow for her. How horrible it must have been to have gone through what she did.</p>\n\n<p>I took Sharon’s guidelines into consideration, and continued my job at the facility. A few months had passed, and nothing interesting had happened. I even began to bond with some of the patients, and would play card games with them when I was off the clock. We weren’t supposed to, but I liked to consider them more friends instead of patients. However, one thing remained constant, the girl never talked.</p>\n\n<p>I began to grow more curious, and wondered what could have possibly happened to her before she was found. I asked around to more people at the facility, and nobody knew about her back story. This satisfied my curiosity for some time, but eventually I just wanted answers. I wanted to know what had happened to her.</p>\n\n<p>I went online to our local news website, and began to try and find the article. Our town was so small, that there was no way this wouldn’t have made news. The girl had only been there for about six months, so the story should have been relatively recent. I looked and scrolled through stories, until I found one that seemed right. The article was titled, “JANE DOE FOUND WANDERING WOODS”. I assume that the story was meant to alert potential parents or guardians that she had been found, but it had been six months since she was found, and nobody had come.</p>\n\n<p>I was pissed at first, and I thought to myself, how could this girl be sitting here, alone and nobody came to get her. I was angry for someone not taking care of her, and sad that she had to be all alone. I went to close my laptop, when I noticed another story at the bottom of the page. The date was about a week or two later, and it had been written by a journalist from the neighboring county. It was titled, “FAMILY FOUND DEAD, DAUGHTER MISSING”. At that point I decided to say screw it, closed my computer, and told myself it was a coincidence. I told myself that if it was true, the police would have noticed, and that I shouldn’t waste time thinking about it. I couldn’t sleep that night, and every once in awhile I look at them again. I guess I am afraid to be right, and that&#39;s why I can&#39;t tell anyone. What if I wasn&#39;t right? Even worse though, what if I was?</p>\n</div>\n","author":"AlPal_99"}