{"rank":"26","title":"That wasn't my cab.","id":"8k5fzo","url":"/r/nosleep/comments/8k5fzo/that_wasnt_my_cab/","time":"1526573452000","body":"<div class=\"md\"><p>It had been a pleasant evening, something I do not get to say often. What with my constant night shifts at a dead end job combined with my uptight parents whom I still live with, it was a rare thing to be able to attend the parties of my relatively small social circle. We&#39;d started in the early evening with a shared meal, various alcoholic drinks and catching up with friends both new and old.</p>\n\n<p>Katherine was there, speaking in great volumes of her travels in Africa, where she had worked as a volunteer to aid various charitable causes. When she spoke it wasn&#39;t a prideful tone, no it... It was a kind tone. It was evident that she did such work because she WANTED to help people. I&#39;ve always loved that aspect of her.</p>\n\n<p>In truth I&#39;ve always loved... well, her. A notion I once made her very aware off during a former rare drunken party. She had kindly declined and asked that we continued as we always had, being friends. </p>\n\n<p>But I digress, you&#39;re not here for my failed attempts of love. No I rather expect you would find what came after the party more interesting.</p>\n\n<p>We stayed up late chatting, drinking and dancing along to whatever music that played. Adding our own voices to the songs, surely more than earning the ire of the neighborhood. To reiterate: It had been a pleasant evening.</p>\n\n<p>Some time past 3 AM I decided it was time I headed home. Most of my friends had stayed to sleep over as they predominantly came from out of town with arduously long bus rides to and fro. However I lived within walking distance and had figured I&#39;d save the sleeping room for someone who needed it more. I bid my friends farewell, gave Katherine a hug that may have lasted slightly too long and departed.</p>\n\n<p>The walk home was rough, I had had a busy work week and perhaps drank abit too vigorously. My legs were ever so slowly giving away due to overuse. It was at this point I decided I didn&#39;t need the extra money, and called for a cab. I instructed them to pick me up at a bus stop nearby, they told me it&#39;d take 10 or so minutes and kindly requested my patience. I had no quarrel with that time frame so I promptly planted myself down in the bus shelter, drunkenly awaiting my cab.</p>\n\n<p>A cab arrived at the bus stop, softly slowing down to a crawl as it reached me. The darkened windows of the vehicle rolled down with a soft electronic hum. &quot;Are you _____? Ordered a cab right?&quot; the chauffeur asked. To him I must have looked like a wreck, although I suspect being a cab driver on Saturday nights you meet your fair share of drunken youths. He had called me by name and I had indeed ordered a cab so I got up and entered the cab. I gave him my home address and we were off. The sleek black automobile near silent as it glided from lamplight to lamplight, from shadow to shadow. </p>\n\n<p>The chauffeur was a middle-aged man of Middle Eastern decent. His hairline had receded alot in recent years, a thing it seemed he had attempted to combat with quite the combover. Added to this he boasted quite the mustache, he was a plump overweight.. greasy man. However he had a kind demeanor and I therefore engaged in talking with him.</p>\n\n<p>He asked where I&#39;d been, if the party had been good, what I did for a living. Questions I took as innocent prodding at the time, in return I asked him much the same however he never said much about himself. He had driven a cab for years he assured me. He also urged me to finish an education and aim for something more forgiving than being a cab driver for life.</p>\n\n<p>We neared my home at this point. I had intended to ask him how come he never aimed for something better than a cab driver, but I was cut off by a sudden buzzing in my right jean pocket. Someone was calling me, despite not recognising the number I answered. </p>\n\n<p>&quot;Hello? ____? Your cab has arrived.&quot; </p>\n\n<p>I fell silent. Slightly confused as I simply replied. &quot;No, no I&#39;m already in a cab. Maybe you sent two by mistake?&quot;</p>\n\n<p>&quot;No, no that wouldn&#39;t happen, sir.&quot;</p>\n\n<p>I froze. I knew there was only one cab company in town, surely it was nothing but a bug in the system. Despite the man on the phone declining it, I saw little other explanation to it.</p>\n\n<p>&quot;Well... Sorry bud, I&#39;m already in a cab.&quot;</p>\n\n<p>The man on the phone didn&#39;t answer, instead he audibly sighed and ended the call. Whatever had gone wrong I was at this point so near my house that I could practically feel my soft bed enveloping me in its embrace. I shrugged at the chauffeur. &quot;Seems they sent two of you, hah.&quot; </p>\n\n<p>The chauffeur didn&#39;t reply. Instead he rose his right arm off the wheel and firmly forced all doors into an autolock with a press on his dashboard. He then offered me a vague smile, one that managed to unsettle me far more than it reassured me.</p>\n\n<p>We had gotten to my home address by now. Yet we made no sign of stopping, in fact despite my protest we continued down the road straight by my parents house. We weren&#39;t slowing down, we were speeding up. The chauffeurs eyes were focused upon the road and my gradually louder and louder protests seemed to not bother him in the slightest.</p>\n\n<p>We were now a few streets beyond our destination, I was angered, frustrated.. scared to tell the truth. Fueled by these emotions I ferally reached for the wheel. Attempting to turn the cab around, or stop it. Now I am not a weak man but even with my considerable drunken force I still could not wrestle the chauffeur&#39;s iron grip. A grip I soon would come to know too well as his right hand freed itself of the wheel, in a viper like lunge the chauffeur&#39;s hand closed around my throat. Applying enough pressure to pose threat of asphyxiation. All whilst the Chauffeur&#39;s calm gaze and vice like left grip were maintained on the road. The cab was not stopping.</p>\n\n<p>I know not what happened next, where he took me or why he&#39;s keeping me here. I have little time before he returns to discover I broke free of his basement... And that I&#39;ve sent this.</p>\n\n<p>My name is ____. And I&#39;ve been kidnapped.</p>\n</div>\n","author":"SallingIsWriting"}