{"rank":"340","title":"Through the Sand and Stars","id":"8k5rys","url":"/r/nosleep/comments/8k5rys/through_the_sand_and_stars/","time":"1526575991000","body":"<div class=\"md\"><p><a href=\"https://granthintonauthor.tumblr.com/post/173992749554/life-and-more\">I</a> don&#39;t know when I first saw him; standing on the edge of my peripheral vision, lurking there like a fragment of a bad dream. I would be kidding myself if I told you that my earliest memories didn&#39;t have him in it. Somehow I wasn&#39;t bothered by him, which seems funny to me know. He never spoke, and if I tried to look at him directly, he would vanish.</p>\n\n<p>In my teenage years, I thought I was going mad and probably did for a while. Sometimes he would raise a hand and jerk a thumb over his shoulder, as if to say, &quot;let&#39;s go.&quot; I didn&#39;t know what he wanted or who he was. I began to ignore him and pretended to be a regular kid. It worked for some time, and I think I was happy as well. </p>\n\n<p>College was a blaze of studying, experimenting with girls and recreational drugs. I saw some pretty bizarre things over my college years, so the man at the corner of my vision was the last thing on my mind. </p>\n\n<p>After college I floated around working for companies that cared less about me as a person and their environmental footprint then I care for their work ethics. I did however, eventually find a small company that cared about their impact on the world. I was happy working for them, and my life went from dull to duller. </p>\n\n<p>That all changed when I met Jane, I remember falling for her the moment I saw her walk through the office one rainy Monday. To say she brighten up the place maybe an exaggeration, but that&#39;s how I felt.</p>\n\n<p>I eventually plucked up the courage to talk to her by fainting that I had an important document that needed her perusal. When she looked at me for that first time, I knew she felt the same as me. I&#39;ve heard a friend speak about the moment when two people connect on a profound level. Some intrinsic spark ignites something between them.</p>\n\n<p>I asked Jane out there and then before my courage fled me, and she said yes.</p>\n\n<p>After an early dinner, I took Jane to the beach to watch the sunset. I must admit I saw nothing of the evening apart from what was reflexes in her beautiful eyes. I will never forget the way the orange and pinks fought in her eyes like rivals, fighting to win the affections of her blue at the centre. When the stars came out, and the waves gently rolled onto the shore, we shared our first kiss. I don&#39;t know if he was there then, I imagine he was, but I didn&#39;t care, I was lost in Janes embrace and treasured every second of it.</p>\n\n<p>Before we got married, I told Jane about him. About how he&#39;s always been there, lurking at the edge of my vision. She asked if I thought he was some sort of guardian angel or something. I thought back to all the times I had hurt myself, and again he didn&#39;t move to save me, only watched. She believed that I wasn&#39;t crazy, and it was a weight off my mind.</p>\n\n<p>Daisy was born a year later, and again I was lost in love. I couldn&#39;t begin to explain what it&#39;s like to produce life, to look into eyes that are a mirror of your own. A part of your soul, living, breathing in your arms.</p>\n\n<p>However, I knew somewhere deep down, that what I had here was something I shouldn’t have. Somehow through all the love I felt looking into Daisy&#39;s eyes, all the connectedness I felt. Something was off, like this shouldn&#39;t be happening to me, as if it was a lie. Maybe it was? Maybe it was a past life that I felt, or something that I wanted so much, with all my being that I thought the higher powers would deny me.</p>\n\n<p>As Daisy grew and learned to walk, Jane and I tried again for a second bundle of Joy, but through all the attempts it would seem that our family was already complete. We turned our focus on bringing Daisy up to be the best versions of us possible.</p>\n\n<p>I don&#39;t know when we grew apart, but I do know he was there for it. First the bickering, then the cold shoulders and petty insults. I stayed later at the office and tried to lose myself in mountains of emails, rather than argue with Jane, but it never worked. I didn&#39;t know what I was doing wrong, what I could do to win back her love. I wondered where the spark had gone, when did she stop looking at me, and when did I stop losing myself in her eyes?</p>\n\n<p>After one dramatic argument, Jane finally came clean and left to stay at a hotel. He was they for that too, jabbing a thumb over his shoulder.</p>\n\n<p>I hated him. Lurking there, watching me. I found myself shouting at him after Jane left. I don&#39;t know what Daisy thought when she came into the room and saw me screaming at the walls. Of course, she couldn&#39;t see him standing there giving me the thumb as if to say, &quot;ok, that’s enough. Let&#39;s go.&quot; As soon as I turned he vanished and only me and Daisy stood looking at each other. Her with a look of sadness that her old man had finally gone mad. Me, flushed, angry and ashamed.</p>\n\n<p>She turned to me and said.</p>\n\n<p>&quot;It&#39;s ok dad, I can see him too.&quot;</p>\n\n<p>The shock of her words drained the redness from my face. Had she inherited this curse as well? Was there more of these men?</p>\n\n<p>We sat and spoke until the sun came up. Daisy told me she could see the man, not in her peripheral but actually see him standing in the room. She said to me he wasn&#39;t there often, mostly when we were having a particularly good day or when times got really tough. Daisy described him for the first time, while I could only see white and a dark face, she saw it all. The middle-aged man in a white lab coat, balding hair, and glasses.</p>\n\n<p>Throughout the whole conversation I didn&#39;t have the heart to tell my fourteen-year-old daughter the reason for her mother and my argument. Jane had been diagnosed with cancer a few months before and didn&#39;t want us to know. That&#39;s why she had became distant. I wanted to tell Daisy, but Jane didn&#39;t want to interrupt her school work and social life. Eventually, she stormed out. </p>\n\n<p>Jane came back in the morning while we were still talking. Daisy knew something was wrong the moment she looked at her mother. Soon Daisy, Jane and I wept together, as a family. I took time off work to spend with Jane, and we fell deeper in love than ever before. If I was a poet or some other magical pen-write, I could explain how she made me feel, how with her by my side I could stop mountains. I don&#39;t think I could ever love anyone as much; it made my heart ache. Even with Jane telling me that when the inevitable happened, I should go on with my life and find someone to love me the way she did.</p>\n\n<p>Time passed slowly; Jane lost much of her weight and all of her hair. Her bone protruded through her skin at an alarming rate. The chemo wasn&#39;t working; she decided to stop. I was so proud to call this beautifully strong women my wife. All at once she seems to accept what was happening and from that day we enjoyed what little time we had left.</p>\n\n<p>We lost Jane on the same dreary morning I met her. My world collapsed under the blanket of umbrellas. My life lay shattered around me in a million pieces. He was there then, watching, giving me the thumb signal. I couldn&#39;t tell you who came to the cemetery or what I wore, but I could describe the coffin in intricate detail. If it weren&#39;t for Daisy holding my hand, I would have laid done on the pearly white coffin lid and stayed with my beautiful wife forever.</p>\n\n<p>We returned home, family and friends gathered to offer their condolences, but I didn&#39;t hear them. A part of me had died there at the graveside. If you&#39;ve ever had to bury someone you’d loved you might know what I was going through.</p>\n\n<p>Later that night when I had no more tears to shed, and I lay alone on an empty bed. I smoothed Janes pillow with my hand, trying desperately to catch some of her warmth or scent.</p>\n\n<p>I heard something in the room, a voice, small at first and I thought it was Daisy talking through the walls. But then it got louder, and it was distinctly male. I turned and saw the man, not in my peripheral anymore, but face to face. He smiled at me, a weak, sad smile, laced with an underlying happiness. I broke down all over again and squeezed my eyes shut.</p>\n\n<p>&quot;Ok James. It&#39;s time to go.&quot;</p>\n\n<p>I didn&#39;t know what he meant, but suddenly my world shifted. I tried to open my eyes, but a jarring sensation in my head made me close them tighter, I felt like someone remove something from my eyes. I tried again to open them, and the light was blinding at first, but slowly they adjusted, and the feeling in my bones returned.</p>\n\n<p>I lay reclined on a cushiony black chair. A drip feed stood beside me on a gleaming metal hook and four or five people gathered around me.</p>\n\n<p>Disorientation shook me to my core. One minute I was laying on my bed trying to snatch anything that remained of my late wife and the next I was here.</p>\n\n<p>&quot;It&#39;s ok James. The grogginess will wear off, and you will start to remember the program.&quot;</p>\n\n<p>I tried to talk, but my throat felt stiff as if I hadn&#39;t spoken for years.</p>\n\n<p>&quot;Program?&quot; I croaked.</p>\n\n<p>&quot;It was a success, James. Abet a little hiccup that we&#39;re fixing, but no less successful. You lived a whole life in a year. Our clients will be especially happy that one such as yourself has experience all that you have.&quot;</p>\n\n<p>I raise a hand to wipe my eyes, but nothing happened. I tried again, the sensation was there, the neurological command to move my appendage, but still nothing happened. I searched the faces gathered around me in alarm, then at my environment. I glimpsed a uniform. \nBeige brown, my unit&#39;s logo on the arm of the shirt and my name written in black letters over the breast. J. Hanshore. </p>\n\n<p>It was then that things slowly started to come back to me. The army, the mission to gather intel on an expected group of terrorists, the explosion, the months of therapy to come to terms with the damage to my body.</p>\n\n<p>I had lost the lower half of my body, all to the waist. My torso was in such a bad state that the doctors didn&#39;t think I would make it. A man came to my bedside and offered a new experimental treatment. The program would allow a person to fully emerse within a virtual world of their choosing. The procedure was expensive, but the impact was staggering. I had experience things that I would never experience again. Jane, my wife, Daisy, my daughter. They were still real to me even if they were just a computer program. I had experienced something that I would never be able to have in my current bodily state.</p>\n\n<p>I started to cry anew. Partially for my real life that had been shattered by the bomb, and mostly for the life that had been snatched from me when they took off the headset.</p>\n\n<p>&quot;Please,&quot; I begged. “Plug me back in.&quot;</p>\n\n<p>A man came over to me, the man who was always at my peripheral. David, I remembered it was his program. He recruited me for the testing of his virtual program.</p>\n\n<p>&quot;We need you to speak to our sponsors first James, and then after that, as our first tester. I will plug you back in.&quot;</p>\n\n<p>I tried to smile through the tears and thanked him. A lady came over and wiped at the tears tracks down my face. She too had tears in her eyes. Something about her blue eyes stopped me, and I froze to look into them. My virtual life sped backward through my mind, and again I was in that drab office on that rainy day. Jane had just walked in with her grey pencil skirt and purple blouse. She glanced over at me and our eyes connected for a brief second.</p>\n\n<p>I lost myself in Jane&#39;s eyes then, and I found myself lost in these eyes now. Jane smiled down at me and wiped away another stray tear.</p>\n\n<p>&quot;Hello, again James. My name is <a href=\"https://www.facebook.com/granthintonauthor\">Hanna.&quot;</a></p>\n</div>\n","author":"granthinton"}