{"rank":"19","title":"I've always been paranoid","id":"8k5uww","url":"/r/nosleep/comments/8k5uww/ive_always_been_paranoid/","time":"1526576620000","body":"<div class=\"md\"><p>It&#39;s not hard being a receptionist. It&#39;s fine, actually. I clean up a little, answer calls, etc. My favorite line is, &quot;One moment while I direct your call!&quot; I don&#39;t know, it sounds kind, and helpful. Which is what I aim to be. </p>\n\n<p>When I got this job as a receptionist for an insurance company, I was hoping it would be like The Office. Maybe I&#39;d find my Jim Halpert; maybe my boss could be silly like Michael. A Dwight to prank everyday with my Jim Halpert. But it was actually the opposite. This place was SO boring. Everyone came in. Exchanged NO words. No eye contact. And left at 5 o&#39;clock. I had tried to make small talk, shake a hand or two, but to no avail- everyone just wanted to get whatever they needed to get done, and leave. I guess this 8 to 5 job wasn&#39;t their dream gig. </p>\n\n<p>The only man I talked to didn&#39;t even work with our insurance agency; he was the custodian. We will call him Mr. Jones, for identity safety. An older, slower, more decrepit man who used his trash barrel for balance  when he was walking, as his shoes squeaked with every step he took, dusting, sweeping, mopping. </p>\n\n<p>One evening, it was getting very late. I heard Mr. Jones squeak down the hallway. People began to sweep up their jackets and briefcases, and leave. As people brushed passed Mr. Jones as he was cleaning, I couldn&#39;t help but feel bad for him; Mr. Jones was too weak to be cleaning, but needed the money to support himself and his granddaughter. He took his granddaughter in after her mother died in a car accident, he told me. </p>\n\n<p>It was about 6 pm now, and Mr. Jones had only finished sweeping the lobby. </p>\n\n<p>&quot;Mr. Jones,&quot; I began, &quot;why don&#39;t you let me help you this evening?&quot;</p>\n\n<p>&quot;Oh, no no no. You probably have a nice boyfriend to get home to, Jenna!&quot; He chuckled.</p>\n\n<p>&quot;If by boyfriend you mean a cat who bites me when I pet him, you&#39;re correct. But he has adequate food and water. I don&#39;t mind, really.&quot;</p>\n\n<p>I began dusting.</p>\n\n<p>Okay, my office building has a very long set up. It&#39;s more of a rectangular building; you walk in the front doors, into a large, long hallway. On the right side of the hall way you will find all of the offices of our employees. On the left, a long hall of conference rooms. We rent these out, as everyone seems to not want any interaction with each other here. And it&#39;s decent money for us. Anyways, Mr. Jones took on the offices, and I decided to clean up the conference room side. </p>\n\n<p>Since we are a small insurance agency, and a low key broke one at that, the lights automatically shut off at 7 pm, and the emergency red lights kick on. Mr. Jones had complained about cleaning in the dim red lights for some time, but our cheap boss said that &quot;light burns coal, which burns my money,&quot; something dumb like that. So we cleaned in the red lights.</p>\n\n<p>As I began to wipe down conference room #3&#39;s table, the phone rang. &quot;Hm, odd,&quot; I thought. &quot;Who would be calling conference room #3 at 7:15 pm?&quot;</p>\n\n<p>Then I remembered. Someone can only get through to conference room #3&#39;s line if they are transferred there from the front desk. </p>\n\n<p>I became nervous. &quot;Maybe its Jones, he probably is too tired to walk all the way down to this room.&quot;</p>\n\n<p>I picked it up. &quot;Hello, Jones!&quot; </p>\n\n<p>A deep, oddly calm voice began, &quot;Oh, hey Jenna. I think you missed a spot dusting up here. It also smells a little metallic, maybe some febrezze would help?&quot;</p>\n\n<p>Okay, I thought. What a dumb joke. &quot;Ha ha, funny, kid. Look, get out of this office before I have to call your mommy.&quot; </p>\n\n<p>&quot;You want me to leave? I guess you&#39;ll have to find me!&quot; </p>\n\n<p>The line went dead. My heart never felt more alive. </p>\n\n<p>&quot;Okay, it has to be some punk kid who wondered in. It&#39;s fine. You&#39;re a grown woman, Jenna. Snap out of it. God, you can&#39;t even watch an episode of Law and Order without being a nervous wreck. Okay, just professionally walk up there. Tell the kid to leave, or you&#39;ll call the cops. It&#39;s fine. You&#39;re fine. Mr. Jones is fine.&quot;</p>\n\n<p>My heels clicked against the glossy concrete floor. My hoop earrings glistened in the red lighting. My heart beat increased with every step.</p>\n\n<p>I walked calmly into the lobby. Everything looked fine; magazines stacked neatly, floors clean. &quot;Why was I even worried?&quot; I asked myself. I walked down go check on Mr. Jones. </p>\n\n<p>Office 1, no Jones. Office 2, no Jones. Office 3, 4, 5, no Jones. As I walked further down the hall, I began to smell a copper-y scent; I could taste it in my mouth. I walked faster and faster, checking all rooms, until I got to the last office. Office #9. I hesitated to open the door. </p>\n\n<p>&quot;Jenna, you pussy. It&#39;s probably some dumb teens behind that door. Maybe Jones is in on the prank too, even though he&#39;s not one to mess around much. You know, maybe Mr. Jones picked up smoking? Maybe he went out for a cig. Man, I could use a cig right now- OKAY DAMMIT OPEN THE DOOR!&quot;</p>\n\n<p>I pulled open the door.</p>\n\n<p>Nothing. Nothing at all. Just a clean, white, office space. I called myself an idiot and walked out of the office towards the lobby. </p>\n\n<p>&quot;God, I cn&#39;t believe you. You idiot. You always think someone is out to get you. I can&#39;t wait to tell Jones about this. He will get a kick out of-&quot;</p>\n\n<p>The air in my lungs was sucked out. I walked into the lobby, and Mr. Jones was in a lobby chair, slumped to the side, a phone cord wrapped around his neck. A deep slice from his sternum go his belly button. Scotch Tape was used to keep Mr. Jones&#39; eyes open and mouth curved, making it look like he was smiling right at me. My head was burning. I checked a pulse. Nothing. I ran to my desk, phone lines were cut, my cell was no where to be found. I was scared. But out of fear, I yelled.</p>\n\n<p>&quot;Why??? Why!? You fucking punk piece of shit! He had a grand kid! \nAnd the phone lines, really? My fucking cell, too? Wow, classic. Fucking CLASSIC.&quot; </p>\n\n<p>Avoiding eye contact with Mr. Jones&#39; body, I ran to the doors. I started my car, drove to the nearest store, and called 911. I drove right back to the office as the cops arrived. </p>\n\n<p>The cops, guns drawn, bursted in. I watched from my car with the Chief of Police. Minutes passed. </p>\n\n<p>&quot;CLEAR! CLEAR! CLEAR!&quot; is what I heard, as every room was being checked. </p>\n\n<p>About 20 minutes had passed. Mr. Jones came out in a body bag. Police walked out and gave me dirty looks. </p>\n\n<p>&quot;Ma&#39;am, we are going to have to talk to you at the station, hop in my car, now.&quot;</p>\n\n<p>I wanted to be defensive. But I was calm and cooperative. After all, I didn&#39;t do anything wrong. I am a victim in this situation. I told them all that you heard, from the phone call, to the yelling. They asked if I had any mental disorders; none. General anxiety, I guess? I was sent home. </p>\n\n<p>My boss told me I had to take a week off at the least. I thought &quot;wow, a week, he must really care!&quot; But I knew he was trying to avoid a lawsuit, as he prob didn&#39;t have proper locks on the door or something. But it wasn&#39;t his fault. Just a freak incident. With the guy still at large. I&#39;m shaken up, but my therapist is helping out. </p>\n\n<p>I know this isn&#39;t as gory or gut wrenching as most no sleep stories are, but it sure as hell shook me up. And I guess sharing it helps me cope. I&#39;ll miss Mr. Jones. I don&#39;t know where his grand daughter was go. But I hope she will be okay. Will update/post later when the cops call me. </p>\n\n<p>Thanks for listening. </p>\n</div>\n","author":"yaboibaby"}