{"rank":"65","title":"Get Out","id":"8k5y8z","url":"/r/nosleep/comments/8k5y8z/get_out/","time":"1526577312000","body":"<div class=\"md\"><p>When I was six, my parents got a divorce. My dad moved away, re-married, and my sister and I moved in with him and his wife when I was in the ninth grade. The following year, when I was 16, my dad and step-mother had a son. I&#39;ll call him Leo for the sake of anonymity. I enjoyed spending time with Leo, he learned quickly and was a lot of fun to play with when I was that age. I enjoyed helping out with him, changing his diapers, that sort of thing. </p>\n\n<p>When Leo turned one, he started learning his first words. He&#39;d say mama and dada, he called me sis sis and called my sister (his other half-sister) Orko, I don&#39;t really know why. My sister, we&#39;ll call her Erin, went through her teenage years a little differently than I did. She enjoyed swearing, sneaking out, and drinking even though she&#39;s a year and a half younger than me. One of Erin&#39;s favorite things to do was stay in our room (we shared a room) and talk on the phone, text, and do her hair/makeup. Whenever my father would enter our room, she would yell at him to &quot;GET OUT&quot;. This detail is important, because as I mentioned, Leo was a quick learner and picked things up quickly. </p>\n\n<p>Anyways, one evening, Erin was away at a sleep over after having had her friend at our house all day. I was heading to bed, and back then I had my portable DVD player to watch seasons of Grey&#39;s Anatomy or One Tree Hill, a lap top that was ancient but which I used for Facebook, and my cell phone. None of these devices were plugged into the fall, again an important detail for later. </p>\n\n<p>Leo&#39;s room was just down the hall from ours, and my dad and step-mother always left his door cracked open for the fresh air. They had just put him down to bed and went down to their bedroom. </p>\n\n<p>I was enjoying an episode of Grey&#39;s Anatomy when all of the sudden, Leo&#39;s door slammed shut. Leo proceeded to wail and scream &quot;GET OUT, GET OUT&quot;! Small step back, but when his door slammed shut, my portable DVD player, cell phone, and lap top ALL shut off simultaneously. My cell phone was actually fried which led me to have to buy a new one. And to re-iterate, none of the devices had been plugged into the wall. </p>\n\n<p>My step mother came upstairs, as she had heard Leo on the baby monitor, and took him down to their bedroom. I asked her if she had heard anything else, she did not, but she asked me if I was in his room because she had heard him yelling at someone to leave. Once I told her that I was not, she refused to admit again that he was saying that even though I had heard that too (she refuses to discuss the possibility of anything odd happening anytime, anywhere). All I could do after that was roll over and try to sleep which was, trust me, not an easy task. </p>\n\n<p>So flash forward to the next morning, after I somehow got some sleep, I woke up to something familiar. When I was a child, I had pretty severe anxiety. My mother put me in therapy and tried different methods of coping such as worry rocks and worry dolls. The worry dolls were held in a tiny yellow box. There were about 6 of them, and they were just these tiny, 1 inch tall, home made-looking dolls with little smiley faces painted on. I hadn&#39;t seen the box of worry dolls since I was a kid and on top of that, I moved houses between the last time I had seen them and this event. When I woke up that morning, there was a worry doll lying next to me on my bed.</p>\n\n<p>A little bit after that discovery, sister called to ask for a drive home. When I was on the phone with her, I told her what had happened. She went quiet for a solid 30 seconds before she began to cry. She told me how sorry she was and that she would make it up to me and figure out how to fix this. I had no clue what she was talking about, and when I was about to question her, she told me that her and her friend had build their own Ouija board and played it in our room. They made contact with someone, or something, but they each thought that the other was moving the piece. </p>\n\n<p>I&#39;m Catholic, and just happened to be in the middle of my confirmation classes when all this was occurring. I had a class that evening so decided I would speak to my priest about all this. I did that, and he advised me to let him know if anything else ever happened, which it did not. My little brother, who is now much older, swears he remembers this happening, but has no recollection of what he saw. </p>\n</div>\n","author":"cculbert3"}