{"rank":"116","title":"Beast Mode to God Mode","id":"8k6o7j","url":"/r/nosleep/comments/8k6o7j/beast_mode_to_god_mode/","time":"1526582736000","body":"<div class=\"md\"><p>“I hear you’ve got a coupla pretty good nicknames,” said Charlie Ward, head coach of Miskatonic University’s football team, “One of them’s ‘Big Beast,’ and the other one’s ‘Big Baby.’ I know which one I like better.” He grinned a vicious, mirthless grin at me from across his desk. Ward was a lean, lithe Yankee through and through--a septuagenarian in a crisp white dress shirt with a hideous Patagonia ski vest in some kind of Aztec tribal print zipped up over it. His white sleeves were rolled up, revealing veiny forearms and a gold Rolex President on his left wrist. He looked capable of going outside right now and doing every drill he put his football team through.</p>\n\n<p>Even that first time, Charlie Ward’s piercing blue eyes gave me both the heebies and the jeebies. The eyes creeped me out even worse than the foot high statue of some kind of monster with a hawk head, a lion’s body, birds’ wings, and a scorpion tail that was sitting right smack in the middle of a desk full of file folders and loose papers.. The statue looked old and was done in a primitive style and real bird feathers had been selected with care by some insane shaman of genius for their brilliantly unsettling yellows and greens. It stood out as an incongruity in a room that otherwise looked like any of the 20 other offices of elite head college coaches. But even back then, I knew that  kind of unsettling incongruity was Charlie Ward right up and down--workaholic, over-achieving White Dude with a perverse streak a mile wild.</p>\n\n<p>Charlie’s interests ranged from Soviet sports psychology to string theory to psychopharmacology to ancient tribal customs and rituals of manhood, in addition to a rock solid career as a football tactician. He had taken Miskatonic University, a small but expensive school in the middle of Rhode Island from total oblivion to being a top tier Division One school in a jaw dropping short amount of time.</p>\n\n<p>“Yessir,” I admitted, “that’s true.”  I ginned awkwardly--Aw shucks, sir, please approve of me anyway.</p>\n\n<p>My name is Bruce Babbit, Jr. I’m eighteen years old, and I’m six foot four, three hundred fifty-seven pounds. My dad always said I’m hands down the top college recruit in the country for defensive tackle, but he exaggerates things a little. I’m definitely in the top five, though.</p>\n\n<p>I got both nicknames, by the way, on the same play in the same game my freshman year at Kenilworth High School.</p>\n\n<p>I was only 15, but I already had about 50 pounds on the 19 year old, all-conference offensive lineman across from me. After the snap, I was able to get on his inside and ended up throwing him one handed a few feet backward and through the air. I’d already spun hard to face their QB directly, who was now standing right in front of me with no protection, when I heard a noise off to the side like a huge, dry branch in a drought month snapping in two. I didn’t take my eyes off the QB.</p>\n\n<p>I took off hell for leather after the quarterback, and even though their halfback should have tried to get between us and eat whatever kind of hit I was gonna lay on him to give the QB a split second to get rid of the ball, he chickened out and I blew untouched and fucking creamed the quarterback with a picture perfect high, legal hit.</p>\n\n<p>When it was all said and done, they had to carry both the offensive lineman (who had a broken leg) and the quarterback (who had a severe concussion that he never quite got over) off the field on stretchers. So I was standing on the sidelines as not one but two opposing players were taken off the field in stretchers and my teammates were hooting and hollering and slapping my back and I could hear the crowd just losing their shit, chanting my name over and over, and I started to cry because I felt bad for the guys I’d just hurt just because they were trying to be good at playing a game. I tried not to but I couldn’t choke back the tears or hork back the snot and I was just standing there in a light drizzle on the side of the field with my head down, red faced, snot running down my nose, bawling under my helmet. Because helmets hide your face pretty well (football is a pretty de-personalizing game tbh) I don’t think anyone in the crowd or even on the other sidelines could see me, but my teammates sure as fuck could and that’s how I got the nicknames “Big Baby” and “Big Beast” on the very same fucking play.</p>\n\n<p>They call me Big Baby more often than Big Beast, back home, where they know I’m the nicest dude in the world, but I don’t wanna tell Charlie that.</p>\n\n<p>I remember that after that game, my father had tried to make me feel better.  We were in the living room, and he was sipping a glass of bourbon, and he offered me his glass and I took a sip and kept it down without coughing or making a funny face, and he smiled and said “Son, you just have to make your moves. You’re a natural winner, and winners do what they want and everybody else just has to deal with the shit. That’s not fair, but that’s life, kiddo.” Then he’d put his arm around me and sent me off to get ready for bed.</p>\n\n<p>A lot of people have always hated my dad, but I always thought they just misunderstood him. He’s a definite type A dude and he pushes himself and everyone around him pretty hard, and because he doesn’t cut anybody any slack and swings a pretty big dick around our neck of the woods, people either fear or resent him. But really I always thought he just wanted what was best for me. It was largely thanks to his insistence that I was considering Miskatonic U at all. He believes that Charlie Ward, who came from out of nowhere to turn a small program at an obscure college in Rhode Island into a national powerhouse, is a national treasure.</p>\n\n<p>Charlie Ward is something, alright. I’ll give you that.</p>\n\n<p>“So, son, are you a beast or are you a babe in the woods?” He smiled a shit-eating grin  at me, snapping me out of my reverie.</p>\n\n<p>I blinked. I winced. I answered truthfully, “I don’t really know.”</p>\n\n<p>Charlie Ward...winked. “Your reticence is refreshing, lad.. From this side of the recruiting table, I mostly hear jive fronting and macho bullshit. The fact is, you don’t know if you’re a baby or a beast, not yet, and neither do I. But I am damned well gonna have to have a better idea before I offer you a full ride plus perks to come play here. Because babes in the woods are a dime a dozen, you understand, but a man who can summon up Beast Mode when he needs to...well he’s worth his weight in gold. All 350 pounds of him,” and now Coach Ward slapped his desk hard and roared with laughter.</p>\n\n<h1></h1>\n\n<p>When I left Charlie Ward’s office, the first person I saw was Miskatonic’s golden boy quarterback Thurston Wayland. Thurston was about six foot two, with shoulder length blond hair and the dangerous grin of a bad-boy-gone-savage. He was propped, with almost impossible indifference, against a midnight blue Porsche convertible and wearing salmon colored slacks, a dark green Vineyard Vines crewneck sweater cut tight to show off his amazingly blasted pecs, and a Miskatonic Owls letterman’s jacket. A pair of huge, pristine, shit-kicking LL Bean duck boots completed the look. HIs arm was draped indifferently over the  shoulder of this girl, Jenny, who I went to high school with and who was also visiting Miskatonic this same weekend.</p>\n\n<p>Jenny Lake was the other reason I had decided to visit Miskatonic, and to visit on exactly this weekend. I had been in love with Jenny ever since we first met at a Fellowship of Christian Athletes meeting freshman year. My totally softboy crush on Jenny was legendary around school, and it was another reason I was known as Big Baby, I have always believed.</p>\n\n<p>Jenny and I had almost kissed once. It was at Homecoming, this past year. Her date was a frenemy of mine, this guy named Derek. Derek was our halfback, and he was also hot shit with girls. You probably already know what this means--he was one of those guys who used girls and treated them like shit and cheated on them and then threw them aside.</p>\n\n<p>I remember how she  used to spend hours complaining to me about what a dick he was, and I’d let her sit close and I’d drink in her Victoria’s Secret Supermodel perfume and stroke her hand. Derek wasn’t the only guy who did this to her, either--for most of the time I had known Jenny I’d been her big, goofy support system for all her boy problems. I was her best friend. I was her Big Baby.</p>\n\n<p>But that Homecoming night, I think I looked good. I know *she* looked good in a short red skirt and higher heels than she usually wore and a white top that was also a little tighter than she usually wore. It never really occurred to me that maybe she’d been planning for the whole night to put on a little act with me to make Derek jealous and regain some power in the relationship. It’s pretty clear to me now that’s what happened.</p>\n\n<p>We had won the game easily, and I’d been a beast on the field. We were playing The Trojans of nearby Essex High School, and even though it should have been a close game we were so dominant on defense that they never had a chance and we won 41-6. I sacked their QB twice. Forced one fumble. Multiple tackles for losses. I fucking owned</p>\n\n<p>She was standing dangerously close to me, off to the side of the dance floor, head down, leaning way in. That night she wasn’t wearing her usual perfume, it was something fancier--I never got around to asking her what it was. This time she was the one who took my hand in hers and started to stroke it. I can see it all so clearly in my mind’s eye and now I can see, too, that she looked around a couple of times, to make sure he was watching. She told me I smelled good.</p>\n\n<p>I grinned, embarrassed. Usually I just wore Old Spice deodorant, the one with the wolves on it,  but tonight I’d stolen some of my dad’s Armani cologne.</p>\n\n<p>That song by The Weekend everyone loved came on, Call My Name, and even though I never cared much for the song before, when I was standing there holding Jenny’s hand and looking down at her soft, lovely neck as she cooed at me I understood why I’d read something on Buzzfeed about how it was the Top Song to Fall in Love To this season:</p>\n\n<p>“I put you on top</p>\n\n<p>I put you on top</p>\n\n<p>I claimed you so proud and openly</p>\n\n<p>And when times are rough (times are rough)</p>\n\n<p>I’ll make sure to hold you close to me.”</p>\n\n<p>And it was just then that Derek strutted over. He didn’t grab her, knew better than do that in front of me, he just looked at her and talked to me and said “Excuse me, bro, but do you mind if my girl and I go have a little talk?” Then he hit her with a wink and one of this dangerous grins and I could see her blushing.</p>\n\n<p>I started to object but she was too fast and she was hugging me and pressing her face into my huge fat fucking neck and she said “Oh Big Baby, you are so sweet and so kind. Thank you so much for being a friend.”</p>\n\n<p>Back to the present. Thurston, whom I had only seen in passing  earlier in the day, gave a half wave. Jenny  giggled. “Hey, Bruce,” she said, “how was the meeting?”</p>\n\n<p>“Pretty fine,” I answered, moving toward them and extending my hand to Thurston. He looked at my hand for a full beat, and then fist bumped me.</p>\n\n<p>“Sup bro. Hear you’re hot shit.”</p>\n\n<p>“I dunno about that…”</p>\n\n<p>“Well you’d better be hot shit, or we’re gonna run you right the fuck off the team. This squad is not being put together to go out and have fun and make lifelong friendships, bro. I’ve got enough friends. I need to be surrounded with dangerous fucking beasts.”</p>\n\n<p>Jenny giggled, and her peals of genuine laughter dug into me like nettles.</p>\n\n<p>“Pleased to meet you, Thurston,” I finally said, “I’m Big Beast.”</p>\n\n<p>He looked me up and down. “We’ll see, guy, we’ll see.”</p>\n\n<p>A few hours later, I was stumbling around the enormous house Thurston and a couple of other guys from the team rented off campus. They were throwing a raging party at the house, which they called their “Party Mansion.”  It was at the Party Mansion that Thurston introduced me to Reagan Macomber.</p>\n\n<p>Jenny was still the only love of my young life, but nobody ever made me pop a boner faster than Reagan Macomber. She was one of the first people Thurston introduced me to at the party (“Big Beast, this is the baddest slut at Miskatonic; slut, this is Big Beast….”) and she was short and plump with huge tits and wild blonde hair and a midnight blue sweater with a bit crimson M in the middle for Miskatonic.</p>\n\n<p>“Oh hello, Beast,” she said, “we were just shit talking everyone and everything under the sun; so if you don’t have anything nice to say about someone then for god’s sake say it to me.”</p>\n\n<p>A lithe blonde girl, also dressed in a Miskatonic sweater but with a short, neat Pixie cut walked by and grinned lasciviously at Reagan. “Hey sexy,” she said and Reagan purred.</p>\n\n<p>Then, under her breath, once the girl had walked safely on, “God, what trash.”</p>\n\n<p>One of the girls standing in Reagan’s orbit, a mousy girl with a white Forever XXI sweater and a navy skirt on, said “I heard that she tried to buy a shirt in Burberry last week but they wouldn’t take her card because she had used it to cut so many lines of coke it wouldn’t scan right any more.”</p>\n\n<p>“Oh bullshit,” said Reagan, “and I’m absolutely positive she started that rumor herself. That’s just, like a fairy tale of the Reagan Years anyway. You can’t really fuck your card up that way. I’d know. Probably heard it when her dad got drunk and used the same line to try to pick up one of her friends at his country club.”</p>\n\n<p>The mousy girl giggled. “Oh Reagan, you’re the worst.”</p>\n\n<p>“Damned fucking straight,” she said, “I’m the worst case scenario of a privileged youth.”</p>\n\n<p>“Too bad that doesn’t fit on a tee shirt,” I said and Reagan cackled.</p>\n\n<p>“Or a handbag. Jonathan Adler could rip me off and make a fortune.”</p>\n\n<h1></h1>\n\n<p>Several hours later, a hard February snow was falling outside and Thurston announced to the rowdy crowd that it was time for my “initiation into the Mysteries of Miskatonic University.”</p>\n\n<p>“This isn’t gonna be some kinda gay thing, is it bro?” I asked to peals of laughter and whooping.</p>\n\n<p>“Nah bro. This is just a drinking thing.” He reached underneath the rickety, makeshift Ikea bar in the middle of his living room and produced a wooden cask of uncommon primitive beauty. The cask was decorated with stick boys and girls in obscene poses  with each other, and from where I was standing (and as drunk as I was) it looked almost as if the stick figure orgy participants were hovering a few inches above the cask. I also noticed that innumerable tentacles wrapped and writhed their way through the reverie--some wrapped around vulnerable tits, some interrupted suck and fucks by strangling a boy or two, and some just wrapped around or pushed through genitals and assholes.</p>\n\n<p>“Jesus,” I muttered, shaking my head to try to clear it. Again, roars of laughter from the kids gathered around me.</p>\n\n<p>Thurston opened the cask and produced a bottle--more of a phial, really--that was clear and unmarked cut crystal but looked antiquated--the phrase “an ancient desecration, grown more wicked with ageless aeons” bounced around in my brain and all I could do was giggle and mutter, “Is it time to chug?”</p>\n\n<p>The phial contained a pale green liquid that I imagined was glowing. At the bottom of the liquid was a big, pallid, segmented worm, like at the bottom of a bottle of real tequila.</p>\n\n<p>“Look, rook,” said Thurston, “you drink it down, you eat the worm, that’s when the party starts.”</p>\n\n<p>“You drink it down, you eat the worm, that’s when the party starts,” the crowd chanted as Thurston handed me the bottle and I chugged.</p>\n\n<p>“You drink it down, the worm eats you, and that’s when the party starts” the crowd chanted in drunken, hoarse ecstasy.</p>\n\n<p>It felt like the worm came to life in my throat and started to squirm, started trying to crawl its way back up causing a sensation of nausea and so I swallowed even harder, throwing my head back and yelling “Oh shit” as I felt the critter start to slide down ineluctably into my tummy and the Miskatonic kids burst into an orgiastic, cacophonous reverie.</p>\n\n<p>Jesus Christ the colors. I wish I could show you. I wish you could see the colors I saw--it’s up to you to decide whether that’s Big Baby or Big Beast talking.</p>\n\n<p>Then I was floating above it all like a drone, ready to bomb somebody to oblivion. Ready to bomb Big Baby to oblivion. I suddenly felt like I was watching a slow motion video of myself walking through the room--the leading man in a feature film as all eyes were glued to me and everyone waited breathlessly for my next move. My first move was to look around for Lisa. She was gone.</p>\n\n<p>Oh well. Fuck the bitch, I thought, and then started to laugh uproariously.</p>\n\n<p>Thurston threw his arm around me and said, “Shit, son, back in Charleston we’d say you’re happy as a pig who knows he’s friends with the butcher,” and that made me laugh even louder.</p>\n\n<p>Thurston, Reagan and I piled into Thurston’s Porsche and the drink and the worm within were starting to hit very hard and the hard snow that was falling was so many different colors it was impossible to look at it for long without breaking down into incoherent, ecstatic chortles and gasps.</p>\n\n<p>It was a tiny car and I took up almost all of the front part of it, with Thurston pushed all the way against his own door and Reagan on my lap purring.</p>\n\n<p>“Having the time of his life,” noted Reagan, as her hand found my zipper and then unzipped it and her fingers worked their way around my dick and started to tug.</p>\n\n<p>“Christ, boy,” she whispered, “Big Beast is fucking right,” as she enclosed my dick with her whole fist.</p>\n\n<p>I’ve never had such a thunderous orgasm so fast and when I closed my eyes I saw stars--whole cosmoses being born and spinning around at impossible speeds and dying and then I lost track of everything. Just the stars. Mad, insane stars no man should see.</p>\n\n<h1></h1>\n\n<p>I don&#39;t know where we ended up, or even how I got there. I just know I was in a big, wooded field in the middle of a heavy snow and Thurston announced in his syrupy drawl it was time for our &quot;Bacchian Ritual part of the night. This part right here, ahhhh I like to call &#39;The Bacchian Tackling Drill.&#39; Big Beast, this is all you bro. Make it count.&quot; He spun me around and pointed me toward a huge tree.</p>\n\n<p>The tackling dummy dropped down from the limbs of a huge, gnarled, eldritch oak tree in the snowy field,  and I imagined I heard an “oof” as the rope ran out of slack, snapped taut, and the dummy began to sway in the snowy February evening, back and forth, affixed to the tree with heavy, coarse hemp rope. The rope was cinched tightly around the part of the dummy that would have been the chest, and I remember thinking I was so wasted, so fucked up, that it looked like the dummy was moving on its own, squirming and ululating desperately.</p>\n\n<p>I looked out at the swarm of Miskatonic’s best players and hottest cheerleaders, the creme de la creme and the self-styled worst of the worst. The boys and girls swarmed and yelled and all I could see was a crowd scene from a movie and all I heard was a soundtrack of thrilled, breathless murmurs and chants. My gaze was drawn to Thurston’s handsome face like iron shavings to a magnet and for a moment his cocky smile became my whole world. I focused back to the tackling dummy and charged, letting out a scream so hard and high and reckless I felt re-connected to the hoarse, lusty ecstasy of some primal pandemonium.</p>\n\n<p>On impact with the dummy, I felt such a satisfying snap/crackle/pop that my dick popped rock hard and I imagined I could hear the dummy breathing out a single, panicked exhalation--like I was feeling its last real breath and part of me wasw (Big Beast) beginning to vibe on its own awareness that the rest of its life was nothing more than the panicky, desperate gasps of a marlin dying on deck of a fishing boat.</p>\n\n<p>It was just a dummy, of course, just a thing. ;)</p>\n\n<p>The crowd went nuts, and the voices of the hardbodied, wild-eyed cheerleaders were the loudest and craziest and then I heard Thurston’s own velvet smooth baritone voice drawl, “HIt it again, bro! Fuckin’ beast mode!” and so I did. I threw another hard shoulder block and felt another impossibly satisfying crunching sensation.</p>\n\n<p>“Beast mode, bitch,” yelled Reagan and, suddenly overwhelmed, I sank my teeth into the dummy, right where its throat would have been, and felt something disconcertingly like chicken skin and cartilage, like meat and bone, and then I heard an hysterical, bloodthirsty scream from Reagan and I chomped down, sank my teeth all the way in and bit and tore and ripped until the stuffing was coming out of the dummy’s throat and I tasted salt and iron and I tore in deeper and harder because I wanted more.</p>\n\n<p>The next morning, I woke up alone.</p>\n\n<p>I was lying in bed in a cold, barren dorm room. The room contained the bed I was lying in, a window on the far wall, a door on the opposite wall, a desk, a red plastic wastebasket, and a mirror. The wall was painted a charmless institutional yellow that made me think about the short story about the woman who goes nuts staring at her own yellow wallpaper.</p>\n\n<p>The first thing I did was try to piece together the night before by scrolling frantically through my phone. I landed on a Facebook message from Thurston. It read, “Brace yourself, Big Beast, and get ready to put on a big smile for signing day. :) “ It contained a link that led me to a video.</p>\n\n<p>30 seconds into the video I reached for the wastebasket and puked up my guts and sobbed through the heaves. Chunks of food and bile splattered against the plastic bucket. You know what never came up? That goddamn worm.</p>\n\n<p>The video showed my “Bacchian Initiation” from the night before. It showed the “tackling dummy,” obviously Julie Lake bound and probably gagged inside a humanoid shaped burlap bag, drop from the tree limb and dangle down like a great broken necked beast. I could see and hear my drug-intensified hits land on the defenseless girl, over and over--I could guess, from the crunching noises and from watching the ululations the bag made, at what point which bones were broken. With the sounds of the crowd conveniently edited all the way down, I could hear her pleas for mercy on the tape, hear her bones breaking and big blood bruises being raised as I hit her body over and over and to anyone who watched the tape, it looked like I was having the time of my life.</p>\n\n<p>I guess I was. But still. For God’s sake, I couldn’t hear her so clearly. I couldn’t hear her at all in the moment, I’m sure. Pretty sure.</p>\n\n<p>When the footage cut to the part where I literally tore her throat out with my jaws and teeth while I whooped and laughed hysterically, I could feel a hot, stinging sensation on my back which would turn out to be a nasty case of hives breaking out instantaneously like some Biblical curse of boils. I cried. I puked. I cried. I surrendered.</p>\n\n<p>There was one last shot. This was after I had torn the bag to shreds, and after the drugs had taken over so much that I had staggered off to the bushes to puke and was therefore out of frame. The bag finally broke open and Jenny’s bloody and broken body hit the snowy ground with a thud. Rivulets of black blood ran from her body and formed black reservoirs in the white snow. Her left wrist hung limp and disconnected, like a vampire bat from a cave ceiling. Her right eye had become disconnected from the brutal hits and was hanging languidly out of the socket, barely still in place. An owl flew down from the tree and began to peck placidly at the eye.</p>\n\n<p>By now I only lay on the bed, shaking, and waiting for the phone call from Charlie Ward that I knew must be coming, laying out the situation for me and telling me what I already knew--if I didn’t want the video released to TMZ and ESPN I’d be committing to play for the Owls that very afternoon.</p>\n\n<h1></h1>\n\n<p>This past season, I put together the most incontrovertibly Beast Mode freshman year in the history of Miskatonic. I never told my dad about the blackmail video--something deep in my lizard brain forewarned me that it might be all too easy to see through the shuck and jive shock and outrage he might front with. There was just something about the way his eyes looked all those times he assured me Charlie Ward was “one of the few men in this country worth who’s worth a damn.” Well okay, dad. How much did *you* know and when did you know it, I’d love to know.</p>\n\n<p>YOLO, I guess. No more Big Baby--I was three miles of bad road into Big Beast territory and I never had any intentions of looking back (because god help me if i got a glimpse of whatever was chasing me).</p>\n\n<p>Yesterday, something terrible happened. I guess that’s why, well over a year after that party, I’m finally writing this. I want to tell the story while I’m still capable of thinking that this last part is pretty bad; because bro, the worst part of all of this is that now when I look back on the shock and revulsion I felt at seeing the tape of what I did to that girl, to Jenny, I just can’t really feel any feelings anymore. That’s part of being in Beast Mode.</p>\n\n<p>Thurston says now I’m in God Mode, or getting there. Maybe God Mode entails an annihilation of anything resembling a conscience. Maybe it’s unavoidable by now. But I want to feel feelings about this, about what I’m becoming and all the damage I’m causing-- feelings of horror and outrage, at least one more time while I still can.</p>\n\n<p>As has so often been the case, a new terrible thing happening to me was presaged by Thurston approaching me with a big, beatific grin.</p>\n\n<p>“Sup, Beast Mode,” he asked me and I grunted noncommittally.</p>\n\n<p>We were sitting together in my admittedly pretty filthy room in my frat house on a warm Wednesday morning. Thurston had shown up unannounced a few minutes earlier, bearing a gift--a big box wrapped with race car patterned wrapping paper and topped with a shiny red bow. “Except,” he went on, “you’re not really Beast Mode anymore, are you?”</p>\n\n<p>“I”m not? The fuck, bro--your time of the month or what?”</p>\n\n<p>“No man, I just mean, don’t be modest and shit,” he cut me off. “You’ve been fucking dominant. You’re beyond just beasting, son.  We’re top ten for the first time ever last season, and most of that IS me,” and here the son of a bitch winked, “but a whole lot of that has been you too. Shit, bro, you’re not Beast Mode anymore, you’re fuckin’ God Mode.”</p>\n\n<p>I grinned like a goon. God help me, I loved the approval. I sensed something frightful was about to happen too, though, and I definitely wasn’t grinning about that. Probably.</p>\n\n<h1></h1>\n\n<p>I screamed and screamed. I screamed so loudly that Thurston cranked up the A$AP Rocky track we were listening to all the way and put his hand over my mouth and then spun me around to force me to keep looking at the open box.</p>\n\n<p>The first couple of things I saw hadn’t made any sense to me, hadn’t even seemed coherent--a pink wad of flesh that had a gaping hole in the middle, and a pair of blobs of what looked like flesh--but then I saw Jenny’s head. I saw her eyes staring back at me lifeless but somehow aware, somehow greedy and licentious and her lips permanently fixed in a kind of come-hither grin.</p>\n\n<p>I kept screaming and sobbing into Thurston’s hand but it was useless. “Chill, bro, chill. It’s not that deep. You’re a God now, and what a God vanquishes belongs to him. The most important parts, anyway.”</p>\n\n<p>I sobbed.</p>\n\n<p>“All the relevant parts of a woman, right there buddy. And they all work. Can’t be too sure what’s going on behind the eyes, to be honest, but I don’t really give a fuck. Mouth and tongue work just fine, and there are still eyes there to admire you. Man, Charlie Ward is a fuckin’ wizard, ain’t he?”</p>\n\n<p>A necromancer, in fact.</p>\n\n<p>“All of us who made elite status--you know, the “God Mode” types--all of us get our own servant like this one, to carry with us wherever we want.</p>\n\n<p>I bit down on my finger until it bled. Thurston slapped me on the back, “I know it takes some getting used to bro, but believe me, you haven’t felt ANYTHING like what you’re gonna feel once you just learn to relax and take what’s yours.”</p>\n\n<p>When Thurston left, I put the box under the bed. Resolved to never, ever take it out, until I could figure out whether I could somehow set Jenny free by just destroying it. Ran into the bathroom and puked and rinsed my mouth out and puked some more.</p>\n\n<p>And bro, that box has stayed under my bed for a week now. But here’s the thing: Now that I am, as you might say, God Level at America’s favorite sport, don’t I deserve a few things I’ve always wanted? And goddamnit I was patient with Jenny and I waited my turn and now maybe my turn has finally arrived? And what have I wanted more desperately, fiended for longer, than Jenny Lake’s face and mouth and tits and pussy?</p>\n\n<p>I can’t believe I’m thinking these words.</p>\n\n<p>I can’t believe I’m typing these words.</p>\n\n<p>I just keep looking at that box and now I’ve opened it and I’m looking right into her gorgeous, still absolutely perfect face and looking into her eyes, gazing into that gazeless gaze.</p>\n\n<p>They used to call me Big Baby and I used to be the nicest guy in the world. I swear to god they used to call me Big Baby and I used to be the nicest guy in the world and I used to think that made me a good dude, too.</p>\n\n<p>But oh, Jenny Lake.</p>\n\n<p>I continued staring at the box and its contents and I put our song on.</p>\n\n<p>“I put you on top</p>\n\n<p>I put you on top</p>\n\n<p>I claimed you so proud and openly</p>\n\n<p>And when times are rough (times are rough)</p>\n\n<p>I’ll make sure to hold you close to me.”</p>\n</div>\n","author":"goldvine_throwaway"}