{"rank":"0","title":"Just little changes","id":"8k6tpz","url":"/r/nosleep/comments/8k6tpz/just_little_changes/","time":"1526583945000","body":"<div class=\"md\"><p>First off, you should probably know, I&#39;m not human.  Not completely, maybe about 93&#37;, give or take a bit.  I&#39;m actually an Otherkin.  Laugh if you want, I know the reputation surrounding that term, but the fact remains that I have elven and fae blood in my veins.</p>\n\n<p>Now, usually, this doesn&#39;t have a huge impact on my day-to-day life; my average day is probably like that of most people (get up, go to work, come home, eat, spend time with family, entertain myself, go to bed, rinse, repeat), but it does mean a certain level of weird every now and then is par for the course.  Once in a while, elves in the area might say hi.  Computers or other electronics will sometimes get weird errors in my presence.  I can walk in a fairy circle without much worry.  Sometimes little things go missing that shouldn&#39;t.  Just little oddities that don&#39;t usually happen to full humans.</p>\n\n<p>I was a teenager the first time I found a fairy gate.  I was with some friends in a park late in the evening one fall, and we were trying to find our local Earth Node by sensing it out.  Well, silly fae-blood me kept veering off to one side, being drawn to the gate.  My mortal eyes couldn&#39;t see anything, but to my third-eye sense, it was so big and bright and pretty, full of faerie-fire in shades of orange, pink and purple.  I didn&#39;t try to go through it, and even if I did, I&#39;m sure my blood is too thin to allow me to pass, but it was like a magnet to my senses.  Sadly, years later, it&#39;s not there anymore.  I&#39;ve gone looking.  To this day, I have no idea who or what may have crossed it going either way while it was there.</p>\n\n<p>It wasn&#39;t long after finding the gate when I started dating another Otherkin, though he wasn&#39;t elf or fae, but rather a demonkin (yes, yes, I know, but I was young and my judgment then was not what it is now).  Our relationship lasted a little over 2 years, and though we didn&#39;t marry, that didn&#39;t stop me from getting pregnant.  Twice.  We didn&#39;t plan it; it just happened, as such things often do when you&#39;re young and dumb.  The first one miscarried, and the second was my  son, my &quot;rainbow&quot; baby, conceived about a month before his sibling would have been born had that one survived.  My son was conceived on a Friday the 13th under a full moon.  Again, not planned, it just happened that way.  And then, funnily enough, he was born 6 days after another Friday the 13th.  He&#39;s never met his sire, as we parted ways when I was six months along (due to him lying, cheating and stealing, but that&#39;s another story).</p>\n\n<p>Lucky for me, my son takes after me a lot.  He&#39;s an Otherkin too, and seems to have embraced being part elf and fae, and I&#39;ve really not seen any trace of demon heritage so far, though he has an astral wolf for a spiritual companion, just as his sire did.  My son looks almost just like me.  He&#39;s interested in a lot of the same things, although he&#39;s much more into science and math than I ever was; he wants to be an inventor someday.  He has such ideas.  He once asked me where he could get radioactive material to build a nuclear device to power a time machine.  He&#39;s also said he wants to build a machine to make him (and me, and our cat) immortal so we never have to die.  He even has his own little &quot;lab&quot; in our basement.  He&#39;s so creative.</p>\n\n<p>My little boy is growing up, he&#39;s a tween now, but he&#39;s a good, sweet kid.  Of course, as he&#39;s gotten older, he&#39;s had his share of little oddities happening around him too, but that&#39;s normal for our kind.  Just the other day, I found another fairy gate in our back yard, near the basement window by my son&#39;s lab.  It&#39;s oddly tiny--just about big enough for maybe a cat or a rabbit or other small creature could pass through it, and it doesn&#39;t look like the one I remember.  The light is more red, not the colors I usually associate with faerie fire.  Maybe it&#39;s just because the opening is so much smaller, but I swear it&#39;s bigger today than the first time I found it.  </p>\n\n<p>And, of course, as my son approaches puberty, he&#39;s been starting to undergo some changes too.  He&#39;s started to get occasional pimples.  His skin is getting drier elsewhere, and he often has red or itchy spots, especially by his shoulderblades.  He&#39;s developed a nervous habit of tugging at his hair to the point that he has a little bit of a bald spot under his bangs.  Sometimes, it sounds like he&#39;s having a conversation in his room, but he might just be playing, or maybe I&#39;m just hearing him playing on his tablet or watching a movie, as he loves to do.  Sometimes he just zones out for no reason, just staring into space.  I&#39;ve noticed an increase in little cuts and bruises on him too, but probably just part of being a normal boy.  He&#39;s starting to ask questions about subjects he&#39;s never asked about before.</p>\n\n<p>Still.  It&#39;s only a matter of months before he turns 13, and I just can&#39;t help but wonder what will happen then.</p>\n</div>\n","author":"Ardruna"}