{"rank":"10","title":"It was me, Papa.","id":"8k6ybp","url":"/r/nosleep/comments/8k6ybp/it_was_me_papa/","time":"1526584908000","body":"<div class=\"md\"><p>“But it was me, Papa. It was me,” I screamed at him as he hit the boy once more. His much bigger physical ability pushed me back onto the ground beneath the deep moonlight. He curled his hand and slung his fist once more at the badly beaten boy, blood pooling beneath him. I curled my knees into my chest with tears streaming down my face. </p>\n\n<p>My papa released the boy who fell straight away to the ground and collapsed. Papa then walked over to me, reached down with his big hands with now scuffed and bloody knuckles grabbed my shoulder and stood me to my feet. “C’mon boy, get in the car,” he said violently. I rushed quickly to the car because after the incident I just witnessed, I was too scared not to obey. I stared at the boy’s still limp body as we slowly backed out and pulled away. </p>\n\n<p>I didn’t say a word for the remainder of the trip home. I just stared blankly out the window at what few stars were peeking through on such a cloudy night. We got in the door and mom asked me why we had been gone for so long. My eyes grew wide as I caught Papa glaring at me. I stumbled for words when he interrupted me, “They were just working a little late and I tried to help them out but got my hand all busted up.” I shook my head in to agree before vanishing to the shower and quickly off to bed for the night.</p>\n\n<p>As I lay in my bed, I replayed the accounts of what had taken place that night. I was only thirteen and had gotten my first summer job working at a decent sized flower farm in Franklin, the next town over. I was the youngest of the nine boys who Farmer Jesse hired to work his farm that year. It was a hard job, very dusty, and very low pay. However, for those of us that were younger than 16 would normally find a job at Jesse’s flower farm weeding and drying flowers. To make a long story short, the farmer’s wife caught me through the window stealing a watermelon off the back of their farmer’s market truck, taking it over behind one of their hay barns, cracking it open, and eating it. She immediately got word to Farmer Jesse, who promptly came over and fired me. </p>\n\n<p>They allowed me to make a phone call home (since this has been 20 years ago before smart phones). I couldn’t get anyone, but acted like I was talking so I could get out of there so I could let me emotions go. I walked to the end of the long driveway and sat down by the gate at the end of the road. My papa normally would come and get me around 7:00 pm and it was already 6:00, so I would just wait it out.</p>\n\n<p>Of course, when Papa showed up he asked me why I was waiting by the post instead of the home like normal. I burst into tears and told him such a weird lie to keep from getting in trouble. To summarize the big lie, I more or less told him that Jack was sneaking around picking apples off the trees and eating them. Then when farmer Jesse asked him about it he lied and said it was me doing it. I guess I thought papa would buy that lie and it would all blow over, but it didn’t. Papa’s face turned a blood red. He whipped that car into the driveway and hit it as fast as he could. I don’t remember a whole lot to the story except for Papa and Farmer Jesse standing in front of the farmhouse porch yelling, pointing, stomping, and pushing going on. When Papa got back into the car he was hot. He was fuming and to a point of anger I’d never seen.</p>\n\n<p>We had left the farm, and drove fast down the driveway. Franklin had small country roads with little traffic which made me gasp in the pit of my stomach when we passed Jack, the local Franklin boy who I just blamed my firing on. I had honestly hoped for a split second that Papa didn’t recognize him. However, as he began to slow down I instantly knew he did. Papa pulled over into a little country road pull off that had been overgrown for some time. When Jack finally made his way to the pull off, that’s when Papa stepped out of the car and approached the boy. I sat in the car and hunkered down, hoping not to be seen. Papa grabbed Jack by the shirt and walked him over to the backside of the pull-off yelling the whole time. I couldn’t make everything out except for Papa yelling, “Don’t lie to me @$#%!!” After about 2-3 minutes of this is when I saw it happen. Jack was tired of being called a liar and spit in Papa’s face. This was the final nail in the coffin and Papa just started punching.  I unbuckled and rushed out of the car to try and grab Papa’s arm yelling, “But it was me, Papa. It was me!”</p>\n</div>\n","author":"atticuslodius"}