{"rank":"1210","title":"You have new DNA relatives [Part 2]","id":"8k7dje","url":"/r/nosleep/comments/8k7dje/you_have_new_dna_relatives_part_2/","time":"1526588185000","body":"<div class=\"md\"><p><a href=\"https://www.reddit.com/r/nosleep/comments/8jx1b6/you_have_new_dna_relatives/\">Part 1</a></p>\n\n<hr/>\n\n<p>I stared out the peephole.</p>\n\n<p>It was me. The same blonde hair, pointed chin, dainty little hands. She was dressed differently, sure – a coral top, white shorts – but she was me all the same.</p>\n\n<p><em>Clack. Clack. Clack.</em></p>\n\n<p>“Hello?” she called, her voice muffled through the door.</p>\n\n<p><em>My</em> voice. </p>\n\n<p>I wanted to pull away, but I couldn’t stop staring. My face, outside of a mirror, looked eerily different. I had never seen it in three dimensions before – now, my nose looked more bulbous, my eyes deeper set. And I was used to seeing the mirror image of my face – used to my right eye looking bigger, not my left.</p>\n\n<p><em>Clack. Clack. Clack.</em></p>\n\n<p>“Someone in there?”</p>\n\n<p>The vibrations shook the door, pressed against my chest. I took a step back.</p>\n\n<p>That was a mistake. My foot hit a creaky floorboard. <em>Creeeaaak</em> – a shrill, high-pitched whine, echoing through the house.</p>\n\n<p>There was a pause outside –</p>\n\n<p>And then the racket began. </p>\n\n<p><em>Clack! Clack! Clack!</em></p>\n\n<p>“Let me in! I just need to show you something!”</p>\n\n<p>I recognized that tone of voice. It was the one I used when I told Mom I broke up with Mike, when I said I was feeling fine two days after the accident…</p>\n\n<p>It was my <em>lying</em> tone of voice.</p>\n\n<p>I backed away from the door.</p>\n\n<p><em>Clack! Clack! Clack!</em></p>\n\n<p>Her tone grew angry, now. Loud. Desperate.</p>\n\n<p>“Let me in! Callie, <em>let me in!</em>”</p>\n\n<p>I ran into the bedroom. Locked the door, piled up chairs and bookshelves against it. I pulled the curtains shut, even though my window faced the backyard, and threw the covers over me.</p>\n\n<p>For several minutes, the noise continued. But, finally, I heard her leave. <em>Click.</em> Shoes on stone. <em>Bp-bp-bp.</em> The rumble of a car’s engine. I peered through the slats in the blinds, and saw a beat-up Fusion rolling out of my driveway. There was dirt caked in the tires, and splattered up the sides, and I wondered for a second where the hell she had come from.</p>\n\n<p>Then she was gone.</p>\n\n<p>But I didn’t dare go outside. Instead, I spent an hour barricading all the windows and doors in the house. Then I flopped on the bed, pulled out my computer, and turned to the one thing that had never failed me before: Google.</p>\n\n<p><em>DNA relatives 100% match</em>, I typed. Then <em>relatives have same DNA as me.</em> Of 7 billion people in the world, one of them has to be going through this too, right?</p>\n\n<p>I tried every permutation of keywords, scouring even the second page of the results. But all I got were ads for ancestry companies, blogs about the “DNA kit experience,” and spam.</p>\n\n<p>But I persisted. And after an hour, two cans of root beer, and 46 searches – I found it.</p>\n\n<p>EIGHT BODIES FOUND – ALL MATCH DNA OF JOHN DUDEK</p>\n\n<p><em>On March 22nd, Chesterton Police found a body in the woods near the local elementary school. Over the next two weeks, they would find seven more.</em></p>\n\n<p>My eyes widened. I scanned over the text.</p>\n\n<p><em>Curiously, each died of the same cause: severe arrhythmia of the heart. And, even more curious, each matched the DNA of John Dudek.</em></p>\n\n<p>It wasn’t just me.</p>\n\n<p>This was happening to other people. My heart began to pound, and I opened another tab. My fingers raced across the keyboard, typing every keyword I could think of –</p>\n\n<p><em>Riiiing!</em></p>\n\n<p>I yelped in surprise, and nearly fell off my seat. “Hello?”</p>\n\n<p>“Where are you?!”</p>\n\n<p>Oh. I forgot. I was supposed to be in the machine shop today, with Corrine and the rest of our team, as we finished up our turbine for Engineering Design. She was going to be <em>furious,</em> as I’d already skipped a few of the meetings last week.</p>\n\n<p>“Corrine, I’m so sorry, but I’m feeling sick.” I faked a cough – <em>eh, em.</em> “Must be the flu or something – I really feel awful.” Well, at least <em>that</em> part wasn’t a lie.</p>\n\n<p>“Cut it out.”</p>\n\n<p>“Uh – what?”</p>\n\n<p>“You’re lying.”</p>\n\n<p>“No, I’m not –”</p>\n\n<p>“I just saw you in the hallway two minutes ago. Walking hand-in-hand with Mike. You’re not sick – you just want to play hooky.”</p>\n\n<p>I felt the blood rush out of my head.</p>\n\n<p>“Get your ass down here. We need you. One of the brackets is cracked, and we still need to CNC the blades, and –”</p>\n\n<p>I hung up.</p>\n\n<p>Then I ran into the bathroom. Splashed water on my face. My reflection stared back at me from the mirror – where it belonged.</p>\n\n<p>I walked back into the bedroom and collapsed on the bed. <em>Everything is falling apart.</em> First the accident – Mom and I, T-boned by a pickup truck at the intersection of 1st and Maple. Then me, taking a turn for the worse in the hospital… almost dying…</p>\n\n<p>Now all of this. Whatever <em>this</em> is.</p>\n\n<p><em>Ping.</em></p>\n\n<p>The sharp ping of my phone brought me back to reality. I turned it on and read the notification.</p>\n\n<p><em>Mike Platt updated his profile picture.</em></p>\n\n<p>“What?” I muttered. “Mike never goes on Facebook…”</p>\n\n<p>I clicked on it.</p>\n\n<p>It was a photo of us, sitting under a cherry blossom tree. His arms were wrapped around my waist, and my face was snuggled into the crook of his neck. He was smiling, and I was grinning, as if sharing in some private joke.</p>\n\n<p>But it wasn’t me.</p>\n\n<p>It was <em>her.</em></p>\n\n<p>Coral top. White shorts.</p>\n\n<p>And missing my tiger tattoo, on the nape of her neck.</p>\n\n<p>I stared at the photo until it was burned into my eyes, until I saw the afterimage floating on the white walls of the room.</p>\n\n<p>And then a hot anger bubbled deep within me, replacing the fear. I stood up. Pulled on a sweater, slipped on shoes. Yanked the door open and stepped out into the cool spring air.</p>\n\n<p>It took me ten minutes to drive to campus. When I got there, she was waiting for me, standing in front of the cherry blossoms.</p>\n\n<p>As soon as I rolled to a stop, she yanked the door open and climbed in.</p>\n\n<p>“Knew that would get your attention,” she said, with a sly smile.</p>\n\n<p>“Now, drive. I have something to show <a href=\"https://www.facebook.com/scaryblair\">you.”</a></p>\n</div>\n","author":"BlairDaniels"}