{"rank":"152","title":"A demon cured my son of autism","id":"8k7ezp","url":"/r/nosleep/comments/8k7ezp/a_demon_cured_my_son_of_autism/","time":"1526588501000","body":"<div class=\"md\"><p>I was at work when I got the phone call. My son had been in a horrific accident while he and my wife were away visiting family. He was riding on a small utility trailer when it flipped over and ended up landing on top of his head. </p>\n\n<p>Three hours and many lane changes later I met my wife in the hospital lobby. We embraced and she held me tight for a moment. With tear filled eyes she whispered, &quot;you need to prepare yourself.&quot;</p>\n\n<p>I didn’t remember walking into the elevator. Nor did I remember my wife leading me by the hand to my son&#39;s bedside. But suddenly there we were, the three of us together. Several machines and monitors beeped as we looked on. He had wires attached all over his scalp like he was someone&#39;s science experiment. </p>\n\n<p>Soon after I arrived a pair of doctors came in. An older looking one spoke first. The true scope of what happened hadn&#39;t hit me yet. I picked up on a few phrases like &quot;multiple skull fractures&quot; and &quot;internal bleeding.&quot; The other doctor a young woman, told us that we might want to call any family or friends. His injuries were grave and the outlook wasn’t good.</p>\n\n<p>As we both sat at his bedside, I started to think about how we got here. And about how unfair this whole thing was. The kid had a hard life growing up, even at the young age of 13. He&#39;d been in and out of hospitals since his was 18 months old with various ailments.</p>\n\n<p>But it was a diagnosis he had received a few years ago that had hit his mother and I the hardest: autism. And the truth was I had been in complete denial about it the whole time ever since I first heard it four years ago.</p>\n\n<p>He was on the higher end of the spectrum, but it hadn&#39;t made things any easier. Yes, he was bright for his age, always had been. But socially he was behind. He had a hard time making and keeping friends. And he was prone to fits of anger and embarrassing behavior in public.</p>\n\n<p>I couldn’t even remember the last time we had gone out to a restaurant together as a family. The weight of the diagnosis was getting to us.</p>\n\n<p>We tried different therapies but they never to help for long. Medications were tricky as well. And now I would have to sit by helpless and watch my son die before my eyes.</p>\n\n<p>The hours ticked away with doctors and nurses checking the machines. One was monitoring brainwave activity…there didn’t seem to be much going on there. </p>\n\n<p>The hospital became our new home, with neither one of us wanting to leave his side. </p>\n\n<p>Things came to a head one day when the doctors came in and said they needed to speak with us. &quot;There hasn’t been any changes in his brainwave activity. We&#39;re sorry, but the truth is even if he somehow survives and regains conscientious, he&#39;s going to be a vegetable the rest of his life.&quot; They asked us if we would consider signing a consent for organ donation.</p>\n\n<p>My wife broke down as the doctors exited the room. It wasn’t soon before I could feel the tears force their way out, and I held my wife as we both cried next to our son&#39;s bed. </p>\n\n<p>We decided that if nothing changed by the morning, we would sign the consent for organ donation.</p>\n\n<p>Later that night I woke up out of a deep sleep. My neck hurt from sitting in the awkward hospital chair. I looked over at my wife and saw she was still sleeping.</p>\n\n<p>I got up and took a walk. The only other people I saw at the time were a pair of nurses on duty. They were sitting at their desk, typing away at their computers. The pediatric ward was still and quiet, minus the continuous array of beeps from the machines behind me.</p>\n\n<p>I made my way to a visitors lounge. It was empty and I walked over to the set of large bay windows overlooking the parking lot. I stretched my neck and shoulders some more. The sight of a man sitting in one of the chairs facing my direction startled me when I turned around. &quot;Shit, I&#39;m sorry I didn’t hear you come in.&quot;</p>\n\n<p>&quot;No problem at all…rough night?&quot; </p>\n\n<p>I took a seat and stared up at the ceiling, leaving a couple empty seats between us &quot;you could say that.&quot;</p>\n\n<p>I heard the man stand up out of his seat and then sit down next to me. &quot;I can help you, Scott.&quot; </p>\n\n<p>He was well dressed like he was in a high ranking corporate position of a company. He carried a straight solid oak cane. Shaped liked a distorted human face, the top of it drew my attention.  &quot;What did you say?&quot;</p>\n\n<p>He leaned in closer, his thin white beard almost touching my cheek &quot;I said <em>I can help you.</em>&quot;</p>\n\n<p>&quot;How do you know my name? Because I&#39;m sure we&#39;ve never met.&quot; I leaned back a bit from him as I spoke.</p>\n\n<p>He leaned away from me &quot;oh that’s not important right now <em>what is though</em> is what I can do for you. Right here, right now. Tonight.&quot;</p>\n\n<p>&quot;What can you do?&quot;</p>\n\n<p>&quot;Save your son man!&quot; He shouted and then stood up. He walked a few paces before spinning back to me, pounding his cane on the floor while extending his other arm to me. &quot;I can save your boy!&quot;</p>\n\n<p>I looked out the door into the hallway. I thought for sure one of the nurses overheard us and would come barreling down the hall at any moment. But no one did. I looked back at the man, who was waiting to continue our conversation.</p>\n\n<p>&quot;Wh--what?! How?&quot;</p>\n\n<p>He smiled at me and slowly retook his seat next to me. &quot;Nothing complicated at all…a simple exchange as a matter of fact.&quot;</p>\n\n<p>He stopped and then continued, &quot;and I&#39;ll even throw in a bonus special for you…I&#39;ll make him more <em>normal.</em></p>\n\n<p>&quot;Normal?&quot;</p>\n\n<p>&quot;Come now Scott, let&#39;s face it. You always wanted him to be more like the other boys his age. More athletic and into sports, like you used to be. In fact, sometimes you don’t even really like him do you?&quot;</p>\n\n<p>He was right. Let the world know I loved my son as a father should, but ever since that word was thrown at us my world had been jarred. And yes, sometimes I wished he would be more normal.</p>\n\n<p>I waited a bit before answering. &quot;How?&quot; He had peeked my interest.</p>\n\n<p>&quot;All you have to do is say yes. And it&#39;s done.&quot;</p>\n\n<p>&quot;That’s it? Just say yes? No blood or contract?&quot;</p>\n\n<p>The man gave a hearty laugh at that. &quot;Oh please, that would be quite messy. And unnecessary as my deals are a bit different.&quot;</p>\n\n<p>&quot;Deals? What are you?&quot;</p>\n\n<p>He leaned in again, this time flashing a pair of black empty eyes at me. &quot;Well, I&#39;m no angel.&quot; He laughed again.</p>\n\n<p>Despite not being a believer at all in such things good or evil, I was still horrified. But something deep down within me, call it selfishness, compelled me to give the only answer I could. &quot;Ok then…yes.&quot; </p>\n\n<p>&quot;Excellent…as promised your boy will wake up tomorrow, alive and well.&quot;</p>\n\n<p>&quot;You said something about an exchange?&quot;</p>\n\n<p>&quot;That will be dealt with in good time…for now, enjoy your second chance with your boy. Pleasure doing business.&quot; </p>\n\n<p>And like that he was gone. Vanished into thin air before my eyes. I ran out into the hallway, but he was nowhere to be seen.</p>\n\n<p>The next day I woke up to the most beautiful thing I had ever heard. &quot;Daddy…&quot;</p>\n\n<p>The doctors had no medical explanation for it. They said it was impossible, a true miracle they called it. But they didn’t know what I had done. The whole time while we were in arms crying and laughing I felt a creeping dread come over me. I didn’t know what the price was going to be. But I knew it&#39;d be high considering the source of this miracle.</p>\n\n<p>The next few months were difficult though, even with our boy back from the brink. His recovery was slow and painful at times. He&#39;d need lots of physical therapy, but it was worth it. We had him back, and with it came a second chance for us all to reconnect. But still, that feeling of dread loomed over me.</p>\n\n<p>And it wasn’t long until we noticed changes in our son. He seemed more calm and relaxed, in fact, he didn’t even have a single outburst since he had woken up. But it wasn’t all positive. </p>\n\n<p>He no longer showed any interest in his past favorite pursuits. As much as I hated having to pick up his many <em>Diary of a Wimpy Kid</em> books off the floor, I didn’t even see him touch them once. Science or animated movies no longer held his interest anymore either.</p>\n\n<p>He had become a former shell of himself. Everyone said he&#39;d come back around once he fully healed, but in the pit of my stomach, I knew what I had done.</p>\n\n<p>I had taken his identity from him. The autism wasn’t his diagnosis or disease. It made him who he was…it was <em>his</em> soul.</p>\n\n<p>So I&#39;m going to do the only thing I can. I&#39;m going to find that monster…that demon and make him fix my son all the way. And I know I&#39;ll have something he&#39;ll want. I think it&#39;s what the price was to begin with.</p>\n\n<p>Exchanging my soul shouldn’t be hard.</p>\n\n<p>After all, I gave away my son&#39;s without a <a href=\"https://www.facebook.com/SANewmanNosleep/\">second thought.</a></p>\n</div>\n","author":"SA_Newman"}