{"rank":"7","title":"Red Cross Helicopter","id":"8k7gc3","url":"/r/nosleep/comments/8k7gc3/red_cross_helicopter/","time":"1526588795000","body":"<div class=\"md\"><p>My friend Jessica used to race cars with her dad,Mike. One night they were headed back to Los Angeles after a race in the desert when Mike pulled the car over because of an accident that had happened just minutes before they got there. Mike woke Jessica up, asked her to call the police, and went to check on the passengers. Both cars were totaled. In one car, two hysterical teenage girls; in the other, a couple in their mid thirties. Mike stayed with and spoke to the four of them until the paramedics arrived, instructing them to stay calm and most importantly insisted that they stay still, and not take off their seatbelts until evaluated.</p>\n\n<p>Jessica was impressed. She knew her dad had experience in the racing world, but was taken aback by the confidence with witch he managed the situation on his own. When the paramedics finally did arrive and Mike came back to the car, Jessica felt compelled to say something. </p>\n\n<p>“Dad, you were incredible out there. You really kept everything together and kept everyone calm and safe. That was amazing.” </p>\n\n<p>Mike shrugged her praise off, </p>\n\n<p>“The Red Cross Paramedic did all the work.”</p>\n\n<p>“Dad, the paramedics just got here. What are you talking about?” </p>\n\n<p>“No no, there was a Red Cross Paramedic there with us before the other team arrived, she must have gotten there before us.” </p>\n\n<p>Jessica thought about challenging him further, but reasoned that her father was probably in shock and confused and decided she would bring it up later. </p>\n\n<p>After everyone had been taken to the hospital, the cars had been removed, and the street cleaned up, the Fire Chief came up to Mike and thanked him with a sentiment similar to Jessica’s,</p>\n\n<p>“Thank you, Mr Workman. For sticking around until the end, and also for taking care of everyone before we got here. Barring a few broken bones, everyone is going to be OK and I’m not sure that would be the case if you hadn’t kept them still and calm before we got here” </p>\n\n<p>“Happy to have been able to help” Mike replied,“butlike I told my daughter earlier, the Red Cross Paramedic that was first on the scene is really to thank, not me.” </p>\n\n<p>The fire chief furrowed his brow, and said what Jessica wouldn’t, </p>\n\n<p>“Sir, you and your daughter were first on the scene, we only got here after you called.” </p>\n\n<p>At this point Mike was getting frustrated and repeated himself for the 3rd time, </p>\n\n<p>“Before you and your team got here, there was a woman! A blonde middle aged woman in a blue jumpsuit who was part of the Red Cross Helicopter squad. I only did what she told me to do in order to help before the rest of the team got here. She is to thank, not me!” </p>\n\n<p>With this, the fire chief’s face went white. Two days prior, just a few miles from the accident, the Red Cross Paramedics Helicopter went down. All 4 paramedics on board died. Mike described one of them to a tee. </p>\n</div>\n","author":"Lusmellslikepopcorn"}