{"rank":"4","title":"I need to tell you about Ooma - Part 1 of 2","id":"8k7lct","url":"/r/nosleep/comments/8k7lct/i_need_to_tell_you_about_ooma_part_1_of_2/","time":"1526589872000","body":"<div class=\"md\"><p>I&#39;m spending part of my spring volunteering at a hostel. It&#39;s a pretty good gig; accomodation is free and you get a couple days off, and most of the food is free as well. We (6 of us total) sleep in a dorm together.</p>\n\n<p>In exchange you do several shifts a week. Like preparing breakfast, cleaning rooms, cleaning toilets etc. Nobody minds the work much and we&#39;re a pretty tight team. We make lots of jokes and stuff, sometimes coordinate trips together and share beers. </p>\n\n<p>Then, there&#39;s Ooma.</p>\n\n<p>Don&#39;t get me wrong, Ooma is a sweet lady and it&#39;s not that she doesn&#39;t work or anything. She&#39;s just not really in the group, because she&#39;s a little older. Most of the volunteers are in their early 20s (like me) and the longest any of them has been here is 6 weeks. But Ooma has been here about half a year, she says. She looks to be about 50, with long, gray-blonde hair and a kind, wrinkly face. When prompted on her age, she just smiles a knowing little smile and says nothing. This can get kind of awkward.</p>\n\n<p>Whenever I see Ooma around the hostel, the best way I can describe her is... floaty? She wears long, gown-like clothes in soft light colors (often white), and it never seems like you see her take a step. She just kind of <em>drifts</em> from place to place. And there&#39;s always that same smile. A thin, knowing little grin and twinkling eyes. I was convinced she didn&#39;t have any teeth until I talked to her some more.</p>\n\n<p>Ooma likes to stay up late. Like, very late. Once not too long ago, we get back from a bar around 2 AM and we&#39;re heading to the volunteer room on the rooftop. There, on the rooftop terrace, Ooma&#39;s just sitting, stiff as a board, by herself on a bench looking out into the street. She quietly hums to herself and doesn&#39;t notice us at all. </p>\n\n<p>The rest of the volunteers go to bed thinking nothing of it, but I approach her, trying to see what she was looking at. The street was deserted -- nothing interesting happening. I just heard her hum, with vacant, daydreaming eyes.</p>\n\n<p>I stand next to her and greet her but she doesn&#39;t move or even acknowledge me. </p>\n\n<p>I wave my hand in front of her eyes. </p>\n\n<p>Nothing. </p>\n\n<p>Surely she can smell the alcohol on my breath?</p>\n\n<p>&quot;Ooma, you okay?&quot; I ask, and touch her shoulder.</p>\n\n<p>She spins around with a jerk, wide-eyed and shocked like I just fired a cannon next to her. She gasps and stands up and grits her teeth, making a sound like an angry cat. Her nails dig into my arm and her eyes are strangely unfocused.</p>\n\n<p>I jump back, terrified.</p>\n\n<p>As quickly as it appeared (it? Whatever &quot;it&quot; was), it vanishes again. Her expression softens. </p>\n\n<p>&quot;Oh, hello, Dan. Have a nice night?&quot; She says in her wispy, delicate voice (even this was floaty about her).</p>\n\n<p>I stare at her for a while, but I don’t want to be rude. This is far from normal.</p>\n\n<p>I decide to let it go and we talk for a bit. Again, super nice lady. It&#39;s okay if she has some issues. Right? Hostels are supposed to be inclusive. </p>\n\n<p>We go to bed without further issue. I have trouble sleeping, keeping one eye on Ooma’s bunk for at least two hours before I finally drift off. The nails, the cold, hazy blue stare, the hissing... it really stuck with me.</p>\n\n<p>One of the shifts at the hostel is the night shift -- basically guard duty from 12 to 6, making sure no crazies enter the place. It&#39;s nice because you can read a book or draw or something, and have some alone time. The group of volunteers now comprises 4 women and 2 men, me being one of them. Management prefers men to do the night shift, which is fine by me. Hardly anything happens here.</p>\n\n<p>But this is when I started seeing more of Ooma. </p>\n\n<p>One night I was in the common room, headphones on, watching some YouTube videos to kill time. I had done a round of the hostel not too long ago -- you&#39;re expected to do it every hour or so, to make sure everything is okay. </p>\n\n<p>But somewhere in the video I hear a faint sound. I thought it was part of the recording at first but upon hearing it again I pause my video. </p>\n\n<p>&quot;Mmmmmhh...&quot;</p>\n\n<p>There it is again, an indistinct, low murmur coming from somewhere. </p>\n\n<p>I take off my headphones. </p>\n\n<p>I can definitely hear it, a moan of some sort. Curious, I get up and follow the sound to the kitchen.</p>\n\n<p>&quot;MmmmMMMhhmm...&quot;</p>\n\n<p>Thw kitchen is dark but there&#39;s a street lamp outside the window shining just enough cold white light for me to make out a figure in the kitchen, standing in a strange pose. I squint at it and flick the light switch but for some reason it doesn&#39;t work. As my eyes adjust to the dark, I see that the figure is Ooma.</p>\n\n<p>&quot;MmmMMahh.. mmmmahhh...&quot;</p>\n\n<p>She&#39;s bent over, head resting on her arms folded in front of her, on top of the kitchen counter. Her hair is splayed all over and it looks like she fell asleep there, standing upright. </p>\n\n<p>Just my luck. Ooma is a sleepwalker.</p>\n\n<p>&quot;Ooooooommmmmmm-- Ah! MmmmMMah.. mah...&quot; she mutters, voice becoming louder now. The voice is low, almost like a growl. Still feminine, just... not exactly human.</p>\n\n<p>I just stare at her, not knowing what to make of it. I&#39;ve never encountered a sleepwalker before.</p>\n\n<p>I try to talk her out of it, but it only gets worse.</p>\n\n<p>&quot;Hey Ooma, honey, maybe let&#39;s go somewhere a bit more comfortable? Huh? What do you say?&quot;</p>\n\n<p>Her figure starts to tremble and sway, still holding the strange pose, doubled over. </p>\n\n<p>&quot;MMMM...AAH! OOOO MMMMMM AAAAHH. MMMAAHH. OO MMAH!&quot; She keeps repeating into her arm. I&#39;m starting to worry that other guests are waking up. </p>\n\n<p>I try to shake her gently, to maybe wake her and get her talking sense.</p>\n\n<p>As soon as my fingers touch her arm she shoots upright, a long, wheezing gasp escaping from her. It&#39;s as if I used a tazer. </p>\n\n<p>She starts hyperventilating and wheezing, repeating her moan. Loud, back contorted, head thrown upwards and eyes rolled into her skull, showing only white, she half yells, half gasps:</p>\n\n<p>&quot;OOM-MAH. OOM-MAH. OOM-MAH.&quot; </p>\n\n<p>I try to calm her down again, try to tell her where she is, that everything is all right. She must be havimg a violent nightmare, and she’s scaring me so much I might as well be there with her. I try to stroke her hair and hold her shoulders and shush her. Ooma is having none of it. The wheezing and gasping and shaking continues.</p>\n\n<p>Out of nowhere she gives one last, enormous heave, as if her chest might explode. She holds it for several seconds, only a squeak escaping from her, sounding painful.</p>\n\n<p>Then, she collapses. I try to catch her. At the same time, the light comes on. The hairs in my neck stand upright. </p>\n\n<p>There&#39;s a pit, a cringe of fear in my stomach. The sudden silence rings in my ears all around me. I try to get some life into her unconscious body.</p>\n\n<p>After several seconds and a light tap on the cheek, Ooma is awake again, her eyes looking normal and her face relaxed.</p>\n\n<p>&quot;Oh,&quot; she says, a surprised tone in her voice. &quot;Hi.&quot; She looks around on the floor.</p>\n\n<p>&quot;Jesus, Ooma, are you all right?&quot;</p>\n\n<p>She frowns at me, as if it&#39;s a silly qiestion. &quot;Yeah, I&#39;m okay. A bit tired. You?&quot;</p>\n\n<p>I stare at her, dumbfounded.</p>\n\n<p>After an uncomfortable pause (I realize now I&#39;m practically straddling her), she says: &quot;I think I&#39;ll go to bed now. Good luck with your shift.&quot;</p>\n\n<p>And with that, she gets up and goes upstairs. I sit on the floor for a few minutes, trying to wrap my head around what just happened. The rest of the shift, the pit in my stomach doesn&#39;t go away.</p>\n\n<p>A couple days later, Ooma has a day off and I&#39;m wondering whether I should tell management about it. All of the volunteers have their quirks, including me, and we never make a big thing out of them. But I <em>really</em> don&#39;t feel like having another night shift like this one.</p>\n\n<p>I decide to ask Jamie, one of the other volunteers. She has a little bit of a gothy way about her and is kind of <em>out there</em>, so perhaps she’ll be most sympathetic to my story. I meet her in the common room and ask for a word, and explain the situation.</p>\n\n<p>When I’m done she just looks at me indignantly, a frown over her dark brown eyes.</p>\n\n<p>“Who have you been talking to?” she says acrimoniously.</p>\n\n<p>“Nobody, why?”</p>\n\n<p>“Why would you tell me this? Is this some kind of joke to you?”</p>\n\n<p>Her eyes are scanning mine, and I’m frowning now too, staring back at her. I have no clue what to say. Her lips quiver. I think she can see I’m not lying.</p>\n\n<p>“Look Dan, I don’t know what you <em>think</em> you saw, but you need to drop this right the fuck now.” </p>\n\n<p>I’m not used to Jamie like this. She has an incredibly dry sense of humor and usually doesn’t take anything seriously. She must mean business.</p>\n\n<p>“You listening? You gotta leave it.”</p>\n\n<p>“I don’t understand. What do you think I can do about this?”</p>\n\n<p>Jamie throws up her hands and stares at nothing for a while. “I don’t know. But I think it’s best if you stay away from me for a little bit.”</p>\n\n<p>She gets up and walks to the door. I look on in confused silence.</p>\n\n<p>“I’m serious, Dan. Don’t talk to me about this again.”</p>\n</div>\n","author":"Pianorama"}