{"rank":"167","title":"Easy Money","id":"8k7s6o","url":"/r/nosleep/comments/8k7s6o/easy_money/","time":"1526591393000","body":"<div class=\"md\"><p>You see a lot of strange things in my line of work. Maybe it is because the work has always been associated with the underbelly of society or maybe it is just because of the clientele it attracts. People in my line of work believe they have seen, or at least heard of, everything and I would have believed the same thing, that is until a few days ago when he showed up.</p>\n\n<p>Now you can call me a prostitute, street walker, even a whore if you want. I don’t care. I am happy with what I do. I make people happy by giving them what they want and they pay me good money for it. I will indulge fetishes, even sadistic ones, so long as they won’t cause me any permanent damage.</p>\n\n<p>I also count it as a blessing to be able to work at a respectable (but perhaps that is relative) brothel in Nevada. It is so much better than being out on the streets. I always have a roof over my head, the ladies here are my best friends, and we feel safe together. Ms. Brody, who runs the place, looks out for us and doesn’t take too large of a cut to do so.</p>\n\n<p>So when she came to me on one my days off and said someone had just come in with a special request I wasn’t too worried. I reminded her though the reason for my day off was for more than just rest and relaxation.</p>\n\n<p>“I know,” she said, “that’s why I’m here.”</p>\n\n<p>Like I said, I have no problem indulging people’s fetishes. It can be a lot of fun to see people when they are at their most uninhibited. But the reason I was taking some time off was because I was on my period.</p>\n\n<p>“You’re kidding me,” I said.</p>\n\n<p>“‘Fraid not, darling. He came right up to me asked straight a-way. If you don’t feel up to I’ll send him on his way.”</p>\n\n<p>“No, it’s alright. I’ll talk to him.”</p>\n\n<p>I followed Ms. Brody to front lobby. The man was standing at the counter, all six foot five of him as straight as an arrow. He was wearing a black suit and tie which did not do much to hide his thin frame. His face was a sickly, pale, pasty white. The irises of his eyes were jet black. </p>\n\n<p>I introduced myself and he shook my hand. I led him to a private room where we could talk about what he wanted. </p>\n\n<p>Calmly and quietly he talked with me. His voice was raspy and weak. I listened and nodded along taking it all in with as grace as I would muster. </p>\n\n<p>The first thing he said was that he was not interested in sex. I told him, “Honey, you’re in the wrong place then.” I laughed. He didn’t. </p>\n\n<p>He asked me some questions. When had my period started? How heavy was my flow? What was my blood type? Those are just the ones I remember.</p>\n\n<p>I asked him he was a doctor. He just said no and asked the questions again. I made no further attempts to lighten the mood and answered all his questions the best I could.</p>\n\n<p>He seemed satisfied with my answers and asked if we could go my room. When I hesitated he said it was important and for a moment his face almost showed a hint of emotion. Then he said he would pay me double my normal rate and that sealed the deal. There was nothing this guy could do to me there that wasn’t worth an easy two hundred bucks.</p>\n\n<p>We went to my room. He asked me to undress but just the bottom half. I did as he told me. He didn’t undress. He didn’t even loosen his tie.</p>\n\n<p>He asked me to lay down on the bed so that my butt was right on the edge. Then he knelt down in front of me, his head between my legs.</p>\n\n<p>What I was expecting was not what I got. The sensations I felt were different from anything I had ever felt before. It wasn’t long until I realized he was making no efforts to please me.</p>\n\n<p>After a few minutes he stopped. He stood up and wiped his mouth with the back of his hand. He asked if he could use my bathroom and I said sure. Through the slightly open door I saw him wash his hands and face. </p>\n\n<p>When he came out I could have sworn he was a different person. His skin had gained color and appeared to have a glow to it. His eyes were sharp and bright. When he looked at me his gaze was strong and focused. His voice was no longer weak and raspy but was as smooth and suave James Bond.</p>\n\n<p>He paid my fee then thanked me. He apologized for discomfort he may have caused, either physical or emotion. But, he said, he prefered this to the other alternative. In the end it was best for both parties. Then he left.</p>\n\n<p>He hasn’t returned yet and I am not sure if that’s a good thing or not. On the one had I wouldn’t mind if he did. It was some of the easiest money I ever made. But on the other hand I am pretty sure he was a fucking vampire.</p>\n</div>\n","author":"VincentVercetti"}