{"rank":"4","title":"Consciousness Drift","id":"8k7t6l","url":"/r/nosleep/comments/8k7t6l/consciousness_drift/","time":"1526591610000","body":"<div class=\"md\"><p>I work as a janitor at a government facility. This facility is sort of in the middle of nowhere and it’s in a particular US state that I’m afraid to name. And 30 minutes ago I experienced something pretty horrifying. It felt like something out of a sci-fi but I’m certain it happened because I could feel every moment of it; and even worse, I was completely conscious for it all…\nI have little interest in providing a fully detailed backstory so I’ll keep this part short:\nI’ve been a janitor in one of the lower levels of a smaller government “facility” (not really sure what to call it so I’ll just keep using the word “facility”); I sort of double as a maid so I clean anything and everything on my floor (it’s quite a large floor horizontally). These lower levels are a few floors into the ground, 5 to be exact. I normally am kept no lower than floor -3. There are no stairs past floor -2; just one elevator. This elevator requires key card access to open and again to use and I’m not cleared to use it. This has been no issue to me until a week ago.</p>\n\n<p>8 days ago I was working late. I was scheduled to work until 10pm as was everyone else on that floor (they all do seemingly unimportant computer data work or something like that). Around 9:30 I fell asleep in my little closet and I guess no one noticed because when I woke back up it was 1:20am and everyone was gone. So I got up, spent the next ten minutes cleaning up, threw on my jacket, and walked towards the stairs but stopped because I suddenly heard a very subtle shout – it just sounded like an adult man yelping briefly because he stubbed his toe.\nI stopped for a moment to see if I would hear it again and I didn’t so after a few seconds I left.</p>\n\n<p>By late the following night I had forgotten about the shout completely but stayed a bit late to watch a basketball game on a small television in the corner of my small room. By 12am everyone had gone and again I was about to leave. I was in my closet putting my jacket on and keys in my pocket and as my hand touched the doorknob to leave my closet I heard a muffled long whining sound. </p>\n\n<p>This time I could tell the sound was coming from the elevator. So, immediately, I crept over to the elevator door and opened it with my key card. Still I couldn’t descend any lower because of the lack of clearance – if you want to call it that. I listened closely and heard nothing for about ten minutes. But then I heard that same whine, even quieter than the first and just as subtle and muffled. But it was obvious that the sound was coming from way down the elevator shaft.</p>\n\n<p>I didn’t move for almost 25 minutes while listening closely but I didn’t hear anything else. So, I left.\nThere were no odd sounds the next two days.</p>\n\n<p>The fifth day was the weirdest and the day I decided I needed to investigate this shit. By 9pm everyone had left early on my floor so I was able to stay behind easily and without being questioned. It wasn’t until 1:30am that I heard it again but this time was the strangest.</p>\n\n<p>First, I heard a series of noises that honestly sounded like an ape getting excited as it walked around the jungle.</p>\n\n<p>Second, I heard higher pitched unintelligible shouting, like someone trying to get the attention of another who didn’t speak their language.</p>\n\n<p>Third, I heard repeated yelling &quot;No, No! Open! PLEASE can you hear me?! Hello!? Hello!?” and banging.</p>\n\n<p>And then silence. Nothing else.</p>\n\n<p>I decided after that, I needed to find out what was going on beneath me. So on the 6th day I effected a plan to get myself access to that floor.</p>\n\n<p>The young kid (Eric) who prints out key cards and can modify access with some software happens to be on my floor – on almost the opposite end from me. He’s only 28 so I decided I should be able to trick or deceive him in some way and modify my key card.</p>\n\n<p>I’m embarrassed that I went as far as I did but whatever, that’s not really important at this point.</p>\n\n<p>In the morning I went to a Microcenter store in town and purchased a very small (no, not microscopic, just small) camera that could capture at 240 frames per second. I wore a college shirt with a front pocket and I cut a hole just large enough that the lens could see through and I propped the camera very steadily in that front pocket to aim about 45 degrees down from my line of sight.</p>\n\n<p>I went to Eric and lied and told him my key card was not working for any floor and that I had to wait outside early in the morning for someone else who worked on my floor to arrive and let me in. And I asked him to check my card’s access. I began recording…</p>\n\n<p>He was completely unsuspicious and with a friendly countenance logged into the key card access system. I was kind of surprised that they would give control to such a young kid but whatever. </p>\n\n<p>Eric had to enter 4 different passwords, each at least 20 characters long but fortunately for me he paused for a moment before beginning each entry and he never used the shift key.</p>\n\n<p>He checked my card, said it looked fine, removed my access and then reapplied it and saved the status and told me to try again. Of course, it worked. I told Eric so, and that was that. I went back to my desk and stopped recording and continued my day.</p>\n\n<p>That night I examined the video I captured to attempt breaking into Eric’s computer. It took me over two hours to get all four passwords and then another 10 minutes to successfully access Eric’s computer and eventually the key card access software. I messed up twice and almost locked the computer and set off the silent alarm – I’ve seen it go off before on someone who was actually on their own computer but just mistyped the password three times.  Thank God I avoided that.</p>\n\n<p>It was a bit silly how easy it was to actually grant myself access. There were various clearance levels like “None/Least – 0” or “CONFIDENTIAL – 4.” What I wanted was “TS/FULL – 5.” I set it, logged off Eric’s computer, went back to my desk, and waited.</p>\n\n<p>I decided I would only go on a night where I heard no noises. I waited until 2:30am and just about when I was certain nobody was left in the building, I heard another series of shouts and some begging. It didn’t last very long but I decided it wasn’t the right night so around I left.</p>\n\n<p>The next day I waited again and by 1:20am I heard another shout – just one, that was it. But, still, not the right night.</p>\n\n<p>Today, the 8th day, the day I am writing this, I did it.</p>\n\n<p>I waited until 2:30am again and when I heard nothing I decided, fuck it, I’m going for it.</p>\n\n<p>I got in the elevator, swiped my key card, and pushed the button for floor -5 and… It fucking worked…</p>\n\n<p>The elevator doors stay shut tight as I passed floor -4 and there is no way to see out of the elevator while you’re ascending/descending. But finally, (it took a lot longer than 2 floors ordinarily should take to descend) I arrived at floor five.\nThe door opened and I was speechless. I exited and stepped into what looked like a 200-yard-diameter cylinder. It went left and right and curved perfectly but it was absolutely huge. If I had shouted, my echo would have carried and reverberated for probably 5 seconds, maybe more. All the way around were doors with no label or doorknobs. In the center, however, was another giant cylinder and right at the front, maybe 50 yards from the elevator door, was a door that did have a door knob.</p>\n\n<p>I couldn’t move for almost a minute but finally I went for it. I walked directly straight and tried to open the door with the doorknob. It wouldn’t open. Fuck. No… </p>\n\n<p>But then I remembered my key card. There was no where to swipe it so in a bit of desperation I sort of just waved it all over the door. After 3 seconds I heard a very, very subtle <em>click</em>. There was no visual confirmation, just the click noise. I turned the doorknob again and it opened… But, before I opened it, I noticed that at the top right corner there were some words etched into the door’s wood. They said:</p>\n\n<p>“Spatial and/or Temporal Sentience Drift”</p>\n\n<p>What the fuck does that mean…?</p>\n\n<p>That elevated my curiosity tenfold. So, I opened the door…</p>\n\n<p>The room was entirely black and entirely empty. And the walls were lined with what looked like very thin LED screens, which were off. But, in the very center was a chair. It looked like someone stole a chair from a dentist’s office and placed it arbitrarily in this room.</p>\n\n<p>Why did I sit in the chair within 2 minutes of entering the room? I really don’t know. Who cares – I’m going to explain what happened instead of justifying the heavy cocktail of curiosity and excitement that pushed me forward…</p>\n\n<p>Right as I sat on the chair, wires started peering out from behind the seat and latching onto various parts of my body – my forearms, my neck, my wrists, but most of all, my head. After a few seconds all of the vulnerable parts of my body were practically infused with an intricacy of wires, wires of a type I’d never seen before in my life.</p>\n\n<p>For about 60 seconds, nothing happened. And then, with no warning or sound or alert of any sort, everything went black, as if I were fainting…</p>\n\n<p>Then I woke up, and I could see and hear but my thoughts were minimal. Around me I saw nothing but green shit… Trees, plants, dirt on the ground, grass in places. I tried to think words, or complicated thoughts or emotions, but there was almost nothing. I was aware of being awake on the most basic level. When I looked down, my hands looked ancient. In fact, my entire body was covered in a crazy amount of hair.</p>\n\n<p>When I looked up and around, I saw other beings that looked like me. We all looked like we were on the boundary of consciousness, like the point between simple animal just walking around and surviving and an aware, understanding Homo sapien. Like the first creature to look around and think, “where am I? What is this? Why am I aware of everything…”</p>\n\n<p>I opened my mouth to say something to the other beings around me but all that came out were repeated unintelligible grunts and shouts. And almost immediately, they grunted back. And that was it. I tried to think higher and more logically, but my mental capacity was capped and I couldn’t understand anything past my immediate surroundings. I began to grunt again but just then, everything went black again.</p>\n\n<p>There was nothing for a few moments. And I don’t just mean everything was black as if I had locked myself in a small closet. I mean existence ceased. I was dead, sort of… I could feel my individual elementary particles and their energy spreading apart and meshing in with the rest of the inanimate universe…</p>\n\n<p>But then, I woke again.</p>\n\n<p>This time I looked like a human but still primitive in ways. When I looked up, I saw white: ice, snow, frozen waters, ice bergs. And around me were other people. Some young, some old, all moving in the same direction, as if migrating as quickly as we could. And, in fact, it appeared we were all standing on an absolutely giant straight of frozen matter. Everyone around me was wearing either the skin of a bear or a large wolf. Snow was blowing and everyone was looking down and just trudging forward steadily. We were clearly way up north and it was very obviously not the present. It felt as though it were a hundred thousand years back in time. I begin running to catch up to the being in front of me. I grabbed its shoulder, and just as it began to turn its head around, everything went black again.</p>\n\n<p>Again, I could feel my existence had ceased. I was no more. </p>\n\n<p>But then, once more, I became conscious again. This time, my skin was black and when looking around it was clear I was somewhere in Africa. I could think in terms of my surroundings and activities, but I still had no language. I could not communicate any farther than making noises either with my mouth or by banging things.</p>\n\n<p>This time I was a female it appeared. And surrounding me were my young. There were two males, seemingly of age 4 or 5, and then a younger male of maybe 2. The youngest was sitting up against a tree a few feet from me – we apparently were on the border of a deep forest and an open brown grassland. I continued to observe my surroundings quickly and grasp what was going on and where I was. After less than about five minutes, I heard a large growl a bit away, maybe 50 yards.  I turned around and saw a pack of full grown lions. Suddenly, they began sprinting towards me and my young and before I could fully understand what was happening or how to react, one of the lions grabbed my youngest in its teeth and sprinted away.</p>\n\n<p>Immediately I felt a severe mix of panic, sorrow, adrenaline, protectiveness, love… greater than anything I’d ever felt in my life. I began running after the lions but I couldn’t catch them. And then I watched the entire pack of lions rip my youngest child to pieces within seconds. And just like that it was dead, gone… I began to absolutely screech in pain but, again, everything went to black again.</p>\n\n<p>And again, death, nothingness... And then, I sprang back.</p>\n\n<p>This time… I woke up in complete darkness in a box maybe 2 feet wide and a foot high. I was a woman again; I could tell by feeling my clothes. It felt as though I were in some classical dress from the 1800s. I realized quickly I was in a coffin and was… buried alive?</p>\n\n<p>I began to panic immediately and started screeching noises I didn’t know I could make and banging as hard as I could. My panic rose and rose and rose, seemingly with no cap. I realized at some point I could think in words – English words. I started screaming out for help – I had an accent, an English accent. Whatever, that didn’t matter. I couldn’t believe the panic in my heart. It was simply getting worse and worse. I could not calm down. I began to feel sick and started dry heaving. Every bang on the side or top was completely deadened immediately. It was quite clear that I was far down into the Earth and no one would hear me… I passed out…</p>\n\n<p>When I awoke again, I was in a dark room with a bag over my head. It was very hot. My thoughts this time were not in English but they were in a language… In Arabic… </p>\n\n<p>And then I heard around me shouts in Arabic. There were many men, maybe 10 or more, shouting and getting excited for something I had no knowledge of. I tried to understand what the context of the situation was quickly but nothing could come to me. All I could do was observe what they were saying. </p>\n\n<p>They were shouting praises to God repeatedly when suddenly the back of my head was grabbed by my hair through the bag and pulled far back, exposing my neck. Then, I felt something cold and thin touch my Adam’s apple. And then, I felt the sharpest, most intense pain you could imagine as this sharp object began slicing through the skin on my neck. I could feel the blood spilling out of the enlarging slit and the pain was unbearable. The whole time around me all I could hear were shouts and praises to God while I quickly became queasy and delirious and eventually, I fainted again…</p>\n\n<p>The feeling of total non-existence and consumption by the universe returned. It was peaceful. But it didn’t last…</p>\n\n<p>I awoke again and this time I was very, very clearly not on Earth and what’s more, I was very clearly not a human…\nI looked around and was standing on a black pad or something that had white grid lines on it. The pad went on seemingly for infinity and when I looked up I saw something similar to what you might see upstate at night while looking at stars. It felt like the same universe but not the same solar system, really not even the same galaxy.  When I looked down at myself I couldn’t get a grasp on my own form. It was just like sheaths of energy that were rapidly changing and adapting. As I moved I took a form of something like a bipedal creature but instead of legs were wheels. I tried to make some sort of noise to grab the attention of anything that might be around me but there was no way for me to do it. I had no capability that I knew of to make any sounds. I kept rolling in the same direction and the black pad with the white gridlines never creased or demonstrated any end. I went on for what felt like an hour but I had no concept of time at all. I felt confusion and extreme loneliness to the point of psychosis before I blacked out again.</p>\n\n<p>The final time, after another brief period of death, I awoke into probably the worst of them all…</p>\n\n<p>I awoke with no sense or ability at all to observe my environment. Everything was black, deaf, and devoid entirely of physical feeling. I simply just existed… I was conscious but only in my own mind. Everything was a mash and mix of shapes and sounds and just never ending internal stimuli. Nothing I was experiencing made any sense or had any relation to time or space, everything just was. I was just a useless conglomerate of awareness. It was clearly something outside any physical existence we know in our universe and it was fucking terrifying. But, Thank God, everything went black again…</p>\n\n<p>When I awoke, I was back in the chair. I ripped the wires off of me as viciously as I could and sprinted out of that room and back to the elevator. And, frighteningly, when I checked my watch,  no time had passed. Not even a full minute…</p>\n\n<p>It’s now 35 minutes or so later and I had to jot this down immediately. I’m really distraught right now… Honestly, I’m fucked up… And scared…</p>\n</div>\n","author":"masnaTellsHisStories"}