{"rank":"5","title":"my phone","id":"8k82ak","url":"/r/nosleep/comments/8k82ak/my_phone/","time":"1526593678000","body":"<div class=\"md\"><p>OK, maybe more aptly titled “why can’t lemonskeleton get a job?” But something is happening to my phone I think... my computer and my phone.</p>\n\n<p>On the brink of a recovery- emotionally, mentally and physically. I’ve been grinding the good old job search… for a good year at least. </p>\n\n<p>It’s not that I am stupid. If anything, I made stupid choices and almost married stupidly. He was an abusive alcoholic, but that’s not who I met (I watched him fall and break his neck it changed his personality. A whole ’nother story for another day.)</p>\n\n<p>But things are happening now that I can’t explain. At first, I’d get the slew of calls upon applying for the wrong job. “Hello, is lemon dere? Ms. Skeleton I received your resume.”</p>\n\n<p>Here are the glitches in the matrix preceding the phone thing:</p>\n\n<p>Thing 1: I go to write this story and my camera/live stream app comes on by itself.</p>\n\n<p>I kill the app and keep writing. \nWeirder has happened.</p>\n\n<p>But coupled with what happened to my mom, who is the skeptic to end all skeptics, I figured it may be related. </p>\n\n<p>After I pick her up from work two days ago she tells me “it was ze weirdest sing,&quot; her thick french accent making every word cute.\n “I was thinking about your fozzer [father] and my phone starts to call him!”</p>\n\n<p>I needed to understand. It was just a technical fluke. I probed for answers. “Where was your phone? Did you ask Siri?”</p>\n\n<p>The phone called my father’s number right before my mom’s eyes - she wasn’t touching it and didn’t tell Siri/ blueteeth/etc.</p>\n\n<p>So these things are kind of weird but I am pretty logical when I’m not having fun and being conspiratorial. These things in and of themselves would not constitute grounds for nosleep. </p>\n\n<p>As I said before, looking for a job ends up with my information getting sold and me getting at least five calls a day. This last bout of phone calls is different, however.</p>\n\n<p>I ignored a number with an area code I recognized (from my hometown). This is typical of me. For one, I&#39;m still mostly socially dead inside and it takes every ounce of my being to partake in casual social pleasantries.</p>\n\n<p>Immediately following area code call I get a phone call from the opposite coast. Cool - I answer it hoping it’s a hiring recruiter I want to talk to, or a job I actually wanted and to which I submitted.</p>\n\n<p>“Hello?” I sort of asked.</p>\n\n<p>“Hello? Hello?!” the man’s voice sounded far away.<br/>\nI sat straight up. “Hello?&quot; I answered, trying my best to sound professional. &quot;Can you hear me OK?”</p>\n\n<p>He couldn&#39;t hear me. As if no one had answered him at all, I heard him look at the phone, shrug and hang up. </p>\n\n<p>I don’t know how else to explain it.</p>\n\n<p>I know I&#39;m jaded when it comes to telemarketers, but I used to work in a call center. I&#39;m convinced that hell is a call center. Joking aside, I take pity on call reps. Considering the job market I&#39;m not one to be picky right now. I don&#39;t waste their time but when it makes sense to try to pursue the contract I do. A lady named Cathy and I spoke for quite a while last week. \nI wasn’t even sure she was trying to sell me anything. It was Friday and I pushed her off until Monday. Nice lady from my home state, but I could hear she wasn&#39;t born there (she was too nice to be born and raised on the east coast.)\nWe talked for a minute on Monday, enough for me to gauge my disinterest. I was done being polite and told her &quot;thanks but... no&quot; to whatever she wanted to talk about. She was so happy to talk to me, as if she hadn&#39;t spoken to another person in a long time. It&#39;s unusual to hear, especially from a telemarketer. She was elated when I told her to try me back after the weekend. </p>\n\n<p>So happy, in fact, that Cathy tried to call me from four different numbers over the next week, repeatedly. She left me several voicemails. And apparently she is dead. </p>\n\n<p>Upon looking up the first number I learn belonged to a lady who died. Cathy [redacted].</p>\n\n<p>I think the dead are calling my phone. </p>\n\n<p>Not to mention, super recently, more and more, I always feel like something is watching me (rest in peace, MJ.)\nObligatory ‘Has this happened to anyone else?’ because I’m honestly sketched out. \nThere is more (regarding my phone) but I don’t know if it’s related…</p>\n</div>\n","author":"Lemonskeleton"}