{"rank":"13","title":"Used Shoes","id":"8k84w1","url":"/r/nosleep/comments/8k84w1/used_shoes/","time":"1526594296000","body":"<div class=\"md\"><p>It all started when I found a pair of shoes at Goodwill. They were a dirty pair of red Converse high tops. There was mud all over the shoelaces, but other than that, they looked good. I am not sure, why I bought them; I guess it was something inside me that made me want to buy them. I washed them with my hose in the driveway when I got home. After I was done, they looked good. There were a few rips on the sides and a few scratch and burn marks on the rubber, but they were beautiful to me. I guess it is beauty in the eye of the beholder. </p>\n\n<p>Weird things started to happen two days after I got them. </p>\n\n<p>The burn and scratch marks started to disappear. How could they disappear that quickly, there had not been rain and I had not washed them again. Then I noticed something else. They did not just look better; they looked brand new. They had a new shoe smell to them, and it was as if I had just bought them. </p>\n\n<p>That was not the only weird thing though. </p>\n\n<p>I often found myself walking in directions I did not plan to walk in. I would be walking down the street, when all of a sudden; I am walking down a dark alley. I kick people unnoticeably, and when I took them off at the end of the day, I could feel them getting tighter, as if they were hanging on to my feet. They reminded me of Venom in Spider-Man 3. The shoes I mean. </p>\n\n<p>One day, when I got home from work, I went looking for them in my room, but they were gone. I had worn my work shoes that day.  </p>\n\n<p>They could not have gone anywhere on their own. After all, they were just shoes. I decided on the idea that I had misplaced them, and that they would show up soon. I walked outside that evening to admire the sunset, when I saw a black figure in my backyard. I went over to inspect and it was a dead cat. My neighbor’s cat. It looked like it had suffocated, and there was blood caked around the mouth, along with phlegm.  </p>\n\n<p>I picked up the cat and buried it in my yard. I did not dare tell my neighbors. I walked back inside and, wait. I did not leave the door cracked open, did I? The door was standing open when I walked inside. That was weird.  </p>\n\n<p>I looked in front of my sofa, and there lay my shoes.  </p>\n\n<p>The shoelaces were caked with blood. </p>\n\n<p>I got rid of the shoes that day; in fact, I burned them in my backyard in the fire pit. Those shoes deserved to burn. </p>\n\n<p>A day later though, my friends started to drop off like flies. Every single one of them suffocated, and the police did not know how. They said there were red marks around the victims’ necks, and blood and phlegm caked their mouths.  </p>\n\n<p>I knew it was the shoes, but if I told the police, then they would think I am crazy. </p>\n\n<p>The shoes have picked my friends off, and I am the next one on the list. </p>\n\n<p>It is midnight, and I am writing this in my room. The doors and windows are all shut and locked. I am listening carefully to see if I hear any footsteps outside. None so far.  </p>\n\n<p>God I have never been so scared in my life. </p>\n\n<p>I keep thinking, “I should have never burned them.” In the end though, I did, and it is my entire fault. </p>\n\n<p>They will get me in the end though,  </p>\n\n<p>Because in the end,  </p>\n\n<p>We all get caught… </p>\n</div>\n","author":"Dan100903"}