{"rank":"0","title":"Is Anyone Here Any Good At Deciphering Code? Part 2","id":"8k89vm","url":"/r/nosleep/comments/8k89vm/is_anyone_here_any_good_at_deciphering_code_part_2/","time":"1526595453000","body":"<div class=\"md\"><p>Sorry for the delay in getting back to the thread. I could make up some creepy tale of woe but the truth is that my daughter ate a slug. The results of which were far more horrifying to me, and to the person whose shopping bag she threw up in on the bus, than any spooky occurrence.  </p>\n\n<p>Fact: I 100&#37; did not know what the greater tragedy was; a vomit drenched Fortnum &amp; Mason’s hamper or a seven year old who REALLY should have known better.  </p>\n\n<p>Second Fact: Fortnum &amp; Mason do not exchange vomity hampers. Under any circumstances.  </p>\n\n<p>Since it knocked me back an evening (and a substantial chunk of my wages this month which I’ll have to recoup with overtime) it has taken me longer than I thought to get back into the train of thought to decode. Again, it was like standing at the foot of a mountain with a pile of equipment in front of me with no instructions. I’ve never climbed a mountain, never particularly intended to either but there is definitely something glinting further up the slope that I needed to reach.  </p>\n\n<p>So, I had to start back at the beginning and decode the first lot again. As I went through the notes, I started to pick up the pattern winding through the author’s train of thought. It reminded me somewhat of another service user I spoke to at the community group years ago. It helped that a character in the notes shared her relatively common name and it slightly jolted my recollection.  </p>\n\n<p>Just for those out there who think I’m breaking some sort of data protection law, I don’t imagine recounting a discussion from years ago with someone whose name I may have mis-remembered could be particularly easy to doxx.  </p>\n\n<p>Her name was Sophie. She was a slight, mousy haired thing and diagnosed with Borderline Personality Disorder, since renamed (rightfully so, I think) ‘Emotionally Unstable Personality Disorder’. For her, the most disruptive aspect of her condition was that she didn’t really have a strong sense of who she was so she constantly tried to achieve that sense of identity and belonging the rest of us largely take for granted. ‘Sophie the BPD sufferer’ as she told me, was just one of the many ‘sleeves’ that she had tried on.  </p>\n\n<p>She was previously a Christian Scientist, driver in the Logistics Corps, reformed drug addict, new age guru, Mormon, Scientologist and for a brief time until the clamps started to chafe; Satanist. Sophie always tried to fill the ‘gap’ in her identity with others, but the ‘cement’ as it were, didn’t have anything to stick to and would quickly flake off.  </p>\n\n<p>During her first visit to the community group, she was mute and sat silently at the fringes of the group. I watched her listen intently to the others as she tried to work out how to fit in. For the second visit she was loud, gregarious and needed to be assisted away from other service users who didn’t like being hugged. The third; she was melancholic as she tried to express herself through poetry and the fourth; relaxed as she boasted of her new husband.  </p>\n\n<p>Sophie said she had met him at the bus stop a couple of days before and after he lamented about his desire for a car, she promptly spent the last of her savings to buy him a cheap used Ford.  </p>\n\n<p>He hadn’t returned her calls since, but she was a cool wife. They were married and they shared everything.  </p>\n\n<p>I’m certain that were I to meet her out and about when she was in one of her new identities; she was so convincing I would have no problem in believing her. She certainly believed herself.  </p>\n\n<p>Her story ended tragically some years later when she fell into a bad group. The details in the newspaper were fuzzy. There was something about a group of environmental terrorists or animal rights protestors of some type. A journalist had secretly infiltrated the group and after being found out; was murdered, dismembered and his remains flung into the meat disposal skip at a local supermarket.  </p>\n\n<p>It was pure luck that a newly hired manager had caught sight of a forearm poking out of a blue sack at the bottom of the chute. If it wasn’t for that, the remains would have ended up undiscovered in an incinerator. Some poor sods had to spend days methodically analysing a tonne of putrefying meat to pick out the journalist’s pieces.  </p>\n\n<p>When the police connected it to the group, there was a standoff at some warehouse and Sophie was one of the casualties.  </p>\n\n<p>Whoever my correspondent was, I felt that it didn’t matter if I believed her anymore. This ‘Alex’ person seemed to believe that she attended a town meeting some place and watched a group of people stomp someone called Mr Alton to death. I hoped that if I could discern more clues as to her location, I might be able to speak with the local social services to help her.  </p>\n\n<p>So far I think I’ve worked out that Alex is definitely in the UK (spelling, references to arterial roads etc.) and may have came from London like me, as lots of people end up moving out to the Home Counties which can be very suburban. It would need to be a town with 200,000 people (rounded up or down). If anyone can glean more clues, please let me know.  </p>\n\n<p>I have no record of Palimpsest Plc which is a bit of a letdown otherwise I could just ask them.  </p>\n\n<p>NB: I would like to extend my thanks to the users who have sent me links to different books on code-breaking. I’ve tried to take pictures of the sheets but for some reason, they go all weird as soon as they hit my ‘Sent’ box. I tried to scan them in from a local library but it’s like someone is remotely covering the notes with static. Technology is truly my greatest nemesis. I’ll try to attach a picture so you can see what I mean.  </p>\n\n<p>Please find the first set of my code-breaking here:  </p>\n\n<p><a href=\"https://www.reddit.com/r/nosleep/comments/8iz7gc/is_anyone_here_any_good_at_deciphering_code/\" rel=\"nofollow\">https://www.reddit.com/r/nosleep/comments/8iz7gc/is_anyone_here_any_good_at_deciphering_code/</a>  </p>\n\n<p>Part Two  </p>\n\n<p>Once outside, I ran as fast as my legs would carry me. I had dropped my umbrella somewhere and despite the sleet, thought better to abandon it than to return. I just wanted to get to my car, drive home and pretend it was all a terrible dream or ghastly prank meant for people online to cackle at.  </p>\n\n<p>The car park was empty. It was completely rammed with cars when I had parked up not too long ago but my car was alone under a sputtering streetlight. The darkness seemed to press in on the narrow columns of light, and my panicked lizard brain sensed all manner of steel toe capped predators lurking at the fringes.  </p>\n\n<p>I stood dumbfounded as my car door didn’t automatically open when I pulled at the handle. A heartbeat later, my fingers trembled as I searched about my person for my car keys. I had never known my pockets to be so deep or my bag to be filled with so many receipts and leaflets. After a minute of fumbling, I located my keys in a rarely used zipped pocket inside my bag. I also felt the edges of the card that Mr Alton had pressed into my palms.  </p>\n\n<p>I hopped into my car, a slightly dinged Renault with a Banksy decal above the right headlight, and dropped my bag onto the seat next to me and Mr Alton’s card on top of my dashboard.  </p>\n\n<p>As I drove, I took a circuitous route home in case anyone followed me. Unfortunately, with the uniform headlights about, it seemed that all of the cars in town looked the same in the darkness.  </p>\n\n<p>After reaching a halt in my drive, I took a shuddering breath. It was a prank. It must have been. There were no sirens or passing emergency vehicles as I fled. No one followed me. I mean, it was pretty impressive making all the cars in the car park disappear but there must have been some rational explanation.  </p>\n\n<p>I grabbed my bag and Mr Alton’s card and went into my house, wincing slightly at the coldness inside. I thought that the boiler must have been on the fritz again and I sighed as I switched on my hallway light to check the thermostat. I dropped my bag to the side, shoved the card into my back pocket and twiddled the thermostat dial but it didn’t click. Annoyed, I trotted up the stairs. It took a heartbeat for my brain to process the sight in front of it.  </p>\n\n<p>There, swinging slightly from the ceiling, the loft hatch yawned wide open.  </p>\n\n<p>“If anyone is there,” I called out. “We don’t keep any money in the house but you can have my jewellery, phone and the TV if you can carry it. Just please leave.”  </p>\n\n<p>Although I was from the city, I hoped if there was anyone in the house they would be simple burglars not someone high looking for a fight. There was no response, no sounds of movement. Nothing.  </p>\n\n<p>I grabbed a nearby broom handle and shoved the loft hatch back up and checked Ava’s room first. Her small bed and wardrobe were both untouched and her toys sat neatly on the modular shelves as I left them. She would be back at the weekend, hyped up with a weeks’ worth of Haribo and cartoons and I knew she would positively demolish this little room.  </p>\n\n<p>Our bedroom was similarly untouched, the bathroom too. I restarted the boiler in the airing cupboard before heading back downstairs, desperately hoping that the hatch had just succumbed to gravity rather than anything else.  </p>\n\n<p>My laptop, still open from when I left it was running quietly in the kitchen. I turned it to face me and shook my head sadly as another notification pinged quietly.  </p>\n\n<p>A while back, Steve had borrowed my spare laptop to log into his e-mail but had forgotten to log out. Overcome with curiosity at the time, I found that he was signed up to different dating websites and was having some pretty hot and heavy chats with at least two ladies I recognised from his workplace. Neither knew about each other it seemed. None of what was discussed about me was particularly pleasant.  </p>\n\n<p>Since then, I had left it to sync to my computer. I worked in IT before coming out here; it wasn’t hard to change the settings.  </p>\n\n<p>In the space of six hours (roughly the length of his liaison that evening): I went through all the stages of grief.  </p>\n\n<p>At first, I was in denial. It was clearly spam or some terrible mistake. Maybe Steve was feeling a bit left out with work and a wife a bit too tied up in looking after their daughter. You read about it all the time.  </p>\n\n<p>Then I got angry. I poured his favourite bottles of wine down the sink and cleared the gutters with his golf clubs. I had just reached the light after some pretty grim post natal depression, not to mention I could finally start feeling sensation <em>down there</em> after some pretty horrific tearing during childbirth. How dare he?  </p>\n\n<p>As the bargaining mode set in, I started to think that if he wanted to cheat on me: he could pay. I tracked down all his logins for his bank accounts and took copies of all his financial information (payslips, P60s, pension letters), ready to clean him out.  </p>\n\n<p>I won’t dwell too long on my least favourite stage, depression. Let’s just say it involved a bottle of wine that survived my purge and to my eternal shame, Nookie by Limp Bizkit played on a loop for longer than necessary.  </p>\n\n<p>Before finally: acceptance. I got sad as I tried to imagine dragging Ava back to the city. I lived in a flatshare before and my only family were in other countries. Once I left, I would be on my own to raise our little girl.  </p>\n\n<p>When Steve asked what happened to his wine and golf clubs, I feigned innocence and asked him to go for a shower as he stunk. I knew he had showered at her house, but he didn’t know that I know.  </p>\n\n<p>Since then, I had been getting all my ducks in a row. On a side-note, I found out something interesting when I spoke to a lawyer.  </p>\n\n<p>Apparently, if you speak to the lawyer first and then your spouse tries to talk to them, they can’t act on your spouse’s behalf, even if you didn’t instruct them. It was something to do with conflict of interest. It wasn’t cheap, so I had to pay about £1,200 in fees just to cover the first hour of explaining my situation before going away “to think about instructing them”. I visited a few around his workplace in the city for good measure, all with the view of making it as hard for him to find a lawyer as possible.  </p>\n\n<p>I settled on a bitter old school lawyer called Mr Palmer who had everything in hand once I was ready to fill out a petition.  </p>\n\n<p>I glanced at the notification and turned on the kettle. It looked like Steve was out with one lady and messaging another.  </p>\n\n<p>Tea done, I warmed a free hand up over its steam and tugged Mr Alton’s card out of the pocket of my jeans. I turned it over on my kitchen worktop.  </p>\n\n<p>‘Lunchtime, Thursday, The Old Estate WMC, Bring Stanley knife’  </p>\n\n<p>The handwriting was in a shaky Biro on the back of a business card which read simply: ‘Richard Alton, BA (Hons)’ with no other contact information.  </p>\n\n<p>I pushed away slightly with a grimace, I had certainly seen enough in the past hour. However, Ava was safe at her grandparents for a few more days, Steve would be ‘working late’ until then, and in the meantime, I was completely at a loose end.  </p>\n\n<p>I also wanted to know if it was some sort of online pranking thing and whether they might need an ex-IT, okay, network admin. It would be good for my CV I reasoned.  </p>\n\n<p>If, in all the smallest of chances, there was actually a man called Richard Alton, BA (Hons) who was murdered by the scariest group of suburbanites I’ve ever seen and there was some sort of conspiracy, well, I already had one foot in the rabbit hole. I finished my cup of tea with a single swig, and coughed slightly. It was still quite warm.  </p>\n\n<p>Steve got in past midnight and made a bit of a racket having a wash before coming to bed. I faced away from him and the bed shook slightly as he got in. He turned his back on my own and we continued the facade of a restful sleep until he got up for work six hours later.  </p>\n\n<p>I had no idea what I was thinking as I stood outside the Working Man’s Club (WMC) that was on Mr Alton’s card. I hurried in. I left my umbrella in the car but was now sporting a Stanley knife as requested.  </p>\n\n<p>Brushing the sleet from my jacket, it took a few moments for my eyes to get accustomed to the dark interior.  </p>\n\n<p>It was like I had stepped back forty years to a country pub. The carpet was dark brown and cracked green leather coated almost every surface apart from the bar and the wood-panelled walls. There were only a few people here. An old man wearing a flat cap sat with a half empty beer glass, reading a broadsheet intently while his border collie lay disconsolately under his table. The bartender rubbed a filthy rag along his sticky bar.  </p>\n\n<p>I was halfway to the bar when someone coughed. I looked up to see four people in one of the booths staring at me. Guessing that they were who I was here to meet, I warily approached.  </p>\n\n<p>“You got the thing?” the eldest asked. He was easily twice my age and kept his long gray hair in a ponytail. Once I got closer, I noticed he had decorative beads dangling from his beard. He, like the other three, wore jeans and faded slogan t-shirts like some extremely casual uniform.  </p>\n\n<p>“You mean the Stanley knife?” I replied, puzzled. With a furtive look about, I took it out of my bag and handed it to him.  </p>\n\n<p>“Excellent, please sit down,” he said, handing the knife to the younger man next to him.  </p>\n\n<p>“Thanks, I really needed this,” the younger man said eagerly. He had a case next to him which he opened to reveal all sorts of miniature war gaming parts which he began to neatly trim.  </p>\n\n<p>“What’s this about, and why did you want a Stanley knife?” I asked sitting down next to them. “You can get them anywhere.”  </p>\n\n<p>“It was part of Simon’s unimpeachable logic,” the war gamer replied absently as he pulled the knife along some sprues, freeing some futuristic looking models. “Richard was all over the hill, away with the fairies and all that, but Simon convinced him to at least pass his card along to someone who could help us. The knife was sort of a test. Any of those Action Group psychos or company tools aren’t able to read Simon’s ink so even if they tracked down one of our meetings by accident, they wouldn’t have been able to see what to bring. Genius, really.”  </p>\n\n<p>I furrowed my eyebrows and found Mr Alton’s card again. The ink looked unremarkable, if a little glittery if I narrowed my eyes enough.  </p>\n\n<p>“That’s Simon,” he said, and I looked up. He pointed to the eldest. “I’m Jake, this is Mitch and that’s Sophie.”  </p>\n\n<p>“I’m Alex,” I nodded to them in turn, politely. While Jake was small and rake thin, as was Sophie, Mitch was built like a brick wall. With the exception of Sophie who gave a shy smile, they all regarded me impassively. “I watched those people from the Suburban Action Group murder Mr Alton at the town meeting.”  </p>\n\n<p>“That is their modus operandi, I’m afraid,” Simon replied cryptically. “They used to be like us one time but went soft and started to envy the beasts that they had previously opposed. Instead of saving virgins from being thrown into the volcano or the bloody child sacrifices as it were, they started getting in on them en masse. Their faces and names change, whether they are Knights Templar, The Beatific Dawn or Suburban Action Group, but despite everything else, they got the same stained hearts.”  </p>\n\n<p>“I don’t understand, what does that have to do with me?” Of course I had heard of the Knights Templar. I was pretty sure that some French King destroyed the order when he needed some cash, and the Knights’ pile of lucre was the easiest available. All the conspiracy theories were just that, I was sure.  </p>\n\n<p>“Let me handle this, she doesn’t need to hear this nonsense,” Sophie said kindly. Her hair was cut short and her face was deeply lined. I could tell just by looking at her that she had not had an easy life. “They can get pretty theatrical and make it sound like some grand crusade. It’s really very simple, Palimpsest Plc or whatever the company has changed its name to, and their servants, know us. They don’t know you. I know this is a big ask of a complete stranger but it would mean a great deal if you could join Palimpsest Plc at its new plant. We just need evidence that they are up to no good. It’s nothing dangerous. Just a picture of some toxic waste or something would be enough for us to get the word out online.”  </p>\n\n<p>“Just a photo?” I wasn’t even sure why that was my question rather than asking why on earth I would take any job at that grim sounding factory.  </p>\n\n<p>“Just a photo,” when Sophie smiled, it seemed genuinely sincere. She handed me a small plastic wallet. “They would probably get you to leave your phone in your locker but there is a little dot in this wallet. It’s a pinpoint camera. Just lift it out with your finger and stick it on your work clothes and it’ll adhere. I would hide it in with some mints or gum. You don’t need to do anything else. It’s good for one shift and that’s all we’re asking. Bacon sandwich? The card said to meet at lunch, right?”  </p>\n\n<p>I was a bored housewife who had previously worked with computers. So it was remarkable that my boredom and curiosity had gotten the better of my commonsense and before I knew it, I was back home filling out an online application form as my spare laptop chirruped occasionally nearby. The notifications weren&#39;t so much sharp and stabby reminders of Steve’s infidelity, but rather the audio evidence of the death by a thousand cuts our relationship was suffering, piece by piece.  </p>\n\n<p>As far as I was concerned, the people at the WMC were out there with Pluto but I couldn’t help but prick up my ears when Sophie mentioned toxic waste. I didn’t want Ava to live so close to anywhere that could make her ill. It was bad enough knowing about the waste-to-energy incinerator and rendering plant.  </p>\n\n<p>If all I needed to do was prance about a manufacturing line or fill boxes for ten hours and that was it, it was a small price to pay if those environmentalists were serious about getting the word out. If it was a hoax, well at least it was a welcome distraction nonetheless.  </p>\n\n<p>The job application turned out to be super simple. A local news website led me to a single job listing entitled “Multiple Positions At New Factory Available!” There were only two tabs. I just had to fill out my name, address, NI number and passport number on the first tab. For the second, I just had to attach my CV. Normally companies wanted lengthy answers to competency questions and essays as to why you wanted to join but not this.  </p>\n\n<p>After about fifteen minutes my phone rang. I checked the caller ID and it was an unknown number. I let it go to VM and unusually for something I thought was going to be spam, there was a voicemail notification.  </p>\n\n<p>I listened, and it was a chirpy lady congratulate me for progressing to the final stage of my job application and invite me to Palimpsest Plc for a job interview. All I needed to do was call her back on the following number to arrange a day and time.  </p>\n\n<p>“Good afternoon, Palimpsest Plc Recruitment Department,” came a cheerful voice. “How may I help you?”  </p>\n\n<p>Within minutes I had a job interview booked for the following day.  </p>\n\n<p>I pottered about for the rest of the day and ordered in a meal, using Steve’s credit card. He had sent a garbled text letting me know he wasn’t coming home that night and I responded with a simple “k”.  </p>\n\n<p>The following day, I felt a bit nervous. Usually, when I went to an interview, I would go dressed in a power suit and heels but I didn’t want to stand out so selected a simple skirt, blue coloured blouse and ballet pumps under my thickest winter coat. I still wasn’t altogether sure what job I had actually applied for, but I still craved the need to give a good impression.  </p>\n\n<p>The recruitment lady had told me that I was welcome to use their free bus service which conveniently alighted at the bus stop fifty yards from my house. There was no one waiting at the bus stop when I got there. The glass had been smashed out ages ago, probably before I even moved there, so there was no point huddling in the shelter. I pulled my collar up and tried to aim my new umbrella into the wind to stop it turning inside out.  </p>\n\n<p>After about ten minutes, a ghostly looking coach with three Ps on its side pulled up and opened its doors. I climbed the steep steps, collapsing my umbrella as I did so and went to talk to the driver. He was old and even in this weather, wore thick black sunglasses which were in stark contrast to his crisp white uniform.  </p>\n\n<p>Without taking his eyes off the wheel, he tapped a sign above his head which read: “Do Not Speak To The Driver”.  </p>\n\n<p>I shrugged and shook my head as I shuffled along the narrow aisle. Someone was asleep at the back and there were a few people dotted here and there. Oddly, no one was tapping on their phones or listening to tinny music like in a real bus. They all sat erect, facing forward.  </p>\n\n<p>I took a free seat in a small cluster of empty seats and checked my phones. Like at the leisure centre, my phone picked up no signal here. I gazed disinterestedly out the window until the coach pulled up at the next stop and a few more workers hopped onto the coach.  </p>\n\n<p>A man around my age, wearing a pink jumpsuit and carrying a green holdall took the seat in front of me. He made me jump as the seat rocked back a bit more than I expected under his weight and my eyes found a peculiar line of stitching along the back of his neck, running up to his scalp.  </p>\n\n<p>Fixated, I spotted a couple of butterfly stitches running horizontally as well. Which I thought peculiar. One of my old friends from university got glassed once in a nightclub and the cut didn’t look as straight as this fella’s. It might have been some kind of spinal surgery or just something related to none of my business kind of thing.  </p>\n\n<p>Embarrassed at my growing paranoia, I wrenched my eyes away to watch the scenery morph from urban to industrial as we passed under the main arterial road. The AC in the coach was strong enough to protect us from the smell of the rendering plant while we were still inside, but watching the constantly belching chimneys made me think that it was probably best to think about moving away with Ava after this. I could just move out during one of Steve’s “work weekends” and send a hench-looking bloke around with the divorce papers.  </p>\n\n<p>The coach drew to a halt outside Palimpsest Plc’s new purpose built industrial complex and disgorged us at its gates. Despite the rain, I stepped off and looked up at the cheerful “Building A Better Future” which hung above the workers’ entry and felt my stomach sink. It looked-  </p>\n</div>\n","author":"SlightlyNauseated"}