{"rank":"2","title":"Outcast (Part 2)","id":"8k8c9n","url":"/r/nosleep/comments/8k8c9n/outcast_part_2/","time":"1526596050000","body":"<div class=\"md\"><p><a href=\"https://www.reddit.com/r/nosleep/comments/8jykvc/outcast_part_1/\" rel=\"nofollow\">Part 1</a></p>\n\n<p>Waning daylight brought winter’s embrace, and for the first time in a long time there was true night again. I’ve spent my share of summer’s in Alaska, but I don’t think I’ll ever fully adjust to watching the sun never set… or rise. The first night after summer is an odd feeling. Summer in Alaska is a violent period of growth and prosperity. When night and cold return, the very breath of life leaves the land in an equally as sudden departure. Even the mountains seem to wither. But with its desolation, winter still found wonder.</p>\n\n<p>The cabin was poorly insulated. I survived the bitter nights with multiple blankets, effectively turning myself into a human burrito. My pup, since grown to an impressive size, was an easy heat source as well. Butted against my back, we kept each other warm in the long nights.</p>\n\n<p>Dagon growled a low warning to the front door. He held his head low and his eyes locked, growling intently. I shot up, grabbing the loaded 44 by my bed out of pure instinct. I was immediately taken aback by the light pouring through my window, forgetting why I grabbed the gun. As if a UFO alighted to take me away, vivid green light spilled into my bedroom: the aurora, the Northern Lights. I squealed to Dagon. Hesitantly he relinquished his gaze on the door and wagged his tail at my excitement.</p>\n\n<p>I threw on my winter gear and bolted to the front door. Opening the door released a wall of frigid air that chilled my bones and the air in my lungs. It was so cold you could hear the earth crack under its frozen skin. A thick layer of frost and snow, like matted fur, covered everything. The ice crystals glowed green in the aurora’s dance. </p>\n\n<p>“Dagon, look at that!!!” I hollered to him. </p>\n\n<p>“Dagon, did you know the natives believed the lights were stairways to the afterlife?” Dagon’s tail wagged furiously. I liked to think it was his way of acknowledging my fact, as if he understood. He ran around the cabin excitedly. </p>\n\n<p>The entire sky was green. Chaotic flashes of red erupted in the green, and the curtains of light shimmered like a school of fish evading a predator in elaborate dashes and stripes. Stars twinkled behind the colorful glow. My pale breath, a wisp of warmth stolen, faded into the night. All the while the frozen earth groaned, as if awakening in the spectral light and whispering in protest.</p>\n\n<p>I set up my camera to catch a picture, and to avoid image disturbance I set it to take a picture every 30 seconds so I wouldn’t have to touch anything and shake the long exposure. The first shot revealed the lights in a pattern resembling a bird with its wings outstretched to the heavens. I was ecstatic. I framed the next to catch my cabin silhouetted in the green, the warm golden light spilling from the windows. Ice crystals whined as Dagon bolted through the tall, dead grass, shattering the cold sculptures. I framed the final picture above the thickest part of my forest, so that the trees cradled the light and the stars above them. </p>\n\n<p>Dagon’s romp stopped abruptly, curled tail falling to his rump. He lowered his head and growled towards the forest.</p>\n\n<p>“Dagon, it’s a moose, dumbass. Leave it be.” </p>\n\n<p>I could hear the moose rustling in the low boughs of the spruce. Its heavy footsteps crunched delicately in the frozen landscape. I snapped my picture. Dagon barked a ferocious warning, head up, hackles raised, towards the forest. </p>\n\n<p>“Dagon, enough! Look!” I shined my light at the trees to catch the final glimpse of an elongated, pale, corpselike leg disappear into the heart of the forest. Tendrils of aged fur hung limply off its calf, and as the leg lifted into the darkness, its enormous taloned claws twitched in the bitter air. I ran. Dagon followed.</p>\n\n<p>I shoved him through the door, slamming it. For the first time, I locked all three locks. I shut off the lights to cut the glare and stared out the window, surveying the open meadow. There was nothing. Nothing but the cold and that alien green glow. At that moment I realized I had forgotten my beloved camera outside, still snapping pictures in the dark as I set it to do. Now, any sane person would argue it’s a camera, it’s replaceable. But I loved that camera more than I loved most people. I told stories through the images I captured. I named her. Her name was Emily.</p>\n\n<p>Dagon stared intently at the front door, and soon I found myself doing the same.</p>\n\n<p>“I can’t leave her out there,” I thought. “She’s traveled the world with me, and there’s no way I could afford to replace her.”</p>\n\n<p>I stared silently with Dagon for an eternity, occasionally peering outside to see the little yellow light on the camera that indicated it snapped another shot. </p>\n\n<p>“We have to get her.” I said to Dagon.</p>\n\n<p>Tiptoeing along the creaking floor, I grabbed the 44 from my room, checking that it was actually loaded. Six morbid rounds sat patiently in the cylinder. I begrudgingly walked to the door. I unlocked the first lock, the smallest, and then pressed my ear as if to hear something take the false opportunity on the other side. Dagon stood patiently waiting for my guidance. The second lock, a proper door’s lock, clicked open. Again, no response on the other side. Finally, the third lock, the massive sliding mechanism. I slid it across its barrier as quietly as I could. It was now unlocked and open, the door could be pushed agape. I looked at Dagon.</p>\n\n<p>“I know it’s a dick move, but you first, I’ll be right behind you with the gun.” </p>\n\n<p>I ripped the door open and yelled at Dagon to move. He charged through the door like a foolish soldier on his first deployment. We ran to the camera, front door wide open so we could make a mad dash back inside. Dagon ran patrol of my flanks, and I stopped a moment to investigate. Those bitter whispers in the savage cold seemed to be alerting my return, and the wind suddenly picked up as it whistled lightly in the distance. The lights had faded to a pale glow, making it harder to see anything in the abyss. Nothing. I grabbed the camera and ran back. </p>\n\n<p>“GO, DAGON!” I practically kicked him inside. The door nearly bit me in the ass as I slammed it once and finally for the night, locking and double checking everything. The camera took one last picture, a blur of light and nonsense. And for a fleeting second, I cringed at how foolish I was to leave the door open. Anything could have gone inside the dark and poorly lit cabin while it was unattended.</p>\n\n<p>I mustered the courage to do a quick parole. Nothing looked out of place. No monster in the closet nor under the bed. No fiend hiding behind my kayaks tucked safely in the corner. No ghoul in the pantry. My heart sank. There was one place not so easily seen: the attic. I swallowed hard and propped the ladder under the attic entry, shoving it aside. Like removing a bandaid, I jumped up quickly and lit up the top. It was empty, except Carl’s things, just as I had left it after cleaning the murder scene months earlier. </p>\n\n<p>My gun would sleep on the bed with me that night. </p>\n\n<p>~</p>\n\n<p>The following morning, I sipped my bitter coffee while I stared out the window into the meadow. My brow furrowed as the tufts of steam warmed my face. See, I had an outhouse, not a flushing toilet, and that outhouse was easily 100 feet behind the cain into the trees. I really, <em>really</em> had to pee. Granted, I could see now, but still. Whatever was in the woods last night was horrifying. I could still see its lanky leg carefully hiding itself in the trees and bramble. Just like giant moose, it slipped into the woods so easily, so perfectly camouflaged. Its obsidian nails still shimmering in my mind’s eye. I looked to the trees where I had seen it.</p>\n\n<p>“That couldn’t have happened.” I reassured myself out loud. “There’s just no way. I let fear get the better of me. I let my imagination win. It was Barbara the moose, just doing Barbara things. Fuck you, Barbara.” I joked.</p>\n\n<p>My camera was still perched on its tripod where I hastily threw it the night before. Cautiously, I clicked it on and went to review the pictures. Perhaps I’d caught Barbara in the act. The battery signal flashed low, the cold had drained it, but it had enough juice to quickly inspect and give me the courage I needed to use the outhouse. The first image of the Aurora Bird turned out nicely. The second, my cabin, was eery and yet welcoming. The third, my trees cradling the lights. I dropped my coffee at the next image. Under the lights, illuminated in a toxic green, there it was, whatever that thing was, except the picture had caught more than I had seen when I shined my flashlight. A massive, hunched figure from the hips down. Its upper half, a lanky and matted torso, pulled itself into the trees beyond sight. One of its arms reached back, as if still holding a branch out of its way. </p>\n\n<p>The sound of the cup shattering pulled me from my stupor. I was sweating. As I jumped to protect my feet, I looked away from the camera, cursing. By the time I looked back, the camera had fully died. </p>\n\n<p>“There was no fucking way,” I thought.</p>\n\n<p>But I have no confirmed answer. When I charged the battery and went to load the picture on my computer the files had been corrupted. At least the remaining winter passed quietly, and I convinced myself as the time passed that it was just a moose all along. <em>Just a moose.</em></p>\n\n<p><a href=\"https://np.reddit.com/r/nosleep/comments/8lxcxw/outcast_part_3/\" rel=\"nofollow\">Part 3</a></p>\n</div>\n","author":"ckjm"}