{"rank":"35","title":"Caterpillar","id":"8k8e56","url":"/r/nosleep/comments/8k8e56/caterpillar/","time":"1526596495000","body":"<div class=\"md\"><p>I was playing with my hospital badge as I stood in line ‘Jonathan Villanueva’ Johnny V, that’s me. I had just finished my shift as an emergency room nurse. Not my usual spot, but it was the Fourth of July and they were understaffed. So after a ten-hour overnight shift of attending to drunks and people with firecracker injuries, it was eight in the morning and I was ready for a nap and a beer. But the line at Walmart was ungodly slow. And of course, there was only one register open.</p>\n\n<p>I watched as other customers were being led to the self-checkout lanes. But unfortunately, beer was one of many things that could not be self-checked. So after a few minutes, I was next in line with a clear view of the individual causing the wait.</p>\n\n<p>The little girl looked around twelve or so, old enough to be shopping on her own but young enough to be having a panic attack over being nearly ten dollars short. “This can’t be happening,” she cried. She tugged on her long black ponytail as she tried to count her money again. A worker had been tasked with bringing her cheaper versions of the items she was attempting to buy but it was still not going to be enough.</p>\n\n<p>I looked in her cart. It was filled with repair items; tape, cords, various containers, and well as grocery items like canned goods and bottled water. “How much do you need?”</p>\n\n<p>She turned to me, wiping tears from her eyes. “What?”</p>\n\n<p>I directed my question to the cashier. “How much does she need?&quot;</p>\n\n<p>“$9.74,” the elderly woman replied. “You really don’t have to do this.”</p>\n\n<p>I handed her a ten. “I’m sure her parents are wondering what’s taking her so long.”</p>\n\n<p>The little girl looked at me with a forced smile. “Thank you, sir.” She finished her transaction and began to push her heavy cart.</p>\n\n<p>I didn’t ask if she needed help, that would have come off as a little creepy. So I paid for my six-pack, some bread and few bags of M&amp;Ms. On my way out I saw the girl loading her cart into a smaller, much dirtier cart, which looked like something out of a coal mine. I didn’t need to wonder why she didn’t shop with her cart; she probably didn’t want to be stared at any more than she already was.</p>\n\n<p>She caught my glance and smiled, this time a genuinely sweet smile. “Thanks again,” she pointed to my name badge. “Jonathan?”</p>\n\n<p>“Just Johnny,” I said. I tossed her a bag of M&amp;Ms, the candy fell at her feet.</p>\n\n<p>She was blushing as she picked up the bag and quickly pocketed it. “I’m L.”</p>\n\n<p>&quot;That&#39;s a little kid&#39;s name, how old do you think I am?&quot; As she stood up straighter, she appeared taller with more defined features. “The name&#39;s L, like the letter. I don’t like people knowing my full name.”</p>\n\n<p>“Of course, your parents taught you well.”</p>\n\n<p>“No, not for safety, I just have a really stupid name.” She giggled, the innocence returning to her face. “I’ll see you around.”</p>\n\n<p>I nodded. “See ya.”</p>\n\n<p>The girl turned her head. &quot;By the way, I&#39;m sixteen.&quot;</p>\n\n<p>&quot;I&#39;m sorry, I didn&#39;t mean to offend you.&quot;</p>\n\n<p>She bit her lip with a sly glance. &quot;You&#39;re kinda cute.&quot;</p>\n\n<p>I couldn&#39;t help but blush. &quot;I&#39;m twenty-one; five year age difference is a ten-year sentence.&quot;</p>\n\n<p>That caused her to smile. &quot;Well then, goodbye Johnny. Maybe I&#39;ll see you in two years.&quot;</p>\n\n<p>I went home and went straight to bed. Today was my day off so I planned on sleeping for a good ten maybe even twelve hours but that was not the case. I awoke at noon to a call from my sister Olivia.</p>\n\n<p>“Johnny, I need you to babysit Dad.”</p>\n\n<p>“I just got home.”</p>\n\n<p>“Not right now, idiot, come over at six. And make it sound like it was your idea.”</p>\n\n<p>“Let me guess, you’re going to a party?” I groaned. One of the worst parts of living in southern Wisconsin: there was not much to do other than party, especially for Olivia. She was a full-time college student.</p>\n\n<p>“I have been watching Dad all week; I deserve to go have some fun.”</p>\n\n<p>Our father was dying of end-stage leukemia. The infection had spread to his brain and he had very little time left. He wanted to be able to leave me and Olivia something other than medical debt so he opted to stay home rather than in hospice care. Since it was summer, and Olivia didn’t have a job she took care of him the majority of the time. But once the fall semester started up those roles would be reversed, and I would care for him (while working nightshifts, and living on coffee and energy drinks.)</p>\n\n<p>I reluctantly agreed to help her out. I set my alarm for five pm so I would have time to shower and pick up something to eat. I managed to arrive at 5:47, letting myself in with my key. I could hear groaning coming from my father’s room. “Dad!” My father had fallen out of bed. He laid in the fetal position, shivering badly.</p>\n\n<p>He was 6’2” but with how frail he was, I could lift him without assistance. I put him back into bed and locked the guard rails into place, just as Olivia entered the room.</p>\n\n<p>“Johnny! I knew I could count on you.” She held her arms open for a hug.</p>\n\n<p>“What the hell, Liv? You left the bed rail down!”</p>\n\n<p>“Sorry,” she muttered. Suddenly, a man entered the room.</p>\n\n<p>He had long blonde hair like a stereotypical surfer, high cheekbones, and piercing blue eyes. “I’m Tommy.” He held out his hand. His smile was like that of the Cheshire cat from Alice in Wonderland; wide with bright white teeth. But the more I looked at him the more I began to see something else: a shark. The guy smiled like a great white shark.</p>\n\n<p>“I&#39;m Johnny,” I said shaking his hand. I glanced at his bare arms, I could see bruises and needle marks. I also noticed an unusual tattoo. “Is that a harp?”</p>\n\n<p>He chuckled. “The letter V.”</p>\n\n<p>“V?” I asked curiously. I had a similar tattoo on my hand, but mine stood for my last name. And mine was intentionally made to look like a harp, in tribute to my mother.</p>\n\n<p>Tommy ran his fingers through his hair. “It’s my street name.”</p>\n\n<p>&quot;White boy has a street name?&quot; I chuckled to myself.</p>\n\n<p>Olivia nudged my arm. “Johnny, stop harassing my boyfriend.”</p>\n\n<p>“Boyfriend?” I groaned. More like a fuck toy. Olivia had a new boyfriend every other week. I watched as Tommy stuck out his forked tongue and licked his upper lip.</p>\n\n<p>“We have to get going. See you later, Johnny.” Olivia kissed my cheek looking as beautiful and sweet as our late mother.</p>\n\n<p>“You two have fun. I have everything covered.” I wanted them to leave. As soon as they did I want straight to the bathroom.</p>\n\n<p>I threw open the medicine cabinet and shook bottle after bottle. Olivia and her fucked up friends were stealing my father’s pain pills. Oxycontin and anything that might have street value was gone. I was too mentally and emotionally exhausted to get the police involved. I mean, it&#39;s not that I could prove anything.</p>\n\n<p>Luckily, it was not quite as easy to shoot-up or sell the medication that came in IV bags, so I was able to give my father something to help him sleep.</p>\n\n<p>I stayed at the house all night, but Olivia and Tommy never came home. I left message after message with no reply. I was considering calling the police when my Dad finally woke up.</p>\n\n<p>“Livvy? Where are you Livvy?”</p>\n\n<p>“Olivia’s not home,” I said.</p>\n\n<p>“Johnny?” My father was reaching out his hand. “They took her.”</p>\n\n<p>“Who?”</p>\n\n<p>“The demons.” He swallowed hard. “Your mother came to me in a dream. She told me where they took Olivia.”</p>\n\n<p>I didn’t know what to think. My mother died when Olivia was born. I barely had any memories of her. But my father never remarried. He always acted like she was still a part of his life. I knew my father had tumors in his brain, to the point where he was nearly blind in both eyes. Maybe his mind was gone, or maybe he already had one foot on the other side, with my mother.</p>\n\n<p>“I’m going to call the police. I can’t exactly go out looking for her. I have to get to work. I have to …” My father grabbed my hand. Instinctively, I closed my eyes. I could see tunnels, possibly a sewer. “I-I…”</p>\n\n<p>“I will guide you there.” With his trembling hands, too weak to even feed himself, my father removed his wedding ring and handed it to me. As I put the band on my finger I could see a map; a series of glowing red lines, like a GPS in the back of my eyes. I knew exactly where I needed to go: the movie theatre.</p>\n\n<p>The town’s only movie theatre sat in the middle of a field, across from the highway. Growing up in my small town I always found it odd that while the rest of the land surrounding the highway had been turned into truck stop hotels, fast food restaurants and of course the Walmart, the area around the movie theatre remained the same mass of tall weeds.</p>\n\n<p>Wearing my father’s ring I walked through the denser patches. The golden grass stood well over six feet in height. I had no idea what I was even looking for but, for my father, I had to try. I started to feel cold, a strange feeling in the sweltering heat of July. I kept walking, further towards the center of the field, when suddenly I came face to face with a door.</p>\n\n<p>A wooden door painted yellow, the color of the surrounding weeds was standing on its own, in the dirt. Walking around it, the door did not appear to be attached to anything other than the ground. I chuckled as I touched the handle. This was not happening: I was dreaming. I would wake up in my bed, none of this was real. “Ow!” The handle was white hot, but only for a few seconds. I could see specks of my blood on the rusted metal. The door opened to a long corridor. This was too freaky. I had seen enough movies to know when to run in the opposite direction. Then I heard a voice.</p>\n\n<p>“He who is without sin may cast the first stone.” The voice echoed down the mysterious hall. It sounded sweet and innocent, like a child.</p>\n\n<p>Although the statement, itself, was all kinds of creepy. I wanted so badly to trust someone. Best case scenario I find Olivia, worst case, I die alone like the loser I always was.</p>\n\n<p>I clenched my father’s ring praying that its power would protect me or at least light my way. I stepped through the doorway. The yellow door slammed shut behind me, leaving me in total darkness. I pulled my cell phone from my pocket. As I expected, I had no signal. But I figured that the glow of the fully charged phone could serve as a light source.</p>\n\n<p>In the distance I could see other lights, they were faint, like candles or maybe torches. As I came closer, they looked more like Christmas lights, glowing bulbs embedded in the dirt walls. And now there were three paths. I raised my light to the first tunnel and immediately regretted it.</p>\n\n<p>Screams of terror filled the corridor. And I could hear metal; prisoners banging on bars and rattling chains, crying out for my help.</p>\n\n<p>Someone grabbed my hand. “This way,” said the same child-like voice from earlier. The small hand pulled me to the third tunnel. “Here,” the creature handed me what appeared to be a rubber clown mask. “Put it on!” the creature grabbed my phone, pointing the light at its face to reveal a rubber clown mask that covered its entire head.</p>\n\n<p>“Does everyone wear a mask here?”</p>\n\n<p>“The workers, those without sin,&quot; the creature replied. &quot;But you seek a sinner.”</p>\n\n<p>I quickly put on the mask. “My sister, I-” I was about to unlock my phone when the creature grabbed my hand.</p>\n\n<p>“Sh…” the creature led me to a wall of what appeared to be college IDs. “Name?”</p>\n\n<p>“Olivia Villanueva,” I said, my voice trembling. There had to be hundreds of cards stuck to this wall. Were these all of the people screaming in the first hallway?</p>\n\n<p>“Oh…” the creature said sadly.</p>\n\n<p>“What? Do you know where she is?”</p>\n\n<p>“She’s already been recycled.”</p>\n\n<p>“Recycled?”</p>\n\n<p>“Into the caterpillar.”</p>\n\n<p>“The what?” This was not happening. I was going to wake up on my Dad’s sofa and Olivia is going to come out of her bedroom and tell me I need to leave for work.</p>\n\n<p>“I can help you find her.”</p>\n\n<p>“But why? Why are you helping me?”</p>\n\n<p>“Because you don’t belong here.”</p>\n\n<p>I was now certain the creature was a girl. I knew in my heart that if I stuck by her I might have a chance at survival. &quot;Lead the way.&quot;</p>\n\n<p>I followed her down a corridor to a lower level. From the top of the stairs, I could see what appeared to be a caterpillar-shaped mass. I had seen the movie, Human Centipede, where bodies were sewn together in a daisy chain. That was not what I was looking at. This looked like one of those hairy caterpillars a long mass with many little hairs jetting out. Except these weren’t hairs, they were human limbs each one of them independently moving.</p>\n\n<p>“Is she inside that?” I asked. Suddenly someone pushed past us.</p>\n\n<p>“Move it, Ze!” he shouted at my guide.</p>\n\n<p>“Screw you, Vega!” Ze shouted back. She turned to me. “He’s such an asshole. They all are.”</p>\n\n<p>“What did you say to me?” The man’s voice was deep, demonic. He raised his arm and smacked Ze in the head knocking her down.</p>\n\n<p>“Hey!” I shouted, grabbing him by the arm. What I saw nearly caused me to scream. It was Tommy’s ‘V’ Tattoo. Instinct took over, and I grabbed his mask.</p>\n\n<p>His long blonde hair tumbled down his back. Tommy turned and smiled. “So which one are you?” He took a step closer. “The husband? The brother? The father?”</p>\n\n<p>“What?”</p>\n\n<p>“Who are you looking to avenge? Kristen, Julia, Maria, Katie-” He blinked his eyes causing them to turn from human blue to a snake-like gold. “Olivia, she was a tasty one.” He raised his hand, his nails long and black.</p>\n\n<p>I took a step back in case his next move was to try and rip off my mask.</p>\n\n<p>But just as quickly a shadow struck him in the side of the head.</p>\n\n<p>Vega groaned as he fell to his knees.</p>\n\n<p>Ze grabbed my hand, as I was too shocked to move. “Run!” She tossed a large rock as we ran towards the stairs.</p>\n\n<p>“How hard did you hit him?” I asked.</p>\n\n<p>“He had it coming,” she muttered as we made our way down the stairs, closer and closer to the fleshy caterpillar. “That ass-hat preys on &#39;bad girls&#39;; cheaters, whores, sluts- his words not mine.”</p>\n\n<p>“What do you do here?” I asked.</p>\n\n<p>“Not that,&quot; she quickly replied.</p>\n\n<p>“Why are you here, how did you get here?”</p>\n\n<p>“I was born here,” she said a calm tone, laced with hints of sadness.</p>\n\n<p>We approached the caterpillar. It stood well over ten feet tall, and possibly miles long. The mass of arms and legs were flailing in every direction. I could hear screams, like the sound of someone bound and gagged. But I saw no faces.</p>\n\n<p>Ze walked to the caterpillar. As she approached, the mass of body parts became calm. “Hi, Mom.” She reached her hand into the mass, allowing the sea of limbs to swallow her up to her shoulder.</p>\n\n<p>For the first time, I felt like I was going to panic. I reached for Ze but she raised her free hand. &quot;It&#39;s ok. Me and this thing, we go way back.&quot;</p>\n\n<p>A woman’s face emerged. Her eyes were sunken in, her skin rotten and decayed. But yet I could still make out her beauty; her bone structure, her long black hair.</p>\n\n<p>“Mom, I need you to find someone,” Ze said. Her voice still sounded so sweet, like Olivia when she was a little girl.</p>\n\n<p>The dead face nodded.</p>\n\n<p>Ze turned to me. “Say the name.”</p>\n\n<p>I swallowed hard. “Olivia Villanueva.”</p>\n\n<p>The dead woman’s mouth opened as if to take a breath. “Livy…”</p>\n\n<p>The mass of limbs formed a dark hole, from inside something was spit out. It looked like a mannequin that had been run over by a truck. But it was Olivia. She was face down. I expected her to start crawling like one of those Japanese ghosts, but she only groaned.</p>\n\n<p>“Grab her!” Ze whispered. Her head was turning, looking around.</p>\n\n<p>I hadn&#39;t seen anyone else in the tunnels, but that was before we started messing with their property. Out of the corner of my vision, I could see figures emerging from the upper levels. I ran to my sister scooping her body up into my arms. I knew the less attention I paid to her current state the better.</p>\n\n<p>“This way!” Ze shouted. She ran straight towards the caterpillar. The long creature extended down a pathway. “Stay close to me!” Ze shouted as she ran along the side of the caterpillar.</p>\n\n<p>I could hear people chasing us, but I concentrated on Ze. As we passed the disembodied hands and feet I could hear slapping. I dared not turn around. I only hoped my instinct was correct: the caterpillar was protecting Ze and, by association, myself as well.</p>\n\n<p>Ze made a sharp turn and I followed. She was squatting in a dark corner, gasping for breath. “Sorry, I can’t run for very long. This has always been my resting spot.”</p>\n\n<p>“You do this a lot?”</p>\n\n<p>“Whenever I want to get away from Vega, or Tommy as I know he calls himself.”</p>\n\n<p>“Does he hurt you?” I asked.</p>\n\n<p>“No, but my mother was one of Tommy’s first victims.” Ze stood up. “We need to keep going.” I looked down at Olivia, but immediately Ze grabbed my hand. “She’s alive, that’s what matters, right?”</p>\n\n<p>The tunnels were dark. I was so tempted to turn on my phone just grab a peek at my sister. I could already feel she was missing part of her right arm and her entire left leg. The entire place smelled like meat. Not death, like a hospital or morgue, it smelled like a butcher shop; a place where meat is cleaned and made presentable. That was what the caterpiller-creature was: an elaborate display of meat held together by some kind of unholy magic.</p>\n\n<p>“Do you know why everyone wears clown masks?” Ze asked as we walked. “It’s not because we’re scary.” She grabbed my phone from my pocket and took off her mask. Ze&#39;s long black hair was pulled in to a ponytail, her blue eyes sparkled in the dim light of my phone.</p>\n\n<p>“I know you. You’re L, the girl from Walmart.”</p>\n\n<p>“My real name is Eliza.”</p>\n\n<p>“That’s pretty.”</p>\n\n<p>“Not really. Vega named me that as a joke.”</p>\n\n<p>I looked at her confused.</p>\n\n<p>“Eliza Doolittle from My Fair Lady? You know: the story of a low-class girl who gets taken in by some rich guy. He teaches her how to walk, talk, how to be his vision of proper lady. Have you never seen the movie?”</p>\n\n<p>I had heard of it, but the movie was before my time. And Tommy, or Vega, didn&#39;t seem like the kind of person who would be a fan of classic films. “Is that what he is to you? He’s your mentor?”</p>\n\n<p>“Not exactly.” She rammed her shoulder into a seemingly random spot on the wall.</p>\n\n<p>“What is he?”</p>\n\n<p>“That demon is my father!&quot; She rammed it again, revealing wood the color of the door. &quot;He&#39;s the reason I&#39;m allowed to go shopping for supplies on the surface world.&quot; SLAM! More of the wood was exposed. &quot;He wants me to become just like him!&quot; SLAM the entire door was visible.</p>\n\n<p>“But your mother was human,” I said. That was all I wanted to focus on. I didn’t care how old she was or if she was some kind of Hell princess.</p>\n\n<p>&quot;Yeah, and my father wants me to see humans as nothing more than animals!” Her words gave her the burst of necessary to force open the door. Sunlight poured into the tunnel. “Go, hurry!” She was grabbing her arm in visible pain.</p>\n\n<p>I reached my hand for Eliza. “Come with me.”</p>\n\n<p>“I can’t.”</p>\n\n<p>“Please! You don’t belong here! I’ll watch over you, I’ll take care of you.”</p>\n\n<p>She smiled at me. Her eyes sparkled with heavenly light. “You’re sweet. But right now I need you to run and don’t look back.”</p>\n\n<p>I nodded. “Goodbye.”</p>\n\n<p>“No, not goodbye. Until we meet again.” I watched as she closed the door. As soon as it shut the wood began to decay. In a matter of seconds, all that remind was a pile of ash.</p>\n\n<p>“Please, no!” The gateway was no more. I feared would never see Eliza again, not at Walmart, not ever. My heart was in pain. Then I got my first look at Olivia. If I was not a nurse, by trade, I would have passed out. My sister had no face. It was as if someone had taken a blowtorch to her eyes, nose, and mouth. I could feel her breath on my neck as I carried her, but she had not spoken a single word.</p>\n\n<p>I laid her on the backseat of my car and drove to my father’s house. She was as still as a corpse for the entire thirty-minute trip.</p>\n\n<p>I pulled into the driveway and glanced at my father&#39;s ring. It was still glowing. I held it to my chest, with a glimmer of hope.</p>\n\n<p>Then I opened the door. The smell was unmistakable, I didn&#39;t even bother to check his bed. My father was dead.</p>\n\n<p>I pulled out my phone to call 911 but fell to my knees as I looked at the date. I had been gone for nearly a week. My mind was racing, as to the horrible nature of my father&#39;s death; seizure, starvation? I almost forgot about my mutilated sister.</p>\n\n<p>Eventually, my hands became steady enough to dial 911. I managed to convince the police I found my sister&#39;s body abandoned in a field, the possible victim of a hate crime. She was taken to the hospital.</p>\n\n<p>Over the next year, I worked on settling my father&#39;s estate. With my inheritance, I transferred Olivia to a psychiatric hospital in California. With a stellar letter of recommendation from my superiors, I was able to land a nursing position in the same hospital.</p>\n\n<p>For the last six years, my life has been devoted to working and watching over my sister. I bounced between the pediatric ward and maternity ward. I took pride in working with children, each one of them a miracle.</p>\n\n<p>During my lunch breaks, I checked in on Olivia. She still had her hearing and sense of touch, with her remaining limbs. With the help of a great team of doctors, she was learning how to communicate, even making friends. I was hopeful that someday she might even be able to live a normal life. Or perhaps that was my wish for my own life.</p>\n\n<p>After a ten-hour work day, I would go home to my studio apartment and sleep until my next shift. I had no friends, no family, and no hope. I ate lunch alone every day in the cafeteria, eating the sandwich I brought from home. No point in spending a lot of money. I kept to a moderate budget, dividing my income to pay for Olivia&#39;s care, my food and rent, whatever was leftover went into my retirement account. That was the goal: to work until I was too old, then maybe travel the world.</p>\n\n<p>I would love to work for an organization like Doctors without borders, helping children in third-world countries. Perhaps once Olivia was independent enough to be moved to a live-in facility.</p>\n\n<p>All I had were my dreams. In my dreams I had Eliza. I would call her Azzy and we would live in a big apartment, somewhere in Europe. I knew so little about her, but I could never forget her.</p>\n\n<p>One day she appeared. I spotted her in the cafeteria a girl with eyes the color of the brightest day and hair the color of the darkest night. She was sitting in the corner, staring out into the crowd as she sipped a can of Sprite elegantly, with a straw. She was maybe 5&#39;6&quot; with plump, glossy lips the color of cinnamon candy. The girl looked up at me, our eyes met and she smiled.</p>\n\n<p>My heart was in my throat as I walked over. “Hi, this might sound odd, but you remind me of someone I knew a long time ago.”</p>\n\n<p>“Hi, Johnny,” she said. Her voice was mature and seductive, but with that same child-like innocence.</p>\n\n<p>“Eliza?”</p>\n\n<p>She nodded, batting her long eyelashes. “It’s me.”</p>\n\n<p>“I- I can’t believe it! How did you escape? How did you find me?&quot;</p>\n\n<p>She licked her lips and motioned for me to pull up a seat next to her. “I earned it.”</p>\n\n<p>“You earned it?” I asked.</p>\n\n<p>“I earned my freedom, and with it my beauty,&quot; she said in a haunting whisper. &quot;Then I tracked you here,&quot; she added, her voice returning to normal.</p>\n\n<p>&quot;How?&quot; I didn&#39;t have any social media accounts since there was no one I wanted to follow or stay in touch with.</p>\n\n<p>&quot;Your parents,&quot; she answered. &quot;They&#39;re very happy where they are. Oh, and your dad told me to tell you he&#39;s proud of you.&quot;</p>\n\n<p>&quot;Okay...&quot; I would be lying to say I wasn&#39;t nervous. What exactly was she?</p>\n\n<p>With a coy smile, Eliza slipped me a plain white envelope. &quot;For you.&quot;</p>\n\n<p>Inside was a necklace with a leather pendant.</p>\n\n<p>“Do you like it?” she asked.</p>\n\n<p>I turned the pendant over. It wasn’t leather at all, it was skin. A piece of dried flesh tattooed with a letter ‘V’. “I love it.” I looked at Eliza; what was once a caterpillar was now the most beautiful, powerful butterfly. “And I love you.”</p>\n\n<p>&quot;I love you too,&quot; she said with a giggle.</p>\n\n<p>&quot;Do you have a place to stay?&quot;</p>\n\n<p>&quot;I&#39;ve actually been living out of my car.&quot;</p>\n\n<p>&quot;Your car?&quot;</p>\n\n<p>&quot;A Honda Civic, just enough room for my entire life,&quot; she chuckled. Now she was the one who looked nervous. &quot;I-I kind of bet the farm on you still wanting to see me, I mean, it&#39;s been six years, you could have been married with a kid.&quot;</p>\n\n<p>&quot;What do you mean by &#39;bet the farm&#39;?&quot; I was curious to know just how much she carried of her past.</p>\n\n<p>Eliza shrugged. &quot;I have some money saved up. My plan was to enroll at the local community college.&quot;</p>\n\n<p>&quot;That&#39;s cool.&quot; I chuckled to myself. &quot;Well, for me, the last few years have been devoted to Olivia.&quot; I glanced at my watch. &quot;I&#39;m supposed to check in with her.&quot;</p>\n\n<p>&quot;Now?&quot; Eliza asked.</p>\n\n<p>&quot;Yeah, she&#39;s getting assigned a new therapist. I promised her I&#39;d check in during my break.&quot;</p>\n\n<p>&quot;Great, I&#39;d love to finally meet her.&quot; Eliza stood up. She wore a modest green tank top paired with dark denim jeans.</p>\n\n<p>&quot;Sure, I mean if you&#39;re done eating.&quot; I had not eaten my sandwich yet but I figured I could do so on my next break.</p>\n\n<p>I held Eliza&#39;s hand in the elevator as we went to the psychiatric ward.</p>\n\n<p>She leaned her head on my shoulder, her hair smelled like roses.</p>\n\n<p>We walked arm in arm to the ward where I introduced Eliza to the Nurse Becca at the reception desk.</p>\n\n<p>The older woman greeted Eliza then quickly pulled me to the side. &quot;You need to get in there. The new therapist is some kid, straight out of school. All she does is go on smoke breaks. I can&#39;t believe the hospital would hire someone so incompetent.&quot;</p>\n\n<p>&quot;Is that her?&quot; Eliza asked, motioning towards a nearby patio. On the opposite side of the glass door stood a young female doctor with long red hair. She was smoking a cigarette. &quot;She&#39;s pretty,&quot; Eliza muttered under her breath.</p>\n\n<p>&quot;Yes, that&#39;s about all she is,&quot; Nurse Becca groaned. &quot;All she does is complain non stop about having to work in a &#39;freak show.&#39;&quot;</p>\n\n<p>Eliza gave a look of disgust. &quot;But she&#39;s a doctor!&quot;</p>\n\n<p>Becca rolled her eyes. &quot;Dr. Elena Ryan: Her goal is to transfer into sports medicine, spend all day working with beautiful people.&quot;</p>\n\n<p>I threw up my hands in frustration. &quot;I&#39;m going to go check on Olivia.&quot; I walked away, to Olivia&#39;s room.</p>\n\n<p>She was sitting in her rocking chair listening something on her iPad while wearing a plain white mask that covered her entire face.</p>\n\n<p>I tapped her shoulder to get her attention. &quot;Where did you get the mask?&quot;</p>\n\n<p>Olivia flipped the iPad over to a brail keyboard. I watched as she typed her answer. &quot;Dr. Ryan said I had to wear it if I ever want to be let back into society.&quot;</p>\n\n<p>I couldn&#39;t believe what I was hearing. I had gotten used to her face or lack of one. The rest of the world could easily do the same. &quot;You don&#39;t have to wear that if it&#39;s uncomfortable.&quot;</p>\n\n<p>&quot;Thanks,&quot; she wrote.</p>\n\n<p>I watched as she removed the mask. The scar tissue had mostly healed. The current state of her face was smooth like plastic; no eyes or nose or lips. Her mouth was still present, a gaping hole with teeth but no tongue.</p>\n\n<p>Suddenly, Eliza appeared. I noticed she was running her fingers through her hair. With every stroke, her dark locks sparkled. &quot;Hello Olivia,&quot; she said as she approached my sister without fear or hesitation. Eliza touched her hand to Olivia&#39;s face. &quot;I&#39;m Eliza, we&#39;ve met before.&quot; She placed a hand on Olivia&#39;s head, forcing her to bow. Eliza then bowed her own head, their foreheads pressing together. For a moment their dark hair seemed to flow into one mass of shadow. &quot;Much better,&quot; Eliza said, taking a step back.</p>\n\n<p>I rushed to my sister&#39;s side. &quot;Olivia?&quot;</p>\n\n<p>My sister&#39;s head was still leaning forward. She was making strange sounds, like weeping. With her one prosthetic hand, she brushed the hair from her face to reveal an actual face; eyelashes, a nose, and actual lips. But something seemed off. Olivia opened her eyes. They were green. My sister never had green eyes. Her new eyes blinked rapidly as if trying to get used to the sensation of light. She stood up and walked towards the sink, her hands reaching towards the mirror. She gasped but no words came out of her mouth.</p>\n\n<p>&quot;Sorry,&quot; Eliza said biting her lip nervously. &quot;I couldn&#39;t figure out how to grab you a new tongue. I&#39;ll work on that. But do you like the eyes? I think they look good on you.&quot; The question was posed so casually as if she was referring to a pair of earrings or a necklace.</p>\n\n<p>Olivia nodded, a smile gracing her new lips.</p>\n\n<p>&quot;I&#39;m glad.&quot; Eliza took a seat, looking out the window at the bright afternoon sun.</p>\n\n<p>&quot;So, Johnny, what time do you get off?&quot;</p>\n\n<p>&quot;Seven,&quot; I replied.</p>\n\n<p>&quot;Can I hang out with Olivia until then?&quot; she asked.</p>\n\n<p>&quot;Actually, you can make a copy of my house keys, then we can meet up for dinner.&quot; I took my keys from my pocket and pulled my door key and gate key from the ring. I knew my landlord would pitch a fit about me being in violation of my lease, but my new girlfriend could communicate with the dead and grant sight to the blind. I think my landlord would just have to deal with it.</p>\n\n<p>As I placed the keys in Eliza&#39;s hand. She sprang up, cupped my face and kissed me. Her lip gloss tasted like cotton candy. And her eyes; the look in her eyes filled my heart with joy. She was an angel.</p>\n\n<p>&quot;Let me walk you to your car,&quot; I said to her. &quot;Olivia, I&#39;ll be right back.&quot; Olivia didn&#39;t respond, she was too captivated by her new gift of sight.</p>\n\n<p>I walked with Eliza, to the main elevators but as we passed the glass door of the patio my eyes drifted. Dr. Ryan, the woman with the red hair was no longer smoking a cigarette, she was slumped on the ground, her body twitching. The medical professional in me wanted to check on her.</p>\n\n<p>Eliza gripped my hand. She placed a finger to her lip to say &quot;Shh,&quot; as she walked me to the window. With our backs pressed against the wall, we peered around the corner. I could clearly see the woman&#39;s face was covered in large amounts of blood. I was horrified but Eliza was giggling. &quot;Be careful who you call ugly,&quot; she said like a typical eighteen-year-old. She was ecstatic and proud.</p>\n\n<p>&quot;What have you done?&quot;</p>\n\n<p>&quot;What? Dr. Ryan was a conceited bitch, people like her don&#39;t deserve beauty.&quot;</p>\n\n<p>&quot;You sound like your father.&quot;</p>\n\n<p>&quot;No, I don&#39;t. He took beauty from-&quot;</p>\n\n<p>&quot;Your father took beauty from people who HE considered unworthy.&quot; I turned to walk towards the elevator. &quot;The only difference between you and him is that your father created that underground caterpillar thing.&quot; I didn&#39;t even know if that was true. Did Eliza inherit her father&#39;s kingdom?</p>\n\n<p>Eliza followed me, arms crossed. &quot;I&#39;m sorry. I just wanted to help Olivia. Plus, she wasn&#39;t exactly human.&quot;</p>\n\n<p>&quot;What?&quot;</p>\n\n<p>Eliza flashed her wrist. There was a tattoo of a letter, an &#39;A&#39;.&quot;We all have letters, she had one too.&quot;</p>\n\n<p>&quot;Who is &#39;we&#39;?&quot;</p>\n\n<p>&quot;The beautiful ones, the people like me. I&#39;m not proud of what I am, I just hope you can see past my ugliness​.&quot;</p>\n\n<p>I knew she was telling the truth. &quot;I&#39;m sorry I compared you to your father.&quot;</p>\n\n<p>Eliza held my hand, leaning her head on my shoulder. &quot;It&#39;s okay.&quot;</p>\n\n<p>To say I was not afraid would be a lie. Loving her would be like loving a live grenade. &quot;Why a letter &#39;A&#39;?&quot;</p>\n\n<p>&quot;My new name: Azzy.&quot;</p>\n\n<p>Now I was the one smiling.</p>\n</div>\n","author":"dourdan"}