{"rank":"22","title":"The Journal of Dr. Richard Cantby","id":"8k8jb7","url":"/r/nosleep/comments/8k8jb7/the_journal_of_dr_richard_cantby/","time":"1526597804000","body":"<div class=\"md\"><p>Hello Reddit,</p>\n\n<p>My name is Dr. Elaine Newton, and I teach Classics and Art History at Southerton University. I have decided to share the following diary excerpts with you for two reasons. The first is that Dr. Richard Cantby was--is--a good friend of mine, and I seem to be the only one willing to uncover the truth behind his sudden disappearance. Secondly, and perhaps more selfishly, I can’t ignore my own intuition that what lies in these pages may completely change the way in which we historians, philosophers, and archaeologists think of and study ancient cultures and societies. I know that people of all stripes use this website, and perhaps some of you may provide additional insight into what is written.</p>\n\n<p>Some background: Richard is a well-known professor of archaeology at Southerton, and he specializes in deciphering the ancient runes and inscriptions scattered around Cretan ruins. He and several graduate students--all of whom now are either unreachable or have dropped their courses of study with no explanation--were in Crete two weeks ago, on an archaeological expedition of a recently unearthed site. A week and a half into the project, he vanished with no explanation and the university immediately canceled the trip.</p>\n\n<p>The president of the university, as well as my dean and several others who hold positions of power in the department have forbidden us to talk to the press. In fact we are not to speak even with each other about Richard’s potential whereabouts, nor entertain the many rumors surrounding his unexplained disappearance. They have told us that non-compliance with these directives will result in immediate termination from any and all academic responsibilities. Richard has, according to official reports, decided to take early retirement due to personal reasons and that is the end of the matter. </p>\n\n<p>His diary was immediately confiscated by the administration and handed over to the president. The story of how I managed to acquire and transcribe it is tedious and unimportant. All that matters is that the original copy is back in the president’s office and the digital one is now being read by you. I have copied exactly what was written, including the misspellings and idiosyncrasies in later entries. At one point, Richard included drawings of the Cretan hieroglyphs he came across--I have digitized these and linked to them separately, and I believe they may provide valuable insights to the rest of the text. I have also taken the liberty of including chronologically the private correspondence between Richard and myself.<br/>\n~~~</p>\n\n<p><strong>Journal: May 2</strong></p>\n\n<p>Arrived in Crete a few hours ago. We were greeted by those famed white-sand beaches and an azure sea tossed gently by a pleasant breeze. And also by Nikos, the nervous-seeming head of the local team. He met us at the airport and I called him George, as that’s who I’ve been communicating with all this time. He corrected me humorlessly. “George had a sad family misfortune and has had to leave,” he explained in careful, lugubrious English. I’ll bet that “sad family misfortune” had more to do with a pay dispute as with anything else, but I’m not one to judge. After all, the grad students don’t yet know that their stipend has been drastically reduced b/c of budget cuts, and I sure as hell don’t want to be the one to tell them.  </p>\n\n<p>There’s already been some very preliminary work done on Site A, no way to see yet how extensive it is. The four of us have been put up in a tiny sort of bed and breakfast about five minutes away from the site. Lovely view, terrible food, non-existent service. Oh well, at least the beds are comfortable enough. We start work tomorrow.</p>\n\n<hr/>\n\n<p><strong>Journal: May 3</strong></p>\n\n<p>We spent the entire day at the site; I’m writing this late in the evening. Yesterday’s mild weather had been replaced by an almost unbearable heat that seemed to ooze out of the sand and stone around us. Strange, as the sky was overcast and the sun didn’t come out at all. It seems that Abby, Brandon and Jason aren’t much use when it comes to practical, hands-on work because two hours in Jason was stumbling around complaining of a headache and Abby was taking breaks every thirty minutes because of “heat-stroke.” Who knows. Whatever it was, it meant that Brandon and I were the only ones putting in honest work, because Nikos and his band of merry men sure as hell weren’t. I’m getting sick of the way he looks steadily at me with those beady, watchful eyes, and of the way he and his men murmur to each other constantly in Cretan, then stop as soon as I get within earshot. As if I understand a word they say, or would want to. </p>\n\n<p>First impressions of Site A: It is a narrow, rectangular slab, about four feet wide and six feet long, but it’s clear that there’s much more below to unearth. I’m hoping for artifacts. Inscriptions along the edges are clearly Linear A, which means the site dates from the Middle Minoan period. My on-the-spot analysis suggests that we’re looking at a storage container or cellar, something that was used to keep rare and precious valuables for gods and kings (one and the same according to the ancient Cretans). I’ll start working on a more complete translation later. A few of the glyphs are somewhat damaged in what looks like a deliberate way. </p>\n\n<hr/>\n\n<p><strong>Postcard: May 3</strong></p>\n\n<p>Dear Ellie,</p>\n\n<p>Picture on the card is of Knossos Palace, home of good old King Minos (allegedly). Haven’t had time yet to take the tour, but I’d like to, if only for that air-conditioned coach ride they’ve promised on their website! Very hot here, almost makes me miss our lovely New England drizzle. Almost. </p>\n\n<p>Work is steady but slow with yours truly doing most of the digging--turns out grad students aren’t good for much. Our local guy and his team prefer sipping cool drinks and shouting encouragement to actually putting in labor. Guess I can’t complain about the upper body workout!</p>\n\n<p>Crete is beautiful, you and Clark should think about vacationing here for your 20th. </p>\n\n<p>Love,</p>\n\n<p>Rick</p>\n\n<hr/>\n\n<p><strong>Journal: May 4</strong></p>\n\n<p>Big breakthrough: the site extends much more than I initially expected. Way too deep to be a storage container. Whatever this is looks to be at least 8 feet deep and quite possibly more. </p>\n\n<p>Jason is sick and claims he can’t leave his room.</p>\n\n<p>Later in the night: I took a break from digging and left the site early. This is of course impossible, but it seems like the heat is increasing the further down I get. Don’t want to overwork myself, as the grad students are dropping like flies and Nikos is useless. He&#39;s been telling me that he has a &quot;bad feeling&quot; about the whole thing and that I should investigate other, more well-known sites. Ridiculous. Instead, I spent the rest of the day and evening trying to make more sense of the glyphs. I couldn’t shake the feeling that something was seriously odd about two of the frequently repeating notations and it was actually Abby, believe it or not, who figured it out. I guess she’s good for something after all. Can’t believe I missed it though.</p>\n\n<p>The glyphs weren’t damaged but they were deliberately altered. Whoever carved them added a predicate stroke which drastically changes their original meaning. </p>\n\n<p><a href=\"https://imgur.com/a/6BoGaVB\">Side by side comparison</a></p>\n\n<p>The originals refer to “a god” and “power”, and when put together would signify the will or action of a god. However, Abby pointed out that the little slash denotes a movement, specifically one from within (she remembered it from that ancient Minoan text about the rivers flowing towards the sea). So “god” now becomes “a god moving from within” and “power” becomes “the power moving from within.” No idea what they signify together--I’ve never seen such notation before. </p>\n\n<hr/>\n\n<p><strong>Journal: May 7</strong></p>\n\n<p>Took it easy over the weekend but do not feel rested. Restless, rather. Also royally pissed off, because we arrived at Site A this morning to find that rubble had been kicked over part of our work. Questioned Nikos and his crew and received stony stares in response. I’m starting to think  they are not actually archaeologists as they claim. This afternoon Abby told me that Nikos has been telling her and the others to “get out while they still can,” whatever that means. </p>\n\n<p>All I want to do is go into the hot darkness and rest. It will come if I just rest.</p>\n\n<hr/>\n\n<p><strong>Postcard: May 7</strong></p>\n\n<p>Dear Ellie,</p>\n\n<p>Hot and tired. Brutal work digging all day in the heat. </p>\n\n<p>All my love to you, Clark and the girls.</p>\n\n<p>Rick</p>\n\n<hr/>\n\n<p><strong>Journal: May 8</strong></p>\n\n<p>Started work before the sun rose today, unprofessional I know but I can’t bear the heat. Didn’t matter in the end as the ancient stones pulsed with an unearthly warmth. This site is much deeper than 8 feet. Definitely not a storage container and not a burial chamber either, or if it is a highly non-traditional one. What I initially thought to be a lid was instead the “ceiling” to a small room, four by six and five feet tall. Large windows in the walls allow one to actually enter the space. The “floor” of that room serves as the ceiling of the one below it, and so on. So far I’ve unearthed five rooms. They are not tall enough to stand up in, but I imagine they would be quite comfortable to curl up in and drift away into the heat and the darkness behind my eyes. (Why the hell would I do that?)</p>\n\n<p>Along the perimeter of each floor and ceiling is the same “god moving from within who carries power from within” inscription, repeated over and over again and interspersed with more mundane Linear A. </p>\n\n<p>It reminds me of a skyscraper build the wrong way, into the earth. Made one very strange discovery and I hope my eyes are deceiving me: on some of the lower “floors” I’ve been coming across what looks suspiciously like Linear B. Which makes no sense, as that writing system proceeds Linear A by over 1,000 years. How then can it be built into the foundations upon which rest inscriptions in a much older language?</p>\n\n<hr/>\n\n<p><strong>Journal: May 9</strong></p>\n\n<p>I woke up in the night because someone called my name, though I heard no voice. It was like someone yanked on a string tied to my guts. I don’t remember my journey to the ruins but suddenly I was there, digging with my hands in the sandy earth like a dog after a bone. </p>\n\n<p>The hotter it got the closer I knew I was. The glyphs were pulsing and crawling on the walls and I started laughing because it hurt so much I could do nothing else. Shards of rock and broken pottery worked their way under my nails and as I scratched desperately at the ground, my fingernails began to split and curl upwards like plates of dry earth, revealing the oozing red soil beneath. I needed to get even closer and my skin was in the way, so I grabbed my nail and peeled it slowly up and away. Across the back of my hand and twining around my wrist, the bloody skin sloughed off like an old snakeskin. My head was pounding pounding and the voice told me that soon I would know all.</p>\n\n<p>I woke up for real in sheets made translucent by sweat to a frantic knocking at the door. It was Nikos, his careful English shattered by nerves so that he was barely understandable. Finally I made out that one of his men had fallen into the site and I needed to come quick. We ran there together and found the ambulance had already arrived, with Nikos&#39;s men gathered around it in a frantic knot. </p>\n\n<p>The man in question was being loaded into the ambulance, blank eyes staring up at the stars and lips moving silently. He had been found lying twisted and insensible at the bottom of the site, screaming about gods and evil and other such nonsense. I asked what he had been thinking, traipsing around a giant hole in the ground late at night, and one of the young men stormed up as if to hit me. Nikos and the paramedics held him back. “He try to fix!” he screamed at me. “You dead man, now everyone dead!”</p>\n\n<p>Nikos gave me that steady look again except now there was resignation in it. “I have already warned your students that this place is not good, and I try to warn you too but you do not listen,” he said sadly. “I and my men will now be leaving you, and may God protect you.”</p>\n\n<p>Nikos and his crew quit that night. Jason is still sick in his room and I just received a terse email from Brandon, informing me that due to unforeseen circumstances, he has decided to take the soonest flight back to the US. It’s only me and Abby now.</p>\n\n<hr/>\n\n<p><strong>Journal: May 10</strong> </p>\n\n<p>Today Abby and I are working steadily, going deeper and deeper. She is more tireless than I am though I see she is in great discomfort, breathing heavily and often pausing to retch off to the side. She refuses to take any water.</p>\n\n<p>The farther down we go the newer and more geographically separate it all gets. We’ve passed what I recognize as Late Period Egyptian hieroglyphics, Shang Dynasty ideographs, Phoenician letters, then Etruscan and then classical Roman script. This I can read with ease:  </p>\n\n<p><em>Deus est in tibi et ipse est in omnibus. Hic clavem, laudas illum.</em><br/>\nThe god is in you as he is in all of us. Here is the key, now praise him!</p>\n\n<p>All surrounded by those two familiar, wonderful glyphs. </p>\n\n<p>...</p>\n\n<p>Sometime after noon: Abby can barely talk because her tongue is coated with something white and slimy. She can only whisper and point. “Look.” It’s been a while since I cracked open Beowulf, but there’s no mistaking the curved, delicate script of Old English. Abby laughs and laughs. </p>\n\n<p>...</p>\n\n<p>I was never descending; all this time I’ve been climbing up! How could I have been so stupid? Poor Abby, she would’ve liked the view. She fell down some time ago. I’ve passed inscriptions in Middle English, Middle French, 16th century Japanese, modern Cyrillic. Modern English. They all speak of the power that lies within all of us, that has always been there but tamped down by custom and culture and the flimsy constraints of human law. But now that the key has been found, the old order is meaningless and falls away like dead leaves. Vanquished by The God Within who lives in all of us and is stirred into wakefulness by a silent, unspeakable word.</p>\n\n<p>...</p>\n\n<p>Oh god, this heat! I can’t stand it, it’s driving me insane. I’ve lost hours down here. Have to get back to the hostel, drink something. Should go to hospital, I feel very ill. I don’t know where Abby went.</p>\n\n<p>I’m hungry.</p>\n\n<hr/>\n\n<p><strong>Journal: May 11</strong></p>\n\n<p>Richard Cantby. Richardcantby richardcantby richard. cantby. Rick. Doesn’t exist anymore. The man richard cantby begged and cried when the students blood spurted and then trickled over the bed sheets and down my throat. The boy was sick and would not rise again but he did provide me with sustenance, as did the girl before. </p>\n\n<p>I must go back. Knowledge lives in the dark and i am the dark and will spread my hard earned knowledge to all the ignorant people of the earth. Soon they will all know the god within and the god within will reign once more over the dark waters, all the world shall be heat and shall resound with the only true language.</p>\n\n<p><strong>[There are no more legible words. On the remaining pages, Richard has repeatedly scrawled the two previously mentioned hieroglyphs.]</strong></p>\n\n<hr/>\n\n<p><strong>Email exchange: May 11</strong></p>\n\n<p><strong>Subject: hello</strong> <em>From:</em> rcantby@[].edu <em>To:</em> enewton@[].edu <em>Date:</em> 05/11/18</p>\n\n<p>Hello El,</p>\n\n<p>How are you? Tell me what’s new at southampton &amp; with you. I miss u very much.</p>\n\n<p>Rick</p>\n\n<p><strong>Re: hello</strong> <em>From:</em> enewton@[].edu <em>To:</em> rcantby@[].edu <em>Date:</em> 05/11/18</p>\n\n<p>Hi Rick! </p>\n\n<p>Great to hear from you! I thought you would have been too busy to write. What time is it there anyway, 3 in the morning? I’ve hung your postcards next to my computer--those gorgeous Cretan beaches and palaces help me keep my cool when responding to the latest bullshit from our lovely dean. </p>\n\n<p>Sorry to hear about the students not pulling their weight. I know it’s frowned upon to say it, but I really do believe that millenials just don’t have the same work ethic that we did back then.  </p>\n\n<p>Same old end-of-semester doldrums here--students are more concerned with graduation shenanigans than with their finals and the Weather Gods haven’t yet twigged that we’re in May now. Maybe they should amend the old saying: “May showers bring June flowers!”</p>\n\n<p>I miss you too. When you get back to campus you owe me a beer, remember? :)</p>\n\n<p>Love,</p>\n\n<p>Ellie</p>\n\n<p><strong>Re: hello</strong> <em>From:</em> rcantby@[].edu <em>To:</em> enewton@[].edu <em>Date:</em> 05/11/18</p>\n\n<p>When i get back to campus. Haha. i cant even picture my return. Seems so far away now, like my whole life belongs to someone else. Some lucky bastard who never heard of this place. I have to go soon back into the dark &amp; heat but i wanted u to know that ive always valued ur friendship and hope u can remember me as i was and not as i have become</p>\n\n<p>~~~</p>\n\n<p>That was the final email I received from Richard. I immediately wrote back, attempting to reassure him and find out why he needed to go back “into the dark and heat,” but of course heard nothing back. I can only assume he disappeared shortly afterwards. I also notified the dean and the head of the archaeology department of my concerns about Richard’s physical and emotional well-being. I’ve received only terse, meaningless messages in response, warning me about meddling in things that don’t concern me. They are trying to hide and erase valuable research, research that I am sure provides the key to finding Richard and whatever he has done.</p>\n\n<p>I’ve been poring over the hieroglyphs he reproduced in the pages of his journal, even though I know next to nothing about Cretan iconography and cannot decipher them the way Richard did. The “god within” symbol is especially compelling, it almost shimmers on the page. I feel as though I am very close now to understanding what it truly means, beyond the flimsy bonds of human language. It’s a knowledge I’ve always had, deep in the recesses of my mind, and now its creepy to the surface, called forth by an unspoken command. My head pounds and pounds with this ancient knowledge and a fever sweeps through my body like boiling rain.</p>\n\n<p>It’s very hot now and getting darker, the black lines on the page loom closer until they are all i see and all i know. The heat &amp; the dark</p>\n\n<hr/>\n\n<p><a href=\"https://www.facebook.com/LindenWriter/\">x</a></p>\n</div>\n","author":"stange_loops"}