{"rank":"120","title":"Daniel's Game Show","id":"8k8jw4","url":"/r/nosleep/comments/8k8jw4/daniels_game_show/","time":"1526597968000","body":"<div class=\"md\"><p>Howdy, folks! I’m Daniel and I’ll be your host this evening for the premiere of what is sure to become the greatest game show on this planet!</p>\n\n<p>I&#39;ve thought long and hard about what I can do to make this first episode extra special, and then it struck me - do it LIVE! Everyone knows that a game show is only as good as the audience it attracts, so I invite you fine viewers to this exclusive live premiere!</p>\n\n<p>Before we start, let’s go over some basic rules for our contestants.</p>\n\n<p><em>1. Complete the provided task(s) under the provided condition(s).</em></p>\n\n<p><em>2. Just have fun out there!</em></p>\n\n<p>That&#39;s it! Very easy to follow rules, if you ask me. It helps to have them in writing just for transparency sake.</p>\n\n<p>And of course we wouldn’t want anyone cheating, now would we?</p>\n\n<p>Speaking of cheating. Why don’t we just bring out our first contestant and get this ball rolling? </p>\n\n<p>Ethan! Come on out, buddy! </p>\n\n<p>Oh right, you can’t. Ugh. Just bear with me a moment please, folks! Technical difficulties!</p>\n\n<p><strong>BE RIGHT BACK</strong></p>\n\n<p>Whew! Sorry about that, ladies and gents, working on a tight budget here so I don’t exactly have an assistant and our first contestant is quite the heavy little piggy. The stupid dining room chairs that my mom loves so much also weigh a ton. We’ll work on better props for next episode.</p>\n\n<p>Wow, look at me, working up a sweat already and we’ve only just begun!</p>\n\n<p>Ethan. Oh, Ethan. Where to begin? This challenge should be a breeze for you! After all, you did ace that biology exam, right?</p>\n\n<p>Ew, did you just piss yourself? Have some decency, we’re live here! Really unprofessional, dude.</p>\n\n<p>I&#39;m so glad you were able to find so much joy in convincing everyone that it was me who cheated on the exam. I must say that your stories were truly heartfelt. You really had me going when you took the seat next to me, telling me all about how nervous you were before it started. How angry your parents were going to be if you didn’t pass. </p>\n\n<p>Tell me, Ethan, were your parents really going to hurt you for failing? Mine did. I bet the look on my face when I had to tell my father that I received a ZERO for CHEATING was similar to the look on your face right now, Ethan. Ironic, isn’t it? </p>\n\n<p>As much as I&#39;d love to make this about me, perhaps even show you the scars from that night, these fine people came to witness a show!</p>\n\n<p>Ahem. Well, if you’re just going to sit here whining and crying, we may as well just get this game underway! </p>\n\n<p>I really should’ve had a nice jingle or some wacky sound effects cued up for this part but you live and learn, I guess.</p>\n\n<p>Without further ado, for tonight&#39;s challenge, Ethan will be racing the clock in this first round of <em>Cheater, Cheater, Pumpkin Eater</em>!</p>\n\n<p>This mini game combines two of Ethan&#39;s favorite pastimes! Biology tests and stuffing his round pudgy face with garbage! With five minutes on the clock, our contestant must correctly answer ten multiple choice biology questions. This should be a cake walk for Ethan, considering the questions have been pulled directly from the test that he aced last year completely on his own without cheating! </p>\n\n<p>Oh wait, did someone say CAKE?? I almost forgot! Since the big guy here just can’t seem to get enough sweets, I’ve decided to sweeten up the game for him! We wouldn’t want our first contestant to feel uncomfortable, would we?</p>\n\n<p>I’ve baked up a super special cake just for this occasion. (Okay, maybe I just bought a random cake from the grocery store. I’m a game show host, not a baker.) What I did do, though, was add a few extra special ingredients that I know Mr. Sweet Tooth here is going to LOVE.</p>\n\n<p>On the table in front of him lies three slices of cake. Our contestant must also consume the entirety of all three slices in addition to the passing the biology test. I thought this might help Ethan relax a bit. Comfort food, or whatever it’s called.</p>\n\n<p>Alright, folks, buckle up because it’s time to get started! </p>\n\n<p>Contestant Ethan, are you ready? Once I remove the towel from your mouth, the timer will start.</p>\n\n<p>And we’re off!</p>\n\n<p><strong>4:53</strong></p>\n\n<p>Contestant Ethan does not seem to be making any attempt to begin either of his tasks. Attempts to motivate him are proving inefficient.</p>\n\n<p><strong>4:32</strong></p>\n\n<p>Contestant Ethan has decided to waste his first thirty seconds crying and yelling. Bold strategy, but let’s see where he’s takes it!</p>\n\n<p><strong>4:17</strong></p>\n\n<p>Contestant Ethan grabs his first slice of cake, smashing a large handful into his mouth. It’s like he hasn’t eaten in almost three days!</p>\n\n<p><strong>4:00</strong></p>\n\n<p>Contestant Ethan has nearly finished the first slice of cake and has now picked up the pencil and began scanning the exam questions. Though I must say, he appears to be wearing more of the cake than he’s eating. Tsk tsk tsk.</p>\n\n<p><strong>3:24</strong></p>\n\n<p>I think my last update had him panicking a bit. Contestant Ethan now appears to be collecting the cake crumbs and leftover icing from around the pubic hair on his chin and upper lip that he calls a beard. I do see a large a chunk sliding down his left breast. He better catch that before the judges do! He has completed only two of the exam questions so far, can he finish in time?</p>\n\n<p><strong>3:00</strong></p>\n\n<p>Contestant Ethan seems to be significantly slowing down now. He’s been staring at the exam for a solid twenty seconds without answering a question or starting on the second piece of cake. Maybe he’s doing some critical thinking. Or maybe he’s starting to feel the high doses of LSD I put in that first cake slice. Only time will tell!</p>\n\n<p><strong>2:16</strong></p>\n\n<p>Three more questions down! Ladies and gents, he’s nearly halfway there! On to the home stretch! Everyone is rooting for you, big guy! Those cake slices aren’t going to eat themselves.</p>\n\n<p><strong>1:42</strong></p>\n\n<p>Oh my, folks, we’ve got a bleeder!! Is that.. No.. Did someone really fill that slice of cake with small thumb tacks and razor blades? Yes, someone did. Tough break but rules are rules, Ethan boy. Eat up! Chew it up nice and good. Don’t forget about the complimentary diet coke!</p>\n\n<p><strong>1:00</strong></p>\n\n<p>Time is running out. Only a minute left and our contestant has decided to waste even more time with his crying and begging. It’s almost as if he is just incapable of LEARNING A FUCKING LESSON.</p>\n\n<p>Sorry folks, I let myself get a little carried away there. After all, this is family entertainment.</p>\n\n<p><strong>0:35</strong></p>\n\n<p>Ethan has completed the exam portion of this challenge. After the one minute mark, a rather loud and urgent alarm beeps louder as each second passes. I knew this would help put a little sense of urgency into the game and it worked like a charm!</p>\n\n<p>He still has one slice of cake left. The look on his face is priceless as he examines the last piece. He knows something is terribly wrong with it, I can see it in his eyes.</p>\n\n<p>For the sake of transparency, the third piece of cake is just a regular piece of cake. </p>\n\n<p>Can he do it?</p>\n\n<p><strong>0:10</strong></p>\n\n<p>He’s nearly done the last piece! Wow, this is really cutting it close! He is still being cautious about the normal piece of cake, even with just a few bites left!</p>\n\n<p><strong>0:00</strong></p>\n\n<p>Time’s up! What a shame, only a few bites away from finishing that last piece. I must say I am quite impressed with this first showing. You really set the bar high on this one, Ethan!</p>\n\n<p>Even with his impressive performance, Contestant Ethan has lost the challenge. </p>\n\n<p>Not only did he fail to finish the last of the cake but he also failed to swallow the remaining thumb tacks and razor blades. The tricky little piggy tried to hide them in his big ol’ cheeks, how cute. Oh, and he only answered ONE of the ten biology questions correctly.</p>\n\n<p>Well, I must admit I really expected Ethan to crush this challenge out of the park. Cake and biology tests, I couldn’t have made this any easier for him!</p>\n\n<p>I almost feel bad. He was so close to surviving this and walking away with an incredible prize.</p>\n\n<p>That about wraps up this episode, folks. Keep your eyes peeled for the next episode, featuring James, the dashing young athlete that was able to convince everyone in school that my mother is a prostitute! We’ll have a super special guest joining him, you won’t want to miss it!</p>\n\n<p>Your loving host, </p>\n\n<p>Daniel</p>\n</div>\n","author":"thirtysixCF"}