{"rank":"0","title":"Hail To The Gods","id":"8k8ks0","url":"/r/nosleep/comments/8k8ks0/hail_to_the_gods/","time":"1526598181000","body":"<div class=\"md\"><p>They&#39;re real.</p>\n\n<p>The gods are real.</p>\n\n<p>They showed themselves to me and I...I was trapped by their magnificence. Radiant and flowing with light did they wander within my very halls. I have made every effort to preserve their footprints, immaculate and prestigious. Where their touch fell their holiness lingers.</p>\n\n<p>Oh, how I tremble to even think of their beauty and grace as they traced their hands on my face. I gazed into eyes beyond compare, eyes filled with power and pure wisdom, and wish to do so again. For these gods...they have shown me the way. Truth shall be made clear to all of you in time. Such power within their flesh, power to dwarf the combined might of every nation on earth.</p>\n\n<p>And yet...their rage. I bathed in rage unlike anything I have ever beheld before. No emotions we could humans could ever produce can amount to </p>\n\n<p>Worship. They require worship. They demand it from us meager, filthy, insignificant humans, and what have we given them? Nothing. Not even offerings of bread and milk.</p>\n\n<p>And so I shall rectify this. Yes, yes, I am their most devoted follower of the mighty gods. The truth always triumphs, and so shall it do so here.</p>\n\n<p>For centuries we humans have ignored them. We have always worshipped the false, the unworthy, the vain, profane deities that dominate this earth. Since the days of Rome, we have dwelt in the shadow not of the gods but of the miniscule slugs and degenerative microbes which came from the primordial soup. No more...</p>\n\n<p>I have seen the way to glory. The way to power. Yes, she showed it to me. Ah, how her lips made me tremble as my soul gave itself to her seduction. A goddess so persists among us as to shine in the darkest of places. She who emerged from beyond the stars and saw with contempt how we worshipped the false deities. Aphrodite, Ishtar, Freya, Persephone, Sedna, Guanyin, Isis, that accursed Virgin Mary, Pele, whatever those defective Japanese worship, oh, they are nothing next to her! She is beauty! And grace! And love! The most beautiful love of all!</p>\n\n<p>The love of children, oh, such beautiful love...she showed to me as well.</p>\n\n<p>How...succulent children can be. Their screams are easily silenced, their flesh tender and easy to make ready. It was hard hunting, yet children are oh so trusting parasites. Easily swayed, suspicious for the briefest moments as they are drawn into a web from which none have escaped. I have seen to that most assuredly. Oh bothersome it is finding a proper storage for the remaining meat, but it is indeed worth it! Ah how delightful their young flesh is, marinated in a soft mixture of red wine and vinegar. The fear...in their soft eyes...oh...<em>oh</em>...</p>\n\n<p>I am thankful he showed me how war is raged. He who stands above Yahweh, Zeus, Odin, Maui, Rama and Vishnu, beyond that Great Spirit those <em>redskins</em> worship, lighter than the nigger god Baron Samedi, ha! Oh, he is death incarnate, triumphant over all! Long may he reign! From beyond the stars he came with with his bride to show me the way! He with no equal! He would showed me the wonders of pain inflicted on another creature. How it feels as someone&#39;s life force is stripped from them. Ah, how I enjoyed listening to the screams of the weak silenced as they skulls broke open. The goddess was pleased with my offerings as was her husband.</p>\n\n<p>I have done as they have instructed so very carefully and now...it is time. A town lies empty and alone, depopulated through my efforts, my power. They screamed and begged and pleaded for their worthless lives. And I...I made them watch. The god stood beside me, smiling as I made a nigger crush his own son&#39;s windpipe. One less genetic flaw to again this earth.</p>\n\n<p>And then...oh, then...well, no man could have ever wanted to do what they did to those women. You can guess, can&#39;t you? It is easy to do so. They screamed and begged and pleaded, the filth and dregs of mankind, but they were meaningless before the power the gods had given me. My gods.</p>\n\n<p>They showed me the way, and I used to make the people who had shunned and looked down upon me, welcoming those disgusting niggers and redskins and Japs, the chinks and kikes and faggots, letting them walk without fear in the sunlight. How dare they?! <em>HOW DARE THEY?!</em></p>\n\n<p>Their end...was merciless. I made them suffer far worse than any I had endured, as they richly deserved.</p>\n\n<p>The gods...they sensed my hate. Yes. I know they did. I am their instrument to conduct a ceremony of death upon this world. Ruins shall be left of mankind&#39;s accomplishments when I am finished! Sacrificed to the gods will their children die screaming! Blinded and deaf will I render them all, cutting out their tongues so they cannot even scream!</p>\n\n<p>So hail to them.</p>\n\n<p>Hail...to the Gods!</p>\n\n<p>Hail...to me.</p>\n\n<p>And you, dear readers of nosleep...you will be first.</p>\n</div>\n","author":"SpaceGeneralAmerica"}