{"rank":"13","title":"Red Eyes","id":"8k8k55","url":"/r/nosleep/comments/8k8k55/red_eyes/","time":"1526598030000","body":"<div class=\"md\"><p><a href=\"https://www.reddit.com/r/nosleep/comments/8khvnn/sarah/\" rel=\"nofollow\">Part2</a></p>\n\n<p>You ever feel like you&#39;re being watched? Like some part of you can just tell and the hairs on the back of your neck prickle</p>\n\n<p>When I was about 10 or 11, I had just moved in with my mother; I couldn&#39;t live with my dad anymore because he was moving to England and I didn&#39;t want to leave my home.\nBut anyway, things were okay. I made friends and they were pretty cool. Being a little kid, you have a wide and sometimes strange imagination.<br/>\nMe and my friends enjoyed playing hide and seek in the woods near my house.<br/>\nOur woods were different. We had two. The first set of woods were totally safe apart from a very obvious ditch leading through the whole thing but, the second set of woods we were banned from. \n&quot;You are NOT allowed in there&quot; our parents would always tell us. They would never tell us why, they would always just insist that we weren&#39;t allowed there.\nI had heard my big brother talk about the woods with his friends once but, I couldn&#39;t remember what he said.<br/>\nBut of course as all kids are, we were curious and wondered \n&quot;What’s so bad about those woods?”\nWell of course one day, curiosity got the better of us and we decided we would all go. 4 of my friends and I:\nTom, Sarah, Katie, Daniel and Michael. (Names changed for obvious reasons) Strength in numbers, right? That was the plan anyway until Michael cancelled. He was the kind of kid that couldn&#39;t keep a secret. So when he let it slip that we were planning to go to the woods, he was grounded indefinitely; it was just us 5.  </p>\n\n<p>We planned it all.\nWe would wait until Sarah&#39;s birthday party as Sarah&#39;s mum had asked her what she wanted to do for her special day.<br/>\nFollowing our plan, she said &quot;can we camp in the garden&quot;<br/>\nWe were smart kids. \n&quot;Of course you can, but we are keeping the back door unlocked in case you need to use the bathroom&quot; her mum said although slightly confused as to why her girly daughter wanted to camp but allowed it all the same. \nAnd that was that.<br/>\nThe following weekend we had all gathered at Sarah&#39;s. We enjoyed her party,cake and of course she enjoyed her presents but we all knew the thing we looked forward to most was yet to come.</p>\n\n<p>It started to get dark and we finally got our tents up. </p>\n\n<p>The night began. </p>\n\n<p>We took out our flashlights and quickly but quietly snuck out of the garden. Of course we made sure to check all the lights were off. And they were, except for the hallway so we could see should we need to go into the house.</p>\n\n<p>And off we went. Getting through the first set of woods was easy. We knew every part of it. We knew which trees were the best for climbing, easiest to hardest, the most fun and the most dull.\nWe knew where we wanted to put a tree house if we were ever allowed and we’d played hide and seek so much that we didn&#39;t have any new places to explore, all the more reason why we were excited at the prospect of a new place to play.\nThen finally after 20 minutes of walking, giggling and trying to scare each other all the way, we arrived. \nDaniel Stopped, Making us all bump into each other and sarah almost fell into the ditch.<br/>\n&quot;Here it is&quot; he said, his voice shaking slightly.\nI wasn&#39;t sure if he was cold or scared but, the moonlight hit the trees in a way that made shadows on the ground that were slightly unsettling.<br/>\nWe argued about who would go first as no one wanted to be the first over the threshold.<br/>\nIn end, it was me.<br/>\nWell, I showed no fear and strutted into those woods not yet knowing it would be a mistake.\nThe second I entered those woods, everything felt… wrong. \nI couldn&#39;t explain why or how but I felt like I was being watched. But isnt that how you always feel if you&#39;re unsure or unsettled? I shrugged it off as my friends continued behind me, after all I didn&#39;t want them to think I was a coward. All of us laughed about how big a deal had been made for some silly woods. &quot;It&#39;s the same as the rest of the place&quot; Tom said, clearly annoyed about being out in the woods for nothing when he could be playing on his playstation.<br/>\nBut, even though I was now behind everyone, I could not shake the feeling of being watched.\nI tried to shrug it off once more but I felt the sudden need to turn around. And when I did, my heart dropped.</p>\n\n<p>For a split second I could have sworn I had seen a pair of glowing red eyes but it happened so quickly and suddenly I wondered if my eyes were playing tricks on me.</p>\n\n<p>And in the second it took me to fully scan my surroundings, the eyes were gone.<br/>\n&quot;Hey Mark, you okay?&quot; Katie shouted from a good 20 feet ahead. I must have been stood there for a while because everyone else was well ahead of us.\nWhen I caught up to Katie, she told me everyone was about 5 minutes further in and they had found something. \nShe seemed concerned. Katie was the grown up one out of our friends but never really worried about much. So if she was concerned, I was very concerned. </p>\n\n<p>We got to the area where our friends were gathered with a look of disgust on their faces. \n&quot;What do you think it is?&quot; Tom asked\n&quot;I don&#39;t know but it&#39;s gross and it smells horrible&quot; Sarah said wrinkling her nose.<br/>\n&quot;Look at its eyes and mouth&quot; Dan laughed as he poked whatever it was they were looking at with a stick which only made Sarah reel back with disgust more.</p>\n\n<p>As we got closer, we saw what they were looking at.<br/>\nThe stench was unlike any other, I had been to the dump with my dad and at one point we had lived near a sewage treatment plant so I&#39;ve experienced my fair share of bad smells. \nIt was enough to make me want to throw up. \nBut when I saw what they were looking at, I gasped in shock.<br/>\nThis mangled,half human looking creature was smiling. Like it had died happy, like it had enjoyed death.</p>\n\n<p>I suddenly reconised the eyes.  </p>\n\n<p>The glimpse I had earlier did not do justice to the horror I felt looking down on the same eyes with more time to fully soak in what I was seeing</p>\n\n<p>My head was reeling, if this meant the eyes I had seen earlier weren&#39;t just a figment of my imagination, did that mean this creature wasn&#39;t the only one in here? </p>\n\n<p>Suddenly we could hear branches crashing down all around us\n“Run&quot; Katie hissed and with that we all ran in different directions.\nMy instincts kicked in and I ran towards the exit. \nRunning as fast as my legs would take me, I saw a tree I could climb fast. I glanced behind me and saw something running towards me on all fours. Clearly not human, it ran like some sort of contorted dog. Its limbs bent in odd ways that sickened me to think about.\nI scrambled up the tree hoping it wouldn&#39;t see me and would keep running.<br/>\nIt got to the base of the tree and stood up on two legs(?). It looked around, confused almost.<br/>\nI held my hand to my mouth and prayed it would prevent that thing from hearing me breathe. Every bone in my body begged me to scream for help. But I knew, I knew if I screamed, only the creature would hear.</p>\n\n<p>It continued to walk around the area i was in. It seemed to get more and more agitated by the second. Like it had been cheated out of a meal.\nSarah’s screams could be heard coming from deeper into the woods \nIt screeched as it reared its ugly head, got back down on all fours and ran in that direction.<br/>\nI wished I could help my friends. But if any of those creatures saw me I would be done for.<br/>\nI stayed up there for what felt like hours. It was silent, not even the sounds you would usually hear in the woods: owls, cats, bats or foxes. Nothing could be heard.<br/>\nI was tired, physically emotionally and mentally.\nI saw two figures walking and as they came into focus I realised it was Daniel and Katie. They walked carefully placing their feet one at a time quietly. I climbed down and ran to them which made them jump. Katie despite being rather emotionless normally cried when she saw me.</p>\n\n<p>&quot;Where is Sarah? Tom?&quot; I asked between sobs as I tried to catch my breath.\n&quot;I saw Tom run this way but I couldn&#39;t catch up with him&quot; Katie said. &quot;I&#39;m guessing he just wanted to get out, no sign of Sarah though&quot; </p>\n\n<p>As we walked through the woods to the safety of home, we watched the sun rising. And the feeling of danger left us slowly but surely. We wondered what to tell Sarah&#39;s mum. After her dad died, Sarah was all she had. How can we just tell her that Sarah had gone missing?<br/>\nThese Questions filled our mind until we reached the end where we saw a wonderful sight; </p>\n\n<p>Sarah was stood next to tom, crying about a tear in her shirt. Of course, she was always upset about the little things.<br/>\nWe ran up we all hugged happily crying that we had made it out and walked back to Sarah&#39;s house. \nAs it was still very early, no one was awake yet. But despite that we all decided to go home. \nThings went back to normal. Or so we had thought but we didn’t see Sarah again and started to worry</p>\n\n<p>3 days after we had ran for our lives from those things I heard my mum telling my dad the worst thing I&#39;ve ever heard.  Sarah&#39;s mum had been found dead in her house. Skinned with her eyes ripped out. When he asked about sarah, she told him Sarah was missing.  </p>\n\n<p>Poor Sarah, I thought. \nWho would do that to my friend?\nMy parents tried to tell me that she had moved away but I knew she was missing.</p>\n\n<p>The town we lived in moved on. \nMonths passed by, years even.<br/>\nUntil now anyway. I’m 16 years old, doing well at school and I&#39;m dating Katie.<br/>\nLife is good.  </p>\n\n<p>But last night. I couldnt sleep. I felt. Strange.<br/>\nI felt like, I was being watched.<br/>\nIt took a few moments but I remembered the last time I felt this way \nI stood up, I just had the urge to, like i wasn&#39;t in control anymore, I went to look out the window.  </p>\n\n<p>And there.. Standing at the Edge of the woods.<br/>\nWas Sarah, staring at me.. with very bright. Very wide.</p>\n\n<p>Red. Fucking. Eyes.  </p>\n\n<p>I closed my curtains and I decided to call my brother \nGod knows why he was awake so late. But I asked him about those woods and he told me about the &quot;myth&quot; \n&quot;There&#39;s creatures in the woods, normally they can blend in with the woods. But sometimes they can be seen. When they see their prey. Their eyes will glow a bright red, once they have seen their prey they won&#39;t stop until they get you. And once they do. They take your skin and become you&quot;  </p>\n\n<p>That shit me up. I thanked him and apologised for calling so late. I then hung up before he had a chance to ask me any questions. I looked out my window and &quot;Sarah&quot; was gone. &quot;Thank fuck&quot; I thought to myself.  </p>\n\n<p>Locked the window and my door then went peacefully to sleep.  </p>\n\n<p>I woke up maybe 5 minutes ago. I can smell something horrible. I remember the smell. I&#39;m sat at my computer right now, writing all of this down because I wanted someone to know what had happened.</p>\n\n<p>The scent of those creatures has filled my room and I&#39;ve refused to turn around. I know that I’ll soon be dead, I can see two red lights on my monitor but I know it&#39;s just a reflection of those eyes. I can just make out a figure in the reflection, one that looks a hell of a lot like Sarah. </p>\n</div>\n","author":"UnderTheseEyes95"}