{"rank":"33","title":"Hold on tight because they don't stay this little forever","id":"8k8qyx","url":"/r/nosleep/comments/8k8qyx/hold_on_tight_because_they_dont_stay_this_little/","time":"1526599759000","body":"<div class=\"md\"><p>I&#39;m going to be a father soon. We found out 7 months ago. It&#39;s our first and after much debate, decided to find out the sex of the baby. It&#39;s going to be a boy! I&#39;m super excited. I can&#39;t wait to play army men, cars and catch with him. Don&#39;t get me wrong though, a cute baby girl would be just a good. Having tea parties, daddy/daughter dances and scaring boyfriends away.</p>\n\n<p>Am I nervous, hell yes. We&#39;ve had a puppy for a good while though so I have a small idea of what it&#39;s like to take care of an almost helpless creature. Obviously a child and a puppy are two completely different ball games but for the most part I think I&#39;m ready to tackle the challenge. We&#39;ve got everything we need for when the baby arrives. Now the waiting game ensues.</p>\n\n<p>Two months later our boy was born. 8 pounds, 5 ounces. Big boy. Everything normal, 10 fingers, 10 toes. We named him Michael Louis. Michael after my father and Louis after her grandfather. Wife doing fine, tired but fine. We went home a few days later and I took a week off to help mom and baby get settled in, do chores, run errands, cook and clean. Life was great. Michael was sleeping a good 6 hour stretch at night so my wife was able to quickly bounce back into a fairly normal routine. </p>\n\n<p>As Michael grew bigger, he rolls over and army crawls now. Sits by himself and will hold his bottle with support. I love the expression he makes when he sees the bottle coming his way. Almost like a baby bird, mouth open, head shaking in excitement and arms outstretched.</p>\n\n<p>I take a lot of pictures of Michael, a lot. More than any normal parent. Every day at least half a roll. About the only time I didn&#39;t have a camera nearby was when I was in the bathroom and when I slept. My boy was my everything so I wanted to preserve every possible memory with him. Pictures of him doing everything and anything. It didn&#39;t matter, he was getting his picture taken.</p>\n\n<p>It was about 5 months after he was born when my wife and son were in a car accident. It was a pretty severe head on collision and the car was totaled but cars can be replaced.</p>\n\n<p>Things changed after the that. My wife wasn&#39;t herself at all. I think she felt responsible for the crash although really, there was nothing she could do about it. Michael was different too. Not his fun, goofy little self. He didn&#39;t play like he used to and he was never hungry either it seemed.</p>\n\n<p>After the accident, I figured this would probably be the best time to start getting them printed as I had easily amassed around 50 rolls of film from the first 4 months of his life and needed to start getting them developed. I had labeled each of them so I started at the earliest two rolls. </p>\n\n<p>I dropped them off at the local photo-mart to get them processed. A few days later I went to pick them up and drop of a couple more rolls. I gathered up my stuff and headed out the door. When I got to the store, the clerk had a look of joy on her face.</p>\n\n<p>“Here are your pictures Sir, your son is absolutely adorable. You&#39;re a very lucky dad, he looks just like you.”</p>\n\n<p>“Thank you very much” I replied.</p>\n\n<p>I paid and walked out the door, opened the envelope to look at the pictures.</p>\n\n<p>“What the hell?” This is not what my son looks like at all.</p>\n\n<p>I went back to check with the clerk. I told her that these pictures weren&#39;t of my son and that must&#39;ve given me the wrong envelope. She apologized and took them from me and went to find mine. She came back a few minutes later only to tell me she couldn&#39;t find any more with my name on them. I was livid to say the least and wanted some sort of explanation. She apologized profusely and told me there&#39;d be no charge for the pictures.</p>\n\n<p>I started on my way home, depression setting in about the photos of my son that weren&#39;t of my son. </p>\n\n<p>I figured I&#39;d try another store across town. I drove over and dropped of another roll of film. I then waited the obligatory three days and drove back. I went in to retrieve the fresh prints, tore open the envelope and peered inside.</p>\n\n<p>“Mother fuck! Where&#39;s my son!?”</p>\n\n<p>The clerk looked at me in shock.</p>\n\n<p>“Sir?”</p>\n\n<p>“My son! I dropped off pictures of my son and these aren&#39;t them. I want my fucking pictures!”</p>\n\n<p>“L,let me go get my manager” she gulped.</p>\n\n<p>After going round and round with the manager, I ended up walking out, again, without my pictures. This is the second place I&#39;ve been to that has screwed up my photos and they&#39;re treating me like I&#39;m a fucking nut job.</p>\n\n<p>This is bullshit. How many more times could this happen. I&#39;m wasting time, energy, money and most importantly, memories.</p>\n\n<p>I went home. </p>\n\n<p>I did some research on a home developing kit. It was pricey but well worth a shot. Once it arrived I set up a darkroom in the basement and got started. First roll in and developing. Now to wait.</p>\n\n<p>I pulled the first batch of pictures out of the room. I broke down in tears. Screaming and crumpling the pictures in my hands I trashed the darkroom. Throwing the developer and acid bath to the floor. Ripping the makeshift blanket walls down and smashing the red light.</p>\n\n<p>I ran upstairs to try and calm down. My wife and son weren&#39;t there to comfort me. I stared, glassy eyed at the wall containing already framed photos of my son, wife and myself. </p>\n\n<p>He was just a baby in these pictures. Such a cute little blob of adorable. He was anywhere from newborn to four months here. I hardly remember him this way anymore. He was a perfect mix of my wife and I.</p>\n\n<p>I looked lovingly at my wife&#39;s photos. She fell into such a deep depression after Michael&#39;s death, she&#39;s been pretty much non-existent around the house. I still love her but it&#39;s been hard on the marriage.</p>\n\n<p>It all came crashing down on me.</p>\n\n<p>I missed him so much. After his death I spun out of control. He was my little man, my newest best friend. I wanted to teach him so much about life, about doing things I never did and not doing the stupid shit I did do. I could still smell his hair and his breath from when I held him last.</p>\n\n<p>I walked to his room. This would be only the second time since his death that I&#39;ve opened his bedroom door. It was untouched from that first time. I wanted to, needed to, hold my son again. I shambled over to his crib, took a deep breath and pulled his old scent into my nose. Michael, still in his burial suit, lay there in silence, eyes closed, clutching his blankie. I bent down and scooped him up. A flood of emotions and memories punched me in the chest. </p>\n\n<p>I sat down in his rocking chair, holding him tightly. He&#39;ll be too big to do this soon. How does the saying go? </p>\n\n<p>“Hold on tight because they don&#39;t stay this little forever….”</p>\n</div>\n","author":"RockabillyOx"}