{"rank":"30","title":"The Field Stalker (Michigan)","id":"8k9dth","url":"/r/nosleep/comments/8k9dth/the_field_stalker_michigan/","time":"1526605910000","body":"<div class=\"md\"><p>Field Stalker (Original)--&gt;<a href=\"https://redd.it/8jskr8\">https://redd.it/8jskr8</a></p>\n\n<p>These events happened in the year 2002 in Michigan. I am a bit of a loner and at the time I spent most of my days hunting, fishing or working as a freelance carpenter/handyman for neighboring towns. I lived in a wooden cabin that I built on a small amount of land I owned that sat not too far from Lake Huron. </p>\n\n<p>I always craved isolation and I had the perfect set-up for it. People never bothered me unless they had inquiries about fixing up their house or crafting a piece of furniture. I had everything the way I needed it to be but something decided to post up on my land that would mark the end of my days of solitude.</p>\n\n<p>I remember it being a particularly cold and snowy  December day when I first saw it. Huge powdery flakes floated down on to my roof with light thumps as I sat around my fireplace- warmth coating me while I cooked some rabbit stew.</p>\n\n<p>As i reached into the cauldron to pour some of the stew into my bowl, I heard a loud shriek coming from outside my cabin. It was so loud and abrupt that I dropped the scalding hot bowl onto my legs and the floor. &quot;Shit!&quot; I yelled out as the bowl shattered. </p>\n\n<p>I picked myself up, grabbed my rifle and swung open the door to find whatever it was that screwed up my dinner. The snow was falling heavily as I patrolled around my cabin. My footsteps crunched loudly into the white ground as I searched the surrounding area but I could not seem to locate the source of the sound.</p>\n\n<p>The bitter cold was starting to constrict me as the small amount of adrenaline was beginning to wear off. It must have been at least ten below so  I turned back to my cabin but it was then that I saw what must have made the shriek.</p>\n\n<p>On the opposite side of the cabin I saw an animal laying in the blinding white sheet and I thought it must have been a large raccoon or groundhog. I trudged my way through the snow towards it but as I got closer, I saw that it was something else. </p>\n\n<p>A mostly eaten deer laid on the ground as fresh blood was still seeping out of its shredded stomach and throat. Its legs were gone and pretty much all that remained was a head attached to a mangled torso- fear still present in its glossy eyes.</p>\n\n<p>My mind immediately shifted to &quot;bear&quot;. But even a bear couldn&#39;t have done this much damage so quickly. &quot;Wolves maybe?&quot; It was right then I noticed a set of tracks that lead up to the carcass. Not those of a wolf or a bear.. They looked almost like human tracks. However, one of the recurring prints was noticeably bigger than the other. I stepped back and began to back away from the deer and as I turned my head, I noticed a similar set of tracks through the huge, falling snowflakes that led into the nearby forest. </p>\n\n<p>I followed them but I began to feel uneasy as I approached the treeline. The snow was falling heavier by the second and it was starting to become difficult to see at all. I thought I saw a flash of something race by me about thirty feet to my right but I didn&#39;t hear any sounds. </p>\n\n<p>I made my way over to where I saw the flash and felt anxiety fill me as I saw that same set of tracks leading towards my cabin.</p>\n\n<p>I quickly shifted my gaze to the cabin and in between the falling snow I could see a figure standing beside the house. &quot;Hey!&quot; I yelled out. &quot;This is private property you had best leave now if you don&#39;t want a bullet in your head!&quot; I raised my rifle and jogged my way towards it.</p>\n\n<p>As I approached it, something seemed wrong. It didn&#39;t look like a person. It&#39;s skin was whiter than than the snow and it had an unnatural figure that twitched and writhed in front of me.</p>\n\n<p>I lost my focus as I gazed upon this monstrosity and tripped in the deep snow. As I picked myself up and wiped the frost from my face I saw it sprinting off in the distance, well over one hundred yards away. I stood up and took aim but it moved faster than anything I had ever seen. Before I knew it, it was completely out of sight. I quickly raced inside and barred the door shut and just sat there for a while. &quot;What the hell just happened&quot; I thought to myself.</p>\n\n<p>A few weeks passed by and I sat up late wondering if that thing was going to show itself once more. I didn&#39;t know what it was but curiosity was starting to nag me as I spent my days sitting on the porch, scanning my land to find that thing.</p>\n\n<p>Time dragged on and I was beginning to run low on food as I hadn&#39;t gone hunting in some time after seeing that monster near my cabin. But I had to eat..  I bundled up and made my way into the forest to get some fresh kill that could sustain me for a while.</p>\n\n<p>Walking through the snow I was scanning the area nervously as paranoia gripped me tightly. I was almost to a tree stand that I had used to acquire much of my food. I swung my rifle around my back and made my way up the tree, looking every which way as I did so.</p>\n\n<p>I settled into the stand and zipped up my coat as the harsh, Michigan winter roared through the forest. I was able to bag a few rabbits and squirrels and it was turning into a pretty good day as I had got enough food to last me for a while.</p>\n\n<p>As I was about to call it a day, I was packing everything up before I heard something walking through the snow a good distance away. I quietly leaned up on the edge of the stand and looked out to see a huge buck walking by. </p>\n\n<p>A buck this size would last me a good amount of time throughout the winter and I actually felt myself salivate as I positioned my rifle to take down the beast. As my finger caressed the trigger I was readying myself to fire. But as I pulled the trigger, I saw a familiar flash go by and the buck went with it.</p>\n\n<p>My ears still ringing from the gun shot, I looked out to see a horrible sight.That thing had taken the deer down and was tearing it apart- ripping off its limbs while excitedly devouring it alive. </p>\n\n<p>I couldn&#39;t believe what I was seeing. I watched as the buck&#39;s life slipped away as this creature bathed in the carnage- consuming the poor animals insides with gluttony. Not thinking, I pulled my rifle back up and with hands trembling, I fired.</p>\n\n<p>It was a direct hit.. The thing reared up as blood caked its face. It sat there for a moment as I reloaded and it shifted its gaze right at me. I finally got a good look at it as it wasn&#39;t shrouded by falling snow. It was disgusting- it&#39;s limbs painfully hung off its body and it had only one arm dangling off of it. </p>\n\n<p>It turned right back to the corpse and continued to feast as I readied my next shot. Bang- another direct shot to the head. This time it stood up and appeared agitated. With its one arm it scooped up the buck and flung it my way before it smashed into the old wood supporting me in the tree. </p>\n\n<p>It was a direct hit as blood and guts splattered across the tree and and stand as I tried to center myself. Adrenaline coursed through me again as I tried to reload my rifle once more. As I did I saw it bolting towards me in silence at an unnatural speed.</p>\n\n<p>As I finally reloaded and readied my gun I heard the thing hit the tree and start crawling up the steps. I pointed my gun towards the top of them and as its head poked up, I saw a pale face with huge teeth and one green eye on the left side. It had long, grey hair on top of its head that was torn out in many places with patches of blonde in it.</p>\n\n<p>I unloaded on it and it seemed to do some damage at first as it slid down the steps a few feet. But before I could react, it sprung back up and pounced on me, proceeding to to maul me. I kicked and screamed but its strength wasn&#39;t normal. It then held me down with its one arm before headbutting me so hard that I heard my skull crack. </p>\n\n<p>In a daze, I looked up at this thing as it shot its head down and tore its huge teeth into my arm. Pain erupted and I screamed as I tried to fight it off with punch after punch. I thought I had won when it finally let up, but I looked up to see it tore my arm from my body. </p>\n\n<p>I got one more good look at its face as it glared down at me that one green eye. The eye held a great fear inside of it that didn&#39;t quite match the predatory look shown in its toothy smile.</p>\n\n<p>It jumped down and ran off without a sound after that and I was somehow able to manage to get myself off of the tree-stand. I was barely able to walk to my cabin as i struggled to stop the bleeding. I stumbled into my home and picked up my phone to dial an ambulance before passing out on the floor.</p>\n\n<p>I woke up in the hospital and though I survived the attack, I have never been able to overcome the mental damage brought upon by the events. Nobody believes me.. but I guess I can&#39;t blame them.</p>\n\n<p>I left my property and have made sure that I am constantly surrounded by family so that thing can&#39;t get to me again. But every white flash of snow takes me back to that tree stand where it took a piece of me for itself. God help me. </p>\n</div>\n","author":"NamesJames0933"}