{"rank":"2","title":"The Ghost Behind My Back","id":"8k9j8j","url":"/r/nosleep/comments/8k9j8j/the_ghost_behind_my_back/","time":"1526607410000","body":"<div class=\"md\"><p>“I don’t know where we’re going.”</p>\n\n<p>His voice trembles as the car gently cruises down the backcountry dirt path. The trees are thick and green, the silhouettes barely visible on a supposedly normal Sunday afternoon. I just shrug at his remark and not really caring where I’m headed as long as it’s somewhere. I clutch my stomach tightly as soon as the waves of pain come once more. It feels like a hundred hot knives clawing it from the inside. </p>\n\n<p>“You okay?” He asks, not taking his eyes off the road and his right hand stays glued to the shift stick. </p>\n\n<p>Being myself, I didn’t answer him back and just let go of my stomach despite being still in pain. I turn my head to the car window, reflecting my dirt-covered face and looking past it, it’s just the same row of trees, thick and tall. I put my hand on the car window control panel and start to press it down, rolling the windows down. A strange stench fills the air but it beats having to breathe your own breath for 3 days straight.</p>\n\n<p>“Are you insane?!” He cries out and scrambling to get it back up.\nI answer this time. “No. What’s the worst thing that could happen?” I challenge him. “It’s not like I’ll suddenly get grabbed without us noticing.”\nHe shakes his head. “That’s not the point.”\n“Whatever.”</p>\n\n<p>I push it back down again despite his silent protest and start to enjoy the new countryside air. We drive down the road in silence, with me clutching my stomach from time to time and him just doing what I have come to know what he does best: driving. </p>\n\n<p>“I never did get to know your name.” He says, breaking the silence after a few hours of straight and curve paths.\nThe orange glow of the sun is still blinding even in the car as I answer. “Doesn’t really matter does it?” I state as a matter of factly.\nHe sighs and then softly chuckles. “Dean.”\nI nod at him, acknowledging his name. “Nice to meet you, Dean.”\nThere’s a slight pause to which I realize he’s waiting for me to say my name. “Really not going to huh?” He says in fake resignation. \n“Again, wouldn’t really matter….” I trail off.\n“Okay, so tell me this at least,” He starts to say. “What did you do before… all of this?” There is sadness in his voice. The kind that’s contagious.<br/>\nI decide to answer him in an upbeat manner. “I’m a restaurant manager as you can see from my uniform.” I point to my dirty and worn out uniform, I notice my name badge is still there and so does he.\n“I wouldn’t have guessed.” He remarks and then continues. “Nice to meet you, Maryse.” Pronouncing my name as Muh-riz.\n“It’s May-ris.” I correct him, turning my head to him to glare.\n“Doesn’t matter.” He turns to me, winks and focus his green eyes back down on the road. \nI continue to glare at him. “So don’t pronounce it next time.” He nods. “Anyway, what about you, what do you do?” I continue, figuring that if he knows something about me then I should know something about him too.\n“I’m an inmate.” He says nonchalantly and unwavering. He must have seen the look on my face and the way my jaw dropped and he bursts out laughing as he takes a left on the road. “I’m kidding. I’m… I don’t know, a backpacker of some sorts?”\nMy face relaxes a bit but a little confuse. “So like, going away on business trips?” A sharp pain from my head suddenly erupts and I feel a little dizzy but I manage to hide it from Dean. \n“No,” He’s shaking his head, his brown hair getting even more tussled. “As in, I walk or drive around the country…” \nI slowly nod. “A drifter, I see. Must be nice.” </p>\n\n<p>He didn’t make any more remark or sounds so I focus my eyes on the road in front of us. In the faraway distance, I can see smoke from somewhere and a lot of left behind belongings litter the grasses beside the path. I suddenly become aware of my surroundings. We’re drawing near a city, the worst place to be in right now. </p>\n\n<p>“We should turn back.” I manage to stutter out.\nHe slowly stops the car while looking around the surroundings. “It’s our best place and chance to find other survivors who could help us…”\nI shake my head adamantly. “Not yet, now’s not the time yet.”\n“But-“\n“My car, my rules.” I insist adamantly and suddenly clutch my stomach once again, the pain almost unbearable this time that I let out a soft whimper. \n“H-hey are you sure you’re okay?” Dean says, unbuckling his seatbelt.\nI raise my hand, letting him know that he shouldn’t touch me or perhaps even be near me.</p>\n\n<p>The silence is almost bearable now as we pass by the same trees except it’s almost dark now. </p>\n\n<p>“I think we only have fuel for just another day.” I break the silence this time, my hand never leaving my stomach. “We should find a place to lay low.”</p>\n\n<p>It was uneventful as the setting of the sun… it’s much better that way I suppose. It’s better to be bored to death than be eaten to death… well, I’m one to talk. The house seems to be intact as it’s illuminated by the low, headlights that come from my car. Dean gets out and quickly makes his way to the house, picking up the baseball bat in the backseat as he did so and I try to get out as well… try being the keyword here as the moment I shuffle myself out, the pain starts once more and it’s even worse now. It doesn’t feel like a thousand daggers, it feels like something is ripping my stomach out, not to mention I can feel cold sweat starting to drip down. </p>\n\n<p>I lay on the ground as I hear footsteps. This is the end I thought to myself. So this is how it ends, not in a peaceful passing that I have hoped but in a screaming, my-guts-are-all-torn-up way. I giggle softly as I close my eyes. This is my karma.</p>\n\n<p>“Hey! What’s wrong?!” A hushed voice says panicking, it’s just Dean much to my dismay and relief. “Now, I’m no expert but you’re very hot.”\nI get what he’s referring to but I decide to make the mood a little lighter. “Well, I did manage to make it to the top 10 hottest students list back in high school.”\nHe didn’t laugh, boo. “Shut up and let’s get inside.” I feel him pick me up, my eyes still close all the way to wherever it is that we’re going to. He’s very warm but it does nothing to the take away chills I’m feeling. </p>\n\n<p>I hear a door groan open and then close then feel myself being set down and lying on a somewhat soft but dusty place which I assume to be a worn out bed.\n“Please tell me it’s not blood stained.” I say quietly, the pain in stomach unbearable now at this point as I moan softy and shortly in pain. \n“It’s not.” He says quietly. “Can you tell me the story?” He sits at the foot of the bed.</p>\n\n<p>I sigh and turn on the bed, being able to open my eye just a little. The house looks abandoned but well maintained, like the owners of the house must have never been home or one of those for sale houses. I took a good look at him before answering him.</p>\n\n<p>“It was 3 days ago…” I start to say through the pain and shivers. “The day when it all started for us, I think. One of my employees went in looking like a pale ghost. I never really liked him because he was a creep so I ignored him nonetheless. After a few hours, we notice some strange noises inside the bathroom so I went inside to check and… that’s where it happened.” I pull up my blouse to reveal to him a bite mark which has gone green.</p>\n\n<p>He is silent all throughout, he’s looking at me with soft eyes. He stands up and I half expect him to get the bat and give me a good pounding to the head or at least leave me alone and get out but all he did is lay next to my bed.</p>\n\n<p>“Thank you for being honest with me, Mayrise.” He pronounces it right this time. \n“I hate it so much…” I say angrily and teary-eyed. “I hate how even in death, that guy manage to make my life so difficult…”\n“Why didn’t you fire him?” He asks.\nI laugh a little. “Because he has nowhere to go and no one would hire him… also because he’s still a decent worker when it comes to his job and I don’t have the heart to do so.”\nHe shifts a little. “You’re a kind woman.”\n“I wished he was dead so I won’t have to fire him… guess I got what I wanted and what I deserve huh?”</p>\n\n<p>He doesn’t say anything anymore and just hugs me. I’m crying waterfalls at this point. It went on all through the night, him just hugging me and me just crying. At some point, we fall asleep and I wake up to the sound of the car engine starting. I try to move but I can’t, I feel so… weak and I feel like I’m paralyzed. I manage to open my eyes and there was a letter on the bed but I can’t get to it or even try to read it. I don’t think I want to know what it says too so it’s a win-win for me in my current situation. I thought I was going to be a poor soul, doomed to drive the world alone with my guilt even though it’s a small thing to bear but I was wrong, whoever is out there is watching out for me, making sure that when I finally pass, I will have no regrets whatsoever. So thank you, Dean for coming to my life no matter how short our time has been, I will treasure it forever, wherever I may go after this. Now that the ghost behind my back has passed on, I will become yours.</p>\n</div>\n","author":"HaileyChang72"}