{"rank":"8","title":"Minneola, Kansas","id":"8k9mm1","url":"/r/nosleep/comments/8k9mm1/minneola_kansas/","time":"1526608389000","body":"<div class=\"md\"><p>You know small towns? We all have our own opinions of them. Some of us, like me, love the everyone knows everyone feel. Some of us hate them.  Minneola, Kansas is one of those towns. </p>\n\n<p>Not many people have heard of it, and its not very surprising considering the population of only about 700. If my mom didn&#39;t move there when I was young, I doubt if have heard of it. Because she moved, I went on vacation to her house every summer (I lived in Washington with my dad).</p>\n\n<p>It was mostly normal, especially in the many years before I was an edgy and irresponsible teenager. But at that point my brother (who we&#39;ll call Scott for now), my friend (I guess we can call him Cameron), and I started looking around. It was almost impossible to get lost in a town as small as that, so we weren&#39;t shy of going far to find abandones buildings.</p>\n\n<p>That was what we did for fun for a significant amount of time after we actually moved there instead of being there for only the summer. So here I&#39;ll decribe somw of the more unsettling things we found.</p>\n\n<p>The Cat House. I can&#39;t not mention this.</p>\n\n<p>So, Minneola has sort of a problem with feral cats. A family friend of ours actually tames them as a job and a passtime. And a lot of them hang around a large, green and white house. We took to calling it &quot;The Cat House.&quot; There&#39;s a boarded up front door, and a locked but broken back door. We found a rusty old stool go put up against the door to get on and crawl through the large hole. We were welcomed to a large room. There was a staircase leading up in front of us, a staircase to the basement beside it, and a living room to our right. The living room had a broken couch, a pile of boards, a broken TV, and a door to the dirtiest bathroom of all time. We couldn&#39;t seem to find anything else down here, so we tried upstairs. There was mostly just a hallway with empty bedrooms. One of the bedrooms had a chest of yellowed books and newspapers, and another had a small frame of a model boat. In one of them, a window was missing the glass, allowing us to get onto part of the roof. Every now and then we would see a cat scramble across the floor accompanied by a screech you could barely call a meow.</p>\n\n<p>Then we went to the basement I had brought a flashlight, as I didnt have a phone at the time. It was very cramped, a dresser with drawers of tools and bits of trash against the wall of a thin hallway with tons of trash coating the floor of a room to the left. That&#39;s when we saw it. A dead cat on the floor. Its not surprising to find dead cats at a place full of cats, obviously, but this just...there&#39;s no way to decribe it in full. It wasn&#39;t a body, more of a hollow shell that looked like skin. All meat and bones removed from the creature, though the chest looked like it had once been tight against the ribs. The mouth was wide open, and its legs were positioned in an odd way. It was like the cat was hunting, chasing prey before it had suddenly turned to stone.</p>\n\n<p>There was another dead cat near it, but that looked normal. It was nearly impossible to focus on that with the dried shell of an animal in front of us. Anyways, after that, we tried the outdoor garage. There was so much furniture in there that we couldn&#39;t get far. Nothing terribly interesting. So we quickly went home with the image of the shriveled cat on the stone floor burned into our minds.</p>\n\n<p>The Discarded Car</p>\n\n<p>It was just me and Scott who found the car when we were walking around. Cameron had stayed home. Anyways, we found a red-orange car in the middle of field. There was a road about 50 feet away, but it was never busy. So it seemed very desolate and ominous despite the broad daylight. \nIt seemed ancient with all the euat and decay, but the car was clearly made recently, within the last couple decades. Most of the windows were cracked, but one was busted open completely so we crawled through it (the lock didn&#39;t budge). There wasn&#39;t much other than a blanket in the front, but we looked at the back and found quite a few dolls. Ive never been one to be afraid of them, but I couldn&#39;t help but feel unnerved by the dirty toys laying around.</p>\n\n<p>The glove box had lots of cassette tapes. Most were laveled as albums or songs from musicians that Scott and I hadn&#39;t heard of, so we brought them home to play on the age old radio we kept under my bed. Moat of them were simply country music tapes, but one seemed to be a recording of a girl and her mother playing I Spy while driving. I didn&#39;t know how this had been recorded, as I was pretty sure you couldn&#39;t use a car to record. I also had to wonder why. There was no point in recording a conversation as mundane as this.</p>\n\n<p>Jay and Alex&#39;s house</p>\n\n<p>When we were younger, about seven or eight, we were friends with a pair of twins named Jay and Alex (names changed because reasons). They ended up moving, leaving their house abandoned. And that house was right between the houses of my family and Cameron&#39;s. So naturally, we decided to take a look.</p>\n\n<p>It was very clean other than dust, surprisingly. The family hadn&#39;t left furniture or anything other than a mirror against a wall and a dresser. So there wasnt much. Some paperwork on the kitchen counters. A tree in the yard that was easy to climb and granted easy access to Cameron&#39;s roof.</p>\n\n<p>The most interesting thing was a disc marked &quot;Summer 20XX&quot; (It had an actual year, I just don&#39;t remember what it was). We wiped off the dust as well as we could and pkayed it in Cameron&#39;s PS3. It showed normal family clips of them making memories. Like one of Jay dancing while his mother played a piano. The most interesting part was seeing videos of Jay and Alex playing with us. Seeing ourselves so young was quite an experience. And I know it was us because our parents were there too. I asked my mom later if she remembered Jay and Alex. She said she did, when when I asked more questions, she said she had no memory of ever meeting their parents. And the thing is, I don&#39;t remember it either.</p>\n\n<p>Stereotypical Ghost Story About the School</p>\n\n<p>It was traditional of us to stay up all night at Cameron&#39;s house, sometimes with his sister. One time we found ourselves telling each other scary stories. My brother said something about seeing a little girl in the school across the street, but the Cameron asked, &quot;Wait, really?&quot; It was as though he had seen it to. Which he soon said he had. So now both Scott and Cameron agreed on a little girl haunting the school or something. At that point, Sara (that&#39;s what well call Cameron&#39;s sister I guess) came outof her room and asked what we were doing. Scott told her and she asked if she could go next. I didn&#39;t have anything to tell, so she got to go. Sara deceived something eerily similar to what Scott and Cameron had allegedly witnessed. I personally think they&#39;re all bullshitting but you never know, especially with a coincidence like that.</p>\n</div>\n","author":"Wh1te_Mant1s"}