{"rank":"102","title":"Something I repressed from my childhood is back","id":"8k9ny1","url":"/r/nosleep/comments/8k9ny1/something_i_repressed_from_my_childhood_is_back/","time":"1526608769000","body":"<div class=\"md\"><p>I came across something this morning that has brought a flood of fear back into my life; something that I thought I had escaped from many years ago. I found it when rummaging through a box of old belongings that I was clearing out to make room in my closet for more baby toys and clothes for my first infant son, who slept upstairs. I haphazardly tossed what I knew I could trash behind me and into the hallway where they thudded against the wood floor. \nNow I’m certainly not any kind of crazy by any means, but if there was someone with me when I pulled that dreadful thing from its box, they probably would have begged to differ. I’d think the same if I saw a grown man take one look at a Dora the Explora flashlight and fling it at the wall in absolute terror. Trust me though, my actions were justified. That thing has triggered something I had repressed in my mind for a long time, and I need to get this down before something bad happens. What that is, I don’t know, but I threw that flashlight for two reasons: one of them was because of the sheer mental damage its memory has caused, and the second I will explain in a bit.</p>\n\n<p>What happened to me and this little plastic toy happened when I was 13 years old and still living in the town where I grew up. Only now are the details of the event so vivid in my mind from this relapse that I can conjure a full story from them. I must type fast so I have enough time to prepare for whatever might happen soon, and I will leave out the unimportant details.</p>\n\n<p>When I was 13, I didn’t have too many friends where I lived. I thought of all my classmates as stuck up or too enveloped in their efforts to look cool and popular. My two best friends, Tom and David, are the other witnesses to the events of that night and are the only other people of importance for this story. </p>\n\n<p>The three of us were quite comfortable doing our own thing and not being one of the “cool kids”. We even bought things that most boys our age wouldn’t care for out of ironic amusement. We would sport little girl’s cartoon backpacks and old pocket watches like mini hipsters as we marched proudly through the school halls. It was always funny to see the other kids’ reactions to out odd appliances.</p>\n\n<p>We would hang out at each other’s houses a lot, but linger at Tom’s place more often because of the vast forest behind it. Most days we would climb trees and adventure through the hills during the day. We even found a big tire deep in the hills and propped it against a tree until we could get one of our dads make a swing with it. </p>\n\n<p>One day, one of us thought to play flashlight tag there, and of course we couldn’t use regular boring flashlights. The next day, we all met at Tom’s home with various children’s shows themed torches and trudged off into the dense woods as the sun sank beneath the horizon. Tom had a Barbie one, David a Peppa Pig one, and me: a Dora the Explora flashlight. </p>\n\n<p>The game started out as they all did: David insisting to be “it” as Tom and I tried unnecessarily hard to be strategic in such a simple kid’s game. As David waited near the forest edge, the two of us dashed off into the darkness, lights off to avoid detection. The thick layer of leaves shuffled under our feet from the bare autumn trees that shed them. David’s counting faded more and more as Tom and I grew nearer to the area with the most hiding options. </p>\n\n<p>“I call dibs on the dead tree pile!” Tom panted through gasping breaths. He had never been very athletic. </p>\n\n<p>“Whatever idiot, that’s the first place anyone would think to look.” I responded. </p>\n\n<p>He shot back a weak, “exactly,” before breaking off left towards the heap of dead oak trees that had all fallen in one spot. I had my own plan of action. To the right was a patch of smaller birch trees all grouped close together. I would be able to climb the smooth bark quietly and step from branch to branch without being seen or heard. I quickly bolted up one of them, hunkered down, and waited for Tom’s screams of defeat. </p>\n\n<p>I remember feeling like a bird up in those branches and trying to listen for any real birds around me. I didn’t hear any of course, because it was night, but I did notice that all other ambient noise was absent. The crickets and frogs had been replaced by the soft wind blowing. I stayed up there thinking about this for a few minutes before I could hear the sound or slow, deliberate footsteps coming my way. I slowed my breathing and stayed perfectly still, confident in my ability to remain invisible. The shuffling steps came to a stop not too far from my tree, maybe around 20 feet. David searched the area for any signs of us, flashlight off. He inched closer and closer to me through the darkness. I assumed he thought one of us might hide behind the group of trunks I was currently perched above. His distance made me uncomfortable, so I carefully stepped over to the tree on my left via branch.</p>\n\n<p>David contemplated what to do next before the sound of a snapping twig behind me caught his, and my, attention. I heard him spin around and slowly tiptoe towards the noise. I craned my neck to look behind me and see what made the sound. I assumed it was a rabbit or some animal and almost laughed at the idea of David pursuing an angry skunk.</p>\n\n<p>He crept around the left of my tree, probably about to switch his light on and catch whatever made that sound when Tom, in all his impatience, called out like a bird from his spot. Once again, David spun around and giggled at Tom’s goofy outburst before heading in that direction. Once he had gotten a good distance from me, I let out a sigh of relief. That relief however was cut short by the sharp sound of whatever was behind me taking off around the right of my tree, parallel to David’s path. My blood froze from the sudden noise but was replaced with calm logic; it’s just a deer. I could hear its four hooves prancing through the leaves. Bored with my spot though, I climbed down to the earth and headed to my friends to make things more interesting. </p>\n\n<p>As I quietly maneuvered between the trees until I was only about a hundred feet from the tree pile where Tom remained. David circled around the left of the trees to investigate the location. Something caught David’s attention to his left because he snapped his light on and yelled, “GOT YOU!” in that direction. </p>\n\n<p>Noticing David’s mistake, Tom began to yell in amusement, “You idiot I’m over—” but was cut off by David screaming bloody murder. I jumped back where I stood as David’s beam of light became frantic from his sprinting. He bolted past Tom, who blurted out questions after hopping down from the tree pile and following. Not wanting to be left behind, I took off with them and ran from whatever David had seen.</p>\n\n<p>“What are we running from?” Tom yelled, but David was in hysterics, crying and mumbling nonsense. We didn’t need to know what he saw to be scared though because a fourth set of sprinting footsteps exploded from behind us. I yelled in terror and we all made a desperate escape deeper into the hills of the forest. The electric buzz of adrenaline kept my body moving and my mind racing for answers. A quick observation of our pursuer’s footsteps indicated it was bipedal and human, although their panting was noticeably absent, unlike ours. Thoughts of a murderer or child kidnapper thundered through my brain and images of what might happen to us violated my mind.</p>\n\n<p>Our breaths, especially Tom’s, became more labored as we arrived at the hills of the forest. This part of the woods had more trees and rocks that we had to run around, causing us to take different paths and putting more distance between each other. David was in front of me by about 15 feet, while Tom lagged around 6 feet behind me and to the left, where the pursuer remained behind. Our various screams and whimpers were the only way I could identity our locations in the dark. Not long into the chase was when I heard the familiar sounds of what I thought was that deer running at David’s right, in the same direction we were running. </p>\n\n<p>This is when I noticed that things weren’t right. Instead of running away from us, the deer ran alongside us like he was herding sheep. My confused mind tried to rationalize it but was interrupted by Tom’s panting and wheezing catching up to me on my left. His sounds of fear and shuffling of leaves under him all matched except for one thing: at no point had Tom ever been able to outrun me or David in his life—not even remotely. This realization sent a new wave off terror through me and I split off to the right, away from whatever was panting in Tom’s voice. Then I heard another set of yells and pants, but this time coming from the “deer” now in front of me. It was David’s mumbling, mixed with the sounds of four hooves running through leaves. I tore up and down the hills, weaving through the trees and boulders in my way. </p>\n\n<p>I listened to my surroundings again and noticed a frightful change. I could distinctly hear six pairs of footsteps stirring up the layer of autumn leaves on the ground. Six individuals, who all now whimpered and panted and wheezed like we did. I could no longer make out which were my friends, and which were those things pretending to be them. I even heard my own voice, copied and forged in the confusing stampede of sounds. Whatever they were, they came out of seemingly nowhere and flawlessly slipped into the running pack.</p>\n\n<p>At some point on of the Toms let out an exasperated “SHUT UP! STOP IT!” to the onslaught to footsteps around us. This prompted a new layer of chaos to the chase as the creatures let out phrases like “Leave us alone!” and “What are you?” although some may have actually come from Tom and David. </p>\n\n<p>Soon I wasn’t even sure that Tom or David were still with me or had already been caught and replaced. I wasn’t even sure if the ones who began running were even real, as I never saw either of them clearly. Whatever the case was, I was running towards nowhere, further from civilization with a pack of mimicking monsters. It was when another entity dropped onto the ground from above and galloped with us, before slowly transitioning its running to that of a bipedal human, that I decided that I couldn’t take this anymore. My legs were poised to give out from under me and my lungs ached from their efforts to keep me alive. I could tell what hill I was cresting at the time and a split-second plan popped into my desperate mind. </p>\n\n<p>I ran at the tree where the large tire rested on the side of the trunk, ready to throw the things off my track. I launched myself onto the tire, kicking it forward and sending me up to the branch above it. I hugged the limb with all by strength and pulled myself up onto it. The tire that I kicked was already rolling down the hill, taking my place in the cacophony of rustling leaves. The pack of footsteps and panicked protests carried on without me, farther and farther, deeper and deeper into the woods. </p>\n\n<p>I caught my breath finally, and when I was confident in my escape, I dropped down to the floor and ran back to Tom’s house. I made it all the way back with no signs of pursuit and screamed my head off for help when I got to Tom’s back door. His father came to my aid, worried sick of what had happened to us and his son. </p>\n\n<p>Our town was shaken by my story, and even more shaken by the fact that Tom and David never came back from that forest again. Even when I insisted about the details of the mimicking creatures and the mainly bipedal nature of their running, the adults still chalked it up to a pack of wolves. While that answer was not at all consoling for David or Tom’s families, it did avoid the possibility of the town assuming anything supernatural. </p>\n\n<p>The months after that night, I wrestled with myself over my decision. Although I survived, I had abandoned my two best friends to those things back there. To bury the guilt, I told myself verbally every day that there was nothing I could’ve done and that they may have already been lost to that horde.</p>\n\n<p>As years passed though, and my family moved far from that town, I learned to move past it. The memory became a bad dream which in turn became completely repressed in the dark recesses of my consciousness, until today. The sight of that Dora flashlight has dug up those unwanted memories. That second reason I threw that torch at the wall is this, by the way.</p>\n\n<p>When that sound of “Tom’s” panting caught up to my left, I had my flashlight in my hand. I thought of turning it on and shining it at whatever was chasing us, but what I might see disgusted me so much that I threw the torch into the leaves of the forest floor in repulsion. That light never made its way back into my hands on the way back home either, so why is it in my house now? And why can I hear my son’s crying twice upstairs? </p>\n</div>\n","author":"PappaPepps"}