{"rank":"6","title":"Has anyone heard of a demon that breathes smoke? [Part 3]","id":"8k9our","url":"/r/nosleep/comments/8k9our/has_anyone_heard_of_a_demon_that_breathes_smoke/","time":"1526609019000","body":"<div class=\"md\"><p><a href=\"https://www.reddit.com/r/nosleep/comments/8jr4bs/has_anyone_heard_of_a_demon_that_breathes_smoke/\">Part 1</a></p>\n\n<p><a href=\"https://www.reddit.com/r/nosleep/comments/8k0fh8/has_anyone_heard_of_a_demon_that_breathes_smoke/\">Part 2</a></p>\n\n<hr/>\n\n<p>I had another dream. I was four years old, and with my grandfather in the woods by the farmhouse. He was taking me to pick strawberries. It was the day he died.</p>\n\n<p>We were approaching the ravine. Grandpa held my hand firmly and was totally silent; he hadn’t said a word the whole walk there. </p>\n\n<p>Then, without saying a word he dropped the pail he’d been carrying in his other hand. He took his hunting knife from its sheath and he swung at me, aiming for my throat. I screamed and ducked, which threw him off-balance because he was still holding my hand. He fell to the ground, and the knife sliced my upper arm before he dropped it.</p>\n\n<p>I tried to run, but Grandpa grabbed my ankle and I fell into the dead leaves too. I kept screaming, trying to scramble away, but Grandpa had picked up the knife and lunged at me again. I flailed my arms and legs wildly, and managed to squirm away from the blade. My hand found a large rock, but it felt slippery from the blood running down my arm and coating my palm. Grandpa was on his knees, and now he pressed his forearm onto my chest to pin me to the ground. He leaned in close and drew the knife towards my throat again, but I swung the rock with all my might and hit him in the head.</p>\n\n<p>He went limp instantly, slumping off of me before tumbling into the ravine. I was shaking and sobbing, but through my tears I saw it again: the red-cloaked thing with two trails of smoke slowly curling into the air from its face. It was just a few feet away, but it stared directly at me before walking—no, gliding—down the ravine. I watched it approach Grandpa’s now limp body, and hold its little bowl to the gash on the side of his head where I’d hit him with the rock. After the bowl was filled with blood, the demon tilted the bowl to where its mouth must have been and drank deeply. The smoke trailing up from its nose was darker, and I could clearly smell it now. It looked directly at me one more time, and I saw two eyes that glowed orange like embers.</p>\n\n<p>And then I woke up. I didn’t register anything about my surroundings, just the blood pounding in my head as I realized it wasn’t a dream. And neither was the dream I’d had about what happened to Kelly. I really had killed them both, 20 and 10 years ago. I murdered them both, and the red-cloaked thing had drank their blood out of its little bowl.</p>\n\n<p>Suddenly, there was loud bang from downstairs. Fear seized me as I looked out the bedroom window. My truck was still parked next to the barn, but the thing was nowhere in sight. It must have come into the house. Suddenly I was aware of the faint odor of smoke in the air, but I couldn’t tell where it was coming from. I knew this was it. I’d have to kill it, somehow, before it could make me kill again. It had made my grandfather kill for it for who knows how long before he killed Franklin, then it transferred to me when I killed my grandfather. It made me kill my grandfather and cousin 10 years apart, and now 10 years later it wanted blood again.</p>\n\n<p>I clutched my grandpa’s knife, the same one he’d tried to kill me with on the day this curse switched to me, and silently opened the bedroom door and slipped into the hall. Everything was completely silent again, but the smoky smell had grown stronger. I crept down the stairs as quietly as I could.</p>\n\n<p>Suddenly, from the kitchen to my left, I heard rapid thudding. Footsteps, coming straight at me. I was gripped with fear and did the only thing I could: spun around with the knife already swinging, just hoping that I could take out the demon before it could reach me.</p>\n\n<p>But it wasn’t the demon.</p>\n\n<p>I swung the knife at what would have been stomach-level for an adult. Instead, it hit five-year-old Mia in the head, stabbing her right eye.</p>\n\n<p>“Uncle… Luke…” was all she said, before she collapsed on the floor.</p>\n\n<p>I felt numb as I staggered back against the wall. Everything looked and sounded far away. I was vaguely aware of the red-hooded thing I’d been hunting gliding into view and bending down with its bowl next to Mia’s tiny body. It held the bowl to her face so her blood slowly trickled into it.</p>\n\n<p>“Get the fuck away from her!” I screamed. I charged at it, not knowing what I was going to do, but then I heard, “MIA!”</p>\n\n<p>My vision slowly focused again as the front door opened, and Tom was there, staring at me and then his daughter’s body. I can’t describe the look of rage and despair that contorted his face.</p>\n\n<p>He charged across the room at me and grabbed the first thing his hand closed on, my cordless power drill that I’d dropped by the front door, and swung it right at my head. Everything went black.</p>\n\n<p>I don’t know how long it was until I woke up. The house was empty and silent; Tom and Mia and the red-robed monster were all gone, and I was alone with the lingering scent of smoke hanging in the air, and the glaring bloodstain that had seeped into the floor where Mia had collapsed.</p>\n\n<p>I didn’t waste any time. The farmhouse was cursed. It had to be destroyed. I stumbled to my feet and pulled a bottle of lighter fluid out of my backpack that still lay by the door. I frantically sprayed it all around me. I might have seen the thing again in flashes of red at the edge of my vision, but I didn’t pay it any mind now. I didn’t care if it killed me.</p>\n\n<p>I took my lighter out of my back pocket and touched it to the trail of lighter fluid before sprinting out of the house. The flames sprang to life and in moments the old house was taken over. I ran to the barn, where I swiped my flaming lighter over several hay bales before I was satisfied it would burn the whole goddamn place down. I left the lighter, and as I tore into the woods I could hear sirens approaching the house.</p>\n\n<p>It&#39;s morning now. I guess I&#39;ve been writing all night. I&#39;m starting to forget what I did already. I killed them. I know I killed them—Grandpa, Kelly, and now Mia—but the details and the memories of actually doing it are already fading. I&#39;m going to end it now. I heard sirens a few hours ago. They must be looking for me by now. I can see the red cloaked demon, monster, or whatever it is standing in the distance, where it’s been watching me with glowing orange eyes this whole time, holding its little bowl that I know is stained with Mia’s blood. I just hope, after the flames are extinguished, that no one ever tries to build here again. I don&#39;t know what made me do it, but you can&#39;t stop it. I&#39;m going to use my pocketknife to slit my wrists, and wait.</p>\n\n<p>Please, if you&#39;re reading this, tell them to never build anything at the Ellis place in Twin Oaks.</p>\n\n<p>I&#39;m so sorry, Mia.</p>\n\n<p>&lt;May 18, 2008. 05:37 AM&gt;</p>\n\n<hr/>\n\n<p><a href=\"https://www.reddit.com/r/nosleep/comments/8kipcw/has_anyone_heard_of_a_demon_that_breathes_smoke/\">Part 4</a></p>\n</div>\n","author":"whathappenedtoluke"}