{"rank":"49","title":"The Elevators [One]","id":"8k9tho","url":"/r/nosleep/comments/8k9tho/the_elevators_one/","time":"1526610337000","body":"<div class=\"md\"><p>For two years, I worked as personnel in a hotel that was a lodging as much as it was a historical attraction. My main responsibility is to monitor the set of eight elevators in the building. Since this is an old building, the elevators frequently get stuck between floors and the lights occasionally go out. </p>\n\n<p>My job is basically to answer the buzzer, tell people that they aren’t going to die and keep them entertained until the elevators move again. There would be two people in the office during the day, but since I worked from 10PM to 6AM, I would be the only person there.</p>\n\n<p>The night shift came with its own set of rules:</p>\n\n<ol>\n<li><p>Between the hours of 12:00AM-6:00AM, do not open the door to the office.</p></li>\n<li><p>Between 2:00AM-2:15AM, do not speak to anyone on elevators #1, #3, and #5.</p></li>\n<li><p>Always answer the phone on the third ring. </p></li>\n<li><p>Never fall asleep between the hours of 1:00AM-2:00AM</p></li>\n<li><p>Never tell anyone your name.</p></li>\n<li><p>Do not play any games with the elevator’s occupants. </p></li>\n</ol>\n\n<p>When I first received the list, I’d burst out laughing. Our hotel was supposedly haunted and many visitors came here hoping to run into a ghost or get possessed by a demon. I’d guessed that the rules were there to add to the experience. </p>\n\n<p>The office was a self-contained space with its own bathroom, kitchen, sofa and even a bed. There were eight computer monitors with security feed from the elevators and speakers that I usually keep on mute. My job didn’t require me to leave the space at all. As for everything else: <em>whatever</em>. </p>\n\n<p>-</p>\n\n<p>On my first night, I ran into my first mishap. </p>\n\n<p>Around 1AM, I heard someone knock on the door to the office. We don’t get too many visitors at night, and I was distracted by a mobile game. I’d already stood up to answer the door when I remembered the rules.  </p>\n\n<p>Right when I hesitated, I heard my boss’ voice: “Hey, it’s me. Open the door, please.” </p>\n\n<p>Mouth opened, I wondered if this was a test to see if I would follow the rules or if my boss (who lives in one of hotel’s suites) really needed me. When I didn’t answer, the pounding got more furious: “Open the door!” “Open the motherfucking door!” “I know you’re in there!” “If you don’t open the fucking door right now, I will fire you!”</p>\n\n<p>After nearly five minutes, when the door sounded as if it couldn’t take any more beating, I opened the door. </p>\n\n<p>It <em>was</em> my boss standing outside the door, and I’d never seen anyone look so livid. His hazel eyes looked yellow in the dim lights, his teeth looked like fangs and the sound of his grinding teeth filled the whole space. He didn’t talk after I open the door and only stared at me. </p>\n\n<p>He stared without blinking for over a minute, then turned and walk away. </p>\n\n<p>I immediately slammed the door shut after he turned his back and reached into my pocket. My grandma gave me a demon-warding charm when I was a toddler and I always kept it in my pocket. Right now, it laid in pieces in my hand, looking as if a dog gnawed on it and spat it back out. </p>\n\n<p>The next day, my grandma took one look at the charm, murmured a prayer and said, “It did its job.”</p>\n\n<p>-</p>\n\n<p>Sometime during the first week, the buzzer rang at around 12:00AM. Glancing at the security cameras, I saw that Elevator #2 had stopped moving and its occupant, a little girl with bright yellow hair, was desperately poking the HELP button. </p>\n\n<p>I spoke into the microphone: “You’ve reached the Elevator Help Desk. Don’t be scared. The elevators sometimes stop a little and you will resume your trip shortly.”</p>\n\n<p>“I’m scared,” said the little girl.</p>\n\n<p>“Everything is okay,” I assured her. “Where are your parents?” </p>\n\n<p>“Dead.” The little girl tugged on her pigtails and she looked toward the camera. She had bright blue eyes that looked like the endless summer sky. I was briefly mesmerized. </p>\n\n<p>“I’m sorry to hear that. Who are you staying in the hotel with?” </p>\n\n<p>“No one. I have no friends.”</p>\n\n<p>I immediately regretted my instinctive offer of, “We can be friends.”</p>\n\n<p>“Okay,” said the little girl. Her smile lit up the whole elevator. “My name is Daisy. What’s your name?” </p>\n\n<p>After I spoke, the girl’s eyes gained this sadistic gleam of victory and her lips split into a wide, wicked smile. She licked her lips with an unnaturally long, forked tongue. Seconds later, a puzzled look crossed her face and her features contorted with rage. She opened her mouth and this unearthly roar came out.</p>\n\n<p>Before my mind caught up to what I saw and heard, she was a pitiful little girl again. She crouched down, rocked on the balls of her feet, and whimpered, “I know you lied. Why did you lie? Mommy hates me. Daddy hates me. You hate me too. ”</p>\n\n<p>After a while of sobbing and begging for my name, she stopped when the elevator began to move. I breathed a sigh of relief when I heard the <em>ding</em>. After one last look at my direction, she walked out. </p>\n\n<p>Then, I noticed that none of the buttons had been pressed and the elevator had stopped to open in the middle of two floors.  </p>\n\n<p>-</p>\n\n<p>In Elevator #4 (the only elevator where they allow advertisements and fliers), someone had posted a flyer of a lost wallet with those tear-off tabs. I’ve never seen anyone tear of those tabs, but one tab would go missing every night and the owner would put a new flier every ten days. </p>\n\n<p>Three weeks later, the staff found the missing wallet with all the tabs in an unused janitor’s closet. The owner later confessed that she’d dropped her wallet while ghost hunting in the closet and didn’t want to retrieve it herself.  </p>\n\n<p>-</p>\n\n<p>One time, I heard people talking and laughing from one of the elevators. When I looked, everything fell silent. I was staring at eight empty elevator cars and my speakers were off. As soon as I looked away, the party resumed again. I couldn’t make out the distinctive chattering or recognize any of the music playing, but the noises grew louder and louder. </p>\n\n<p>I had to stare at the screens the whole night. </p>\n\n<p>-</p>\n\n<p>During 2:06AM one day, a young lady coming back from a party got stuck in Elevator #3. She pressed the HELP button and asked for assistance. At first, she was polite and tentative, but then she grew frustrated, angry and scared. She began banging on the button and yelling into the speaker.</p>\n\n<p>Since it was in the rules, I didn’t respond. She began talking at around 2:11AM:</p>\n\n<p>“Yes, I’m so glad you finally answered. What took you so long?” </p>\n\n<p>“I’m stuck on the elevator. Do you know how long it’d take before it moves again?”</p>\n\n<p>“Okay, that’s great then. Is that what you do? Just talk to us?”</p>\n\n<p>“Haha, that’s actually kind of funny. Yeah, some people would be scared of elevators.”</p>\n\n<p>“Not really. I’m not really scared of anything except spiders.” </p>\n\n<p>“Okay, great. Yeah, nice to meet you.”</p>\n\n<p>“What? Oh, my name’s Lucy.” </p>\n\n<p>The next day, Lucy was rushed to the emergency room. Apparently she’d been bitten by hundreds of spiders in her sleep and she’d been comatose since then. A staff member who paid her a visit said she looked as if the devil stole her soul. A couple of other co-workers exchanged a knowing glance.</p>\n\n<p>-</p>\n\n<p>Last Halloween, at around eleven, a man dressed in a gray, old-fashioned uniform stepped into the elevator #7. </p>\n\n<p>There was a bloody stump where his left elbow was and his legs were bent outward, like a frog’s. He had an empty eye socket and his remaining eye was milky. His skin looked like melting wax, wrapped around a clearly broken skull. </p>\n\n<p>His appearance was disturbing, but I’d assumed he was hired to deliver some scares for someone’s party.</p>\n\n<p>Based on the security feeds, he stopped at every single floor. At each floor, he’d take a step forward, look out of the elevators with a precise turn of his head, and step back. I tried to connect to elevator #7 to see if he needed assistance, but all I heard was static. I contacted hotel security about our visitor, but they laughed and said, “Good one.” </p>\n\n<p>Elevator #7 had an electricity outage earlier that evening and wasn’t working. </p>\n\n<p>-</p>\n\n<p>I’ve worked the nightshift all my life, so the hours didn’t bother me at all. I might play mobile games when things get slow or browse the internet, but I never slept on the job. So, the “don’t sleep between 1AM-2AM” rule never bothered me. </p>\n\n<p>Until one day in the middle of August. </p>\n\n<p>I knew something was wrong the moment I saw my grandfather sitting on the chair a few feet away from me. My entire body was paralyzed, but I think I knew on an instinctive level that my favorite grandpa meant me no harm. His body was entirely motionless, but his mouth moved.</p>\n\n<p>He would pull his lips back with an exaggerated stretch, then make this ‘o’ shape. He repeated the motion again, and again, until I tried to mirror the movement and realized he was mouthing <em>“Wake up.”</em></p>\n\n<p>I jolted awake at exactly 12:59AM.</p>\n\n<p>-</p>\n\n<p>I’ve seen more, but it’s nearing the end of my shift tonight, so I will cut this short here. Most of the time, the job is pretty good. You get to talk to all kinds of people and the job itself is pretty chill. But when things get interesting, things do have the potential to get pretty interesting.</p>\n</div>\n","author":"Anonia_Prime"}