{"rank":"177","title":"Bobby lost a tooth","id":"8k9vrc","url":"/r/nosleep/comments/8k9vrc/bobby_lost_a_tooth/","time":"1526610982000","body":"<div class=\"md\"><p>We do our best to give him the life he deserves. There’s just stuff you don’t plan on. I didn’t plan on not having gap insurance on my car. My boss being unsympathetic to my time off for disability. I mean you can’t be fired for being on disability and having ADA compliances your boss must follow, but being handed your check after a mistake - you know you’re fired for being too expensive. </p>\n\n<p>I was able to find employment, but we struggled. My wife worked part time for 5 years while taking care of Bobby. Picking up full time would just be chewed up by child care expenses. </p>\n\n<p>Then you have the repairs around the house, seem like they hit you all at once. A GCFI plug that won’t stop popping. The house shifts and the front door won’t latch. The sink handle breaks a bit an the hot water won’t run. </p>\n\n<p>No one plans for this stuff. </p>\n\n<p>But one thing we felt joy about was Bobby losing his tooth. The wonder and excitement of telling him about the Tooth Fairy. His eyes light up and you get a reprieve from the realities of today and tomorrow. </p>\n\n<p>That next morning Bobby woke up with two dollars under his pillow.  The reprieve lasted into tomorrow. It just fills your heart with joy before you put on you Verizon shirt and put in 8 hrs. Well 8 today, but under the weekly amount so Verizon isn’t legally obligated to provide health care. </p>\n\n<p>You knew that when Bobby left for school, his day will be filled telling all of his friends about the ethereal atm machine. He was so excited he got two dollars. That’s more than he sees in the year. And he’s really starting to understand the value. Gone are the days I could trade him a quarter for a penny. </p>\n\n<p>Some days customers wear on you. Somehow you are Mr. Verizon. Like you write these policies or somehow a phone should be covered even if they have no insurance on it. </p>\n\n<p>I came home just brooding. On the way home you may fantasize about telling a customer off, or like most days, I run through scenarios where customers just lay into you and Lance, your manager, throws it back on you. Fuck you Lance. </p>\n\n<p>I came in keyed up from work and a perfect storm of bills and doors not closing and my wife hitting her limit...how is it the people we are supposed to trust can make it feel like we’re strangers....</p>\n\n<p>And Bobby bouncing around. Recounting his story of his tooth and the reactions from his friends. I guess I resent him for his happiness. His innocence. But I held it in. It’s not his fault. But he is both a blessing and a reminder that I will have to disappoint him. </p>\n\n<p>So my wife an I fought after he went to bed. We try to keep it quiet, but it usually wakes him up. As usual it was about money. It wasn’t until I heard him quietly sobbing in the bathroom - of all places - that I knew we had woke him again. </p>\n\n<p>He never cries. He just worries and tells us it will all work out. He’s such a strong boy. </p>\n\n<p>I open the door and see crimson all over the marble vanity and in the sink. I see my pliers on the vanity and Bobby is sitting up on the counter craning towards the mirror. The blood was from his mouth. </p>\n\n<p>It hit me before my eyes settled on the pile of teeth. Through the lisp and tears he spoke: </p>\n\n<p>“How much will the tooth fairy give us Daddy?  There’s seven teeth but I’m working on my number eight.”  </p>\n</div>\n","author":"anonoman925"}