{"rank":"679","title":"I Hate Collecting Bodies from the Woods","id":"8ka5l4","url":"/r/nosleep/comments/8ka5l4/i_hate_collecting_bodies_from_the_woods/","time":"1526613834000","body":"<div class=\"md\"><p>If ever there was a<a href=\"https://old.reddit.com/r/nosleep/comments/8fp44u/accounts_from_a_lonely_broadcast_station_part_1/\"> terrible place to live,</a> this village between the mountains has to rank as one of the absolute worst. I’ve been here working on the police force for years now, and believe me when I say that I wish I could leave. It’s not so easy. Just like a plague, this town’s weird, rotten energy has to be contained, and it takes all of us to do so.</p>\n\n<p>And that’s the only reason I’m saying anything: to keep everyone else away. I won’t tell you the exact location of the town, but I’ll tell you how to recognize that you’ve found yourself near it. You’ll be traveling in the mountains, through winding paths with lots of trees. There won’t be a building for miles and your radio might not work so well. But at one point or another, you may hear a little crackle if you tune into a specific channel. 104.6 FM is the only radio station you can get in this area, and you may want to listen in while you’re driving by in case the situation is more <em>urgent</em> than you think. However, if all you hear is some crackling music and the voices of either of our two bickering announcers, the next thing you’ll see on your journey is a tiny rest stop with only one gas pump.</p>\n\n<p>You can stop and top off your tank if you like, but don’t bother going inside for anything other than to drop off a handful of cash. There’s almost never anyone there, and when there is, they won’t help you any. The plumbing doesn’t work, the old man at the desk will just tell you to piss in the woods, and all of the food on the shelves is probably teeming with some kind of fungus. At this point, you’ll want to get back in your car, make sure you have enough fuel for the trip, and go back in whichever direction you came from.</p>\n\n<p>I knew this area was bad news a long time ago, but it wasn’t until I recently started working <em>forest duty</em> that I knew just how much I hated it. Things just aren’t normal out there. Everyone who considers themselves a local knows this, but they don’t all know why. All they know for sure are these three things:</p>\n\n<ol>\n<li>Going into the woods, no matter the time of day, is a bad idea.</li>\n<li>When something weird happens, you learn to turn your head and don’t ask questions.</li>\n<li>Always listen for the emergency fog broadcast. By the time you see it with your own two eyes, it’ll be too late.</li>\n</ol>\n\n<p>What I’m about to say is going to sound like the ramblings of a madman, but I’m telling you exactly what was told to me when I joined the force. Where the old watchtower sits, at the point where the village ends and the mountainous forests begin, the treeline is a barrier between a vicious, feral world and our own.</p>\n\n<p>The forest is alive. Like some sort of twisted miracle, anything dead that touches the soil, the grass, or the bark of the trees becomes a part of a grotesque collection. It sounds like some zombie apocalypse story, but I assure you it’s not. Nothing in there <em>feeds</em> off of flesh or blood or any of that. A colleague of mine once told me, ‘They just want to <strong>grow’</strong>.  Some have called us in hysterics to report animals lumbering towards them with mismatched human features and vice versa. Others have reported something more terrifying.</p>\n\n<p>I believe one of the emergency broadcasters at the watchtower - I think her name starts with an E, but the police chief calls her … ‘<em>Twenty Eight’ -</em> saw this thing we all dread the most. It’s old, but it’s not some god or deity or ruler of the forest. It’s simply the strongest, amassing more parts and more weight than any of the rest. Few have seen more than a giant antler through the trees or a glimpse of a long, thin claw, but we know it’s out there. I’d like to tell you that we’re looking for a way to bring it down before it collects even more, but for now, the most we can do is control the* swar*m. If you haven&#39;t already guessed, our local radio station is more of a defense than a means of entertainment.</p>\n\n<p>I’ll tell you my name if it means anything. It’s Finn. Officer Finn. I’ll leave it up to your imagination whether that’s my first or my last name. Not long ago, I accompanied a fellow police officer on the search for a missing woman after her severed fingers were found at the watchtower outside the village, and that was the beginning of my experience with dreaded ‘forest duty’.</p>\n\n<p>Instead of boring you with all the details of countless unbelievable anecdotes, I’ll give you a short run-down of the strangest cases myself and my colleagues have handled in the last few months alone.</p>\n\n<blockquote>\n<p><strong>January</strong>. White male, mid-forties, called to tell us that his aging, senile mother was trying to coax animals from the woods into her home because she mistook them for her late husband. Upon a quick inspection of an old burial plot near the woods, her husband’s remains had been dug up and have still not been recovered. The ground was still frozen and no shovel marks were seen.  </p>\n\n<p><strong>February</strong>. Black female, 16 years old. Called the police after saying a man with roots where his face should have been was trying to lure her into the woods. When asked what he said, she told us, ‘He didn’t say anything. The roots took over his mouth. But I <em>felt</em> him asking me to follow.’ Oddly, her story lines up with at least eleven reports from the last three years, all of them from children and teens.  </p>\n\n<p><strong>March</strong>. White female, mid-twenties, supposedly attempts suicide in a bathtub. After being resuscitated, she slurred something about her father’s voice being stolen by a mountain lion. Later, when questioned, she denied remembering a single thing that she said and claimed she had never attempted to drown herself at all. Blood alcohol levels were suspiciously high.  </p>\n\n<p><strong>April</strong>. Hispanic male, thirty years old. Both eardrums ruptured violently by a mechanical mishap involving an audio headset while at his workplace. While in recovery, an elderly woman called the police station from an anonymous number to simply say, ‘God gave him what he needed, deaf ears to better see His glory.” Her identity is unknown.  </p>\n\n<p><strong>May</strong>. In the span of one week, four individuals went missing in the exact same location. Jennifer Cook, age 25. Pamela and Gordon Richman, ages 48 and 52. Markus Bane, age 27. The only evidence left behind were four of Jennifer’s fingers, one half of Mr. and Mrs. Richman’s corpses, and a box of old, rotten groceries left on the ground where Markus disappeared. None of his remains have been recovered but as you can imagine, no one expects to find him alive.</p>\n</blockquote>\n\n<p>So, I had said I was working on a case of a missing woman. That missing woman was Jennifer Cook. For the first few hours, we were looking for her in one piece, and after that, we started looking for her body instead. Unfortunately, it still hasn’t been found, though it has been <em>seen,</em> which tells us that there’s little hope in recovering her as she used to be.</p>\n\n<p>My fellow officer, whom I will call Nancy for the time being, was extraordinarily <em>gung-ho</em> when it came to uncovering Jennifer’s whereabouts. She was new, even more fresh than I was, but had been transferred after over a decade of duty on the other side of the state. I think this is the reason why she was so dedicated to considering this a murder case and not a recovery mission instead. She had yet to really understand how little this place follows the rules of what we would consider ‘normal’.</p>\n\n<p>“I always get light-headed out here. I hate the mountains.” I complained as we marched up through the tree-covered hills, a K9 on alert walking in front of us.</p>\n\n<p>“Right,” Nancy agreed with me. “Almost like you can’t tell if you’re going up or down sometimes. It’s no wonder people get lost out here and end up not finding their way back.”</p>\n\n<p>She didn’t know the half of it.</p>\n\n<p>“Doesn’t explain how Jennifer ended up shoved in a tree though.” Nancy had a heavy, furrowed brow as she continued. She didn’t need to show that kind of angry intimidation just talking to me, but I’ve started to work out that it might just be her face. “I think it’s weird, that’s all. Out here, away from the town where we’re told to encourage people to stay away … it’s like someone’s hiding something out here.”</p>\n\n<p>“What do you think they’re hiding?” I asked, genuinely curious.</p>\n\n<p>“I don’t know, Finn.” She shrugged, eyes peering up to scan the trees around us. It was too silent, not even a single bird chirp to be heard. “But someone’s out here killing people and no one seems interested in hunting them down.”</p>\n\n<p>She had a hoarse, dry whisper as she narrowed her eyes, and I regret to admit that I almost laughed. I was reminded so much of the old sheriffs from western movies, always ready to draw both pistols in preparation for some scoundrel sneaking up on them. I wasn’t about to tell a fellow officer, especially not one with years more experience than I had, that she looked a little bit like Yosemite Sam.</p>\n\n<p>“Oh, mother <em>fuck!”</em> We both heard one of the medical personnel shout before we saw anything. Our K9 perked up his ears, but didn’t seem to sense a threat. Rather, we found ourselves pulled further into the bushes, where sets of footprints added to what appeared to be an already pushed-down path of flattened twigs and grass. It looked like something had been dragged, and once we could see what the others had seen, we had a good clue of what had been pulled through there.</p>\n\n<p>At first, it looked like one body. In fact, it was two. A man’s upper half and a woman’s lower half, both of them likely dead for no more than 24 hours at most. As for the other half of them both, well … it appeared they were gone.</p>\n\n<p>We recognized the man’s face. It was Gordon Richman from town, and our only guess was that the other was his wife who had gone missing with him during a heavy bout of fog.</p>\n\n<p>Those goddamn broadcast employees not doing their job…</p>\n\n<p>&quot;Shit. Where&#39;s the rest of them?&quot; I looked over at Nancy, who seemed bothered but not nearly as disturbed by the revelation as I was. Either the couple had been partially devoured or the forest was getting smart by splitting up the pieces, making it harder for us to find them.</p>\n\n<p>Nancy shook her head, disgusted. &quot;I told you, didn&#39;t I? Some sick fuck is out here, just playing with us.&quot;</p>\n\n<p>“Oh, <em>god,</em> it reeks out here.” One of the paramedics had to cover his face with his sleeve. It was pretty bad when someone who routinely worked with all the terrible smells the human body could create was sickened standing ten feet away from the source. But I had to agree. From where I stood, the bodies smelled as if they had been rotting for weeks, covered in mold, and stuffed with hot garbage that had been soaked in pig waste. It was that bad.</p>\n\n<p>We took photos of the scene, including shots of the surrounding area for any reference of broken branches or additional evidence. Not far from the bodies, Nancy happened upon a cell phone sitting at the foot of a tree, and in the process, we found another source of that terrible smell. The tree was dripping with what looked like sap against the dark-colored bark, but we were so wrong about that. It was blood. Dark, thick blood practically rolled out of the tree from a hole in the bark’s center, as if it had been filled to capacity and was forming a puddle in the grass beneath.</p>\n\n<p>“What the hell <em>is</em> that?” She squinted at the tree, gloved hands holding the cell phone carefully before she inspected the screen. “There’s something wrong with that tree. But first, we’ve got another problem here.”</p>\n\n<p>“What’s the problem?” I asked, and she turned the cell phone towards me to show the last message on the screen. Missed calls from the same person, and it was a name we both recognized: Evelyn. That&#39;s right, that&#39;s what her name was. That was Twenty Eight up at the broadcast tower. We’d have to run the phone number later, but in a village of only a few hundred people, it wasn’t difficult to make an assumption here.</p>\n\n<p>It <em>was</em> a problem, but not for the reason Nancy thought. You see, she was suspicious almost immediately that the radio employee had something to do with this, seeing as the two working at the outpost had constant access to the surrounding forested area. Me, however? I was more worried that it meant our new broadcasters had been snooping around in the woods. We really could not afford to lose two more after losing twenty-seven already, even if these two are a couple of incompetent slackers...</p>\n\n<p>Before we could continue the conversation of what to do with that information, I heard another sound of disgust from one of the paramedics. The two of them had been attempting to move the male’s upper body onto a cloth hammock for transportation, but couldn’t get him off the ground. Nancy and I abandoned the still-bleeding tree to see what was holding him down, but it was more unnerving and grotesque than we could have imagined.</p>\n\n<p>They only managed to pull him a half-foot off the ground before dropping him onto his side, where we saw that his body was being <em>invaded</em> by the roots underneath him. They were growing straight through his chest cavity, wrapping around all of his insides and keeping him stuck to the ground until a heavy tug jarred him partially loose. The smell that hit the air was almost too much for any of us, and I had to stagger away to keep from losing my breakfast. I felt my mouth water but choked back the urge to vomit.</p>\n\n<p>“It looks like something’s growing through h-h-<em>huhr…”</em> One of the paramedics gagged, turning her back but unable to escape the smell. I covered my nose and mouth with my sleeve and crouched down, happy that I was wearing gloves as I took a closer look. Nancy was right beside me, and what we saw next may have been her true initiation into our little branch of ‘Crazytown Police Force’.</p>\n\n<p>Gordon’s body, dead and drained of his blood, suddenly moved in a series of twitches as an unearthly groan left his mouth. When he parted his lips, stretching his jaw wide, we could see the twists and curls of branches moving around inside of his throat. They were wiggling on the ground as well, as if inching further into his torso to take a tighter grip. All at once, the roots pulled on him and jammed him back flat against the ground where he was before, sinking deeper into the soil as if planting him back in place. His eyes were opened and wide, white with blue veins pale on the surface, as he made one last agonizing croak.</p>\n\n<p>We would have thought his body was making some sort of automatic response, like the breath some morticians report from corpses releasing gas from the lungs. Only, that didn’t explain his next trick. He blinked his eyes and they rolled back forward, faded irises moving from side to side before they focused directly on everyone one at a time. He looked at me, then he looked at Nancy, and then he --</p>\n\n<p>BLAM!</p>\n\n<p>Before Gordon’s corpse could make another sound, Nancy had pulled her gun from its holster and shot him straight between the eyes at point blank. It was a panic response, but still - we would be getting in a world of trouble for this regardless.</p>\n\n<p>“Did you have to do that?!” I shouted at her, as if her split-second response ignited my own moment of panic. One of the paramedics was clutching his chest, the other simply looked happy to be standing further away. “You fucked up his face!”</p>\n\n<p>“As if it wasn’t already?!” Nancy no longer sounded assertive or full of aggression. She just sounded confused, scared, trying to put herself back together. “What the <em>hell</em> did we just see?”</p>\n\n<p>While she was catching her breath, probably trying to figure out what she had just seen with her own two eyes, I dug around for a pocket knife to pass to one of the paramedics. They were putting him on the sling, so they could be the ones to cut him out of those roots. I tried to distance myself while they did, in part because of the smell and in part because the roots <em>screamed</em> as they were cut.</p>\n\n<p>We were about to leave, taking our evidence back with a plan to have a few words with the broadcast worker who had shown up on Jennifer’s abandoned cell phone. Before we had the chance, however, our K9 suddenly began to make the most low, guttural growling noise I had heard from him. I felt a tug on his leash and saw him pointing his nose off towards a thick patch of trees and bushes, seemingly looking at nothing. All of the hair on his back bristed and he bared his teeth at the dark space underneath the pines.</p>\n\n<p>I swore, for a split second there, I may have heard something growl back. That, and the momentary glimmer of something shining between the sparsely visible spot between branches. A pair of eyes … no, not a pair. A <em>trio</em> at least. The dog tucked his tail and backed up, and that’s when we knew it was time for us to leave.</p>\n\n<p>I won’t bother trying to speculate what our K9 saw that we didn’t see. The reason for that is, it could have been <em>anything.</em> In my time here, I’ve learned two very distinct things working on the force:</p>\n\n<p>You never know what you might come across, and you’ll never, <em>ever</em> be prepared for it.</p>\n\n<p>The case of Jennifer Cook is still open, or at least, that’s what we’re telling her family for now. As far as we’re concerned, she’s been added to the endless list of anomalies in the forest that have to be contained. In the meantime, I’ve been trying to get hold of that guy up in the radio tower - Dan … whatever his last name is. They’ll need someone to take over their supply deliveries and as you can imagine, none of the teens working at the local grocery are stupid enough to volunteer. If Dan won’t come out himself to get their shit, Nancy and I may be pulling straws to see who gets put on <em>long-term</em> forest duty.</p>\n\n<p>All I can really say for now is that this place is unnatural. It’s a mess of impossible things made possible, but none of the things we’d like to see. It’s a nightmare on its worst days and radiates unease on its best.</p>\n\n<p>So if you’re driving by on a mountain pass, looking for something to listen to, and you catch the crackling of 104.6 … I suggest you don’t go any further.</p>\n\n<p>We don’t need the woods to grow any more.</p>\n</div>\n","author":"wendingus"}