{"rank":"38","title":"Cold Feet","id":"8ka6zq","url":"/r/nosleep/comments/8ka6zq/cold_feet/","time":"1526614237000","body":"<div class=\"md\"><p>When I was 25, I got engaged.</p>\n\n<p>I met my fiance, let&#39;s call her E (to protect her identity), in our first year of college together. We met at freshman orientation and happened to live in the same floor; needless to say, it was kind of an instant attraction kind of thing. Fate. We started going out midway through the semester; we kind of kept it a secret from the rest of the floor, E was pretty shy at that time. It was really endearing, one of the reasons why I fell in love with her so quickly. </p>\n\n<p>We broke up once in our 8 year relationship, it was right after graduation and I had gotten a job out of state. We tried the long distance thing, but like most people will tell you, it was hard; on both of us. I got busy at my job, and E moved forward with her own career as a teacher; all in all, we just didn&#39;t have the time for each other anymore. I briefly dated another girl, A, who was the receptionist at my office. She was sweet, like E, but after a few months of dating I could tell that was something rotten underneath. I once told a story about E to her, and she absolutely freaked out-- like, the story was about the time a horse bit me! Not even related to my relationship with E, and just the mention of her was enough to throw everything into chaos. </p>\n\n<p>About 3 months into dating A, we broke up. She didn&#39;t take it well-- and my unhappiness just grew exponentially. I was miserable, and I just couldn&#39;t bring myself to admit it-- I missed my family, my home, and most of all, E. I hadn&#39;t forgotten her, not once. I was afraid to go back and find out that she&#39;d moved on, that she&#39;d found the fairytale ending she&#39;d always wanted-- without me. </p>\n\n<p>After months of dread, I quit my job and moved back home. It felt right to come back, like I was really meant to be here. I found a job relatively quickly, an advising position at a small firm; it didn&#39;t bring the cash in like my other job did, but I also wasn&#39;t constantly hating myself so that was a plus. I got back into contact with all my friends and family, slowly getting back into the swing of things and getting caught up with all important milestones in their lives that I&#39;d missed out on. </p>\n\n<p>To answer your question, no, I didn&#39;t see E right away. I was scared. I hadn&#39;t seen in her in almost 2 years, not spoken to her in 1. The break-up left a lot to be missed, we didn&#39;t really get any closure from each other. My friends and family knew not to talk about her, she was like the Voldemort to my Harry-- a piece of her was always going to be with me, no matter what I did. </p>\n\n<p>A couple months into my return, I got a message request from someone on social media; it was E. She had heard I came back and had asked me when I had, and we briefly talked about my return prior. She mentioned that she lived in the next town over. I mustered up my courage, and asked her to get coffee with me. She surprisingly agreed, and we picked a date later that week.</p>\n\n<p>When the day came, I was so nervous I wanted to die. I tried to rationalize it, but honestly, my worst fear was seeing her walk up to me and a big, shiny ring wrapped around her perfect, dainty ring finger. When I got to the cafe, I saw her. </p>\n\n<p>She was sitting at a small table scrolling on her phone. God, she was so beautiful. She hadn&#39;t changed one bit. This sounds so cheesy, but as I walked towards her, I swear life was going in slow-motion. I don&#39;t even remember sitting down, but when I did, she looked up and her face lit up like a million Christmas lights. </p>\n\n<p>&quot;Hi, E.&quot; I said curtly, and I knew I was smiling so hard my face could split half. </p>\n\n<p>&quot;Hiya, stranger.&quot; She replied, smiling with as much fervour. </p>\n\n<p>We talked for hours. It&#39;s as if the years and distance had never come between us, and it was just me and her again, sitting in her dorm room, talking until the sun came up. A barista came by when the cafe began to close, and we looked at each other shock. The whole day had gone by like nothing, and we were both happy it did.</p>\n\n<p>&quot;Can I see you again?&quot; I asked, as I put on my coat.</p>\n\n<p>&quot;You always can.&quot; She responded, putting her hand over mine and squeezing gently. </p>\n\n<p>No ring. </p>\n\n<p>After a year of carefully picking up where we left off, E and I finally mended our relationship. Everything came back together like it was supposed to, and we even talked about the other people we dated in the time we were apart. I told E about A, and she teased me about my lapse in judgement. </p>\n\n<p>Flash forward to our engagement. To be honest with you, it was all cupcakes and butterflies up until 2 months before our wedding. E started acting weird, like, really weird. She would come home from work and every single day, she would close the door and instantly look out the window, as if she knew someone had been following her. I would ask her what was wrong, and she would brush me off. When I worked late nights at the firm to hit my deadlines, she would beg me to come home. She called me once, crying and hysterical, and I never stayed late after that. I couldn&#39;t figure out what was wrong and she wouldn&#39;t tell me-- it was starting to drive a wedge between us. </p>\n\n<p>I started to get worried, I didn&#39;t know what was happening to her and our wedding was only a short ways away. She began to drop weight and lose patches of her hair due to the stress she was experiencing, and she refused to go to a doctor to get help. </p>\n\n<p>I talked to my mother, and she said to me what nullified my growing doubts, &quot;If you didn&#39;t really want to be with her, you wouldn&#39;t have come back all this way, would you?&quot; I chalked up E&#39;s odd behaviour to pre-wedding jitters. </p>\n\n<p>When the day of our wedding came, I woke up that morning to E soundly asleep beside me. In the warmth of the morning light, I looked at her with my heart full and zero doubts. She stirred and looked up at me, and upon recognizing me, she smiled.</p>\n\n<p>This was the E that I loved. My E. </p>\n\n<p>We separated ways that morning to get ready; E went off with her girlfriends to a hotel room and my boys and I got ready at the house. Midway through the day, it became evident that my bowtie was missing; we searched all over the house and couldn&#39;t locate it anywhere. In a last ditch effort to find the evading piece of decorative fabric, I went into the house&#39;s attic.</p>\n\n<p>We didn&#39;t really store anything in the attic, save for seasonal decor and some stuff that we just didn&#39;t have space for from our previous places. I began rummaging through the dusty stacks and boxes in the small space, before coming upon what happened to be a small chest. </p>\n\n<p>It definitely wasn&#39;t mine, nor did I remember E ever bringing it into the house. It was buried under stacks of old magazines and linens, so it sat pristine and dustless when I uncovered it. It was brown leather all around and immaculately cared for. I opened up the chest and was greeted by, at first, what seemed to be stacks of photos. I picked them up and saw they were photos of me and E from college, and other physical mementos of our relationship. Photos, CDs, even fake flowers that I had gotten her on our first year anniversary in college. She even had photos of me from after our break up, which I thought was a little weird, but she might&#39;ve acquired through friends and family.</p>\n\n<p>For a moment, I thought it was fate that I came upon this chest today of all days.</p>\n\n<p>I dug deeper and deeper, looking through photos and memories until I hit the bottom of the chest. There was a layer of paper over the bottom of the chest, almost in a weak attempt to hide the rest of the contents. It was taped to the sides of the walls, and out of my curiosity I carefully peeled them off, wondering what kind of other treasures E had kept all these years. </p>\n\n<p>The first item I picked up was a faded ziploc bag, it was so old that the plastic had turned into a faded yellow colour and I couldn&#39;t clearly see inside of it. I held it up to light from the nearby window and leaned in to examine it.</p>\n\n<p>My eyes widened when I realized what it was.</p>\n\n<p>It was hair. </p>\n\n<p>I put the ziploc bag down and picked up another one, held it up to the light and I began to feel sick.</p>\n\n<p>It was teeth. The corner had a faded label, and in sharpie it was written, &#39;molars&#39;.</p>\n\n<p>Bag after bag, I found pieces of human remains, all of which were labelled accordingly, and the bottom was lined with cut up photos pieces of E. </p>\n\n<p>Then, the final item, was a small, clouded and sealed jar. It fit in my hands but was about a 2L container; it had a small label that read &#39;size 6, both&#39;. My hands shaking, I held it up to light and saw two, small preserved set of feet. </p>\n\n<p>Then I realized what these all were; they were physical identifiers. As the jar fell from my hands and hit the bottom of chest with thud, I heard: </p>\n\n<p>&quot;Babe? I have your tie.&quot; </p>\n</div>\n","author":"notlmorit"}