{"rank":"14","title":"Who is she?","id":"8ka9x3","url":"/r/nosleep/comments/8ka9x3/who_is_she/","time":"1526615111000","body":"<div class=\"md\"><p>It all began with a kiss. Literally.</p>\n\n<p>when I was 15 and in high school, I went to a close friends house party. There was about 50 people there, all drunk out of their minds, doing vodka shots and drinking coolers (which their older siblings bought them). I, on the other hand, went with everclear. I wanted to get loaded hard and fast.</p>\n\n<p>We were in the basement when a game of truth or dare broke out. A few rounds went by when this girl joined our party and immediately she was dared to kiss me. My crush was at the party so I thought that would impress him and I was 2 shots in so why not?</p>\n\n<p>We kissed. I pulled back but she pressed harder. After it was done, I left the room, downed 4 more shots and had a great time (or so I was told).</p>\n\n<p>Things seemed normal after that. The girl I kissed attended the same high school as me but she was a year older, so we didn&#39;t have any classes together. I didn&#39;t see her until maybe a month after the party, and when I did; I didn&#39;t know what to think.</p>\n\n<p>You see, she had naturally dirty blonde hair. Long, it suited her. I had red hair, on the shorter side with a (awful) side cut. I thought it was cool though. </p>\n\n<p>So when I saw her, walking down the hallway with her hair cut to my length, dyed red, and a side cut on the same side, I was pretty taken back. Not only that but her ears were beginning to stretch (mine were significantly) and her nosed was pierced with a ring (which, as you can probably guess, I had as well). </p>\n\n<p>We never talked after that. But she did become friends with my friends. I was never there when she was, or vice versa. That continued until she graduated the next year.</p>\n\n<p>I finished high school and embraced being 18 by getting multiple piercings (more than I should of) and a few tattoos (one of which I now regret with age). Instagram was big so obviously I wanted people to &#39;like&#39; my alternative style. Eventually I realized how awful I looked with 20 piercings on my face and pulled them all out, except for my nose and ears. It was around that time I stumbled onto her page.</p>\n\n<p>She was following me on Instagram, but I guess I never noticed, which was weird to me because I only had around 200 followers.</p>\n\n<p>I brushed it off and went to her page only to see that she was still rocking a nose ring, and stretched ears, but in her older pictures, she had the exact same piercings as me. What really freaked me out, and tipped me off that something was wrong, was that she had so many pictures on her Instagram that looked so much like mine. That places and poses were the exact same, but they were all posted a week after mine had gone up. If I had a picture of myself eating ice cream leaning up against a tree at dawn, she had the exact same photo posted, but with her instead of me.</p>\n\n<p>At this point, I became very, very uncomfortable. I asked my friends about it but they said I was incredibly self-centered to think she was copying me at all. </p>\n\n<p>It&#39;s been a while since I&#39;ve even thought about her. I was able to push everything that happened to the back of my mind and enjoy life until now. I&#39;ve just gotten back from a trip only to find her working at my work place, the same position as myself, wearing the exact same outfit from my last social media update, right done to how I had my hair done. </p>\n\n<p>Please please tell me I&#39;m not going crazy. Or that I am because I&#39;m really starting to get worried for my safety. Is it innocent or is she stalking me? or worse, is she trying to become me and take my place?</p>\n</div>\n","author":"Comishia"}