{"rank":"9","title":"L€G!0N","id":"8kafk6","url":"/r/nosleep/comments/8kafk6/lg0n/","time":"1526616791000","body":"<div class=\"md\"><p>It was around midnight when I got a call from a government number, telling that my brother Jared had been seriously injured in a car accident and since I was the only family in town, I needed to be there for him. </p>\n\n<p>Oddly enough he wasn’t in the main hospital, he was in a smaller one a little further in a rural area. I’ve passed the place on a few occasions, but never really seen the point of it, considering it was smaller and didn’t offer anything further than the main hospital.</p>\n\n<p>As soon as I showed up I was escorted to a room, where the bed the injured patient would normally be in was rolled out, a doctor informed me that they had to take Jared into another room for surgery. </p>\n\n<p>I quickly got nervous for my brother, I didn’t realize it was so serious that he was receiving surgery already. Regardless, at least he’s alive, so I can do nothing but wait and pray. </p>\n\n<p>As I’m sitting there, I suddenly feel a rumble in my pocket. I take my phone out to discover I had received a text from a number that wasn’t registered on my phone.</p>\n\n<p>“I’m on my way.”</p>\n\n<p>I instantly got a chill up my spine, but opened my phone to check. This was probably just a relative of ours that I hadn’t bothered to give a contact, and they were just coming to check on Jared. </p>\n\n<p>Nope. No text history. This person just decided to text me for no reason. Perhaps a wrong number or mistake, I put my phone away. </p>\n\n<p>As soon as my phone gets near my pocket, I receive another message. </p>\n\n<p>“Wait up for me. Don’t leave before I get there, Angelina.” </p>\n\n<p>Just the fact that this mystery person knew my name made me so uncomfortable, I scramble to write a message back. </p>\n\n<p>“Who are you? If you don’t know me please don’t do this today, my brother just got into a car crash.”</p>\n\n<p>Another instant reply. A photo accompanied with the message “just a car crash?”</p>\n\n<p>The picture was of a car which was definitely totaled, and I could see my half conscious brother sitting in the front seat. But the rest of the scene made no sense.</p>\n\n<p>The hood of the car was on fire and the car was surrounded by a small crater, a low purple light shining out from under the front tires. </p>\n\n<p>It looked so real but at the same time it made no sense, I think they would tell me if my brother got struck by a fucking missile. </p>\n\n<p>I stand up and decide to try and talk with the doctor from earlier, but I get stopped dead in my tracks by another message.</p>\n\n<p>“No no no. Don’t leave. We’re coming Angelina, there is no need to be afraid.” </p>\n\n<p>This time I could actually hear a voice speaking as I read the message, a glitchy and distorted voice that plagued the back of my head with static. </p>\n\n<p>I sat down in the back corner of the room and curled up with panic. My phone begins to ring, but it’s no longer from an unknown number, it’s from a contact labeled “L€G!0N”.   </p>\n\n<p>Before I even have the chance to refuse, my phone accepts the call.</p>\n\n<p>“You haven’t left have you? No, I can still smell you. You’re here.”</p>\n\n<p>The same distorted voice from earlier. Every word sounds like it was spoken by a different person. </p>\n\n<p>“I just have some things in the way, don’t worry Angelina, you’re safe.” </p>\n\n<p>Suddenly a large crash played through the phone, just when a clatter of something falling came in from the hall outside, accompanied by screaming and yelling. </p>\n\n<p>I reach down and silently turn off my phone and put it on airplane mode, tears running down my face. This wasn’t happening. </p>\n\n<p>There were some more screams, followed by a loud thump as something crashed against the door of the room. Blood leaked out from under the doorframe. </p>\n\n<p>I sat there in silence for a few seconds, until a new set of words emanates out from my phone, despite it being on airplane mode. </p>\n\n<p>“I’m here.” </p>\n\n<p>The door slowly creaks open, and it takes all my will to not scream at the monstrosity that started creeping in. It’s long arms and legs resembled a spider, slowly creeping further into the room. It had long, sharp fingers and a large jaw filled with teeth so deadly I could drop dead just looking at them.</p>\n\n<p>The creature was shrouded in darkness and it’s veins were glowing with a faint purple light. I could see a tag on the creature’s wrist, labeled “Jared Williams”</p>\n\n<p>It’s mouth moves in synchronization with the sounds coming from my phone.</p>\n\n<p>“Did you wait up?” </p>\n</div>\n","author":"Vulcan1010101"}