{"rank":"8247","title":"I found an extremely bizarre internet survey","id":"8kalgj","url":"/r/nosleep/comments/8kalgj/i_found_an_extremely_bizarre_internet_survey/","time":"1526618735000","body":"<div class=\"md\"><p>Nobody knows what rock bottom truly is until they&#39;ve hit it. </p>\n\n<p>Being abruptly fired from a job you&#39;ve worked at for the past ten years, and then catching your girl cheating on you with your replacement really makes a man think. </p>\n\n<p>Hell, <em>my student loans aren&#39;t even paid off yet</em>.</p>\n\n<p>What a shitshow this life is. </p>\n\n<p>After a rather boozy night that consisted of sending out about four dozen resumes and horrendously written cover letters, I passed out. </p>\n\n<p>When I woke up the next morning, I decided to at least <em>try</em> and make some money at home while waiting for an interview. </p>\n\n<p>At that moment, I thought that the best way to go about it was completing those internet surveys that yielded 5 dollar subway gift cards and other shit like that after about an hour of answering questions. I mean, I didn&#39;t have any other marketable skills that could&#39;ve yielded immediate income. </p>\n\n<p>It was either that or wasting the day away playing computer games. At least I wouldn&#39;t have to pay for food. </p>\n\n<p>I did these surveys for about 5 hours before nearly passing out. It was way more excruciating then I&#39;d originally anticipated. At the end of those 5 hours, I&#39;d accumulated about $45 in cash and gift cards. </p>\n\n<p>$9 an hour. Not like I was making much more than that before. I was about to close my laptop up for the day and head to a bar in an attempt drown out my melancholy when I first saw it. </p>\n\n<p>It shouldn&#39;t even have been noticeable... but for one reason or another, it was. At the bottom corner of the website that I was on, existed a tiny, singular advertisement. Maybe it was the simplicity that got me. Plain black letters in a tacky font that read &quot;Surveys for cash&quot; overlapped a completely white background. </p>\n\n<p>At least they were direct with the message. <em>One more couldn&#39;t hurt</em>, I thought. Might as well scrape together a little bit more booze money before heading out.  </p>\n\n<p>I sat back down, clicked on the picture link and prepared myself to grind through some more painstaking inquires. The first few questions were simple enough. I guess they weren&#39;t really questions, but more data collection. My name, age and occupation. I thought it was kind of weird that they also asked my height and weight, but it wasn&#39;t unheard of. </p>\n\n<p>The first <strong>real</strong> question was a different story though. I must have stared at it, eyes wide and mouth agape, for god knows how long. </p>\n\n<p><em>What the actual hell?</em></p>\n\n<p>In plain English, this is what popped up on my screen: &quot;How strong is your urge to currently look behind you?&quot; </p>\n\n<p>There were five options below, ranging from &quot;Not at all&quot; to &quot;overwhelming&quot;. </p>\n\n<p>There was no feasible reason why I should&#39;ve been afraid at that moment. <em>But I was</em>. I tightened my breathing, trying to make out any subtle noises behind me. There were none. After maybe about five minutes, I worked up the courage to look. There was nothing. I sighed in relief and scoffed at myself at the same time. </p>\n\n<p>This must have been some kind of joke. However, I decided to entertain it, answering &quot;neutral&quot; and clicking onto the next question. This is what it read: &quot;Why would you look behind you?&quot; </p>\n\n<p>I smirked. <em>Funny</em>, before simply typing in a &quot;I don&#39;t know&quot; in the response box and once again clicking next. This was the 3rd question: &quot;You&#39;re on a plane. Apart from you, there is only one other passenger, who is sitting somewhere behind you. At some point, you get up to go to the washroom, and find that the man is gone. You check to see if he is in the only bathroom on the plane, but he isn&#39;t. What do you do?&quot;</p>\n\n<p>Again, I must have stupidly stared at it for nearly ten minutes. Was this some kind of obscure personality test? I mean, it must have been, right? <em>Right?</em> </p>\n\n<p>I put the same answer that I used for the last question: &quot;I don&#39;t know.&quot; It was true. I didn&#39;t know. How was I <em>supposed to</em> answer this shit? </p>\n\n<p>I click next again, now more intrigued than anything. The 4th question went like this: &quot;You wake up in woods unfamiliar to you. It&#39;s nighttime, and the moonlight provides you with only slight visibility. About thirty feet away from you, there is a small, dimly illuminated cabin. The door is open, and a smiling woman is motioning for you to come in. Do you go? Explain why.&quot; </p>\n\n<p>This question wasn&#39;t necessarily weirder than the last one, so my conjecture that this was some kind of odd personality test was still feasible. I actually make an attempt to answer this one, something along the lines of going into the cabin because there&#39;s simply nowhere else to go. </p>\n\n<p>Once again, I click next. Probably shouldn&#39;t have. </p>\n\n<p>The questions started getting <em>fucked up</em>. They weren&#39;t too gory or explicit, not anything like that. They were just stranger. Weirder. More psychologically disturbing. If you&#39;re wondering why the hell I kept going, I can&#39;t really give you an explicit answer to that. I just felt like I <em>had to</em>. It was an esoteric, creeping sensation that I can&#39;t quite explain away. But I could never shake it. So I just went on. </p>\n\n<p>Some of the questions that stood out were:</p>\n\n<p>&quot;Suppose that you wake up one night to find an elevator in your house. During every midnight after that, it opens up for five minutes, revealing an exact copy of yourself that gets progressively more injured as time goes on. Do you keep living like this? Or do you enter the elevator once and end it all?&quot;</p>\n\n<p>And:</p>\n\n<p>&quot;You&#39;re in a hotel room but are awoken by a rapid knocking at your window. You peek through the blinds, seeing what appears to be a man missing both his eyes. He puts his mouth to the glass and tells you to kill the woman in the bathroom immediately. Do you listen to him?&quot; </p>\n\n<p>This was one of my least favorites:</p>\n\n<p>&quot;You are watching home videos with your mother. One of the tapes include footage of her being murdered by a masked intruder. Your mother simply laughs at this footage without saying anything. In your opinion, is this a cause for concern?&quot; </p>\n\n<p>In addition to this insanity-inducing shit, there were some rather disconcerting events happening in <em>real life</em> as well. I received a knock at the door about thirty minutes in. I looked through my peephole to find a guy standing there, frantically shaking his head and mouthing &quot;no&quot; while making direct eye contact with me. He looked terrified. Obviously, I didn&#39;t open up. </p>\n\n<p>I received about ten phone calls from somebody named &quot;the auditor&quot; on my caller ID. They left a message every time, but each one was just a recording that consisted of somebody saying numbers through heavy static. Actually, it sounded more like <em>screaming</em> now that I think about it.</p>\n\n<p>About an hour into this thing, and I was on the verge of a mental breakdown. I was petrified of looking behind me, even though there was no indication that anything should&#39;ve been there. I heard some soft scratching coming from my vent at one point, so I moved my couch over it. </p>\n\n<p>Eventually, I reached what appeared to be the end of the survey. However, it wasn&#39;t a question. It was simply a statement. </p>\n\n<p>&quot;Don&#39;t let them in. They&#39;re not to be trusted.&quot; </p>\n\n<p>Almost as if it were on cue, I heard more knocking at my door about five seconds after reading this. As slowly and silently as I could, I moved over and looked through the peephole once again. It was a different person than the one I&#39;d seen earlier. She was a woman, looking to be in her mid twenties. She was wearing a thick blazer, despite it being around 90 Fahrenheit outside. She was also wearing sunglasses, so I could never really tell where she was actually looking. She eventually took a piece of paper out of her pocket and slipped it under the door. </p>\n\n<p>I look down and read it. </p>\n\n<p>&quot;It&#39;s lying. Leave your apartment immediately.&quot; </p>\n\n<p>It&#39;s been about half an hour since. I can&#39;t bring myself to look at the computer screen nor at the woman outside. She&#39;s still there. I can see the shadows of her feet from underneath my door. I heard my bedroom window open a few minutes ago, but I&#39;ve since jammed the door shut with a chair. I can hear some kind of distorted muttering coming from behind it now. </p>\n\n<p>Maybe rock bottom wasn&#39;t so bad. </p>\n\n<p><em>But what the fuck am I supposed to do here?</em> </p>\n</div>\n","author":"Mr_Outlaw_"}