{"rank":"1","title":"Mr. Goody Two Shoes","id":"8kam1o","url":"/r/nosleep/comments/8kam1o/mr_goody_two_shoes/","time":"1526618944000","body":"<div class=\"md\"><p>People online like to say I am a bully, they say I just want to feel power over others.</p>\n\n<p>Those people are wrong.</p>\n\n<p>I don&#39;t need to feel power over others, I have power over others. And so do you, regardless if you want to admit it. You could get up right now, and murder someone. And that person would be dead. You could pick up a knife, and stab them over and over, until you are so covered in blood it even stains your black leather shoes!</p>\n\n<p>And the only thing stopping you from doing that is a knife, a pair of black leather shoes, and a dream!</p>\n\n<p>On the flip side, each of us is also powerless. Almost no one that reads would have an easy time from not getting arrested for their killing spree after they painted the floor red.</p>\n\n<p>I am not going to give you a tutorial on how to make that easier, I have nothing but the utmost contempt for criminals, and if you are of such a low level of thinking that you think that someone even half as intelligent as me would supply that information publicly, you might as well already be one.</p>\n\n<p>No, my goal is to <em>practice</em> power, not feel it.</p>\n\n<p>There is a young man I met at a protest. He is so handsome and well spoken, that he is the kind of person that you just <em>know</em> is trying to do good in the world. He is one of those people where they will make it big in politics, because they have such a squeaky clean record. Let&#39;s call this young man, Mr. Goody Two Shoes.</p>\n\n<p>To practice power means to <em>defile</em> someone like Mr. Goody Two Shoes.</p>\n\n<p>I had many dreams of the ways I would end the career of Mr. Goody Two Shoes.</p>\n\n<p>I&#39;ve dreamt of blackmailing him in order to make him send me a video of him killing a small animal then releasing it online. I&#39;ve even dreamt of seducing him and leaking a sex tape. I&#39;ve dreamt of forcing him to dress up like a woman while I put on a strap on and had my way with him. A girl can dream can&#39;t she?</p>\n\n<p>But none of this will truly be the kind of thing which really ends someone like Mr. Goody Two Shoes career.</p>\n\n<p>He thrives of tragedy, he lives of victimhood. Plus, I am no criminal.</p>\n\n<p>I needed to get him to <em>choose</em> to do something bad. Choice is an illusion of course, so I just needed to make him <em>think</em> he chose to do something bad.</p>\n\n<p>But that would be a lot of work.</p>\n\n<p>When I said that I have the utmost contempt for criminals that wasn&#39;t really the full picture. Criminals really are just the people who get caught.</p>\n\n<p>And all I am saying is what I may have done. And it isn&#39;t illegal for me to say that you can&#39;t have a career if you are dead.</p>\n\n<p>And if Mr. Goody Two Shoes corpse is out in the Arizonian dessert, good luck finding it. I say corpse, but I would never bury  someone who was dead.</p>\n\n<p>If you just think that I am bully then what if I told you what Mr. Goody Two Shoes did to me after we met at that protest? Maybe it would make you change your minds? Either way it doesn&#39;t matter now anyhow.</p>\n\n<p>If he is dead, it isn&#39;t like he can deny it.</p>\n\n<p>And maybe that is what power really is.</p>\n</div>\n","author":"AnarachaAnon"}