{"rank":"32","title":"I found a doorway to Hell in my backyard.","id":"8kaq44","url":"/r/nosleep/comments/8kaq44/i_found_a_doorway_to_hell_in_my_backyard/","time":"1526620331000","body":"<div class=\"md\"><p>In 1990, I purchased a run-down single-story house in Salem, Massachusetts.  I had recently graduated from college and I was looking for an exciting place to live and work.  With its rich history stretching back centuries, given my Cultural History major, it seemed the perfect place for me.  I signed the lease, the deed was in my hand, and I was the proud owner of a new, if small, home.</p>\n\n<p>As he handed me the keys, the realtor gave me a strange, piercing stare.  &quot;Mind you don&#39;t do too much poking around, yeah?  Strange things happen to the nosy ones...&quot;</p>\n\n<p>I didn&#39;t really know what to make of that remark, so I said nothing.  After he left, I stared happily around my new home.  It was already painted: the living room was my favorite, its walls a deep burnt-orange.  I liked it enough to not want to change anything.  One less decision for me to make, which was fine by me.  I needed to begin the arduous task of unpacking, anyway, but for now, a mattress on the living room floor would suffice.</p>\n\n<p>It was as I took a walk around the backyard later that afternoon that I noticed it.  A small wooden shack nearly hidden behind the thick trees at the edge of the forest that ran along my property.  Its brown walls were faded, the roof was half caved-in, and it had no windows.  Its door was chained shut.  The realtor hadn&#39;t mentioned it.  Odd.</p>\n\n<p>For some reason, its quite nondescript appearance stuck a foreboding chord in me.</p>\n\n<p>I put the outbuilding out of my mind for now, figuring it was some kind of tool-shed or something.  Over the next several weeks, I unpacked my belongings into my new home and started at the local museum that had hired me as an assistant to the curator.  It was fun, demanding work and I enjoyed my job enough that the strange shack was the last thing on my mind for weeks.</p>\n\n<p>Until Friday night.</p>\n\n<p>I had gotten off work late in the evening on Friday and had then stopped at a bar with friends from work, so it was very late indeed when I finally reached home, probably around midnight.  For some reason, I was drawn to the back deck, my hands gripping the wooden railing, staring restlessly at that small, wooden shack half-hidden in the darkness.  I felt drawn to it, felt a need to open that door and find out what was in this strange little building.  The realtor&#39;s words came back to me, and I pondered their meaning as I strode across the dark lawn with a pair of heavy bolt-cutters.</p>\n\n<p>Standing before the sealed door, I felt a sudden chill that was quite alien in the otherwise warm summer night.  Shivering, I raised the bolt-cutters and broke through the heavy chains on the door.  As I grabbed the doorknob, I jerked it back in shock and pain: the metal was searing hot!  My sense of unease and fright intensified.  Wrapping my hand in my jacket, I quickly turned the burning knob and stepped through the pitch-black doorway.</p>\n\n<p>The door slammed shut behind me, plunging the room beyond into total darkness.  I quickly began to perspire; it was stiflingly hot in the small, cramped space, almost like walking into an oven.  A blast of heat made my eyes water.</p>\n\n<p>I looked up, expecting to see the stars of the clear night sky through the shattered roof...and saw nothing above me, just velvety darkness.  My fear increasing, I became aware of a soft, orange glow in the distance.  In the distance?  I was in a small enclosed room...  Blindly, I stumbled forward, expecting to meet the rear wall of the shack, and was shocked when I hit nothing but empty air.  On shaking legs, I continued my journey, drawn toward that faint glow like an entranced moth to a flashlight.</p>\n\n<p>The floor began to slope downward and I became aware that the floor upon which I was walking was not, in fact, wood, but rough stone.  My shoes scraped along the stone floor as I descended into the passage which seemed to be cut through solid rock.  The orange-red glow grew brighter with every step and soon I found myself in a small chamber.  My footsteps had at some point turned oddly squelchy, as though I was walking through mud, as I bore downward and now, with horror, I saw why.</p>\n\n<p>The chamber I was in was lit with some kind of bio-luminescent light, which came directly from the walls themselves.  The walls, ceiling, and floor of the chamber pulsed and throbbed with sickening movement, and approaching the nearest wall, I saw it was covered in some meat-like substance.  The stench was horrific, like a butcher&#39;s shop on a hot day--that sweet-sour smell of decaying flesh.</p>\n\n<p>Reeling backward, I felt bile rise in my throat.  Willing myself not to vomit, I turned to retrace my steps...and found that my passage had sealed itself, in its place the smooth, glistening meat that covered the wall like fungus.  With trembling fingers, I dared to touch it and found that it was warm...alive and throbbing with a smooth rhythm like that of a heartbeat.  Shaking with terror, I stared wildly around the room for any sign of escape, and saw that another passage had opened, this one leading still further downward.</p>\n\n<p>My breath catching in my chest in uneven gasps, I staggered forward and entered the low-slung passageway, its walls, too, covered in that throbbing meat-fungus.  After a while, I entered a larger chamber, this one too, covered in living flesh.  In the center of the room sat a creature so enormous and fat, I couldn&#39;t initially understand what I was seeing.  Its pale, white flesh was waxy-looking and slimy, like that of a corpse left to stew in its own rotten juices.  Tentacles covered it like hair, wriggling and twitching.</p>\n\n<p>As I entered the room, the horrifying creature went very still, its tentacles slackening.  I froze.  For one awful moment, everything was quiet.  Then, a great slit opened and I saw huge yellow, curved teeth glistening inside.  The creature took a deep, moaning breath and was still again.  Waiting.  Backing away, my back hit the same, slimy wall that had blocked my path before.</p>\n\n<p>I was trapped.</p>\n\n<p>I felt a warm trickle run down my leg, but I didn&#39;t care.  With my heart nearly stopped, I very slowly edged around the room, pressed against the walls as if I wished to be absorbed into them.  The creature didn&#39;t attack.  It didn&#39;t even move.  I was seized with a mad desire to touch it, but I came to my sense before I could act on the insane idea.  It would be suicide.</p>\n\n<p>But perhaps I was already dead?  I didn&#39;t trust my own eyes anymore.  Nothing here made sense.</p>\n\n<p>I edged into the next, downward-sloping passage and ran for it.  If I had known what lay in the next chamber, I would have stayed with the creature in the room above.</p>\n\n<p>The next cavernous room was wide across and long, stretching into the darkness beyond.  This chamber was lit strange fleshy globes, stuck at haphazard distances along the walls.  I warily approached one and leaped backward in shock: they were human heads--bald heads with their eyes glowing like fire, the mouths working as if screaming silently.</p>\n\n<p>Now nearly insensible with fear, I felt a grasping sensation and then shouted as my hair was tugged painfully from above.  Looking up, my mouth opened in a horrified scream: human bodies, trapped in the stone ceiling to the waist, stretched down, their frail arms snatching at the air, all heads turned toward me.  Empty, bloody eye sockets stared at me, the jaws of the damned gnashing furiously.  I turned to run, and once again, my original path had gone.  I would have to cross the room to escape it.</p>\n\n<p>Ducking my head, I ran flat out, feeling hands snatch at my hair, my clothes, feel  jagged fingernails scrape my face.  I was almost to the open passage beyond when I was seized from behind.  At once, many arms reached down to grab me, to lift me up to hungry mouths.  Struggling and kicking, I managed to free myself from the horrors and dived into the low passageway, landing bruised and disoriented on the stone floor.</p>\n\n<p>Getting up, I scrambled down the passageway, praying any god listening that this way, this time, would lead to an exit.</p>\n\n<p>I was wrong.</p>\n\n<p>I emerged into a large room in which a giant pool of liquid rested, lapping against the walls, the distant doorway on the far shore.  Creeping to the edge of the pool, I saw it was filmy and murky.  Regretting every choice I had ever made in life, for it had brought me here, I stepped gingerly into the pool of dark green liquid.  At once, my skin began to burn and blister and I leaped out of the liquid again, staring at my own blistered arms, my raw, red hands.</p>\n\n<p>There was no other way.  I didn&#39;t have to turn around to know that my entrance was again closed off.  Cursing myself, I jumped into the pool, submerged to above the waist, and charged across, my body screaming as it burned in the strange fluid.  At last, I reached the far shore and climbed onto the rocks.  The pain was almost unbearable: my skin was raw and seething, fluid-filled blisters rising on all exposed skin.</p>\n\n<p>Limping down the rough shaft in the rock, I smelled the stench of rotting flesh again.  Entering the room beyond, I found a giant, hideous creature.  Its body seemed composed of many dozens of human bodies stitched roughly together, blood drenching its rotting skin.  It crouched on ten, thick legs ending in bloody stumps, as if they had been severed before I came here.  From a stalk on the top, a great, yellow, bulbous eye glared at me.  Its mouth opened and I saw human teeth, thousands of them, lining its horrible jaws.</p>\n\n<p>Then I noticed the bodies that made up its body were moving...they were still alive!  Groaning and sobbing, the people sewn into the creature&#39;s body struggled in vain to separate themselves.  I couldn&#39;t watch for long and turned to vomit into a corner of the room.</p>\n\n<p>Grasping at the walls, I edged around the nauseating beast and was feet from the exit when a terrifying screech echoed behind me.  Desperately, I flung myself the last few feet into the tunnel and heard the monster smash against the wall where I had been, shaking the ground under my feet.  I turned to see it flailing a long, slimy tentacle up the passage, trying to fish me out; it passed within inches of me.  I turned away and ran for my life.</p>\n\n<p>The next chamber was entirely empty.</p>\n\n<p>So was the one after that.</p>\n\n<p>And the one after that.</p>\n\n<p>And so on, for eight chambers...empty.  I was beginning to feel that the worst was over, that I had finally &quot;beaten&quot; this hideous dungeon and would soon find the exit from this hellish place.</p>\n\n<p>Once again, I was wrong.</p>\n\n<p>Entering the ninth chamber, I found a great creature crouched on the stone floor.  Its scaly skin was deepest black and its  large white eyes seemed to burn in the near-darkness of the room.  The creature was crouched on six legs, thick pillars ending in claws the size of swords.  Each was bound with a huge metal shackle fixed firmly to the floor, pinning it in place.  Its breath was hot, almost searingly hot, and smelled of sulfur.  Seven giant, bat-like wings beat fruitlessly against the high ceiling; it was as trapped in here as I was.</p>\n\n<p>This time, it wasn&#39;t going to be as easy.  As I stepped into the chamber, the creature growled and its eyes focused on me.  As I made to step toward a wall, as I had done before, it lunged, and I scrambled backward to safety.  Or as safe as I could be, in this wretched place.</p>\n\n<p>I ran toward the other end of the room, my heart nearly bursting from my chest in fear, and was hit with a terrible blow: the monster caught me with one of its legs and sent me into the air.  I knew I was going to die here.  In these opening  antechambers of Hell.  I slammed into the far wall and crumpled senselessly to the ground.  I regain consciousness seconds later and scrambled toward the doorway, the creature howling behind me, straining at its chains.  As I dashed away, one of the creatures claws caught my shoulder and tore it loose from the socket, leaving it hanging by shreds of skin.  Blinded by pain, losing blood, I staggered into the next passage, my arm flapping limp beside me.</p>\n\n<p>The monster&#39;s howls still following me, I threw myself into the next room...and slammed into a door.  Spitting blood out of my mouth, feeling it running from a likely-broken nose, I reached up and felt a handle, the metal ice-cold.  Feeling that nothing could be worse that what I&#39;d already experienced, I wrenched it open and flew through it...and fell onto my back lawn.  I heard the door of the old shed slam shut behind me.  I looked up just in time to see the shack groan and collapse in a pile of broken wood and dust.  The gateway had sealed itself.</p>\n\n<p>. . . .</p>\n\n<p>The doctors never believed my story.  Why would they?  I had staggered into the ER, blood-soaked, with my right shoulder barely attached, screaming senselessly about demons and hell-spawn and a doorway to Hell in an old garden-shed.  After hours of surgery, they removed my arm, declaring it a lost cause.  I was left in a sterile room, to brood on my recent horrors and fight off terrifying nightmares every time I dared close my eyes.</p>\n\n<p>My hand shakes as I type this.  My gaze is often drawn through the window of my study down into the backyard, to the edge of the forest.  I had the wreckage of the shed removed soon after I got out of the hospital, but I haven&#39;t gone near that spot in nearly fifteen years now.  Even after all that time, the spot where that old shack stood still gives off a distinct sense of <em>wrongness</em>, the trees nearby moving slightly, even on windless nights.  Sometimes, I think I can still hear distant screams, echoing over the woods.</p>\n</div>\n","author":"searchingformytruth"}