{"rank":"24","title":"Good Strawberries","id":"8kav1e","url":"/r/nosleep/comments/8kav1e/good_strawberries/","time":"1526622027000","body":"<div class=\"md\"><p>Good Strawberries</p>\n\n<p>I became a man, at the age of eleven, in August of 1942.  I can remember the colors of that summer, and the sounds.  It began with promise, of new life and victory.</p>\n\n<p>We listened to the man on the radio talk about the war, how the Japanese and the Nazis were whipping our hides at both ends.  Daddy was one of a handful of men left in the county because Mama wouldn’t let him go.  The reports weighed on him and there was an unspoken tension between my parents each evening.  A broadcast would come on about a thousand men dead in France and Daddy would look at Mama with this longing in his eyes.</p>\n\n<p>We lived on a farm but Daddy was a mechanic and business had been slow.  We had no crops but a garden, no livestock but a few cattle.  Daddy figured he was more useful to the nation as a soldier than to us as a mechanic.    </p>\n\n<p>Mama was six months along when Daddy left in the spring of 1942.  Mama hadn’t been part of the decision, but she spent almost every minute of every day by the radio listening to the news man.  Daddy wanted to fight Hitler but the Army wanted him in the Orient fighting the Japanese.  We got a couple of letters from him while he was in training.  Mama cried over hers so much they nearly fell apart.</p>\n\n<p>But, anyway, this is my story about the man with the green hat and I promise I’ll get to him.  </p>\n\n<p>My brother, Stuart, was born in the middle of May just a couple of weeks before school let out.  I remember the birth, too.  Ms. Johnston lived down the road a couple of miles and she and Mama were friends.  She’d birthed a couple of babies in her time, especially for the folks that couldn’t afford the hospital. </p>\n\n<p>I remember my mama crying and cussing and yelling my daddy’s name.  It seemed like it took forever and I was too tired to go to school the next day.  And Stuart came out with a full head of hair.  His blue eyes seemed too big for his face.  And he had such a grip.</p>\n\n<p>I had seen the man in the green hat before, in the meadow once and another time he was fishing at our pond.  But, I almost always saw him in the garden.  Mama never understood why we never had any strawberries and I gave up trying to tell her about the man in the green hat.  He loved strawberries.  I don’t think I ever saw him take anything else.  </p>\n\n<p>I was around seven years old the first time I saw him.  It must have been early in the summer because I remember all the bluebonnets, how the wind could make them dance around my knees.  I heard him before I saw him, singing in a strange language in my later years I would associate with Welsh.  </p>\n\n<p>I followed the song and saw the tip of a hat bobbing in and out of view.  It was green, pointed and looked like felt or something similar.  His voice was gravelly, and rather high-pitched.  He might have stood a few inches taller than my knee.</p>\n\n<p>He was headed in the direction of the pond, or so I thought.  The bluebonnets gave way to shorter grass and it was then I finally saw him clearly, from behind.  He was tiny but proportional.  His outfit was blue and brown and his boots were the same shade of green as his hat, which was about half as tall as his body.</p>\n\n<p>There was a satchel on his back brimming with strawberries.  It was early for strawberries so the ones he did have were on the small side.  He jumped around a rabbit hole and some of the berries fell to the ground.  He stopped singing and turned to gather his fallen treasure.  That’s when he saw me and I saw his face for the first time.</p>\n\n<p>His face was like a man’s but different in a way I’ve never fully understood.  If I put his age in human years I would estimate he was in his late forties; however he moved like a much younger man.  I will never forget his eyes, a shade of milky yellow I’ve never before seen on a living thing.  </p>\n\n<p>He saw me and we both stopped.  He considered me with his lively, amber eyes for a moment.</p>\n\n<p>“Y’ave gut strawb’ries,” he said.</p>\n\n<p>“Good strawberries?” I asked</p>\n\n<p>He nodded, retrieved his prize, and sprinted away.  He moved like a squirrel and I couldn’t keep up.  I thought he was going to jump into the pond but at the last second he veered right and disappeared into the tree.  </p>\n\n<p>Mama didn’t believe any of it but Daddy loved to hear my stories.  As time passed I began to embellish them, I suppose, as any kid would.</p>\n\n<p>Stuart was a good baby.  He hardly cried at all.  But, Mama didn’t seem to notice, him or anything else.  Nowadays they call it postpartum depression but back then no one really knew much about it.  Daddy hadn’t sent a letter and it would be a few months before the Army told us why.  He died in the Pacific, on or near some island called Guam.  But, that summer was full of hope, that we’d win the war, Daddy would come home, and Mama would stop crying.</p>\n\n<p>Mama was so sad all the time I started raising Stuart myself, as best I knew how.  She fed him but I could see in her eyes that she didn’t love him.  When he cried to be changed she just turned the radio up louder, weeping as reports came in about the dead.  Daddy was probably already dead by that time and maybe she felt it.</p>\n\n<p>I saw the man in the green hat one time that summer before it happened, my story that is.  Only a few strawberries had come in and the man in the green hat was running away from the garden toward the bluebonnet meadow with an empty satchel.  Perhaps his disappointment at not finding strawberries had something to do with the fact that this was the first time I’d not heard him singing.</p>\n\n<p>I spent a lot of time with Stuart, reading him the same books over and over, taking him for walks outside.  Sometimes I would sneak Clark, our dog, into the house so Stuart could see him.  I think Stuart liked that, too, because his eyes always got so big when he saw that dog.  He’d laugh and hold out his arms like he wanted a hug.</p>\n\n<p>It was toward the end of July the night it happened.  School was still a month or so off and that was just fine by me.  Mama was basically a ghost by then but I had Stuart.</p>\n\n<p>I remember waking up and staring at the moonlight on the floor, the shapes of the shadows on the ground.  I can feel the breeze coming through my window, cool to my exposed skin while the rest of my body was sweaty beneath my sheets.  There were no crickets chirping, which I found strange, but there was another sound which was familiar to me.  It was singing, the same happy tune I’d heard half a dozen times before.  I was so tired, not in my mind but in my body.  It was like there was a weight on me, some invisible hand holding me fast to my bed.  </p>\n\n<p>I heard Stuart cry, a sound I recognized was from agitation and usually meant he needed to be changed.  I managed to lift my head a few inches but the weight forced me down again.  Stuart’s cries were louder, more urgent.  New voices accompanied the singing.</p>\n\n<p>I was able to grasp the window sill and pull myself up, as the singing and crying mingling together and it seemed to be coming from outside.  I rested my chin on the sill and looked out the window.  The man with the green hat was pulling a wagon behind him, skipping away into the meadow.  I could not summon the energy to do anything.  I could not save him.  Stuart was in the wagon, crying as he was stolen away from me.  </p>\n\n<p>I woke the next day in a panic.  The memory of the night before was hazy and would not regain clarity for years.</p>\n\n<p>There was a baby crying and the fear I had about Stuart having been taken in the night faded away as my grogginess did.  Even as I followed the cries I knew there was something different about them.  There was a harsh edge to the wail, something I’d never heard from Stuart.</p>\n\n<p>The baby in the crib was not Stuart and did not look human at all.  Its head was large and misshapen, like the water pouches cowboys would carry in old westerns.  Where my brother had a mop of brown hair this thing had pale wisps, white if they were any color at all.  Its eyes were almond shaped and angled upwards.  Worst of all was its mouth.  Its teeth, a feature Stuart did not possess, were like broken rocks and there was no logic to them.  It was as if someone had tried to make a baby that looked like Stuart but only had ruined parts to work with.</p>\n\n<p>Its skin was translucent to an extent and I can still recall the sight of its little heart beating.  It hardly moved but its cries filled the room.  I could not understand how such a tiny thing could make such a noise.  When it screamed I felt as though my teeth would shatter right inside my mouth.  It stole the breath from my lungs.</p>\n\n<p>Mama didn’t notice any difference; she just sat closer to the radio to hear the news man better.  She tried to nurse the thing once that first day.  She screamed and it did too.  She left him on the floor of the living room and hid in her bedroom for the rest of the day.  There was a trail of blood droplets beginning at her chair and continuing through the hall.  Mama came out once that evening to make dinner.  I tried to talk to her, to tell her about the man in the green hat and how the thing sleeping in the crib was not Stuart.  If she understood me she made no indication to that effect.</p>\n\n<p>That was the first day with the thing that was not Stuart.  </p>\n\n<p>As small as the thing was it seemed to grow smaller.  Mama would not allow it to feed and it would not swallow anything I offered.  Everything I placed in its mouth would leak out the sides, pool in the hollows of its cheeks or trickle into its ears.  And it only stopped screaming when it slept which it did, thankfully, for most of the day.  It produced no waste but I left it in a diaper because the sight of its genitals was so disturbing.  It was obviously male but gnarled appendage between its legs was as unsettling as its smile.</p>\n\n<p>When the postman left the letter about Daddy I kept it to myself.  I thought it was better for Mama to have hope.  That was all she had by then.</p>\n\n<p>I didn’t have Stuart and I didn’t know what to do.  I tried to treat the thing like Stuart but I couldn’t.  I hated it.  Mama and Clark hated it, too.  </p>\n\n<p>After a week or so I was sure the thing was going to die and I secretly hoped that it would.  It never ate, ever.  It was barely strong enough to move its arms and legs and could not lift its head which seemed to swell in size as its body withered.  It cried throughout the night but over the course of days the screams became mewling, so soft I could no longer hear it.  When it mewled I felt pity for it.  I missed Stuart but the thing was so helpless, so pathetic.  How could I not feel something?</p>\n\n<p>I spent days looking for Stuart, probing every knot and crevice of the tree by the pond, looking for a soft spot.  I hid in the tall grass for hours and watched.   I heard only insects and saw just a rabbit or two.</p>\n\n<p>One morning I woke and heard what sounded like cooing, like normal baby babbling and I thought at once that Stuart had returned.  I rushed for Stuart’s room and walked into a massacre.  A streak of blood trailed from the crib, through the room and the hallway to the open front door.  The thing was engorged, its heart beating fiercely.  It was as healthy, and happy for the first time.</p>\n\n<p>I followed the blood to the porch where I found a crimson pelt, and an assortment of bones.  That was all that was left of my dog, matted fur and bones.  I stood there for a while, the rage building inside while I looked at the remains, only carrion then and host to about a million flies.  I did not know how the thing that was not Stuart could kill a seventy pound dog when it could not lift its own head.  I did not know why the dog’s likely howls did not wake me or Mama.</p>\n\n<p>I returned to the crib with a knife in my hand.  I stood over the crib and stared at it.  Its teeth were stained brown from blood and I recognized the vigor in its eyes as the same liveliness I’d seen in the man with the green hat.  I left the thing in the cradle and stayed outside most of the day, walking through the meadow which had lost most of its flowers by then.</p>\n\n<p>My hatred had not lessened in the hours that had passed since finding the remains of my dog on the porch.  I’d lost everything that August.  My father was dead, my brother missing, my dog dead, and Mama was as good as dead.  I didn’t know if my brother was dead but I had to hope that he wasn’t.  I had to hope for something.\nAt home Mama was cleaning the blood in the hallway.  I started to speak to her but recognized the vacancy in her eyes.  She was lost in her own mind, a world in which her husband had not left to die in some jungle half a world away.  I found the Killed in Action letter crumbled on the kitchen table.  I wondered if Mama even understood what the words meant.  I wonder if she knew her husband was never coming home.</p>\n\n<p>A few nights later I woke and found myself unable to move again.  I heard screams, terrible screams choked with blood.  They were an animal’s scream although I was not sure what creature it might have been.  I fought against the paralysis and could not move an inch.  And so I listened to the screams that gradually died away, and then the sound of feeding.  I listened until I slept and the sounds became part of my nightmares.</p>\n\n<p>I did not recognize the remains left on the porch but whatever it was had been big.  </p>\n\n<p>As summer was nearing its end my life fell into a horrible cycle.  Every couple of days I woke to the sound of screams.  Sometimes there were animal parts on the porch and sometimes there was just blood.  One night toward the end of August I woke in such a way that left me know choice but to react.</p>\n\n<p>I heard the sound of singing coming through the open window as I woke, probably after midnight.  It was the song I’d heard the man with the green hat sing in the past but that was not my immediate concern.  Beneath the singing but much closer to my own person was the sound of muffled mewling.  I felt the weight of the thing’s head on my chest and its frail arm holding with impossible strength, to my midsection.  And, once again, I was unable to move.<br/>\nIts tiny hand felt like a dull blade prodding my ribs and I could not move.  I smelled blood and felt wetness on my bare chest as the thing whined and smacked its lips.  It was responding to the song from outside, the voice of the man in the green hat as he stole away into the night with a satchel of strawberries on his back.  In the pitch-black darkness I could only see the pale haze of hair pooled beneath his hat. I do not recall falling asleep but did at some point.  I roused in the morning with dried blood and slaver crusted on my skin.</p>\n\n<p>Daddy taught me how to set traps for rabbits.  Mama said if I caught one she’d make rabbit stew with pie for dessert that very day.  I tried for months with little success until the year before he left for war.  I came home from school and left my books at the door so I could check the three snares I’d set.  The first was empty but the second was not.  I recall seeing the animal, a young, brown jackrabbit, from behind.  It twitched and pulled and strained against the trap, the thin wire eating into its flesh.  It gnawed at the paw and drew blood.  Rabbit stew lost its appeal that moment.</p>\n\n<p>The animal went wild as I neared, bucking like the bulls at the rodeo.  I pinned him to the ground by the neck and released him from the trap after some struggling.  The rabbit limped away and left small puddles of blood behind him.  I found it a few days later, dead beneath a weeping willow.</p>\n\n<p>I picked through the strawberries, leaving the best on a particular patch where I laid my snare.  Then I could only wait.\nTwo nights later I woke to two different sounds.  I recognized the sound of the thing that was not Stuart snoring in its room, a sound that steadied my heart.  The other sound was an angry, small voice.  Rather than risk waking either Mama or the snoring thing I crawled out of my open window and landed outside.</p>\n\n<p>The language was foreign but the voice was familiar.  The man with the green hat was caught in the snare and fighting with all of his strength.</p>\n\n<p>“Where’s my brother?”  I asked.</p>\n\n<p>The little man looked up at me and there was much anger in his eyes.  The light of the half moon was enough for me to see his face.  In the years between that night and today I have come across portrayals of creatures that possessed some of his qualities, gremlins and medieval paintings of devils.  He had a silver beard that did not match the cotton-colored hair on his head.  His green hat was on the ground.</p>\n\n<p>Though never taking his eyes off of me he struggled to reach something nearby.  I kneeled and grabbed the thing which seemed to merely be a smooth stick.  He screamed when I took it and fought harder against the snare.</p>\n\n<p>“Where is my brother?”</p>\n\n<p>He did not reply but snapped with his little teeth and spit at me.\nI held the smooth stick in my hand.  It was only a few inches long and narrowed to a blunted point.  I pointed it at the little man and he screamed again and held his hands in front of his face.</p>\n\n<p>“Brudder in th’ tree.”</p>\n\n<p>“My brother is in the tree?”</p>\n\n<p>He nodded.</p>\n\n<p>“What does that mean?”</p>\n\n<p>“Dem witch tuk ‘im.  Dem tuk ‘im to th’ tree an’ gon kip ‘im.”</p>\n\n<p>“What is that thing in Stuart’s room?&quot;</p>\n\n<p>He lunged at me and yelled from the pain of the snare biting into his ankle.</p>\n\n<p>The anger began to build in me, to fill me up.  I thought about my dog, about having to dig a grave to bury its bones.  I thought about Stuart and how he smiled so wide when he saw me.  I felt the smooth stick warm in my hand and it shook, vibrated some.  It glowed from the base and a little spark shot out of the tip.  The spark exploded with a brief popping sound when it contacted the earth.</p>\n\n<p>The little man and I stared at each other for a moment that seemed like a long time but probably wasn’t.  The hatred in his eyes was intense.  </p>\n\n<p>“You want this back?”</p>\n\n<p>He spit at me.</p>\n\n<p>“I want my brother back and I want you to take that thing away.”</p>\n\n<p>He dropped his head at this point, tired from fighting.</p>\n\n<p>“Dem witch not give ‘im to me.”</p>\n\n<p>The hatred was gone from his eyes and in its place was a sort of helpless calm.  In the silence afterward I could hear the thing that was not Stuart bleating in its crib like the calves in the field when they get too far from their mamas.  The man with the green hat did not look about to speak anytime soon.  I did the only thing I could at the time.  I bribed him.</p>\n\n<p>When I freed the little man I pointed the stick at him like a gun.  He held his hands up and sort of slinked away toward the house.  A few minutes passed and I waited outside, firing off sparks with the stick.  The front door opened and the man with the green hat appeared, ferrying the strange, crying babe on his back.</p>\n\n<p>He threw something at my feet and said, “Dat his.  Kip it eff you wan.”</p>\n\n<p>It was about the size of a toothpick, and as smooth as the stick I held in my right hand.</p>\n\n<p>We walked into the night together.  The thing that was not Stuart fell asleep but it roused a bit as the man in the green hat tripped over rocks and around holes.  We walked through the empty meadow toward the pond.  The man with the green hat did not sing.\nAt the tree the little man stopped and turned to face me.  The baby on his back could not have weighed ten pounds but seemed to bend the man in half.  </p>\n\n<p>“Gib me a bit o’ time,” he told me.</p>\n\n<p>He disappeared inside of the tree, with the baby, and left me there in the dark.<br/>\nThe minutes that follo\nwed were the longest of my life.  I wondered if he might appear with a hundred of his kind, little ones with smooth sticks.  Or, even worse, what if he’d sent the witches after me?  </p>\n\n<p>A few crickets gave me company during those minutes but things were otherwise silent. </p>\n\n<p>The man appeared, holding Stuart, the real Stuart, underneath his armpits.  Stuart was asleep and I was not sure how considering how much he was being jostled about.  The man passed Stuart to me and I held my brother on my hip.  He was very heavy and seemed too large for a baby of only a few months.</p>\n\n<p>“We have a deal?”  </p>\n\n<p>The man with the green hat nodded, a new green hat was on his head.  The other was still amid the strawberries.</p>\n\n<p>I handed him his stick and he smiled, running his fingers along its smooth grain.  There was a second where I thought he might point the stick at me but he didn’t.  He turned and ran into the tree, vanishing.</p>\n\n<p>It’s surprising how quickly life returns to normal after something like that.  Stuart grew up a regular child and a smart man.  I did time in Korea while Stuart went to school.  But, for the first few months things were strange.  Stuart was about the size of a two year old when I took him from the little man, and already talking.  On paper he was not even six months old but he could walk and talk.  He didn’t speak English, though, and it took a year to set him right.  Mama came around by Christmas.  I think she knew more than she let on.</p>\n\n<p>I made good on my end of the deal, too.  I didn’t see the man with the green hat as much after that night and only a few times as an adult.  Every now and then I found him fishing but, more often than not, he was gathering strawberries from the patch I planted all around the tree. </p>\n\n<p>After I left the service I came back home to be with Mama and Stuart before heading out into the world again.  I slept in my old bed, my feet hanging off the edge.  Through the cracked window, carried on a warm breeze, I swear I could still hear him singing.</p>\n</div>\n","author":"LPHernandez"}