{"rank":"14","title":"Dream House","id":"8kb5tm","url":"/r/nosleep/comments/8kb5tm/dream_house/","time":"1526625856000","body":"<div class=\"md\"><p>It all started a cold night in one of the warm coast countries from Central America;</p>\n\n<p>After my father&#39;s death, my mom wanted to relive old memories and visit her home country for a few years... Which is part of the reason I decided to give myself a well-deserved gap year after straight A&#39;s and 0 ideas of who or what I was supposed to become as an adult.</p>\n\n<p>And well, it was all perfect, until the &quot;thing&quot; happened.</p>\n\n<p>Before I start telling you my story, please allow me introduce myself; I&#39;m Maria, the eldest daughter of a Salvadoran father and North American mother —to whom my father referred to as &quot;The woman of his dreams&quot; — I have two little sisters, both 9 and as for me, I am currently 18 years old and sort-of fresh out of school.</p>\n\n<p>I must also say that I have been a huge follower of No Sleep for a long time, and interesting enough, this makes me think about how curious life is; One weekend I was reading stories from my tablet in No Sleep, being thankful that I never had to go through anything like you do, and the next Monday I got bitch-slapped in the face in a &quot;You wish&quot; kind of way.</p>\n\n<p><em>Sigh...</em></p>\n\n<p>Alright... Going back to what happened.</p>\n\n<p>We were staying at my father&#39;s &quot;Finca&quot; (country house) which was being taken care of by my Uncle Felipe. He didn&#39;t really do much aside from making sure that the house was well-maintained and beautiful. — and... Woah, if you could only see that house; it was a relic! Something brought out of a fairy tale.</p>\n\n<p>It was a two-story building, positioned over a small hill. It had a colonial style attached to it; several balconies, open rooms, a gorgeous inside garden without counting the field that spread across the land. The air was fresh and the view was mesmerizing; You could enjoy it from any spot of the house, the mountains, the trees, the blue skies and white clouds that looked as they were painted with a brush, I could hear the birds sing in the distance, it was beautiful.</p>\n\n<p><em>A Dream House.</em></p>\n\n<p>This was the third day we lived in the house — As a matter of fact, a Monday.</p>\n\n<p>Mom had head over to the city earlier in the morning, she said she would go ahead and list the prices of services we needed in the house ( Internet, warm water, and a landline since there was no signal in the area) So I had to stay home and watch over my two sisters; Lara and Sofia.</p>\n\n<p>I was going around my business making some cleaning when I noticed the twins playing with an old box that looked quite old and expensive; it was wooden with a beautiful spiral design carved on the top, it had a small iron lock keeping it shut, so the girls were not able to have it open. You know? It looked like a box where you would save your jewelry - only that it was around 3 times bigger. So my first reaction was to take it from them so they would not damage it.  I didn&#39;t have to ask any questions, one look and they knew that it had to be handed over.</p>\n\n<p>I headed over to the kitchen and placed the box on the counter; I was aiming towards taking some pictures of the box and see if it had any worth so my mom could fill her pockets with some cash. I ran my hands to my pockets and realized I had forgotten my phone where the girls were playing next room. I made my way towards the doorway and overheard them whispering.</p>\n\n<p>&quot;He&#39;s going to be angry&quot; - This was Lara, she sounded frustrated.</p>\n\n<p>&quot;W...what should we do?&quot; - I could sense a certain fear of Sofia&#39;s voice as she mumbled the words.</p>\n\n<p>&quot;We need to give him the box&quot;- Lara affirmed.</p>\n\n<p>&quot;What are you girls talking about?&quot; - I interrupted, &quot;what&#39;s in the box? Who&#39;s going to be angry?&quot;</p>\n\n<p>The girls jumped when they heard me, and I could see the fear in their eyes, the same fear that they had when they dropped and broke my mother&#39;s favorite perfume last year. They didn&#39;t say a word.</p>\n\n<p>Needless to say, as an older sister, the thought of someone else, a complete stranger talking to my sisters made me extremely nervous, knowing that this was a house were 4 females lived.</p>\n\n<p>&quot;Are you going to answer or should I tell mom about this? Who is going to be angry?&quot;</p>\n\n<p>They hesitated for a moment and eventually answered.</p>\n\n<p>&quot;The man in the cellar&quot; - L mumbled and my heart stopped for a second.</p>\n\n<p>&quot;We are getting out of the house&quot; - I said immediately, I was not wasting my time taking any other items from the huge house; I grabbed my two sisters and headed outside through the living room and our front door towards the old pick-up truck Uncle Felipe left at home for us (in case we had any emergencies.)</p>\n\n<p>As soon as I reached the truck I found out that I had forgotten the keys inside; The skies were getting dark with huge clouds hovering around the area. A hard rain was coming and what once looked like a dream house, now looked like the house of horrors, which sent chills all across my body... I gulped and knew what had to be done.</p>\n\n<p>&quot;You girls stay here okay?&quot; – I commanded them; lucky for us, the doors were open so I got them inside the pick-up and covered them with the blanket that my uncle left inside – &quot;You have to hide okay? Don&#39;t let anyone see you, and if someone finds you scream as loud as you can... Last of all, LOCK the doors okay?... I love you both.&quot;</p>\n\n<p>I kissed them both on the forehead and closed the doors. I heard when they locked them and took a deep breath before venturing into the house.</p>\n\n<p><em>Should I run? Should I sneak? What if there&#39;s nobody? What if he&#39;s waiting for me?</em></p>\n\n<p>My mind was a nuclear reactor waiting to explode and panic was taking over me as I approached the front door. My heart was beating out of my chest and I had a wrong feeling in my gut begging me to run away.</p>\n\n<p><em>I need to keep my sisters safe, I promised mom I would take care of them, I need to keep them safe.</em></p>\n\n<p>I slowly opened the door and released a little bit of air when I saw everything just as it was left. The TV on with the Frozen movie playing; I could see the kitchen door right from the spot and the lights from the first floor were still on. I decided to take no risks and left the door open behind me as I walked inside, still nervous.</p>\n\n<p><em>I should grab a weapon. You will feel safer with a weapon, grab something, anything.</em></p>\n\n<p>I looked around the room and saw a short metal tube left from the previous plumbing job done by my Uncle.</p>\n\n<p><em>This will work. If you see &quot;him&quot; hit hard and hit to incapacitate. He&#39;s in your house. Protect your sisters.</em></p>\n\n<p>I reached the kitchen and turned on the lights.</p>\n\n<p><em>Wait...\nThe lights were on. \nOh, God... Turn them on... \nokay... they&#39;re on... \nThe box, where is the box? \nThe keys, reach for the keys... where are the keys? Maria, where are the keys?</em></p>\n\n<p>I could hear my heart beating out of my chest, my breathing got harder and I looked around me, the world going numb around me, fear overwhelming my senses. I went to the doorway, the front door was closed.</p>\n\n<p>And then I heard the scream.</p>\n\n<p>You know that instinct you get when you care deeply about someone? My sisters were my life, they had dreams, ambitions, everything to live for. Fear? Anger was enough to make me come back to reality and filled me with adrenaline.</p>\n\n<p>I ran outside and saw him standing there, over the body of one of my sisters... It hurts my soul even to write this... my poor baby Lara. Who could do such a thing? Why would anyone murder A CHILD?</p>\n\n<p>He immediately looked at me and smiled... I could see his perverted smile on that disgusting face, he looked like a man who hadn&#39;t showered in years, he looked like a <em>monster.</em></p>\n\n<p>My heart broke so hard that my own monster woke up inside of me, I had nothing to lose and I could see Sofia hiding under the truck.</p>\n\n<p><em>Save my sister, Kill him. Kill him. Kill him. Kill him. Kill him. Kill him. Kill him. Kill him. Kill him.</em></p>\n\n<p>He laughed. That sick man LAUGHED when he saw me and he <em>ran</em> over to me. Was he expecting me to run?  Because I didn&#39;t care. He could come to me and try to kill me but one thing was for sure; I was not giving up without a fight.</p>\n\n<p>The next events were a blur, I punched, I bit, I screamed, I clawed at the monster, that sick bastard who killed my sister.</p>\n\n<p>The reports said I hit him 50 times with a metal tube on his head, I disfigured him and they could not recognize his face. When they found me I was soaked in his blood.</p>\n\n<p>To give you great news: Sofia and mother lived, and in the end, we figured out what the box contained:</p>\n\n<p>You wouldn&#39;t guess? Pictures of murders that went on in the field behind our house. Pictures of the families, pictures of OUR family. 67 people who were killed and buried under that land. </p>\n\n<p>————————————————————————————————————————</p>\n\n<p>I know it&#39;s late to tell my story;  This actually happened 3 years ago, and I am writing this after my release from the psychiatric ward on the Saint Vincent Hospital. I know I&#39;m not crazy, and I think the doctors know that too.</p>\n\n<p>But you need to know; When anger awakes a monster inside you, you can never put him back to sleep. He wants to feed, he wants to control you... and my monster just happens to take the face of that man whom I murdered in the field back when I was 18 years old, and he is demanding fresh blood.</p>\n\n<p>But he will never win; I will come for his own kind.</p>\n</div>\n","author":"a7xvalentine"}