{"rank":"43","title":"Do you know the Muffy Man?","id":"8kbarg","url":"/r/nosleep/comments/8kbarg/do_you_know_the_muffy_man/","time":"1526627612000","body":"<div class=\"md\"><p>If ever asked if you know The Muffy Man, say no. Always say no.</p>\n\n<p>For you to understand we have to go back where it all started, two weeks ago in a damn yard sale. </p>\n\n<p>I bought a children&#39;s book, among other things, to read to my son at night. It was titled The Muffy Man, now I&#39;m not that familiar with The Muffin Man I first heard about the nursery rhyme in the movie Shrek, so of coarse I thought the book was some sort of knock off.</p>\n\n<p>It looked like every other kids book, innocent, cartoonish, and fun. On the cover was the title and a man in a chef&#39;s hat and black apron carrying a tray of muffins above his head with a wide smile across his face. It wasn&#39;t until I sat down by my son at bed time did I realize how off the book really was, there was no author&#39;s name or any mention of the publishing company. The cover itself also looked different, now it looked more realistic and less cartoonish. I swear it did not look like that when I first picked it up.</p>\n\n<p>Anyway, I paid it no mind and just continued on. The first page was strange though, in the picture the setting seemed to be set in a crowded dirty city with visible rats and filthy people scattered around the street. The &quot;Muffy Man&quot; could be seen passing out muffins to these people. I was caught off guard by how raw it looked, not something you&#39;d see in a Disney movie that&#39;s for sure. I should have stopped there, I don&#39;t know why I didn&#39;t.</p>\n\n<p>Then I started reading;</p>\n\n<p><em>Do you know the Muffy Man,</em></p>\n\n<p><em>The Muffy Man, the Muffy Man?</em></p>\n\n<p><em>Do you know the Muffy Man,</em> </p>\n\n<p><em>Who lives on Drury Lane?</em></p>\n\n<p>.</p>\n\n<p><em>Do you know the Muffy Man,</em></p>\n\n<p><em>The Muffy Man, the Muffy Man?</em></p>\n\n<p><em>Do you know the Muffy Man,</em></p>\n\n<p><em>The one who&#39;s gone insane?</em></p>\n\n<p>.</p>\n\n<p><em>Do you know the Muffy Man,</em></p>\n\n<p><em>The Muffy Man, the Muffy Man?</em></p>\n\n<p><em>Do you know the Muffy Man,</em></p>\n\n<p><em>Where in a dark alley he&#39;d been slain?</em></p>\n\n<p>.</p>\n\n<p><em>Do you know the Muffy Man,</em></p>\n\n<p><em>The Muffy Man, the Muffy Man?</em></p>\n\n<p><em>Do you know the Muffy Man,</em></p>\n\n<p><em>Where in a rhyme he now reigns?</em></p>\n\n<p>And with each turn of the page the more lifelike and sinister the pictures became. One was taken as if it was a camera, a young painted girl was looking right the &quot;lens&quot;, her expression was one of earnest and her hand was pointing to her closet that was wide open. I knew if this girl could talk and or make motions, she&#39;d be vehement. I tried looking closer at what had this poor girl all riled up but all that could be seen in the closet was blackness.</p>\n\n<p>The next one was of the Muffy Man standing inside what looked to be a brothel with dames running around naked without a care in the world. What the fuck?</p>\n\n<p>At this point I&#39;d forgotten all about my son and carried on intensely reading as though my mouth was not my own. No, I was no longer reading but <em>singing</em> the words instead.</p>\n\n<p><em>Do you know the Muffy Man,</em></p>\n\n<p><em>The Muffy Man, the Muffy Man?</em></p>\n\n<p><em>Do you know the Muffy Man,</em></p>\n\n<p><em>Who&#39;s muffins were so cheap?</em></p>\n\n<p>.</p>\n\n<p><em>Do you know the Muffy Man,</em></p>\n\n<p><em>The Muffy Man, the Muffy Man?</em></p>\n\n<p><em>Do you know the Muffy Man,</em></p>\n\n<p><em>Who stole children in their sleep?</em></p>\n\n<p>.</p>\n\n<p><em>Do you know the Muffy Man,</em></p>\n\n<p><em>The Muffy Man, the Muffy Man?</em></p>\n\n<p><em>Do you know the Muffy Man,</em></p>\n\n<p><em>Where in the dark he creeps?</em></p>\n\n<p>.</p>\n\n<p><em>Do you know the Muffy Man,</em></p>\n\n<p><em>The Muffy Man, the Muffy Man?</em></p>\n\n<p><em>Do you know the Muffy Man,</em></p>\n\n<p><em>Who poisoned muffins for people to eat?</em></p>\n\n<p>.</p>\n\n<p><em>She married to the Muffy Man,</em></p>\n\n<p><em>The Muffy Man, the Muffy Man.</em></p>\n\n<p><em>She&#39;s married to the Muffy Man,</em></p>\n\n<p><em>She swears this story isn&#39;t true.</em></p>\n\n<p>.</p>\n\n<p><em>Do you know the Muffy Man,</em></p>\n\n<p><em>The Muffy Man, the Muffy Man?</em></p>\n\n<p><em>Do you know the Muffy Man,</em></p>\n\n<p><em>Even if no, say I do.</em></p>\n\n<p>And there in the last page showed a man, a <em>real</em> man, hanging from an old fashion lamp post. He was hanging from the neck by what seemed to be his own apron. Even dead his eyes were like black bottomless pits and he was staring <em>right at me.</em> </p>\n\n<p>I should&#39;ve paid attention to my son when a heard him softly whimper a meek &quot;I do.&quot; But I was so caught up in what I was seeing it went right over my head. Now I know this sounds crazy but for the briefest of moments I swear I saw the Muffy Man lift the corner of his dead lips in a smirk.</p>\n\n<p>Slamming the book closed, I look up and my son was... he was gone.</p>\n\n<p>That was two weeks ago and my son is still missing. My wife won&#39;t talk to me, the cops are no help, and I&#39;m becoming more hopeless every day. If anyone knows anything, anything at all, please help me.</p>\n</div>\n","author":"ShadeBabez"}