{"rank":"7","title":"ATA 5817","id":"8kbfuu","url":"/r/nosleep/comments/8kbfuu/ata_5817/","time":"1526629550000","body":"<div class=\"md\"><p>“Talk to me, Charlie! Talk to me! What are we shooting at?&quot; I barked at Charlie as I cocked the rifle. The somber night merged with the forest to mimic what its to be blind. The only light was the beams of our assault rifles. </p>\n\n<p>“Keep it down! Its somewhere in the trees I just saw it” Charlie said under her breath.</p>\n\n<p>Charlie and I were back to back, I can feel her heartbeat through my spine. The dead silence of the night is looking right at us. Every time the torch beam lands on the distant trees my mind keeps up making figures to startle me. My sweaty hands tightened around the grip of my weapon. </p>\n\n<p>“There!!“</p>\n\n<p>Charlie screams and lets out a burst of lead into the thickets. In one swift motion, I sprung into action and fired in the general direction. After few rounds, we both stopped.</p>\n\n<p>“All right fuck this man, fuck it! We have to calm down! We are imagining things. We gotta stay here till evac gets here!” I commanded Charlie. I can feel my body heat rise with every breath I take. The emergency light on the floor is lighting up my breath fog. I am panting.</p>\n\n<p>I can see that Charlie is terrified. Why wouldn&#39;t she be? She is a child, and she just watched her friend mauled by that thing. I reached for the water bottle in my pack.  I took a swig of water and let my head down for a minute. I need to catch my breath. I heard a branch crackle behind me. I pointed my weapon at where the sound is coming from and let out a burst and Charlie?</p>\n\n<p>“CHARLIE!!?” I screamed out into the night in pain. Charlie was gone.</p>\n\n<p>I ran out into the forest brandishing my rifle. I kept repeating Charlie&#39;s name over and over.</p>\n\n<p>Won’t this fucking thing end already?! I’ve been in this goddamn forest for two? Three nights? I don’t know man; I am just a merc. I want to travel the world, just like you. But this is the only thing I know! I sat down on the ground. As I lowered myself and I could feel something warm in the dark. It was under my right hand. </p>\n\n<p>It&#39;s Charlie, Ripped in half. Her legs?! Where are her legs?! I can&#39;t man! This fucking thing has been hunting us for the past few days. Whatever the hell it is! It just won’t stop. First, it was Basur, Claude and now, now Charlie!</p>\n\n<p>She was just a kid! That fucking Professor and his fucked up research. If you can even call it that?! Shady motherfucker! I knew I shouldn’t have trusted him.</p>\n\n<p>A rustle in the bushes pulled my focus back. I have to get out of here. I can’t die. Not yet.</p>\n\n<p>I grabbed what was left of Charlie. Swung her torso on my back and with the rifle on my right hand I marched through the thick undergrowth. I think it&#39;s after me.</p>\n\n<p>Good. First, it has to catch me!</p>\n\n<p>I kept running. I don’t know how long I continued on the march. Until I came crashing down to the wet mud. I just fell. Charlie&#39;s mangy corpse rolled over me. Sleep, Please I just want to sleep, man. I could feel the entire forest spin around me. The black of the night was seared on to the back of my eyelids. Was it the night? Or are my eyes closed? I cant tell anymore. I crashed on to the ground.</p>\n\n<p>Gasp! I woke up. Fuck fuck! Did I fall asleep? Where am I?</p>\n\n<p>&quot;Charlie!&quot; I yelled out looking around me.</p>\n\n<p>What? Who started this campfire? Did we move?</p>\n\n<p>I tried to stand up, but I was glued to the ground. There is a red web all over my legs. The embers of the campfire roared on with the gentle wind. As I struggled release from the grasp of the red web. I could hear heavy footsteps approaching. I turned around to see what it was. </p>\n\n<p>At first, I couldn&#39;t see, but as the orange glow of the fire spread its light into the black bushes, I saw it. The thing that was staring at my face was malefic. I can feel my life force suck into the abyss of its eyes, or least the holes that replaced them. It started tilting its head gently to the side. Letting out a low growl and cackled from the lower part of its throat. As it walked towards the fire, I could see it was carrying a leg of Charlie. It&#39;s disfigured mouth looked like a mutated crab&#39;s face. With claws poking out under its jaw. It had an almost beetle like face, but much sinister. Muck was oozing out from the edge of its mouth. It&#39;s heavy heaving breath was labored.  It was a god awful thing to look at. It took another bite out of Charlie&#39;s leg as it started running towards me. I screamed at the top of my lungs. In an instant, it was next to me. It leaned down to inspect me. Its breath was pungent, the smell of infected skin and dried blood was horrifying. It leaned over me and placed its massive hoof on my chest. Then opened its hideous mouth hole letting out a wrathful roar. From it came a swarm of flies battering my face and its gargantuan tongue swooped down to swab my face.</p>\n\n<p>I let out a shriek and woke up! It’s just rain! It&#39;s just fucking rain. And that was just a dream. &quot;Was that a dream?! Is any of this fucking thing real?!&quot; I cursed out, turning on my stomach to stand up. But the wounds of my body and mind wouldn&#39;t let me. I can’t do this anymore. I am weak. The downpour of the cold rain pattered on my helmet. I buried my face deep into the wet earth. I rubbed my face hard to forget everything I saw in this hellhole. The abrasive soil cuts my face, but I can&#39;t feel anything anymore. I tried to lift my self on more time.</p>\n\n<p>“I get it. I fucking get it now! You’ve won.” I screamed out.</p>\n\n<p>I fell on my knees beside Charlie, splashing mud on her innocent face. I muttered her name under my breath. And I leaned forward, I clawed my way towards her.  I dug my hands deep into the dirt. Inching towards her. I just didn&#39;t have the strength to pull my self anymore.  I can’t carry Charlie&#39;s lifeless body anymore.  Let her rot with me and the rest. May we be forgotten and lost in this place. I turned my gaze to the pitch black night sky. Is this how it ends? </p>\n\n<p>“Kill Me!?!, Just fucking Kill Me!” like a wounded critter, caught in a snare. I screamed at the relentless rain.</p>\n</div>\n","author":"fourtwentydude"}