{"rank":"13","title":"Strange Davie's Trial","id":"8kbf4d","url":"/r/nosleep/comments/8kbf4d/strange_davies_trial/","time":"1526629263000","body":"<div class=\"md\"><p>I didn’t think I would be posting an update so soon, but I might as well get everything out of me before things get worse. If you want to read the beginning (and you should), click on <a href=\"https://www.reddit.com/r/nosleep/comments/8jwgxi/strange_davies_bucket_list/\">this.</a></p>\n\n<p>Now back to what happened. </p>\n\n<p>My friends and I ended up staying the entire night out, and by the time I reached home, it was already dawn. I know education is important and all, but I just wasn’t feeling school with half an hour of sleep. My parents didn’t disturb me. They trusted me to know what I could work with. So, I slept for a couple more hours, only to get up when I started getting hunger pangs. After a meal of I-forgot-what, I went to my laptop and clicked on discord. It was instinctive, and I admit that in my sleep-drugged state, I had little memory of what happened the night before. </p>\n\n<p>But when I saw the flood of messages on #honey-talk-café, everything came back. Even as I scrolled up to the start, the conversation continued with new messages that constantly popped up at the bottom. I clicked on the news article Lily sent and gave it a more thorough read. It was a very short article. More of an alert. The woman was not named, but I think you – the readers - already know who she is. For the me of that moment, I couldn’t let myself believe it until Clarissa sent another article, hours later, confirming that it was indeed Lily.</p>\n\n<p>Lily wasn’t her actual name. I’m not going to reveal personal details here, but we all knew it was her from the photo pasted in the article. She posted the same photo on the channel a couple of months back, when she successfully created by hand the dress she always wanted. It was a shitty piece of work but… She did try. \nI forced myself to move on. Clarissa mentioned that there would not be any follow-up to the case because they had written it off as a freak accident. A fire starting from a faulty coffee machine, or at least that was what they said. The annual Office Hide-And-Seek no longer existed. </p>\n\n<p>Now, we weren’t dumb people. A little assumptive, yes, but we just knew how to connect the dots. It took less than ten messages after Clarissa’s article for the first accusation to be commented. </p>\n\n<blockquote>\n<p>@StrangeDavie anything to say on this ? </p>\n</blockquote>\n\n<p>Nothing explicit, but Henry’s intention was obvious. Julie and Natasha (I was surprised to see her here because she wasn’t usually online) sent ellipses and a warning “<em>Henry</em>”, but it didn’t stop him. </p>\n\n<blockquote>\n<p>don’t you guys think it’s strange that this is happening right after he joined</p>\n</blockquote>\n\n<p>It was strange, but coincidences happen. </p>\n\n<blockquote>\n<p>he completed his first challenge the moment we received the video from Lily</p>\n</blockquote>\n\n<p>Ring-Around-the-Rosie. A nursery rhyme about children going around in a circle with one child in the middle. </p>\n\n<blockquote>\n<p>we all saw that there was a man with her </p>\n\n<p>who locked the door</p>\n\n<p>which is why she couldn’t get out</p>\n</blockquote>\n\n<p>At this point, Natasha interjected with “We don’t know if the man locked the door”. </p>\n\n<blockquote>\n<p>okay then why couldn’t she just leave</p>\n\n<p>we all heard him lock the door</p>\n</blockquote>\n\n<p>The next message came from Clarissa. If I remembered correctly, she lived in the same state as Lily.</p>\n\n<blockquote>\n<p>are you suggesting that @StrangeDavie has something to do with Lily’s death ? :sweat_smile: :sweat_smile: :sweat_smile: </p>\n</blockquote>\n\n<p>No one replied for a few minutes, until Kyle sent a sharply-toned response. </p>\n\n<blockquote>\n<p>Our friend has just passed away. I think we should all try to be a little more respectful, instead of pointing fingers. </p>\n</blockquote>\n\n<p>Agreements came from Julie and Natasha. Clarissa did not reply then. Henry was not done. </p>\n\n<blockquote>\n<p>more like we shouldn’t write off her death as a <em>freak accident</em>.</p>\n\n<p>@Clarissa I didn’t say that</p>\n\n<p>murder is murder </p>\n\n<p>we know that the guy in the video has something to do with her death</p>\n\n<p>we should find out who he is</p>\n</blockquote>\n\n<p>The back of my neck was prickling as I read the messages. I closed my bedroom door and opened my playlist. Everything was getting so serious so quickly. It was unreal how bad everything was turning out to be. As the moderator, I felt like complete shit for plunging everyone into this. Well, kinda. It was rather exciting too, to be honest. A murderer amongst our midst? I didn’t want to outwardly jump onboard all of the drama because a moderator has to always stay somewhat neutral. But still… </p>\n\n<p>Kyle snapped back logically. </p>\n\n<blockquote>\n<p>Or we could give the video to the police and they can deal with it from there. </p>\n\n<p>@Clarissa You live nearby, right? Report this video to the neighbourhood police. </p>\n\n<p>We don’t have the rights to play detective. </p>\n</blockquote>\n\n<p>The next 30 messages or so were on Kyle and Henry arguing whether Clarissa should report the video. Henry believed that the police wasn’t going to do anything, especially when the office already covered it up. What was more important was that Lily’s death had something to do with Strange Davie’s challenges. Yeah, Henry did go on to literally @Strange Davie and announce that he was involved. Kyle’s argument was that this was going to turn into a circle jerk. No else butted in, until Clarissa spoke up again. </p>\n\n<blockquote>\n<p>ok lmao you two need to shut the fuck up. </p>\n\n<p>first of all, the police here are crap :upside_down: they’re not going to solve anything </p>\n\n<p>and I’m not involving myself in their mess</p>\n\n<p>second of all, we don’t know @StrangeDavie and even if he has something to do with it, you think accusing him here is gonna do anything? </p>\n\n<p>he can see everything </p>\n\n<p>if I were him, I would just leave lmao and yall won’t have anything else to do</p>\n\n<p>we don’t know if the guy in the video is @StrangeDavie</p>\n</blockquote>\n\n<p>The messages were getting closer to my time. As I was reading Clarissa’s, I noticed that other channels were highlighted as well. Nice to see that other activities didn’t come to a stop from all the drama. But clearly, Kyle, Henry and Clarissa weren’t as involved. Kyle went next. </p>\n\n<blockquote>\n<p>Do we even know that the guy in the video is involved? Him being in the video doesn’t mean much. </p>\n</blockquote>\n\n<p>The loophole here was plain enough for even me to groan. Henry launched at him with an overexcited flow of mockery. I could see him rolling his eyes at the computer screen, but honestly, Kyle asked for it so I didn’t feel too bad. </p>\n\n<blockquote>\n<p>you <em>idiot</em>. </p>\n\n<p>the closet door can only be locked from outside because if not, Lily could have fucking unlocked it from inside</p>\n\n<p>the guy locked the door</p>\n\n<p>the guy still had her phone even after he left the closet</p>\n\n<p>Lily couldn’t have fucking sent the video to us if she was locked in the closet</p>\n\n<p>also the fire happened when we received the video</p>\n\n<p><em>the guy sent the video to us</em></p>\n\n<p>and why sent it to us here unless he knows about our discord group ?</p>\n\n<p>I fucking bet we’re the only ones who got the video because if her irl friends and family got it</p>\n\n<p>we would be seeing more articles on her death</p>\n\n<p>but he didn’t even hand over the phone</p>\n\n<p>so that guy knows about us</p>\n\n<p>he has to be someone within us </p>\n</blockquote>\n\n<p>There was another silence of a few minutes. Then, Kyle: </p>\n\n<blockquote>\n<p>What if Lily asked him to send it to us just as a mark of accomplishing the challenge? </p>\n\n<p>And he didn’t tell anyone us because he didn’t want to be blamed for locking the door. </p>\n</blockquote>\n\n<p>Henry: </p>\n\n<blockquote>\n<p>oh fuck off Kyle</p>\n\n<p>I know you’re thinking the same things</p>\n\n<p>you’re just trying to save your sorry ass with excuses</p>\n\n<p>@StrangeDavie get the fuck on here and explain yourself</p>\n</blockquote>\n\n<p>That was the latest message.</p>\n\n<p>I hesitated. What could I possibly say? There were so many questions I needed to be answered. I didn’t know what tone to use, how I could possibly be the mature voice here when I was, secretly in fact, the youngest. </p>\n\n<p>Finally, I decided on a simple:</p>\n\n<blockquote>\n<p>Hey guys</p>\n</blockquote>\n\n<p>It seemed like everyone was waiting for me. A bunch of considerate mornings were shot back at me. I gulped and then continued typing. </p>\n\n<blockquote>\n<p>Let’s all stay civil, alright? No fighting, no vulgarities directed at others. I’m talking about you, Henry and Clarissa. Tone it down or I’m going to have to give out strikes. </p>\n\n<p>Kyle is right on giving respect to Lily. Let’s just calm down.</p>\n</blockquote>\n\n<p>No reply for a minute. I sighed. </p>\n\n<blockquote>\n<p>We can give it a day or two. Maybe the guy in the video will hand over Lily’s phone. Let’s give him a chance. </p>\n</blockquote>\n\n<p>I turned around in my chair and wheeled around my room. Really didn’t want to see any messages going against my words. It’s all fun and games until you yourself gets caught in the cross-fire. \nThen there was another ping as another message entered the channel. A breath hitched in my throat when I saw that it came from Strange Davie. </p>\n\n<blockquote>\n<p>That was fun ! Play another game ? :joy: :joy: :joy:</p>\n</blockquote>\n\n<p>Before I could get to my laptop, Julie replied. </p>\n\n<blockquote>\n<p>@StrangeDavie This isn’t funny. Why are you acting like this?</p>\n</blockquote>\n\n<p>Strange Davie sent back the same set of joyful emojis. I didn’t know how to reply. Henry was the opposite of me, however. </p>\n\n<blockquote>\n<p>don’t message him Julie </p>\n\n<p>@StrangeDavie what did you do to Lily?!</p>\n</blockquote>\n\n<p>I thought Strange Davie would ignore him, or just sent the emojis again, but his answer only made me feel even more sick. </p>\n\n<blockquote>\n<p>She helped me with my first challenge ! :joy: :joy: :joy: </p>\n</blockquote>\n\n<p>I had to jump in before Henry exploded at him. </p>\n\n<blockquote>\n<p>@StrangeDavie Can you explain what your words mean, please? How did she help you with your first challenge? Were you with her before she went to her office? </p>\n</blockquote>\n\n<p>Henry stopped typing. I felt like I regained the slightest bit of composure back. There could only be inward begging from me that Henry would let me handle things, and not aggravate anyone else. I knew that the rest would let me take the lead, even if I didn’t really want to, but Henry was the problem. I might not be sure of which direction I should head in, but it would be better than him being so volatile. </p>\n\n<blockquote>\n<p>She was the posie to my ashes ! :joy: :joy: :joy: </p>\n</blockquote>\n\n<p>I lurched from my desk. There was no doubt in me that I was dealing with a fucked up individual. I didn’t want to touch my keyboard anymore. A burst of nervous laughter erupted from me. Forget leadership, forget drama, I wanted to stick to my rule of not getting caught in the cross-fire. </p>\n\n<p>I stared at the screen. No one was replying. I wished that Strange Davie would say “Kidding, sorry” but there was no apology. My thoughts were jumping everywhere. I would explain everything I thought of here, all of my links and connections, and my attempts to rebuke them, but the list would be too long. The biggest theory I had was that this fucker was either a troll or he was planning Lily’s death even before joining the group. But was it only Lily? \nI had to reply. There was no way around it. I mean, I could just kick him out there and then but… There was that one strand of gruesome notion I had. Why display so much information on Lily’s death here? Why not get to her through any other way? Why even show us the video? Why here? Why us? </p>\n\n<p>These words were the best I could give:  </p>\n\n<blockquote>\n<p>What game are you playing, Strange Davie? </p>\n</blockquote>\n\n<p>His reply was instantaneous. </p>\n\n<blockquote>\n<p>I’m helping to complete our bucket lists ! I am sorry I did not help Lily well . I promise I will do better next time . Who wants to be my next partner ? :joy: :joy: :joy: </p>\n</blockquote>\n\n<p>I was at a loss. How could I reply that? I wanted to know what was happening, but I would be damned if I let myself be played by him. No one was stupid enough to fall for that question. Especially when Lily was the first to agree to play with him. </p>\n\n<p>But stupid Kyle wasn’t as intellectual as I thought. </p>\n\n<blockquote>\n<p>I’ll play. </p>\n</blockquote>\n\n<p>No matter what I typed afterwards onto that channel, nothing could send. I tried all the other channels. Nothing worked. I couldn’t even fucking <em>breathe</em>. Kyle, that <em>idiot</em>. Henry was right. <em>Idiot idiot idiot!</em> Stupid Kyle who wanted to prove everyone wrong!</p>\n\n<p>Henry’s DM was the only one to stop me from switching off my laptop completely and risking it to school so that I could surround myself with IRL <em>safe</em> friends. I didn’t realize that DMs could still work. He was as equally pissed and worried as me. But the first thing he asked was where Kyle lived. I checked and saw that it was another state that was an airplane flight away from where Lily lived. </p>\n\n<blockquote>\n<p>Do you think Kyle would… ? </p>\n</blockquote>\n\n<p>I asked him hesitantly. His reply had more confidence in the guy than me, to my surprise. </p>\n\n<blockquote>\n<p>Kyle wouldn’t go off with a random stranger</p>\n\n<p>maybe he’ll be okay</p>\n\n<p>maybe</p>\n\n<p>but what’s wrong with the channels?</p>\n\n<p>why can’t we send anything through them</p>\n</blockquote>\n\n<p>I admitted that I didn’t know. It was a mess. I didn’t know how any of this could happen. I searched online for answers on frozen channels, but there was nothing that fitted what we were going through. Henry advised me to keep a friend nearby, so I called one of my closest friends to come over once his classes were done. </p>\n\n<p>I’m just going to stop here and update the story later on. I mean, the fact that I’m posting all of these updates shows that I’m okay so don’t be too anxious over what you think happened to me. If I knew that I was going to be safe throughout the entire affair, I would have dug a little deeper. Helped the rest more. I don’t know. I’m a failure of a moderator. But at least through posting the story here, you might know what to do if something like this happens to you and your friends. </p>\n</div>\n","author":"snekcact"}