{"rank":"22","title":"Series - We’re All Monsters but I’m different – Part Seven","id":"8kbrr4","url":"/r/nosleep/comments/8kbrr4/series_were_all_monsters_but_im_different_part/","time":"1526634441000","body":"<div class=\"md\"><p><a href=\"https://redd.it/8bou3t\">Part 1</a> <a href=\"https://redd.it/8cb7ts\">Part 2</a> <a href=\"https://redd.it/8d4g9t\">Part 3</a> <a href=\"https://redd.it/8eabus\">Part 4</a> <a href=\"https://redd.it/8gfyum\">Part 5</a> <a href=\"https://redd.it/8i4lw8\">Part 6</a> <a href=\"https://redd.it/8kbrr4\">Part 7</a> <a href=\"https://redd.it/8mfb5f\">Part 8</a></p>\n\n<p>Dear reader, my Spanish is not so good, I can speak it a little, but not really write it. If something is obviously wrong, I&#39;d be grateful if you could leave a comment with the correct Spanish.</p>\n\n<p><strong>I&#39;m not myself</strong></p>\n\n<p>I ended up just lounging around the hotel after my rampage in the Mexican wilderness. I had trouble sleeping. </p>\n\n<p>It wasn’t guilt, to be clear, in fact I felt indifferent to that event. Like it didn’t really matter much. That should have been a red flag, I’m not usually that callous, something had changed in me.</p>\n\n<p>I could feel something of them, moving around in me, echoes of their memories.\nThree of the dead were similar, filled with anger, lust and a desire to do violence at the drop of a hat.\nThe fourth, the Man I killed as he reached the door, was different. I felt his sorrow, his deep regret, and a self loathing that comes from pretending to be someone he wasn’t.</p>\n\n<p>I had flashes of alien memories, murders, rapes, and places visited. Childhood memories mixed in with mass murder, criminal activity and the torture of victims.</p>\n\n<p>I had a vivid nightmare, my victims sat around a table in their desert shack, their hearts sitting in front of them. </p>\n\n<p>Still beating.</p>\n\n<p>We we’re playing highest card wins, picking cards of a deck in turn, and then revealing them all at once.\nI kept drawing the highest card, and one by one, I ate their hearts. Then it was just me and victim number four.</p>\n\n<p>He turned over a Joker, and I turned over the Ace of Spades. \nHe gave me a sour smile, and pushed his heart across the table to me.</p>\n\n<p>“You won that game.” He said bitterly.\n“But you won’t win them all.”</p>\n\n<p>I looked down at the table, the beating heart still connected to arteries through a gaping chest wound, was mine.\nI reached down, and ate it.</p>\n\n<p>I awoke in terror, no more sleep for me that night.</p>\n\n<p>After seven days of insomnia, and constant haunting , I decided I needed to get back out into the wilderness. The Desert might cure me of this funk, I thought, but something else was driving me.</p>\n\n<p>I won’t lie, and say I turned over a new leaf. I didn’t, I went hunting.</p>\n\n<p>I started tracking cartel men, I had visions of their faces in my mind from dead men’s memories, and some bloody internal compass pointed me to them. </p>\n\n<p>Many were deep inside Mexican territory, some were surprisingly far north, well beyond the border.\nI started to stalk those closest. I went into Mexican towns and cities, eventually liberating a cartel car, and its owner’s heart.</p>\n\n<p>I hunted up and down the border, about eighty miles or more inside Mexico, I picked men off. Some by themselves, some in pairs. I was stacking ghosts at an alarming rate, but I was unmoved. I had gone beyond justifying it to myself, I did it because I could.</p>\n\n<p>Eventually, ‘El Diablo’ became a thing, the gangs were getting nervous and started constantly traveling in groups of four or more. No more midnight runs for cigarettes, they went into lock down.</p>\n\n<p>It didn’t matter, I just moved on, into new territory.  The bodies were piling up, and I eventually absorbed the memories of a man who’d attended a meeting of minor bosses. They had been blaming each other for staff losses, but they realized something weird was going on.</p>\n\n<p>They had assumed it was a new cartel, or the CIA. But someone caught me on security camera, they knew what I could do, and had an idea of what I looked like.</p>\n\n<p>But what caught my attention was the image of a house that came up again and again, a house with piles of money.</p>\n\n<p><strong>La Hacienda</strong></p>\n\n<p>It took a few weeks, but I finally found the right town, and the right house. On the way there I brought myself a ’leetil gift’, and pocketed it for future use. I watched, and waited until nightfall, passing the hours alert and hungry.</p>\n\n<p>There was some traffic in and out of the house nestled inside a high walled compound, but it settled down around seven in the evening. It was rather nondescript, no armed guards patrolled the grounds, and it could easily pass the ‘just an ordinary house’ test.</p>\n\n<p>Sensing a kind of drowsiness coming over the occupants, I slipped on the cloth wrestling mask and jumped the wall in an easy leap. \nNow I was a crime fighting super hero.</p>\n\n<p>Yay me.</p>\n\n<p>I paused at the end of a disheveled garden, which was being landscaped, and watched the house a moment longer. \nSecurity camera’s. </p>\n\n<p>Well, as long as the mask stays on, I didn’t care.  You can cover a lot of ground running at forty miles an hour, running to the side of the house I jumped straight up just below a balcony, and landed silently.</p>\n\n<p>Everything slowed down, my senses sharpened, and I could hear and nearly SEE the occupants. </p>\n\n<p>Breathing, heartbeats, and movement. </p>\n\n<p>The house walls were almost transparent to me.</p>\n\n<p>A large collection of people occupied an upstairs room. That made no sense. Downstairs, five men talked and drank. I decided to check out the top floor before causing mayhem.</p>\n\n<p>The sliding door to the bedroom next to the balcony was locked, but, the window was ajar, it had a security latch keeping it from opening wide. I twisted it slowly, and it broke quietly. I was in.</p>\n\n<p>The room was modern, and tidy, I moved across to the upstairs corridor and carefully sniffed the air. Sneaking like a cat burglar from a budget movie, I hammed up it, creeping like a cartoon villain just to amuse myself.</p>\n\n<p>I listened at the room with the mass of bodies, dozing or lying quietly, something was well off. I smelt sorrow, and fear, this was not a happy slumber party.\nI turned the door handle carefully, and nudged the door open, all the while listening for the Men below.</p>\n\n<p>The room was lit by the external street light passing through thin curtains. Five Women were held captive, they were shackled to a bar mounted to the floor. In the corner of the room was a bed. They lay on cheap mattresses. One stirred and looked at me, fear grew in her and she began to weep soundlessly.</p>\n\n<p>I gestured gently “Rescate. Seguro.” She looked unconvinced. I need her to keep calm, one scream and I’d lose the element of surprise.\n“Libertad...” I pointed to the window, and the world beyond.\n“Escapar.” Then I quietly tapped my chest “Libertador”.</p>\n\n<p>There was a stirring in the room, and some more fright, some hushing and quick whispering about who the freak at the door was. All five women were now awake, I slipped into the room and carefully shut the door.</p>\n\n<p>Pointing to the padlocks keeping them chained, I asked.\n“Quién tiene la llave?” Who has the key?\nA woman, eyes dark and gaunt, pointed to her throat.\n“El hombre con un tatuaje aquí”, she whispered,  I nodded “Entiendo”, I understand.\nMaybe I could have broken the locks, but I doubted myself.</p>\n\n<p>There was movement from below, I even turned my head to listen, “Alguien viene.” I whispered, as footsteps came from the end of the corridor.\n“Shhhhh.” I hissed, “todo estará bien”</p>\n\n<p>I flattened myself against the wall near the door, I’d be the first thing he saw when the door opened, I had to be quick. The door handle turned, and he stepped inside.</p>\n\n<p>I grabbed his throat, squeezing his windpipe closed, and pushed him to the ground so quickly he didn’t even croak a yelp. I was flush with a profound and deep love for him, it was an awe inspiring affection, time literally stopped as I admired the figure pushed into the carpet before me.</p>\n\n<p>I drove my mouth into his back, and his heart popped out through a small hole between his shoulder blades, filling me with a nuclear explosion of joy and gratitude.\nThere were gasps, and I felt the Women move further from me, I had hoped the room was too dark to see my attack. </p>\n\n<p>Guess not. </p>\n\n<p>“El Diablo.” Someone said.\n“Si.” I whispered back. “No para las señoras, estás seguro.” I didn’t look at them, just in case the heat of the hunt disputed that.</p>\n\n<p>I picked the dead man up, and easily carried him into the Bedroom opposite their prison. A second set of footsteps came up the stairs, I slipped the door almost shut, ready for another snatch and grab.</p>\n\n<p>The Man stopped before he reached the Woman’s prison cell. I looked down at the carpet in the bed room.</p>\n\n<p>Blood.</p>\n\n<p>Lots and lots of blood. “Oh...crap” I thought to myself. There was a quick retreat from the hallway, and rapid hushed chatter from below, then someone called out.</p>\n\n<p>A joking voice said the equivalent of, “Hey Miguel, the boss is on the phone, come back down.”\nYeah, there was also the sound of guns being cocked. </p>\n\n<p>I looked around me. I could call it quits and go, just leap out a window and bolt for the fence.</p>\n\n<p>I looked at the floor, it was transparent.</p>\n\n<p>I did a double take. I could see a man below, holding a shotgun. I glanced up, city light stained cloud and a few stars.</p>\n\n<p>I felt the love for my prey run out of me, like ice water, it was replaced with a pure love of power.\nI bunched up in a crouch, and then leaped up, the world virtually stopped spinning. I smashed straight through the floor, landing in a shower of debris and plaster behind the Gun man.</p>\n\n<p>I grabbed him from behind and sucked his heart out, punching through his spinal column, which erupted from his shattered back, in a shower of blood. </p>\n\n<p>Two men, turned slowly, too slowly towards me. One was waiting at the foot of the stairs, the other in the middle of the room, automatic rifles at the ready.</p>\n\n<p>I threw my victim at the nearest, both bodies exploded out through a  glass sliding door, and they landed heavily twenty feet away in the garden.</p>\n\n<p>The guy near the stairs panic fired my way, I took three giant steps and kicked a heavy chair at him. \nIt cleared the room nearly instantly, and it smashed him through the wall. I felt him die. His spirit, or soul, just winked out.</p>\n\n<p>Glass crunched under foot, as I strode towards the man with a tattooed neck in the garden. He was wrecked, probably dying, he was still trying to raise himself up onto his elbows. Blood was streaming from his nose and mouth, and he barely saw me as I knelt next to him.</p>\n\n<p>“¿Dónde está la llave?” I asked.\n“Wha?...” He spat blood, and lowered himself trembling, to the grass.\n“Las mujeres,...” I pointed to the house, “¿Dónde está la llave?” I repeated.</p>\n\n<p>He was fading fast, so I checked his pockets, and found a key ring complete with car keys. \nI don’t why, but something like pity came over me, as he lay shuddering on the ground. It was a dreadful sight, I kill quickly, and this was a crap way to die.</p>\n\n<p>I patted him on the shoulder, as his shaking, and rasping breath stopped.\n“Adiós amigo.”</p>\n\n<p>Back inside I sniffed out the hiding place of the loot I had hoped was there. I found a black duffel bag under the floor beneath a sink, it was filled with money. Wrapped in plastic like they do at a bank.</p>\n\n<p>I had never seen so much cash, and it was all new, and all American. That confused me, why do they have so many Gringo dollars? Not that it mattered, it was coming with me.</p>\n\n<p>I went back upstairs, and unlocked the Women’s chains. They rubbed their ankles, and looked cautiously at me.\n“Qué hacemos ahora?” One Lady asked me.</p>\n\n<p>I opened the bag, and handed each of them a slab of Ben Franklins for their troubles.\n“Salir de México, no vuelvas”\n“Que?”\n“Correr desde México”\n“Tu español no es bueno” Someone said.\n“Si…” I agreed, “My Spanish is no good.”</p>\n\n<p>I lead them down stairs, and took them into the garage, there was yet another black three Litre SUV parked inside, we left in Tattoo man’s truck. I dropped them off in a different town, at a decent hotel. Then I drove to the border, and dumped the vehicle.</p>\n\n<p>It took a couple of days, to get back into the United States, I was glad to be home.</p>\n\n<p><strong>One Good Thing</strong></p>\n\n<p>I had been running for too long, the adrenaline took its toll on me, not my adrenaline, my victims. It puts a load on the liver to process it, and I was getting frazzled. </p>\n\n<p>It was winter, I needed to hibernate for a while, I rented a place in Laredo, right next to the border. I spent nights just staring at the walls, or watching monotonous TV. I stayed away from Bars, just in case I tranced some poor woman, I was growing afraid of myself. </p>\n\n<p>One night cabin fever got to me, and decided to go out for a walk along the river.  I began picking myself apart, I’d done too much killing, things I couldn’t fix and I was filled with the ghosts of the dead. A kind of melancholy crept into me, would I carry my dead victims forever?</p>\n\n<p>After about an hour, the smell of death blew my way, reluctantly I followed it. I heard sobbing first, and it took another quarter hour to locate the source, I was in no hurry.</p>\n\n<p>“Papa.”  A child’s voice. </p>\n\n<p>I almost turned around then. </p>\n\n<p>Like I needed this in my day. But I told myself, if I could do at least one decent thing, perhaps I could square some of this mad life with my soul.</p>\n\n<p>I found a young boy, hugging his Father, who lay face down on the cold ground.\n“Hey,...” I said.\n“Papa!” The boy yelled, and he looked at me with a mix of fear and pleading.\n“Ayuda a mi papá” He cried.</p>\n\n<p>I crouched down beside his Father, I could tell he was long gone. But I made the effort to roll him onto his back, and I listened to his chest. He was damp, like he’d been in water recently.\nI sat back up, and shook my head solemnly.</p>\n\n<p>“Tu padre está muerto” I said, “Lo siento.” \nThe boy hugged his father and cried, I backed off, and left him to his grief. I figured sooner than later the Border Patrol would swing by, and pick him up, we were so close to town they couldn’t miss him.</p>\n\n<p>And then, I had a truly, spectacularly bad idea, I’d help him instead.\n“Cuál es tu nombre?” \n“Arturo” He mumbled.\n“James” I said, tapping my chest.\n“Donde esta tu mama?”\n“En cielo” he said and pointed to the sky. “In heaven?”\n“Si.”</p>\n\n<p>I pointed to his Father, “Teléfono”, and I held up my budget cell phone.\nArturo pointed to a backpack.\n“I’m just going to look for Papa’s phone, ok?” He nodded, but looked uncertain. He was probably around eight, poor kid.</p>\n\n<p>Everything was in Spanish, and the phone was a simple model, but I managed to find his contacts.</p>\n\n<p>“El Tio?” I asked.\n“Si.” Great, he had family alive somewhere.\nI pointed back across the river, “El Tio in Mexico?”\n“Si.” He started saying a lot, in Spanish, too fast and rich for me to catch, so I showed him the contacts list on his dad’s phone.</p>\n\n<p>He pointed to a name and number, “El Tio”.\n“Your Fathers Brother” I pointed at his Dad, “El Tio is Papa’s hermano?”\nHe just nodded.</p>\n\n<p>“Ok.” I pushed dial on his Fathers phone.</p>\n\n<p>It was early evening, I hoped he was home. The phone rang a while and then a Man’s voice answered the call.\n“Hola, Miguel? ¿Estás en Texas?”\n“I’m calling on behalf of your nephew, Arturo. Tu hablas ingles?”\n“Si, Yes I speak English, who are you?”\n“I’m with your nephew, Arturo, he’s ok,...” I handed the phone to Arturo.</p>\n\n<p>The kid talked for a while, there were more tears, and I heard cries and strong emotion coming through the tinny phone speaker.</p>\n\n<p>After a while the kid handed me the phone.\nThe man’s voice was shaky, but he was trying to keep it together.\n“We can’t cross the border, into Texas, no pasaporte. Can you bring him to us?”\nI sighed, damn it, now I was stuck with the kid. </p>\n\n<p>Dumb, dumb, dumb.</p>\n\n<p>“Si.”  I said.\n“I’ll get them both across the river, and call you.”\n“Both?” He said puzzled.\n“Si. Leave it to me.”\nThere were more questions, and more arrangements, but in short I was now taking Arturo across the Rio Grande. Not normally a problem for me, but now I had a kid and a corpse to carry.</p>\n\n<p>“Arturo, did you cross in a boat?”\n“Si.” He seemed uncertain with that yes.</p>\n\n<p>To cut a long story short, I found his Fathers makeshift raft, and put my monstrous hunting strength to good use for a change. I carried his father, to the river, got them both safely on the raft and paddled across.</p>\n\n<p>I took a while to get across, and then back up stream.  I found a dirt road, and we walked for a while.\nI called his Uncle, and told him where we were, gave him some map coordinates. And we waited.</p>\n\n<p>I made a make shift bed for Arturo, he slept a little, and I watched over him as he twitched and mumbled. </p>\n\n<p>At dawn, his uncle showed up, with two hefty looking friends, there were a lot of tears. I looked away, tried to keep a respectful distance.</p>\n\n<p>We loaded the dead man onto the back of his truck, and they covered him with a blanket, they showed him a lot of respect and said some prayers. </p>\n\n<p>I don’t know why, but I felt useless.</p>\n\n<p>I retrieved a fat roll of U.S dollars from my pocket, and offered them to the Uncle, he was confused. Maybe a little offended.</p>\n\n<p>“For the funeral.”\n“No, not needed.”  He started, “Please.” I said and hoped I looked sincere. He nodded, and took the money.\n“Gracias.”  He said solemnly.</p>\n\n<p>He offered me a ride, but I turned it down. And with that, they drove off into a Mexican sunrise.</p>\n\n<p>The dawn carried a mixture of cold air, the smells of nature, and a distant scent I knew too well.\nOne good thing will never be enough, I said to myself, as dead men’s ghosts churned inside me.</p>\n\n<p>I sniffed the air.</p>\n\n<p>Time to go hunting.</p>\n</div>\n","author":"Zenrebok"}