{"rank":"13","title":"That Bi*ch Shannon","id":"8kc2tf","url":"/r/nosleep/comments/8kc2tf/that_bich_shannon/","time":"1526638538000","body":"<div class=\"md\"><p>Sorry in advance for the language and how incoherent it probably is, I was in a bit of a panic writing it down. </p>\n\n<p>It’s currently Monday the 14th of May 2018 when I’m writing this, and unlike lots of stories on reddit (don’t mean to fourth wall break or anything), this is all true. 100%. Unfortunately. \nI mean, it is about my dreams so the “real-ness” of it all is entirely up to opinion. Anyway, on with the story. </p>\n\n<p>Okay, so I’ve always been one to have scary nightmares now and then, and annoyingly vivid ones at that. Like, ‘when I was 8 I dreamt of my dad murdering my sister and brother and setting my Ma on fire in front of me’ kind of scary if that’s anything to go by. </p>\n\n<p>Anyway, despite the scary dreams, I’d never experienced sleep paralysis before - that is, until a few months into my chemo. (I was diagnosed with a cancer named Ewing’s Sarcoma (you can look it up for more details on it if you’d like) in 2016, finished treatment last December, and was given my N.E.D - No Evidence of Disease - in January this year)</p>\n\n<p>But yeah, I’d only ever heard of Sleep Paralysis before, but I’d watched the documentary on Netflix so I knew a bit about it. And may I just say - it really didn’t look like fun. </p>\n\n<p>I can now confirm that no, it really isn’t. </p>\n\n<p>My first episode happened late last year, early this year, and honestly, I almost shat myself. \nIt went like this; </p>\n\n<p>It started off as a normal dream; I was sitting up in the lounge room w/ my ma and brother (my sister moved out last year) eating breakfast. I finished before them and decided to go downstairs to go back to sleep, as one of the glorious side effects of chemo is (in my case anyway, as everyone’s journey is different) extreme fatigue. Like, sleep 36 hours no problem waking only to pee kind of fatigue. </p>\n\n<p>But anyway, I went downstairs and was about to walk into my room when I noticed my brother’s room (the one right next to mine) was different. Like, had different furniture different. For some reason it just terrified me. Yeah, I know, i’m not sure why either. But yeah I was just absolutely scared out of my mind, and tried to yell out to Mum when I noticed I couldn’t. I couldn’t make a single noise. </p>\n\n<p>And then suddenly I felt someone behind me. Like, you know when you can just FEEL that someone’s there? Yeah. That. \nI tried to scream louder and, aware that I was dreaming, tried to wake myself up (a skill I’d squired over my lifetime of nightmares). </p>\n\n<p>When it didn’t work the panic set it. \nI tried screaming louder and louder and tried to force my eyelids open, when I heard the slightest hint of a girly giggle behind me. \nLike the thing behind me was laughing at me and my terror. </p>\n\n<p>And then suddenly my eyes snapped open and I was awake, lying in my bed on my left side facing the back wall with some sliding glass doors leading to my balcony. \nAt least, I thought I was awake until I quickly realised I couldn’t move. \nI was paralysed, only able to move my eyes. </p>\n\n<p>‘So’, I thought, ‘this is what sleep paralysis is like.’\nAnd honey, I didn’t like it one fuckn bit. Nope. Unsubscribe please and thank-you. </p>\n\n<p>Anyway, I saw some movement out of the corner of my eye in my doorway where I’d “been” just moments before. I snapped my eyes onto whatever it was and now just really wish I hadn’t. </p>\n\n<p>What I saw was a girl, no older than 20, walking slowly into my room and towards the back wall with the sliding doors. Except, she was wrong. \nLike, I don’t really know how to describe it. She was just... wrong. </p>\n\n<p>Her eyes were that bit too big and weirdly slanted into a permanent evil glare - like a predator stalking its prey. They were also bloodshot and an odd mix of yellow and red, with weirdly tiny pupils. \nHer skin was a pale pinkish grey, with veins popping out - but she didn’t look too sickly. \nLike, normal.. but wrong. </p>\n\n<p>Her nose was too angular with almost no nostrils, but it also wasn’t too far from a normal looking nose. \nHer jaw and cheekbones were also oddly sharp, and her hair seemed to float ever so slightly, like it moved in slow motion, bouncing in time with her steps as she glided across the room. Her body was also pretty normal looking, but there was just something about it that was.. off. I still don’t know what. </p>\n\n<p>But her mouth. </p>\n\n<p>Just thinking of it still sends shivers down my spine. </p>\n\n<p>It was curled up in a permanent grin, like she’d just found out her crush liked her back. But it was too wide. It stretched further than it should have - like almost on-par with the grinch, just not quite as wide or cartoonish. </p>\n\n<p>Just... wrong. </p>\n\n<p>Anyway, as she moved closer and closer towards me and I tried to scream or move or ANYTHING to wake myself up. \nThis bitch was scary and made my skin crawl, like I’d just seen something I definitely was NOT supposed to, like a gory crime scene before the police had blocked it off. </p>\n\n<p>I tried closing my eyes - nothing. \nI tried to twitch my fingers - nope. \nI tried forcing my eyelids open again - nada. \nI even tried making myself pee the bed (yes, I was that desperate) - but again, nothing. </p>\n\n<p>All the while she just kept creeping closer and closer and closer until she was standing right beside my bed, towering over me and just looking down at me with that damned smile. \nI felt tears start rolling down my cheeks and decided to grab the opportunity to try again to wake up. </p>\n\n<p>My body was doing SOMETHING, so this might have been my only chance. \nI desperately tried to force my eyelids open, and suddenly this bitch was laughing at me again. But louder this time. The more I struggled and cried the harder she laughed. \nAnd then I blinked awake. \nShe was gone. \nI was safe. </p>\n\n<p>Or so I thought. </p>\n\n<p>My damned comatose like fatigue suddenly kicked in high gear and I was frighteningly drowsy - like after a few seconds of anaesthesia going in through my CVL in preparation for one of my operations. Yeah, THAT drowsy. </p>\n\n<p>I didn’t know which way was up as everything was blurry and hazy and my mind couldn’t focus on anything except wanting to go back to sleep; all the while I was still sobbing my eyes out, desperately trying to stay awake. \nI blinked again and to my complete horror, there she was again. This time leaning even closer, her putrid, rotten garbage smelling ass breath seeping into my nose. </p>\n\n<p>‘But I’m awake!’ I cried (in my mind of course, bc the bitch still had be paralysed and unable to make any noises). \nShe laughed harder and my skin began to crawl violently, making me itchy all over and sending sharp jabbing tingles down my spine and through every vein in my body. </p>\n\n<p>I blinked again and she was gone. </p>\n\n<p>As I tried desperately to stay awake, fighting my body with every ounce of strength I had, I kept blinking, and she kept flashing in and out of existence; closer to my face and laughing harder each time. </p>\n\n<p>It got to a point where I didn’t know what was real anymore. I couldn’t tell when I was awake and when I was asleep. \nAnd for some reason, I think she was loving every second of it - messing with my brain like that. </p>\n\n<p>To this day I’m still not sure when I was awake and when I was asleep. </p>\n\n<p>But anyway, I finally managed to roll myself over to face my other wall, and I thought I’d done it. That I was free. </p>\n\n<p>Ol’ grinch here had a different idea. \nI suddenly felt a weight on the bed behind me and I just KNEW that she had climbed on behind me. </p>\n\n<p>I could hear her quiet giggles slowly getting louder and more insane sounding and she crept closer and closer; the smell of her breath getting stronger and warmer. At this point I could feel it on the back of my neck (my hair was only really just starting to grow back and wasn’t long enough to cover my neck), making every hair on my body (which wasn’t many lol) stand on end.  </p>\n\n<p>She was so.. so close. </p>\n\n<p>It was when I felt her fingers begin to trace gently up my spine, sending sharp twangs of pain through my nerves wherever she touched, until her hand was reached over my face, as if ready to claw at me that I shut my eyes so tight it started to hurt, and I sobbed, honestly terrified for my life. </p>\n\n<p>My skin was crawling and I felt dirty, like I was covered in a layer of moving grime. \nShe let out one last giggle under her breath, and then just as quickly as it had all begun, it was over. She was gone. I could move. \nI was safe. </p>\n\n<p>It was really then that the full weight of what happened hit me. I was okay. It was just a shitty, horrible nightmare experience and I could now say I’d experienced sleep paralysis. \nBut yeah, 10/10 do not recommend. </p>\n\n<p>Anyway, a few weeks pass and I’m fine: no more episodes and not even any normal nightmares. Just some honestly pleasant dreams. </p>\n\n<p>But then to my horror, one night I find myself frozen once again - paralysed. And who better to greet me to another night of almost shitting myself then the whore of Babylon herself; Ol’ smiles. </p>\n\n<p>Anyway, this became a regular occurrence. She’d pop up every few weeks, sometimes less and sometimes more, terrifying me to the very pit of my being each time. Also, I eventually decided to call her Shannon, after the name I’d given my tumour (kinda fit, tbh). </p>\n\n<p>One episode she climbed on top of me and just kinda stroked my face, one time she crawled along my ceiling like a fucking lizard-spider-abomination and just drooled on me, one time she actually cuddled me - like, actually spooned me from behind. Like wtf ?? Shannon tf you doin girl ?? \nWhat a slut. Anyway lol</p>\n\n<p>One such episode, however, she decided to grab onto my leg and squeeze harder than a bloody vice until I was in almost unbearable pain, only to laugh at me as I cried and winced inwardly, unable to do anything but wait for her to let me wake up. </p>\n\n<p>I was screaming and crying and kept telling myself that it was just a dream, it was just a dream, but she was just laughing harder and harder at me, her eyes lighting up with pure glee at my terror. \nIt was like the slag knew what I was thinking, like she was inside my head (which of course she is lol) and just loved tormenting me\n- until finally she let go and her laughter faded into giggles as she finally let me wake. </p>\n\n<p>And much to my horror, when I awoke I noticed a nasty purple bruise on the back of my knee - right where she’d been holding me with her creepy arse fuckn demon fingers. </p>\n\n<p>Of course I know that while I was dreaming, a bruise that I hadn’t yet noticed started hurting or something and my brain turned that into a nightmare surrounding the pain etc etc blah blah blah </p>\n\n<p>Yes I know that, but half asleep, still crying me was so scared and confused and horrified that I didn’t even know what to do myself with myself, only furthering my confusion as to what was real and what wasn’t. </p>\n\n<p>(Idk how to add pictures?? If someone lets me know how I’ll add the picture in- that is if anyone cares lmao)\n— the bruise now, a few WEEKS after the episode (don’t mind my goosebumps lol I had chills from both the cold and thinking about that night)</p>\n\n<p>Now, she didn’t show up for a while after that. I lived quite peacefully with my pleasant, even fun dreams. But I knew it wouldn’t last long. </p>\n\n<p>The next time she showed up (last night), it was different. I could tell. I wasn’t sure how exactly, but it just felt... different. \nLike... heavier. Darker. </p>\n\n<p>It made my skin crawl worse than ever and made me sick to my stomach, a nausea I’d only ever experienced during some of my worst chemo days. \nI can’t even describe what I was feeling. It was just... horrible. Like all the happiness and good in the world was being sucked away (lol Harry Potter much?). </p>\n\n<p>I looked around, pinned in my position, but I couldn’t see that bitch in any of her usual spots (the doorway, climbing out from under my bed, beside me on the bed, etc). Instead, I felt eyes on me, almost as if coming from everywhere and nowhere at the same time.<br/>\nMy mouth dried up and I looked around desperately trying to find her to make sure she didn’t jump out from anyway and scare me even more than I already was. </p>\n\n<p>And finally, there she was - peeking out from inside my cupboard. Yuck, right? </p>\n\n<p>She was still smiling, but she wasn’t laughing. \nHer eyes were darting everywhere, as if tense... or scared? Anyway, she looked as if she was beginning to make a move to crawl out from inside the cupboard, but her eyes seemed to finally land on the sliding glass doors to the veranda outside my room - \nAnd she froze. </p>\n\n<p>Yeah. </p>\n\n<p>It was her turn to freeze up in what looked like genuine terror. And that did not bode well for me. </p>\n\n<p>She slid back even further behind the door, but as she did her smile grew, and she grinned in a way I knew to be her absolute delight at my (about to be) absolute fucking terror. \nI looked out to the veranda, trying to find what she was looking at, while also very much hoping I didn’t see anything. </p>\n\n<p>And then there he was. </p>\n\n<p>I mean, I assume it was a he. I couldn’t quite tell because it was really just a giant, looming black mass, as if made of solid shadows, just staring at me from outside. \nIt was like he couldn’t come inside. I don’t know how I knew that or why I thought that, but I was just certain he couldn’t come inside. At least not yet anyway. \nHe was made of a substance so black it was as if he was just a writhing, slimy absence of matter itself. </p>\n\n<p>And he smelt. Like, really bad. Worse than that whore that was stinking up all my clothes. \nAnd he was just staring at me. </p>\n\n<p>And he felt... idk he was just seeping this feeling. This gut wrenching feeling that I felt in my very soul, like all life was draining from inside me, hiding from this... thing. </p>\n\n<p>I can’t describe it any better than that, but just know that it was the single most dreadful feeling I’ve ever had - worse than the moment I was told I had cancer, if that helps. </p>\n\n<p>All I knew was that he was bad news, and that he couldn’t come inside; at least for now  - and if the slag in my cupboard was scared of him, I was glad the fucker couldn’t waltz right in. \nJust as I was counting my lucky stars, any ounce of hope I had in my heart drained from inside me in one single moment. </p>\n\n<p>A moment that i’m pretty sure I’ll have forever ingrained in my head. A moment that’s going to haunt me for the rest of my life. A moment that’s been playing on a loop inside my head ever since. </p>\n\n<p>A croaky, high pitched, yet as quiet as a whisper cackle echoed from my closet; like nails on a chalkboard. \n“He’s cominggg...” \nShannon finally spoke - \nAnd I wish more than anything in the world that she’d just kept her fat gob shut, the slag. </p>\n\n<p>And then I woke with a start, bolting straight upright in bed, only to notice my room was colder than usual, as it’s coming close to Winter here in Australia and the nights were reaching temps of 10 degrees and below. \nI pulled the blanket further around me and looked around, brow furrowed in a sleepy confusion. </p>\n\n<p>The sliding doors were now open. </p>\n\n<p>And yes, I know the doors were probably open before I went to sleep but I just could have sworn my Ma closed them a few days ago to stop the cold air coming inside. </p>\n\n<p>I just don’t know what to think anymore and I know it’s all in my head but I just... I’m terrified to go to sleep anymore. I don’t want to. I can’t. I just can’t have another episode. I just absolutely cannot find out who or what that shadow man really was or what he wanted - or why Shannon was so scared of him. I just. Can’t. </p>\n\n<p>please help me stop panicking ??</p>\n\n<p>ENTRY 2:\nIt’s been a few days (is now Friday) and I’ve only just worked up the courage to post my story. \nI haven’t seen either of them again, or had another episode, but idk that just makes it feel worse to me. I’m living with this sense of impending doom and I don’t know why because they’re JUST. DREAMS. </p>\n\n<p>They’re not real. I know they’re not. \nSo why do they so much like they are? \nEvery morning I’ve been waking up with a start, as if half expecting there to be some shadow demon looming over me and gobbling me up or dragging me into a hell dimension - I don’t know what shadow men like to do lmao </p>\n\n<p>But yeah I just haven’t felt... ‘right’ since. Like something in my life is sitting just that slight but off but I just can’t place it. </p>\n\n<p>The bruise is still going strong (no surprises there), and I don’t feel comfortable anywhere. \nThe darkness is now beginning to make me panic and I’ve just kind of started to accept that I now live in a state of constant “somethings not right. Idk what, but it’s something...” you know? When you just feel... odd? Not sick, or scared, or anxious or angry or anything really, just... off. </p>\n\n<p>It’s a feeling I’ve long since been acquainted with because it’s the same feeling before I usually chuck a fever, come down with sepsis, or, idk, get diagnosed with cancer lol\nBut yeah. I’m just at a loss, really. And i’m just over it, you know? Just sick of all of this and want to go back to actually ENJOYING my sleep and looking forward to it.</p>\n</div>\n","author":"maliawinters"}