{"rank":"4","title":"Demon Scars [Part 5]","id":"8kcave","url":"/r/nosleep/comments/8kcave/demon_scars_part_5/","time":"1526641289000","body":"<div class=\"md\"><p>Part 4 of 8: <a href=\"https://www.reddit.com/r/nosleep/comments/8k3b5m/demon_scars_part_4/\">https://www.reddit.com/r/nosleep/comments/8k3b5m/demon_scars_part_4/</a></p>\n\n<p>The day of the ritual had come. I was nervous as hell. </p>\n\n<p>I instructed Shane to meet us at Randy&#39;s in the afternoon. I told him not to tell anyone because we had a box of dirty magazines for him. </p>\n\n<p>He told his parents that he was going to the local video arcade to dump some quarters into the Street Fighter 2 machine.</p>\n\n<p>I got to Randy&#39;s house early. He seemed abnormally calm. </p>\n\n<p>He said he had spent all morning listening to Slayer (Seasons in the Abyss) and playing out the sacrifice in his head. </p>\n\n<p>The consensus among Slayer fans is that Reign in Blood is their finest album, but I disagree. </p>\n\n<p>Reign in Blood came at the peak of the thrash craze in 1986 and was built on raw speed. </p>\n\n<p>The following album, South of Heaven (1988) divided fans at the time with its slower song structures and dynamic confidence. </p>\n\n<p>Metallica&#39;s And Justice for All, released the same year had a similar affect on fans and suggested that the thrash genre was maturing. </p>\n\n<p>Fans were viewing thrash as passé and moving towards more extreme music with the evolution of death metal. </p>\n\n<p>Nonetheless, bands like Slayer were forced to innovate, which is why I believe 1990&#39;s Seasons of the Abyss is their finest hour. </p>\n\n<p>Seasons returned to the speed of Reign in Blood with the diversity of South of Heaven and had a dark personal tone that was unique for metal at the time. </p>\n\n<p>Anyway, Randy had one of his decorative knives out and guaranteed its sharpness and lethal ability. </p>\n\n<p>He stressed that it was necessary that this blade deliver the killing blow based on some reading he had done.</p>\n\n<p>He had collected some knifes from the kitchen and gave one to me. While it was my job to knock out Shane, he said it was always better to be prepared. </p>\n\n<p>I told him it would make Shane nervous if too many knives were lying around the basement and suggested I keep a claw hammer nearby instead. </p>\n\n<p>As we went out to the shed to collect the hammer, we rehearsed the plan of moving the body. </p>\n\n<p>Out the door, past the big tree, straight into the woods, and up to the clearing. </p>\n\n<p>It gave me chills to look at the tree after that terrible night. </p>\n\n<p>I considered myself fortunate that it was so dark that night and that I saw nothing more than the grim outline of the hanging bodies. </p>\n\n<p>Mind you, the way my imagination had tormented me by filling in the details with its nightmarish tapestry was no treat either. </p>\n\n<p>Even though it was mid-day, the thought of a heinous cannibal lurking in the woods made my skin crawl. </p>\n\n<p>Randy, knowing my very thoughts, suddenly blurted out that he had prepared wooden torches for our defense against the creature. </p>\n\n<p>He instructed that we move fast after nightfall to avoid our lit torches attracting any attention and thereby being, &quot;betrayed by the fire&#39;s light.&quot;</p>\n\n<p>We returned to the house, Randy entered first. I looked to the sky to see storm clouds gathering.</p>\n\n<p>I had second thoughts of the meek hammer in my hand and collected a long-handled axe used for chopping fire wood and snuck it into the basement. </p>\n\n<p>The time was near and all our preparations were wrapped up. All we could do now was wait impatiently for the offering to arrive. </p>\n\n<p>There was a knock at the door.</p>\n\n<p>Shane had arrived. Randy invited him in under the planned ruse of exchanging porno mags. I listened restlessly from the basement as they made idle talk. </p>\n\n<p>I couldn&#39;t believe how calm Randy was as he said the magazines were upstairs in his room. He told Shane to wait as we had a gaming tournament planned for the evening. </p>\n\n<p>I heard footsteps shuffling around upstairs amongst the ensuing rain storm outside. What the fuck were they doing up there? My anxiety soared. </p>\n\n<p>Eventually they came downstairs with Shane leading the way. </p>\n\n<p>He had never been to Randy&#39;s before and looked around at the basement&#39;s sparse furnishings and the makeshift altar we had scrawled on the floor with black tape and marker. </p>\n\n<p>The candles hadn&#39;t been lit yet and sat carefully around the room. </p>\n\n<p>He casually looked away from it and started talking to me about a new game magazine he had been reading. </p>\n\n<p>As his annoying little voiced spoke to an uncaring room, I grasp the hammer under my seat cushion to stop my hand from trembling. </p>\n\n<p>Here this idiot was droning on, oblivious that his final words would be about the Legend of Zelda or some bullshit. </p>\n\n<p>Randy stood to the side with his arms crossed and the knife concealed in his waistband. </p>\n\n<p>I took a deep breath, withdrew the hammer and sprung.</p>\n\n<p>I swung the weapon. It&#39;s blunt knob catching Shane on the side of the head. His expression went from indifference to shock and confusion. </p>\n\n<p>I swung again, this time striking him square in the forehead. </p>\n\n<p>The look on his face suggested more of an emotional hurt than blinding physical agony. </p>\n\n<p>He dropped to the floor and shielded his face from my fury of hammer strikes.</p>\n\n<p>Let me tell you, killing someone in real-life is nothing like in the movies where the slightest whack to the head conveniently renders the opponent unconscious. </p>\n\n<p>We were not prepared.</p>\n\n<p>In a flash, Randy descended with his knife. He plunged several times to Shane&#39;s chest but the blade snapped off on the breast bone. </p>\n\n<p>It turns out the weapon Randy had purchased was a piece-of-shit decorative knife and not intended for actual use. </p>\n\n<p>I hope he kept his receipt.</p>\n\n<p>Randy stood up in shock as he held the broken handle in his hand with barely a drop of blood spilled. </p>\n\n<p>Shane lay sobbing on the floor with Randy standing above him, frozen with disbelief as our so-called plans were falling apart before us. </p>\n\n<p>I flew to the corner of the room and retrieved the axe. </p>\n\n<p>Shane was still crying and cursing us for what he must have thought was a nightmare that would soon be over. </p>\n\n<p>I raised the axe blade and swung down at Shane&#39;s head. The axe made contact with his hand as it attempted to protect his face. </p>\n\n<p>Two of his fingers were lobbed clean off while the third, his ring finger dangled from a piece of mangled skin. </p>\n\n<p>Fuck the axe was sharp. He rolled onto his stomach as I wound up again. </p>\n\n<p>The ensuing blow cracked through the shoulder blade, spraying blood all over the three of us as Shane&#39;s frantic heart rate painted the room red. </p>\n\n<p>I kicked him in the ribs to free the axe from his back. </p>\n\n<p>He rose to his knees and attempted to escape. </p>\n\n<p>I swung for the neck hoping to decapitate the cocksucker. My aim was off by a margin and the head of the axe landed heavily on his collarbone.</p>\n\n<p>I&#39;m not sure if it was the thunder outside or the breaking of bone, but I heard a booming crack. </p>\n\n<p>The blow left him open for a clean strike to the head. I wasted no time and wound up for the kill shot.</p>\n\n<p>The swing couldn&#39;t have been better placed. </p>\n\n<p>The blade of the axe landed diagonally across Shane&#39;s swollen forehead and through the right eye socket, completely shattering it. </p>\n\n<p>The blade penetrated the bridge of the nose and stopped there. </p>\n\n<p>Suddenly the room was still, the strike proving to be the exclamation point to our fucking ritual.</p>\n\n<p>I let go of the handle as it lay imbedded in Shane&#39;s skull. His bloodshot eyes stared at me as he dropped lifelessly to the floor. </p>\n\n<p>He blinked a couple times as all the life in his body drained away. His labored breathing slowing by the second. </p>\n\n<p>Randy and I were utterly soaked with blood. There was even blood in my shoes. </p>\n\n<p>As I came to grips with the event, I stumbled to the corner of the room as nausea overtook me. </p>\n\n<p>Over the sound of my retching, I heard Randy yelling. </p>\n\n<p>It sounded grotesquely like celebration. He kept urging me to look at the body as I stared down into the pool of vomit. </p>\n\n<p>I couldn&#39;t face the carnage I had created. </p>\n\n<p>Eventually, I turned to see what he was hollering about and there it was. A black cloud hovered above Shane&#39;s lifeless body. </p>\n\n<p>Part 6 of 8: <a href=\"https://www.reddit.com/r/nosleep/comments/8l03vo/demon_scars_part_6/\">https://www.reddit.com/r/nosleep/comments/8l03vo/demon_scars_part_6/</a></p>\n</div>\n","author":"Rich_Brady"}