{"rank":"428","title":"chastitytemperancecharitydiligencePATIENCEkindnesshumility","id":"8kcb7t","url":"/r/nosleep/comments/8kcb7t/chastitytemperancecharitydiligencepatiencekindness/","time":"1526641392000","body":"<div class=\"md\"><p>Some people don&#39;t know what it means to wait for something, but I do.</p>\n\n<p>I was patient when I first met Mrs Beatrice Grace. She was one of the smartest people I ever met save for one fact; her deadbeat husband. </p>\n\n<p>I tried to help as much as I could from a distance, seeing her come into my emergency room time and time again with bruises and bloody noses. She tried to attribute these things to clumsiness, but I saw the truth. \nI saw it in the rage her son held onto. \nI saw it in the scars and pain she dealt with on a daily basis. </p>\n\n<p>I may have waited too long though, for now she is in a coma. I knew her son intended to act with the full intent of killing the sorry son of a bitch dad he had. Her son even admitted this to me in confidence but for the first time in my life I questioned the oath I took as a doctor and said nothing. </p>\n\n<p>It&#39;s made me rethink what it means to wait for something. And whether or not I have been waiting for too long. </p>\n\n<p>You see the reason that I took a liking to the Graces can be attributed to my own situation. \nI live just about thirty minutes away in Carbondale Illnois, with my partner and our two children. \nI&#39;ve been patiently waiting for things to get better, but still they haven&#39;t. </p>\n\n<p>After I saw the bold way that young man acted I decided it was time to make a move as well. I drugged my partner and took them to a warehouse downtown that I use to rent storage space. \nWhen I got to lot 1913a I placed him inside with only some pig feces to feast on. </p>\n\n<p>Being patient has really paid off for me. I went by from time to time to check on him. Sometimes I even go inside to see the skeleton of the man that I once cared for. \nHe doesn&#39;t have a tongue anymore to verbally abuse me, that was the first thing that I cut up. \nHis fingers have been worn down to the bone so that I don&#39;t have to imagine his hands on anyone else. \nHis skin is pulled tight and stretched beyond belief to the edge of his bones and bruises and old pus filled wounds cover him from head to toe. \nToday is the day that I have been waiting for. I&#39;m going to let him go freely. He lost his mind long ago, but I&#39;m sure he will always remember it was me that did this to him. He can wander off to his own tormented death somewhere in the woods, or go pop a few pills and drop dead in a duplex for all I care. </p>\n\n<p>I&#39;ve kept in contact with Mrs Grace over the years , checked on her status in the ICU; and thought about all the things she taught me about being patient. Maybe I didn&#39;t get to save her but I&#39;m sure there are plenty of other people out there that I can help. \nI&#39;m actually quite good at this sort of work, better than I even thought I would be. \nI like it, the slow careful work I put into dismembering these abusers. \nI’m sure someone else will be coming along very soon that could use this sort of treatment. </p>\n\n<p>All I have to do is <a href=\"https://m.facebook.com/Kyle-Harrison-2120650624830271/\">wait</a>.</p>\n\n<p><a href=\"https://www.reddit.com/r/nosleep/comments/8i5vzr/chastitytemperancecharitydiligencepatiencekindness/?st=JH6OZQBW&amp;sh=4e2a1457\">CHASTITY</a><a href=\"https://www.reddit.com/r/nosleep/comments/8in119/chastitytemperancecharitydiligencepatiencekindessh/?st=JH6P05DZ&amp;sh=eca1d006\">TEMPERANCE</a><a href=\"https://www.reddit.com/r/nosleep/comments/8jfn63/chastitytemperancecharitydiligencepatiencekindness/?st=JH7TIOAM&amp;sh=8065c7ce\">CHARITY</a><a href=\"https://www.reddit.com/r/nosleep/comments/8jfn63/chastitytemperancecharitydiligencepatiencekindness/?st=JH7TIOAM&amp;sh=8065c7ce\">DILIGENCE</a>patiencekindnesshumility</p>\n</div>\n","author":"Colourblindness"}