{"rank":"1","title":"Coupling","id":"8kcj8j","url":"/r/nosleep/comments/8kcj8j/coupling/","time":"1526643990000","body":"<div class=\"md\"><p>There were people in the room. People I didn&#39;t remember. People I didn&#39;t recognize. They were all discussing something very important. Then I realized I didn&#39;t recognize the room either. So I started looking around. There was a cupboard with lot of DVDs inside. Strangely, The DVD&#39;s were titled with female names. Then I looked back at people. It was a group of few men and women. They were discussing something with a lot of passion. It did look like a serious discussion but I couldn&#39;t hear any sound. It was so quiet. But the people seemed to understand each other. It seemed like I was the only one who couldn&#39;t hear anything but in my mind I could feel the topic of the discussion was very weird and the arguments being presented were even more weird. And then I looked outside the window. It was strange. Suddenly the people disappeared and the scene outside the window came into focus.</p>\n\n<p>I did recognize the golden gate bridge but I have never seen what I was seeing at that point of time. It was dusk and there was a lot of dust in the air. I could taste metal in the air. I saw many people on the bridge. I saw them screaming. I couldn&#39;t hear any sound but I saw their faces contort into screams as the wires snapped, towers started groaning and the bridge started collapsing. As the people held on to it just as they they clung to the desperate hopes of safety, I heard the sky rumble as the great Gods of old abandoned it in hurry. I saw the blue disappear from the sky as the thunder changed color from bright white to dark red and then to crimson Purple bringing wrath of the new Gods down here. As the Sky lost all its color and only the All Black was left, I saw great cracks appear in the ground as it started grumbling and I saw Lava appear beneath it. The ground&#39;s grumbling made me nauseated as it felt like the Earth&#39;s failing attempts to keep its vomit of lava from Bowels inside it. As I fell into a deep pit of emptiness and landed face down on a rock, I saw bodies. A lot of bodies. Carcasses of cats, dogs, Cows, Pigs, horses, donkeys, Ducks, Sparrows, Crows, Ravens, Sharks, whales, spiders, snakes, toads and many more animals that humans have not even discovered yet filled the empty spaces between the Earth&#39;s building blocks, holding Earth up. They had been stuffed up as fillers for empty spaces. Then I concentrated on the building blocks. They were hollow rocks filled with human bodies. Helpless, fearful faces stuck up from rocks filled with a lot more of human organs than faces. And they were tied together with intestines of creatures unknown or long forgotten.</p>\n\n<p>There were no tests. No judgement from Gods to decide of hell or heaven. All the creatures, everything that had ever drawn a breath, was condemned to the death. Condemned to be a part of these building blocks which no longer were serving their purpose. They were breaking and cracking. And all the organs and bodies were falling into the great nothingness of massive space. As they finally collapsed, I saw the doomsday. I saw the Earth end.</p>\n\n<p>I woke up from the strange dream in my own room. The Earth was still very fine and buildings still very much in place. I still didn&#39;t know the people or the room. I could hear though and that was a sigh of relief. It was just one of those nightmares. Another one to added to a very long list. I just prayed it didn&#39;t make it to the long list of nightmares that had come true. And then I went back to the embrace of sweet slumber.</p>\n\n<p>Why am I typing this here after 3 years of that nightmare. My brother introduced me to this show called &quot;Coupling&quot; a few days back and I liked it so I decided to binge watch it. And then I saw that episode with all those people in the same room arguing over DVDs. Same faces with same setting. Had I not experienced this with other nightmares, I would have gone mad. But I comported myself and checked the Earth for disasters. I am Happy to report that there have been no incidents of doomsday that I know of... yet. Although it is weird that around the time I started watching Coupling, US opened its embassy in Jerusalem and all hell broke loose.</p>\n</div>\n","author":"Taadaaaaa"}