{"rank":"75","title":"Paroxysmal Zombie Syndrome","id":"8kcl2x","url":"/r/nosleep/comments/8kcl2x/paroxysmal_zombie_syndrome/","time":"1526644559000","body":"<div class=\"md\"><p><a href=\"https://www.reddit.com/r/nosleep/comments/8ksoah/i_was_on_a_secret_research_team_to_create/?st=JHEVHJ2W&amp;sh=d29b79bb\">part two</a> </p>\n\n<p><a href=\"https://www.reddit.com/r/nosleep/comments/8kkxbt/i_am_a_germaphobe_and_i_had_to_fly_in_a_public/?st=JHEVICOC&amp;sh=03651ac2\">related</a> </p>\n\n<p>That is what I nicknamed the weapon. A paroxysm is defined as a sudden burst or intensification of symptoms, and when I describe the symptoms this weapon causes to infected individuals you will understand the name much better.</p>\n\n<p>I was not on the team that created this biological abomination, so I have little knowledge about how it was created. I do know however that the skeleton of the virus is a mixture of rabies and Ebola. I’m not going to lie or censor anything to cover my own ass here. I was a part of a secret team created by the United States government. Officially our purpose is to ‘create vaccines and antibodies for rapidly commutable disease’. Our true purpose however, as you may have guessed, was much more sinister. We were tasked with creating very specific pathogens to disrupt or completely neutralize any enemy that may target the states.</p>\n\n<p>We basically spliced and mixed various genes from the worst diseases you could possibly imagine, to create the most controllable but also devastatingly viscous pathogen possible. Our teams had created dozens of diseases that just didn’t make the cut. After several years of research of disease gene manipulation we had finally made our poster card biological weapon.</p>\n\n<p>Our pathogen had an incredibly short incubation period. Upon contact with infected bodily fluids, the victim will be completely delusional and rabid in a matter of about 20-30 minutes. The virus has an incredible artificial membrane which allows it to survive for extended periods of time dormant in air and most liquids, allowing it to spread long distances easily.</p>\n\n<p>Our team took what we thought at the time adequate safety precautions. We had a very potent cure which can completely annihilate any trace of the virus in an infected individual with only about one drop administered into the bloodstream.</p>\n\n<p>Now let me explain how the weapon works. Like I said, it’s incredibly short incubation period allows the disease to spread very quickly. During the incubation period symptoms will include: - Shortness of breath - Elevated heart rate - Dilated pupils - Severe headache - High fever of about 107 degrees F. - Body wide hemorrhaging - The veins in the eyes will burst causing a dark scarlet red appearance</p>\n\n<p>Symptoms can appear as little as 2 minutes after contact. After the infected individual goes through the average incubation time of 20-30 minutes the symptoms become much more severe. These ‘inactive’ symptoms include: - Foaming at the mouth (often stained red with blood from the internal hemorrhaging) - Violent headache causing severe confusion in the individual. Infected tend to mumble to themselves nonsense - Lower than normal heart rate - Extreme sensitivity to outside stimulus (sound, light, touch)</p>\n\n<p>However, it only gets worse when the individual detects an uninfected human. Once the infected individual locates an uninfected human, a paroxysm of symptoms are immediately visible. These ‘active’ symptoms include: - Extreme agitation and violent behavior towards any uninfected individual. - Normally lethal doses of adrenaline in the blood stream - Nerve damage causing pain to be completely absent - Internal organs constrict causing pressure in organs that contain bodily fluid (used as a vector for fluid based transmission)</p>\n\n<p>This pathogen is obviously deadly on an incredible scale due to its ability to use a human host to transmit and spread to more victims. I hate to admit it, but most of the information I have on the symptoms were gathered from involuntary human testing.</p>\n\n<p>Alright, now that you know what I’m dealing with, let me tell you what happened to our lab. As I said earlier, we tested on human subjects. Many trials were tested, many causing rapid death in the subjects. So when we finally had living subjects to monitor and test, we were very excited. Several researchers equipped with level 5 biohazard suits went into the room where the subjects were held. For about 15 minutes the researchers were inside monitoring and testing the symptoms of the subjects. This all took place during the incubation period.</p>\n\n<p>After the first few researchers had successfully monitored the rapidly declining conditions of the subjects, another group was tasked with performing more tests. This group however was unfortunate enough to disturb the subjects during the inactive period of the subjects.</p>\n\n<p>The researchers barely had time to open the airtight seal before the dozen infected subjects changed from inactive state to active state and actively attacking the researchers attempting to enter the room. After the scientist in the front was attacked, the others attempted to escape by reopening the seal to get back into the lab area. One of the scientists in front was slammed to the ground in the panic to get through the door, blocking the motor on the door from completely shutting. Next the dozen subjects chased the scientists down the hallway before subduing them and vomiting bodily fluids into every orifice of their face after ripping the biohazard suit off.</p>\n\n<p>The dozen subjects began running remarkable speeds after anyone who was caught in the hallways of the lab. Before the contamination, 65 lab personnel were inside the premises. After all rooms had been sealed and those inside were safe, it was found by intercom that only 34 were safe inside the rooms. The rest were listed as MIA, but we all knew they were infected. The control room which had cameras throughout the facility confirmed this terrible truth.</p>\n\n<p>The security team which was mostly intact was ordered to go room to room in full biohazard suits to rescue as many of the staff as possible. Luckily for me, the room I was in was only a couple rooms down from the control room, so the security team got to me after only a few successful escorts.</p>\n\n<p>The time for me to be escorted to the control room came. The team of 7 security technicians equipped with full biohazard suits opened the door to my office and told me and my other colleague to come with them quickly and quietly. As I stepped out into the desolate hallway, the smell hit me first. A scent of iron permeated through the air with such an intensity you could not imagine. The second thing to hit me like a truck was the unsightly blood splatters and handprints. The hallway was littered with papers and all manor of debris. Two freshly dead corpses were propped against the hallway walls.</p>\n\n<p>It was only about 20 meters to the control, and another 15 to a corner where the hallway turned. We were about halfway to the control room door when a man in a bloodstained lab coat turned the corner at the end of the hallway. For what felt like centuries the 9 of us stare in frozen terror as the infected researcher began to notice us. This was the first time I got a good long look at one of the infected. The whites of the man&#39;s eyes had been completely distorted red giving his entire eyes a unfocused deep scarlet red look. His pale white skin was covered in dark red blood veins. He made a noise I can only describe as a growl, and as he did a large amount of blood dropped out of his open mouth. Then he started running a full sprint faster than any human athlete could ever achieve in our direction. The security tech in front hastily drew his sidearm and dispatched the infected researcher.</p>\n\n<p>After the deafening noise of the gunshot began to fade, I could hear more growls and groans down each end of the hallway. We began running to reach the control room. We all began shouting for them to open up, and as we reached the door, it flew open. We all rushed into the control room as the door was slammed shut.</p>\n\n<p>For about 30 minutes we sat in complete silence before the security team decided it was safe to go out and escort more survivors back to the control room. Already inside were myself and about 17 others. The security team went back and forth every 10 minutes or so until the number of people inside the control room was closer to about 23.</p>\n\n<p>Then, disaster struck. The security team was being closely monitored by voice coms and they were approaching the control room with 5 more survivors. Someone opened the door for them, but right as they did the power cut off. The emergency power came on and the control room door slammed shut automatically. It was a safety protocol. The door would not open. The security team and the survivors began begging us to get the door open but the security mechanism held and would not budge. That was the same for every door, unable to be opened. After about 2 minutes of being locked out the quiet begging and pleading turned to panicked gasps of terror. The sound of gunshots shattered the air as multiple shots could be heard being fired outside the control room door. About 20 seconds there was a dreadful silence. Then more gunshots. So many gunshots. And then when the security team ran out of bullets, the screams of anguish and unrelenting terror permeated the entire facility.</p>\n\n<p>For about 1 minute or so we could hear the panicked fight of the survivors and security techs trying desperately to over power the hordes of infected attacking them. The last sounds of suffering ended after about five minutes with a gurgle as silence reclaimed the air. Shuffling feet could be heard outside and it sounded like it could have been 20 or more infected outside.</p>\n\n<p>Then the talking started. It was all gibberish of course, but you could easily tell that the infected outside were confused, scared, and very very sick. Words like “why” “please” and “help” were some of the few words I could make out.</p>\n\n<p>Hours we sat there silently waiting in the control room. The power of the facility finally came back on at about 3:45AM. Someone decided we should go to the armory and see what weapons were left. There were 13 handguns, 3 shotguns, 8 batons, and 4 ballistic shields. Now, I know you’re probably wondering why a research bunker was so well armed - I have no idea.</p>\n\n<p>I took a handgun with 1 extra 7 round magazine and a baton. Next, we discussed the safest most viable way to escape. One person suggested that we try to look for other survivors on the way out, but obviously no one had any plans on staying any longer than they needed to.</p>\n\n<p>Someone suggested we make a beeline to the main bunker entrance through the hallways, but I told him about my experience with the infected and how fast they were. Finally, we settled on going into the utility room down the hall, and going most of the way to the front door through the ventilation shaft. Once we exit the shaft, we’d have to run a straight stretch of about 40m to the front door control panel. I was the 5th person to get out of the air shaft and I ran to catch up with the other 3 who were trying frantically to open the door.</p>\n\n<p>The sound of growls and moaning could be heard at the end of the hallway as the people at the vent began frantically jumping out. The door was a solid steel 2m thick vault door so opening was a painfully slow process unfortunately for us. We began to open fire to cover for the people still getting out of the air vent. The bullets barely fazed the infected as they began to maul the survivors trying to help others out of the vent hatch. I watched as the infected straddled each of the researchers and vomited dark red blood into every orifice of their victims. Screams drowned out into panicked gurgles.</p>\n\n<p>The vault door was barely open enough for a human being to fit through as I followed 3 others squeezing out to reach the outside. The euphoria of smelling fresh air was short lived as my ankle was gripped by one of the infected. They had caught up, and were trying to get outside to get to us. The 4 of us began to hastily shut the door, but the control panel denied and the vault door continued to slowly open. We made a beeline to the parking garage where our vehicles had been stored and luckily were able to get inside. All 4 of us tore out of there like we had gone mad.</p>\n\n<p>I drove and drove, with no destination in mind. After what felt like hours of driving, my body finally failed me. I crashed my SUV into a ditch on the side of some rural backroads. The crash was intense, flipping the vehicle multiple times before landing upside down on the side of a corn field. I didn&#39;t lose conscious right away however. Still terrified of the infected who had undoubtedly escaped the bunker by then motivated me to get out of my vehicle and start walking. After only about 20 m i passed out and dropped onto the country road like a sack of rocks.</p>\n\n<p>I woke up two days later in a major city hospital being treated for the minor trauma caused by the crash. I was weak, but for the most part uninjured. For a few blissful moments after I woke up, I had no recollection of the events at the bunker whatsoever. Then I went to the nurses station to ask what had happened. Right when I was about to reach the nurses station the memories of the horrific events at the research bunker came flooding back to haunt me once more. I could not move at all. I had a panic attack right there in the lobby. I was later told I was so delirious that I was screaming and begging to be let go. My request was denied and I was once again sedated to calm me down.</p>\n\n<p>After I woke up in the hospital for a second time, things were much different. I couldn&#39;t see much from my bed, but i could see nurses and doctors frantically moving about the hallway room to room. The infected have no doubt been sent to the hospital, and the staff are having trouble containing the spread of the lethal pathogen. I want so badly to get the hell out of here and go as far away as I can as quickly as possible but that won&#39;t happen. My door is locked from the outside. I am trapped in a hospital room in a hospital being overrun by the most lethal pathogen human kind has ever seen.</p>\n\n<p>Right now I am banging on the glass every time a nurse or doctor passes by, desperate to be set free. They all pass me without a second thought. I sit defeated on my bed typing this on my phone waiting for the infected to overrun the hospital. The way I see it, there are two possible outcomes for my situation, neither of which being ideal. One, the hospital gets overrun and I am left to starve to death in this room alone. Two, an infected will notice me in here and smash the door down to reach me.</p>\n\n<p>I don&#39;t know how long I have until either of these happen. All I can do now is type this so at least someone will know what caused all of the ensuing chaos currently taking place outside my room.</p>\n\n<p>If anything interesting happens that doesn&#39;t involve me dying, I will be sure to post an update as soon as I can. But for now, I am just going to wait in here for death by infection or starvation.</p>\n\n<p><a href=\"https://reddit.com/r/yumkimilstories\">- D</a></p>\n</div>\n","author":"Its_YumKimil"}