{"rank":"1","title":"he was watching","id":"8kcqj0","url":"/r/nosleep/comments/8kcqj0/he_was_watching/","time":"1526646079000","body":"<div class=\"md\"><p>So im writing this story around 2 days after it happened... I thought about waiting until at least 2 weeks later but then I realized that I may not be here by that time.. So, I&#39;ll tell you this story..</p>\n\n<p>But first, let me tell you about myself, Im a 13 y/o boy about to be 14 in June. Im not really a horror freak-But im not afraid of about any horror until this happened...</p>\n\n<p>So it was around 6:00 A.M in the morning, I decided to watch a Chills video.. (my opinion the voice is scarier than the video) It was about 15 Scariest Halloween Stories Than Actually Happened.. after I finished the video, I decided to take a shower because it was a school day, (I need to get to school by 9:00 A.M) While I was in the shower I was just listening to music.(eminem) thinking about...</p>\n\n<p>Shower thoughts, and then suddenly I heard the sound of a quiet but scary sound. I was unthinkably scared just because of the sound I heard in the same room of me.. How I thought, The door was locked there should be no way for someone to get in here.. So I decided to face my fears thinking &quot;Oh, its nothing noone should beable to be in here&quot; So I pulled the shower curtains back and then I see it... I see a black cape, black hat, but no face or feet...</p>\n\n<p>He no IT was just floating there! I screamed as loud as I could, I hoped that it would go away. I hoped and hoped but I did what any kid would do in the situiation, I closed the shower curtain and pleaded for my life. Suddenly I heard banging on the door &quot;Hey! Are you ok!&quot; I screamed &quot;HELP ITS IN HERE!&quot; I decided to say screw it and open the shower curtains so I can hopefully open the door. But as I opened the curtains I saw nothing, I didn&#39;t know what to do, if I opened the door and they saw nothing there</p>\n\n<p>they would think I was mentally insane.. But I knew I needed to get out of there so I just opened the door as soon as I put pants on I saw my family there and I was relieved, I tried to explain to them, &quot;The-There was something in there!&quot; I was stuttering out of fear. They said &quot;Huh, there is no way for someone to be in there.. You locked the door right?&quot; I decided to say, &quot;You&#39;re right, Im just insane..&quot; I decided to go to school after that it was 8:50 A.M.. I went to my normal group of friends, by a vending machine. I was outside looking out at the field then I suddenly dropped... I saw it, I saw it again IT WAS IN THE FIELD!</p>\n\n<p>I looked at my friend panically and said &quot;Do you see that!!&quot;(pointing at the black caped figure) He replied &quot;Um, theres nothing there, Are you going insane?&quot; Oh no.. Am I just crazy? What should I do? Should I just ignore it, I don&#39;t know.. I didn&#39;t see it after that I went on and continued my normal school day. The day after I decided to ignore watching youtube, I thought Im just illusinating noone else is pointing it out.. So I went on and continued my school day, but during 3rd period, I decided to raise my hand to go to the bathroom. as I was using the bathroom, You wouldn&#39;t believe what I saw...</p>\n\n<p>He was standing there, looking at me..</p>\n</div>\n","author":"ImDrava"}