{"rank":"1902","title":"I Was Fucking Fat - Part 4 - Final","id":"8kcxjv","url":"/r/nosleep/comments/8kcxjv/i_was_fucking_fat_part_4_final/","time":"1526648042000","body":"<div class=\"md\"><p><a href=\"https://www.reddit.com/r/nosleep/comments/8jbgth/i_was_fucking_fat/\">Part 1</a></p>\n\n<p><a href=\"https://www.reddit.com/r/nosleep/comments/8jku53/i_was_fucking_fat_part_2/\">Part 2</a></p>\n\n<p><a href=\"https://www.reddit.com/r/nosleep/comments/8k3jty/i_was_fucking_fat_part_3/\">Part 3</a></p>\n\n<p>For the first few minutes of my new life, I lay completely still, unable to comprehend what I might do with my re-acquired freedom. What would determine my life without walls to guide me?</p>\n\n<p>I began moving my slow thighs, accepting that the hour had come round at last, and slouched toward the world to be born. </p>\n\n<p>I treaded over the piss and shit, utterly unconcerned as a rogue turd squished between my bare toes as I walked past.</p>\n\n<p>There were so many things that I didn’t care about anymore. </p>\n\n<p>For the first time, I walked toward the crack of light that had shined on me unceasingly. I raised a trembling hand.</p>\n\n<p>I knew that my life would never be the same after pushing open the door. There would be a ‘before’ and an ‘after,’ with this passage delineating the gap. And I knew it was a leap that the old me would have been unwilling to make, because salvaging myself would cause such an <em>inconvenience</em> to other people.</p>\n\n<p>I scowled, turned, and emerged into the light.</p>\n\n<p>The brightly-lit room blinded me for at least a minute. As my eyes slowly began to adjust, the warmth of the room gradually presented itself. </p>\n\n<p>A bathrobe lay on a plush, soft-looking chair. The loveseat next to it displayed a brand-new outfit, undoubtedly several sizes smaller than the last I had worn. And through another door was a luxurious-looking bathroom. The shower was adorned with every type of body lotion. A soft humidity was wafting from the freshly-drawn bubble bath that overflowed from the Jacuzzi-sized tub. Scented candles lined the walls of both the dressing room and the bathroom, and their soothing aroma promised hours of relaxed detachment from the world. God knows I had more than earned it.</p>\n\n<p>I looked inquisitively at the scene. Then I turned away, exited the room, and found the front door. </p>\n\n<p>Nice as the gesture had been, I had developed a newly-acquired distaste for <em>accepting</em> what was in front of me.</p>\n\n<p>I don’t know if someone had been watching me. Frankly, I didn’t care. I strolled out into the cool night air, naked as I had been for – well, longer than I knew how to count.</p>\n\n<p>The locomotion process was awkward and stilted. My walking had long been limited to general pacing about the darkened room, and I wasn’t used to proceeding in a straight line for any extended period of time. So I focused on putting one foot in front of the other, and nothing more.</p>\n\n<p>I gradually realized where I was. </p>\n\n<p>It was less than three blocks from home.</p>\n\n<p>The thought of being <em>so goddamn near</em> my house all this time was too much to process all at once, so I pushed it out of my head.</p>\n\n<p>It didn’t feel like a dream, so the hallucination might have been real. I was gradually aware of another Janelle striding behind me, struggling to match my pace while dealing with her enormous girth.</p>\n\n<p>“You could just let the thought crush you,” she said. </p>\n\n<p>I didn’t turn my head. “You did let the thought crush you,” I replied aloud, and she wasn’t there anymore.</p>\n\n<p>As my own house came into view, my heart began to flutter - but this time it didn’t hurt. There was a light from the living room. A figure was moving around inside, going about its nightly routine, revealing to me that <em>the world had continued to go on without me.</em> If her fat ass had been able to keep up with my pace, I’m sure the other Janelle would have cried out in triumphant sobbing at this validation. But me?</p>\n\n<p>I was kind of pissed.</p>\n\n<p>I pushed open the door, bleeding, reeking of my own shit, and naked as the pinkest mole rat that God ever saw fit to make. My mom burst into the hall. Her eyes nearly popped out of their sockets. Whether she covered her mouth out of genuine shock or vomitory concerns was something I’ll never know. </p>\n\n<p>I stood on my own to feet and stared at her unblinkingly. “I’m not sorry,” I offered flatly.</p>\n\n<p>That’s when I passed out.</p>\n\n<p>*</p>\n\n<p>The next week was spent in a hospital bed. My body was unprepared to consume solid food, so the first several meals came in the form of an IV. Ironically, my freedom meant that I still would not get to eat. </p>\n\n<p>Or perhaps not so ironically. The thought of my former comfort foods left me feeling disgusted. What had once made me feel so wonderful now evoked memories of the flying squirrel-esque skinfolds that had been left behind from the weight loss.</p>\n\n<p>I’d been gone for nearly a year. Time had lost so much meaning to me that I did not know whether my shock came from how long or how short it had actually been. </p>\n\n<p>Blood and urine tests showed that my water had been laced with vitamins, electrolytes, trace amounts of protein, and sedatives. No one in the medical profession had heard of such a slurry before. But it was <em>just</em> enough to supply what my overwhelming fat stores could not give me as my body learned to live without food. </p>\n\n<p>I had dropped over 300 pounds, and I looked like a puddle of skin. The first of several skin-removal surgeries targeted my thighs and hips. I had caked globs of fecal matter into the shorn skin as I sliced away bleeding layers in my escape, and the infection had set in quickly. Since I needed to dispose of the skin anyway, the surgeons simply removed large sheets from the areas that were developing the most pus. </p>\n\n<p>*</p>\n\n<p>A woman in a smart-looking business suit came to visit on my last day in the hospital. When the nurse first explained that someone wanted to talk, I had gotten excited, since Mom didn’t see the need to visit the hospital every <em>single</em> day.</p>\n\n<p>But when a strange woman walked in, the crisp <em>clack clack clack</em> of her heels telling me that she was all business, my heart sank. She stopped at the foot of my bed, hair up in a bun and glasses resting on the tip of her nose. “Janelle,” she quipped, “you must have a lot of questions.” She lifted her eyes from the clipboard in her hand and stared directly at me. “And you must have figured out the answers to those questions.” She furrowed her brow. “But the most important answer is this: you. If <em>you</em> don’t save <em>yourself</em> now, there is simply nothing we can or will do. We’re not getting involved again, Janelle. This was your only gift.” She dropped her clipboard to her side and contemplated me softly. After a silent moment, she raised her finger to the sky. “There is a Better Way.” </p>\n\n<p>She marched quickly to my side, handed me a business card, and walked away from my bed without a backward glance. </p>\n\n<p>I gawked at the place where she had stood long after she’d left. It took several minutes for me to realize that I should read the card that lay in my fingers.</p>\n\n<p>One side simply had a single phrase: “The Time is Nigh.” I flipped it over to see if the other side was any more insightful. It appeared to be her contact information: “Amanda Higgins – (140) 826-1913.”</p>\n\n<p>I was used to stewing on thoughts for indefinite periods of time. That’s how I came to figure out what she was saying by giving me this card <em>after</em> telling me that our business had concluded: she was giving me the chance to help others <em>through</em> them. </p>\n\n<p>And if I could convince her that, say, my mother needed Amanda’s “help,” she might not hang up on me. She might even show up to my home once again.</p>\n\n<p>I’ve decided to give it a try. Because no matter how patient I have to be, I’m determined to meet Amanda one more time.</p>\n\n<p>There’s a ring in a nearby basement that needs to be put to <a href=\"https://www.reddit.com/r/NoSleepInterviews/comments/8jc677/may_14th_2018_byfelsdisciple_interview_part_2_of_2/\">good use</a>. </p>\n\n<p><a href=\"https://www.facebook.com/P-F-McGrail-181784199029462/\">FB</a></p>\n\n<p><a href=\"https://www.reddit.com/r/ByfelsDisciple/\">BD</a></p>\n</div>\n","author":"ByfelsDisciple"}