{"rank":"53","title":"Always close your blinds","id":"8kd46v","url":"/r/nosleep/comments/8kd46v/always_close_your_blinds/","time":"1526649699000","body":"<div class=\"md\"><p>This happened towards the end of my first year of university.\nI was studying in the city and my accommodation was just on the other side of the road to the library, which was open 24/7. \nI had gotten into the habit of waking up early and going to the\nlibrary, so I had found a seat and started working at around 6.20am.</p>\n\n<p>Things were normal for quite a while, maybe 30 minutes. Then someone came and sat at the other side of the table from me. I&#39;m quite nervous and introverted a person in general, so this worried me, but not because I had assumed I was in danger or anything. </p>\n\n<p>Everything was normal. I carried on studying, it was quiet this early in the morning. I didn&#39;t have to wear my headphones or play any music to drown out other people&#39;s voices. Realising that fact struck me with a sick feeling, and I looked up to see who had actually taken the \nseat across from me.</p>\n\n<p>He looked completely normal, a guy of a similar age to me. For context, I was 18 years old when this happened, a female, 5&#39;9, and pretty tiny in terms of my weight and strength. He was much bigger. Maybe 6&#39;5, I couldn&#39;t tell at first because we were both sat down, but even so he dominated my field of vision, very visible over the horizon of my laptop screen. When I looked at him, his eyes didn&#39;t meet mine.  </p>\n\n<p>The sickness was growing in me since I had noticed that there were seats practically everywhere on this floor of the library. I had chosen to sit right on the balcony, so I could see down into the foyer. I didn&#39;t understand why he had chosen to sit so close to me when he really didn&#39;t have to, but I tried to push the paranoia aside. </p>\n\n<p>Then he started to hum. Not in a quiet fashion, either. He was humming something that sounded so familiar, and he was doing strange noises in between the notes. it was like he was tensing his throat, making a glottal sort of sound, and the immediately relaxing it. In all honestly, it sounded like he was going to vomit. </p>\n\n<p>The noise started to piss me off. He was sitting perfectly still, his\nface was straight and expressionless, but he was making these weird hums and noises. I had been looking at his face indirectly, facing my screen but directing my eyes at him, for what seemed to be forever.</p>\n\n<p>Suddenly, and before I could even really realise it, he looked at me.\nI didn&#39;t see his eyes move. \nThey were so dead. It chilled me. He smiled with his dead eyes and his body sunk in his chair as if he was trying to level our line of sight.</p>\n\n<p>&#39;I&#39;ve seen you before,&#39; He whispered. &#39;I&#39;ve seen you.&#39; He said it as if I had some big secret that he knew about, and he was going to blackmail me with it. I remember that his breath smelt fishy. </p>\n\n<p>I didn&#39;t say anything. I was really scared, even though he hadn&#39;t \nactually done anything to me. I felt so much more isolated then I \nhad done before he arrived. </p>\n\n<p>He fumbled under the table as if rooting through his pockets.\nHe then slid his hand, palm-down and fingers firm, across the table. His fingernails were filthy. He lifted his hand up and away from the table, stopping it as if he were motioning for a high five. He was smiling. When I did nothing but look at him, his face fell and he retracted his hand, getting up from the chair and running down the stairs. I followed him with my sight through the foyer, where he stopped, looked up at where I was, finally disappeared from view.</p>\n\n<p>I was pretty shaken. Part of me thought that maybe I had met him before at a party and forgotten him, or maybe we had a class together and this was his way of introducing himself. But then I looked at the table where his hand had been. </p>\n\n<p>There was a small photograph, small enough that he had been able to fit it in his palm. I didn&#39;t touch it, but raised myself to look at it. </p>\n\n<p>It was a picture of me, through my bedroom window at my desk. Our accommodation building is structured like a rectangle, and it has a courtyard in the middle. Many of the rooms face inwards to this courtyard. The angle he had taken it from showed that his room must be situated above mine, a couple of floors.\nI think he had zoomed in as far as he could. The whole thing made me feel terrified to go back to my room. It felt like I was a prisoner being watched; like he was keeping surveillance on me.</p>\n\n<p>I never saw him again, but I would always close my blinds. Even in the daytime. </p>\n</div>\n","author":"halloween_head"}