{"rank":"143","title":"The man that lives in tornadoes","id":"8kdf6c","url":"/r/nosleep/comments/8kdf6c/the_man_that_lives_in_tornadoes/","time":"1526652342000","body":"<div class=\"md\"><p>My uncle Jake has been obsessed with tornadoes ever since one destroyed his home and took his wife, children and left leg 5 years ago. Sometimes when he gets drunk, he starts, but never finishes, the same story- “the heart of the twister came right on down to my backyard. The wind was strong enough to blow my neighborhood away...and when it started, in the middle of it, was a man, walking like a like he was on a stroll during a sunny day...”</p>\n\n<p>&nbsp;\nNobody believed him but his 15 year old nephew. I supported him the best I could when he quit his old job as an engineer and became a storm chaser. His YouTube videos of barns tearing apart and telephone poles getting ripped up from the ground got a few million views a piece, back when YouTube was paying content creators a fair slice of the advertisement dollars. But getting good, HD footage meant usually meant wrecking a vehicle. Jake killed 4 SUVs filming tornadoes before his obsession drove him to create a vehicle that could withstand <em>any</em> storm. </p>\n\n<p>&nbsp;\nIt took my uncle Jake and I two years to create what he called “the bunker”, an extra heavy-duty blade-less bulldozer with a high-strength concrete shell poured under 5” thick steel plating. The bunker could fit three, had self-contained air and two 500 pound cast iron vault entry/escape watertight submarine doors. 7 extendable pistons attached to the dozer&#39;s hydraulic system extended all around the shell of the bunker to prevent it from staying flipped or stuck. </p>\n\n<p>&nbsp;\nI loved working with Jake, even though he always smoked cigarillos while we worked, and on hot days he smelt a little like onions. At least we never had to work much INSIDE the bunker together, thank God.   </p>\n\n<p>&nbsp;\nThrough the smoke and the sweat of the open sun, we retrofitted the bunker with rubber treads that could crawl through debris but be driven on roads, driven by twin tank motors that put the bunker&#39;s top speed at 38 MPH. It weighed more than an Abrams tank at 131,550 pounds. “We shouldn&#39;t think that God couldn&#39;t lift this thing...but we should aim to give &#39;em one Helluva time” was something Jake was found of saying. </p>\n\n<p>&nbsp;\nIn the end, it was a complex beast that had 17 high definition cameras all around it to capture every moments of the storm&#39;s damage in real time. And wouldn&#39;t you know, two days after it was finished, one of the largest tornadoes in history was coming right for our town of El Reno. </p>\n\n<p>&nbsp;\nJake rushed as soon as his emergency band radio gave the first sightings of a forming Tornado just North of us. He rushed too much. Half way to the bunker, Jake gripped his right arm and called out for me in a very timid, scared voice. I knew something was wrong, too wrong. He was having a heart attack. Jake was suddenly on the floor, gripping his heart, hacking, face turning red, then purple. All he said to me was “get to the bunker, now.” </p>\n\n<p>&nbsp;\nI barely had time to twist the hatch shut before the entire bunker was rocked. I push-started the engine on. The 17 cameras came alive for me to see that my uncle&#39;s house was missing in the swirling blizzard of debris. I started playing at the controls- we had just finished 2 days ago, I had not even gotten a tutorial from Jake about how to operate the bunker, so I slammed levers until something made me move. One of the foot pedals operated the right tread spin. That made me go in a circle, which at least let me know which way the tornado was going. 16 cameras got footage. Only 1 was used for driving. Bad design in hindsight. </p>\n\n<p>&nbsp;\nI said my apologizes to god as the bunker was being pummeled by concrete and timber from all sides, eyes glued to that screen. From the left pan, the camera faced something standing in the twirling wreckage. A man.</p>\n\n<p>&nbsp;\nHis face was angular but not thin. Gray skin, brown eyes. His long, curly hair was the color of a thousand sunsets. He stared right into the camera is if trying to look inside. Then he walked off screen. I began to move the bunker again until I heard a creaking coming from the escape hatch. The latch was moving. He was trying to get in.</p>\n\n<p>&nbsp;\nI rushed over and held the latch tight, but it was too late, and the man was too strong. The latch unlocked, and the heavy lid opened. I braced for a storm of shrapnel and got only a faint breeze. The man looked at me as if I were crazy. I stared past him, where the tornado was still chewing everything in it&#39;s path. </p>\n\n<p>&nbsp;\n“What y&#39;all doing in the middle of a tornader?” The adrenaline made me yell in my accent. The man I yelled at was six feet tall, wearing a hood-less robe of dull black and dark red. Rough. Handmade, even. The color and texture of his robe matched his velvet-looking pointed shoes laced in gold and long gloves. His clothes hung loosely on his odd stance, with his arms locked straight and pointing down, all fingers extended, twitching. </p>\n\n<p>&nbsp;\n“I live here” he answered. His voice had no base- just one giant, powerful, whispery exhale that never stopped to take a single breath in. </p>\n\n<p>&nbsp; \n“Who are you?” I asked, a little nicer, after hearing that voice. </p>\n\n<p>&nbsp;\n“I don&#39;t know. I don&#39;t believe I have a name. I don&#39;t talk to many people, so there isn&#39;t a need to have a name.”</p>\n\n<p>&nbsp;\n“And you said you live here...in what, a tornado?”</p>\n\n<p>&nbsp;\n“Only when I am awake. When I am asleep, I have no need for my body, I vanish from existence. But when I wake, I wake in the fury of a windstorm.”</p>\n\n<p>&nbsp;\n“What does that mean? You make tornadoes? How?” The winds began to rise. The carnage that swirled around us seemed to creep in a little closer. </p>\n\n<p>&nbsp;\n“I don&#39;t know. All I know is that this is <em>my</em> <em>land</em>. And I like my land as it was before, <em>clean</em>. Every time I am awake, I spend all my time sweeping all the filth you people built up on my land. </p>\n\n<p>&nbsp;\n“What filth? The man&#39;s arm extended out towards the husks of cars dancing with the cinder-blocks and that tires and the leaves and the broken bottles just 10 or so feet away. </p>\n\n<p>&nbsp;\n“That. That filth. You stack it up. You rip into my land. You vomit into my waters. You. But not <em>you</em>. <em>You</em> are special. You are the first to see me in 5 years. The first to speak to in 50. So let&#39;s walk together. I will keep you safe...as we cleanse the filth. Together.”</p>\n\n<p>&nbsp;\nThe worst-timed “fuck you” of my life shot from my mouth. But he knew what those words meant, and those howling winds started to make my clothes flap while his remained serene. But what&#39;s done can only be improved on, as uncle Jake used to say. Jake came to my mind as I stared at that gray face that could almost pass as human if you were not paying attention.</p>\n\n<p>&nbsp;\n“You took my uncle&#39;s family, his house, his leg...he saw you.”</p>\n\n<p>&nbsp;\n“Yes. You are angry. Because your filth-monger family was swept away with the rest of the filth? Yes? Then I shall tell you the rest. Yes. I appeared right in his backyard. That filth needed to be erased. Yes. To make my land clean again. Pure. As I will do now.”</p>\n\n<p>&nbsp;\nThe tornado collapsed around me. The force of the winds felt like a cylinder of high-voltage electricity was closing in a horrible ripping, tearing sensation. The force of the winds picked me up, and up. I knew that this was that man&#39;s doing, bringing me up this high only to smash me down on something hard and sharp. Just as I accepted my fate and just appreciated the fact that I knew of proof of something beyond the known universe before the end- a giant concrete mass roared under me, catching me before I fell. It was the bunker, driven by someone. Masterfully, I might add. </p>\n\n<p>&nbsp;\nI clung to the side as the reinforced bulldozer as it charged ahead, keeping my eyes shut tight. I didn&#39;t see what the bunker&#39;s left tread ran over- it felt a bomb, or an exploding oxygen tank. It was loud enough to muffle the tornado and stun my ears in a ringing confusion and to almost flip the bunker over. </p>\n\n<p>&nbsp;\nThe bunker stopped. The storm stopped. Everything stopped. </p>\n\n<p>&nbsp;\nIt was a bright day again, not even a cloud in sight. All of the debris in the air lost 100% of their momentum and fell to the earth like dead stones. I looked back in the bunker&#39;s tracks to see the man who lived inside tornadoes, the man who didn&#39;t think he needed a name, mangled, half of his head now touching what used to be the base of his spine. Most of his body was blown apart from the inside, as if he were holding thousands of pounds of pressure in him. There was nothing inside the man, no blood, no bones. Just a thick shell I didn&#39;t want to touch. </p>\n\n<p>&nbsp;\nI went to the back of the storm bunker to thank whoever saved my life. A thick cloud of smoke wafted out when I opened the hatch. It was the unmistakable olfactory signature of my uncle Jake- fresh cigarillo smoke along with that acrid onion-y fume of body odor billowed out from inside the empty bunker.</p>\n\n<p>&nbsp;\nThere now a few less tornadoes in Oklahoma. I want you to thank my uncle Jake for that. Jacob Ganes is his name. Not many people know him. He is a good man.</p>\n</div>\n","author":"IamHowardMoxley"}