{"rank":"188","title":"Apple Johnnyseed","id":"8kdg58","url":"/r/nosleep/comments/8kdg58/apple_johnnyseed/","time":"1526652573000","body":"<div class=\"md\"><p>It’s lonely in his forest. All the trees are moaning, and none of us have leaves.</p>\n\n<p>Oh God - It’s him - It’s Apple Johnnyseed. He’s come for me. Please listen to my story and help me if you can.</p>\n\n<p>I was running late for work this morning, so I didn’t have time to cook breakfast of fix a lunch. I bike to work, because its just as fast once you account for traffic.</p>\n\n<p>Plus, I need the exercise. By the time I was halfway to my job, I was starving. Luckily, my route today took me past a fruit stand.</p>\n\n<p>A grizzled old hag sat on a stool behind the counter, reading a book. She hardly looked up when I skidded to a stop in front of her store to buy some fruit. I was in a hurry, but I tried to be friendly anyway.</p>\n\n<p>“Hi there! What are you reading?” I picked up a piece of fruit and handed her some cash.</p>\n\n<p>“Oh, just some old folk tale. Probably wouldn’t interest someone like you.”</p>\n\n<p>She closed the book and placed it on the counter. It looked ancient, bound in tattered leather. On the cover – which seemed barely adhered to the pages – was a strange title.</p>\n\n<p><strong>Apple Johnnyseed</strong></p>\n\n<p>“Oh! Is it about Johnny Appleseed?”</p>\n\n<p>“Does it <em>say</em> Johnny Appleseed?”</p>\n\n<p>“Well… no, but who in the world is Apple Johnnyseed?”</p>\n\n<p>“Why don’t you take it with you and find out. No charge.” She slid the book over to me with a grin.</p>\n\n<p>I took the book without much thought and pedaled the rest of the way to my workplace as fast as I could, passing several spindly, sickly-looking trees on the way.</p>\n\n<p>The city must have planted them recently, because I’d never noticed them before. It’s springtime, so all the other trees are blooming, but none of these had a single leaf. Nice to see the government putting my tax dollars to good use.</p>\n\n<p>I arrived just seconds before 8 o’clock, so I didn’t even have time to enjoy the fruit I’d purchased. I was swamped at work, so I didn’t really think again about the book until it was time for my lunch break.</p>\n\n<p>When I got off, I walked a couple of blocks to the city park, excited to finally have time to eat my fruit. I found a nice, solitary park bench on which to eat my lunch, passing a few more of those pale, thin trees on my walk over.</p>\n\n<p>They really were odd. Their branches creaked and groaned as I walked past, seeming to bend and wave in the wind, almost like they were trying to get my attention.</p>\n\n<p>As I munched on my fruit, I had my phone in my hand, checking Reddit. But, I couldn’t find anything interesting, so I decided to read the old, wormy book to pass the time. </p>\n\n<p>This is what it said.</p>\n\n<hr/>\n\n<blockquote>\n<p>Listen dear reader and pay me some heed.</p>\n\n<p>Don’t cross mean old Apple Johnnyseed.</p>\n\n<p>He’s a terrible planter. A mean old crook.</p>\n\n<p>He beat me blue ‘til I wrote him this book.</p>\n</blockquote>\n\n<hr/>\n\n<blockquote>\n<p>He towered above me and gave me a slap.</p>\n\n<p>Threatened to boil me alive in his tin pot cap.</p>\n\n<p>His terrible scars were a terrible fright.</p>\n\n<p>His deep voice dictated the words I now write.</p>\n</blockquote>\n\n<hr/>\n\n<blockquote>\n<p>”In his youth, Apple Johnnyseed wasn’t so bad,</p>\n\n<p>‘til he got beaten blue at the hands of his dad.</p>\n\n<p>The awful old man tied his little boy up,</p>\n\n<p>And bruised him and broke him with apples he chucked.”</p>\n</blockquote>\n\n<hr/>\n\n<blockquote>\n<p>”But Apple Johnnyseed didn’t cry, and he didn’t pout.</p>\n\n<p>He just took his lumps ‘til the apples ran out.</p>\n\n<p>Then he waited ‘til nighttime when daddy got drunk,</p>\n\n<p>Then he took a big knife. Then he cut off dad&#39;s junk.”</p>\n</blockquote>\n\n<hr/>\n\n<blockquote>\n<p>”His mean daddy screamed as he slowly bled out,</p>\n\n<p>And he got big red stains on mama’s nice couch.</p>\n\n<p>His body, it rotted and ran out of juice,</p>\n\n<p>But I saved his two balls, and I put them to use.</p>\n</blockquote>\n\n<hr/>\n\n<blockquote>\n<p>I planted his stuff in the black earth out back.</p>\n\n<p>I planted his nuts, and I planted his sack.</p>\n\n<p>I watered and tended them so tender-ly.</p>\n\n<p>And soon I had grown my first Johnnyseed tree.”</p>\n</blockquote>\n\n<hr/>\n\n<blockquote>\n<p>“It pleased me so much. I just had to have more.</p>\n\n<p>And since then I’ve grown least three dozen score.</p>\n\n<p>They moan, and they groan, but they don’t bear no fruit.</p>\n\n<p>NO MORE APPLES TO GET FUCKING CHUCKED BY THAT BRUTE.”</p>\n</blockquote>\n\n<hr/>\n\n<blockquote>\n<p>When his story gets read, he’s always nearby.</p>\n\n<p>With his pot on his head, and his knife hand held high.</p>\n\n<p>So all you apple-loving bastards beware,</p>\n\n<p>Lest you be caught up in Johnyseed’s snare.</p>\n</blockquote>\n\n<hr/>\n\n<blockquote>\n<p>If you read his tale with an apple in hand,</p>\n\n<p>He’ll boil your bits, and he’ll sow the land.</p>\n\n<p>So avoid the curs’d fruit and leave them all be,</p>\n\n<p>Or you might just wind up as a Johnnyseed tree.</p>\n\n<p>THE END</p>\n</blockquote>\n\n<hr/>\n\n<p>How do people come up with this stuff?! I mean, <em>come onnnn.</em> Reading a book “with an apple in hand” curses you to be castrated and turned into a “Johnnyseed tree?” </p>\n\n<p>Oh nooooo! I’m scaaaared! Thank God I’d bought a <strong>banana</strong> at the fruit stand this morning.</p>\n\n<p>What? You thought it was an apple I bought earlier? No way. Potassium all day, baby. You really thought I was going to get butchered by some crazed fruit maniac?</p>\n\n<p>“Apple Johnnyseed.” What a joke. I laughed when I thought of how silly it was to be afraid of a children’s tale like that. Someone had probably just written that lame story to make fun of the city’s attempt at growing these pitiful, creepy looking trees.</p>\n\n<p>Then I heard another voice laughing behind me, and an impossibly large shadow fell over me. I was too afraid to turn around, but when I heard him sharpening his knife, I knew Apple Johnnyseed had come for me. </p>\n\n<p>That’s when I realized my mistake.</p>\n\n<p><em>I’d read the story with my iPhone in my hand.</em></p>\n\n<p>There it was… the Apple logo, shining clear as day. I’m sorry, fellow iPhone users. He gave me time to write to you, so I could have you as companions forever. </p>\n\n<p>It’s lonely in his forest. All the trees are moaning, and none of us have leaves.</p>\n\n<p><a href=\"https://www.reddit.com/u/Deesco5/?st=JGNPKE94&amp;sh=a169fb49\">Deesco5</a></p>\n</div>\n","author":"Deesco5"}