{"rank":"2","title":"tap tap","id":"8kdwja","url":"/r/nosleep/comments/8kdwja/tap_tap/","time":"1526656332000","body":"<div class=\"md\"><p>Something just happened to me at work and I wanted to share it with you.</p>\n\n<p>I work in an office building with at least eleven floors. I say at least eleven floors because our elevator goes up to the 10th floor but there’s an 11th floor accessible via the stairwell. For the past few months, I’ve been climbing the stairs during my breaks because I thought I might as well get some exercise while at work.</p>\n\n<p>The stairwell in my office building is fairly unpolished. The walls are unpainted concrete, it is lit well enough to avoid tripping hazards, and unlike the typical office environment of the rest of the building the stairwell kinda of feels like a concrete bunker.</p>\n\n<p>When I first started this exercise, I could barely make it to the 9th floor before I ran out of gas; I work on the 3rd floor. As time passed, I was able to make it all the way to the 10th floor. During my first triumph reaching the top, I was surprised to see the stairs go up past the 10th floor since our elevators only go up to the 10th. I decided to continue climbing the stairs. At the top of the stairs was a small platform that lead to a door 11. The door looks like any other door on the other floors except it had an “Entry Forbidden” message printed on it. It was very quiet and tranquil just standing on the top platform. There is an ever-present hum coming from the other side of the door. I can only describe this hum as a very very dim electrical current. Beside the door is a standard door lock beep thing where you tap your ID card. I tried tapping mine but was not granted access. I didn’t think much of it, rested, did some stretches, and tapped the metal heater attached to the wall two times as a symbol of triumph before I started going down the stairs.</p>\n\n<p>It became a habit of mine to climb the stairs, reach the eleventh floor, do a little stretch, and tap the heater two times. I did this every weekday for the past 6 months. As time went on I would stay on the top platform for shorter and shorter since my stamina was getting better and I required less rest.</p>\n\n<p>Today during my stair run I reached the top, stretched a little, and did my two tap thing. As I started my descent I swear I heard two taps coming from the 11th door. It was very feint but also clear enough that I couldn’t have mistaken it for any other noise. I looked back VERY briefly at the door and noped out immediately. I’m a big chicken.</p>\n\n<p>Now I’m a very logical person but honestly that experience left me feeling very unsettled. I don’t want something so silly to prevent me from getting my daily exercises. What do you guys think it was and should I continue my stair climbs next Monday?</p>\n\n<p>Edit: Nevermind. I didn&#39;t know Nosleep was a fiction subreddit. Please disregard this post.</p>\n</div>\n","author":"PokemonGamerzReddit"}