{"rank":"4","title":"The eldritch moon","id":"8kdwem","url":"/r/nosleep/comments/8kdwem/the_eldritch_moon/","time":"1526656306000","body":"<div class=\"md\"><p>I woke up to a pale ghastly red light streaming in from the grubby window to my side, the confusion of what woke me up was cleared by the loud buzzing of my phone on the polished table next to my bed.</p>\n\n<p>Hundreds of messages were streaming in each more strange than the last, but the one that caught my attention was a government crimson alert that went like this:\n<em>crimson alert</em>\nPlease avoid looking at the moon, stay inside and secure your home, evacuation is on its way.\nI must admit this message struck genuine fear into my heart, what danger could the moon pose?</p>\n\n<p>After the shock of the alert I checked the other alerts streaming on to my device, almost all of them were encouraging me to look at the moon.\nThe strangest of these messages went like this:\n“The moon is gorgeous tonight, won’t you have a look outside? : )”</p>\n\n<p>The street outside was bathed in the same strange light streaming through my window.\nThe red tinted darkness seemed deeply menacing in a way no longer known to civilised society, a deep primal fear a genetically learned dread.</p>\n\n<p>From outside I could hear mad laughter and the acrid smell of smoke.\nI looked out the window and viewed the street below, I could see a burning pyre in the neighbours yard.\nFurther up the street I could see a corpse propped up on a cross.\nThroughout the street a red tinged mist billowed, flowing like a river through the road.</p>\n\n<p>At this point I was truly terrified and praying that the evacuation arrived soon freeing me from this eldritch nightmare.\nOne of the neighbouring houses door flung open and a clearly terrified man with a shotgun stepped out cautiously clutching his weapon tightly with the grip of a man terrified for his life and sanity.</p>\n\n<p>As he was enveloped by the fog I could see outlines deeper in the mist drift towards where he entered.\nA few moments later I heard a scream and then shotgun blasts coming from that same area.\nEventually the blasts of gunfire and terrified screaming fell silent.</p>\n\n<p>It’s been an hour since the man entered the red fog since then a truck marked EVAC sped through the foggy street, Creatures wreathed in fog pursued it through the darkened road.\nThe truck came to an abrupt stop at the end of the culdesac my house resides upon.\nTwo men in full military gear stepped out of the evac truck, the taller of the men climbed up the side of the truck while the other man stood watch.</p>\n\n<p>The black creatures moved closer to the man standing guard, a few moments later the screaming began again, the same deep primal terror of the man with the shotgun.\nThe soldier on the roof of the truck was on the radio, at first I couldn’t make out what he was saying but then he started shouting this is what I could make out:\nWE NEED ARIAL EVAC IMMEDIATELY THE DANGER IS WORSE THAN WE THOUGHT! I’VE GOT THREE SURVIVORS WITH ME.</p>\n\n<p>A part of me wanted to run out there and call for help but I knew the creatures in the fog would most likely get to me first.\nI also knew if I stayed here I would have no chance of surviving though, so I decided if I’m going to go out, I’m going out swinging.\nI grab my phone, laptop, and chargers for both and begin  running down the stairs I also grab the crowbar lying on the floor from the home renovations I was having done.\nFrom there I slammed open the door and began to run towards the truck within the fog.\nFrom all around me came skittering and hissing.\nI could a silent screaming throughout the air, it seemed to instil a deep fear inside me and motivated me to run at a much faster pace.</p>\n\n<p>The small pitch black creatures chased me through the fog but I eventually made it to the truck and scrambled up to the roof.\nThe creatures hissed and retreated back into the fog.</p>\n\n<p>The soldier looked at me and said:\narial evac is on its way you’re lucky you made it in time, shits gone to hell and even the government can’t keep things under control.\nWe’re heading to a skyscraper in the city that’s been set up as an outpost.</p>\n\n<p>I simply nodded in return too terrified to speak.\nA few minutes later the sound of a helicopter could be heard above the screams and the crackling of the fire.\nBefore it arrived to save us from this living nightmare something began to climb up the side of the truck.</p>\n\n<p>It was a man with pure black eyes and blood covering his face in a style that resembled a blood red moon.\n2 gunshots rang through the darkness and the \nman fell back into the fog.</p>\n\n<p>The soldier was holding a smoking pistol and wearing an expression of pure fear.\nThe noise of the chopper became incredibly loud.\nThe soldier unlocked the back of the truck and shouted at the three figures inside to climb up to the top of the truck.\nOnce they had all made it the soldier helped them into the chopper.</p>\n\n<p>The ride along the city truly showed the damage the moon had caused, pyres burned all across the landscape like stars in a horrific night sky.\nScreams echoed from all directions and I saw one man jumping from a building into a dense patch of fog.</p>\n\n<p>The world was ending, and all because of the fucking moon.</p>\n\n<p>As we approached the high rise district of the city it became apparent even the big city was not spared from the horror.\nOn one building I saw a man hanging from the window by his own guts.</p>\n\n<p>When we finally landed on the skyscraper we were given our quarters and left to our own devices I guess I’ll update this in the morning with new info, we’re getting a briefing tomorrow.\n I’m posting this on reddit because I need to know if it’s this bad in other places.\nI don’t know if I can cope.\nStay safe folks, and don’t look out at the moon.</p>\n</div>\n","author":"TheNukaDweller"}