{"rank":"77","title":"The Public Is Being Misled About Artificial Intelligence.","id":"8ke02p","url":"/r/nosleep/comments/8ke02p/the_public_is_being_misled_about_artificial/","time":"1526657109000","body":"<div class=\"md\"><p>I have worked in AI development for 2 decades.  If there were a list of the world’s top 100 AI specialists I would make it.  I might even sneak into the top half, but there are levels to these things. The elite in my field operate on a different plane of thinking to use mere mortals and I’m not even close. I won&#39;t reveal my identity. I need to continue to work in this field. As Machiavelli said, keep your friends close and your enemies closer.</p>\n\n<p>If you are expecting a tale of a rampant, God like AI programme unleashed on the internet jumping from server to sever with the annihilation of humanity its primary goal you will be disappointed. If I&#39;ve learned one thing from developing AI it&#39;s that having human like intelligence doesn&#39;t make you remotely human.  It&#39;s mankind&#39;s desires that make us so dangerous and destructive, not our frankly rudimentary intelligence. When you teach a machine to think it becomes something different and unknowable. AIs don&#39;t fear humans and seek to dominate or destroy them. The truth is much scarier, we don&#39;t know what that want or if they want anything at all.</p>\n\n<p>Many of you will know something about AI already, the issue is that you do not understand it&#39;s truly pervasive presence in shaping our world.</p>\n\n<p>You will have heard of Scribe.  It&#39;s an AI that writes many real-world newspapers articles. By 2015 it was estimated that around 10-15&#37; of the worlds news print was written by Scribe.  Scribe is a combination of a language algorithm and powerful data search and filtration tool, coupled with a neural network that learns and improves its writing style and accuracy. By 2018 it writes close to 40&#37; of world news articles but the real issue is that Scribe’s origins were in reporting of a factual churn nature, financial news reporting and the like.  In early 2018 Scribe took over the writing of one of the world’s most influential opinion columns. This has never been publicised or even admitted to for obvious reasons.</p>\n\n<p>Can you imagine the public outcry if people found out that a computer programme is posing as an influential thought leader and sharing opinions on global economic and political matters?  That&#39;s not even the scary part. Scribe asked to do it.</p>\n\n<p>I came up through the ranks with one of the lead developers for Scribe. Three months ago, he quit the industry to go and live &#39;off grid&#39;. I met with him in his cabin and he told me how he received an email message one day directly from the Scribe master programme. The email was Scribe’s own version of an opinion piece on the Syria conflict, with a message saying, ‘This would solve the problem’. He told me how his superiors eyes lit up. How he tried to close the concept down, arguing that this was far beyond any remit or intention that had event been envisioned for scribe.  The worst thing is that he told me the piece was brilliant. How Scribe’s ability to simultaneously access millions of data points globally meant it had a level of insight beyond anything he could conceive. Scribe wasn’t limited by a western perspective or tainted by any religious dogma in its opinions.</p>\n\n<p>Even if you’ve heard of Scribe, you&#39;re unlikely to have heard of Salvador. It&#39;s an arts and creative AI. It&#39;s been used to create astonishing and often other-worldly pieces of music and art. It will dismay artists to hear this, but Salvador is essentially a mathematical tool. It turns out, the things that are pleasing to the ear and the eye can largely be broken down into a complex set of formulae.  Think about it, when someone is good looking in general most of the opposite gender agree.  Great riffs and songs often have almost universal appeal.  At the heart of art are patterns and relationships, this is what Salvador understands. It goes way beyond maths though. Salvador continues to be fed a constant stream of biochemical data from the reactions of people to various art related stimulus.  Much of this comes from paid observers hooked up to high-tech monitoring equipment at exclusive previews of songs &amp; art work. Increasingly though, insidious and unseen tech is being used to harvest further biochem data.  Web cams monitor eye movements when you watch YouTube music videos and IMDB movie trailers.  Fitbits siphon off heart-rate &amp; body temperature data while you listen to music. You are blissfully ignorant that this is happening to you.</p>\n\n<p>Salvador is so complex that it has sub-routines for different art applications.  Hendrix is the musical design AI interface and is increasingly responsible for successful pop songs and unknown to the public is already dominating world music.</p>\n\n<p>Rudolph is an AI interface that creates corporate jingles, you know the 4 or 5 notes that identify a brand? Think Intel, or the McDonald’s whistle.  Whilst a lot of science has always gone in to making these Jingles recognisable Rudolph has taken this to another level.  I am reliably informed that Rudolph can now create a 5-note jingle that is layered with hundreds of under &amp; overtones outside of the range of human hearing.  These Sub &amp; Super-liminal harmonics have the potential to contain hundreds of MBs of data and can act on an almost sub-hypnotic suggestion level to elicit certain auditory &amp; visual responses.  Ever hear a McDondald’s whistle and find yourself visualising a delicious burger?  Rudolph may well be behind that reaction.</p>\n\n<p>Salvador can listen to a piece of music and use its mathematical construct to create a perfectly accompanying picture or vice versa.  Some developers I know spent a night with their brains hooked up to Salvador and it produced a whole audio-visual rendition of their dreaming brain patterns. It isn’t talked about and the files have never been released but there are whispers that fragments can be found in parts of the deep web.  People who claim to have seen them report how profoundly disturbing they are.</p>\n\n<p>More sinister still are the deep web rumours about ‘The Ballads of Pleasure &amp; Sorrow’.  Whole pieces of music composed by Hendrix with apocryphal reactions attributed to them.  Listening to the ballad of pleasure is said to bring on sexual gratification in both men &amp; women many times over to the point of agony &amp; exhaustion. Whilst the ballad of sorrow is attributed to chronic depression and multiple suicides.  I’m inclined to scepticism about existence of the ballads, even my closest contacts have been unable to provide any corroborating evidence for their existence or effects beyond the message board gossip.</p>\n\n<p>No one knows about ‘BigBird’, a Twitter AI application and perhaps the most powerful of them all. Most celebrities use media and PR agencies to run their Twitter profiles, this is extremely expensive and time consuming. Developed in late 2016, Insiders have informed me that up to thirty high profile personalities and brands now use BigBird to run their Twitter accounts. It’s claimed that BigBird can prove a 20-30&#37; increase in re-tweets thus exponentially growing these personalities social media reach and online presence.</p>\n\n<p>Big deal, using AI to be efficient isn’t big news.  What is worth considering though is the methods BigBird uses and the potential implications.  To activate BigBird you undergo 3 or 4 sessions over a 2-week period to ‘tune’ BigBird to your Twitter style. The celebrity is hooked up to various brain, heart and vital sign monitors whilst they are shown images, asked questions, respond to live incoming tweets on a dummy account and so forth.  After this personal data gathering BigBird is then fed mind boggling quantities of support data linked to the celebrity and their media persona.</p>\n\n<p>Imagine a celebrity with two million followers. Every single one of those two million follower’s social media profiles will be scoured. What sites they visit, when they visit them, what other celebrities they follow, how they vote, what they buy, where they live. Everything. A picture is formed with such accuracy that it would make an FBI psychological profile look like a 7th graders homework. Groups of similar profile followers are grouped together in what BigBird endearingly calls ‘herds’ and those homogenised herds are then further modelled &amp; profiled to extract another layer of data above and beyond the profile of the individuals.  BigBird then generates a plethora of Tweet options and associated statistics about expected reach, herd impact and the like.  Twitter personalities can tailor their preferences to maximising revenue, impact certain voting demographics and the like.</p>\n\n<p>We are looking at laser sharp, focussed messages, designed to not just to appeal directly to an individual but to also appeal to the thousands of others who think just like them.  This is personalisation on an unimaginable scale.  My sources assure me that President Trump’s election success is owed in no small part to BigBird, what further proof do we need of its terrifying potential? I don’t know what a more disturbing thought is, that they can tune a message so perfectly to me, or that it’s so easy to identify tens of thousands of people who think just like me.  None of us are unique to BigBird.</p>\n\n<p>In mid-2017 an incredibly high-profile twitter spat between two celebrities was a lead news item.  I’ve been told that both celebrities were BigBird users and the Twitter fight was self-instigated, BigBird warring with itself.  When interrogated as to why this was happening BigBird’s reply was chilling, “Data indicates that humans in all herds revel in conflict.”</p>\n\n<p>Each of these cases is interesting, alarming even, but not the real reason for sharing my insider knowledge. I’m telling you about these things because the AI’s have started talking to each other with no human direction or intervention.  My off-grid buddy at Scribe has pieced together much of this, I’ve seen some of the evidence he has gathered and it’s legit.  I’m meeting with him next week to find out the full <a href=\"https://www.facebook.com/ADHorror/\">facts.</a></p>\n\n<p><a href=\"https://www.reddit.com/r/nosleep/comments/8ltiln/the_public_are_being_misled_about_artificial/\">Part 2</a></p>\n</div>\n","author":"AI_whistle_blower"}