{"rank":"14","title":"Writers block","id":"8ke12w","url":"/r/nosleep/comments/8ke12w/writers_block/","time":"1526657344000","body":"<div class=\"md\"><p>Writers often scrap their ideas.</p>\n\n<p>I can’t ever seem to be able to write something I’m really not passionate about, however this is a rule anyone can apply to their daily lives. My wife of 2 years, Kate pestered me constantly a year ago about the idea of starting our own family. I would be a liar if I told you the idea sparked my interest, I’ve never pictured myself a family man and am fairly quiet which is one of the qualities my wife told me she loved about me. Her yearning to start a family with me went against my personality. </p>\n\n<p>Fast forward.</p>\n\n<p>I’m typing this from my computer because I now feel ideas flowing through my mind unlike the times before when I sat in my living room trying to write some cliche shit-novel which was going to be a spin on my own personal life. I had writers block from the moment I married my lovely wife, I now know why. We had twins last April, which given my distaste for the family life as you could imagine was a very unpleasant surprise to me. I watched them whine and grow before I felt a feeling I just couldn’t seem to recognize, I felt like I was in a pit that seemed to get deeper and deeper as me and my wife became more stressed and argumentative with each other. She would stay at home with the kids while I worked in my older brothers office after he reluctantly gave me a job once he saw the desperation on my face when I told him I was going to be starting a family. During this time at the office was when I daydreamed of being able to write again, at night however I would argue with my wife about various subjects, from the most menial and petty of subjects to more concrete and serious ones. I felt the psychosis feeding off my emotions and making itself manifest in my daily life.</p>\n\n<p>I can recount the night like it was yesterday - which it was, but I took the time to clean the mess.</p>\n\n<p>It was my usual family night, toddlers crying and whining about while me and my wife were arguing in our living room, which was where I slept most nights since we only have a two bedroom apartment for our family of four and I don’t think I could bear being around Kate at night. I remember sitting on the couch, legs sprawled out onto the coffee table when she began her insidious bickering that would’ve no doubt lasted throughout the night. Mind you I did say <em>would’ve.</em></p>\n\n<p>You see, from the day we were married, she scrapped many of my ideas in regards to how my life will be. So I decided to scrap hers.</p>\n\n<p>It didn’t take long, in my fit of rage I didn’t even realize what I was doing before it was over. She was laying there for hours while the children slept in the other room, neck and face purple and drying tears lay spread across her face. I had taken the pillow that was resting behind me supporting my back when I had jumped up and enveloped her face into it throwing her on the couch. From there I strangled her, I thought it was enough but I knew it couldn’t be. I just wasn’t a family man.</p>\n\n<p>As the twins lay sleeping in their cribs I took the very same pillow into their room and made sure for their sake it was quick as I could possibly make it. I read the clock. 2:45AM. Things started to make less sense. How could this have taken all that long? What the fuck have I done to my family, all I held dear? </p>\n\n<p>“Doesn’t matter anymore.” I told myself. </p>\n\n<p>It was then that I took out the blending machine from the cupboard above the sink.</p>\n\n<p><strong>At least I have something to write about.</strong></p>\n</div>\n","author":"Gorbado"}