{"rank":"1310","title":"My Husband Blamed Me","id":"8ke5r9","url":"/r/nosleep/comments/8ke5r9/my_husband_blamed_me/","time":"1526658378000","body":"<div class=\"md\"><p>My husband’s last words were an accusation. Nathan blamed me for his death even before it happened by his own hand. Nathan had always been like that, in life and in death, always finding ways to make his mistakes someone else’s fault, usually mine.</p>\n\n<p>“You didn’t care enough, Ivy. This is <em>your</em> fault.”</p>\n\n<p>Some way or another he’d twist things, until I was on my knees and begging for forgiveness. His last words were intentional, one last shot from the grave…a guarantee that I’d never be free. His death was my fault, he wouldn’t let me forget it. Death guaranteed the last word, an argument won and closed forever.</p>\n\n<p>We’d been in the middle of a messy divorce when it happened. Nathan kept the rent controlled apartment… I slept on a friend’s couch. To be honest, I didn’t care; the scratchy fibers of the couch felt like freedom, something I hadn’t had for a long time.</p>\n\n<p>The only real point of contention was our dog, Piper. That, and the fact that Nathan didn’t <em>actually believe</em> I wanted a divorce; he thought I was trying to prove a point. While he waited for me to ‘come to my senses’… he used Piper as leverage. It broke my heart when he refused to let me see her. On the rare days he allowed it, Nathan was sure to remind me what an act of benevolence it was.</p>\n\n<p>My threshold for his bullshit only lasted a good year and a half into our marriage before I started worrying over ways out. The prospect of divorce was enough to get the pews at church abuzz with scandal, which I desperately wanted to avoid. I procrastinated—and tolerated—until Nathan’s bullshit went beyond emotional abuse and became physical.</p>\n\n<p>How did I even get to that point?</p>\n\n<p>My answer shouldn’t come as a surprise: I rationalized the red flags. When we met, Nathan was 28 and I was 18. I’d been eager to prove I was an adult and made mistakes learning what that actually meant. Nathan was an attractive man, made even more attractive by his apparent maturity. His initial possessiveness was flattering; I didn’t realize he considered me a possession until we were already married.</p>\n\n<p>With a divorce already underway, I was actually happy. My life was far from perfect, but the feeling of throwing off the yoke and becoming my own person again was exhilarating. If I could walk away with only one thing, I wanted it to be Piper. Nathan refused to give up his leverage, claiming I was too irresponsible and unstable to keep her. Unwilling to let him win even one more time… I planned shamelessly, intending to get my dog back at any cost.</p>\n\n<p>Nathan didn’t expect it, but I was equally capable of guile. I knew what he anticipated—and frankly, I didn’t have much pride. When I was ready to make my move, I didn’t hesitate to humiliate myself. I let him think he won, showing up one morning and crying on his stoop. I begged him to take me back.</p>\n\n<p>“I made a mistake!” I kept my head down submissively. The theatrics were necessary; an argument at the door wouldn’t resolve anything. If I showed any sign that I wasn’t there for him, I’d only find myself on the wrong side of a slammed door.</p>\n\n<p>Barely able to contain his smugness, Nathan let me inside. Immediately, his lecturing began—he steered me into the living room almost gleefully. My future ex husband loved being right, he loved it so much that I might’ve gotten off easy… if I’d really been there to reconcile.</p>\n\n<p>I grabbed a handful of tissues, dabbing at my face as I continued to blubber. I had cried a lot over the years—ugly crying, not the pretty kind you see on television. My face goes bright red and puffy about ten seconds in; it’s not something you can fake. Hiding my face was the only way to guarantee Nathan wouldn’t catch on.</p>\n\n<p>“Let’s talk about what needs to change for this to happen. I’ll take you back, but you’re going to have to try harder.” Nathan gloated, the words sounded rehearsed. He picked up a notepad with a list of demands, further proof that he’d fully expected my return. Knowing him, he’d type it up and have me sign it when he was satisfied with the ‘terms’… he wouldn’t let me ‘pull this stunt’ again.</p>\n\n<p>I pretended I was too overwrought to listen. I leaned forward, burying my face in my hands with a burst of unintelligible apologies I didn’t mean. Piper had already waddled over on her short, stubby legs—giving my knee a comforting lick. The corgi bought my performance as readily as Nathan did. I reached down to pet her, unable to resist; it had been too long since I’d seen her.</p>\n\n<p>Nathan sighed, tossing the notepad on the coffee table with an audible <em>thwack</em>. He wasn’t angry (he thought that he’d won after all)… but his patience wore thin.</p>\n\n<p>“I’m making us some hot chocolate.” He declared, “Try to get yourself together please, this is embarrassing. I don’t want the neighbors to hear you crying again.” nevermind that he was always the reason I cried, he added: “You’re making us both look even worse than you already have. I wish you had more self control, but… we’ll address it. Things will get better, for both of us.” he said that with authority, but the corners of his mouth must have been quirked in a barely concealed smile. No matter what he said, he was actually delighted. I knew that without looking. I heard Nathan get up, strutting victoriously down the hall.</p>\n\n<p>That was what I’d been waiting for, a moment alone.</p>\n\n<p>I made my move then; scooping up Piper and heading out the front door. My friend Nadine was my waiting getaway driver, peeling off the second I jumped in the car. We escaped to a symphony of squealing tires and the accelerating rhythm of my heart.</p>\n\n<p>We’d made it. I had Piper, and walked out without so much as a scratch! I couldn’t help but grin, hugging a bewildered but excited corgi to my chest. Nathan had underestimated me—victory was sweet.</p>\n\n<p>…</p>\n\n<p>“That was badass!” Nadine howled with laughter once I recounted the story back at her apartment. We were all safely nestled in her living room while a Netflix binge played, ignored, on the screen in front of us.</p>\n\n<p>“Badass?” I snorted. “All I did was cry until he left the room—then I grabbed her and ran. There’s nothing badass about that.”</p>\n\n<p>“Standing up to that douche canoe IS a huge accomplishment, don’t try and downplay it Ivy. With all you’ve been through… you’ve got guts.” Her smile was infectious, I couldn’t help but smile too, but there was still a niggling worry in my stomach.</p>\n\n<p><em>It wasn’t over yet.</em></p>\n\n<p>That night, Nathan called me over and over. When I didn’t pick up, he left messages. I didn’t block him, I always kept his messages for court. The messages escalated from annoyance to fury—and even begging. It was shocking at first, because I’d never heard him cry before. It didn’t make me happy, it made me… uncomfortable. I couldn’t help but listen—driven by morbid/masochistic curiosity.</p>\n\n<p>Then came the final voicemail. He was no longer crying or screaming… his words were perfectly level and assured:</p>\n\n<p>“You didn’t care enough, Ivy. This is <em>your</em> fault.” his voice held the tone of an ultimatum, but I just laughed. He was used to making demands—he was used to me obeying. He didn’t even bother following it up with a threat. For a moment, I thought I was free… his words no longer had power over me.</p>\n\n<p>I didn’t know that these would be his last words to me…his last words to anyone. I got the news in the morning: Nathan was dead, a self inflicted gunshot to the head. Is it bad that my first feeling was relief?</p>\n\n<p>The police deemed it a suicide in record time, thanks in part to a note he’d left me (I declined to read it).The final voicemail suddenly had an unnerving perspective; a grip I couldn’t shake.</p>\n\n<p>Nathan had the last word, there was nothing more I could say. I became a widow, with no need for a divorce. Dutifully, I dealt with the aftermath. I didn’t smile… it wasn’t a victory.</p>\n\n<p>About a month after his death, I moved back in to the apartment we’d shared. I was reluctant, but knew I couldn’t stay on Nadine’s couch forever. The old apartment was a haunting collection of bad memories, I tried to fix that: I got rid of everything. I used my savings to buy new furniture, trying to make the apartment look and feel completely different.</p>\n\n<p>It didn’t work because Nathan had never left.</p>\n\n<p>I heard him. Felt him, but… I never saw him. It was enough to keep me in denial, I fell back into a pattern of stubborn rationalizations just I had in our marriage.</p>\n\n<p>At night, Piper would bark at something unseen. I’d hear creaking footsteps creeping down the hall; a slow and deliberate tread, like a predator waiting to be noticed. The building must have been settling. I’d pull up the covers, trying to ignore the oppressive weight of anxiety as I curled beneath the blankets.</p>\n\n<p>Denial didn’t stop the footsteps from coming closer, closing in on my cowering form. At the foot of the bed I’d hear Nathan’s voice; his words woven with shadows, a tapestry of woe:</p>\n\n<p>“You didn’t care enough, Ivy. This is <em>your</em> fault.”</p>\n\n<p>A footstep followed each syllable; the mattress warping under his weight as he climbed under the covers too. I had to be imagining things… I told myself it was the guilt. Guilt I didn’t even need to be feeling. I’d tell him so, a wavering whisper… but that just made him laugh with incredulity at my gall.</p>\n\n<p>It was was worse when he didn’t laugh.</p>\n\n<p>I’d feel the bite of his fingers, gripping my throat with invisible hands. I’d be paralyzed with fear, gasping for breath while his tongue would trace the contours of my body, leaving an icy trail of putrid saliva and my own cold sweat. Time always seemed the slowest then. I couldn’t move, but his grip was just tight enough that I could still scream.</p>\n\n<p>“You did it to yourself!” became my shrieked mantra in the middle of the night, every night. A prayer before the sun started its descent. Medication, meditation, none of it helped. I was haunted, terror lurking in every shadow and unexplained sound. I wore a necklace of fingerprints, bruises circling my neck.</p>\n\n<p>My nights became increasingly difficult to explain away. I lost it when I woke up one morning to find a ring under my pillow—my wedding ring, long abandoned. The simple band was a gleaming circle of etched gold, engraved with my broken promise: ‘<em>Forever Yours</em>’.</p>\n\n<p>I dropped it in the toilet, flushing it down with stress induced vomit—but that wasn’t the end of it. The ring appeared under my pillow the very next morning, within a stinking water stain and a single dirty hand print next to where my head had been.</p>\n\n<p>The next few days were a repeat of the same, with alternating methods of disposal. It didn’t matter, the ring kept reappearing, until one day it wasn’t under my pillow. A moment of relief was cut painfully short—<em>it was on my left ring finger.</em></p>\n\n<p>I couldn’t get it off, no matter how hard I tried! Trying only made it worse, tightening until my skin began to bulge and discolor. It didn’t stop, even after cutting off my circulation… The metal bit into my skin, blood seeping out and running in rivulets down my hand and arm as I tried to drive to the hospital.</p>\n\n<p>The gold was unnervingly cold, even when my skin was glistening red… my wedding ring remained immaculate, gleaming without a drop. It didn’t stop, even when I stopped resisting and parked my car in the middle of traffic— screaming in agony— the ring continued to chew through my finger, until it was off completely.</p>\n\n<p>It was only when my finger fell off and rolled under the driver’s seat that the pain went away, giving way to a tingling numbness. I finished the drive to the hospital, managing to find my lost digit… but not the ring, it was gone.</p>\n\n<p>The finger couldn’t be reattached. While it wasn’t a life threatening injury, the loss of my ring finger was symbolic. It was a message: I was never going to get married again, I still belonged to Nathan.</p>\n\n<p>The ring did not reappear after that, but I couldn’t sit still and wait for Nathan to find new ways to hurt me. I knew he would, because the more I tried to ignore him… the angrier he became.</p>\n\n<p>Without any other options, I went to church. It seemed silly even to me, but I didn’t know where else to turn. After services were over, I waited patiently for the congregation to disperse… I kept my head down, not making eye contact with anyone. I didn’t want my plight to become gossip, so I wouldn’t speak up until everyone else had gone.</p>\n\n<p>Except in passing, I’d never spoken to Father Dan. Although I faithfully attended every Sunday service, I’d never felt comfortable asking for his help directly. Of course, I probably could have used his help a long time ago… ‘taking responsibility’ for my mistakes and enduring had not ended well.</p>\n\n<p>Father Dan noticed, taking a seat beside me once the church went quiet. His eyes were warm, his face lined with years of genuine joy and sorrow; he was a man who had heard and seen it all. I’d always found him intimidating, he wasn’t exactly what you pictured when you thought of a priest. He was scruffy, with calloused hands and skin that was almost perpetually sunburned… I wasn’t sure how he found time to get a tan, let alone the time to overdo it!</p>\n\n<p>Once I was sure we were alone, I told him all that had been going on since I’d moved back into my old apartment. I didn’t hold back, finding it surprisingly easy to be honest with him. I showed him my left hand, missing a finger. To my credit, I didn’t even cry. To his credit, he didn’t interrupt me once—just listened quietly to my entire story, withholding judgment.</p>\n\n<p>“This isn’t your fault.” He told me once he was sure I was done. I smiled wearily when he said that—it did sound a lot more convincing coming from a priest. “Where’s his body?” Father Dan was getting right to business.</p>\n\n<p>I was surprised, but answered: he’d been buried at Memorial Park Cemetery. I watched as he wandered over to his office… only to return moments later with a shovel and what I assumed was a very old bible.</p>\n\n<p>“Father, can you explain before I get the wrong idea?” I laughed nervously, eying the shovel. He smiled, not at all surprised by my reaction. He answered decisively, speaking slowly in the scripted way people do when they’ve explained something a thousand times.</p>\n\n<p>“His body needs to be burned.” He explained, “Unfortunately, since he’s buried…” he nodded towards the shovel by way of explanation. “I’ll also annul the marriage.” He added, “I’m assuming the courts didn’t deem it necessary to issue a decree of divorce upon his death?”</p>\n\n<p>“They didn’t, there wasn’t a need. ‘Till death do us part’, right?” except Nathan hadn’t parted after all. I felt tears build pressure behind my eyes, but I managed to keep them in check.</p>\n\n<p>“That’s poetry. Death isn’t an end, it’s a beginning. If you were happily married, would you really want to be parted from someone just because you’d died?”</p>\n\n<p>“… No.” I admitted, although I considered that a big if. <em>If</em> I was happily married.</p>\n\n<p>“I have the authority to annul the marriage in this case, there are special circumstances. That won’t sever his connection completely, but… the cleansing fire will.” I didn’t pretend to understand, but I had hope. Without further argument, we both made our way to Memorial Park Cemetery.</p>\n\n<p>It felt like the setup to a bad joke: <em>A priest and a widow walk into a cemetery</em>… only neither of us were laughing. However, for the first time since Nathan’s haunting had begun—I felt safe. Father Dan waved at the groundskeeper as we walked through the gate. The groundskeeper waved back; not batting an eye when he saw us with a shovel conspicuously in tow.</p>\n\n<p>My fears that we would be caught were quickly proving unfounded, this must not have been the first time Father Dan had to perform this kind of service. It was broad daylight, but that didn’t seem to be a deterrent. No one bothered us.</p>\n\n<p>“Is this really okay?” I bit my lip, watching him press the shovel firmly into the dirt covering Nathan’s grave. I was surprised to see a priest doing this sort of heavy labor—when I offered to help, he wouldn’t have it. Father Dan was considerate of me, pausing every few minutes to offer a kind word or reassurance even when his breathing became labored from the task at hand.</p>\n\n<p>“You’re so comfortable at a time like this… have you done this before?” I finally felt comfortable making conversation, breaking the one sided silence to ask.</p>\n\n<p>“Many times, unfortunately.” He answered, “Don’t worry, this isn’t illegal. You’re the widow, you have the authority to allow this. Breathe, Ivy.” his smile compassionate, his tawny eyes crinkling at the corners.</p>\n\n<p>“It’s just… I don’t know…” But my reaction must have been common, because he was calm and patient throughout. I’d always thought Father Dan was stern and serious from where I’d sat during the Sunday services, now I saw that I’d misjudged his character.</p>\n\n<p>When the casket was unearthed, he had me step into the grave where he read a passage from his book. All I had to do was repeat after him, with my hand placed on the dirt caked coffin—carefully enunciating every syllable, although the recitation wasn’t in a language I understood.</p>\n\n<p>With that, I was free. It was so simple I almost wanted to laugh—a lot easier than anything I could have hoped for in a courtroom.</p>\n\n<p>I kept my distance while he salted and burned the body, adding a dusting of a strange black powder from a satchel at his waist. I tried to ignore the smells and sounds of burning flesh… It wasn’t pleasant, even if he’d been dead for a while.</p>\n\n<p>I refused to leave, even with assurances that I didn’t need to stay. I needed the closure, so I waited as the fire burned unnaturally hot and bright—watching a column of black smoke rise dramatically up into the sky, as though Nathan were giving us both the finger. The thought didn’t frighten me, it made me smile.</p>\n\n<p>It was only when the body was reduced to ash that I braved a look inside what was left of the coffin. I almost wasn’t surprised to see two golden rings, spotless and gleaming amid the ashes. Our wedding bands. Father Dan picked them up, despite my immediate protest—having lost a finger, I was naturally reluctant to see them in anyone’s hand.</p>\n\n<p>“Remnants like this have their uses within the Church.” He assured me, “Don’t worry, without Nathan’s malice tied to this Earth any longer… they are rendered inert.” While I didn’t feel completely convinced, I decided to believe him. This wasn’t the first postmortem annulment he’d performed, I didn’t even want to know what else he’d done or how often! Some things are best left to the experts.</p>\n\n<p>“So he’s…?” of course, I had a million and one questions. Father Dan predicted them and answered before I could even find the words:</p>\n\n<p>“Gone.  Without a physical body or marriage to tether him, he will go where he’s meant to go now. Take a shower before sunset, and you’ll be cleansed as well.”</p>\n\n<p>The muddy priest fished through his pockets and extended a business card, pressing it gently into my hand. Confused, I glanced down to read the embossed golden print: Father Dan’s Plumbing and Exorcism Services. As my eyes met his with questions, he grinned sheepishly.</p>\n\n<p>“My services are primarily word of mouth, I don’t advertise because I only take on special jobs.”</p>\n\n<p>“You’re also a plumber? Is that … allowed?” it wasn’t that I’d cause trouble, but the question stumbled out of my mouth anyway before I could think better of it. By ‘special jobs’, I guessed he didn’t mean clogged toilets.</p>\n\n<p>“Only as an extension of my ministry.” he explained, leaving it at that. He mopped at his brow with a handkerchief that had seen better days, exhausted yet exuding a sense of deep satisfaction.</p>\n\n<p>“Thank you, Father.” I whispered gratefully, tucking away the card. I had more questions, but I decided it was better not to ask. I already felt like I knew too much, I didn’t need or want to know anymore.</p>\n\n<p>“Go home Ivy, your duty has ended here.” with a final pat on my shoulder, he sent me on my way. “See you next Sunday.”</p>\n\n<p>The first thing I did when I got home was take a long shower, washing away the events of the day and the past few months, watching my worries wash down the drain. Nothing happened, even when the sun set. I’d grown so used to nights of terror that I didn’t completely trust the peace and quiet at first, but that initial apprehension melted quickly.</p>\n\n<p>As I lay down to sleep, curling up with my corgi. I murmured a quick, sincere prayer…I took comfort in the fact that Nathan was gone. Remembering Father Dan’s words, I smiled: <em>he will go where he’s meant to go now.</em></p>\n\n<p>Who would’ve thought I’d be relieved that Hell <a href=\"https://pennytailsup.com\">exists?</a></p>\n</div>\n","author":"pennytailsup"}