{"rank":"772","title":"How to Properly Dispose of a Body","id":"8keao2","url":"/r/nosleep/comments/8keao2/how_to_properly_dispose_of_a_body/","time":"1526659432000","body":"<div class=\"md\"><p>Sometimes death smells like copper. It is the blood leaking out. This is acceptable, although not ideal. It is better to remove blood from the equation. Keep it inside the skin.</p>\n\n<p>Sometimes it smells like the ocean. I like this. This is my will. I am nine years old again standing on the rocks of the cape, wind slicking my face with tiny droplets of water. My ears filled with the sounds of gurgling. Bubbles. Coughing. </p>\n\n<p>Sometimes death smells like shit and vomit. I do not like this. There is no way to honor a deceased pig. These pigs don’t even deserve a slaughter. This is not my will. There will be no principle in their filthy deaths. You wouldn’t eat infected pork. They can be left anywhere. Tossed out of a van. Discarded. They are not worthy of my gift.</p>\n\n<p>What I’m trying to say is that different bodies deserve different treatment. My most recent body was one of the heavenly ones.</p>\n\n<p>When I abducted him he was unconscious. Beautiful. His thick golden hair would look like seaweed beneath the water. I awakened in the car just thinking about it. Our souls connecting on a cosmic and chemical level. The long pure strands of blond reaching out like fingers, grasping at the liquid, never finding the air. This is my will.</p>\n\n<p>He died of drowning, like they all do. I leaned down and smelled his wet hair. It was a soft, leafy smell. Good. This was my will. He passed the most important test. This body was worthy.</p>\n\n<p>My process is simple. Take, drown, honor. They call me the Water Torture Killer but it’s not true. I do not torture them. I free them. I hold their souls and return them back to the water. The ocean is a big place. Full of bodies, mine and others. Like a fishbowl of corpses.</p>\n\n<p>They never found my cousin on that sunny day when I was nine. The water claimed him.</p>\n\n<p>I pulled up to the shoreline. He was in the backseat. I could still smell the earthy mist of death wafting off of him. I loved him in that moment as I hoisted his body above my head. This is my will. I walked through sand and pebbles. I walked until the ocean was pulling at my ankles, then my knees. Like a parent putting their child to bed I cradled him in the water, stroking his hair one last time. I sighed. This was the hardest but most beautiful part. I pushed him into the waves.</p>\n\n<p>Just as I pushed my cousin Will all those years ago.</p>\n\n<p>I stood still until I could no longer see the pink of his decomposing body. This is my will. Another child given back to the water. This one was no older than six. </p>\n\n<p>Saying goodbye was never easy. I felt a heavy sinking feeling as I trudged out of the water and through the sand. The loneliness was back. </p>\n\n<p>But not for long. The next day I spotted a golden haired boy on the playground. I couldn’t stop smiling. This would be my Will.</p>\n</div>\n","author":"EZmisery"}