{"rank":"14","title":"I, The Hunter","id":"8kebwu","url":"/r/nosleep/comments/8kebwu/i_the_hunter/","time":"1526659697000","body":"<div class=\"md\"><p>This is part Two in this series and if you haven’t read part one already i suggest you do, you may not recognize some of the terminology I’m using in this post and it introduce you to who i am. I am a hunter. Part one will be linked at the bottom of this post.</p>\n\n<p>Now on my last post someone wanted to know how i came into contact with, and began working for the organization that i am currently with. This made me realize that that was actually a pretty good story. Unfortunately, due to personal reasons and specific rules given to me by the organization, i will not be giving specific locations or names within this post. You know the drill. </p>\n\n<p>What i can tell you is that i was second in command of a highly mobile task force based in North America. The team consisted of five members and we each specialized in specific fields. While we all had training and experience i was designated combat specialist at the time. Also note that all of our operations were completely off the book and if they were to come to light they may cause controversy. I’ve been fighting fights that no one even knows about for a long time now, maybe that’s why i suddenly feel the need to share?</p>\n\n<p>Anyways, we get word from HQ that some operatives from another team had gone missing. They were all MIA. These are highly trained soldiers and 6 MIAs with professionals of their level is unheard of, and unsettling. Orders come down a little later that we are to be deployed with another team of six to secure the area and find the bodies. Bodies? I thought they were MIA? I’m beginning to think that the higher ups know something we don’t. The rest of my team felt the same way. </p>\n\n<p>Also the reason we have 5 members instead of 6 like the other teams is because our tech specialist had recently taken massive blunt force trauma to the head when thrown into the air by an exploding air compressor that was pierced by a stray bullet. He was recovering at the time of this mission.</p>\n\n<p>We didn’t want anything to do with this mission, especially since we were a man short. But disobeying orders wasn’t an option, we were to proud. </p>\n\n<p>We get to the sight were the team went “missing” and it’s in the middle of the woods. I start scanning the area for Anything when one of the members from the other team calls in an abandoned cabin over the radio. They were dropped in on the other side of the search area and they came upon the house first. They then start to report spend Shell casings that matched the weapons that the MIA team was equipped with. And blood. Lots of blood. No meat or bone or bodies, just blood. And the blood lead to a shattered window on the side of the cabin from what the other team was reporting.</p>\n\n<p>Then the gunshots started. Lots and lots. We frantically called over the radio “TEAM ONE, TEAM ONE, REPORT REPORT! WE CAN HEAR SHOTS FIRED!”No response “WHAT THE ACTUAL FUCK IS GOING ON OVER THERE!”No response. And now no more gunshots. </p>\n\n<p>We were scared at this point, but we aren’t pussies and we don’t leave teammates to die. No choice but to move in. However, We never made it to the cabin. </p>\n\n<p>It was almost human. Not quite though. It was small too. It looked like a teenaged human male with no hair what so ever and had an off white skin tone. It was pouring blood from what could have been hundreds of holes. Bullet holes, and while it looked human it moved more like a monkey. On its fists and feet in a galloping motion. I’ll be honest, we froze, we had been through a lot together and i trusted these men and woman with my life. But we froze. We weren’t prepared for any of this.</p>\n\n<p>It only looked to be 100 pounds or so but with the amount of damage that it had sustained it shouldn’t be able to move. But move it did. It jumped to our commander and with relative ease ripped her throat out before she could scream. She was dead. I couldn’t move and suddenly found myself on my knees. </p>\n\n<p>Everything was quiet for a moment. This is in no way supposed to sound cheesy or make you feel sorry for me. But it is a detail that is important because it is likely the only reason i am still alive today. Me and the commander were not just teammates. I am not going to go into the details of how deeply we were connected because that is personal territory. However i will say that earlier that week she told me something that lead me to begin looking at good school zones in our area. I didn’t want her on this mission. But she wouldn’t take no for an answer. We were already a member short and as commander she had authority do do whatever the fuck she wanted. </p>\n\n<p>Stubborn asshole. You shouldn’t be dead. Neither of you.</p>\n\n<p>I was still staring at the pieces of her when i was snapped back to reality by a shotgun blast. And the sudden feeling of a small humanoid flying into me. It wasn’t attacking though. It had been thrown through the air by the blast of the shotgun that was loaded with buck shot. It had been hit at point blank range too. Left a massive hole in the center of its chest. </p>\n\n<p>When i actually felt the thing touch me was when i completely snapped. It was still getting back on its feet when i got to the demo specialist’s body. He was the one who had fired the shotgun but was missing both legs and large chunks of his torso and had bled out seconds after firing the shot. </p>\n\n<p>As i turned around with a grenade in my hand the little fucker was already flying through the air at me. I put all of my pure anger and hate into one punch. My hand went straight into the hole that had been created by the earlier shotgun blast. I could feel it’s warm bloody insides, and even a few bullets that were lodged into the bones that were now cutting my skin. Fist still in its chest i slammed the creature into the ground and ripped my hand out of its chest before it had the chance to rip off my entire arm. Then i ran.</p>\n\n<p>You see among all of the blood and flesh that was in my hand, there was something else. A pin. I had to survive 5 seconds. I can hear the thing starting to get up. 4 seconds. I’m sprinting as fast as i can but i can hear the crunching of leaves behind me. 3 seconds. I trip over a log that i couldn’t see thanks to the setting sun. 2 seconds. I stand up and turn just in time to see the creature jump towards me for the second time.\n1 second. I throw a wild left hook that sends the creature tumbling to my right and drop to my stomach on the ground covering my head with my hands. BOOM! </p>\n\n<p>The thing is gone. </p>\n\n<p>I stand up after a few seconds and realize i have pieces of grenade shrapnel lodged in various body parts. But nothing vital. The sun is almost set by now but i can hear an evac heli coming in my direction. We didn’t have time to call for evac, but i didn’t realize this at the time. Before i made my way to the clearing that we had agreed on evacuating from if worst comes to worst, i noticed that a piece of the creature’s face was in front of me. I limped over, and stomped on its still twitching eye. Then made my way to the clearing. </p>\n\n<p>The chopper that landed was not an evac chopper. It was a black hawk helicopter with no identifying markings. As it landed four men jumped out and approached me. They were all wearing some kind of black armor and caught me as i began to fall to the ground. They then carried me to the helicopter. As they pulled me in i heard one of the men already sitting inside say, “i can’t believe he actually fucking did that, you guys sure he isn’t a tangible?” Then i passed out.</p>\n\n<p>A few days later i wake up in a hospital bed in a room with no windows. Minutes later i am approached by an older man. He informs me that we are within an organization that takes care of problems that other organizations can’t, and that i managed to kill a beast that had been deemed a level 49. (I later learned that levels meant the estimated amount of unarmed adult men it would take to defeat or kill the monster.) He then informed me that they were interested in recruiting me. I attempted to ask him if any of my teammates had survived but i couldn’t speak. The man saw me struggling to talk and explained that when they found me in the clearing i was yelling my head off and i hadn’t stopped until i passed out. Apparently my vocal chords were pretty damaged from the stress. I don’t even remember yelling.</p>\n\n<p>But i didn’t really need to ask the question anyway. Deep down i knew the answer. And the answer left me broken and emotionless. \nI grabbed some paper charts that were on the nightstand next to me and snatched the pen that was in the man’s front pocket. He didn’t flinch. I write a simple question on the paper and present it to the man. “Do you kill those fucking things?”. He read it, and then nodded to me saying. “We sure do kill those fuckers, and anything else that we deem a creature of chaos”.</p>\n\n<p>I finally managed to wheeze our two words.\n“I’m in”.</p>\n\n<p>I’ve been with the organization ever since working my way up. I’ve never looked back and i don’t plan to. The day i look back on my past and begin to miss it is the day i retire from this job. But I’m not nearly done yet. Just like last time feel free to leave your questions in the comments and I’ll see y’all next time.</p>\n\n<p><a href=\"https://www.reddit.com/r/nosleep/comments/8js57c/i_the_hunter/\">Part one</a></p>\n</div>\n","author":"LiquidGoatMan"}