{"rank":"19","title":"What I found wandering around the halls of The Medical Center- Part Two","id":"8kedg1","url":"/r/nosleep/comments/8kedg1/what_i_found_wandering_around_the_halls_of_the/","time":"1526660045000","body":"<div class=\"md\"><p><a href=\"https://www.reddit.com/r/nosleep/comments/8jyvia/what_i_found_wandering_around_the_halls_of_the/\">Part One</a> </p>\n\n<p>I spent the whole day paranoid someone was going to come and smother me with a pillow, but nothing happened. Nurses came in at their typical times and checked vitals. I was given platelets for my low count and iron for good measure. </p>\n\n<p>I was still hooked up to the iron, which usually took about 8 hours to complete, when my friend Will came by in the afternoon. He always tried to visit me when I was in the hospital because he knew how lonely I would get. “You look like shit” he stated plainly. </p>\n\n<p>“Gee, thanks” I teased back. We chatted about the day but he could tell something was off and asked me about it. I looked around the room and said, “Let’s go for a walk”. </p>\n\n<p>Will and I headed outside to the quiet areas of the hospital campus. I pulled the IV pump pole with iron still filling my veins along the concrete path. Passing by a pink blooming tree, I whispered that I had found something. Will looked at me incredulously and queried me further. “I found a door I haven’t seen before and at first it was locked, but I couldn’t stop wondering what was behind it. Then last night I tried it again and it opened.” I described the stark white room with the white desk and white computer. </p>\n\n<p>Then I told him about logging into the computer and seeing what was on it. By the time I finished he had a huge smile on his face. “You got me! That was a great spooky story, Jess.” I shook my head in frustration. “It’s not a joke, Will. I think I might be in danger now.” He looked at me with his head tilted. I handed him the note I received in my breakfast. As he read it his eyes got wider. “Jess, this is serious. If someone..<em>shit</em>.. if a DOCTOR knows you’ve seen something like this.. “ He trailed off. </p>\n\n<p>I knew the implications. We sat in silence for what seemed like eternity before Will spoke again. “You have to get out of here. Can you be discharged into someone’s care?” I slowly shook my head as tears welled in my eyes. </p>\n\n<p>I told him that my platelet count was still too low and I was told it would be at least 2 days before they would feel comfortable releasing me. “I’m staying here tonight. I can’t leave you to deal with this on your own.” He said shakily. </p>\n\n<p>I tried to protest but Will wouldn’t take no for an answer. I notified the staff of my sleepover guest asked a nurse if they could bring a roll away or another hospital bed in the room. She looked at me mischievously said she would look for something. She patted my arm and walked away with a wink. </p>\n\n<p>Will and I looked at each other with knowing smiles. Everyone always assumed we were together, and we used to be. We actually met on a dating website and went on a few bland dates before we figured out we would work better as friends. There was just no passion between us. </p>\n\n<p>We headed down to the hospital cafeteria for dinner while we waiting to see what Will was going to make his bed for the evening. </p>\n\n<p>“Wait. If there are cameras in every room, what is stopping this doctor, or maybe even <em>DOCTORS</em> from just coming in here and snuffing us both out?” I whispered probably louder than I wanted to. Will explained to me that the video I saw was of an old man, who seemed on the brink of death as it was. Him suddenly passing was probably not investigated. However, a 32 year old woman who was improving from a non-serious injury would have no reason to just up and die. And her friend that was watching over her was perfectly healthy and if he died it would be even more suspicious. </p>\n\n<p>“We’re dealing with doctors here. They might be murderers but they are smart.” Will proclaimed. I signed loudly and crunched on my chicken salad getting lost in thought while Will ate his cafeteria pizza and cheeseburger with a side of chili cheese fries. We sat in silence for a bit, resolute to our situation, and then I saw him. The black hair a stark contrast to the white jacket, the clean unshaven face, his seemingly kind smile that had a bit too much height in the corners. It was the doctor from the video. </p>\n\n<p>My fork fell from my hand and clattered to the table which alerted Will to something going on. He looked at me and then the direction I was staring at. Bouncing back and forth between my eyes and the direction of the doctor, Will confused finally asked what was going on. I heard only muffles. His fingers snapping inches from my face finally woke me from my haze. I looked down at the table debating whether or not to tell Will I saw the murder doctor. </p>\n\n<p>I glanced back up to see if he was still in the room and saw him looking straight at me. I yelped unintentionally, jumped in my chair and scooted back from the table slightly. Will looked at the doctor who was still staring at me and it registered that this was the man I saw in the video. He looked angry and went to stand up. I grabbed his arm and shook my head. This was not the time or place. </p>\n\n<p>The doctor looked at me and placed a finger to his lips, the same way he did in the video and walked out. I felt my bladder attempt to release and I clenched to keep from embarrassing myself.  Once he was out of sight Will turned to me looking pale and sweating slightly. I instantly felt horrible and tried in vain to get him to leave while he still could, but he remained firm. It was if seeing the murder doctor made him even more unyielding in his decision to protect me. </p>\n\n<p>We spoke in hushed voices as we made our way back to my room. We were coming up with plans of action in case the murder doctor came back when I realized where we were. I stopped suddenly while Will kept walking for a few paces. When he noticed that I was no longer beside him, he stopped and turned to face me. With wide eyes I told him to look to his right. He did so and looked back at me quizzingly. I scrunched my face and scuttled over to him to point out the door. When I reached it I noticed the sign had changed. </p>\n\n<p>‘Maintenance’ the sign proudly displayed. I reeled in disbelief. Will placed his hands on my shoulders and brought me closer to him. I began to shake and tears fell from my eyes without permission. I knew then whatever I had gotten myself involved in was much more elaborate than I had hoped. </p>\n\n<p>We made our way back to my room a bit more quickly and shut the door. Will facing the window mouthed to me, “Where would the camera be?” I racked my brain for the position of the camera and remembered it was slightly from above and around the door. I relayed to Will what I remembered and we began to nonchalantly search for a possible hiding spot. </p>\n\n<p>The only one we could agree on was the vent directly to the right of the door.  Will being much taller than me grabbed a blanket and hung it from the corners of the vent. He then placed a chair against the handle so no one could enter the room without being let in. </p>\n\n<p>Perched on the bed together we whispered about possible scenarios for a while before the day began to catch up with me. I told Will he could go to sleep in the cot the nurses had found and drug in my room. He looked at me and said, “Let’s watch some TV first and then we can pass out. I know it will help relax you.” I nodded in agreement and we let the sounds of QVC drone on about different jewelry they were pawning today and I fell into Will’s arms as we lay down and drifted off. </p>\n</div>\n","author":"impressed_jess"}