{"rank":"10","title":"Larry","id":"8kefad","url":"/r/nosleep/comments/8kefad/larry/","time":"1526660437000","body":"<div class=\"md\"><p>A guy like me would take any job that comes by, who am I to choose? I did one of the things that is most ungracious in these parts of the world, I dropped out of college, may be you do not know how they see it here. We finish school, start college, finish college, get job, get married, buy house, and have kids, and if you are lucky, you go abroad. Not me, to my parents, I am disgrace. I can see the way they look at me when I leave my house.</p>\n\n<p>“You always do this!” My mother yells when she comes home. </p>\n\n<p>“Today Rubilyn, she says at super market, ‘My son is going to the US to study, what your son is doing?” How I tell her, my son is sitting with goldfish in the house? How I tell her my son sit at home and will not go to college or study no matter how hard his father and I work to make money to give him better life? How I…” her outburst faded into a sob.</p>\n\n<p>“Ma, I told you. I wanted to study marine biology but you guys just want me to do some shitty computer science and I don’t wanna do that” I replied, as I always had, without looking up from my phone</p>\n\n<p>Mother shot me a look, dejected and enraged, all in one moment, and said </p>\n\n<p>“We are not paying you to study and talk to fish. You go out of house and do what you want.”</p>\n\n<p>I had never paid heed to her, the countless times the same conversation had happened in our house before from when I dropped out of college six months ago. Something changed that day, in her voice, in my head, in the air that dropped heavy around the room and in the silence that followed after. I dropped my phone and left the house. I ran away.</p>\n\n<p>It took a few days, I worked odd jobs in super market. Mother looked at me one day and left without buying. I didn’t fall asleep at night, I decided to walk long way by beach to facility. I crossed aquarium. It used to be my heaven. When I was three, my parents bring me here, and then every birthday I ever had was here, and every time I felt lonely, I went in to talk to all the fish. I missed my gold fish too, I left him at home, may be, he died, too. </p>\n\n<p>Bad thoughts told me to go to ocean and join fish, but I knew I could do better one day. When I walked by the ocean, one flier around caught my eye. They wanted someone to for feeding fish. I knew I had to join, I had to. I was friendly with some staff and they helped me get an online copy of high-school graduation certificate and I applied.</p>\n\n<p>I attended their interview. They asked if I am willing to work night and if I am okay with signing agreement to not talk about what I see there. I agreed. </p>\n\n<p>Day one of when I joined, I realized it was not for the aquarium, but for the research facility attached to the aquarium. There were six researchers – two old men, one old woman, two middle-aged men and one young woman. I was told I had to work with only one, Mr. Iman. He was a middle-aged man, who wore frameless spectacles and reminded me of father. He told me he was happy to have some helper around. He worked with Octopuses and squids. I didn’t like them as much as I liked fish.</p>\n\n<p>There was Larry the mimic octopus, isha the blue-ringed octopus, sally the loligo squid, Riza the giant squid and cutie the common cuttlefish. I was happy like eight year old boy who got first bicycle. </p>\n\n<p>I was told what to feed them on daily basis and what each ones favourite foods are, in case they don’t behave. I will help to move them from tank to another for tank cleaning and whatever else the professor wanted. Usually he asked me to get coffee from aquarium shop or help to organize papers by date. I made good money, much higher than super market and much higher than any other cleaning job. But it is, seven days a week. Stay is also there, in case professor or animal needs help at night. </p>\n\n<p>It was strange but doable. I am getting cut off from the outside world now, but the animals are my friends now. My favorite was Larry and second was sally. Cutie was cute but he didn’t do much. </p>\n\n<p>Larry and I played every day. He was like my water puppy and he would always change his color when he sees me to show how happy he was to see me. Many days, I spend talking to Larry and I got to sneak him their favorite foods sometimes too. I studied Dr. Imam’s papers to pass time when he is not here. He writes about how intelligent the cephalopods are – that’s what they call these animals. It describes various tests and test results. \nLarry aced all of them, ALL. He could do better than me in school if he tried, I thought with a laughter. </p>\n\n<p>Dr. Imam took care of me like father even when I became sick one day and had to stay back and not do the work. I missed Larry when I became sick. Mother too. I opened up to him to tell about why I dropped out college and he told me he could help. I studied with him and he helped me get my bachelors in marine biology in 2 years in correspondence with one university where he was friends with professor. I became more and more involved in his research, even conducting little studies for Dr. Imam and doing his research and would study in spare time. It was the best life I could have. </p>\n\n<p>Then, suddenly for one week, Dr. Imam went to America to meet with some people for research funding. I was told to stay back and take care of the animals, but Dr. Imam took Larry. I was happy to take care of them, they are all nice creatures but without Larry, it seemed like every day was passing too slowly, like jilted lover, I waited for Larry to return.</p>\n\n<p>When Dr. Imam and Larry came back, I ran to them like sick puppy, but Larry had a huge bump on the side of his head. I asked Dr. Imam about it, but he told me not to worry, but Larry had changed. Every time I went to feed him, he didn’t change color. He was moved to a different tank, one in a separate room. He stopped eating his favourite food, and he started growing much larger in size, I asked about him to Dr. Imam and he said it is part of a research and to not bother him. I tried to see Dr. Imam’s test papers but he had kept all papers hidden and locked. Many foreign professors came to see Larry every now and then.</p>\n\n<p>He was becoming larger than the separate tank and so they got one tank which was used for whale and put Larry in the new tank. \nI was helping to move the now bigger Larry when he squeezed my hand and his eyes turned bright red. My arm hurt and I couldn’t move it and he held on till Dr. Imam gave him sedative. Dr. Imam told me Larry was reacting to some of the tests and he was becoming a true monster now. I was both distressed and curious by this word from Dr. Imam.</p>\n\n<p>We moved Larry to the new tank which was in center of a room where all researchers will come to see him. Larry would shoot poison ink at them and swim to corner of his tank and hide. At night, when all is asleep, Larry would try to escape the cage by hitting the glass. Thud thud thud, it got louder and louder every day. </p>\n\n<p>He would ram in to glass every time I go to feed him. Twice when I was on top of tank and removed cover, he tried to pull me into the tank, once he succeeded. He held me for a few seconds before Dr. Imam saw and came to rescue. I had to be taken to hospital and took two days to recover. Now I was scared of Larry.</p>\n\n<p>One night, when I was asleep, I awoke to ground shaking sound. I instinctively knew it was Larry, and ran to the room where he was kept. As soon as I reached the door, I heard </p>\n\n<p>Dr. Imam, “He’s not supposed to be this big, this is unprecedented”</p>\n\n<p>Another voice, who I recognized as one of the foreigner professor, “This is why I didn’t want to do it in your country, because I can’t trust the results. We’re removing the funding and moving him to California.” </p>\n\n<p>I heard another huge thud and I can swear, the building shook. \nI peeked into the small gap in the door to see the two men standing. “I did not spend so many hours giving this octopus these drugs to see you take my research to America without me” Dr. Imam ran at the foreigner professor. Before he could take two steps the foreigner professor shot him in head and again in his chest within seconds. I must have screamed because he now turned towards door</p>\n\n<p>“If it isn’t the little cleaner boy? If no one’s gonna miss the professor, no one will miss you.” He pointed the gun at me and I closed my eyes. I heard a loud bang, a sharp pain in my hand and soon, I felt wet beneath my feet. I knew I was shot, I thought this was me dying and blood was flowing beneath my feet. </p>\n\n<p>When I opened my eyes, I saw Larry, giant now, the size of whale, broken out of his cage and holding the foreigner professor over his head with one of his tentacles. I ran and jumped forward and grabbed the fallen gun and pointed it at Larry, tears streaming down my face in confusion. Larry grabbed me with another tentacle and squeezed me, forcing to drop the gun. </p>\n\n<p>“Now we’re both going to die because you can’t shoot the f***** monster when you see it” the foreigner professor screamed at me, his eyes throwing death threats, fully ready to kill me, if he could move. </p>\n\n<p>Larry seemed to notice it and banged the professors bald head against the lamps in the ceiling repeatedly until there was not much left but blood and flesh. My body shook and I vomited, thinking I would too die the same way. I wished I studied computers. Computers can’t kill you like this. I wished I listed to mom. I apologized to my mother and father in mind and closed my eyes ready for my fate, as Larry was moving his tentacle down. </p>\n\n<p>When I opened them again, Larry had placed me on the floor. He was quick to move across the floor and straight squeezed through the door. He changed color one last time, his eyes no longer red. He broke the tanks of all his friends in lab.</p>\n\n<p>I was rescued and next day was at hospital. They couldn&#39;t find Larry or other animals. I don’t know what happened was real. Dr. Imam and foreigner professor was dead, they said. They also said monster octopus escaped, but I wonder, in all this, who is the monster?</p>\n</div>\n","author":"Distant_claws"}