{"rank":"28","title":"My creepy neighbor","id":"8keh4b","url":"/r/nosleep/comments/8keh4b/my_creepy_neighbor/","time":"1526660859000","body":"<div class=\"md\"><p>So I’m 16 and live in a quiet neighborhood in a small town in Mississippi with my mom my dad and my older sister.Everyone on my street just keeps to them self’s and occasionally waves hello or just small talks. Everyone except for my neighbor Rob. Rob is average height and has short hair blond hair thats starting to recede. Now that my backstory is over let’s get to the main reason why I’m telling you this.</p>\n\n<p>I walk home from school because it’s just around the corner. About a week ago I felt like I was being watched and I did a scan of my surroundings as I saw something move from Robs window. I got a little pissed of as I normally do when I’m under stress or nervous about something. Well I just walked inside my house and decided to play some games as I passed it off as nothing. As I grabbed my controller I heard a knock at my window and I jumped out of my chair and lifted the blinds to see Rob standing there. I didn’t do anything stupid like opening the window just yelled “Rob what in the fuck are you doing in my yard. Your lucky my dogs aren’t out there to eat your ass up” what he said horrified me. Rob smiled and said “well your front door was locked and your back door so I decided to know at your window to give you your mail” I said nothing as I though why would he try to get into my house to give me my mail or even touch our mail in the first place. I told him to put our mail back into our mailbox and go home. He stood there with a blank emotionless face for about a minute it seemed and then turned and walked to my mailbox and put our mail back because I made sure I watched him through our front window.</p>\n\n<p>That night my dad told me when I go to sleep let the dogs in. I like to leave my dogs outside late because I feel bad that they are cooped up in our house when we are all at gone. My 3 dog then just started to bark savagely and I did get a little startled. I walked outside to be greeted by total darkness I yelled for my dogs as they just ignored me and kept barking I switched on the light and with a strict voice told them to come in and they did. This spooked the shit out of me so I left my headset off this time and just played my games with no audio. I then heard a small sound almost like wood being tapped on.I went outside and switch the lights on in one quick motion to see Rob with one leg over my fence like he was jumping my fence. I almost shit my pants as I ran inside and locked the door. I told my dad and he went and checked and found nobody. It pissed me off because he thought I was lying.</p>\n\n<p>Later that night around 1 in the morning I grabbed my phone because something  woke me up. Then I heard tapping at my window. I got so scared I put my head under my pillow and ignored it but my fear was so bad that I could still hear the echoing sound of this tapping through my whole room. I peaked through one of my blinds to see Rob staring through the window and into my soul. He smiled with a demonic grin and said softly but loud enough for me to hear. Open the window so I can give you your mail. I said I’m calling the cops and he got pissed and started to bang at my window saying “please I just want to give you your mail.Just open the window please and be a good friend.” I dialed 911 and The 911 operator told me to grab a heavy item or weapon and wake up my family and do anything necessary to protect me and my family. The cops got to our house and after that the banging stoped and I’m assuming he tried to run as the cops found him jumping the fence to his yard. He was found with a small revolver and a kitchen knife on him. They charged him with attempting to breaking into our house and planning to murder us.He pled guilty to all of these and will be in prison for a long time. I’m just glad that I woke up because if I didn’t I’m sure me and my family could have lost our lives that night.</p>\n</div>\n","author":"SewerStain"}