{"rank":"17","title":"Wine Mom","id":"8keixw","url":"/r/nosleep/comments/8keixw/wine_mom/","time":"1526661260000","body":"<div class=\"md\"><p>My step-mom is a monster. </p>\n\n<p>My mom died in a car accident when I was 6. She hit a patch of black ice and her car vaulted off a bridge, she died on impact. I was too young back then to understand what death really meant but I knew that my dad was sad all the time so I did what I could. I told him I loved him as much as often and tried to always make him smile and proud of me. </p>\n\n<p>Shortly after I turned 10 my dad started to date again. He’s not a very romantic man though so his relationships never lasted very long. That was until he met her. Helen was her name, she was loud, over the top, and caddy. Basically everything my mom was not. Honestly I have no idea what my dad saw in her, but she made him happy so I figured there had to be something. When I was 14 my dad and Helen got married. I didn’t want him to but he was in love so there was no getting through to him. I figured I’d be going away in a few years to college so I could suck it up. </p>\n\n<p>My dad loved Helen, and I at least used to think she loved him back, but I knew from the beginning that there was something she loved above all else. Helen loved her wine. I don’t know if in the seven years that she’s been in my life I’ve ever seen her without a glass in her hand. She doesn’t work or anything, just stays at home all day drinking with her friends. Apparently she has arthritis in her back so she’s on disability and has enough money from her family to keep her habits, without straining my dad financially.</p>\n\n<p>She even had her own little “wine club” with some of the women from the neighborhood. They converted our basement into a massive wine cellar stocked with all her favorites. I could hear her and her friends chatting it up and gossiping late into the night. They’d usually all stumble upstairs around 1 or 2 and head back to their own husbands.</p>\n\n<p>After that is when me and my friends would sneak down there. There was more than enough wine to kill an entire village. Helen wasn’t going to notice a bottle or two go missing, and even if she did she didn’t have proof it was me. We’d get shitfaced and once we saw the morning light begin to crack through the lone window, we’d hurriedly move back to bed.</p>\n\n<p>Overall things could’ve been worse. Me and Helen mostly ignored each other and only really communicated through my dad, but it worked. As time went on though my Dad started to act kind of strange. He’d come home from work and immediately collapse into bed exhausted. He also started losing weight at an alarming rate. When I’d bring this up to him he’d just brush it off saying that the stress from works been getting to him lately and he guesses he hasn’t been eating much because of it. I wasn’t one to push him so I kind of just accepted this answer but made sure to keep an eye on him. I don’t know what I’d do if something happened to him. </p>\n\n<p>Helen, on the other hand, was as lively as ever. She was always up and around having her little parties in the cellar with everyone in her little “club”. As weird as it was for her to have that much energy at all times what was far weirder was what she kept in the cellar. In the back corner of the cellar was a large heavy trunk. It was one of those massive ornate ones you’d have seen on a ship in the 1800’s. During the countless times me and my friends were down there we’d never seen it unlocked. We’d spend hours theorizing what could possibly be inside of it. Her gold and jewels? Her previous husbands body? Anything was a possibility. </p>\n\n<p>About a week before I left for college me and a few of my friends decided we had to find out. We had spent years staring at it in the wee hours of the morning, it was time to see who was actually right. I ordered a lock picking kit off of amazon and with only a few days left of my time at home went to work. I snuck down after the wine club had finished their nightly meeting and took the lock in my hand. The lock was ancient and heavy but not very sturdy I discovered. After about a half an hour of fumbling around with it, it popped off and fell to the ground with a loud thud. I froze, afraid that either my dad or Helen had heard the lock hit the ground, luckily nobody seemed to be awake at that time of night. Slowly I creaked open the trunk, expecting the worse. </p>\n\n<p>Instead it was just more bottles of wine. Weird old dusty bottles of wine with no labels on them, but bottles of wine nonetheless.I picked up a bottle to try and inspect it further when I heard an all to familiar voice come from behind me.</p>\n\n<p>“Well what do we have hear…” I heard a voice say from behind me.</p>\n\n<p>Startled I immediately dropped the bottle in my hands and it shattered on the ground below, its dark red contents spilling everywhere. I slowly turned awaiting the worst to find Helen only a few inches away from my face. I immediately jumped back out of  fear, I have no idea how she made it to the cellar without a sound in the first place, let alone got that close without me knowing. </p>\n\n<p>“I should’ve expected you would get too curious for your own good eventually” Helen said in an almost sadistic tone. </p>\n\n<p>She lunged at me and grabbed my arms pinning them to my side with an unexpected speed and strength. Try as I might I couldn’t break from her grasp.</p>\n\n<p>“No, Helen, I promise it’s not what it looks like, I was just, I was just…” I sputtered out.</p>\n\n<p>“You were just what? Looking for something you shouldn’t be looking for. And look you even shattered one of my bottles. What are the girls going to say now.” She said staring down at the shattered bottle on the ground. “I guess you’ll have to help me replace it now, won’t you” she said as she stared deep into my eyes.</p>\n\n<p>“Yeah… yeah of course whatever it takes I’ll help gladly” I muttered hoping to get out of this situation. “How much does it cost?” I asked.</p>\n\n<p>Helen smiled and I suddenly felt a crack on the side of my head and everything went dark. When I came to I was hanging upside down in the cellar. My arms were in immense pain and upon closer inspection it appeared that I had several cuts on both my biceps. I could feel the sticky warm blood trailing down my hands and falling to the ground, but instead of hitting the cement floor, it sounded like it was hitting water. Looking down I could see a small basin that seemed to be collecting the blood that was pouring from my arms. </p>\n\n<p>“What the.. What the fuck” I said quietly, feeling light head from the loss of blood.</p>\n\n<p>“Hehehehe” I heard a voice say from the darkness as I saw Helen slowly walk out. “You’ve turned out to be quite the helpful son after all” She said as she got closer.</p>\n\n<p>I tried to struggle to keep away from her but there wasn’t anywhere I could really go. She got closer and leaned down to face me with a smile. Slowly I saw her tongue leave her mouth and lick her lips. Terrified I closed my eyes expecting the worse and felt pain surge through my body as I felt Helen’s tongue dive deep into the wounds on my arms. Unable to cope with what was happening I felt myself pass out again.</p>\n\n<p>I awoke the following morning in my with a pounding in my head. I immediately looked over my whole body but all I could find was a few light scratches on my arms, far from the deep cuts I remember from last night, and my lock pick still where I previously left it on my desk.  Wandering downstairs I found my dad and Helen at the dinner table, wine glass in hand. She shot me a toothy smile which shook me to the core right there. I don’t know what happened last night but I know I don’t want to be around Helen anymore. </p>\n\n<p>I did my absolute best to avoid her for the rest of the day as I finished packing my stuff. I went downstairs and said my goodbyes to my dad, he was looking as sick and thin as ever but I knew he wasn’t going to listen to anything I said. My college wasn’t very far from home, only a few hours, but I didn’t plan on returning anytime soon unless Dad needed me to. </p>\n\n<p>I kept in contact with my dad throughout the school year just to make sure he was alright. He always said he was okay and that it was just the stress from work getting to him after all these years. </p>\n\n<p>That brings us to yesterday when I received a strange package in the mail, only a few days from me returning home for the summer. I’ve managed to avoid any and all contact with Helen since that night, so when I saw her name on the box my blood ran cold. Carefully I opened the box to discover a old bottle of wine. The liquid was thick, thicker than any wine I’ve ever seen before in my life. There was no label on it, but it did have a tag with a message on it.</p>\n\n<p>“Thank you so much for all your help last summer Brian. Your father hasn’t been feeling well, so I was wondering if you’d like to help me again once you get home. I’m sure the girls from the club would appreciate it.  Your’s Truly, Helen”.</p>\n</div>\n","author":"Yuebeo"}