{"rank":"209","title":"I found my dead son after 12 years.","id":"8kej8f","url":"/r/nosleep/comments/8kej8f/i_found_my_dead_son_after_12_years/","time":"1526661334000","body":"<div class=\"md\"><p>Let me preface this by saying, I&#39;ve never had any mental health issues. Dealing with a tragedy, I was more rational than my husband. I kept the family together and pushed through. I&#39;ve held it together until now.</p>\n\n<p>13 years ago, I was pregnant with identical twin boys. My husband, Ryan, and four year old daughter, Kate, were ecstatic. We painted the nursery a shade of light yellow, and Kate chose all the bedding for the boys&#39; cribs. Unfortunately, there was a complication during birth. I went into labor at 28.5 weeks. Connor made it, Nicholas didn&#39;t. It wasn&#39;t instant. The doctors discharged Connor and I from the hospital, and we went home for a change of clothes and a quick nap before I went back to see Nicholas. When I got to the NICU, I was met with some grim looks. Nicholas didn&#39;t make it. In those few hours we were at home, my beautiful twin boy left us. No one grieved more than Kate. She didn&#39;t fully understand, and Ryan&#39;s outbursts of random sobs didn&#39;t help stabilize things at home. We got rid of the doubles we had for them, and began to focus solely on Connor. The doctors advised us not to look at Nicholas&#39;s body, as we should remember him how he was before he got sick and passed away. At the time, it seemed it was the right thing to do. Now it&#39;s my biggest regret. </p>\n\n<p>A few weeks ago, my now 16 year old Kate came to me with a weirded out look on her face. On her way back from school, she had seen Connor walking down the street. She pulled over and asked if he needed a ride home, because he wasn&#39;t supposed to be this far from home. She said he looked at her like he&#39;d never seen her before and jogged away from the car. Kate came home to find Connor already home. She yelled at him for playing tricks on her and freaking her out. He had no idea what she was talking about.</p>\n\n<p>I didn&#39;t believe her, until today. Ryan took Connor on his boy scout retreat for the weekend, which meant he was taken out of school for today. I told Kate I would drive her today. The street to Kate&#39;s school is fairly empty, surrounded by farmland on either side. We live in a rural area, but she goes to school in a neighboring town. Along that road, we saw Connor. I stopped the car this time to ask what he was doing and where was dad. Connor started jogging, so I pursued him. I started shouting out the window saying he was in trouble if he didn&#39;t stop. He took off into the farmland, and I got out of the car and ran after him. I found him sitting at the end of the field. He was supposed to be with Ryan in a different state!</p>\n\n<p>&quot;Connor, what the hell are you doing?&quot; I remember yelling at him, half confused half worried. He looked up at me.</p>\n\n<p>&quot;You&#39;ve got to stop following me or I&#39;m calling the police. I&#39;m not Connor, just leave me alone!&quot; My heart hit the floor when I realized this little boy was not my Connor. But he was identical to him in every aspect. That&#39;s when I started connecting the dots. I asked him his name. The boy refused to say. So I took him. I had to! He&#39;s my Nicholas, I know he is. </p>\n\n<p>Kate looked bewildered as I carried the 5&#39;1&quot; boy over my shoulder and into the car. She asked what I was doing. I told her this was Nicholas, and the doctors had mistaken him all those years for someone else&#39;s baby boy. Nicholas cried the whole car ride, asking for his parents. Whatever strangers had raised him had done a good job convincing him he was theirs. I assured him he was finally going to his real home.  </p>\n\n<p>Right now, he&#39;s sitting on the living room sofa eating a sandwich. He&#39;s stopped crying, and seems to have relaxed a bit. A million thoughts are flooding my head. Why the hell would a doctor lie to my face? I have a death certificate for God&#39;s sake! I have no idea how Ryan&#39;s going to react, I&#39;m just so relieved my Nicholas is home. But I can&#39;t stop wondering, who did we bury?</p>\n</div>\n","author":"colleen_40"}