{"rank":"8","title":"In the Line of Duty","id":"8kemm4","url":"/r/nosleep/comments/8kemm4/in_the_line_of_duty/","time":"1526662097000","body":"<div class=\"md\"><p>When you serve 19 years in the Philadelphia Police Department, you think you’d seen it all. Before the night that messed up my whole life, there was nothing that scared me. These are some of the meanest streets in the world; rape, murder, violence, theft, death… it’s all just part of the job. I’ve taken the life of many; sometimes what stands between the streets and justice is my 9MM, like I said, it’s part of the job I signed up for. Between serving in the Marine Corps for 8 years and being a police officer for the rest of my life in Philly, I’d like to think that I was a pretty hardened guy. Conflict didn’t scare me, and I sure wasn’t afraid of responding to any calls. I’ve had all the training and experience in the world, and I can assure you nothing could have prepared me for my last night in the line of duty.</p>\n\n<p>November 4th, three nights ago started out like any other day on the job. I ran the patrol in Charlie unit from 6PM to 2AM, Tuesday through Saturday. It was a cold and rainy night in East Philly, so I didn’t expect too much to happen that night. My long time partner, Ferris, was on medical leave for the past few weeks after getting hurt breaking up a domestic dispute, so I had been assigned a 19 year old boot we called Tex. Although the kid was just 19, Tex had earned the respect out of almost everyone in the unit, including myself. He was a young and ambitious stud, and I’d seen him put men twice his size through walls and doors. He wasn’t a small guy either; Tex stood at 6 foot 3, and weighed about 200 pounds. Normally, we wouldn’t let a kid at 19 into our unit,yet alone the department, but he was a special kid. Tex had only been out of the academy for four months at this point, so he had been assigned to the most veteran member of the unit, me. “Carson, what’s up man” he greeted me. “Hey Tex, let’s grab some chow and head out” I said before we went out on patrol that night. </p>\n\n<p>The night had mostly been quiet as I had expected. When the weather starts to get cold, not a lot of people are seen hanging out on the streets, and people mostly keep to themselves; mostly that is. It was around 7PM when we received our first call of the night. </p>\n\n<p>“Charlie 14 this is base, domestic disturbance 5 minutes out from your location on 9th and West Ave. , all other units are at least 15 away, please respond” </p>\n\n<p>“This is Charlie 14, good copy”</p>\n\n<p>We turned on the sirens and drove to the location. Tex was still learning, so I told him to take trail and look around back. I yelled “Police, open up!” but nobody came to the door. I radioed to Tex that there was no answer. “Carson this is Tex, your signal is fuzzy, can you say again?” When you work in a department like Philidelphia, you don’t always get the best equipment, and on a rainy night like tonight our communications were destined to be out of sync. However, this is what we train for; you hope for the best and prepare for the worst. I went around back and told Tex that if they didn’t open up again, we would bust in. Tex nodded, and I went back and knocked again. I could hear screaming inside the residence, and what sounded like drunk slurring. </p>\n\n<p>“Are ya cheating on me again ya damn hoe! I’ll kill you if you are!”</p>\n\n<p>“Jeff stop you’re hurting mom!” “Get off her Jeff!”</p>\n\n<p>There was also a dog barking, great. Not only did I have to take down this asshole, but chances were I was going to have to take out a dog in front of kids. I didn’t love this part of the job, but it’s part of what I signed up for, and it wouldn’t keep me awake at night. I didn’t have any more patience for the scumbag, and put my foot where boot meets wood and knocked the door in. Tex must have seen me through the back, and came in through the sliding glass door in the back. I yelled “Philadelphia Police! Get your fuckin hands away from her and put em where I can see em” To my surprise, the dog was a labrador retriever, and took off upstairs when I entered the residence. </p>\n\n<p>We separated the man and his wife, as well as the three kids at home. Tex had gone up with the kids to get them away from the situation. The youngest one was in his room, playing Xbox or something, and the dog had gone and went with him. There were also two daughters, who looked to be around seven and ten years old. From the inside of the home, everything appeared to be fine. That’s what sucked most about domestic distrubances; everything seems normal for a moment, and the next, there&#39;s a severe injury, maybe even a dead body laying on the floor at the hands of the abuser. </p>\n\n<p>The woman who I assumed was his wife was pleading for me not to arrest him. “Please don’t take him away! He didn’t mean it, it’s my fault! I shouldn’t have provoked him this much. I’m not hurt, it happens all the time, I’m sorry i’ll try and be better.” I sighed. I don’t love every decision I make on the job, but I nodded and said just give us a call if anything happens again. I yelled to Tex that we were out and continuing patrol, and we left without arresting the man in the house. </p>\n\n<p>Tex looked at me puzzled. “Carson, why aren’t we transporting that asshole; we should have slapped the cuffs on him when we had the chance. I wanted him to swing so bad, I coulda fucked that guy up.”</p>\n\n<p>“Look kid, sometimes it’s just best to let bygones be bygones. We take him away, some other man swoops in and does the same thing. Plus taking him away from the kids, I don’t know, but it’s just not always the right move. I gave her our card, if she calls again we’ll take that shithead down.”</p>\n\n<p>I radioed base that the house was all clear, and we continued on our patrol. In the next couple hours, we just encountered typical routine shit. A couple traffic stops, some weed, some stolen goods, and responding to shots fired. Just a typical cold night in East Philly</p>\n\n<p>“Carson, what are you gonna do when you retire in a few months?” asked Tex “Gonna miss it here?”</p>\n\n<p>I grunted and looked at Tex. “Hey man, after 20 years here and 8 in the corps, I’ve had enough people shooting at me and wanting to kill me for one lifetime. Plus my knees and back have taken a beating, and I ain’t as strong or handsome as I used to be. I could still kick your ass though, Tex.</p>\n\n<p>Tex laughed and said “Oh yeah Gramps? Is that so? Guess I wasn’t state linebacker or nothing.” Sometimes I wondered why Tex became a cop. He was one of the best linebackers in the state, and had a couple good offers to play football and make it out of Philly. He wasn’t the brightest, but he certainly wasn’t a dumb kid. I think he wanted to stay home and protect his mom; most kids like Tex grow up without one of their folks in their life.</p>\n\n<p>Around 10:30 PM we received a high priority call from HQ. “Charlie 14 this is base, come in. Possible meth lab 10 minutes from your location at 44th and Grant. Charlie 11 and 12 were sent there about 20 minutes ago, and haven’t radioed back, we need you to check it out.” </p>\n\n<p>“Roger that, Charlie 14 responding and on the way”</p>\n\n<p>44th and Grant was one of the worst neighborhoods in East Philly; cops hated going there. The place was notorious for hookers, human trafficking, trap houses, and gunshots, so when we got the call, I knew something was up. Communications were bad tonight because of the weather, but that was a strange amount of time to go without responding to a drug operation. I threw on my siren and high tailed it through the abysmal rainy night. </p>\n\n<p>When we arrived on sight, I saw the other patrol cars outside with their lights flashing. I had never seen this location on Grant before, so I didn’t really know what to expect going in. I told Tex to wait in the car, and I got out and looked at the other squad cars. There was no one in them; the whole situation was eerie. I didn’t expect anyone to really be out tonight given the weather, but with lights flashing you usually get a few visitors. I tried radioing to base to give an update, but the communications were fuzzy and I couldn&#39;t get through. </p>\n\n<p>“Damn” I said under my breath. I was going to have to go in and investigate. I returned to my car and told Tex to wait inside while I investigate the property, and I’d try to radio to him if there was danger. The property itself was a big house; three stories and most likely had a basement like the other houses around. I only took a few steps away from my car and I was hit with a foul stench. It didn’t smell like hash or any other drugs, but smelled like a rotting corpse. Something obviously wasn’t right about the situation, and I didn’t need to go around the whole premises to gather that information. I went back to the car and told Tex I was going to take a look inside, and for him to wait here. If I were going by routine, my partner would be going with me on this one, but my intuition hinted I couldn’t take Tex in with me. I was going to take this call alone.</p>\n\n<p>I went to the front door and tried to listen. There was no sound, just the awful smell growing stronger the closer I got to the house. I knocked and shouted “Police! Open up”, but no answer. To my surprise, the door was unlocked, and I entered the house gun drawn. \nIt was pitch black inside. There seemed to be no electricity, and I drew my flashlight. The stench was almost unbearable at this point, but I couldn’t turn around, I had a high priority call and the thought of losing my brothers on the force was overpowering. Mission always came first, no matter what.</p>\n\n<p>I think I was in the kitchen at this point, but I couldn’t tell; the place all seemed the same. There was no furniture, nothing that distinguished one room from another. My flashlight was a fade of dim light in a pit of darkness. As I continued throughout the house, I tried to follow where the stench was growing stronger. I came across stairs leading to another level of the house, but this time I could smell something other than the stench; candles. </p>\n\n<p>My boots creaked on the stairs as they echoed throughout the house. I could hear faint voices beyond my footsteps; they were not English or any other language that I heard before. For the first time in a while, I was afraid; I didn’t want to advance anymore through the house and I was almost too scared to turn around, but I had too much training and experience at this point to act like a coward. As I got to the top step, my light was shined on what appeared to be three naked men staring at something on the wall. “Show me your fuckin hands!” I yelled, but no response came from the shadowy figures. It was almost as if I didn’t exist; “SHOW ME YOUR FUCKING HANDS AND TURN AROUND” I chambered a round in my pistol and took one more step forward, but that step was the last thing I remembered before going out cold. I don’t remember being hit, or if anyone was behind me, it all happened in one instance. </p>\n\n<p>At the time, I didn’t know how long I was out for, but it felt like a few hours. I awoke with my hands bound by rope in what appeared to be the basement of the house. The room was filled with dark red candles, which was masked by the smell of the rotting flesh I had scented earlier. I looked up, and started dry-heaving immediately. Hanging from the rafters of the basement were six men, all with their entrails hanging out and their stomachs cut wide open. They had to be the officers that first responded to the call, but what the fuck was this, some sort of ritual sacrifice? </p>\n\n<p>I attempted to stand up, but was quickly met by two naked men wearing goat heads, who pinned me to the floor. Another man approached me and stuck a needle in my thigh, and I felt myself losing control of my body. I was still consious, but they had sedated me with something I was unfamiliar with. One of the naked men drew a noose, and tied it around my helpless neck. I was brought to the center of the room and was thrown on what felt like blood. The men went to the corners of the room and started chanting in some banter language that was completely unfamiliar, and one approached me with a blade. I had been in combat before, been bombed in the streets of Afghanistan and shot in the streets of Philly, but this feeling I had inside me was different; I was sure I was going to die. </p>\n\n<p>I fought with all my strength to try and stand or speak, but I was so drugged up that I couldn’t function; I was completely helpless. A man wearing nothing but a potato sack on his head approached me and pressed the cold silver tip of the blade against my uniform. It was so sharp it tore right through my bullet proof vest  and dug into my skin as he cut off my top. I winced an began to bleed, I tried to yell but all that came out were mumbles. The man removed what was left of my uniform, and then drew his blade once more; this was it. I closed my eyes and was ready to meet my fate, but fate had something else in store that night. The sounds of a 9MM pistol ripped through the basement, and the man with the blade fell lifeless. Tex was by the stairs, firing off as many rounds as he could at the cult. </p>\n\n<p>I mustered all the strength I had and reached for my belt, but the drugs were too strong and I couldn&#39;t grab anything. I managed to get on my feet, and stumbled towards Tex. “Get to the car man” he yelled. I can hold them off, just try and signal for dispatch”. I climbed my way up the stairs, and tried to find anything that resembled a room in the house. I could barely see anything, stumbling room to room, trying to find a way to escape. The drugs made this house feel like a maze, and I was it&#39;s prisoner, with each room being a dark dead end. I didn’t have my utility belt, and I was bleeding pretty bad with no way to suppress the wound. </p>\n\n<p>The last room I stumbled upon had the same staircase I saw when I first entered the house, and I remembered there was a door about 45 degrees away from the stairwell. I made my exit from that hell house and felt the cold rain against my skin. Trying to hold my composure, I headed towards my squad car, which was thankfully left unlocked by Tex with the key still running. </p>\n\n<p>“Base this is Charlie 14, multiple officers down”</p>\n\n<p>No Response</p>\n\n<p>“Base come in, this is Charlie 14, multiple officers down, in need of immediate backup”</p>\n\n<p>Silence. </p>\n\n<p>I watched through the car door window, waiting franticly for Tex. “God damn it kid, get out of that place”. After about 10 more minutes, the door flung open and I saw Tex standing at the porch. He nodded at me, and I nodded back; he saved my life that night, but I wouldn’t be able to return the favor.</p>\n\n<p>Tex was dragged by his feet back into the house, and the door slammed shut behind him.</p>\n\n<p>“TEX” I screamed, “TEX!!!!” </p>\n\n<p>I searched the squad car for something to arm myself with, but there was nothing. When I looked back up, I made eye contact with a naked bloody man with a blade and gas mask over his head stood as he stood in the doorway. </p>\n\n<p>The decision I made next I will always have in the back of my mind. With what energy I had left, I hightailed it out of there as I was fading out of consciousness again. I made it three blocks before I crashed my cruiser into the side of a building.</p>\n\n<p>When I woke up again, I was being tended to by paramedics at the crash sight. I asked one of them if any other officers had been sent to the house. </p>\n\n<p>“Dispatch sent two more units about twenty minutes after you crashed, there was nothing at the house”</p>\n\n<p>It turns out when the other officers arrived, there was evidence of nothing. None of the other patrol cars were still there, and they couldn’t find anything in the house. No bodies, no blood, nothing. There was no sign of Tex either, he had vanished with the rest of what was in that house. </p>\n\n<p>I made the decision to resign that night at the hospital. I was eight months away from retirement, and was walking away from everything I had worked for, but I couldn’t go back after that. There were so many questions I couldn’t answer, and just as many people I couldn’t face. What would Tex’s mother think; I was supposed to look out for her son and drove away from him. I was a coward, and not only failed the assignment, but myself.</p>\n\n<p>When I am healed, I will go back out and find whoever they were on my own. I don’t think the boys down at Charlie can crack this one, and I’d be too distracted by this incident to help with anything else. </p>\n\n<p>If anyone else in Philly has any clue as to who these people might be, I’ll be at the Dunkin on North Front and East Godfrey everyday at Noon and 6PM. Tex, I’m coming for you buddy</p>\n\n<p>UPDATE: I left Dunkin Donuts yesterday at noon and to my surprise, no one met me inside. However, when I came back to my car, someone had left something on my windshield. I grabbed the black nameplate from the windshield wiper; Marcus Texturnica </p>\n</div>\n","author":"MidnightMass26"}