{"rank":"38","title":"I’ve been receiving unsolicited texts and calls","id":"8kemq3","url":"/r/nosleep/comments/8kemq3/ive_been_receiving_unsolicited_texts_and_calls/","time":"1526662124000","body":"<div class=\"md\"><p>Call me Anna. Call me crazy. I don’t care at this point. I have been driven to the edge and I fear there is no return. Several days ago my torment started during lunch at school. While I was sitting at the cafeteria table enjoying a burger, my phone vibrated. I pulled it out of my pocket and saw that I had received a text message from an unknown number.</p>\n\n<p>Where r u</p>\n\n<p>I texted back that they messaged the wrong number and set my phone down to continue eating. Less than two seconds later the anonymous party replied.</p>\n\n<p>Where r u </p>\n\n<p>Slightly annoyed I reiterated that they must have the wrong number. Again, I got a near instantaneous reply.</p>\n\n<p>Where r u</p>\n\n<p>I ignored it and set my phone to stop vibrating. I did not think about it for the rest of the day. The next period was math, then science and English. I drifted to sleep in English and was jolted awake by the bell signaling the end of the school day. I live only three blocks away from school so I walked home. I pulled out my phone and saw 15 notifications. I opened them.</p>\n\n<p>Where r u \nWhere r u\nWhere r u\nWhere r u\nWhere r u\nWhere r u\nWhere r u \nWhere r u \nWhere r u\nWhere r u\nWhere r u\nWhere r u\nWhere r u\nWhere r u \nWhere r u</p>\n\n<p>I was beginning to get mildly unsettled at this point. This was very weird. I texted my best friend Brianna about the weird texts and sent her a screencap of the messages. She thought it was just a stupid prank and advised me to delete the chat history. I did. I told my parents about the strange messages over dinner and they simply gave me the same advice. I figured they would. I did my evening routine and went to bed.</p>\n\n<p>I woke up at 11:35 PM to a buzzing coming from my phone. The soft blue glow illuminated my ceiling. That’s strange, I thought to myself. I know I turned off the vibration. I picked up my phone and attempted to read the phone number through my blurry vision. I answered and rubbed my eyes.</p>\n\n<p>“Hello?”</p>\n\n<p>Through the phone came heavy breathing coupled with what sounded like intense rubbing on the speaker. I quickly lifted my phone away from my ear and looked at it.</p>\n\n<p>“Who is this?”</p>\n\n<p>No reply, just more strange breathing. I hung up and placed my phone back on the table, rolled over and went back to sleep. I awoke again at about 2:00 AM to another buzzing coming from my phone.</p>\n\n<p>“Hello?”</p>\n\n<p>This time I got a response.</p>\n\n<p>“Four AM.”</p>\n\n<p>My eyes widened slightly.</p>\n\n<p>“Who the hell are you? Why are you bothering me?”</p>\n\n<p>“Four AM.”</p>\n\n<p>The line went dead. I sat there in my bed propped up by my pillows just staring at my phone in disbelief. Who the fuck was this guy? What did he want? What did he mean by four AM? I gingerly put my phone back on the night table and laid back against my pillows. I tried to put the creepy call behind me but could not. Four AM kept dancing to the forefront of my mind. I got a notification on my phone. I picked it up and opened it.</p>\n\n<p>It was from an unknown number.</p>\n\n<p>Soon</p>\n\n<p>I angrily texted back.</p>\n\n<p>Fuck off creep</p>\n\n<p>The S turned into an R instantly.</p>\n\n<p>...</p>\n\n<p>I c ur house soon anna</p>\n\n<p>My face turned white. How did he know my name? I slowly got out of bed and crept over to my window. I pulled aside the curtain and gazed out into the street below. It was empty with the occasional car that drove by. The street lamp in front of my house had long ago gone dark. Suddenly it illuminated, revealing a man underneath it. He was dressed in a trench coat and wore a Guy Fawkes mask. It would have been ridiculous if I weren’t so scared. My phone dinged. I raised it to read the message.</p>\n\n<p>Hi anna</p>\n</div>\n","author":"AnimeDreama"}