{"rank":"7","title":"The Medium - Part 3","id":"8kenmj","url":"/r/nosleep/comments/8kenmj/the_medium_part_3/","time":"1526662325000","body":"<div class=\"md\"><p>Part1: <a href=\"https://www.reddit.com/r/nosleep/comments/8jvyc1/the_medium_part_1/?utm_content=title&amp;utm_medium=user&amp;utm_source=reddit&amp;utm_name=frontpage\">https://www.reddit.com/r/nosleep/comments/8jvyc1/the_medium_part_1/?utm_content=title&amp;utm_medium=user&amp;utm_source=reddit&amp;utm_name=frontpage</a></p>\n\n<p>Part 2: <a href=\"https://new.reddit.com/r/nosleep/comments/8k5bcd/the_medium_part_2/\">https://new.reddit.com/r/nosleep/comments/8k5bcd/the_medium_part_2/</a></p>\n\n<p>Part 4: <a href=\"https://www.reddit.com/r/nosleep/comments/8l2mk6/the_medium_part_4/\">https://www.reddit.com/r/nosleep/comments/8l2mk6/the_medium_part_4/</a></p>\n\n<p>If you want to sell your fortune-telling, I mean if you <em>really</em> want to keep the customer’s interest, then you’ve got to adhere to the basic principles of storytelling. Think of it this way:</p>\n\n<p>Joe Shmoe comes waddling in and sits across from me. He’s nearly 7ft tall, overweight, and in his mid-forties. With his dopey, giant, Disney-character face full of rejection and loneliness, he slides forward a twenty-dollar bill and asks, “Will I ever find love?”</p>\n\n<p>This is a yes-or-no question, and it’s a trap. If you answer directly, the story is over. You might say, <em>Of course you will, my friend. Of course you will. It’s only a matter of time.</em> Or maybe you swing the other way and say*, Fuck no, you goofy giant. I suggest you put your porn subscriptions on autopa*y. Either way you respond, he’ll have his answer and be through with you. Kiss his cash farewell. Every good story needs a character, conflict, and resolution.</p>\n\n<p>So to a question like this, I’d take his beefy hands in mine and say, <em>The universe has designs for you, Joe. I sense the burning of a cigarette. The clinking of glasses. Keep your eyes and heart searching for a short woman, her hair like wheat. But be alert. Missed opportunities die with inaction.</em></p>\n\n<p>Now we have a story. Joe Shmoe (character) has to find a girl (conflict) so that he can live happily ever after (resolution). A week from now, he’ll get impatient and come in hoping for more information. This time, I’ll ask for forty bucks.</p>\n\n<p><em>Your grandfather has passed on, hasn’t he, Joe?</em></p>\n\n<p>And Joe nods glumly—because, of course, the chances of living into your forties <em>without</em> losing a grandparent is statistically improbable.</p>\n\n<p><em>I feel his presence here with us today, right here in this room. He’s willing you to get out, Joe, get out of your apartment! Spend your time with others, instead of wasting away in an empty home. Your time is coming, Joe. Don’t let it pass you by.</em></p>\n\n<p>Give it a month or two of repeat visits, and eventually this jolly-white-giant will come in, vibrating with excitement. He’s dressed better, so you know he’s had sex. He’ll say, “You were right. It was incredible. I started visiting a few bars near my work. You know, <em>smoke and the clinking of glasses,</em> right? I met someone last night. And get this—*she’s *short. Thank you. Thank you so much.”</p>\n\n<p>So, some guy started getting out of his house and met some girl at some bar. I’m incredible, I know. A real detective of the spirit world, that’s me. I don’t bother telling him that almost any girl he’d meet would be shorter than <em>him.</em> If he had told me this girl didn’t have wheat-colored hair, I would’ve said, <em>Shit, I meant whole-grain.</em></p>\n\n<p>What I do say is, <em>It’s important to appreciate the gifts that creation grants you in the present, but have you considered what this girl might hold in her past?</em></p>\n\n<p>His big, dumb smile will fade away and, bing-bang-boom, I’ve got him on the hook for another month.</p>\n\n<p>A simpler way to add conflict to a story—the lazy way—is to say things like:</p>\n\n<p><em>Avoid elevators.</em></p>\n\n<p><em>Avoid theaters.</em></p>\n\n<p><em>Avoid waiters.</em></p>\n\n<p><em>Avoid past love interests.</em></p>\n\n<p>After meeting the Glass-Eyed Woman, after reading about Whats-her-name’s suicide, it took me awhile to catch onto what was really happening. First I thought I might’ve been drugged. Maybe one of her worn out, socialite friends had slipped me something at the dinner party. Who knows? But as the month went on, over the course of weeks, the truth finally started to sink in. Ever since that wrinkled crone held my face in her hands, or maybe even before <em>that,</em> when she first looked at me with those glossy eyeballs, I’ve been getting glimpses of how people die. How everyone dies.</p>\n\n<p>You’d think it would be more obvious, that I’d figure it out sooner. But you’d be wrong.</p>\n\n<p>See, the leading cause of death across the board is heart disease. A majority of these glimpses I get, there’s no gore. No blood. No decapitated bodies fumbling around in their wallet to pay me for a palm reading. A majority of people die lying down in a bed somewhere. Witnessing this day in and day out is not as disruptive as you’d think. The second leading cause of death is cancer, which explains why, now and then, I’m getting visions of what people would look all emaciated and bald from chemo. Or how when someone walks in and for the briefest of moments I can see them gasping for air, the veins in their face turning bright pink. The third most common cause of death is lower respiratory diseases. Then it’s strokes for Hispanics and African Americans. Diabetes for Native Americans. More respiratory diseases for whites.</p>\n\n<p>It’s killing my bottom line, but more and more these days I find myself saying to the customers:</p>\n\n<p>Avoid red, fatty meats.</p>\n\n<p>Avoid living a sedentary lifestyle.</p>\n\n<p>Avoid leaving your insulin at home.</p>\n\n<p>With a cigarette dangling from my lips, I’ll say, <em>And for the love of God, check the nutrition facts and avoid known carcinogens.</em></p>\n\n<p>The really gruesome stuff, the stuff you’re hoping I’ll write about, is far and in between. A bicycle carrier brings me lunch, and when I tip the guy, he looks up and says, “Thurg yer, sssirr,” because his jaw has been smashed into a million bone fragments hanging in a sack of soft tissue that used to be his chin. His helmet is cracked and split up the left side. All of this from some future impact on the future hood of some future car. <em>His</em> future.</p>\n\n<p>At a stop light on the way home, a school bus rolls up in the lane next to me. I accidentally make eye contact with the bus driver and we both nod at each other. Then the entire bus is on fire. Inside, an inferno is crawling forward from the back of the bus. School children are coughing into tiny fists, trying to get the door open. The driver is slumped forward awkwardly in his seat, a stream of red running down his face from where it hit the windshield. Behind him, kids are screaming and banging against the windows with opens hands. Some of the girls, with their polyester skirts, are burning brighter and hotter than the rest. The smell of burning hair.</p>\n\n<p>Then the light turns green. The bus driver shouts back at someone as he pulls forward. An eight year old flips me off as they drive away.</p>\n\n<p>Someone behind me honks before I’m back to reality.</p>\n\n<p>Nineteen kids dead, the driver somehow rescued with 30&#37; of his covered in third degree burns. That one made the 5 o’clock news for weeks and weeks. I watched the coverage every chance I got.</p>\n\n<p>I’m not in the business of saving people, okay? I tell people what they want to hear for money. That’s it. Shit, most of these violent, insane deaths—what could I do if I <em>wanted</em> to help? And what, I’m going to babysit someone who’s destined to fall down an elevator shaft while some other poor fucker gets mauled by dogs? How could I do that, choosing who lives or dies? Who’s earns my guardianship, and how? I’d have to be a next-level narcissist to think that my place in the world is prevent <em>anything</em> from happening* to anyone*. No way, no thank you.</p>\n\n<p>So when this chick comes into my parlor for the first time, eyes rolling around the room, smacking gum and says, “Hey. So I think someone might be trying to kill me. Do you help with that kinda stuff?” you can understand my dilemma.</p>\n\n<p>Just behind her left temple, a mess of matted blood and hair running in thick streaks down her arms, dripping from her elbows. On my parlor floor, a growing crimson puddle. She’s the picture-perfect, living-embodiment of youth and beauty… after it’s been shot in the head. Postmortem. She’s my damsel in mortal peril. My dead-woman-walking.</p>\n\n<p>Then she says, “Shit. Wait. Do you take VISA?”</p>\n\n<p>More to come.</p>\n</div>\n","author":"DRP22"}