{"rank":"13","title":"I’m bleeding from the neck","id":"8kenl5","url":"/r/nosleep/comments/8kenl5/im_bleeding_from_the_neck/","time":"1526662318000","body":"<div class=\"md\"><p>Guys, can you explain what in the ever loving <strong>fuck</strong> is happening to me?</p>\n\n<p>My name’s Mary and this morning, I woke up to a loud noise of something heavy dropping on the floor downstairs. Nobody was supposed to be there that early and I lived alone with my cat, Tom.</p>\n\n<p>I peeked quietly from the staircase to see two individuals who looked to be around in their thirties, pulling my 32” TV with all their strength. A crowbar laid on the floor, presumably the source of the sound that had awoken me.</p>\n\n<p>I quietly went back to my room and dialed 911. That’s when Tom meowed loudly, demanding food. The sound of pulling and grunting downstairs suddenly stopped.</p>\n\n<p>I dreaded what might come next and unlike in the movies, as I dialed the emergency number and a female voice on the other end just started speaking, the duo of fuckers rammed through the door and one of them immediately kicked me in the chest, sending me flying to a closet door with a loud thud. Then as the 911 operator asked what was happening over there, I, in a moment of fear, panic and confusion, screamed my address. The lady seemed to have heard it and responded but I couldn’t hear it clearly because one of the men had started strangling me with his dirty hands.</p>\n\n<p>Then as I tried to gasp for air, the other guy repeatedly delivered some serious blows into my abdomen. I bled and choked on my own blood as the other guy choked me. Not the faintest fucking sign of mercy. They seemed to be smiling, enjoying my fetal attempts to resist.</p>\n\n<p>But even though I was now pretty much purple skinned from the neck up and red from neck down, I still seemed to be able to pull on the guy’s hands in vain. After 2 more minutes of him basically squeezing my neck dry, they had stopped smiling and the other guy went downstairs, only to come back with my favorite kitchen knife. Huh.</p>\n\n<p>Then, as you might’ve guessed, he, without a second of hesitation, slashed my neck open. Blood started dripping like a fountain from the wound and I felt a little dizzy. The pain was something of a magic. I couldn’t feel, hear or think anything from the sheer torment I was enduring. I actually wished for death to come and make it end in that moment.</p>\n\n<p>But after maybe 30 seconds of THAT, for some reason, I stopped looking at the ceiling and turned my perspective back at the burglars. The fuckers weren’t smiling now, nor grimacing. Expressions of shock and pure horror were on their faces. If I was one of them, I would’ve probably looked the same way. But I wasn’t and that’s all.</p>\n\n<p>I wanted to scream for help but I couldn’t. My head felt disconnected from my body. The men in front of me started turning back.</p>\n\n<p>“Jesus-fucking-Christ, let’s get the fuck out of here! There’s something wrong with this girl!”</p>\n\n<p>The other guy shakingly nodded and they started sprinting out of the backdoor. They left their crowbar.</p>\n\n<p>Now I sit here,my floor practically a puddle of blood. It keeps flowing out with no sign of stopping. I tried to bandage it but it’s useless after a second of blood soaking it red. I tried rinsing it with water but that didn’t work aside from the house of pain it gave me after it actually went inside my throat. I considered stitching it back together, but I don’t have sewing kit in my house.</p>\n\n<p>My clothes are painted red. Every blanket in the house coated red. I tried tasting my blood and it tasted…just like <em>blood</em>.</p>\n\n<p>Holy shit, Tom just slipped on my blood.</p>\n\n<p>I tried to squeeze the rest of the blood out but that just brought on more sanguine fluid to mess up my carpet. I only feel excruciating pain but that’s no big deal, <em>nooo big deal, right?</em>.</p>\n\n<p>Hey, at least I’m not dead, right?</p>\n\n<p>Right?</p>\n\n<p>Everything’s going to be okay, right?</p>\n\n<p>…I’m going to try and dig into it with my fingers. Maybe something inside of my body is causing it. I’ll be right back.</p>\n</div>\n","author":"rantleystalk"}