{"rank":"5","title":"Lucinda","id":"8kerae","url":"/r/nosleep/comments/8kerae/lucinda/","time":"1526663148000","body":"<div class=\"md\"><p>&quot;Come feel her move Howell!&quot; a voice echoed from another time and I let myself linger in the memory. I closed my eyes, though it was unnecessary, and was back in that hazy sunlit day that can never return again. I felt her move. Hands pressed to Eleanor&#39;s cool flesh in memory, and at the same time pressed unto the damp cold earth. I felt her move in two places. The soil shifted ever so slightly, like the movement of a womb.</p>\n\n<p>And then the it stopped and the reverie was over. </p>\n\n<p>I cried and I reeled in that harshest of pain that no physical blow can ever replicate. I was alone again, in this moonless world. Just a grown man crouched over wet soil, crying over unalterable courses and unfathomable losses. And then, I wasn&#39;t alone.</p>\n\n<p>&quot;She&#39;s not ready yet son,&quot; said a hollowed out wisp of a voice that still set my nerves on edge. &quot;But she will be. Just needs... time to rise. I never do things by half measure- you&#39;ll learn.&quot; </p>\n\n<p>I nodded without an upward glance, but I knew he remained even in the silent darkness. That was the first night.</p>\n\n<p>I came back again and again to that damp and desolate scene as the moon cycled through its phases, just to feel the soil move and return to that distant and formless day turned dream. The stranger told me each time to return later when the full term had been reached, but I invariably came again straightaway.</p>\n\n<p>&quot;I never break a deal Howell,&quot; he let the words sit in the air, icy and malicious. I shuddered and nodded taking in the implied message, that I too was bound by the deal. </p>\n\n<p>It took thirty nights. Thirty nights since the sulpherous deal was struck on that ramshackle intersection where two desolate roads met. Thirty nights of waking dreams and watching over her the way a baker watches a loaf in the oven, rising tenderly, growing until golden brown and perfectly formed. Thirty nights since I first felt her move.</p>\n\n<p>By the thirtieth, the moon had grown full and lit the world below in a pale silver haloed haze. The frigid air brought on a vaporous quality, a drifting fog amplified by the cool clamminess of the air. And below my hands, on that thirtieth night, I felt the earth shift once again and my eyes watched as the stirred soil stirred some more.</p>\n\n<p>&quot;Can you hear her kicking Howell?&quot; the soft wan voice of Eleanor asked me from distant dreams. In the moonlight I pressed my ear to the soil while pressing my ear to Eleanor&#39;s belly in some other world. And I did hear her! They were muffled sounds, scraping in the wet mire below me, but they grew louder as the turning of the earth increased in violence.</p>\n\n<p>&quot;I can hear her Eleanor!&quot; I exclaimed aloud.</p>\n\n<p>I reached elbow deep into the writhing wet loam until my two hands grasped something slithering, eely and plump. Effortlessly, I pulled her up from the soil, a putrid and foul stench rising along with the squirming bundle in my hands. But when I brought my haul fully into the radiant light of the moon, the thrashing stopped. </p>\n\n<p>I marveled at her skin, as white as marble and just as cold and her eyes, a piercing frosty blue that locked unto my own... preternaturally. She was the size of a miniature loaf of bread. With sturdy force I swatted her hard on the back; blackened earth projected from her pale lips and she shrieked in a high pitched wail, as she took in her first breath of air.</p>\n\n<p>&quot;She is beautiful,&quot; said the voice of Eleanor in my head.</p>\n\n<p>&quot;Aye...&quot;</p>\n\n<p>&quot;Perhaps you ought to name her after me,&quot; the stranger said from behind. &quot;Lucy? ...No, no not quite. Maybe Lucinda? Yes! Lucinda, it has a nice ring to it.&quot; </p>\n\n<p>Lucinda cooed and worded the name silently on my lips.</p>\n\n<p>&quot;Keep her safe and don&#39;t forget our deal Howell, I have big plans for her.&quot;</p>\n\n<p>I winced and nodded my <a href=\"http://jamesmoniker.wordpress.com\">head.</a></p>\n</div>\n","author":"JamesMoniker"}