{"rank":"19","title":"misophonia","id":"8kev2c","url":"/r/nosleep/comments/8kev2c/misophonia/","time":"1526663997000","body":"<div class=\"md\"><p>I hate noise. Snapping, clapping, flicking, picking, slurping, chewing, breathing, you name it. When I hear any of these I black out in rage, I&#39;ve hurt people because of it. </p>\n\n<p>I&#39;ve killed someone because of it.</p>\n\n<p>I couldnt keep myself from killing him. He deserved it.</p>\n\n<p>He was in my Spanish 1 class, he always ate cup noodles right behind me, slurping as loud as he could. He wouldnt stop no matter how many times I screamed, hit or threatend. I know he did it to annoy me. He would never stop, and I knew it.</p>\n\n<p>One day he was just beginning to slurp, so I grabbed his ramen and poured the blistering hot soup all over him.</p>\n\n<p>I got suspended, almost expelled, but of course &quot;I had no idea it would be that hot.&quot;</p>\n\n<p>I even brought the snake flowers, and <em>genuinely apologized</em>.</p>\n\n<p>I know he didnt believe me, but now he was scared of me. He didnt want any trouble. But if he didnt want trouble he should have shut his fucking mouth before it was too late.</p>\n\n<p>I began to be his friend, you know the saying: &quot;keeps your friends close and your enimes closer.&quot; </p>\n\n<p>We would talk during class, during lunch, after school, pretty much all day. I actually began to like him. He respected my misophonia and stopped slurping.</p>\n\n<p>He told me the only reason he slurpped so loud is because its the only time I would talk to him. Sweet, but... I mean its sweet.</p>\n\n<p>About a month goes by and he asks me on a date. I was so excited I spend 2 hours getting ready.</p>\n\n<p>We hungout at his house and watched some shiity sci-fi movie he picked out. We sat awkwardly beside eachother, then a little closer, then cuddled. I could feel his eyes on me, so I looked at him.</p>\n\n<p>He leaned in for a kiss.</p>\n\n<p>We sat there kissing, but the noise of our lips separating drove me mad. I told him to stop, that the noise was killing me.</p>\n\n<p>&quot;Come on get over it this one time.&quot; He went back in for a kiss, this time grabbing my face and forcing me to kiss back.</p>\n\n<p>I bit his lip so hard some skin was taken off. He sat there, mouth covered and bleeding. I grabbed his throat and pushed him down. I could feel his muscles in his throat begging for air, I could feel him gulping. I fucking hate when people gulp. </p>\n\n<p>&quot;I told you to fucking stop.&quot; I said before I threw my first punch. I heard his nose crack, and he tried to fight back but I sat on his chest and restrained his arms.</p>\n\n<p>He looked so useless, he looked so cute when he was scared. </p>\n\n<p>His heavy breathing and sniffles flooded my ears.</p>\n\n<p>&quot;God dammit! Do you ever SHUT UP?.&quot; I reached for my boot and pulled out a pocket knife.</p>\n\n<p>His eyes widened, and the screaming began.</p>\n\n<p>&quot;Stop...&quot;</p>\n\n<p>Screaming continued as he flung himself around, unable to leave my grasp.</p>\n\n<p>&quot;I&#39;m warning you one last fucking time.&quot;, I said slowly.</p>\n\n<p>&quot;Get the fuck off you me you psycho bitch!&quot; He screamed in my face, I felt his warm breath on my face. I visably cringed.</p>\n\n<p>Psycho? Bitch? I pinned the pocket knife to his throat.</p>\n\n<p>&quot;Do you have any respect for anything at all you piece of shit? I told you all year to shut the fuck up, It took boiling water over your body for you to even consider it. Then I tell you to stop kissing me and you force me to? Then have the audacity to call me psycho?&quot;</p>\n\n<p>He spat on me.</p>\n\n<p>I blacked out.</p>\n\n<p>When I woke up I was laying down in something warm and sticky, it smelled of iron. I sat up, there he was throat slashed and a knife left in his eye, his blood probably stained my favorite pair of jeans.</p>\n\n<p>I took out the knife and cleaned up anything that could have my finger prints on it, I didnt have to do that much because no one knew I was at his house. So I left, I wanted his parents to see what I did. How dare you raise someone to be so disgusting.</p>\n\n<p>After I was done I began walking downstairs and oh man, let me tell you.</p>\n\n<p><em>It so quiet..</em></p>\n</div>\n","author":"knifegore"}