{"rank":"175","title":"Berner's Wax Museum","id":"8kewy3","url":"/r/nosleep/comments/8kewy3/berners_wax_museum/","time":"1526664398000","body":"<div class=\"md\"><p>The sign was hard to miss; there wasn&#39;t much to look at for miles around, and the sign, though ugly and rusted, was a small reprieve from the monotony of the landscape. <strong>BERNER&#39;S WAX MUSEUM OF HORRORS</strong>, it read in square black letters. <strong>ONE MILE AHEAD.</strong></p>\n\n<p><em>Why not?</em> I thought to myself. It was one in the afternoon, and even with the windows rolled down, the car was unbearably hot. I hated this drive—my annual migration down to my mother&#39;s house was never a treat, and now with a busted AC, I didn&#39;t think I could stand another couple hours in the simmering California weather. I could spend the better part of the afternoon at Berner’s, and then I&#39;d hit the road once things down. It was a plan.</p>\n\n<p>The building was exactly the level of kitsch I’d expected. A run-down one-story with a stucco exterior, spruced up by a giant Frankenstein head mounted over the entrance. Frankenstein&#39;s pink rubber tongue lolled listlessly out of his mouth, and his plastic eyes protruded too far out of his skull. The effect was more comedic than anything. A warning on the door threatened patrons to <strong>ENTER AT THEIR OWN PERIL.</strong> The whole thing was refreshingly corny.</p>\n\n<p>I pushed the door open and was greeted with a blast of cold air conditioning. The museum&#39;s lobby was small and simple, plain white walls decorated with posters of cult classic horror movies. There was a guy behind a counter who couldn&#39;t have been more than seventeen. Even sitting down, he looked gangly and thin, with clusters of painful-looking acne along his jaw. His blue polo hung off his frame and his hair fell into his eyes.</p>\n\n<p>&quot;Welcome to Berner&#39;s Wax Museum of Horrors. It&#39;s fifteen bucks for the tour and ten for a walkthrough,&quot; he said, barely glancing up from his phone. &quot;You can take as long as you want.&quot;</p>\n\n<p>&quot;Who&#39;s the tour guide?&quot; I asked.</p>\n\n<p>He tapped his name tag. It read CHRIS. &quot;I&#39;d just go with the walkthrough, man.&quot;</p>\n\n<p>I paid him the cash and he pointed me to a door to the right of the counter. &quot;Uh, don&#39;t touch anything. And close the door behind you.&quot;</p>\n\n<p>The door opened into a narrow corridor leading to a larger room. The walls of the corridor were splattered in too-bright blood, with red handprints clawing their way up to the ceiling. A portly wax statue of a man in a three-piece offered pamphlets from a large box. I leaned in close to examine him. He wasn&#39;t the best quality statue I&#39;d seen; the wax was poreless and uniform in color, far too smooth to resemble real skin, and his mustache looked straight out of Party City. Maybe they&#39;d tried to give him a smarmy expression, but instead he just looked constipated.</p>\n\n<p>The larger room held about ten statues arranged in various poses. A suprisingly well-made Freddy Krueger stood over a screaming woman, claws extended and ready to strike, brown fedora glued in place to keep it from falling off. Jason Voorhees stood in the corner with a prop ax clutched in his gloved hands. I wondered if the face behind the hockey mask was flat and colorless. </p>\n\n<p>A white-faced vampire bared his plastic fangs at me in a snarl, though his pretty-boy features were more <em>Twilight</em> than <em>Dracula</em>. Maybe they&#39;d had to repurpose some celebrity statue and had just thrown a black cape on him and called it a day. The rest of the figures were assorted monsters and creepy crawlies, from a DayGlo-green alien to something that was either a werewolf or a poor attempt at Bigfoot.</p>\n\n<p>Dioramas of gristly, over-the-top horror greeted me at every turn. A man with the skin dripping off his face in a gloopy mess. A woman holding both her eyes in her hands, her mouth a violent gash under two dark empty sockets. </p>\n\n<p>They must have set it up to become more and more disturbing the farther you walked through the museum, but I was laughing at every exhibit, at the cheesy expressions of terror and blood that practically glowed underneath the florescent lights. The statues reminded me of B-movies with people getting hacked up by chainsaws or minced in garbage disposals—way too unrealistic to provoke any visceral reaction, deep in the part of your brain where fear thrives.</p>\n\n<p>I snapped a few photos of the worst offenders as I passed. There was a guy missing his lower half with a tangle of ropy intestines spilling out of his stomach. A crazed ax-murderer hovered over him, ready to make the killing strike. Upon closer inspection, the ax-murderer appeared to have been Michael Jackson in a past life. A clown holding a jack-in-the-box was evidently once David Bowie.</p>\n\n<p>I stopped at a vending machine for a bottle of water. The lobby had been cool, but the temperature was rising as I made my way through. They&#39;d really cut corners on everything.</p>\n\n<p>By the time I&#39;d reached the fourth room, I was sure I was closing in on the end, so imagine my surprise when I came to the stairs leading to a lower level. There was no other exit, only the narrow set of stairs, a little less than a meter wide. </p>\n\n<p>The lights illuminating the stairwell were too bright, making me shield my eyes with my hand as I descended. It&#39;s funny—I don&#39;t know if the steps were spaced weirdly or something, but the walk down took a hell of a lot longer than it should&#39;ve. </p>\n\n<p>I found myself in another room like the others—white walls, bright lights, the bite of heat in the air. But something had changed. For a moment I thought I&#39;d walked into a group of other sightseers. </p>\n\n<p>Eight figures stood before me in clusters of two or three. They were the farthest thing from the gorefests I was expecting. No, these statues were dressed like... well, like me. Shorts and shirts and tank-tops suited to summertime. One figure had a windbreaker tied around its waist and scuffmarks on its sneakers. Another had a pair of sunglasses pushed up to reveal a glassy stare. </p>\n\n<p>It took me a moment to register that they were just exhibits, so obviously fake once you got past their normal clothes. So why couldn&#39;t I shake off my discomfort? Two of them were turned right towards the stairs, so it seemed they were staring back at me: a woman holding onto a little girl&#39;s hand, both sporting cheap blonde wigs and false eyelashes as if to distract from the abysmal craftsmanship of their faces. </p>\n\n<p>When this was over, I planned to ask the guy behind the counter—Chris, wasn’t it—\nexactly what was up with this section of the museum. Had I wandered down into a storage closet? I considered turning around as I took a long drink from my water bottle. It was hot down here, starting to feel humid too, but it was still better than what was waiting outside. Better to finish off the tour, I decided. Besides, my curiosity had been piqued.</p>\n\n<p>The next room was a scene plucked right out of suburbia: a family sitting down to lunch around a long mahogany table. A wax Stepford wife setting down plates, with three kids and a husband sitting in chairs next to her. There was even a wax dog begging for plastic scraps underneath the table. </p>\n\n<p>I froze in place, fixated on the dog. With his mottled white-and-brown fur, he looked a little like my childhood pet, Coco. The way he was standing up on his hind legs was just like Coco, too, and I smiled with the nostalgia of the moment before realizing with a start that I hadn&#39;t thought about Coco for the better part of five years. My feet moved faster of their own volition, carrying me out of the room.</p>\n\n<p>In the next area, a wax couple, boyfriend and girlfriend, cuddling together on a threadbare couch. The TV in front of them was tuned to rumbling static. I walked a slow circle around the pair. The guy had one arm thrown over the back of the couch and the girl was leaning against him. Sure, they were only wax, but I felt oddly voyeuristic anyway, like I was intruding on an intimate moment. It was a strange contrast of artifice and romance.</p>\n\n<p>I vaguely realized that the layout of this place didn&#39;t make sense—I should&#39;ve been circling, not walking further and further in one direction as if there was no end in sight. <em>Maybe you misjudged the size of the building</em>, I reasoned, but I didn’t give it much thought. I felt a little uneasy, but there was an itch in my brain, and I wanted to scratch it. I kept going.</p>\n\n<p>The scenes began to bleed into one another. Each one brought on an echo of my own life, ringing hollow between my ears.</p>\n\n<p>A worker dressed in a blue shirt and trousers, typing away in a cubicle. (my first job—a computer programmer at a small firm)</p>\n\n<p>A group of children at a sleepover, surrounded by bowls of prop food and board games. (my friend Tyler&#39;s tenth birthday party)</p>\n\n<p>A wedding. The bride had on too much makeup; the groom&#39;s tuxedo was wrinkled. A three-tiered cake of finest plastic sat behind them on a silver platter. (my mother&#39;s second wedding)</p>\n\n<p>The displays of everyday life were mingled with lone statues like the one I&#39;d seen in the first room, looking aimless and lost despite being rooted to the ground. Statues of all ages and colors. </p>\n\n<p>I didn&#39;t understand what they added to the experience, and I didn&#39;t stop to try and figure it out. My pace was quickening now, sped up by the desire to escape the oppressive heat, but each successive room only seemed warmer than the last.</p>\n\n<p>I wiped at my forehead and my hand came away dampened with sweat. My shirt was clinging to me like a second skin, dark patches spreading at my underarms and back. This place was a damn oven. I braced myself against a wall, inhaled deeply, and felt my chest strain with the exertion. </p>\n\n<p>What was happening to me? I needed to take a rest. I needed to sit down. I trudged on, bumping into the wax facsimiles of people and places and things.</p>\n\n<p>As if the museum had read my mind, I walked straight into the back of a chair. I looked up. I&#39;d come to another square table, this one much larger than the last. Big enough to fill up the whole damn room. All along its perimeter, wax figures sat in simple wooden chairs, hands crossed on their laps and heads tilted towards me. Expectant. Hungry. At the far wall was a door bordered in red light, like the source of illumination was straining to get out.</p>\n\n<p>A sensation of warmth, of <em>longing</em>, traced its way up my spine. I shuddered. There were too many statues to count here, but a few faces stood out: one girl looked just like my sister. Another like my childhood best friend. A couple that bore more than just a passing resemblance to my mother and father. </p>\n\n<p>There were strange faces, too, about as familiar as department store mannequins. Yet there were all turned towards me. </p>\n\n<p>What did they want? </p>\n\n<p>I tore my eyes away from my <em>(not)</em> parents and <em>(not)</em> sister and saw there was one empty chair at the far end of the table. They were waiting, alright. Waiting for me to take my seat.</p>\n\n<p>You&#39;re thinking that I&#39;m crazy. Wondering why I didn&#39;t turn tail. See, you wouldn&#39;t understand unless you were there too. There was something magnetic about that room, seductive as honey, and I couldn&#39;t have resisted if I wanted to, any more than a moth can resist the pale blue glow of a bug zapper. </p>\n\n<p>The air was thick was the scent of something alive, something that only the primal, animal side of my brain could taste. I closed my eyes and let my body react. It was the smell of the innermost reaches of a burrow, where even the soil underfoot is ripe and pulsating. A womb.</p>\n\n<p><em>You’re losing it</em>, I told myself. I was right—it was insane.</p>\n\n<p>As insane as it was intoxicating.</p>\n\n<p>I rested my hand against the door and hissed at the heat radiating off it. Upon contact, disjointed words fluttered through my mind, but it wasn&#39;t me who was thinking them. More like an internal whisper. </p>\n\n<p><em>BIRTH</em>, the voice crooned. <em>NEW BLOOD. I HUNGER.</em></p>\n\n<p>The animal inside shook with desperation. It wanted me to tear my way inside. To succumb to the tidal force of Her hunger. To be reborn anew as Her child.</p>\n\n<p><em>What...?</em></p>\n\n<p>I jerked my hand away from the door reflexively. I blinked, took a step back, and realized I was shaking violently, sweat pouring down my neck in rivulets. The hell had happened? I&#39;d lost myself for a second there. Seen... no, <em>felt</em>, something that I wasn&#39;t meant to.</p>\n\n<p>A switch had been flipped. Since coming down the stairs, I&#39;d felt moments from squirming out of my skin, but now that prickle of unease erupted into full-blown horror. There was one word in my mind now, and it was my own thought, not the whisper of some arcane force living in the basement of a broke-down roadside attraction. <strong><em>RUN</em></strong>. </p>\n\n<p>I backed up a few steps, straight into the empty chair. The impact broke me from my trance fully, and I turned around, my legs springing into action before my mind could. I ran out of the room. I could hear an angry shudder behind me, and for a split moment I was subsumed into the all-encompassing rage of whatever lurked behind that door; I wanted blood at my hands, I wanted death—</p>\n\n<p>Then it was over, and I was panting, tearing my way through the fake cubicle and the fake sleepover and the fake wedding, up the stairs and past Freddy and Jason. I ran out of the lobby, not stopping to wonder where the teen behind the counter had gone. I didn&#39;t stop running until I was heaving inside my car door. It was disgustingly hot, but this felt normal, not the airless damp heat of the hell I&#39;d just emerged from.</p>\n\n<p>I shifted my car into gear and then I was off, hurtling down the hard-baked asphalt as fast as my car could handle. The speedometer didn&#39;t dip under 120 until the museum was out of sight. I think only then did I really breathe, and it was like all the tension left my body in a shuddering gasp.</p>\n\n<p>When I arrived at my mother’s house that night, I didn’t say a word of what had happened.</p>\n\n<p>I’d like to tell you I went back, solved the mystery, or maybe just sobered up from a bad acid trip. But none of that happened. Truth is, I still think about that museum, time to time. It&#39;ll catch me at the most unsuspecting of times: when I&#39;m lying in bed moments from falling asleep, maybe, or when I&#39;m showering. </p>\n\n<p>I think of a room bathed in red light, and a chair beckoning me forward.</p>\n\n<p>And I think, <strong><em>RUN</em></strong>.</p>\n</div>\n","author":"crystakat"}