{"rank":"42","title":"Uninhabited","id":"8keysi","url":"/r/nosleep/comments/8keysi/uninhabited/","time":"1526664794000","body":"<div class=\"md\"><p>You think you know everything about why Antarctica is uninhabitable: It&#39;s too cold for humans and for growing crops, it&#39;s dry as hell which is why it&#39;s classified as a desert, and it gets constant daytime and nighttime for weeks and even months during the winter and summer in the Northern and Southern Hemispheres respectively. </p>\n\n<p>While that may be true, there is a whole other reason why Antarctica is not suitable for human life: the Inhabitant. </p>\n\n<p>I worked at a research station in the western base of the Larsen Ice Shelf, a few thousand miles from the Falkland Islands in lower South America. </p>\n\n<p>The closest other human being was in the eastern base of the Larsen Ice Shelf. She was a woman in about her late twenties or early thirties. Her name is S-4. We&#39;ve grown very close together over the past 3 months we&#39;ve been stationed here, even though we never met in person. Our bond, however would be cut short. </p>\n\n<p>It was Day 88 here in Antarctica, only twelve days until me and S-4 are dismissed. I was supposed to run tests on the wind, ground, air pressure, climate, etc. I was a climatologist. S-4 researched the sky, clouds, meteors, Southern Lights, etc. She was a meteorologist. Anyway, at 3:00am PT she radioed me... </p>\n\n<p>&quot;S-2? S-2, come in. Over.&quot; S-2 means Station 2, my codename referring to my assigned station. Her station was Station 4. </p>\n\n<p>A little irritated about being woken up early in the morning, I got out of my cot and shuffled over to the radio. </p>\n\n<p>&quot;S-4, what is it?&quot;, I sleepily croaked. &quot;It had better be important enough to justify you waking me up at...&quot; I checked the clock, &quot;3:00 in the morning... Over.&quot; </p>\n\n<p>&quot;Quit whining and look out your window, S-2. Over&quot;, she replied. This was basically our relationship during our time stationed here: sass and banter, back and forth. It hasn&#39;t bothered me or her, so it works out. </p>\n\n<p>I turned the lamp on and slowly walked towards the window, still waking up. I rolled up the blinds and found... nothing. Just a sad, white, barren landscape in the dark of night. </p>\n\n<p>&quot;Very funny, S-4. I hope it was worth it waking me up for a good laugh. Over&quot;, I said with a <em>subtle</em> hint of sarcasm. </p>\n\n<p>&quot;Look above you, dummy. Over.&quot;, She replied with the tone of sarcasm in her soft voice daring to challenge mine. </p>\n\n<p>I did so. What I saw made the living conditions of my job entirely worth it. That, and talking with S-4. </p>\n\n<p>It was a meteor shower, a damn pretty one at that. S-4, being the meteorologist, would&#39;ve killed to see something like this. I could see why she would wake me for this. </p>\n\n<p>&quot;Holy shit... Over&quot;, I spoke into the radio. </p>\n\n<p>&quot;Holier-than-thou shit. Over.&quot; She was always the expert of banter. </p>\n\n<p>&quot;Ha-ha.&quot; </p>\n\n<p>A few seconds passed before S-4 said, &quot;S-2 you gotta say &#39;over&#39; after you say something in the radio. Over.&quot;</p>\n\n<p>Feeling a good round of Sass and Banter coming up, I remarked, &quot;I have to say what, S-4? Over.&quot; </p>\n\n<p>S-4 quickly caught on. We were experienced in this. &quot;You have to say the word &#39;over&#39;, S-2. Over.&quot; </p>\n\n<p>&quot;S-4, I think your signal is weakening. Could you please repeat that? Over.&quot; </p>\n\n<p>&quot;The word, in quotations, &#39;ov&#39;--... What the fuck?&quot; </p>\n\n<p>At first I almost thought she was fucking with me, but the seriousness in her voice made me think otherwise. She <em>never</em> spoke in a serious tone whenever she was joking. <em>Never</em>. </p>\n\n<p>A pause. &quot;...S-4? W-what&#39;s wrong?.. Over.&quot; </p>\n\n<p>Another pause. &quot;...S-4, please respond. Over.&quot; </p>\n\n<p>A final pause. &quot;...Station 4, what&#39;s happening?&quot; </p>\n\n<p>I worried so much that I forgot to say &quot;over&quot;. </p>\n\n<p>She finally picked up. &quot;What--Oh! Yeah, yeah. Sorry, S-2. Just... look to the east, will you?&quot; </p>\n\n<p>I looked to the direction of her station. I couldn&#39;t see anything for a moment before a bright blue light shone over the horizon. It was almost like a flare. </p>\n\n<p>Before I could say anything to S-4, the station shook violently. It lasted no more than ten seconds before it ceased. It could&#39;ve been an earthquake, but knew better. The meteor shower, the bright light near Station 4, then the quaking were just all too... connected to be a coincidence. </p>\n\n<p>I took the chance to speak, &quot;Did you feel that too, S-4? Over.&quot; </p>\n\n<p>A few moments passed before she replied, &quot;-tion 2, you there? Over.&quot; </p>\n\n<p>&quot;Yeah. I said did you feel that? Over.&quot; </p>\n\n<p>&quot;Yeah, I did. It was much closer to me. I think the quakes temporarily knocked out my comms, but I managed to get them back online. Over&quot; </p>\n\n<p>I struggled to find the words, so I settled on, &quot;I don&#39;t think those were quakes, S-4. Over.&quot; </p>\n\n<p>&quot;Me neither. Over.&quot;</p>\n\n<p>&quot;You said it was closer to you, right? Then it hit me a few seconds after you? Over.&quot; </p>\n\n<p>&quot;...Yeah. You&#39;re suggesting those were shock waves? Over.&quot; </p>\n\n<p>&quot;Exactly. Over.&quot; </p>\n\n<p>A moment passed, &quot;Hmm, I&#39;ll see what S-3 has to say about this. In the meantime, you can go back to bed. Over.&quot; </p>\n\n<p>&quot;I&#39;m already wide awake now after that. Over.&quot; </p>\n\n<p>&quot;Hah.&quot; </p>\n\n<p>She forgot to say &quot;over&quot;. I wasn&#39;t in the mood for another round of Sass and Banter. &quot;Right. So... In the meantime. Over.&quot; </p>\n\n<p>&quot;In the meantime... Over.&quot; </p>\n\n<p>Day 90, ten days until dismissal. It was about evening from what I could tell. About fifteen miles south was a snowstorm heading our way. Because of that, I&#39;ve had to conduct research like there was no tomorrow. How ironic. </p>\n\n<p>After what felt like an eternity, S-4 radioed me, &quot;Afternoon, Station 2. Over.&quot; </p>\n\n<p>I picked up the radio, &quot;Hey, S-4. Did you get any feedback from S-3? Over.&quot; </p>\n\n<p>&quot;I did indeed. He told me the shockwave hit him after me, and before you. So the epicenter of the blast is definitely closest to me. He also told me a whole chunk of ice about a quarter-mile wide was melted by the impact. Over.&quot; </p>\n\n<p>&quot;You&#39;re safe though, right? Over.&quot; </p>\n\n<p>&quot;Yes, I&#39;m fine, S-2. No need to worry about me... Another thing, there&#39;s been a sort of flare-like smoke billowing from the site for about... 38 hours now. </p>\n\n<p>I took that chance to glance at the clock. It said 3:00am... That was impossible... Unless... </p>\n\n<p>&quot;S-4, it says 3:00am on my clock. What does it say on yours? Over.&quot; </p>\n\n<p>&quot;3:00am? Shit, uhh... It says 1:00am on my clock... O-over.&quot; </p>\n\n<p>&quot;Shit, our clocks were fucked up by the shockwave. Check in with Station 3 and see if his clock is fucked up too.&quot; </p>\n\n<p>We both forgot to say &quot;over&quot; from then on. A couple minutes passed. The storm gradually got closer and closer. Antigone picked up again, &quot;Alright, S-3 says his clock is fucked up as well.&quot; </p>\n\n<p>I contemplated that for a moment, &quot;Shit. W-what about Main Base?&quot; Main Base was at the edge of the Larsen Ice Shelf, 100 miles away from us. </p>\n\n<p>She yelled in a panicked voice, &quot;I tried them, and I couldn&#39;t get a hold of them! Our comms are down! The only reason we can talk to each other is because we&#39;re connected by cables and wires!&quot; </p>\n\n<p>&quot;Well what the fuck are we supposed to do?&quot; </p>\n\n<p>&quot;I don&#39;t know, just-- We&#39;ll stay here, okay? They&#39;re probably working comms maintenance at Main Base. So I&#39;m sure we&#39;ll be fine if we just wait it out.&quot; </p>\n\n<p>Famous last words. </p>\n\n<p>Day 91, or so I thought. It could&#39;ve still been Day 90 or Day 93 for fuck&#39;s sake. Our clocks were still off because of our lack of communication with Main Base, so we can&#39;t be sure exactly what time it is. The snowstorm came overnight. There was nothing but darkness and fast-falling snow outside. It was freezing inside too, which makes it a real bitch to focus on my research of the storm. I guessed it was about early morning. A couple hours into my research, a male voice I hadn&#39;t heard in a long time sounded from the radio. I knew who it was. It was Station 3. </p>\n\n<p>His voice had a sense of dread and urgency in it, &quot;Stations 2 and 4, please pick up the radio. It&#39;s urgent. Over.&quot; </p>\n\n<p>I was the first to respond, &quot;Station 2 here. What is it S-3? Over.&quot; </p>\n\n<p>&quot;S-2, good. Station 4, are you there? Over.&quot; </p>\n\n<p>A couple seconds passed before S-4 answered, &quot;I&#39;m here, S-3. What seems to be the problem? Over.&quot; </p>\n\n<p>S-3 responded, &quot;S-2 and 4. Good. I&#39;ve been observing the activity of the meteor impact site, and it&#39;s just-- well-- fuck, I don&#39;t know how to explain it!&quot; </p>\n\n<p>&quot;S-3, calm down and tell us what exactly did you see?&quot; I asked him. </p>\n\n<p>He sounded scared shitless, &quot;Well, f-first there was a red glow coming from the site. It was so intense, that it was glowing <em>through</em> the ice... Then th-there was this one f-figure slowly emerging from the epicenter. It wasn&#39;t walking or moving or--or anything! It was just fucking floating!&quot; </p>\n\n<p>S-4 responded, &quot;S-3, can you describe what the figure looked like?&quot; </p>\n\n<p>&quot;It--it looked like a human, I mean it had the shape of a human, but... that&#39;s about it. It was so... so fucking huge... like a fucking tower... And it h-had a big red, glowing dot on its face, like a spotlight.&quot; </p>\n\n<p>&quot;S-3, where is it now?&quot; I asked him. </p>\n\n<p>A pause, &quot;...Umm, hold on... Oh--oh no...&quot;, he said in a hushed voice. </p>\n\n<p>&quot;What is it?&quot;, S-4 asked. </p>\n\n<p>&quot;S-4, lock all your doors and windows and shut all the blinds! You do so as well, S-2!&quot; He was now permanently panicked. </p>\n\n<p>&quot;What?! Why?&quot; </p>\n\n<p>&quot;It&#39;s heading towards you!&quot; </p>\n\n<p>That caught us all by surprise. That... <em>thing</em>, whatever it was, was heading towards Station 4. I couldn&#39;t imagine what it would do when it got there. I wanted so desperately to help, to do <em>anything</em>, but I couldn&#39;t. I was trapped in my Station. So was Station 3. So was Station 4. </p>\n\n<p>There was a sound of clattering coming from the radio. I assumed S-4 dropped hers in the rush to lock herself in her Station. We all followed suit. </p>\n\n<p>S-4 picked up again, &quot;Okay, I&#39;ve done it. W-what now?&quot; She was just as afraid as the rest of us. </p>\n\n<p>S-3 quickly responded, &quot;Turn off your radio! Destroy it if you have to! That... creature might hear you!&quot; </p>\n\n<p>S-4 started crying. I couldn&#39;t blame her. &quot;I don&#39;t want to be alone... I&#39;m scared. I&#39;m scared. I&#39;m sc--&quot; </p>\n\n<p>A dreadful pause echoed through the radio. I whispered, &quot;...S-4, what&#39;s happening?&quot; </p>\n\n<p>I could hear S-4 trying her best to contain her crying, but it was futile. She whispered back, &quot;...There&#39;s a beam... A red beam of light encircling my Station...&quot; </p>\n\n<p>S-3 whispered after another dreadful pause, &quot;Station 4, don&#39;t. Fucking. Move.&quot; </p>\n\n<p>She didn&#39;t respond. </p>\n\n<p>&quot;S-4?&quot; He said. </p>\n\n<p>A pause. </p>\n\n<p>S-3 gasped, &quot;Oh, no. No, no, no, no, no, no. Please, God, no.&quot; </p>\n\n<p>&quot;S-3, what happened?&quot; I asked with more dread than I could bear. </p>\n\n<p>No amount of words could describe what I felt after I heard Station 3 say the words, &quot;Station 2... Station 4... is gone. It just... disintegrated in an instant.&quot; </p>\n\n<p>&quot;.....What?&quot; </p>\n\n<p>Twenty minutes passed without him answering until he finally said, &quot;Oh shit. No, no! No, no , no!!! FUCK!&quot; </p>\n\n<p>I didn&#39;t have to ask to know what was happening. I grabbed my binoculars and peaked through the window blinds facing east. In the horizon, I saw Station 3. And even further away, I saw what S-3 had been talking about: the upper torso of the large, human shaped figure the size of a goddamn tower with a glowing crimson circle where the face should&#39;ve been, like a spotlight. </p>\n\n<p>I dropped my radio, S-3 still begging for mercy from the tower to no avail. I didn&#39;t want to watch, yet I couldn&#39;t take my eyes off the scene. The tower&#39;s blood-red spotlight shone over Station 3 and, after half a minute, left absolutely nothing of Station 3. No debris, no dust, no ashes, nothing. </p>\n\n<p>I was too horrified to move until the red spotlight pointed directly at me. I yelped and fell backwards. It would be at least thirty minutes before the tower reached my Station. I crawled into the corner, trying to find the words to describe my fear, my hope that this was just a nightmare, but deep down I knew... it wasn&#39;t. </p>\n\n<p><em>end of transmission</em></p>\n\n<p>I&#39;m done listening to the recording of the last three-four days, reminiscing my time here, with S-4. Now those days have been obliterated. It&#39;s been about fifty minutes since Station 3 was destroyed, and I&#39;m still waiting for my turn. </p>\n\n<p>That just may come soon, as a see a very faint glow of red, shining through the blinds, getting more and more intense as time passes. The more intense the glow gets, the more I hear a sort of electrical humming sound. Now a shadow has passed through the glow and the blinds. I know... that in a few moments, this will all be over...</p>\n\n<p>Over.</p>\n</div>\n","author":"Breezydeau"}