{"rank":"142","title":"The WOW! Signal","id":"8kezxr","url":"/r/nosleep/comments/8kezxr/the_wow_signal/","time":"1526665043000","body":"<div class=\"md\"><p>Due to the very classified nature of this post, I will not be revealing any names involved, some of which can be found in the public record if you look it up for yourself.</p>\n\n<p>I will tell you that I work for a certain space agency, in a department that handles all incoming space anomalies and occurrences. The nature of our work is simple, we find things in space that our superiors deem to be too important to be released in the public sector, and we make them disappear. Now, it may be weird to some to hear it straight from the horses mouth, and of course I am breaching any number of confidentiality agreements and clauses (these are not taken lightly around here), but the very nature of what I need to tell you is more important than whatever will happen to me by the time this information spreads.</p>\n\n<p>The reason for my breach of contract is simple. Everyone has heard of the wow signal correct? In simplest terms, it was a narrow band radio signal picked up by Ohio States big ear telescope back in 1977. The &quot;only&quot; signal strong enough to be warranted as having an extraterrestrial origin. Now YOU have been mislead of course. You were told that the signal was never traced to a single point of origin, just that it came from the Sagittarius b2 region, well thats simply not true. We have the exact location and its been a closely guarded secret for 40+ years now. </p>\n\n<p>What you may also have heard is that the signal was never deciphered and was just a short burst signal that was detected and that&#39;s that right? Wrong again. Upon receiving word from Ohio State that the signal was intercepted, we immediately traveled to and took possession of some very sensitive material that related to the transmission, including a recording of the actual signal that came from a satellite not previously mentioned to the public. One that was able to receive and record the transmission in real time and store it for later analysis. This is one of the many types of things we do that you, the public, aren&#39;t notified of. Still with me? Good, because for the last 40+ years we have been working to decipher that very message. Cross comparisons to every known language and alphabet here on earth were carried out, thousands of times. We worked endlessly to figure out just what this message was. If only we knew what we were getting ourselves into...</p>\n\n<p>Just a few short weeks ago, a senior analyzer within our division had a breakthrough. He managed to crack a piece of the transmission which helped to then figure out the rest of the language (yes you read that correctly, an intelligent language). Which has led me to here and why I need to warn as many people as I can. Whatever these things are they know all about us, and what they are capable of or what there intentions are have yet to be determined as the message was vague, but nonetheless threatening.</p>\n\n<p>The signal that you know of as 6EQUJ5, when deciphered through the actual transmission simply states.... WE&#39;VE BEEN WATCHING, WE ARE COMING.</p>\n\n<p>Please understand that at this time we have no idea what it is that&#39;s coming, or what will happen when they arrive. Sagittarius constellation is 5000 light years from earth, which is unreachable with any technology we have, but just recently, scientists have discovered some gravitational disturbances coming from the direction of you guessed it.... the Sagittarius constellation. These disturbances have yet to be made public and I seriously doubt they will be, as they are happening right inside our galactic neighborhood. The disturbances are eerie enough, but the thing that has me ready to throw away my entire career to reveal this to you is the sheer size of the disturbances. </p>\n\n<p>Look, something big is coming, and soon. The disturbances are becoming more frequent and are increasing in size the more time goes on. Prepare, disclosure may be an important topic to most, but this if whatever this is is a hostile force, it may be the one thing we wish we never asked for.</p>\n</div>\n","author":"_NameGoesHere_"}