{"rank":"191","title":"There Is Some Sort Of Entity Studying The Human Race, And I Think We Are In Danger","id":"8kf0hv","url":"/r/nosleep/comments/8kf0hv/there_is_some_sort_of_entity_studying_the_human/","time":"1526665166000","body":"<div class=\"md\"><p><strong>Dr. Eliza</strong> Miller  </p>\n\n<p><em>I wanted to get this information out there, to protect anyone who might be reading this. The following patients were found naked in the woods, eating raw animal remnants. They were each exhibiting extreme paranoia and off the wall delusions. What follows is a transcript of the therapy sessions that I conducted between each of the patients.</em>  ________________________________________________  </p>\n\n<p><strong>Date: May 3rd, 2018 – Time: 11:32am – Note: Patient is sitting 3 ft. away from a blank wall. Patient is staring at blank wall, laughing.</strong>     </p>\n\n<p>Dr. Miller: Hi, M******.  I’m Dr. Miller, it is a pleasure to meet you today.  </p>\n\n<p><em>(patient slowly turns head to face me with a smile on her face. No response.)</em>  </p>\n\n<p>Dr. Miller: I want to talk to you about what happened earlier today.  </p>\n\n<p>Patient: They’re going to take you, also.  </p>\n\n<p>Dr. Miller: Who?  </p>\n\n<p><em>(Patient is visibly shaken.)</em>  </p>\n\n<p>Patient: Go away! Go awaaaaaaaaaaay!  </p>\n\n<p>Dr. Miller: Hey, hey…. Everything is ok, I’m here to help you. Who are you referring to when you say, “they”?  </p>\n\n<p>Patient: Shit. Damn. Fuck. Don’t you plug me. Don’t you do it!  </p>\n\n<p><em>(Patient seems to be suffering delusions. Patient is showing visible symptoms of ticks. Could possibly be suffering from Tourette’s syndrome)</em>  </p>\n\n<p>Dr. Miller: Ok, calm down. Let’s just take things one question at a time. We will start from the beginning. How did you end up in the forest?  </p>\n\n<p>Patient: They come at night. They’ll come for you too, now.  </p>\n\n<p>Dr. Miller: Who M******?  </p>\n\n<p><em>(Patient points with one finger into the air, towards the ceiling, then starts hysterically laughing.)</em>  </p>\n\n<p>Patient: They’re watching. They’re always watching. They make me do things, bad things. Please make it stop.  </p>\n\n<p><em>(Patient is starting to cry)</em>  </p>\n\n<p>Dr. Miller: I want to help you M******. That’s why I’m here. To help. Tell me who they are. Who took you?  </p>\n\n<p>Patient: Shhhhh. Shhhhh…..They’ll hear us. I can’t tell you anymore.  </p>\n\n<p>Dr. Miller: Nobody’s going to hear us. I need you to tell me what happened so I can protect you, so that nobody can ever hurt you again. I just need you to tell me a little bit more.  </p>\n\n<p>Patient: They’ll kill me. They’ll make me do it. They said they’ve made a ton of people do it who have told.  </p>\n\n<p>Dr. Miller: Why were you eating the animals in the woods? Were you hungry? Did they starve you?  </p>\n\n<p>Patient: They made me. They’re studying me. They’re studying us now. Right now. They see everything. They hear everything. I’m going to die. Oh my god, <em>(sobs)</em> I’m going to die.  </p>\n\n<p>Dr. Miller: M****** calm down. It sounds like you’re suffering, and I can get you some medicine to help. Wouldn’t you like that? To not suffer anymore?  </p>\n\n<p><em>(patient nods head while still sobbing)</em>  </p>\n\n<p>Dr. Miller: Ok good. I’ll be sure to fill a prescription for you. I want to talk a little bit more about the woods. What did the people look like who made you do this?  </p>\n\n<p>Patient: They aren’t people.  </p>\n\n<p>Dr. Miller: What are they then?  </p>\n\n<p><em>(Static muffled through my tape recorder)</em>  </p>\n\n<p>Patient: Shhh, stop! They can hear you. They can hear us, right now. They’re going to come for you now. You shouldn’t have asked so many questions.  </p>\n\n<p>Dr. Miller: Who is going to come. Tell me, WHO is going to come??  </p>\n\n<p><em>(The static on my tape recorder is growing)</em>  </p>\n\n<p>Patient: You’ve done it. <em>(sobs)</em> Now you’ve really done it!  </p>\n\n<p>Dr. Miller: M****** you don’t have to worry. That’s just my tape recorder. The battery is probably just running low.  </p>\n\n<p>Patient: Oh no. You shouldn’t have said that.  </p>\n\n<p>Dr. Miller: Tell me what is going on.  </p>\n\n<p><em>(Patient is sweating profusely. Patient’s eyes are bulging out of her head.)</em>  </p>\n\n<p>Patient: <em>(Talking in a barely audible whisper.)</em> They hear us through the electronics. The static. That’s how they listen. That’s how they see. That’s how they see us.  </p>\n\n<p>Dr. Miller: Who is listening through the static? Who is they?  </p>\n\n<p>Patient: SHUT UP! SHUT UP! CAN’T YOU HEAR THEM COMING? THEY’RE COMING!!!  ___________________________________________________  </p>\n\n<p>We wrapped up the session at this point. The patient wouldn’t stop screaming, “they’re coming”. She was pinned down and given a sedative. We planned to continue therapy the next day, however, we never got the opportunity to finish. The patient was found dead in her room; suicide.  </p>\n\n<p><strong>Note: patient most likely had a lifetime of abuse that eventually caused her to have a mental breakdown.</strong>   ______________________________________________  </p>\n\n<p><strong>Date: May 10th, 2018 – Time: 2:11pm – Note: Patient is licking the bottom of his foot and moaning.</strong>      </p>\n\n<p>Dr. Miller: Hi, P***. My name is Dr. Miller. I’m here to talk to you about what you were doing in the woods last night.  </p>\n\n<p>Patient: You got shoes on?  </p>\n\n<p>Dr. Miller: Yes, I do. I see you took yours off.  </p>\n\n<p>Patient: They make me.  </p>\n\n<p>Dr. Miller: Who is they?  </p>\n\n<p>Patient: What’s that?  </p>\n\n<p><em>(Patient pointed to my tape recorder)</em>  </p>\n\n<p>Dr. Miller: This is my tape recorder. I’m using it to record our session.  </p>\n\n<p>Patient: Get it out of here.  </p>\n\n<p><em>(My recorder started gaining static)</em>  </p>\n\n<p>Patient: GET THAT FUCKING THING OUT OF HERE, NOW!!!  </p>\n\n<p><em>(Patient threw my recorder against the concrete wall, shattering it to pieces. The second half of the session is written from my memory.)</em>  </p>\n\n<p>Dr. Miller: Why don’t you like the recorder?  </p>\n\n<p>Patient: Can’t tell you.  </p>\n\n<p>Dr. Miller: How come?  </p>\n\n<p>Patient: They’re listening.  </p>\n\n<p>Dr. Miller: Who is listening P***? I need you to tell me who so I can help you.  </p>\n\n<p><em>(Patient looks up at the ceiling, then back down to me.)</em>  </p>\n\n<p>Patient: <em>(in a whisper)</em> From up there.  </p>\n\n<p>Dr. Miller: Up where? I need you to tell me where.  </p>\n\n<p><em>(I forgot to turn my phone to silent. My phone started ringing which put the patient on edge.)</em>  </p>\n\n<p>Patient:  You fucking bitch! Get that thing out of here before they hear us!  </p>\n\n<p>__________________________________________  </p>\n\n<p>The session ended after this. The patient dove at me and tried to attack. He was placed in restraints until he calmed down. Unfortunately, he died in the middle of the night, apparently another suicide. Both patients seem to think that electronics are bad. Both seem to think people are watching them and listening to them through the electronics.  </p>\n\n<p><strong>Note: Patients may be experiencing some sort of subset of schizophrenia. Possibly a drug induced psychosis. Will request for autopsy on both patients.</strong>   </p>\n\n<p><em>\\</em>Personal side note – I have been having strange things happen. These patients are starting to get to my head. I went home last night and my toaster…YES, my toaster started making a static noise. I’m sure it is all in my head, but I do find it strange. I could be possibly getting sympathy symptoms. Will keep an eye out for myself.*</p>\n\n<p>_________________________________________________  </p>\n\n<p><strong>Date: May 16th, 2018 – Time: 4:43pm – Note: Patient is laying on the floor face up. She seems to be talking to someone who isn’t there.</strong>      </p>\n\n<p>Patient: <em>(talking to herself)</em> I hope you can sing. They like it when you sing. It might stop them from plugging you.  </p>\n\n<p>Dr. Miller: Excuse me. Hi, I’m Dr. Miller. I’m your therapist.  </p>\n\n<p>Patient: Miller. That’s a pretty name. I hope you can sing Miller. They’re going to come for you next. That’s what they tell me.  </p>\n\n<p>Dr. Miller: Who is they?  Patient: Hehehehehe, CAN’T SAY!  </p>\n\n<p><em>(Patient pointed to my phone in hand)</em>  </p>\n\n<p>Dr. Miller: This is my phone. I’m using it to record our session.  </p>\n\n<p>Patient: They’re watching us. They’re listening to us. Right now, in fact. I hear their thoughts, they are trying to decide.  </p>\n\n<p><em>(My phone had a random static sound come out of the speaker.)</em>  </p>\n\n<p>Dr. Miller: What are they trying to decide?  </p>\n\n<p>Patient: How long they want to let you play your game with us.  </p>\n\n<p><em>(Patient must have somehow got word that I was speaking with likeminded individuals as herself.)</em>  </p>\n\n<p>Dr. Miller: Oh, really?  </p>\n\n<p>Patient: SHIT. They’re coming.  </p>\n\n<p>Dr. Miller: Where are they coming from?  </p>\n\n<p>Patient: They want you to think we are crazy, it’s a game to them. Like, when you tease someone. They have complete control of this game. They are teasing you.  </p>\n\n<p>Dr. Miller: Who is making you do this? Who is making you say this? I need you to tell me who so I can help you.  </p>\n\n<p><em>(Patient looks up at the ceiling.)</em>  </p>\n\n<p>Patient: <em>(in a whisper)</em> No. No…They’re here for me.  </p>\n\n<p>Dr. Miller: WHERE? TELL ME WHERE!  </p>\n\n<p>Patient: <em>(in a whisper)</em> From up there.  </p>\n\n<p>Dr. Miller: Up where? The sky?  </p>\n\n<p>Patient: Yes  </p>\n\n<p>_____________________________________________________  </p>\n\n<p>Patient immediately grabs pen from my hand and jams it in her eye ball. The nurses rushed in and tried to save her from the blood loss, but the pen made it into her brain. This was dubbed another suicide.  </p>\n\n<p><strong>Note: Each patient has pointed up. My most current patient confirmed that they come from the sky which makes me believe that all other patients were referring to the sky as well. Possibly outer space. Will request for autopsy on both patients.</strong>   </p>\n\n<p><em>\\</em>Personal side note – I don’t know how to say this without sounding crazy, but I feel as if the static is following me. Every time I pass an electrical device, static follows. I’m intrigued to solve this case, but I must look at this from a psychological view point. This is obviously affecting me in a way that is unhealthy. I feel like I’m becoming paranoid. I feel like I’m being watched. I know I’m speaking nonsense, but what if there’s more to this? Will keep journaling.*    _______________________________________________  </p>\n\n<p><strong>Date: May 18th, 2018 – Time: 10:12am – Note: Patient is sitting in her hospital room, staring at a TV that has static playing.</strong>      </p>\n\n<p>Dr. Miller: Hi there, I’m Dr. Miller.  </p>\n\n<p>Patient: Shh. It’s getting to the good part.  </p>\n\n<p>Dr. Miller: What are you watching?  </p>\n\n<p>Patient: Them.  </p>\n\n<p>Dr. Miller: What are they doing?  </p>\n\n<p><em>(Patient looks at me with a fearful gaze)</em>  </p>\n\n<p>Patient: You can’t ask that. You’re going to make them mad.  </p>\n\n<p>Dr. Miller: Who is they?  </p>\n\n<p>Patient: <em>(starting to cry)</em> They are going to hurt me if I tell you.  </p>\n\n<p>Dr. Miller: Nobody is going to hurt you. Just tell me what is going on so I can stop this from ever happening again.  </p>\n\n<p>Patient: Please help me. They made me do stuff, bad stuff. I don’t like doing it, but they make me. Please make it stop!  </p>\n\n<p>Dr. Miller: I’ll make it stop. Just tell me where they are at. Tell me who they are.  </p>\n\n<p>Patient: They’re everywhere. Always watching, always listening. They brought me into the sky, and ever since I have been forced to do things. If I don’t do it, I get punished.  </p>\n\n<p>Dr. Miller: Why do they make you do these things?  </p>\n\n<p><em>(Patient is full on sobbing)</em>  </p>\n\n<p>Patient: To study the human mind. They will push and push us to do more disgusting, embarrassing, and fowl things. They study what it does to our brain, they study what it does to the viewers brain. I’m scared doctor. I don’t want to be forced to do anything else.  </p>\n\n<p>Dr. Miller: You don’t have to do anything. You’re safe here. It’s over. They can’t get you.  </p>\n\n<p>Patient: You’re wrong. They’ll make me kill myself if I don’t listen.  </p>\n\n<p><em>(Patient starts barking like a dog. She starts foaming at the mouth, then attempts to bite me.)</em>  </p>\n\n<p>Dr. Miller: R*** snap out of it! STOP! You don’t have to do this. They can’t control you! Stop it! Do you hear me? Stop! I’m commanding you to stop this, right now!  </p>\n\n<p>Patient: <em>(Barks)</em> Help me! <em>(Barks)</em> Grrrrrr. Make it stop!  </p>\n\n<p>Dr. Miller: You are in control. Listen to me, you are in control!  </p>\n\n<p><em>(Patient gets on all fours, starts running around the room, then lifts leg up to pee on the floor.)</em>  </p>\n\n<p>Patient: Grrrr. They’ll kill me if I stop! Help! Grrrr. <em>(Barks)</em>  </p>\n\n<p>Dr. Miller: STOP!  </p>\n\n<p>Patient: I don’t have to do this.  </p>\n\n<p>Dr. Miller: No. Come sit with me. See? You did it, you are in control. You are safe here. Nothing bad happened.  </p>\n\n<p>Patient: <em>(heavy breathing)</em> They’re coming for me. </p>\n\n<p>______________________________________________________  </p>\n\n<p>Patient wrapped her hands around her jaw and snapped her own neck. This was written up as another suicide, but I just can’t agree. I saw the fear in her eyes. I saw how she fought so hard to keep control of her actions. I saw the fear in her eyes when she wrapped her hands around her jaw. I couldn’t save her. I couldn’t stop it. She told me this would happen. I can’t help but feel responsible.  </p>\n\n<p><strong>Note: I’m starting to believe that there is some sort of extraterrestrial phenomenon going on. This last patient of mine tried to be sane, I could tell that some other force drove her to do these things. I’m starting to wonder if each patient was truly sane all along. Maybe each patient was trying to warn me, trying to tell me that something was controlling them. We failed each one. We didn’t take them serious, we dubbed them as crazy. I feel responsible for each of their deaths.</strong>   </p>\n\n<p><em>\\</em>Personal side note – Weird things have been happening to me. I’m starting to hear more and more static. The static comes from random electronic devices. Sometimes it comes from the radio in my car, other times it’s the television. The thing that freaks me out the most is when it comes from my phone. How can a phone create static when it isn’t in use? I’m starting to get scared for my own safety. What if they were right, what if this entity really is coming for me next? My paranoia has skyrocketed through the roof, and I am becoming delusional. There is no way I am really hearing this static. Am I going crazy?*   _______________________________________________  </p>\n\n<p>All four of my patients have gone through an autopsy, and we finally got the reports back. I requested to be removed from this case after reviewing the findings.  </p>\n\n<p>The coroner found a bar code tattooed in each of their ear canals. The message seemed to be written in a language that nobody has been able to identify, not even the most experienced linguist. When around electronics, the barcode tends to glow a faint blue color which we haven’t been able to figure out why or how this is possible.  </p>\n\n<p>The government has put everyone that has worked on this case on a gag order. They are afraid that if word gets out, there will be mass hysteria. That’s why I’m writing on here to warn you.  I’m sitting here typing this on my laptop, because I know that they are listening to me. I’m afraid of what will become of me if I tell someone what’s happening to me. The static is constantly surrounding me, and I get these strange impulses to act out in bizarre ways. Sometimes I’ll feel like I MUST drink from the toilet bowl. If I don’t do it, I’m afraid they’ll kill me like they did the others.  </p>\n\n<p>I’m scared. I hear the static getting louder. I think they realize what I’m doing, they must be able to see what I’m typing. Oh my god, I think they are going to kill me tonight.  I have to wrap this up and fight for my life, please heed my warning.  </p>\n\n<p>There is some sort of extraterrestrial entity out there, studying us, and they aren’t here to play nice.</p>\n</div>\n","author":"briannaappling"}