{"rank":"309","title":"Nightshift At The Plant - The Unwelcomed Visitor","id":"8kf49e","url":"/r/nosleep/comments/8kf49e/nightshift_at_the_plant_the_unwelcomed_visitor/","time":"1526665969000","body":"<div class=\"md\"><p><a href=\"https://www.reddit.com/r/nosleep/comments/8k041i/nightshift_at_the_plant_thats_not_a_pony/\">That&#39;s not a pony ...</a></p>\n\n<p>After Chloe was born, I returned to work at the steel plant.  She went with me to work every night – I’d gotten the okay from the plant admin and my security company as well.  I was glad, because I had no babysitter and not quiet enough extra to afford the $300 a month for one.  Yes, Fred had told me him and his wife would watch her for me, but not all night long every single night I worked.</p>\n\n<p>Plus, I really didn’t trust strangers with my baby girl.</p>\n\n<p>Having her there with me was a boon, actually.  Most of the regular truckers who came through had kids of their own, but there were a few stragglers who didn’t.  A few of them had given me a hard time in the past, but with a newborn in a bassinet, it cut way back on heated discussions.</p>\n\n<p>Chloe was an easy baby.  She was awake when I was awake, went down easy for naps, and slept through the day.  She wasn’t fussy, and seemed fascinated by everything and everyone.</p>\n\n<p>I loved her fiercely.</p>\n\n<p>So did all the men who worked in the plant.</p>\n\n<p>“Selene, she’s going to be a beauty like her mama,” John teased me one night when he was taking his break in the guard house with me.  Chloe cooed and gurgled at him, her blue eyes tracking his face, as he stroked her wispy blonde hair and tucked her blanket in around her.</p>\n\n<p>I blushed.  “Oh, I don’t know, John,” I said.  “I’m hoping she looks like Micah.”</p>\n\n<p>He met my eyes then, a bittersweet smile appearing.  “Girl, one day you’ll meet someone else.  Someone who needs you and Chloe.  I know the death of your husband hit you hard, but I got a feeling down the road some guy’s going to come along and knock your socks off.”  Seeing the way my eyes glazed over, he winked.  “Maybe I’ll leave my wife and take the two of you and run off somewhere.”</p>\n\n<p>It made me laugh, and pulled me out of those memories.  “Beth would beat you half to death for that,” I said.</p>\n\n<p>“Ayuh, she sure would,” he conceded, grinning.</p>\n\n<p>My eyes went to the road leading out, and I remembered what I’d seen a few months ago.  “John, I want to ask you something, but I’m afraid you’ll think I’m crazy.”</p>\n\n<p>“Saw something, did you?” he asked, getting my full attention.  He nodded.  “This old plant, she’s seen a lot in her fifty years.  Fights, bad accidents, a few deaths even.  I imagine you just might see someone every once in a while.”</p>\n\n<p>“This wasn’t human,” I blurted out.</p>\n\n<p>Now I had <em>his</em> full attention.  “What did you see?”</p>\n\n<p>I sighed, looking out to the road again.  “It happened around four in the morning.  I was sitting here reading, listening to an instrumental playlist, and motion from the admin parking lot caught my eye.  I looked up, and John, I thought it was someone’s pony got loose at first.”  Taking a breath, and trying not to shiver with the memory of the thing, I pressed on.  “The fur was moth-eaten, and it didn’t have hooves.  It had paws.  It had a furry tail instead of a horse tail.  It was walking really slow, like it hurt to move.  When it reached the road, and turned, well it’s a wonder I didn’t go into labor from the fright.  It didn’t have a head, John, or a neck even.  It was just a torso with legs and a tail.”</p>\n\n<p>“That phone of yours got a camera?” he asked.</p>\n\n<p>I mock-slapped myself in the head.  “I should have thought to get a photo, but it scared the daylights out of me.”</p>\n\n<p>“If you see it again, get a photo and call me,” he said.  </p>\n\n<p>I gave my word, and he wandered back to the plant to go back to work.</p>\n\n<p>Chloe drifted off for a nap around midnight, and I pulled out a book to read.  Until around four in the morning, there would be no one in the guard house except for plant employees, and they didn’t care if I read.  Relaxing in my chair with one foot tucked under me and the other one in front of it on the seat, I turned my playlist on low volume and settled in.</p>\n\n<p>I won’t lie and say my eyes didn’t occasionally flick up toward the admin parking lot, but the creature wasn’t out there.</p>\n\n<p>Half an hour into my book, I needed to use the restroom.  Since Chloe was still snoozing, I just locked the window and the doors and went to take care of business.  No one could get in, so she was perfectly safe.</p>\n\n<p>Or, at least I thought she was.</p>\n\n<p>I had just started washing my hands when Chloe started this ungodly screaming that I’d never heard out of my daughter before.  I snatched the door open and was half-way to her bassinet when my eyes focused on what was standing over her.</p>\n\n<p>From the back, it looked like a man wearing a suit.  But how had he gotten in, and what did he want with my baby?</p>\n\n<p>“Get away from  her!” I yelled, reaching in my pocket for my cell to call 911.</p>\n\n<p>He rose stiffly, turned, and I almost dropped my phone.</p>\n\n<p>He was wearing my dead husband’s face, but it was decayed.</p>\n\n<p>I screamed, and probably would have gone on screaming if Huey hadn’t heard me on his way to his truck.  </p>\n\n<p>“Open the damned door, Selene!” he yelled, his eyes fixed on that … thing standing over Chloe.</p>\n\n<p>Not taking my eyes off it, I side-stepped to the door and twisted the lock.</p>\n\n<p>Huey was in the door with his gun out and pointed at it before I knew what was going on.  “You son of a bitch, you get the hell on out of here and stay out!” he ordered, the gun trained on it.  “You hear me, you demon?  You get the hell away from that baby, and don’t you come back here!”</p>\n\n<p>It gave Huey this twisted smile, and vanished.</p>\n\n<p>I shoved past him to snatch Chloe out of her bassinet, tears streaming over my cheeks and sobs racking me.  “What was that?” I half-yelled, pacing with her in my arms, still crying.  “What the hell was that?”</p>\n\n<p>Huey put the gun away a bit shakily, and leaned on the counter to catch his breath.  “Gal, I wish I knew,” he answered, looking shell-shocked.  “I heard Chloe wailing half-way here, and then you started screaming, and I knew something was wrong.  Don’t neither of you scream like that.”  He paused.  “God damn, I need a drink.”</p>\n\n<p>“You and me both,” I agreed, stroking Chloe’s back and head as I walked her.  “You know John, right?”</p>\n\n<p>“Yankee John?” he asked.  “Yeah, I know him.  Why?”</p>\n\n<p>“When you go back in, tell him what you saw out here,” I said.  “Maybe he might know what I’m dealing with out here.”</p>\n\n<p>“I’ll tell him, gal,” Huey said.  “I’ll tell Rooster, too.  He’s been here since this damn plant started – his folks are the backwoods type.  I reckon he might just know something himself.”  He looked at Chloe, who was calming down now.  “Keep her by your side, until we find out what the hell this is, Selene.”</p>\n\n<p>“I will,” I promised him.</p>\n</div>\n","author":"RhapsodyinVelvet"}