{"rank":"17","title":"In need of hunting tips.","id":"8kf50d","url":"/r/nosleep/comments/8kf50d/in_need_of_hunting_tips/","time":"1526666139000","body":"<div class=\"md\"><p>I hate farming. I hate everything about it. I hate the fields, the forests, and the blank eyed animals. My parents divorced when I was ten and my mom left the farm for the city. I felt rescued at that point. I mean, obviously the divorce sucked and I loved my dad, but I hated where he lived. All through my teens I would only ever spend brief periods of time there, and never in my early twenties would I spend the night. My entire family lived on this farm, not that any of them are around anymore. They’ve nearly all died - my grandparents of age and cancer and my uncle’s family in a house fire. That is what happens when you are half an hour from emergency services.</p>\n\n<p>It was a weird place to be a kid. My grandpa Bob liked to tell us old Appalachian ghost stories from the areas around where we lived. He had this one about when you are in the woods alone. He used to tell us if you hear someone calling your name you should never answer, because if you do some monster kills you and steals your voice. Thing is, a few months after he told this story the old bastard would hide in the woods and call out your name. Also, it was probably not a great idea to tell a kid with no natural sense of direction not to answer to his name when he is in the woods. He died my Freshman year of college, as you can imagine I skipped the funeral. Some of those stories he used to tell are a lot older than the Scotch-Irish settlers of Appalachia, though. Apparently, when the Cherokee sold most of Tennessee and Kentucky, one of their leaders declared that a large part of the land should not be inhabited by white men. He called it “Dark and Bloody ground.” I should mention that our farm is right in the middle of the area he was talking about.</p>\n\n<p>When I turned 28 my dad gave me two gifts: one was he moved with my step-mom to Arizona, and the other was he gave me every acre of our family’s land. Retirement has been good to him, I reckon. Now, I wanted to sell the land and let someone build a Walmart on it but my wife had other ideas. She was all but singing the theme song to Green Acres when she heard the news and declared that we had to move there immediately. As it happens, she thinks cows are adorable. She also wanted to grow her own food. I&#39;m fine with GMOs, thanks. Anyway, “happy wife, happy life.” So we packed up our stuff and our two dogs and we headed for the family land. We both worked from home anyway, so as long as we could get decent internet we would be ok. Thank God for satellites.</p>\n\n<p>We got moved in pretty quickly; my parents house was small and we didn&#39;t own much anyway. Everything went smoothly for a few days. I did have a bad feeling any time I went outside, but I told myself it was just my imagination. Stupid me. After we had been there a week things got move overt. When you watch those tv shows about people living in haunted houses and stuff you tell yourself, “I would just burn down the house and move. These fuckers are idiots.” That is called hindsight and it is different when weird stuff happens to you. It was around midnight, we had just finished watching a movie and were getting ready for bed when I saw a face in one of the living room windows. Not like a nose and such - just the outline of a head. I saw it out of the corner of my eye but when I turned nothing was there. I went over and opened the window and looked into the yard and saw nothing. I just closed and locked the window. When my wife asked what I was doing, I lied and said I thought I saw a coyote, so she should be careful walking the dogs at night. When I woke up the next morning the window was unlocked and wide open. I again lied and told my wife that I must have forgotten to shut it. She was not happy with me, apparently because we don&#39;t “own stock in the local electric company.” I knew something was not right...I locked that window.</p>\n\n<p>The next day I called my dad to get his thoughts. I was planning on telling him to keep his haunted ass house and offer to mail it to him board by board. When I told him what happened he laughed and laughed and told me to not be such a baby. He said it was all just jitters as a first time home owner and that it was normal. I could tell he was lying.</p>\n\n<p>Before I could talk to my wife, she came running over with Craigslist pulled up on her phone to show me where people were selling cattle. She started begging me to buy her some. Say what you will about me, but when your wife is that happy about something, you decide that Hell itself won&#39;t get to ruin her mood. Happiness is overrated.</p>\n\n<p>A few days later, I&#39;m watching an old farmer and his meth addled grandson unload a few cows from a busted trailer into our even more busted cow pen. He talked endlessly about how nice it was to have young people coming back to farming and the teen with him scratched at bugs only he could see. Eventually they finished and I paid them more than those poor creatures were worth, but, my wife loved every one of them. While she fawned over her new pets, I went about getting food and water set up for them, just until we could repair the fence around the pasture. We would also have to fix up the rest of the outdoor electronics because the wiring was older than I was. Before the divorce, my mom had a giant flood light installed in the telephone pole at the corner of the house and it lit up the front yard like the noonday sun all night long. My dad never bothered to take it down because he had gotten used to being able to tan at 3am.</p>\n\n<p>The entire time I was repairing the fences I felt a terrible unease anytime I got near the woods that surround the house and fields. It was like someone was watching me. At first I told myself that I was just being paranoid, or letting my childhood memories play tricks on me, but after hours of feeling like I was about to be attacked I knew something was off. I decided to call it a day as the sun was setting. I’ll admit, I was struck by the beauty of it. The bright reds and oranges of the sky contrasting against the green on the mountains, it was peaceful. The peaceful feeling didn’t last long. As I watched the darkness overtake the trees, the outline of a person standing next to an old oak began to form. By the time the sun had set I could see someone in the woods, just watching me. Before I had worked up the nerve to go run him off, he had disappeared.</p>\n\n<p>One night a couple days after we got the animals settled in to the field, at around eleven,I was walking through the living room and I saw someone standing in the yard, right in the middle of that lake of light. I couldn&#39;t see any details, just a shadowy outline. Now I figured it was that teenage meth head here to steal something or just be a creep, and I was not about to let that happen, not after that stunt he pulled while I was mending the fence. I run to grab my gun and the old mag light, the kind my grandfather would have called a nigger knocker (it was more bat than light) and burst out the front door. Somehow, in the second it took me to clear living room, the guy had run off. The thing is, there is no where to go that I wouldn&#39;t have been able to see him, except of course for into the woods.</p>\n\n<p>I don&#39;t know what it was, a lifetime of action movies and violent video games, a disdain for young punks, or maybe just my redneck blood, but something told me I had to go into the woods after him, that I couldn&#39;t let him escape. I was overcome with the urge to charge into those trees and punish anything I found there. It was like I was burning up inside and the only way to keep from being incinerated was to charge ahead. I yelled for my wife to get the dogs and lock herself in the bedroom until I got back, and bolted off into the dark.</p>\n\n<p>As soon as I cleared the circle of light in the yard I turned on the forty year old flashlight and was amazed to find that it actually worked. I had originally planned to just use it as a club, but I got lucky. It would be the last good luck I would have all night. I heard steps ahead of me and went after them as fast as I could in the dense undergrowth crashing through the bushes with reckless enthusiasm. No matter how fast I went though, the sound was always the same distance ahead of me.</p>\n\n<p>When I slowed down, it seemed to slow down also. It felt like I was being taunted. Just when I had decided to ignore the roaring in my head and turn back, I saw the shadow again. He was looking right at me. I don’t know how I know that, but I could tell even without seeing his face or any other details that I had his full attention. He was about ten yards away backlit by the full moon and while I was nearly run to death he was not even breathing hard. I knew it was a meth head now. I yelled for him to leave. I cussed and told him if I saw him again I would kill him. The whole time I yelled he never moved. Then, as I blinked, he seemed to be a few feet closer. I never saw him move he was just closer. I told him if he moved again I would shoot, and as I raised my .45 he seemed to jump again, this time he was less than 5 yards away. I dropped my light and opened up. I am a man of my word, and at five yards, a hell of a shot. I dumped the whole seven round magazine plus the one in the chamber right into the ten ring on this guy and he never moved.</p>\n\n<p>When the spots cleared from my eyes from the muzzle flash he was right on top of me. He was as close to me as the bathroom mirror when I shave, and still all I saw was a shadow. No details, no clothes, no hair, no skin, just an impossible darkness looming over me. I swung the pistol. I won&#39;t lie, I was pissing myself with fear the whole time, but if it was the last thing I ever did, I was going to pistol whip this...thing... into the ground like a tomato stake. Because no matter how afraid I was, the desire to attack never went away. I managed one swing. My hand went right through it. It seemed to recede backwards. It didn&#39;t walk it floated away from me at a speed I had never seen before and have not seen since. I stood there, bent forward, unmoving from my position at the end of my swing unable to take my eyes away from the human shaped void. As I watched, the shape itself disappeared. It seemed to recede back into the general darkness until I could no longer see it. It was like the entire forest grew a little darker and a lot less moonlight was filtering in between the leaves.</p>\n\n<p>I drew in a breath, I guess I had been holding it for a while because my chest was burning, and my skin with prickling with sweat. I picked up my light and saw that there was frost on the gun. It was in the eighties and humid, frost should not be possible, but there it was. Then I noticed that my hand had gone numb and blood was pouring out from under my nails. The whole hand looked drained and desiccated all the way to the middle of my forearm. It didn&#39;t hurt, like you would expect, but I might have been in a poor state of mind. My hand was too numb to even open my fingers. As I stood there shocked and dripping urine and blood, I heard a voice pierce the unnaturally perfect silence. “ROBBBBYYYYY, ROBBY, ROBBY” again and again something yelled my name in a voice that was somehow familiar but certainly not human. Thing is, no one calls me Robby except my family, and even they had not done it in years. I had gone by Rob since college, and hadn&#39;t been called by my childhood name in nearly a decade. In that moment I knew that if I answered it would be my last mistake in this life. I could almost hear my grandfather’s voice telling me to keep quiet and flee. I guess he was finally good for something.</p>\n\n<p>I turned and with as much dignity as I could muster walked back to the house. The fire I felt earlier had entirely run out of me. The last few minutes all felt like a blur, like something I had watched happen, instead of a willing participant. It became clear to me that while I thought I was the aggressor, that I had been chasing this thing, the truth was that I had been baited out into those woods to die. A new understanding of my place in the world settled onto my shoulders like a coat. I had made my home on dark and bloody ground. I told my wife it was just some drunk teens and that I scared them off. I hid my arm from her and explained the blood by saying I had run through some briars. I don&#39;t think she believed me, but I suspect she did not want to know the truth. I did not sleep that night. After a few hours my arm started to look normal again, The skin no longer looked drawn and the meat of my arm seemed to rehydrate. The hand is still weaker than it was before. It probably always will be.</p>\n\n<p>The next day I called my dad again and told him the story. He listened in silence until I was done. I waited on him to reply, knowing that if he laughed I would fly out to that God forsaken desert and beat him to death. Finally, with his voice filled with sadness, he replied. He said, “I know son. Bob tried to warn you when you were a kid, but you thought he was just playing around. I&#39;m glad you made it through the night. If you want my advice, I would make sure I left it a sacrifice before the next full moon. It likes deer. Please listen to me on this, your uncle didn&#39;t and I blame myself for that. I tried to tell him before he experienced it for himself. He thought we were just screwing with him, or maybe he thought he could handle whatever happened, I don&#39;t know. He was wrong either way and his whole family paid the price for his foolishness.” Then he hung up.</p>\n\n<p>So, any tips on catching a deer?</p>\n</div>\n","author":"Robb3xl"}