{"rank":"25","title":"The Alzheimer's Conspiracy","id":"8kfqhn","url":"/r/nosleep/comments/8kfqhn/the_alzheimers_conspiracy/","time":"1526670984000","body":"<div class=\"md\"><p>There’s a saying from a Dan Brown book that is often quoted – “History is always written by the winners.” It’s only half true though; a more accurate representation of what happens would be, “History is always written by the survivors.” I have uncovered a massive conspiracy against the world’s knowledge of its history, but to explain what’s going on, I must explain what’s already happened.</p>\n\n<p>I’m a clinical gerontologist, and I’ve done research on the aging body/mind for nearly four decades. I have studied the (world-wide) human life expectancy increase from 31 years of age to 74 years of age since 1900 AD and the phenomena that go with that increase. As modern medicine and an understanding of our own chemistry advanced, our lives were progressively lengthened. Of course, living longer caused certain challenges that were never expected to pop up. <a href=\"https://www.ncbi.nlm.nih.gov/pubmed/1745343\">We knew the body could wear out, but we became more aware of our brain’s expiration date as well.</a> In my early days of schooling, this was often called “hardening of the arteries”, and a little bit of senility was to be expected of the elderly. As our life expectancy approached 80 years, we began to see an increased prevalence in what scientists have termed “dementia” and more recently “Alzheimers”. <a href=\"https://www.ncbi.nlm.nih.gov/pmc/articles/PMC3026476/\">Here is a document that explains the situation well.</a> </p>\n\n<p>We began to learn that dementia came in many forms – mostly Alzheimer’s (60-80% of cases) and vascular (roughly 10%, less common singularly and more often a contributor than sole cause), with less common types being Lewy bodies, Creutzfeldt-Jakob, etc. Alzheimer’s disease is characterized by the build-up of beta-amyloid deposits in the brain and twisted strands of the protein tau which leads to nerve cell damage/death in the brain. I know, you don’t really care about that part, but it’s important to the story. My work with the NHI was fairly high-level; we were working on methodologies to potentially prevent the deposit of Aβ (beta amyloids), which we believed would prevent onset of Alzheimer’s disease (abbreviated AD from here-out). This wouldn’t work for pre-existing cases of AD because we would not be able to resurrect the dead brain cells, but it would change the game for those families with the potential to be affected by AD.</p>\n\n<p>“Would” is the operative word, because just as we felt we had achieved a huge milestone – we had found a way to prevent misfolded oligomers (which are capable of inducing other Aβ molecules) from forming a chain reaction in other oligomers, ultimately causing nerve death - our funding was pulled and the team disbanded. This typically happened when you weren’t making progress, not when you were about to bust the top off of the scientific world. Not to be braggadocios, but our team was a group of rock stars in the gerontological research world, so this was beyond strange. I took my questions to the top of NHI, but all I got was a canned response and the brush off. </p>\n\n<p>I was distraught. This had been decades in the making, and to be cuckolded at the penultimate moment of my career was the more than I could bear. After sulking for a few weeks, I reached out to one of my fellow colleagues who had been defunded as well, but I heard confusion in her voice. When I questioned her a bit more, it became obvious she was not herself. I called her husband, whom I had become close with over the years, to find out she had recently been diagnosed with early-onset dementia, but it had a rapid onset and had advanced greatly in just a few weeks. I hung up the phone (after giving my condolences), and immediately called another co-worker. Call after call, similar news. Each member of the team had begun to suffer from dementia – people who had no signs or symptoms just a month prior.</p>\n\n<p>Rapid onset of dementia is unusual and typically isn’t AD.  Unfortunately, our medical providers are typically not well-informed about dementia and use the diagnosis as a catch-all for any older person experiencing forgetfulness or mild delirium. I was not your typical medical provider, though. I began reaching out to colleagues from across the country, asking if they had similar experiences. I visited research forums and left messages on them asking for input. All sources came up empty handed, until a got a single message on a less-than-reputable message board. It was a message from a person with the screen name “DontDementionIt”, and within it was a bunch of conspiracy bullshit, but as it shook it, I got an eerie feeling. I have posted its contents in their entirety.</p>\n\n<p>“You have stumbled onto the newest way our government has found to exercise the mutability of history. This is straight out of Orwell’s 1984 – ‘Who controls the past controls the future. Who controls the present controls the past.’ Our shadow-puppet overlords have had to figure out how to control the retention of information with lifespans continuing to increase. They can’t alter the facts so long as people know better; with the introduction of a memory distorting prion protein similar to that of Creutzfeldt-Jakob, synapses are being altered to no longer be able to communication between neurons. </p>\n\n<p>Because older citizens typically have weaker immune systems and more comorbidities (high blood pressure, high cholesterol, diabetes, etc), the prion is able to be distributed via municipal water supplies and effect a specific target group. Your eyes have been opened now, so good luck.”</p>\n\n<p>I tried to message back, but the profile had been deleted. I was skeptical, of course, but the protein prion is a common hypothesis on how AD is able to damage brain cells – prions are able to pass the blood/brain barrier, and that is what makes diseases such as Mad Cow (a relative disease of Creutzfeldt-Jakob) so dangerous. It’s believed that the amyloid-related mechanism that prunes neuronal connections in the brain in the childhood phase may be triggered by ageing-related processes in later life to cause the neuronal withering of Alzheimer&#39;s disease, and the prion would aid in the exacerbation. </p>\n\n<p>What if Alzheimer’s disease truly was implemented by the shadow governments to aide in systemic misinformation? After some web searches, it’s simple to find examples of ways history has been revised or blatantly changed to fit a perspective – the Moon landing deniers, Holocaust denial, Armenian genocide denial, and Japanese war-crime denial for examples. Books have been burned. During the American Civil War, the confederacy revisionism involved changing the cause for war from slavery to state’s rights. The further we move from these events, the more we have to depend on historical accounts which can be amended and passed as the truth – assuming no one can say different. By removing those that know better prematurely, we are forced to believe that which we are told.</p>\n\n<p>I don’t have substantial proof one way or the other. Despite my best efforts, this isn’t some wild story or Nicholas Cage movie. One little man can’t crack open the vault of an institution. All I can do is ask questions: Why would our research be hidden and lab shuttered? Why would someone not want a cure for Alzheimer’s? I ask you to please take notes of what your elders are telling you. Compare it with information to come. It’s only a matter of time before their knowledge is gone, and our dependence on the government for “facts” will increase. If I’m wrong, you will have brightened an elderly person’s day. If I’m right, well…I hope I’m not.</p>\n</div>\n","author":"AtlasArceneaux"}