{"rank":"4","title":"Panic","id":"8kfqq1","url":"/r/nosleep/comments/8kfqq1/panic/","time":"1526671040000","body":"<div class=\"md\"><p>I smiled and nodded along, but suddenly something clicked. Everything seemed to go slow for a second. Everyone smiled and talked on, but something was different. I excused myself and went to the front yard, crouching behind a wall where no one would see me. I looked up at the sky, wondering why I was trapped here. I didn&#39;t know where I was. Was this a dream? A simulation? I wanted out regardless. I began desperately biting at any part of exposed skin, thinking that maybe if I hurt myself enough they&#39;d let me out. I watched the bruises blossom, feeling more and more desperate with each one. Maybe I even screamed at some point, but I couldn&#39;t tell. Suddenly I heard footsteps coming closer. I shot up and noticed my dad standing in front of me, a concerned look on his face. Except it isn&#39;t really him.  He - no, <em>it</em> - was just trying to get me. It was trying to keep me here, in this dream or simulation, all for a purpose unbeknown to me. My heart pounded in my chest. Everything was in slow motion as I whirled around and made a run for it. </p>\n\n<p>I could hear It chasing me down the street, calling my name, trying to convince me into coming back, reassuring me that it was okay. But I knew better than that. As soon as It caught me, it was all over. I ran as fast as my legs could carry me. My shoes slapped against the pavement rhythmically as I carried myself as far away from it as I could. I ran into the woods periodically looking behind me in fear It was still following. Fortunately I had finally lost It, although I couldn&#39;t recall when. I began walking deeper into the woods.</p>\n\n<p>The sky was darkening and shadows began dancing around me. I navigated my dreamscape clumsily, tripping over myself in the darkness, until I noticed a dark figure up ahead. I stopped short, my breath hitching in my throat. It waved, and even called out a pleasant &#39;hi!&#39;. My hands shook. It had sent others after me. I ran the opposite way as quickly as I possibly could, slipping and falling several times along the way until I finally arrived to a dimly lit road. A car passed by as I crouched in the bushes, shaking and unable to breathe. </p>\n\n<p>Eventually I composed myself as much as I could and continued down the street. My aimless walking went on for a while, as I didn&#39;t really know where I was going. All I knew was that I had to find a way out. All of a sudden I was half blinded by headlights approaching me head on. The car screeched to a halt right in front of me, and, to my utter horror, It stepped out of the car. I began trying to dash away, but it was too late. Strong arms grabbed me from behind and knocked the breath out of me. It had caught me. </p>\n\n<p>The next thing I remember was me laying in the grass while being held down by a group of strong men who were all talking calmly, but surprisingly fast. I screamed and thrashed to get out of their hold, but it was useless. They stabbed a syringe into my thigh, making me roar with pain as I felt the liquid being steadily pumped into my veins and through my whole body. Everything became blurry, but not the way it happens in the movies. This was somehow more vivid, more <em>real</em>. It took a while to kick in, but when it did I was helpless. </p>\n\n<p>Eventually I was picked up and carried into a big white car with flashing lights. They strapped me into a chair and began driving god knows where. My head lulled forward and I had to fight to keep my eyes open, but my attempts were unsuccessful. </p>\n\n<p>So now here I am, strapped down to an uncomfortable bed in a sterile white room. My limbs ache from bring tied down. The restraints are too strong for me to escape. I&#39;ve lost. There&#39;s no way out. </p>\n\n<p>reposted from <a href=\"/r/shortscarystories\" rel=\"nofollow\">r/shortscarystories</a> cause I forgot to check the word count oop. </p>\n</div>\n","author":"ratzo_"}