{"rank":"8","title":"I can't feel safe anymore","id":"8kg6vu","url":"/r/nosleep/comments/8kg6vu/i_cant_feel_safe_anymore/","time":"1526674770000","body":"<div class=\"md\"><p>I don&#39;t feel safe anymore.</p>\n\n<p>I never feel safe anymore.</p>\n\n<p>It&#39;s only been 2 days but I can&#39;t shake the feeling of dread that I get every time my mind drifts back to that morning. This won&#39;t be long because I don&#39;t have much to say so all I hope is that putting it down in words gives me some kind of closure.</p>\n\n<p>I live in a lower-income suburb of a major city. A normal 1-story house on a normal street where nothing abnormal has ever happened. The days around here have been slowly getting warmer and as a result I&#39;ve been sleeping with my windows open. There are 2 that open my space up to the world one on each wall. A small single size and a larger wider one. There&#39;s a normal set of blinds on the small window and a large canvas art print covering the large one.</p>\n\n<p>This house has been my home for almost 4 years now and nothing strange or out of the ordinary has happened. I go to work and come home. In the winter I run my portable heater, in the summer I have 3 fans aimed at my crotch at all times, and in the Spring I sleep with the windows open. Usually I&#39;ll open them a small way just enough to hopefully get a cross-breeze going during the occasional gust of wind.</p>\n\n<p>The night before what happened it was a particularly warm and muggy night. I had a fan between my two windows blowing air through but it still wasn&#39;t enough. I opened the windows all the way leaving the blinds and print up to block the view and I decided to sleep naked. This wasn&#39;t an uncommon thing to do and I saw no problem with it, but never had it occurred to me that what happened would ever happen.</p>\n\n<p>During the night I would occassionally wake up to a chilly breeze on my hand since the head of my bed was against the wall with the large window. To fix this I put my hand on my balls and instantly fell asleep to the warmth. </p>\n\n<p>When I woke up the next morning it was cold and I got up to close the large window at the head of my bed. When I pulled the art print back to grab the window I looked down at the sill and my heart skipped a beat.</p>\n\n<p>There were 20 cigarette butts in a neat pile and I have never smoked a day in my life. I looked out to the gravel which lined the house and saw no distinct marks or tracks of any kind. The only sign anybody had been there was the little pile. How long do cigarettes burn? How long would someone need to be sitting there to smoke a whole pack? Every night I go to bed with a gun in the nightstand next to me so I’ve never had a reason to feel afraid but nothing can make me feel safe anymore.</p>\n</div>\n","author":"Fatkungfuu"}