{"rank":"741","title":"You have new DNA relatives [Part 3] FINAL","id":"8kgdoh","url":"/r/nosleep/comments/8kgdoh/you_have_new_dna_relatives_part_3_final/","time":"1526676381000","body":"<div class=\"md\"><p><a href=\"https://www.reddit.com/r/nosleep/comments/8jx1b6/you_have_new_dna_relatives/\">Part 1</a></p>\n\n<p><a href=\"https://www.reddit.com/r/nosleep/comments/8k7dje/you_have_new_dna_relatives_part_2/\">Part 2</a></p>\n\n<hr/>\n\n<p>My confidence evaporated. “What are you going to do to me?” I said. I suddenly wished I was back under those blankets, curled up safe and sound in the house. <em>Let her do whatever she wants with Mike. Just get me the hell away from her.</em></p>\n\n<p>She laughed lightly. “I’m not going to hurt you.”</p>\n\n<p>“Don’t lie to me.”</p>\n\n<p>“I’m not. Besides, you’re the one that’s armed here. Not me.” She pointed to the small knife I had brought along, thrown haphazardly on the dashboard.</p>\n\n<p>Oh, I had forgotten about that.</p>\n\n<p>“Then tell me what’s going on here,” I said, with newfound confidence.</p>\n\n<p>“I’ll do better than that. I’ll <em>show</em> you.” She opened the window, and the breeze blew through her hair. “Drive us to Chesterton Elementary.”</p>\n\n<p>Within minutes, we were at the school. Two kids kicked a soccer ball back and forth in the grass. Three more played on the jungle gym, climbing up the slides and slipping back down. For a second I wished I was one of them.</p>\n\n<p>“Pull in there,” she said, pointing to a dirt road just past the playground, leading into the forest.</p>\n\n<p>I turned.</p>\n\n<p>The glare of the spring sun was replaced with the dusky shadows of the forest. The road climbed uphill, weaving through the trees. We drove in silence, with nothing but the scratch of branches and the rush of wind, for several minutes.</p>\n\n<p>“We’re almost there,” she assured me.</p>\n\n<p>We crested the hill, and I saw what I assumed was our destination.</p>\n\n<p>Narrow, gravel trails split off the main road. Beside each trail were rows of long lumps in the dirt, making the ground look as if it were corrugated like cardboard.</p>\n\n<p>But she shook her head. “Not here. A little further, Callie.”</p>\n\n<p>I drove deeper into the forest. And it was when we came upon an unremarkable ditch, and a grimy shed, that Callie said “Stop.”</p>\n\n<p>We got out. Callie walked over to the shed, and for a second, I thought about getting in the car and driving back down the dirt road. To Mike. To home. To safety.</p>\n\n<p>But curiosity, and anger, kept my feet firmly planted in the soil.</p>\n\n<p>She handed me a shovel, her coral top now besmirched with smudges of dirt. “Dig. There.” She pointed to a patch of turned soil several feet from the shed.</p>\n\n<p>That’s when the fear kicked in. “You’re… you’re making me dig my own grave.”</p>\n\n<p>She laughed. “I told you, I’m not going to hurt you, Callie.” She laid a hand on my shoulder, and I squirmed away. “Just dig. You’ll see.”</p>\n\n<p>The shovel bit into the soil. I pushed down on the handle, and threw it over my shoulder. Clumps of dirt went flying, and she stepped out of the way.</p>\n\n<p>As my arms began to ache, and my chest dampened with sweat, I saw it. Poking through the dirt was something pale and cold. I fell to my knees and clawed the rest of the dirt away.</p>\n\n<p>I yelped.</p>\n\n<p>Blue and stiff, caked with black dirt, was a face. The eyes were closed, and the mouth was pressed firmly shut.</p>\n\n<p>But it wasn’t just any face.</p>\n\n<p>It was <em>my</em> face.</p>\n\n<p>“I don’t understand,” I stuttered. “It’s – it’s another one of the clones? Dead?”</p>\n\n<p>She shook her head. “Don’t you remember, Callie?”</p>\n\n<p>“No.”</p>\n\n<p>I looked up at her. She stared intently at me, her mouth twisted in a frown. Gone were the sly smiles, the commanding tone.</p>\n\n<p>She was upset.</p>\n\n<p>“Come back into the car with me,” she said.</p>\n\n<p>She sat me in the driver’s seat. Then she leaned over me, and tilted the rearview mirror so that I was staring at my reflection. “What are you doing?” I asked, but she didn’t reply.</p>\n\n<p>She pulled a makeup compact from her pocket.</p>\n\n<p>Flipped it open, slipped it behind my neck.</p>\n\n<p>“Look, Callie.”</p>\n\n<p><em>No.</em></p>\n\n<p>The back of my neck was a patch of perfect, blank flesh.</p>\n\n<p>The tattoo was gone.</p>\n\n<p>“Do you understand now?” she said.</p>\n\n<p>“I – I think so,” I stuttered. I felt like I couldn’t breathe. The air was so cold. My vision flickered with black.</p>\n\n<p>“You’re one of us. The real Callie died in that car accident; we’re taking her place.” She squeezed my hand. “I think something went wrong with your creation, though. We’re supposed to remember all of this. The rest of the Callies do.”</p>\n\n<p>She drove me back down the dirt road, to the trails. “This is the Garden,” she said, as we pulled over. “You don’t remember this at all? It’s our birthplace.”</p>\n\n<p>I shook my head.</p>\n\n<p>We walked along one of the gravel trails. I stared at the lumps in the soil; this close, I saw something moving, shifting under the ground. Callie crouched down, next to one of them, and brushed off the top layer of soil.</p>\n\n<p>A face. Pale and white, like the roots of a plant that have never seen the sun. Smooth, like plastic, without wrinkles, pores, or any kind of texture. The closed eyes twitched, as if the person were dreaming; the mouth and nostrils were fused shut.</p>\n\n<p>“That one needs more time,” she said, replacing the soil.</p>\n\n<p>“So all of these… will become clones of someone?”</p>\n\n<p>“Yes. When someone is close to death, we steal a bit of their cells, and plant them here. Those Seeds grow into us, and we take over their life. We’re perfect copies of the original, down to the memories and experiences. The only difference is, well, we can’t grow any inorganic matter – so tattoos, or medical implants, can’t be copied.”</p>\n\n<p>“But why?” I asked. “Why do all of this? Why take over lives?”</p>\n\n<p>“That’s a question for the Sower,” she said, with a laugh. “Not for me. I just do as I’m told.”</p>\n\n<p><em>Do what we’re told?</em></p>\n\n<p><em>That’s it?</em></p>\n\n<p>Those questions pulsed in my head, growing louder and louder, as we stood there in the shadows of the forest.</p>\n\n<p>And then I ran.</p>\n\n<p>“Hey!” Callie yelled. “Where are you going?”</p>\n\n<p>I didn’t listen. I slammed the door shut and started the engine. I backed up, across the narrow road – hopefully running over a few of the bodies – and tore down the dirt road.</p>\n\n<p>Callie deserved better than this. I felt her memories, her emotions, so vividly. The electric fear during the accident. The pounding, throbbing regret of never meeting her father. The burning passion for reading, that caused her to skip science classes and get bad grades.</p>\n\n<p>I felt it all.</p>\n\n<p>Callie wasn’t just another random life, to take over for some ulterior reason.</p>\n\n<p>Callie was a <em>person.</em></p>\n\n<p>Somewhere in the distance, I heard a siren go off. It pierced the shadows of the forest, muffled through the glass.</p>\n\n<p>But I kept driving.</p>\n\n<p>I will not listen to the orders of a nameless, faceless man like the other clones. I will not slowly take over Callie’s life in bits and pieces.</p>\n\n<p>I will not pretend to be Callie.</p>\n\n<p>I will not become Callie.</p>\n\n<p>I <em>am</em> <a href=\"http://www.blair-daniels.com\">Callie.</a></p>\n</div>\n","author":"BlairDaniels"}