{"rank":"2","title":"When pigs flew.","id":"8kgkes","url":"/r/nosleep/comments/8kgkes/when_pigs_flew/","time":"1526678049000","body":"<div class=\"md\"><p>It all started on a hot summer day, those days were even the air is heavy. Back then i still lived with my parents and i was assigned different chores everyday. More specifically, every ones chores. I remember that day was no different, it was the afternoon when i decided taking a nap was better than feeding the pigs, and i&#39;d do it when the unbearable sun went down. I woke up to my mom screaming at me for not feeding the pigs yet and pushed two buckets of feed into my arms. I groggily made my way outside into the pigs pen. As i cursed under my breath the sound of snapping twigs behind the mesquite trees caught my attention...&quot;That damn neighbors dog must&#39;ve smelled the left overs &quot;, i said to myself. I pushed the gate open and whistled to the pink beasts in order to let them know it was finally time to eat.  I stared into the darkness of the night while pouring until something made every single strand of hair in my body stand. A moan...not the pleasure kind, the kind only someone or something made while in immense pain, i stopped in my tracks. I stood still as a rock and waited... All i could hear was the pigs wet noses honk while they stuffed themselves. Then... i heard it, a loud swift of air above me, the kind planes do while too close to land. Making nothing of it i looked up and there he was, my neighbor,  only that it wasnt my neighbor...he had wings, huge pitch black wings that sparkled in the moonlight. I dropped the buckets and rushed inside calling out  for my mom...no one answered. Was i okay? Am i dazed? Was the nap in the summer heat affecting my vision somehow? I tried my best to come up with a logical reason only to find a loop of thoughts. I laid down and found myself more confused by the second. Suddelny i remembered my stupid self hadnt closed the gate and if one of those huge pigs got out i was dead. I managed to get enough courage to go back outside, as i made my way i caught something from the corner of my eye near the mesquite tree. An owl. A huge fat owl that was just staring into my soul. I stared back , confused, but it was their natural way of recognizing things, i thought. Wrong, it opened its mouth slowly and abnormally large for its size, it stopped, then let out a terrifying scream that hurt my ears, i ignored it though, its just a hungry bird i told myself. I closed the gate and made my way back...but i couldnt, curiousity killed the cat and i scrambled my way through the mesquite trees being as quiet as possible and peeked through a hole on the neighbors wooded fence.  I opened my mouth in shock. There was a roaring camp fire around a stake that pierced a crow. There it was too,sitting near the fire with black empty sockets for eyes, staring back at me. I couldnt move...i was frozen. The next few things that happened are a blur, i heard my dad running through the trees yelling my name. After that it all went to black. I woke up the next morning to my mom stroking my hair, i tried asking her what had happened but she just talked over me saying that it was nothing to worry about. I stared at her then looked down to my arms. I had claw marks all around my wrists and bruises all over my arms. To this day no one gave me an explanation and i still dont know what happened to me. All i know was that i never had to feed the pigs again.&quot;</p>\n\n<p>This story was told to me by my grandma, it happened in mexico in a very poor area where nahuales were in the mouths of everyone. It has forever remained in the back of my head and i always pop it up during a good scary story telling session.</p>\n</div>\n","author":"Chrryblu"}