{"rank":"14","title":"I'm stuck in my apartment in some sort of virtual hell death loop and I can't escape it. [Part 1]","id":"8kgqxl","url":"/r/nosleep/comments/8kgqxl/im_stuck_in_my_apartment_in_some_sort_of_virtual/","time":"1526679693000","body":"<div class=\"md\"><p>It&#39;s been 2 days I suppose. I&#39;ve tried my best to keep track of time but when&#39;s the last time I&#39;ve taken a shower isn&#39;t important anymore. I don&#39;t know what happened, why it happened, and when it happened. I&#39;m not really in hell, more of a loose replica.</p>\n\n<p>If you want to refer to me, just call me &quot;Poke&quot;. I made this account a long time ago for Pokemon-trade-related uses a couple years ago and I was a huge fan of Pokemon X and Y when it released and you get the idea. Now, I&#39;m trying to use it to save my life. I need your guys&#39; help.</p>\n\n<p>I woke up around Saturday? Sunday? It was a weekend, that&#39;s all I remember. My entire apartment was pitch black despite remembering I left a lamp on overnight. I dragged myself out of bed and attempted to turn on the lamp. Nothing. I tried again but there was still no response. I checked if it was unplugged but it was plugged in.</p>\n\n<p>Instantly, I knew the power was out. I decided that I was just going to distract myself until it came back? I don&#39;t know. I was suffering from a headache and couldn&#39;t think straight. That&#39;s when I saw it to the left of my bed. My computer&#39;s screen was on. Bright as day yet I didn&#39;t even sense its glow seconds later.</p>\n\n<p>I didn&#39;t understand what was going on due to waking up literally a few minutes ago and my pounding headache so my first intention was to drag myself to my computer and use it as a distraction until the lights came back on. I logged on, got onto Discord, and tried talking to some friends. They didn&#39;t respond so I assumed they were busy. I noticed I had a pending friend request so I checked it.</p>\n\n<p>His username was &quot;OS1&quot; and he had an entirely black icon, his status was Idle, and he had no mutual servers or friends with me. He had no account number, just a single hashtag next to it with the absence of the four digits. I was unsure how whoever this was got my account number and sent me a friend request, judging by the fact they have no mutual friends or servers with me so I declined it. Right as I did, that&#39;s when they suddenly sent me a private message.</p>\n\n<p>I assumed that this was a bot but my curiosity smacked me in the back of the head and told me to check the message. I clicked on the notification and read the message out-loud.</p>\n\n<p>&quot;Hello, are you Johnny?&quot;</p>\n\n<p>That&#39;s not my name. I almost didn&#39;t want to respond but then I realized that this was probably someone who was given a friend&#39;s account number that was either incorrect or typed in wrong. So, I responded but right as he did, I got an answer back almost the second I hit Enter and whoever OS1 was, we ended up in a discussion.</p>\n\n<p>&quot;uh no&quot;</p>\n\n<p>&quot;Don&#39;t play games, Johnny. I really need your help.&quot;</p>\n\n<p>&quot;im not johnny&quot;</p>\n\n<p>&quot;Johnny, please. I&#39;m at stake right now.&quot;</p>\n\n<p>&quot;im still not johnny but i could be of help&quot;</p>\n\n<p>&quot;Really, now?&quot;</p>\n\n<p>&quot;i dont know man you contacted me and are accusing me of being some johnny person&quot;</p>\n\n<p>What came next was an entire string of messages all from the user. I was suddenly unable to respond as my Discord began lagging and my keyboard would not respond.</p>\n\n<p>&quot;You have to be Johnny. You have the same name and icon as him.&quot;</p>\n\n<p>&quot;Johnny, please come out.&quot;</p>\n\n<p>&quot;I&#39;m sorry, Johnny. I&#39;m sorry.&quot;</p>\n\n<p>&quot;Johnny. It&#39;s breaking the door. Don&#39;t let him eat me.&quot;</p>\n\n<p>&quot;JOHNNY PLEASE&quot;</p>\n\n<p>&quot;JOHNNY&quot;</p>\n\n<p>&quot;JOHNNY&quot;</p>\n\n<p>&quot;JOHNNY&quot;</p>\n\n<p>The single message of &quot;JOHNNY&quot; was repeated a total of 29 times, including the three above. Why I counted was beyond me and they were posted around 1-3 seconds apart... until this happened...</p>\n\n<p>&quot;JOHNNy&quot;</p>\n\n<p>&quot;JohnNY&quot;</p>\n\n<p>&quot;john&quot;</p>\n\n<p>&quot;aaaaaaaaaaaaaaaaaaaaaa&quot;</p>\n\n<p>&quot;eafeageshrteatghaethaethatehbbbbbbbbbbbbbbbbbb-------------------&quot;</p>\n\n<p>&quot;_________________________&quot;</p>\n\n<p>That&#39;s when OS1 blocked me and my Discord stopped lagging, revealing my half-written message I have attempted to write, being &quot;dude pleas&quot;</p>\n\n<p>I didn&#39;t know what to think. I was completely confused and my headache wasn&#39;t doing me any favors so I got up, dragged myself through my dark apartment, attempted to turn on any light-switches much to my avail, and took some headache relief. I attempted to let some light into my apartment by opening the blinds of a window, only to find utter darkness. It was midnight yet the time on both my alarm clock and computer read 10:43 AM.</p>\n\n<p>Pitch black darkness inside. Pitch black darkness outside. Great.</p>\n\n<p>I came back to my computer a couple minutes later, only to strangely find it still read 10:43 AM. I checked the alarm clock and it was 10:47 AM. Was something wrong with my computer? I didn&#39;t care enough since I was impatiently waiting for my headache to fade.</p>\n\n<p>I got off Discord and started browsing Reddit for a while. The entire time, my computer time was still stuck at 10:43 AM. I browsed Reddit, watched YouTube, and even counted those repeated &quot;JOHNNY&quot; out of boredom. It&#39;s when I suddenly got a message from OS1 despite literally blocking me around 20 minutes prior.</p>\n\n<p>&quot;Look outside your window.&quot;</p>\n\n<p>Uh, how about no? I wasn&#39;t able to respond due to him blocking me. I didn’t know what to think.</p>\n\n<p>“DO IT NOW.”</p>\n\n<p>Normally, I wouldn’t be threatened or imitated by those simple three words capitalized but when I heard a shrieking robotic blast of static molded into a person screaming those three words bursting from my speakers followed by a stream of waving white noise, I would.</p>\n\n<p>I practically tore at my mouse to mute my computer. It didn’t work so I dove for the speakers and twisted both dials down. It seemed to mostly do the trick but a quiet mechanical rumbling still emitted from my speakers. I looked back at my Discord and found an image.</p>\n\n<p>It was an extremely dark photo, almost entirely pitch-black because the silhouette of something. It was quite faint but after a while, the best I can make out was what looked like a side-view of one of those old-fashioned wind up film cameras. It seemed to be dirty with deep scratches along its side. I clicked out of the image and noticed that OS1’s username was now changed to “OS7”.</p>\n\n<p>“What is happening?” I kept thinking to myself. “Was I alive? Dead? On the verge of it? Sleeping? In a coma?”</p>\n\n<p>“RE… AT... I… SO... “</p>\n\n<p>I heard the return of that screaming voice, muttering quietly from my muted speakers. I slowly turned one of them up until I could make out what they were saying.</p>\n\n<p>“REAP… WHAT… I… SOW...”</p>\n\n<p>I would be lying if I didn’t say I had chills. Probably still be lying if I didn’t say I was urinating myself with fear.</p>\n\n<p>I knew what was happening was serious. I dove for my charging phone on my bed nightstand, turned it on, and attempted to call 911. It didn’t go through. I suddenly had no phone reception and my phone seemed to suddenly lock off before I watched as its battery went from around 89% to 0% within seconds.</p>\n\n<p>I tried charging my phone and turning it back on but it did nothing. I opened my phone’s case and decided to take the battery out and put it back in. That’s when my phone dropped to the floor when I heard a clatter of glass from my kitchen. I tore open my closet, grabbed an old wooden bat used in case of intruders, and slowly opened my door. I heard another clatter, loud like a clap of thunder.</p>\n\n<p>I turned back to my night-stand, nearly considering to just lock and barricade my door. That’s when I spotted my phone I had dropped on my floor. Despite its battery laying inches away, it was on. Keeping the door open, I inched toward it, cringed when I heard another clatter and even a loud thump, and grabbed it.</p>\n\n<p>It was 88%. I knew that whatever happened to it was it trying to keep me away from calling people. However, I knew that it can still be some use to me as I returned to the door, hearing a few loud footsteps. I swallowed the lump in my throat and inhaled, building what little courage I could manage.</p>\n\n<p>“I-I know you’re t-there! Show yourself! I have a weapon!” I slurred out my words, stuttering a bit. I sounded defenseless but I knew I wasn’t. I heard another series of footsteps and turned slightly, suddenly seeing a huge silhouette in my living room.</p>\n\n<p>I muffled a scream, covering my mouth with the top of my forearm as I slowly inched out of my room, quiet as a mouse. I held the bat in one hand and held my phone, ready to turn on its flashlight, in the other. The silhouette was a person, standing around my height and had a lanky build.</p>\n\n<p>I noticed some… “protrusions” coming off its form. They looked like strings, coming out of the person’s backside and ending in the back of their limbs. Were they tangled in cables?</p>\n\n<p>“I’m literally 3 feet from you with a weapon, buddy! Either turn and face me or turn tail and run!”</p>\n\n<p>They didn’t move. I suddenly heard the winding… a soft, almost silent winding of a… film projector? A single circular light like one from a flashlight suddenly emitted from the face of the silhouette, shining a huge circle of yellow light on the wall it faced.</p>\n\n<p>The light seemed to be… a reflection as it showed me. Sweaty, breathing harshly, carrying a bat and phone in my hands, wearing my pajamas. I backed up, realizing what the thing was projecting. My hand had a panicking reflex and pressed on my phone’s flashlight button. What I saw was utterly stomach-turning.</p>\n\n<p>The silhouette was a reanimated carcass, being left skinless as if it was freshly skinned and was reduced to a mostly flesh-covered skeleton. His tendons and veins were visible along with many of his bones, such as his spinal cord, a few ribs on his left side, chunks of his left thigh bone, part of the lower-half of both shins, and his right ulna, the outer forearm bone.</p>\n\n<p>The creature was covered head-to-toe in mechanical parts. I saw old-fashioned to advanced pieces melded into his flesh, ranging from rusted gears, cogs, broken loose wires, and bits of what looked like shrapnel to circuit-boards, computer parts, cords, hydraulics, and pistons. Some were even welded into his bones as nearly all of his left thigh was pistons wrapping around a metal femur made out of dull-gray metal and what looked like brass. His limbs were misshapen, his right arm looking longer than his left, seeing its joints were separated and elongated with mechanical parts replacing its cartilage and his right hip bared many exposed hydraulics, causing it to be longer than his left leg and causing him to be tilted to one side.</p>\n\n<p>The cords I saw were huge black cords sticking out of his exposed spine and being buried in huge gashes on the backside of his limbs. His head was the backside of a huge glossy-black mechanical film projector, film reel inserted and all. Waddling slowly, his arms swaying heavily, he slowly turned to me, revealing its head was indeed the film projector from the Discord image, scratches carved into the left side and the dirty splotches being some sort of dried blood.</p>\n\n<p>I noticed something, sloppily carved into the right side of his film projector head.</p>\n\n<p>“OS7”</p>\n\n<p>Oh my god, was that him? Was that the Discord user? Before I can question anything, the creature let out an imitating stomp in my direction. I responded aggressively, yelling “BACK OFF!” and trying to keep my composure the best I can.</p>\n\n<p>The creature took another step and I wasn’t taking any chances so I dropped my phone, grabbed the bat with my now free hand, and smashed it over the creature’s head. The bat exploded and wooden splinters and chunks went everywhere, leaving a broken handle in my hand. The creature wasn’t even faced and the glow of its projector face was the only now illuminating the room as my phone had landed back-down, covering its active flashlight.</p>\n\n<p>The creature didn’t even flinch but I’ll tell you what it did next, it screamed. Loud. It was a howl that sounded like mangled white noise. My ears were left ringing a good few minutes afterwards.</p>\n\n<p>The creature dived and took a swing at me, getting me in the cheekbone. I dropped the broken bat and started wrestling with the creature. Constantly, it swiped at me, snagging me with broken metal fragments sticking out of its body and even headbutted me at one point, getting me in that eye. That hurt like hell.</p>\n\n<p>Eventually, I managed to throw it into the dark laundry room as the door was left open prior. I slammed the door and held it shut with all my might. The creature punched the creature rapidly, letting an electronic moan every strike. I quickly swung my leg at a nearby wooden chair, knocking it down as I grabbed a hold of it with my foot and pulled it toward me. I briefly let go of the door, letting the creature slam it open as I picked up the chair. Before the creature can start toward me, I slammed the chair against its chest, pushing it back as I slammed the door and put the chair under the knob, keeping it shut.</p>\n\n<p>I backed up as the creature rose and started banging on the door again. I could see the yellow projector light shining from under the door but the chair did the trick. It was shut in there. After a few bangs, the light suddenly dimmed slightly before going out as the creature seemed to shuffle back and go silent.</p>\n\n<p>I dragged myself to my bathroom. I looked like hell. I had a couple gashes on my face and forearms, a bruise on my cheek-bone where the creature punched me, and a nasty black eye from the creature’s head-butt. I bandaged myself up, using a med-kit located in my backroom to bandage up my face and arms. I tried using toilet paper as a bandage but I was bleeding through it quickly. Think it snagged an artery in my arm. I was good though.</p>\n\n<p>I went back to my kitchen, grabbing a frozen bag of vegetables to use as an ice pack for my bruise and black eye. If you’re wondering about the clattering plates, there were broken plates on my kitchen floor.</p>\n\n<p>I went back to my computer, seeing that the private messages for OS7 were now absent.The static emitting from my speakers were also absent. Both gone entirely without a trace.</p>\n\n<p>I was done denying everything. I was literally attacked by a camera-faced zombie that spoke to me via Discord. I don’t know what to think anymore.</p>\n\n<p>Any attempt to call 911, a friend, or any sign of help via my phone or Discord will freeze up the program and cause to crash. I can’t contact anyone and due to the seemingly power outage, a lot of stuff such as my television and lights do not work.</p>\n\n<p>I came out of my bedroom a while later. I was doing better as my bruises were not burning in pain and my headache was long gone. I looked around my apartment and found how OS7 got in. A broken window behind some curtains where the creature was standing. Moving around the glass and wood fragments, I looked out the window.</p>\n\n<p>I had to leave. My own apartment was no longer safe, especially with that creature still in my laundry room. I decided to leave my stuff behind and just run so I swung my curtains open, seeing it was sunrise and jumped out, starting to flee. I was on the bottom floor of my apartment complex so luckily, I wasn’t falling out a window.</p>\n\n<p>I darted toward the street across from my complex, starting to call out for help. I saw no signs of any life and the sun seemed to be frozen in the sky, stuck in an endless state of mid-rise. That’s when I heard it.</p>\n\n<p>“REAP WHAT YOU SOW.”</p>\n\n<p>It was the voice, not that of the one that came through my speakers. It was a deep but loud grumble, emphasis on the “you” and almost sounded distorted. The voice had came from behind me. I turned very slowly to see the source of the voice.</p>\n\n<p>There, standing almost, I say around 7 feet, away from me, was another one of the reanimated carcasses. This one was huge, towering around me by a foot. It almost bared a skinless body, bones mostly exposed with cables fused to its exposed spines and entering the back of its limbs. This one had an actual head, being a large metal-lined human skull with two bright-glowing orange LED lights in its eye-sockets and a gaping jaw.</p>\n\n<p>Its arms were the most noticeable, being massive with large biceps and having two huge grasshopper-like arms from the elbow down, the wrists bending upwards and its heads a pair of huge pointed spikes. The creature stared at me, its orange eyes blinking as I noticed that I could see its internal organs through its exposed ribcage.</p>\n\n<p>Its heart, I think that it was, was still beating. Rapidly.</p>\n\n<p>Before I can respond, the creature rushed out, emitting a heart-stopping howl from its skeletal jaws. I lifted my left arm to protect myself as it reeled one of its huge arms up and brought it forward as I left to watch it literally impale the huge spike it had for a right hand through my forearm. The pain was unbearable and I screamed in agony as it ripped the spike out.</p>\n\n<p>It dove at me quickly as I spotted some sort of brass collar around its neck with the large letters “OS3” messily engraved into it. I attempted to push it off with my right arm but to no avail as it started to rapidly stab me in the chest, breaking my ribs. I screamed, coughing blood before the creature eventually brought it down to my forehead as everything went black.</p>\n\n<p>I woke up. In my bed. The nightmare was over. I looked up at my alarm clock. 12:45 PM. I rushed out of bed… only to find my bandages still wrapped around my arms.</p>\n\n<p>It wasn’t a dream. But… what just happened? I was still alive? That’s when it hit me.</p>\n\n<p>Whatever is happening to me… I can’t die. It won’t let me. I&#39;m in a loop of some sorts. I’ll feel the pain of death but it will bring me to where I started. I got out of bed, finding my computer still on, the chair still on the laundry door, the broken glass and plates, and the open curtains. My computer</p>\n\n<p>I saw OS3 across the street, staring through my broken window. Its orange eyes were still flickering and I can swear its arms and face were now caked red. I rushed forward and closed the curtains before returning to my computer. It still read 10:43 AM. I think OS3&#39;s attack that seemingly reset me to my bed had a slight effect on me because I got a pain in my arm where it stabbed me when I sat down in my computer chair.</p>\n\n<p>This is where I am now. I’ve been eating some cans of food out of my fridge but other than that, I’m trapped in this apartment. I have come here in search of help. I don’t know how I got here but I trapped him with a monster stuck in my apartment, one outside waiting for me to try and flee, and no sign of help besides the seemingly still active Internet. I may not get any response from Discord friends but the Internet is still living.</p>\n\n<p>Give me suggestions, ideas, help. Anything. Hell, give me ideas for something I could try out. I’ll respond to you the second I can if you have any questions. OS7 is dead quiet and I can hear OS3 howling outside while I try to sleep. I still don&#39;t know who Johnny is but it&#39;s safe to assume he might of suffered the same fate of OS7 and OS3. If you guys want to piece together the stuff thrown at me I can&#39;t decipher at the moment, I&#39;ll be glad to see what I can make of it. I’ll make an update to this when I find out something helpful or discover anything new.</p>\n\n<p>At the time of nearly uploading this, OS7 just banged on the laundry door. I heard it. I got up to check to see if he was trying to break out but there was no light emitting from the inside. I made sure the chair was still tight under the knob and I came back to my computer. I&#39;m getting chills.</p>\n\n<p>Poke signing off. I will return.</p>\n</div>\n","author":"pokemonxyrules123"}