{"rank":"108","title":"Coughing Up Black","id":"8kgr1t","url":"/r/nosleep/comments/8kgr1t/coughing_up_black/","time":"1526679721000","body":"<div class=\"md\"><p>I am dying. I know I am. I’m at peace with it. I thought about calling a lawyer and drafting a will, but it’s pointless. I have nothing to give, and nobody to give it too. Instead, I’m writing this. I doubt anybody but the mortician will read it, but I cannot die with this swirling around my head. I just can’t. Somebody, <em>anybody</em> needs to know about this place- this disgusting, hellish, monstrosity. Jasper would want me to tell his story, I think. So I have to. Excuse the typos- I’m up to my eyes on morphine at the moment. Somebody has to hear this.</p>\n\n<p>A year or so ago, I was practically homeless. Not, like, sleeping on the streets homeless, just <em>technically</em> homeless. I had just finished high school, and my alcoholic shit stain of a mother kicked me out. No love lost there. So, like any dumbass teenager, I couch-surfed and lived off friends all summer. It was all fun and games until fall rolled around, and everybody was getting ready to leave for college. Slowly but surely, everybody kicked me out of their living rooms, packed their bags, and went to get an education. That’s when Jasper took me in.</p>\n\n<p>Jasper was, without a doubt, the sweetest man I have ever known. We met sophomore year, and have been best friends ever since. He always looked out for me. He would quietly and humbly buy me lunch, or make sure I had place to stay when Mom had her fits. In exchange, I supplied him with all the booze and weed he could desire. Jasper was insanely wealthy- a trust fund baby or something. He was going to Northwestern, but I guess living in the dorms was too pedestrian for him. His dad had bought him an old condo in an up-and-coming neighborhood in Chicago. So, he offered me the spare bedroom. He was just that type of guy. A guy who would take in his transient friend during his first year of pre-med, no questions asked. </p>\n\n<p>Now would probably be a good time to mention the elephant in the bougie condo. Jasper lived on the 3rd floor of an historical 3 story walk up. Historical as in “no elevators allowed” - there was a plaque on the wall and everything. The issue with that is I’ve been in a wheelchair since I was a kid. It never really bothered me much. In fact, the chair has saved me from being arrested numerous times. I get around just fine most places. However, neither Jasper nor I were quite sure how’d we manage the 3 flights of stairs.</p>\n\n<p>He told me it was the most inaccessible place in the city of Chicago, and I told him it was either this or a shelter. Plus, Jasper was 6’2 and lifted weights. At my absolute heaviest I was 100lbs- he could carry me no problem. I begged him to let me stay, promising that I’d keep the place clean and learn to cook. So, being the obnoxiously generous and obscenely rich person he is, he agreed to take me in.</p>\n\n<p>The building was beautiful. Each floor was it’s own condo, but the first two floors were owned by the same old lady, and she spent most of her time in Florida. So, it was just us. I could <em>feel</em> the history seeping from the veins of the place. Even the 3 flights of perfectly crafted wooden stairs were stunning. When I arrived, Jasper, as promised, scooped me up and plopped me at the top of stairs, then went back down for the chair. If it were anybody else, I’d be embarrassed beyond belief. But not with him. We’d been through way too much for a staircase to be the demise of my pride.</p>\n\n<p>The first night was fine. We had some beers, ordered Thai, and turned in. I was used to drifting from place to place, and to the occasional homesickness I got in new places. As I lay in the fully furnished guest room that night, I tried to ignore the dread. I told myself it was just homesickness, maybe I felt trapped because of the stairs, or maybe I felt guilty. I worked so hard to convince myself that the voices screaming “GET OUT” in the back of my head were irrational. Words cannot explain the paralyzing fear I felt that first night. Like every fiber of my being was tuned in to some ancient survival instinct that was telling me to run. I shook under the covers. I dare not move in fear I disturb the creaking radiator. It’s worth noting that I lived in an abusive home for years, and I know what fear feels like. I know what it is to watch shadows dance and listen to creaks, in fear for you life. This was different. This was a deep, primal, unshakable terror. </p>\n\n<p>Ignore it, I told myself. Go to sleep. \nI eventually fell asleep. Morning came.</p>\n\n<p>It didn’t take long for Jasper and I to find our routine. He would leave in the morning to go to class, and come home in the afternoon. We’d hang out, have dinner, watch movies, and go to sleep. I hardly ever left the apartment, and most of the time, I was alone in that place.</p>\n\n<p>My plan was to get a job, make some money, and leave, but it soon became clear that wasn’t going to happen. That’s when the second strange thing started to happen.</p>\n\n<p>Nobody believes the cripple when they cry health problems. Of course I had health problems. There were always health issues, but this was different. I have lived in this body a long time, and the apartment was making me sick.</p>\n\n<p>It started mildly. Fatigue, nausea, puking, a rash. There was still a pit in my stomach, telling me to leave. To pack my bag and never look back. Get out, get out, get out! I ignored it, of course. Anybody would be a fool to turn down free room and board with their best friend. I knew, though, that the walls themselves were making me ill. Don’t get me wrong, I didn’t think there was some poltergeist right off the bat. I assumed it was allergies or something. The whole building was ancient, and I couldn’t even being to estimate the last time it was cleaned. At first, Jasper didn’t dare diagnose me. After all, he had only been in pre-med for a few months. The doctors didn’t try to diagnosis me either. They brushed it all off.</p>\n\n<p>The dread grew. The sickness grew. I tried to brush it off, too. We went on with our lives. We both knew there was something severely off about the place, but we dare not speak it.</p>\n\n<p>The third strange thing to happen was the night after an organic chem exam. Jasper and his doctor buddies were going out to drink. I was invited, but I declined. I felt sick, I didn’t want to hang out with rich kids, and I most certainly didn’t want a drunk Jasper carrying me up those stairs. So, I turned in, and fell asleep around 10pm. I locked the front door before I went to bed.</p>\n\n<p>Around 2am or so, I heard the door unlock and open, followed by heavy footsteps into the room next to mine. I heard the door to the master bedroom close and lock from the inside. I fell back asleep.</p>\n\n<p>In the morning I dragged myself out of bed, and, like the good roommate I am, decided to make a luxury breakfast of Lucky Charms and eggs. I called out to Jasper from the kitchen. No answer. I called out again. Nothing.</p>\n\n<p>I went to knock on the door to his bedroom. No answer. I knew he was awake, though. I heard him take a shower. I was on my way back to the kitchen when the front door opened, and in stumbled a hungover Jasper.</p>\n\n<p>“What the hell, dude?” I asked, trying to put it all together. “Did you just get home?”</p>\n\n<p>“Yeah, I crashed at Brad’s last night. Why? Are you okay?” He asked nonchalantly. </p>\n\n<p>I told him I had heard him come home late last night, that his bedroom door was locked from the inside, and I had heard him shower. His face went white and his eyes got massive. </p>\n\n<p>“You hear them, too?” He said, voice shaking. I’ve never seen him so shaken up. </p>\n\n<p>“I thought it was you! I thought- wait, what do you mean, “too?”” </p>\n\n<p>That’s when he told me that he often heard heavy footsteps late at night, and knew it obviously wasn’t me. He said he tried to brush it off as stress from school or sleep deprivation, but that he couldn’t shake a feeling of abject horror. That he felt it since he moved in. </p>\n\n<p>I would have accused him of joking, but I knew he wasn’t. He looked too scared, and the fact that he hadn’t accused <em>me</em> of joking meant he had his own experience with this. We decided then to search the house for an intruder. We found nothing. Jasper went to break open his bedroom door. I watched him touch the door handle and immediately recoil.</p>\n\n<p>“Fuck! Hot!” He screamed, holding out his right hand. It looked red and burned, like he had just touched an iron. I didn’t smell smoke, though. I don’t know why, but I reached out for the door handle. </p>\n\n<p>“It’s fine, it’s not hot at all…” I said, confused. The door wasn’t even locked anymore. It swung open, and we both stared into Jasper’s intact bedroom. And yet, his hand was clearly burned. He looked terrified. </p>\n\n<p>From that day on, we decided to look for a new place. We didn’t get out in time, though.</p>\n\n<p>I became sicker and sicker. I barely left my bed for weeks. I was constantly hacking up blood, shaking with fever, and just too weak to move. It fell on Jasper to bring me food, help me to the bathroom, and do the house work. I can’t describe the guilt. I know he didn’t mind, I know that he was too consumed with the same dread I had felt on my first night, but still. Not to mention, between going to class and playing nursemaid, he hardly had time to look for new housing. </p>\n\n<p>The illness wasn’t the only thing that grew, either. Our joint paranoia spiraled out of control. The creaks, the footsteps, the voices in our heads- all of it became more and more intense. The only thing I could think was “why?” Why was this happening, what was happening, how could we stop it? Were we both going crazy? It was the only explanation I could think of. A shared delusion. But it wasn’t, I know it wasn’t. There were too many tangible signs of… It. Too much illness and dread for it to just be a figment of our collective imagination. </p>\n\n<p>One day, maybe a month or so after the door handle incident, we had a particularly loud night. Banging on the walls, hissing whispers telling us to get out, footsteps. Jasper was sleeping on my floor, both of us afraid to be alone. We were at a wits end, barely holding on to sanity. Out of nowhere, he got up, stormed into the living room, stood on the couch, and screamed:</p>\n\n<p>“I’m not scared of you! This is my house! You won’t drive me away, you aren’t even real! I will not leave!” He yelled it over and over again at the ceiling. I watched him from the bed. He stood there, panting for a moment, before he fell to the ground.</p>\n\n<p>“Jasper?!” I called from the bedroom. No response. He was convulsing. It took every ounce of strength I had to get up and heave myself into the living room.</p>\n\n<p>This wasn’t a seizure. I don’t know, maybe it was? But I’ve had seizures before and… they weren&#39;t like this. His body convulsed so aggressively I could hear bones snap. His back arched off the floor completely, and his eyes were fixed open and staring blankly ahead. It was inhuman looking.  A thick, black goo oozed from his mouth. It wasn’t blood- it was pitch black and bubbly. It looked like boiling tar. I’ve never seen anything like it in my life. </p>\n\n<p>I was frozen for a moment, watching him writhing on the floor, totally unconscious. The dread was growing, growing, growing. I threw my back against the wall in fear that something was behind me and called 9-1-1.</p>\n\n<p>It was too late.</p>\n\n<p>I screamed, I cried to the operator. I begged her to please help me save my best friend. By the time I had managed to sputter out our address, he wasn’t seizing anymore. He wasn’t breathing, either, and the black goo wasn’t streaming from his mouth anymore. I’ve never felt more helpless in my life. It aches to even write about.</p>\n\n<p>The operator instructed me on how to do CPR. I went over to him and threw my hands onto his unmoving chest. I yelped.</p>\n\n<p>He was <em>hot</em>. Not just feverish, but burning. Untouchable. Both of my hands were red and blistering. I couldn’t touch him. I couldn’t save him. I tried to explain this to the 911 operator, but between my shrieks and sobs and unbelievable story, I don’t think she got a word of it. By the time the EMT’s got there, it was over.</p>\n\n<p>I hardly even remember what happened next. They touched his body and were not burned by it. They put him in a body bag. They bandaged my burned hands and brought me to the hospital in the back of an ambulance. I was interviewed by a million cops. I guess by that point my own sickness combined with the trauma of what I had just seen was too much for my body to handle. It is all a haze of fear and fever beyond this point.</p>\n\n<p>At first they thought I was crazy. Hell, even I thought I was crazy. It didn’t matter, though. I’d rather be in a psych ward than in that condo. It didn’t take long for them to run some diagnostic tests and realize the extent of my mystery illness, and they moved me to a general floor. I’ve seen more doctors in the past few weeks than I have in my life. I’ve started coughing up black-tinged blood. They don’t have an answer for any of my symptoms, but they are getting worse and worse. I don’t even care anymore. I am happy to be a teaching lesson for eager residents and nursing students. I know that those walls killed him, and that they are still killing me. Even from afar, from this hospital room. I can’t get away from it.</p>\n\n<p>I don’t know what killed Jasper. His parents refuse to show me the autopsy report. All I know is that the official ruling was “natural causes.” I also know his parents are going to sell that condo. Nobody listens to me. It doesn’t matter. It won’t bring him back. It won’t undo this feeling of dread and death I cannot shake.</p>\n\n<p>I hate to be abrupt, but a nurse just walked in, and I think I’ve got down all the important parts anyway. I’m too hazy from the drugs to write more. But, please, if you are looking for a condo in Chicago, don’t move in to the 3rd floor of the yellow building owned by the Historical Society. It’s not worth it. Please, you have to believe me. It will kill you. Please. Somebody has to believe me.</p>\n</div>\n","author":"grey_lavender"}