{"rank":"53","title":"Case #7- The Village of Lost Souls- Part 3","id":"8kgtiv","url":"/r/nosleep/comments/8kgtiv/case_7_the_village_of_lost_souls_part_3/","time":"1526680394000","body":"<div class=\"md\"><p>(Part 2 can <a href=\"https://www.reddit.com/r/nosleep/comments/8jzpg7/case_7_the_village_of_lost_souls_part_2/?st=jh9rml9n&amp;sh=ddba90ed\">be read here.</a> )</p>\n\n<p>I handed a cup of chamomile tea to Jane Neal, Mark’s mother. She took it and smiled at me. “Thank you, honey. What did you say your name was again?”</p>\n\n<p>“Emily.”</p>\n\n<p>“Thank you, Emily. And you’re Mark’s girlfriend?”</p>\n\n<p>“No, miss. We’re distant cousins.”</p>\n\n<p>“Right, right. Well, you treat him right, you hear? He’s a sweet boy.” She sipped her tea and promptly forgot I was in the room. I smiled to myself as I walked back to the kitchen. We’d explained our cover story to Jane half a dozen times but she kept making her own ideas about who we were. It probably wasn’t necessary to keep it up for her but we stuck by it anyway, just in case someone else started asking questions.</p>\n\n<p>I sat down at the kitchen table and opened my laptop. I hadn’t been able to find anything relevant about the town online, nor had I much luck figuring out what the ritual I saw in my vision was. Moxxy was researching the same things at the local library and Mark was at his job, but he promised to ask his coworkers if any of them knew something about the town history. A few hours passed and I still had bupkis to show for my efforts. I thought about calling Donnie, I was sure someone with his skills and connections could find out everything there is to know about Dodgerton Village, but things with Donnie had been weird ever since our struggle against Maximilien Martin. It made sense, he’d been exposed to a lot of traumatic things during that time: being brainwashed into trying to kill us, suffering severe burns and injuries when he tangled with Hannah, becoming an unwilling accomplice to a domestic terrorism plot. It made sense he’d be a little distant from us.</p>\n\n<p>I decided not to call him.</p>\n\n<p>Moxxy returned later with a book from the library. It was a thick, textbook-like volume entitled A Brief History of Dodgerton Village. The thickness of the book didn’t give me much hope for it being as brief a read as it claimed. Luckily, Moxxy had already done the hard work for me. She opened it to a page with a pink book mark and pointed to a section called: The Dodgerton Failure. “I found something juicy here. I don’t know if it’s related to what’s going on with Mark, but it sounds like the kind of thing we should keep in mind.”</p>\n\n<p>I read the passage. Apparently the first attempt to establish Dodgerton was, as the title suggested, a failure. Around two hundred people first settled the area. They were doing pretty well for three years but during the winter of the third year, there was a massive blizzard in the area that cut off all outside contact with the world for weeks. When some traders finally made their way to the village, they found every man, woman, and child in a mass grave dug in the center of town. It was assumed at the time that Indians were responsible. The traders returned to neighboring towns to report what they found and a priest named Jebediah Kingston led a company of people to reclaim the town. On his orders, they burned everyone in the mass grave and settled into their abandoned homes. They were successful in their colonization attempt and Dodgerton Village has been lively ever since.</p>\n\n<p>“Kingston?” Gears turned in my head. “That was the name of the guy who built the mortuary. Kingston Mortuary.”</p>\n\n<p>“And that’s the same place you sensed all that bad juju.” Moxxy smacked the book. “I told you I found something juicy.”</p>\n\n<p>“You did real good, Moxx. Thank you. The mass grave in the center of town, is that the literal center? And is the center back then the same as it is today?”</p>\n\n<p>She shrugged. “Beats me. I can look into it more if you want.”</p>\n\n<p>“Please. Okay, you take over laptop and mom-watch duty for a bit. I want to get a closer look at that mortuary.”</p>\n\n<p>“You better not go in without me!”</p>\n\n<p>“We’re not there yet. Don’t worry, when the time comes, you can be my accessory to breaking and entering.” I left Moxxy there and headed to the mortuary. Maybe I couldn’t get inside yet, but the cemetery was open to the public, so I could at least get an up close look.</p>\n\n<p>There were three entrances to the mortuary. Two were padlocked shut but a side entrance, blocked off from the cemetery and public road by a gate,  had no door at all. The windows were also all blown out, probably from the intense heat of the fire that had claimed the mortuary. Despite the fire damage, the walls and foundations looked strong enough to keep the building from collapsing should Moxxy and I decide to enter. The negative aura that surrounded the place was powerful. If we did decide to enter, I’d have to forcibly suppress my psychic vision to keep from being overwhelmed by the energy.</p>\n\n<p>There were other negative auras in the cemetery as well. Though most cemeteries always had some residual sadness and grief due to the attentions of the bereaved, some of the auras I sensed were different. They were too strong to be ordinary.</p>\n\n<p>Two graves in particular caught my attention. The closer of the two belonged to William Neil, Mark’s father. The ground seeped dark energy, though it wasn’t as intense as the aura surrounding the mortuary. I moved onto the next grave, which belonged to an eight year old boy named Tony Gillespie. According to the date on his tombstone, he’d died only a few weeks before William.</p>\n\n<p>I was ready to jump to a conclusion: William and Jane Neil were the victims of supernatural attack, one powerful enough to leave a trace of dark energy, and if something didn’t change soon, Jane was going to die. I couldn’t figure out how the boy fit into the scheme of things though. The attacks on Mark’s family seemed deliberate and targeted, first the husband, then the wife. But why kill a single random child? Perhaps the man behind the attacks was new to using curses and practiced on the boy first. Or maybe the child wasn’t random at all. I asked Mark about it when he returned from work.</p>\n\n<p>“I heard something about the kid, but I don’t know the family. I don’t think Mom and Dad were friends with them either.”</p>\n\n<p>“Are you sure the kid’s a part of this?” Moxxy asked.</p>\n\n<p>“He had the same aura on his grave that William did and Jane’s surrounded by it. I don’t think that’s a coincidence. Someone murdered William and Tony and they’re trying to do the same thing to Jane.” We were all quiet for a moment as Moxxy and Mark digested my information. I went to Mark’s side and squeezed his hand. “Hey, we’re going to protect your mother and we’re going to find out who’s doing this. I promise.”</p>\n\n<p>He gave me a grateful smile but I could tell his fears weren’t alleviated. I didn’t expect them to be.</p>\n\n<p>Moxxy and I did our best to ward Jane’s room from dark magic. Salt is often used as protection from the supernatural, so we created a barrier around her room, connecting every corner. We added it to the window frames as well. It would need to be replaced every night, since opening the bedroom door would break the salt line, but that was doable. We also burned sage in every room to cleanse the house. I had no idea if any of our precautions would work. Hannah might have the knowledge to make an effective protective ward but Moxxy and I weren’t witches.</p>\n\n<p>I was worried. We were two days into the case and everything we found so far had only raised more questions. Time was running out for Jane. From the information provided to me by Mark, I’d made a rough timeline of how long it’d take the curse to kill Jane and if our salt barrier and sage didn’t stop or slow the curse, she had a week at most.</p>\n\n<p>When I took the case, I wanted to prove myself. I wanted to be useful to the group beyond being a pair of psychic eyes. Donnie had his tech skills and the ability to kill people easily. Moxxy had a knack for research and could handle herself in a fight. Jacob had a way of getting people to open up to him and an uncanny accuracy for knowing what was supernatural and what was faulty wiring and gas leaks. Sometimes I thought there was a higher power feeding him information. But me? I could see and sense certain energies. That was it.</p>\n\n<p>And it was becoming clear to me how in over my head I was. Proving myself wasn’t worth sacrificing Jane’s life. Before I went to sleep for the night, I sent emails to Jacob and Donnie explaining what was going on. They were hundreds of miles away, but maybe they could still help.</p>\n\n<p>I heard crying while I was dozing off. It was Mark, in the other room. I swore to myself I’d do whatever was necessary to save what was left of his family. Even if it took everything I had.</p>\n\n<p>(Case #7 will <a href=\"https://www.reddit.com/r/JacobMielke/\">continue in an update.</a> Updates are posted every Monday, Wednesday, and Friday. Mielke Investigations is an <a href=\"https://www.facebook.com/jacobmielkeswriterprofile/\">ongoing account.</a> )</p>\n\n<p><a href=\"https://www.reddit.com/r/nosleep/comments/8l721u/case_7_the_village_of_lost_souls_part_4/\">Part 4 can be read here.</a></p>\n</div>\n","author":"JacobMielke"}