{"rank":"1","title":"Woke up to the bus driving in another dimension (part 4)","id":"8kgwra","url":"/r/nosleep/comments/8kgwra/woke_up_to_the_bus_driving_in_another_dimension/","time":"1526681216000","body":"<div class=\"md\"><p>So much has happened since I last updated. So much.</p>\n\n<p>It didn’t take me long to wait at the bus stop again. It was literally two days of non-stop thinking about everything that had happened. I hadn’t even gone back to work yet. I couldn’t get it all out of my head.</p>\n\n<p>Except as I waited there for the second time, the minutes wore on, and the minutes became an hour and an hour became two. I crushed the cigarette under my trainer at half past two in the morning, fingers numb and freezing, and blew out the smoke. A car drove by, followed by another. It was different to last time, it wasn’t empty. Somehow I knew that meant he wasn’t going to come. Two and a half hours was long enough to wait, so I turned around and headed back down the hill, back home.</p>\n\n<p>The next day it was the weekend and I chose to stay at home, I hadn’t made any plans. So I sat there on my PS4. But nothing felt real anymore. True I had lost meaning in my life before all of the outer dimensional events that had happened, but after all of that, I sank even further. I had no direction. No drive. No knowing what I should do. I was lost. I knew the facts, I just couldn’t bring myself to make any conclusions.</p>\n\n<p>There was a loud knock on the door and I jumped, grabbing the remote and lowering the volume of the tv.</p>\n\n<p>I waited. Who would be knocking? None of my friends mentioned coming over, in fact, ever since the bus ride, I hadn’t even spoken to them at all. Maybe that was why they had come over?</p>\n\n<p>The knock sounded again and I stood up, walking over to the top of the stairs and looking down at the door. It was him, he was there, shades and all. I could see him through the door window and he looked up at me.</p>\n\n<p>Running down the stairs, I unlocked the door, staring up at future me. His bike was parked up behind him.</p>\n\n<p>“You alright?” he asked, pulling off his shades. “I couldn’t make it last night, sorry about that. I was caught up.”</p>\n\n<p>“It’s okay,” I didn’t mention I had been waiting for hours. I simply stood to the side and allowed him to come in.</p>\n\n<p>He went up the stairs and I locked up, following him. When I entered the living room, I saw he was looking around. The game was still on the screen so I switched it off.</p>\n\n<p>“Want a cuppa?” I asked him.</p>\n\n<p>He nodded. “Yeah, please,” he then dumped his bag on the floor and sat down on the sofa, still staring around.</p>\n\n<p>I laughed a little nervously. “If I’d have known you were going to come I would have tidied up,” I eyed the clothes strewn everywhere, the unwashed dishes, the odd bits and pieces just flung all over the place. I switched on the kettle.</p>\n\n<p>“So erm…living on your own?” he questioned me suddenly.</p>\n\n<p>“Yeah,” I replied.</p>\n\n<p>“This used to be mine and my wife’s place,” he said, nostalgia in his eyes as he inspected everything. “It looked a bit more…lived in though…”</p>\n\n<p>I rolled my eyes. “We did live here for a bit, and now we’re not.”</p>\n\n<p>He eyed me curiously. “What happened?”</p>\n\n<p>“Why do you have to know?” I angrily stirred the sugar in.</p>\n\n<p>“I don’t…I just…you don’t understand what kind of life I had with her. I would never trade it for anything. I would never want to lose those memories either. Ever…” he sighed out. “But to know you…my past…you don’t have them…”</p>\n\n<p>“I don’t want to talk about it. She’s gone, there’s no use bringing up those memories.”</p>\n\n<p>He sat back and inspected me, “fine, fine.”</p>\n\n<p>I handed him the cup of tea.</p>\n\n<p>“Thanks.”</p>\n\n<p>I didn’t have much furniture about, I lived in small space so I sat on the floor opposite him.</p>\n\n<p>“I tried to go see my dad yesterday.”</p>\n\n<p>My eyes lit up. “Oh yeah…?” a thought suddenly occurred to me. “Can I go see him?”</p>\n\n<p>“What? No.”</p>\n\n<p>I was suddenly excited. It was a possibility wasn’t it?</p>\n\n<p>“No,” he answered suddenly. “You don’t understand.”</p>\n\n<p>“Understand what?”</p>\n\n<p>“Look erm…” he took a sip of tea. “There’s something wrong. I tried to go visit him. But every time I try to return home, I’m in the wrong timeline, yours. Us two, our timelines, something’s gone wrong. I’m travelling in a different timeline, my past. It isn’t right. I don’t know how, but I’m suddenly attached here, stuck. Something’s fluctuated.”</p>\n\n<p>I was suddenly worried. “Shit…so…you’re stuck here?” I asked.</p>\n\n<p>“As far as I can tell. I don’t know Dan. I don’t know what got fucked up. Something’s gone wrong.”</p>\n\n<p>“When was the last time you went and visited dad? Mum? Anyone?”</p>\n\n<p>He sighed. “Years ago now. Just after my wife passed…”</p>\n\n<p>Wife, I thought. Jesus. “Why didn’t you go see them?”</p>\n\n<p>“I just wanted to be away from everything. I wanted to be distracted from what happened. When I left, it was always hard to go back to reality, be away from the other dimensions. When was the last time you went and visited your mum?” he asked me instead.</p>\n\n<p>I shrugged. “Dunno…maybe a couple months ago.”</p>\n\n<p>He scoffed. “And how is that any better? She doesn’t even live far either.”</p>\n\n<p>“I’ve been busy,” I argued back.</p>\n\n<p>“I can see that.”</p>\n\n<p>I suddenly hated future me. He was a dick. “Why are you here anyway?”</p>\n\n<p>“We need to sort this,” he said simply.</p>\n\n<p>“We? It’s your problem.”</p>\n\n<p>He stared at me, almost in disbelief. “Really?”</p>\n\n<p>“What? I honestly don’t know how you want me to help you. I don’t know what to do. If you don’t know, what makes you think I will know what to do?”</p>\n\n<p>“Christ? If you were like this, no wonder your girlfriend left you.”</p>\n\n<p>“Why do you keep going on about her?” I exclaimed. “She has nothing to do with this!”</p>\n\n<p>He sat silently then, and so did I.</p>\n\n<p>After a while, he stood up. “Right. It’s clear you don’t want to help. I won’t waste my time then. Just let me know where she is and I’ll be off.”</p>\n\n<p>I stood up too. “Why do you need to know where she is?”</p>\n\n<p>“I have a feeling she’s connected. If you won’t help, I’m positive she will want to instead. So…where is she? Her mum’s?”</p>\n\n<p>I shrugged. “I honestly don’t know. It’s been a long time.”</p>\n\n<p>“You follow her on Instagram or anything?”</p>\n\n<p>“I blocked her a long time ago. On everything before you ask.”</p>\n\n<p>He sighed. “Fuck sake…what did she do for you to hate her?”</p>\n\n<p>I couldn’t answer him. What did she do? “Nothing. She didn’t do anything.”</p>\n\n<p>“She just left you? Over nothing?”</p>\n\n<p>I didn’t answer, so he turned away and walked down the stairs. I followed him. “How are you going to find her?”</p>\n\n<p>“Gonna see her family, ask them.”</p>\n\n<p>“What makes you think they will even wanna talk to you?”</p>\n\n<p>He looked at me. “You know I don’t remember being as negative as you.”</p>\n\n<p>“You just here to offend me?” I shot back.</p>\n\n<p>He unlocked the door and left without saying anything. I turned around and went back to the living room, back to my games. I stared at the cup of tea he had left, hardly finished.</p>\n\n<p>Shit. What did I just do?</p>\n\n<p>I stood up and smashed my controller across the room. It slammed into the drawer and left a dent in the wood.</p>\n\n<p>It took me fifteen minutes to decide to get up and chase after him. I grabbed the jacket, helmet and the previously packed bag I hadn’t touch since the last time I had seen the biker. I caught the bus at the top of the road and used the maps on my phone to figure out how to get to my girlfriend’s family’s house once I sat down. Ex-girlfriend.</p>\n\n<p>Shit, shit. Fuck life.</p>\n\n<p>I kicked the seat in front of me which caused a few people to turn back and look at me. But I ignored them. Why was this even happening? I wanted the past to stay in the past. I didn’t want anything to do with her anymore. I had let go. I had forced myself to forget all those years ago. Why was it back?</p>\n\n<p>I stared out the window for a few minutes and figured out that I had to take two buses to get to the house. I was never going to catch up with the biker, he was probably already gone by now, searching. What would I do once I got there? Would I speak to the family?</p>\n\n<p>I squashed the questions away to the back of my mind and scrolled through Facebook and Instagram to distract me from everything. I didn’t want to think about that shit.</p>\n\n<p>Once I was at the bus station, I was so tempted to just take the bus back to the house, leave all the bullshit I was getting myself mixed up into behind me. But I don’t know how, I forced myself to wait for the second bus. I waited for five minutes, it was taking too long, every second was stretched out, prolonged. Every second felt like a minute. It was torture. I scrolled through reddit, bbc news, come on bus, my leg was shaking out of nervousness. Was it nerves?</p>\n\n<p>Once it arrived and I was sat on the second bus on the top deck, I inhaled deeply, feet up on the window in front of me. I gripped the helmet tighter and stared around. There was no one else on the top deck so far and I was once again tempted to go back downstairs and jump off, to just go home, back to that empty flat where there was nothing. No problems, no drama, nothing. It was easy there. I stuck my earphones in and blasted the music out, drowning out anything that dared pop up into the consciousness of my mind. I forced any thoughts back. I didn’t want to think.</p>\n\n<p>The bus journey took forty minutes. I spent the entire time on my phone, refreshing every social media feed I had, scrolling, browsing. When I got close I finally looked up and tried to figure out which stop I was going to get off at. I surprised myself when I got off at the right one. I recognised the streets.</p>\n\n<p>Standing there for about a minute I looked around. The houses on the main road were familiar, the sandwich shop on the corner, the red bricked buildings, the small park. I looked left then right and crossed the road. Walking the streets felt weird. Once I was on the right street, my heart was thumping as I approached the house, I could see it in the background.</p>\n\n<p>Shit, shit, shit.</p>\n\n<p>That was all I could think about as I walked up.</p>\n\n<p>To be honest, I had never been to her family’s house. It was the first time. I knew I wasn’t going to be welcomed.</p>\n\n<p>Once my feet hit the driveway, I stopped and stared at the building. The curtains were open and when I looked up I saw her brother in the window. He locked eyes on me and suddenly turned away and vanished. I waited. He was walking down the drive towards me after a few seconds.</p>\n\n<p>“What are you doing here?” he questioned. I had forgotten how tall he was and I didn’t know what to say. He was suddenly in front of me and I swallowed.</p>\n\n<p>“Did a biker come here by any chance?” I asked him.</p>\n\n<p>He looked me up and down. “Yeah. Was looking for my sister. What do you want?”</p>\n\n<p>“I’m looking for the biker,” I replied simply. I didn’t want to complicate things.</p>\n\n<p>“Why? What’s going on?”</p>\n\n<p>“It’s complicated, I don’t want to explain it,” I tried to get away with that explanation. “What did you tell him?”</p>\n\n<p>“I told him to go to the airport, because she ain’t anywhere near here. I gave him the last hotel she was at and that’s it. He isn’t going to find her.”</p>\n\n<p>The airport. Shit.</p>\n\n<p>“Why are you both looking for her?” he asked me viciously.</p>\n\n<p>“I’m not looking for her,” I replied. “I’m just looking for the biker.”</p>\n\n<p>“Why is he then? Who is he? Does she know him?”</p>\n\n<p>“Yeah, she does know him,” I said. “Didn’t he say anything?”</p>\n\n<p>“He said he knew her, was a friend from where she used to work. He gave me his number in case she contacts me or comes back home. The fucks going on Dan?”</p>\n\n<p>I exhaled. “Can I have the number? I need to call him.”</p>\n\n<p>He pulled out his phone and read the number out loud which I put into my phone. “He’s a friend of hers, they haven’t seen each other for a while. I just met him. He’s a good guy, you don’t have to worry about him,” I explained.</p>\n\n<p>“Why are you involved then? She left you.”</p>\n\n<p>“I know,” I looked at him, right in the eyes.</p>\n\n<p>“Don’t get back with her,” he suddenly warned me. “You ain’t worth her.”</p>\n\n<p>It still hurt. The words sunk into my chest and I was angry. I was immediately defensive. “You don’t have to worry about that, I don’t want her back,” I lifted my hands up and shrugged. “Thanks for the number, I gotta go now.”</p>\n\n<p>He nodded once. “Seeya.”</p>\n\n<p>“Seeya.”</p>\n\n<p>I turned my back on him, on the house and walked away as swiftly as I could. I breathed normally and called the number, trying not to dwell on what just happened.</p>\n\n<p>It rang a good few times before he picked up.</p>\n\n<p>“Hello?”</p>\n\n<p>“Hi…it’s…it’s me, Dan.”</p>\n\n<p>“Dan?” he sounded surprised.</p>\n\n<p>“Yeah, where are you?”</p>\n\n<p>“The airport…”</p>\n\n<p>“Can you come and pick me up by any chance?”</p>\n\n<p>There was silence for a long while. I figured I was going to have to get back on the bus and back home then.</p>\n\n<p>He sighed. “Fine. Where are you?”</p>\n\n<p>I looked at the street and saw where I was. “I’ve just left her house and I’m on the bus stop on the main road.” Fucking bus stops.</p>\n\n<p>“I’ll be like an hour and a half.”</p>\n\n<p>I sat and waited.</p>\n\n<p>He took a long while to arrive, so I visited the sandwich shop and bought myself a chicken sandwich, I barely had an appetite though and threw half of it in the bin. I bought a new pack of cigarettes, browsed the internet, briefly considered that I should stop smoking and walked up and down the street. I did anything to pass the time. I kept my head down and hoped none of her family would walk by me. Thankfully they didn’t and when the biker did arrive, I jumped on the motorcycle immediately and he sped off, without saying anything. He didn’t even say anything when he parked at the side of the road, just motioned for me to hurry up. When he did eventually stop after maybe ten minutes, I noticed he stopped in front of a burger place.</p>\n\n<p>“Let’s get something to eat,” he said.</p>\n\n<p>We walked into the restaurant and ordered. He paid for the food and chose a table by the window. I dumped my bag and helmet at the side of me, sitting and staring around. We sat in silence as we waited for our food. It was awkward. But once it arrived, the biker began speaking after shovelling a few mouthfuls of rice into his mouth first.</p>\n\n<p>“Why did you decide to come along?”</p>\n\n<p>I shrugged, jabbing the grilled chicken with my fork.</p>\n\n<p>He slammed a fist on the table. “Christ Dan if you’re here, you best start giving me some worded answers. Otherwise you can fuck off back to your shitty empty flat.”</p>\n\n<p>That startled me. “I don’t know!” I shook my head. “I just…you left and I…I don’t know for fucks sake okay. Why are you asking me these stupid questions I’m here aren’t I?” I exclaimed angrily.</p>\n\n<p>The biker stared at me and lowered his knife and fork. “You are here, that is right. With a shitty attitude as well.”</p>\n\n<p>We ate in silence for a few minutes. Things were going from bad to worse.</p>\n\n<p>“We’ve missed the plane to Iceland,” he said.</p>\n\n<p>“Okay…” Iceland? Jesus? Is that where she was?</p>\n\n<p>“So there’s another way through a portal but you know…it goes to a complicated place.”</p>\n\n<p>“Why didn’t you just go through there first?” I asked him.</p>\n\n<p>“Because it’s complicated,” he repeated.</p>\n\n<p>“Can’t be that complicated if you’re willing to go now,” I said and he glanced up at me, almost furious. I didn’t know what was wrong me, I was suddenly in a bad mood.</p>\n\n<p>Once we finished the food – thankfully I had managed to eat it all – we took off on the bike again but it wasn’t for very long. He stopped at a store where he told me to stay with the bike in the car park. I remained where I was and waited. He was probably sick of me. He wasn’t long though and when he did return, he had in his hands a couple of thick coats and snow boots for freezing conditions. He had gloves, hats and what looked like a portable heater.</p>\n\n<p>“Put these on.”</p>\n\n<p>We both zipped the coats up and I felt like a marshmallow. Was there really a need to wear them on the bike? I held my tongue though. I was suddenly boiling even if it was cold, where had he even bought them from? But I didn’t question him. Instead he set off and he rode for hours. We rode through the main streets first, then the motorway which we were on for a long time. Miles and miles. I noticed he was speeding and the speed cameras were flashing every time he went passed them, but he ignored every single one. He didn’t have a registration plate on the motorcycle so I guessed he would never get sent a fine. A few times though, he zoomed passed police cars that were parked up specifically to spot speeders. But instead of slowing down he sped up, weaving between cars and escaped. People horned at him, yelling and gesturing, but he took no notice. He seemed to have zoned everything out. My heart was beating at every close call he made. It was exhausting.</p>\n\n<p>Eventually we left the treacherous motorway and arrived at some national park where we were surrounded by majestic hills. It was beautiful. In due course though, he abandoned the winding roads and sped right onto a field. He left a deep track behind him in the grass and the sheep that were in the way ran and skittered away. The bike was still fast though, the surface underneath the wheels didn’t slow it down. I watched the animals run in fright, and the sky darken. The sun was almost about to set.</p>\n\n<p>The biker however continued on until we were truly in the middle of nowhere. He ascended the hills, higher and higher, climbing peak after a peak and I realised we were riding through the mountains themselves. It was stunning. Scary, but absolutely stunning. My adrenaline was spiked. We went higher still and by the time the sun was completely gone, he came to the edge of a cliff and didn’t slow down. When I realised where he was headed towards, I panicked. There was nothing but a drop in front of us. There was nothing but black sky at the other side.</p>\n\n<p>I tapped on his shoulder heavily. “There’s a drop!” I yelled out.</p>\n\n<p>But he didn’t stop. He acted like he hadn’t heard me and the bike sped right over the edge. The wheels and engine roared at the sudden loss of traction and my stomach dropped heavily, plummeting down to my feet. My breath was gone and we were falling down into the black.</p>\n\n<p>The wind roared and I screamed and screamed.</p>\n\n<p>Fuck the biker’s gone mad.</p>\n\n<p>There was a sudden pop and my breath was taken away from me once more, as did the screaming of my voice. I was completely suppressed. But we were still falling further down and down. I didn’t feel like I was floating, it felt like the pit of my stomach and the base of my spine was being pushed. It was the most horrible feeling ever. Jesus I thought my body was going to be ripped in half for a moment and then…</p>\n\n<p>Everything was white.</p>\n\n<p>And freezing.</p>\n\n<p>Looking around I saw we were in the middle of some snow land. The floor was covered in nothing but white, the sky above was white, and there was a good flurry of flakes coming down. However, looking ahead, I saw there was an entrance to a massive cave that was coated in snow and ice. There were icicles the size of me hanging dangerously from the top.</p>\n\n<p>“Let’s go,” the biker said, placing our helmets in the box and then making his way to the cave.</p>\n\n<p>I scrambled off the bike, trying to catch my breath and trying to keep up with everything that was happening. My heart was still racing from being plunged off a cliff. We trudged forward, through the snow, which was deep, like it had been falling for years. It was up to my knees and the horrible memory of being buried alive by gravel began haunting me.</p>\n\n<p>“Hurry up!” the biker yelled at me. He was once again metres in front. Would it kill him to wait for me? I thought angrily.</p>\n\n<p>Something caught my eye in my peripheral vision and looking towards the right, I saw that in the background, barely visible through the snowy haze was a gigantic thing moving about. It was slow and lumbering, white as well so it was camouflaged into the background but it was gigantic. I had no idea what it was but I hurried along.</p>\n\n<p>“What was that?” I gasped out, catching up to the biker in the mouth of the cave and wiping away the snow from my eyes. I looked up at the thousands of precariously hanging icicles above me.</p>\n\n<p>“Nothing, let’s go,” he stalked forward and I followed. The cave was dark, but looking at the floor, the cracks and fissures there, were dully glowing an icy blue. The walls were round, like the cave had been drilled out by a massive machine. The grooves in the stone were also covered in what looked like symbols, writing all around and continuous as we walked through. My breath misted out in front of me, it was bitter.</p>\n\n<p>Eventually we entered a cavern. It was domed, gigantic and beautiful. The ceiling above had what seemed like a massive map engraved into the rock, and it was constantly shifting, almost like the stone was almost liquid but actually not. I stared up at it, mesmerised, what was that? Was it a map of Iceland? The land’s shape seemed like Iceland. The icicles that hung from the ceiling in odd places were even bigger than the ones at the entrance and the runes or the symbols were still covering the walls. The glowing cracks were everywhere.</p>\n\n<p>The biker stopped by a bell that was stood in one corner by a wall, which was held up by stone arches. He grasped the clapper and swung it against the metal. The deep sound rang through the entire cave and we waited. I didn’t know what for, and I didn’t dare ask him.</p>\n\n<p>We waited for a while. I was shivering and becoming frustrated. We were stood for five minutes, then ten, then fifteen. I stood staring around, wondering what we were waiting for, watching the moving map and inspecting the light coming from the cracks. After half an hour I said something.</p>\n\n<p>“Why don’t you ring again?” I suggested to the silent biker, he hadn’t moved or said a thing since he had last rung it.</p>\n\n<p>“No,” he answered without looking at me. He still had his shades on. It made him seem even more emotionless and still.</p>\n\n<p>I needn’t have said anything though. The floor began quaking, there was a deep rumble coming from beneath us and I began to panic. The biker however did not move, so I stayed put.</p>\n\n<p>The floor in front of us began to break apart, rubble rising up and up and something emerged out of it. I almost shit myself when I saw horns followed by a head followed by a gigantic creature.</p>\n\n<p>“Shiiit…” I muttered under my breath. I had a strong urge to run, but forced my feet to stay.</p>\n\n<p>When the beast properly emerged out of the ruined stone floor, I stared up at it, terrified. Its face had two big, grey, curved horns atop its head which were laden with frost. It had a long beard, hiding its nose and its mouth. A beard that seemed to be made up of long sharp icicles. Its eyes were a penetrating, glowing blue, the same colour as the light coming from the cracks. The rest of its body, its arms, legs, torso, were big, muscular and powerful. Grey white skin, filled with ice in odd places and covered in scars or tattoos, it was hard to tell which they were. The beast was male, and was completely naked. What the fuck?</p>\n\n<p>“Dan,” the biker said, snapping me out of my stupor. “Meet Ymir, one of the first frost giants.”</p>\n\n<p>I started at the biker and then back at the giant. Its big toe was the same size as myself. What the actual fuck?</p>\n\n<p>The giant stared at us, kicked the rubble to one side which suddenly formed itself into some kind of chair. It looked more like a throne with the size and complexity it formed itself into. The rest of the ground smoothed out once more and he sat, shaking the cavern. He waved a hand at us and the biker nodded.</p>\n\n<p>“We’re looking for a girl. She may still be on your land.”</p>\n\n<p>The beast brought out his colossal hand and placed it in front of the biker, who pulled something out from his pocket and placed it onto one of the giant’s fingers.</p>\n\n<p>When I looked at what it was, I recognised it instantly and it took me aback a little bit.</p>\n\n<p>“Hey…” I suddenly said. “Where did you get that from?”</p>\n\n<p>The biker looked at me. “I asked her brother for something of hers, he gave me this.”</p>\n\n<p>I looked at it for a while. It was a necklace. Her necklace.  A metal moon and sun attached to black string. She had actually given it to me as a gift once upon a time, supposedly representing me and her, back when we had been together.</p>\n\n<p>The giant took it from him, it was a tiny dot on his form and he stared at it, and then stared at me. The blue from his eyes bored into me and I felt unsettled. I felt like I was being judged.</p>\n\n<p>He gestured something with his hands and the biker nodded. “I know, but he doesn’t,” he said to the giant.</p>\n\n<p>I faced the biker. “What? What did he say? Doesn’t he speak?”</p>\n\n<p>But he just shook his head. “It doesn’t matter,” he replied, ignoring my question.</p>\n\n<p>The frost giant clenched the necklace in his fist and looked up at the cavern’s ceiling where the map was. The map began undulating slightly in places; more so than it already was and slowly what looked like footsteps began to appear. They wandered around on the map in various places leaving a trail and then they went off, into the sea and away from the land. The giant looked down at us and shrugged, signing with his hands once more.</p>\n\n<p>“She’s gone?” the biker asked. “Can you find out to where?”</p>\n\n<p>He shook his head.</p>\n\n<p>The biker sighed and ran a hand through his hair. “Now what?” he mumbled to himself.</p>\n\n<p>“Why didn’t her brother just give you her phone number?” I asked him.</p>\n\n<p>He looked at me and it seemed like he was about to say something, but thought the better of it. The giant though, began signing again, and the biker seemed to get even more depressed.</p>\n\n<p>“I know I came back…I know…I’m screwed now. Gone and done it,” he laughed nervously. “Seen as though I’m done for now though, I might as well ask, where am I supposed to go next, to fix this timeline shift? What do I do? Do you know?”</p>\n\n<p>The giant stamped his foot once, shaking the floor and the map above vanished, the rock turning and quivering into a blank canvas. A picture of a bus stop formed instead, scratches and carvings engrained in the rock to form an image.</p>\n\n<p>“What the fuck is with these bus stops?” I muttered under my breath.</p>\n\n<p>“Is that the stop where you work?” the biker asked me. “At the hospital?”</p>\n\n<p>“Yeah,” I answered, looking at the stone image. “That’s where I was kidnapped on the bus, ended up in that dimension the first time.”</p>\n\n<p>We both stared at it.</p>\n\n<p>“Is that what happened to you?” I questioned the biker.</p>\n\n<p>“No not exactly,” he answered. “I didn’t fall asleep on the bus until my wife passed away, remember…and you know...I didn’t meet future me…”</p>\n\n<p>The giant brought out his hand again and pointed out the necklace.</p>\n\n<p>“How can that be anything to do with all of this?” the biker questioned him. “The moon and the sun…they’re old symbols yes but…what does it mean?”</p>\n\n<p>The giant made a sign with his hand and the biker nodded.</p>\n\n<p>“It was a promise,” he said. “A bond and a promise…and what…he broke it? But how? I didn’t break it, yet he did? Is that where it changed?”</p>\n\n<p>The giant shrugged, sitting back and staring down at us. I couldn’t help but think wow at that moment, what a fucking beast.</p>\n\n<p>The biker sighed. “Thank you Ymir, for your help.”</p>\n\n<p>The frost giant nodded and then handed the biker the necklace again. He took it back gingerly, and slipped it into his pocket after giving it a few second looks. “The moon and the sun,” he laughed to himself and then turned to me. “Do you want it back?”</p>\n\n<p>“What? No,” I said immediately. “I don’t want it back.”</p>\n\n<p>The biker left it in his pocket. It was then I noticed he had some kind of necklace of his own around his neck, I could see the black string.</p>\n\n<p>“We’ll be going.”</p>\n\n<p>The giant nodded and we walked away. I constantly glanced back though and saw that he was still just sat there, staring at me, judging me with those glowing eyes. I shivered and finally turned away, paying attention to the way back. Once we were outside, the wind hit me like a sledgehammer. It was suddenly icily stormy.</p>\n\n<p>“Come on, hold my arm,” the biker said and I grabbed hold of his sleeve. We both dragged ourselves through the snow, back to the motorcycle. It was hard work and once we got there, he cleared away the small mounds that had settled themselves and switched on the ignition. The engine revved a few times and the rest of the snow melted away. Soon enough, we were off. I stared at the cave as we bumpily rode through the snow, thinking that there was a frost giant living in there, in a cave in the middle of nowhere, and I had just seen him. I replayed the events in my head, the conversation, the questions and the answers. I was so confused. The biker was keeping things from me. I didn’t understand anything.</p>\n\n<p>We were suddenly in the portal on the way back and it felt like we were rising upwards. All of a sudden we burst out into daylight and we were in the middle of the air. I panicked, there was no ground underneath us. Were we flying? The bike continued to rise somehow, up and up from the momentum but then I could feel it drop slightly and I clung on tightly, but we just about landed back ontop of the cliff we had jumped from before, in the middle of the highlands. The motorcycle roared as it was back on solid ground and the biker turned back to me.</p>\n\n<p>“You alright?” he asked, voice slightly muffled in the helmet.</p>\n\n<p>I nodded, breathing deeply. “Are we in Scotland?”</p>\n\n<p>“Yeah,” he replied and then we rode back. It took hours to return, riding through the hills, roads and motorways. I was exhausted when he finally pulled up in front of my house flat. I clambered off the bike, sluggishly. It was ten in the morning and the winter sun was out. I yawned and stretched. I was suddenly boiling in the winter gear I still had on and immediately began stripping everything off. The biker did the same.</p>\n\n<p>“Am I okay to sleep here?” he asked me. “I want to go to that bus stop tonight.”</p>\n\n<p>“Yeah of course.”</p>\n\n<p>“You coming?”</p>\n\n<p>“Yes,” I said defiantly. There was no way I wasn’t.</p>\n\n<p>He nodded and locked the bike up, grabbing his bag and a few things from the storage box. We then entered the house together, climbed up the stairs and dumped everything in the living room.  The flat looked like it had when I left it. Messy, empty, it suddenly felt surreal that I was in such a normal, small place considering where I had come from. I stood in the middle of the room, frozen and feeling light headed. I felt so out of place.</p>\n\n<p>“Are you okay Dan?”</p>\n\n<p>I turned around to biker, stunned out of my stupor. “Yeah,” I replied. “Just tired.”</p>\n\n<p>“I’ll sleep on the floor,” he said and I nodded. I thought about sharing a bed with future me and decided it was too weird.</p>\n\n<p>“The bedroom would be better,” I suggested, eyeing the mess and the dishes in the living room.</p>\n\n<p>We took it in turns to shower and then began making a bed made up of sofa cushions, sleeping bags, sheets and pillows. The biker glanced at my actual bed and shook his head.</p>\n\n<p>“You’ve still kept the bed,” he said, placing a few pillows down.</p>\n\n<p>“I know,” I said quietly. “Beds are expensive, and she said I could have it,” I answered, pulling off my shirt and trying to find my shorts.</p>\n\n<p>“That they are,” he settled in and pulled the covers over himself.</p>\n\n<p>I shut the curtains and jumped into bed myself, staring at the ceiling as quiet settled on the both of us. The room was dark enough. It was daylight outside and there was nothing that could truly block out the sun. I stared at the sliver of light on the ceiling.</p>\n\n<p>“What did you mean…visiting the frost giant was complicated. Why are you screwed?” I asked suddenly.</p>\n\n<p>He was quiet for a while so I looked up to see if he had fallen asleep but no, his eyes were wide open. He too was staring at the ceiling. I realised then, it must have been extremely weird for him to be sleeping in the flat he had once lived in with his wife. With her. To return to it in a completely different situation.</p>\n\n<p>“I er…I found Ymir, through someone else,” he started. “Or something else rather. A sphinx.”</p>\n\n<p>My head reeled and I dropped it back on the pillow. What a life. “A sphinx…right…fucking crazy…”</p>\n\n<p>He laughed a little. “Yeah, absolutely. Yeah but er…I asked the sphinx if there was a way I could see my wife and my child again. This was years ago for me. He said he didn’t know but he told me where I could find the frost giant who might know the answer. So I found Ymir, and I asked him the same question, if there was a way. He told me there was but there were consequences. But I didn’t care back then, I was in such a different state of mind, almost suicidal to be honest…the things I did, the things I didn’t care about. I mean imagine finding that portal, the one in the highlands to his cave the first time. To jump from that cliff.”</p>\n\n<p>I thought about it and settled that future me had lost his mind completely.</p>\n\n<p>“I was a man out of control…I was reckless,” he continued. “I said to him that I didn’t care what the consequences were, I just wanted to see them, both of them. So he told me about the lake. That’s how I found that place. I didn’t find that place myself, he is the one who told me of it.”</p>\n\n<p>“The lake you took me to? Where I saw my dad?”</p>\n\n<p>“Yeah,” he cleared his throat. “Once he told me where that was though, what I wanted to know. I then asked what the consequences were. Shitty way of doing it…but you know, I wanted to see them. He told me the consequences of seeing her and my child…he didn’t know what they would be exactly, that was up to the cosmos or whatever. Whatever affect that I would have on it. Whatever rules of the universe I was going to break, he didn’t know. But he said that if I met him again, asked him for another favour, my end was coming up pretty close after that. That as a consequence he knew of.”</p>\n\n<p>He was silent for a while and I was too. His end? What the fuck? He had just met the frost giant, did that mean he was gonna die soon?</p>\n\n<p>“What…” I breathed out. “So…you fucking serious?”</p>\n\n<p>“Yeah…why would I joke,” he chuckled sarcastically. “Anyway I found the lake, and I saw them,” he paused for a long while like he was thinking. “I saw them and after that, I thought I didn’t need to see Ymir again, why would I need to. I knew how to find the both of them. So I thought all that ‘end is nigh’ bullshit wouldn’t happen because I got what I wanted, I didn’t need him anymore. So I didn’t worry. Overtime I saw them less and less, I knew it was wrong to see them. I was becoming attached to something unhealthy and, she started appearing less and less. That helped me pull away I guess. I rarely go back there now. That time I went with you, that had been after a long while. But anyway…those other consequences he was talking about, I think that I’m living with them now. Suffering through them. I was wrong with what I thought before. I believe its finally caught up to me you know.”</p>\n\n<p>I sat up a little, my mind trying to figure things out. “What so…you’re trying to say you seeing your wife and your kid…that might have been a reason to cause all of this?”</p>\n\n<p>“Probably, maybe,” he answered.</p>\n\n<p>“What about all that promise bulllshit? That sun and moon thing you were saying? I have no idea what that means by the way.”</p>\n\n<p>“I’m saying that me seeing them was the start of a chain of events,” he explained. “It was the origin. Everything after that was probably a consequence of it. Nothing is simple Dan, not everything just has one answer.”</p>\n\n<p>I lay back down. “What did you even mean though, the sun and the moon? What has that necklace got to do with anything?”</p>\n\n<p>He sighed. “There’s no point talking about that, if you don’t want to talk about why you and her broke up in the first place.”</p>\n\n<p>I was quiet and asked another question instead. “What about the bus stop? How do you know that bus will arrive when we get there to wait for it?”</p>\n\n<p>“I think I have sort of figured out how the buses work. Sort of. The bus we’re looking for is the same one you fell asleep on, has to be the same driver. What happened when you were on the bus by the way?”</p>\n\n<p>I thought back. It seemed like a lifetime ago trying to recall the memories from then. “I er…finished work, waited at the bus stop, got on. It was a normal bus then, there were people on it, normal people. I fell asleep and woke up and the bus was empty, no one but me and the driver. She was a woman. Anyway, we were driving in that place, she took a break at one point and we stood outside, staring at the stars for a bit…”</p>\n\n<p>“Yeah, me too.”</p>\n\n<p>“Really?”</p>\n\n<p>“Yeah, I don’t know if it was the same woman. What she look like?”</p>\n\n<p>“I don’t know, small, skinny, greying hair, bus uniform.”</p>\n\n<p>“Sounds like the same woman I met.”</p>\n\n<p>“She asked me about my dad and stuff, my family, how they were. We got back in the bus and she continued driving,” I went on, “and there was another woman on the bus suddenly, underneath the seats, some blonde woman. She warned me. She warned me that the bus driver was taking me to get eaten,” I remembered it all vividly then.</p>\n\n<p>“What? Really?”</p>\n\n<p>“Yeah.”</p>\n\n<p>“That didn’t happen to me. I never met any girl underneath the seats.”</p>\n\n<p>“She vanished when I looked away. I don’t know if I imagined it, now that I think about it but…the driver drove into one of those portals and it sounded like she was driving right into a monster because there was roaring and grumbling and it shit me up.”</p>\n\n<p>The biker was quiet for a bit. “None of that happened to me.”</p>\n\n<p>“What happened to you?” I questioned him.</p>\n\n<p>“I woke up on the bus, same woman, we talked about stuff. She was mostly trying to comfort me about what just happened. And, she gave me a choice, said I had a choice. She drove me into the portal and we popped out the other end into a city. You haven’t been there, but it’s like a conglomeration of people and creatures and just everything weird in one place. Everything lost and wandering almost. She gave me a choice to return home or that. You can guess what I chose. There was no other woman, no monster. As far as I know, the bus drivers don’t send people to get killed.”</p>\n\n<p>I thought about what he said. A city, a choice. I hadn’t been given that.</p>\n\n<p>“How did you escape?” he asked me.</p>\n\n<p>“I just opened the door and jumped out, ran back. And then I met you.”</p>\n\n<p>“And then you met me,” he repeated. He lay there, eyes wide open, thinking, deep in thought.</p>\n\n<p>We were silent for a while, letting everything settle and sink in. I suddenly thought of something else.</p>\n\n<p>“You know that you’re from a different timeline to me?” I began.</p>\n\n<p>“Yeah.”</p>\n\n<p>“The first time you met me and you dropped me off back home, how were you able to do that? Have you always been able to travel through time or something?”</p>\n\n<p>“Erm…that portal we went through, to return you home. It’s a specific portal that can do that. Sort of like a returner’s portal.”</p>\n\n<p>“But now you’re stuck in my timeline. In the past.”</p>\n\n<p>“Yup, now I am stuck.”</p>\n\n<p>I yawned suddenly, everything was getting to be too much. It was too complicated.</p>\n\n<p>“Get some sleep Dan. I’ll wake you up when it’s time.”</p>\n\n<p>I turned around and shut my eyes. I was suddenly afraid of what might happen in the future.</p>\n\n<p><a href=\"https://www.reddit.com/r/nosleep/comments/86sc81/woke_up_to_the_bus_driving_in_another_dimension/\" rel=\"nofollow\">part 3</a></p>\n</div>\n","author":"RayOfShay"}