{"rank":"2","title":"The Nameless Laughing Man","id":"8kh39g","url":"/r/nosleep/comments/8kh39g/the_nameless_laughing_man/","time":"1526682917000","body":"<div class=\"md\"><p>Ok so, I work in a mental hospital as a nurse. I was checking out the info on a new patient. Everything looked normal, at least for what I seea around here. I open the door to his room and he’s just sitting there, alone. He looks over at me for a second then goes back to staring at the wall. I look at all of his stats and it all looked fine. He started muttering apparent gibberish to himself. I leave the room and go down the hall. I go to the breakroom and get some food. I need sleep, but there’s no time. I hear the loud familiar buzz of a patient in need of help. I look at the room the buzz came from. The room of the new patient. I rush to the room and I can’t see him. The doctors hurry to help him. I make my way up to him and look at him. He’s foaming at the mouth but still just laying there. He seems so calm. I look at all of his stats and they’ve all gone critical in the matter of a few minutes. I look at his arms. They’re covered in bloody scratches and cuts.</p>\n\n<p>He looks up at the ceiling and I think I can see a faint smile. I clean off his arms and mouth. The doctors use the defibrillator to hopefully help him. He just lays there, smiling. After a few shocks he starts laughing like crazy. He pulls himself up and just stares at us as he laughs like a maniac. I, along with the other nurses, restrain him like we were trained to do. He doesn’t stop laughing. We decide it’s better if we just leave. I come back a while later, maybe an hour tops. He’s sitting in the corner laughing and giggling to himself. He stops and stares at me. He slowly makes his way up to his feet. He walks toward me and I look over at the bed. The restraints are ripped apart. He gets close to me and tries to scratch at me.</p>\n\n<p>I run to the side of the bed and press the button to call for another nurse. I try to stay out of his reach but he hits me a few times. Another nurse finally comes to the room and just watches in pure horror. He finally gets a hold of my shirt and pulls me close to him. I speak to him in a voice as calm as I can manage, “Who are you?” He finally speaks for the first time since I found him. “I am everyone, I am no one.” He just let go of me and went back to his bed. He just laid there silently. I went up to the bed after a moment and just looked at him. I got his record and the namespace was blank. I don’t know how it happened. I look back toward his bed and he’s gone. I look around and there’s no evidence of him ever being there.  I just leave and go home. I get a call from an unknown number. I answer it and there&#39;s just laughing. Louder and louder. I get the same call over and over again for months, everyday, multiple times a day. One day they just stop out of nowhere. I look through the obituaries and see the man I met that day so long ago now. He didn&#39;t have a name in the paper either. To this day, no one knows who the nameless laughing man was.</p>\n</div>\n","author":"ThatOneRandomNerd"}