{"rank":"56","title":"It Sounded Like Fireworks","id":"8kh4ip","url":"/r/nosleep/comments/8kh4ip/it_sounded_like_fireworks/","time":"1526683255000","body":"<div class=\"md\"><p>It sounded like fireworks. </p>\n\n<p>“Hold on, I’m gonna go outside and see what’s going on,” I was talking to my stepmother on the phone, my roommates’ one month old daughter had fallen asleep just minutes before the commotion began. </p>\n\n<p>Fireworks. Neighbors from all over the street were standing outside and staring into the sky above my semi-detached home, I was about to cross the street and join them when a man from across the street came rushing outside. He was talking to the people who lived in the unit attached to mine, but loud enough for most of the people outside to hear. </p>\n\n<p>“I just heard it on the news, It’s not fireworks, there’s a shootout going on a couple blocks from here.” </p>\n\n<p>The sounds were loud, and I wondered how close it was happening. I repeated the information over the phone to my stepmother, who began to tell me about how my roommates and I needed to move. I was half listening to her tell me how this neighborhood wasn’t safe for a pregnant woman, but the neighbors around me were in some sort of frenzy. I mean, of course it’s a bad neighborhood, everyone who lives here has no expectations of it being anything more than a slum, but this was something worse than the usual arrests and drug deals. </p>\n\n<p>People had started looking into the dark backyards to see if they could spot any of the gunfire, now that they knew where it was happening there was an feeling of panic spreading through the street. A few of the neighbors retreated indoors letting everyone know that they had scanners and would check on what was happening. The man from across the street retreated inside as well, and another neighbor began to tell everyone how he had driven by the scene. It was less than three blocks away, and there was a man shooting into traffic with an assault rifle. He was telling us about how there were already tons of police at the intersection, but the fear had already set in. </p>\n\n<p>I don’t know who said it, but I heard it clearly, “I hope he doesn’t come into the neighborhood looking for hostages.” </p>\n\n<p>People looked at eachother with worry in their eyes. It had been less than a minute since those with scanners had gone inside to listen for news, but it seemed to take both an instant and an eternity before one of them came running back outside yelling.</p>\n\n<p>“<strong><em>Everyone get inside and lock your doors! He’s on foot less than two blocks from here!</em></strong>” </p>\n\n<p>The reaction was instant, I tried to let my stepmother know what was happening as I ran back inside and made sure both doors were locked. She was trying to give me advice about what to do, but I was panicked. I was home alone, 3 months pregnant, and taking care of someone else’s small infant. There couldn’t have been a worse time to be stuck in an active shooting. </p>\n\n<p>I hurried through the house and put the sleeping baby in her carseat, then we moved to the bathroom. I shut the door and tried to calm down while the voice on the phone told me to breath. How could this be any worse? This house was shit, every single room had an exterior wall, the bathtub was too small to lie down in, and half our front door was glass. If a bullet came through these walls… Survival was iffy. If the shooter made it to this street it would be remarkably easy to break into the house. </p>\n\n<p>I stayed silent for a few minutes, putting down the phone to listen for the sound of more gunfire or glass breaking. Everything was silent other than the hum of the fan in the next room. I took a deep breath and tried to think of what to do next.</p>\n\n<p>I needed to do something to increase the safety of myself, the baby, and the other child in my belly. I cracked open the bathroom door and crawled into my bedroom; I grabbed every pillow and the largest blanket I could see before running back into the bathroom. I made padded walls of pillows and boxes in the bathroom surrounding the carseat so that the baby inside would have a better chance in the case of a stray bullet. I wrapped a body pillow around my stomach and picked up the broken shower rod off the bathroom floor. I told myself that the best I could do was at least make sure the little sleeping baby made it through whatever happened.</p>\n\n<p>I listened to my stepmother try to calm me down as I sat in the corner and waited. I sent a message to my boyfriend and roommates to let them know about the shooter. I wanted to check the news to see what was going on, but my phone battery was getting lower and lower. The voice on the phone was still trying to reassure me, we had been in the bathroom for nearly and hour. Everything outside had stayed relatively quiet.</p>\n\n<p>I turned off the bathroom light so the room wouldn’t get any warmer, it was over 80 degrees outside and I didn’t want to have to leave the bathroom door open for cooler air. That door was our last line of defense before I’d end up face to face with a rifle. </p>\n\n<p>It was so dark, so quiet. There was the crackling sound of static from my phone as my stepmother quietly reassured me I had done all I could, the sound of the baby breathing, and the fan. I tried to listen beyond these sounds, and every noise made me flinch. Was that scraping sound my neighbors hiding behind the thin walls of their own shabby home? Or was it the shooter pressing his body against the outside of my house as he hid from the police? Was that bump the children next door trying to find a safe spot? Or was someone testing the doors of my house to see if they could get inside? </p>\n\n<p>I don’t remember what was being said over the phone when I heard it. </p>\n\n<p><strong><em>BANGBANG</em></strong>.</p>\n\n<p>I burst into tears, it sounded so much closer than it was before. It sounded like it was right outside my house. </p>\n\n<p>“<em>I just heard more shots--</em>” </p>\n\n<p><strong><em>BANGBANGBANG</em></strong>. </p>\n\n<p>I cried silently. So close. So loud. Not even time between them to whisper over the phone. Wondering in a panic how close the shooter was. Was he in the backyard? Were those noises him taking cover? Will I even know that my house is being shot at before I bullet rams through the bathroom wall and plants itself in my head? </p>\n\n<p>I remember what my stepmother said after that, “I know, I heard them too. Just remember: If he gets in the house and comes for you, make sure the last thing you yell is what he looks like. As soon as I can I’ll call the police and make sure the guy who did this gets caught.” </p>\n\n<p>Somehow that wasn’t reassuring, but I promised I’d do it. If I died tonight I’d make sure that the baby in the carseat survived, and that they’d catch the person responsible. It was all I could do if the worst happened. I spent a moment imagining my roommates’ reactions if they found my bullet-filled corpse lying on the bathroom floor while their baby slept through it all right next to me.</p>\n\n<p>After a few minutes of silence I had to suck up my fear and leave the safest room in the house. If that baby woke up she’d need a bottle, and I needed to make sure my phone didn’t die. I crawled out of the bathroom again, heading for the living room with all of it’s glass and easy entrances. I wanted to move fast, but fear made me hesitate just outside the door. I worried that I’d make some telltale noise and be faced with torrent of bullets. I took a deep breath and crawled as fast as I dared, keeping low to avoid my shadow passing over the window. It only took a moment, but my heart felt like it was going to explode as I grabbed what I needed and rushed back into the bathroom. </p>\n\n<p>It would be another hour of sitting in the dark before the news updated. Now that I had a charger I could check what was going on. I worried the entire time that the little girl would wake up and begin crying, and then the shooter would know which house had the perfect hostages. Somehow that little angel slept through the entire thing while I sat in corner with the shower rod, a shaking mess. </p>\n\n<p>After two hours locked in the bathroom with the baby the announcement came out: It’s safe to come outside, the police have shot the gunman.</p>\n\n<p>I hesitated a minute, making sure the source was accurate. It was true, the message was broadcast by the police on the scene. After hours of sitting in the dark, panicked and hoping beyond hope that nothing would happen, it was finally safe. I let out all the breath that had been stuck inside me for the past two hours. </p>\n\n<p>I brought the sleeping baby back into the living room and went outside to see what was happening. Red and blue lights could be seen at the end of the street and behind the houses across from mine. The man in the house attached to mine was one of the only people outside, he said that he saw the shots that I had heard and it was almost as close as it sounded. Most of the houses on the street were dark and quiet, but a few people wandered outside. The feeling of relief was tangible.</p>\n\n<p>It would be another two hours before the police let the rest of my household enter the neighborhood. One man had died, the shooter had been shot, and almost all of this happened close enough that I could have watched it from my front porch. </p>\n\n<p>I’ll probably never know why he did it, or why we were lucky enough for him not to start shooting at the houses on our street, but those aren’t the biggest questions I have about that night. That night was one of the scariest of my life, I was entirely ready to die. </p>\n\n<p>It turns out that there <em>were</em> fireworks going off when the shooting began, and even after all that trauma and fear, my morbid curiosity wonders if the shooter planned it so that more people would be outside. How long would it have taken for us to find out what was going on? How long before the shooter noticed there was an entire street full of easy targets?  </p>\n\n<p>I wonder how many of us would have died standing in the street and staring at the sky if that one neighbor hadn’t been watching the news. </p>\n\n<hr/>\n\n<p><strong>The following information is from news reports about the above incident:</strong></p>\n\n<p><em>[CITY] Police Department released surveillance and body camera footage Tuesday of a man identified as [SUSPECT NAME] firing an AR-15 and later a shotgun at [CITY] and [LOCATION] County squad cars.</em></p>\n\n<p><em>[SUSPECT NAME] was shot twice in the chest by city police detective [DETECTIVE NAME] about an hour after police arrived on-scene, according to the department. [SUSPECT NAME AND AGE], died Sunday night at a local hospital.</em> </p>\n\n<p><em>It’s not clear why [SUSPECT] opened fire.</em></p>\n\n<p><em>“This is one of those cases where there’s never really going to be a reason why,” [OFFICER] said.</em></p>\n\n<p><em>At least four homes and two businesses were damaged in the gunfire, [OFFICER] said.</em></p>\n\n<p><em>Three [CITY] Police cars and one [LOCATION] Sheriff’s Office vehicle were shot, including one car that had 23 bullet holes.</em></p>\n\n<p><em>Because the neighborhood was dimly lit, officers tracked him by the sound of gunfire. The sound of fireworks from [LOCATION] led police to believe he had traveled farther than he actually had.</em></p>\n\n<p><em>The bystander, [NAME AND AGE OF VICTIM], was reportedly shot and killed while trying to check on neighbors after the first round of gunfire subsided.</em> </p>\n\n<p><em>Even in a country where shootings happen with horrific regularity, it’s tough to believe you’ll peel back your curtains and see a heavily armed gunman stomping down your street.</em></p>\n\n<hr/>\n\n<p><a href=\"https://www.facebook.com/HylianFae/\">HF</a></p>\n</div>\n","author":"HylianFae"}