{"rank":"25","title":"They won't let us leave.","id":"8kh5n6","url":"/r/nosleep/comments/8kh5n6/they_wont_let_us_leave/","time":"1526683562000","body":"<div class=\"md\"><p>I&#39;m not sure where to begin with this but I&#39;ll start with what happened 4 days ago. I live in a town named Baldwin right outside of Jacksonville Florida. It&#39;s a small town with less than 1500 people and home to one of the busiest CXS ports. The only thing our town is famous for is traffic being held up by trains stuck on the tracks causing backs up all the way to the interstate. The trains are the worst here. We have 9 different railroad crossings here in a town that&#39;s only 2.03 sq miles. 2.03 MILES AND 9 CROSSINGS WHAT?! It is overkill if you ask me but for whatever reason that&#39;s just how it is here. It was something we all learned to live with and nobody thought much of it, well not until 4 days ago. </p>\n\n<p>I was leaving my house to go to the next town over for groceries and saw the traffic then I heard the train horn. I knew I would more than likely be sitting there for a while so I turned around and went onto the back roads to try and get around it. I was almost out when I saw the arms where coming down signaling that another train was coming. I said screw it and decided to go back home. My husband was there waiting because the road he takes to work was also blocked by the trains. </p>\n\n<p>After a few hours we decided to try and leave again but the trains were still there. We started scrolling through Facebook to see if anyone else in the area mentioned anything and it seems like every track had a train. None of them were moving though they were just sitting there. I tried calling the CXS here but the call never goes through. The next day we tried again but they were still there. After 2 days of this we really starting getting scared and by day 3 we all knew we had to make a plan. Hopefully the other groups separted by the trains are doing the same. </p>\n\n<p>It&#39;s been 4 days and the trains are still there. Just sitting. Every now and then the horn will go off but other than that nothing happens. </p>\n\n<p>I know this sounds stupid but this is wrong. The whole town is blocked off. We even saw a couple of people that were walking trying to climb over the train cars. This is where it gets weird. Just bear with me here I&#39;m still trying to make sense of this. The first guy that tried was almost over the first car when he just dropped dead. The second persons head literally exploded. After that nodody else wanted to attempt.</p>\n\n<p>Everyone&#39;s in a panic and for good reason. We are trapped here and we don&#39;t even know who is behind it or why. A few of us are planning an escape. I don&#39;t want to say too much on here about what the actual plan is because I don&#39;t know who is doing this. Either way I refuse to be stuck here I&#39;m getting the hell out. </p>\n</div>\n","author":"karistee"}