{"rank":"15","title":"Sometimes they get hungry.","id":"8kh8gs","url":"/r/nosleep/comments/8kh8gs/sometimes_they_get_hungry/","time":"1526684330000","body":"<div class=\"md\"><p>Hey Nosleep, I&#39;ve been away for a while for personal reasons, but rest assured <a href=\"/u/gehemma\">/u/gehemma</a> and I will be getting back on track. Gemma&#39;s been working on her father&#39;s research, investigating <a href=\"https://www.reddit.com/r/nosleep/comments/8fo4ry/dont_touch_the_red_coral/\">the red coral</a>, ever since Aisha got her message out, and she says she will let me know if she finds anything.</p>\n\n<p>Aisha thanked me for putting her story out there, and says she&#39;s feeling much better now that the coral&#39;s gone. Unfortunately, the hand crumbled as soon as she cut it off, and the doctors couldn&#39;t find anything useful.</p>\n\n<p>Anyway, I&#39;ve been sorting through my messages, and there&#39;s still a bunch of them coming in. In particular, I&#39;ve been contacted by a woman who&#39;s doing an MBA in London.</p>\n\n<p>Her name&#39;s Melanie, she used to live in Singapore, and she wants to tell you never to put chopsticks in your hair.</p>\n\n<hr/>\n\n<p>MELANIE&#39;S MESSAGE:</p>\n\n<p>Before I started my MBA, I was an expat working for a multinational firm. We had offices all over Asia, usually staffed by a mix of lower-ranking local staff and British expats brought in to manage them. Us expats were in the minority, so we tended to stick together - there were always expat Facebook groups where we would gather to talk about expat life and organise little get-togethers for our community.</p>\n\n<p>Around four years ago, in 2014, I was posted to Singapore. In many respects, Singapore is a great place for people like us. The food&#39;s great, the country&#39;s safe and everyone speaks English. I lived in a company apartment, and every weekend I would go to Holland Village with my little group of expat Facebook buddies for drinks and dinner.</p>\n\n<p>It was at one of those dinners in August 2014 that the topic of the ongoing Hungry Ghost Month came up. We were all rather amused that in a shiny, modern city like Singapore, people still believed in ghosts; one of the older expats, Daniel, laughed while recounting how Singaporean Chinese people would burn fake houses and fake money for dead people and stink the whole place up with smoke.</p>\n\n<p>Somewhere along the line, with our minds lubricated by a lot of expensive beer, it was decided that a couple, Helen and Barry, would host a Hungry Ghost Month-themed party the next weekend, instead of our usual dinner get-together. It would be like Oriental Halloween - we&#39;d all dress up in ghost costumes, have a house party and get extremely fucking smashed. I won&#39;t lie, I was excited.</p>\n\n<hr/>\n\n<p>I decided to go all-out for my party outfit. I was going to go as a sexy Chinese lady zombie. I bought a cheongsam, fake blood and some hell notes, and set about turning myself into a member of the undead. With a couple of hell notes pasted to me and a bunch of fake cuts on my face, I looked at myself in the mirror.</p>\n\n<p><em>Hair,</em> I thought. My long brown hair didn&#39;t really fit the theme, I felt, so I tied it up into a large bun at the back of my head and shoved a couple of chopsticks through it to complete the look. <em>Perfect.</em></p>\n\n<hr/>\n\n<p>The party was pretty wild. We were all dressed in various vaguely Oriental outfits; Helen and Barry were the Ring woman and the Ju-On boy respectively, while Daniel had come as Mao Zedong. We were all drinking heavily, so after an intense beer pong match with a couple of Australians who&#39;d decided to tag along, I felt my bladder about to burst.</p>\n\n<p>&quot;&#39;scuse me,&quot; I muttered as I stumbled to the toilet. I peered in to make sure nobody was throwing up or hooking up inside, and then I shut the door.</p>\n\n<p>As I was relieving myself on the toilet bowl, I felt a tug on the back of my head, followed by a disgusted spitting and coughing sound. I turned around, but there was nothing there, just the wall and the cistern. As I turned back, I felt hair cascade over my shoulders. Alarmed, I touched the bun that was meant to hold it in place, and I screamed.</p>\n\n<p>Something had taken a huge bite out of it.</p>\n\n<hr/>\n\n<p>It turns out that the Chinese believe leaving chopsticks standing upright in a bowl of rice is a way of marking food for the dead. I don&#39;t know why exactly this is the case, but some people have told me it looks like incense at an altar.</p>\n\n<p>When I stuck the chopsticks through my hair, while dressed as a zombie (another taboo during Hungry Ghost Month) and with hell notes stuck to my body (an overall taboo, I&#39;ve learned), I must have drawn something to me.</p>\n\n<p>So, I&#39;m never doing that chopsticks shit again, and neither should you. There&#39;s ghosts out there, and sometimes they get hungry.</p>\n</div>\n","author":"91sun"}