{"rank":"10","title":"The Shadow Man","id":"8kh86s","url":"/r/nosleep/comments/8kh86s/the_shadow_man/","time":"1526684251000","body":"<div class=\"md\"><p>This is a story told to me by a friend D I used to have in highschool, from what I remember he was always a bright and funny guy. But when he&#39;d talk about The Shadow Man there were no more smiles, and he would speak just above a whisper. He&#39;d never talk about Shadow Man in his house, because thats where the haunt was located. His neighborhood was filled with old big houses and his was one of them. It was a two story house, with a big spacious kitchen that connected to the living room, and the second floor divided 4 bedrooms with a long hallway with a playroom inbetween and 2 bedrooms on the opposite sides.</p>\n\n<p>He said it started out simple. His mother, his father, and his brother and him had all seen the silhouette of a man standing and watching from different vantage points in the house. D said that when he was on the couch in the downstairs living room that when he&#39;d get up to get a snack from the kitchen he&#39;d freeze and see Shadow Man watching from behind the marble kitchen island. It took all his courage to slip out into the hallway and run up into his room to hide. Other times when coming out of his bedroom he&#39;d see Shadow Man watching as always, but on the opposite side of the second floor hallway, outside his parent&#39;s bedroom.</p>\n\n<p>Things got worse though. He was in his bedroom playing around on the internet on his laptop, relaxed in bed, when he heard his brother twist the doorknob to his room. &quot;Yea, come in.&quot; He&#39;d said, waiting for his brother to walk in. But he didn&#39;t. The door knob kept twisting, and twisting, and he laughed nervously and called out, &quot;Stop fucking around dude, what is it?&quot; Silence. The door now had his full attention and his grip on his laptop tightened and he stop breathing. The door creaked open, and no one was at the door. He waited. And nothing. He was a teenager but was reduced to a tiny child again, hiding under his blankets, breathing heavily, closing his eyes and hoping the horror would end. He heard the front door open to his house and his brother&#39;s laugh chiming in, footsteps up the stairs, and his brother asking in a concerned voice, &quot;D what are you doing?&quot; D relayed what happened and his brother&#39;s grin disappeared. They hung out together the rest of the night, and he tried to forget what had happened.</p>\n\n<p>Not long after that incident, D woke up to his older brother climbing into his bed in a panic. It must have been around 4am he told me, and that his brother was panting and frantic. It took a while for him to catch his breath but then he told D what had happened to have him in such a state or horror. He said he was dreaming, but also not dreaming, and that he saw a priest walk in with no face. He couldn&#39;t move his body and stared in shock as the figure crawled into his bed and hovered over his paralyzed body, and wrapped bony fingers around his neck. He was being choked, and it was dead silent, and his eyes watered and his heart beating so fast he thought he&#39;d die from how scared shitless he was before the <em>thing</em> had choked him lifeless. He had started praying and praying and finally woke up with one dreadful gagging breath of air sitting right up in bed grasping at his own chest. Then he&#39;d scrambled out of bed nearly slipping and dove into his brother&#39;s room for solace.</p>\n\n<p>After that they started burning sage in the house everyday, and every now and then they&#39;d see the Shadow Man standing in his favorite places or watching from the backyard, but it never got worse after that thankfully.</p>\n</div>\n","author":"TruthfulBoy"}