{"rank":"161","title":"My parents aren't who they say they are...","id":"8khhl1","url":"/r/nosleep/comments/8khhl1/my_parents_arent_who_they_say_they_are/","time":"1526686847000","body":"<div class=\"md\"><p>Potential trigger warnings <a href=\"#eating%20disorder\">trigger warning</a>: eating disorder <a href=\"#psychosis\">trigger warning</a>: psychosis </p>\n\n<p>So when I was 12 I started noticing strange things about myself. Not the usual girl-about-to-go-through-puberty shit, real, strange stuff. I could see and hear things that my peers and parents couldn&#39;t seem to. </p>\n\n<p>I remember this one distinctive female voice would swim in and out of rooms, but also somehow inside my head: &quot;hey, you, listen up&quot;. Obviously at first I was freaked out, but she soon became a staple part of my day. She&#39;d talk to me, and I&#39;d talk back. At first it was just normal pleasantries, but eventually she began telling me things. It felt like she was some motherly figure looking out for me. </p>\n\n<p>&quot;You can&#39;t trust your parents.&quot; </p>\n\n<p>&quot;Keep your head down, this place isn&#39;t safe for you.&quot; </p>\n\n<p>&quot;Don&#39;t eat that food, they&#39;re trying to drug you&quot;</p>\n\n<p>Stuff like that. Really scary shit. At first I&#39;d ask my mum and dad what was going on and who they were, but they&#39;d always answer in the same way: </p>\n\n<p>&quot;Honey, we&#39;re your parents. We love you and we want you to be safe&quot; </p>\n\n<p>But it always sounded fake. By the time I was 15 I was properly paranoid about everything and everyone around me. Around that time I started to hear other voices. A man who would tell me to stay awake at night because &quot;things&quot; would happened if I dared to sleep, and a young, thin boy with big blue eyes who would appear in the corner of rooms, watching me, whispering things I couldn&#39;t quite make out. He looked a bit like me. Like, if I&#39;d had a younger brother I think that&#39;s what he&#39;d look like. </p>\n\n<p>I got so scared I&#39;d go nights without sleep before eventually succumbing and passing out. I&#39;d always feel like shit when I woke up; like something weird had happened to me whilst I slept. Bruises and scratches would turn up on my arms, and I swear a few times I could see track marks from needles. </p>\n\n<p>Call me delusional, but I wasn&#39;t scared of my guardians at all. Actually, it was quite the opposite. They were my protectors. The woman&#39;s voice was soft and gentle, and the man&#39;s voice was assertive and calming. The boy just seemed to be warning me of something. The only two words I could ever work out were &quot;mum&quot; and &quot;dad&quot;. His body would shake whilst frantically whispering those words over and over. </p>\n\n<p>Anyway,  my behaviour started getting noticeably weird about a couple years ago, when I was nearly 17. My parents noticed that I was often in my own world, and my teachers had started reporting that I was skipping school and often dumping my home brought meals in the bins. I lost a lot of weight because I was damn scared of the food being contaminated, and I spent a lot of time in the woods near my house. Strangely, when I hadn&#39;t eaten the &quot;poisoned&quot; food, I tended to feel a whole lot better... That&#39;s why I&#39;ve always believed that there&#39;s something more to my visions than just mental illness. </p>\n\n<p>Once my parents noticed I was skipping food, they started &quot;enforcing&quot; meals. What broke me was I knew I couldn&#39;t trust my mum and dad at all, after all <em>they</em> were the ones poisoning and testing on me. Who even were they? To be honest, I have little memory of my childhood, and there&#39;s no pictures of me in this house... like, not even cute baby photos or anything. </p>\n\n<p>Clearly, I became thinner and thinner, outright refusing to eat shit that I hadn&#39;t made myself, which was hard to do because my parents were <em>always</em> around me. Sometimes I&#39;d catch them writing things down in a notebook, and whispering things to each other. Eventually I was &quot;dangerously thin&quot;, so now I&#39;m being shipped off to a psychiatric hospital for &quot;refeeding&quot; and treatment for psychosis. </p>\n\n<p>I don&#39;t have psychosis, the woman has calmly told me time and time again that they are <em>real</em> and they are there to help me. I have 24 hours before I&#39;m being sent off there and I&#39;m absolutely terrified out of my mind. I&#39;m not crazy! Something fucking weird is going on in my house. I swear to God. Someone has been fucking with me for years, and I don&#39;t know what&#39;s going to happen once I&#39;m admitted. </p>\n\n<p>Not even half an hour ago I actually heard the boy say another word. This time it wasn&#39;t whispered or hard to decipher: </p>\n\n<p>&quot;Run.&quot; </p>\n\n<p>I think I&#39;m gonna do it and get the fuck away from this place. Hell, I might even go to a whole other city. Manchester isn&#39;t too far from here. I have a small amount of money and I&#39;ve been researching shelters and stuff. Anywhere has to be better than here, right?! </p>\n\n<p>If anyone has any advice I&#39;d love to hear it. I&#39;m terrified. I&#39;ve been packing as secretively as I can because mum and dad keep &quot;checking&quot; in on me. I think they&#39;re about to come back so I&#39;ll probably have to hide my phone and stay offline for a while. </p>\n\n<p>If you don&#39;t hear from me, well, you can probably guess what&#39;s happened...</p>\n</div>\n","author":"coniferstance"}