{"rank":"61","title":"Apparently I'm not Sherlock Holmes","id":"8khjze","url":"/r/nosleep/comments/8khjze/apparently_im_not_sherlock_holmes/","time":"1526687551000","body":"<div class=\"md\"><p>I am a janitor in a hospital.  It&#39;s not a glamorous job, but it&#39;s what I do and I try to do it well.  My claim to fame would be helping a woman give birth in a power cut.  I didn&#39;t do much, but worked to keep her calm until a Doctor came and finished the duty right there in the corridor.  I felt really good about that and ever since, I&#39;ve tried to help out when I can.</p>\n\n<p>We have these people who come to the hospital, we call them dopers.  They arrive at A&amp;E and appear to be in agony.    They are seen by a Doctor and leave minutes later with a prescription for painkillers.  Obviously the hospital gets wise to these people and after a few visits, they are refused an appointment.  Usually they cause a fuss, and in the worst cases, smash and break objects in their near vicinity.</p>\n\n<p>However, the clever ones leave with no drama and return later in some sort of disguise.  Sometimes it&#39;s something as simple as a hat and a different T-shirt, complaining of a different ailment.  They make sure to see a different receptionist and if they are lucky enough to get assigned a different doctor, they will leave with another fresh script.</p>\n\n<p>The smarter dopers can run this ruse for weeks before they are caught.  Though, if I&#39;m around, they don&#39;t get away with it.  My job is hard work, but doesn&#39;t tax the brain, so it&#39;s left free to check out these people and tip off the right person.</p>\n\n<p>I know these people are in pain, whether it&#39;s mental or physical.  I won&#39;t let them take advantage of system, though.  The doctors and nurses are overworked already as it is, they don&#39;t need dopefiends coming in and taking up their valuable time, just for another hit.</p>\n\n<p>There was this one guy though, that I couldn&#39;t pin down.  His shtick was genius.  He would sit in the waiting room, reading a newspaper, or just patiently biding his time.  I&#39;d seen him everyday for the last month.  If I wasn&#39;t mistaken, he&#39;d always been there.</p>\n\n<p>I wondered if he was a health inspector.  If he was, it was the perfect way to play it.  No-one knew he was ever there.  One day he&#39;d wear blue jeans and a white T-Shirt.  On others, he&#39;d wear a suit, everyday different.  But I don&#39;t forget a face.  His facial hair changed - clean shaven, goatee, fully grown beard.  Even when his black hair was changed to bleach blonde; I knew it was him.  The one constant, his long walking stick.</p>\n\n<p>He&#39;d wait and when an emergency patient came in, he&#39;d calmly get up out of his seat and walk over to them, staying far enough away that no-one asked if he was next-of-kin.</p>\n\n<p>The doctors and orderlies would rush to the patient, stretcher them and disappear through the double doors.  The man would follow calmly behind.</p>\n\n<p>I knew what he was doing.  He was smart.  He knew the patients were in pain, that they&#39;d have liquid morphine on tap as soon as they were out of the operating room; genius.</p>\n\n<p>I watched him through the doors as he patiently followed behind the gurney and entered a room.  I reported him to the ward nurse, just like I had the dozens of dopers before.</p>\n\n<p>The next day I asked if they found him.  They told me that they didn&#39;t see someone who matched the description I gave.  They checked the CCTV and nothing...</p>\n\n<p>I saw him that day, sitting in his regular seat, and alerted reception.  They looked at me all peculiar.  I wanted to point, but didn&#39;t want to make a scene.  Later that day, I was dragged into my manager&#39;s office and told, while they appreciate me looking out for the hospital, they would have to let me go.</p>\n\n<p>I asked why, and they said they wanted a janitor, not Sherlock Holmes.   I was devastated.</p>\n\n<p>Two weeks ago, my mother phoned me to say she had chest pains.  I was at the job centre, waiting for an interview for another role.  I rushed to her house to find her unconscious on the floor.</p>\n\n<p>I phoned the emergency services and within fifteen minutes was in the back of an ambulance on the way to my old place of work.</p>\n\n<p>I rushed into A&amp;E, following the gurney that slammed through the double doors.  Everything was a blur.  My heart thumped from panic as the stretcher raced through and into the OR.  I stopped in my tracks as the man, the same man I&#39;d seen dozens of times before, looked over his newspaper and at my mother.  He neatly folded his newspaper and stood up.</p>\n\n<p>&quot;Don&#39;t let that man anywhere near us,&quot; I shouted at reception while pointing to him.</p>\n\n<p>She ignored my plea and the man slowly but surely made his way towards the OR.</p>\n\n<p>I pushed the doors open and ran after the orderlies.</p>\n\n<p>&quot;John, you&#39;ll have to wait out here,&quot; one said, as my mother was pushed into theatre.</p>\n\n<p>I obeyed them, and slunk into the chair outside the room.  I stared down the hallway, a burning hatred rose in my stomach.  I played the scenario over in my head, what I was going to say to him as he tried to steal my mother&#39;s morphine.  But he didn&#39;t emerge through the doors.</p>\n\n<p>I was on edge for what seemed like hours.  I continued to stare, though only doctors and patients passed through.</p>\n\n<p>&quot;I&#39;m sorry,&quot; a doctor said to me, &quot;we&#39;ve done all we can.  She&#39;s in a coma, there&#39;s very little chance she will survive.&quot;</p>\n\n<p>I was lost for words.  Carefully, the orderlies rolled her out of the OR and into a ward a few doors down.  I followed.</p>\n\n<p>&quot;You can stay here if you like, John,&quot; one of them said.</p>\n\n<p>&quot;Thank you,&quot; I replied.</p>\n\n<p>Machines were hooked up and I sat in the chair next to her.  Doctors conversed, but I didn&#39;t listen.  All I did was take her hand and cry.</p>\n\n<p>I gripped her fingers tightly and pleaded with her to get better.  Her chest rose and fell in rhythm with the machine next to her.</p>\n\n<p>&quot;I love you, mum,&quot; I said, leaning over to kiss her hand.</p>\n\n<p>When I sat up, through tears, I saw the man from the waiting room.</p>\n\n<p>&quot;What are you doing here!&quot; I demanded.</p>\n\n<p>He ignored me and approached my mother&#39;s drip.</p>\n\n<p>&quot;Don&#39;t you dare!&quot; I shouted, as he reached out his hand.  It didn&#39;t grab the bag, but instead came to rest on her chest.  He picked up his walking stick and held it above his head.</p>\n\n<p>&quot;It&#39;s her time,&quot; he said, &quot;I&#39;m sorry.&quot;</p>\n\n<p>The machines blared out in unison a single tonal beep.</p>\n\n<p>Doctors rushed in, apparently oblivious to the man.  He patiently turned, putting his walking stick to the floor and hobbled out of the room.</p>\n\n<p>&quot;I&#39;m so sorry, John.  She&#39;s gone.&quot;</p>\n\n<p>When the tears abated, I left.  I was numb.  I pushed my way back into the reception.  A wall of conversation hit me, as another emergency was in progress.  I stepped out of the way, as a gurney, similar to my mother&#39;s pushed past.</p>\n\n<p>The man was there, in his favourite seat.  He folded up his newspaper, slowly got to his feet and patiently followed the orderlies out towards the OR.</p>\n\n<p><a href=\"https://www.facebook.com/theedwincrowe/\">xx</a></p>\n</div>\n","author":"ecrowe"}