{"rank":"0","title":"The Coin that Ruined My Life","id":"8khjto","url":"/r/nosleep/comments/8khjto/the_coin_that_ruined_my_life/","time":"1526687508000","body":"<div class=\"md\"><p>I&#39;m pretty sure most of you have read the reddit &quot;I played the Sara Sarita game.  I think I invited something into my home&quot; or something along those lines. I&#39;m pretty sure it was fake since the creator is still posting reddits, so he didn&#39;t die. This is true though.  I regret playing the game. I never wanted to anyway. </p>\n\n<p>I was having a sleepover and I was telling my friend about the Sara Sarita crap. He said, &quot;Dude,  we should play that!&quot; Now, I&#39;m into WATCHING paranormal stuff, not doing them. The only one I&#39;ve done was that Charlie Charlie crap. I thought it was dumb. I didn&#39;t want to so I told my friend it was bad idea,  but he didn&#39;t listen. He kept insisting to do it. He finally got to me and we did it. </p>\n\n<p>We got some coins and started. We started asking dumb stuff like &quot;Is the best meme succ? &quot; and dumb stuff like that. So I decided to be a weirdo and asked it &quot;Will my friend die tomorrow&quot; It landed on heads. Heads mean yes. I thought it was a COINcidence. Hahaha i hate myself. Anyway, we exited the game. I thought it was fake, and went on with my day. </p>\n\n<p>We went to watching OK K.O. Then, I heard something move. I looked behind me and the blanket moved from the couch onto the ground. I thought someone was pranking me, so I just ignored it. I also had a feeling no one was pranking me. I had a feeling something paranormal did it. </p>\n\n<p>It was late at night. My friend had to leave so he left. When he left,  my TV typed in 6 on its own. I was a bit freaked out but my foot was near the remote so I, just thought it was my foot. Though what happened next was a bit terrifying. It showed the coin I used to play Sara Sarita on the screen. It then flashed horrific images. I passed out at that moment</p>\n\n<p>I woke up at 9 AM. Suddenly, I heard ambulance sirens.  It was heading for my friends house. I found out later that he was murdered, but the knife had no fingerprints. I was suspecting who it could be. I thought to myself &#39;Who would do such a thing?&#39;</p>\n\n<p>I went to his funeral, but after I went I asked the coin another question. I didn&#39;t want to,  but I had to. </p>\n\n<p>&quot;Did you kill him?&quot; Don&#39;t be heads. Don&#39;t be heads. Don&#39;t be heads. Don&#39;t be heads. Don&#39;t be heads. Don&#39;t be heads. Don&#39;t be heads. Don&#39;t be heads. Don&#39;t be heads. Don&#39;t be heads. Don&#39;t be heads. Don&#39;t be heads. Don&#39;t be heads. Don&#39;t be heads. Don&#39;t be heads. Don&#39;t be heads.Don&#39;t be heads. Don&#39;t be heads. Don&#39;t be heads. Don&#39;t be heads. Don&#39;t be heads. Don&#39;t be heads. Don&#39;t be heads. Don&#39;t be heads. DON&#39;T BE HEADS. PLEASE FOR THE LOVE OF GOD DON&#39;T BE HEADS! I flipped the coin...... </p>\n\n<p>Heads</p>\n</div>\n","author":"FolioFriends"}