{"rank":"27","title":"My Property Isn’t Normal (Part 3)","id":"8khkip","url":"/r/nosleep/comments/8khkip/my_property_isnt_normal_part_3/","time":"1526687710000","body":"<div class=\"md\"><p>Hey guys! I’m back! I know it’s been a few days since my last post, one of the pales chewed through the wires of my generator and since civilians aren’t allowed out here by the organization i had to wait three days for one of their electricians to get out here. The only reason i knew it was a pale that chewed through the main cable was because i watch it do it. I was hoping it would electrocute it’s self but i forgot the part where that’s the only source of power for my house since then chosen had stolen my backup. </p>\n\n<p>This is probably a good time to say that if you haven’t read the first two installments of this series, you should, because i highly doubt any of this will make any sense. They aren’t long and i will link them at the bottom of this post. </p>\n\n<p>Back the the regularly scheduled programming. I realized while i was stuck in the dark for the past three days reading books hiking out of pure boredom that i hadn’t told y’all about the pales yet! They suck! But they are kinda funny once you figure them out. I’ve seen them on quite a few occasions on the property. </p>\n\n<p>The pales are white humanoids that crawl on the ground on all fours, usually dragging their belly and using the same motion that Spider-Man uses to climb wall. They can move at about a jogging pace and their faces are usually stuck in distorted expressions of pain or anger. And boy are they stupid as all hell. Lemme tell you about the first time i saw one. </p>\n\n<p>I had already been living here about 7 months i think so i was becoming familiar with the weird shit that calls this place home.  I was out hiking some of my trails. Kinda halfway looking for weird shit halfway minding my own business and suddenly i can hear what sounds like a baseball player sliding through the leaves of the forest floor trying to reach home plate ahead of me. Only the sliding didn’t stop. And it was coming straight towards me. </p>\n\n<p>I prepare myself but taking out my trusty bear grills survival knife and entering what i would describe as an aggressive stance. Felt pretty badass not gonna lie. Expecting some creature to come barreling out of the bushes in front of me i was a little shocked to see a butt naked man with super pale skin drag itself out from under the brush on its stomach. What is it with fucking naked dudes on my land. Can’t i get a pretty woman at least once? </p>\n\n<p>Anyways, after i got done being flabbergasted and became aware of my surroundings again i became aware that the dude was almost on me and was reaching out for my leg. So i jumped, on his back, AND IT WORKED LIKE A FUCKING CHARM. This little bastard didn&#39;t have super human strength like some of the other things out here, so when i landed on its back it couldn’t do anything but sit there and flop it’s legs and arms around like a fish. At this point I’m on the verge of tears. </p>\n\n<p>It hears me laughing and tries to turn its head and spit on me which it can’t do and that made me actually start crying laughing. I fell off of it at this point and the creature quickly turned around and locked its teeth onto the toe of my left boot. I like to wear steel toe boots around the property because even though they are heavy, i know that in a scuffle being able to kick with a boot and not having to worry about breaking a toe is a nice little advantage. This is what lead me to realize that even though the creature didn’t have super strength, it did have a super bite force. </p>\n\n<p>When it first latched onto my boot i wasn’t worried and started trying to shake the thing off without much urgency. I already knew it wasn’t a man by this point because it didn’t possess an asshole or other genitals. But i got a little worried when i notice the end of my boot changing shapes as the steel in the end started to bend. I then said out loud, “If you don’t stop right now I’m gonna stab your head you little shit”. It paused as if debating on the decision and then slowly started biting down again while its eyes looked up at me as if to try and call my bluff. I wasn’t bluffing. </p>\n\n<p>Few seconds later the thing is frantically clawing it’s way back into the forest with my favorite Bear Grills Survival knife™️ still in the back of it’s stupid fucking head. Nobody like a thief. Got back home fine but i had to replace my favorite knife and get a new pair of boots so it was a pretty shitty hike. It was the next time i saw one was when i figured out their biggest fear. And it’s so stupid.</p>\n\n<p>I was down I’m my creek playing with a new toy i had gotten in town earlier that week. It was this net that was designed to catch little minnows and shit and it was a blast. I don’t really have any use for minnows or whatever other little fish i was catching because i can’t go to the only pond on the property that had big fish in it since i made that deal with the crocodile man. So i was just catching them and letting them go. </p>\n\n<p>I’m suddenly greeted by the somewhat familiar sound of a grown man sliding across the ground on their belly. It had been almost two months since the last incident i had with a pale but i immediately recognized the sound. This was the dunce that had stolen my knife, and i really valued that Bear Grills Survival Knife™️ that can be purchased at your local Walmart! It really is a good product.</p>\n\n<p>Unfortunately the pale that emerged this time wasn’t the same one. It had a different face and was more of a light pink than\nOriginal white that was on the first pale. It was still the same type of creature though. This time things went down different. As it torn into the clearing that i was in about 30 feet from me it froze, with its eyes wide. As it had torn through the brush i was already facing its direction, holding the net spread out to my side the same way a bullfighter holds a red cape since i was preparing to throw the net into the creek. </p>\n\n<p>The pale’s eyes were switching between looking at the net and looking at me so i looked at the net and back to him. Then it clicked. “No way” i giggled to myself as i started to catch onto what was happening. I took advantage of my suspicions and started running and flailing the net around at the pale and it freaked the fuck out. It actually rolled over trying to turn to fast as it spun around and took off into the woods. I then started wheeze laughing as i fell to the ground with tears running down my face. This fucking thing can bite through steel but is terrified of a nylon net! I know that might not be funny to some because i have a twisted sense of humor. But it made my week.</p>\n\n<p>Long story short, i keep the little net in my hiking bag every time i go out now and every pale I’ve come across is utterly mind fucked at the sight of it. Good times man. Wish all the things around here were that easy to deal with. </p>\n\n<p>On another note, i got an email from an organization asking me about the Keelut that the the lady in the tree claimed that i killed in the last post. They wanted to know if i had disposed of the body and if they could come and retrieve the remains from the woods if i had just left it. Then they said something that caught me off guard. When i said something about having to check with the program that put me out here they responded with “We are the parent Organization of that program” and proceeded to give me my own address and well as detail about my former life they only the program should have known about.</p>\n\n<p>In all seriousness i have a dark past and haven’t always been a great man, but I’m done with that shit and it pissed me off that they would even bring it up. I responded with a simple “fine, but don’t bring that shit up again.” And blocked the emailer. No one has shown up yet but i guess we will see what happens.</p>\n\n<p>On a good note, i haven’t seen skinny in a couple of weeks. So that’s nice. </p>\n\n<p>See y’all next time and feel free to leave your questions in the comments, and if you have any ideas what these pales actually are or what a Keelut it please tell me. If any of you are good with research stuff i would appreciate it. Talk to y’all again soon!</p>\n\n<p><a href=\"https://www.reddit.com/r/nosleep/comments/8j9y4o/my_property_isnt_normal/\">Part One</a></p>\n\n<p><a href=\"https://www.reddit.com/r/nosleep/comments/8jo10u/my_property_isnt_normal_part_2/\">Part Two</a></p>\n\n<p><a href=\"https://www.reddit.com/r/nosleep/comments/8l7viu/my_property_isnt_normal_part_4/\">Part four</a> </p>\n</div>\n","author":"Murderbird17"}