{"rank":"2","title":"Life in the Forest of Hell: Sanity","id":"8khpsv","url":"/r/nosleep/comments/8khpsv/life_in_the_forest_of_hell_sanity/","time":"1526689200000","body":"<div class=\"md\"><p>I woke up to rain thumping against the plane shell. The blood on my forehead had dried and I wiped it away with my jacket sleeve. My whole body felt as if I&#39;d been hit with the sharp part of the hammer. As I got to my feet slowly I focused on the rain. It was a center to me right now and my condition isn&#39;t too good. </p>\n\n<p>I walked out into my supplies area and walked to the box I kept the first aid in. I probably had a couple broken ribs from when that grater tossed me around like a ragdoll. I dug through the box until I found an ace bandage, Band-Aids, and some anti baterial cream. It took me awhile to bandage myself up. I put my shirt back on as I walked to the door. </p>\n\n<p>The rain was still a center in my mind. It&#39;s how I felt even remotely safe right now. When I&#39;m in this much pain I seem to lose myself in it. It seems to bleed into my personality. Like when I feel pain I feel a deep pull from within. It&#39;s like an urge to spread that pain anyway possible. Almost like pain brings up a different me. I&#39;ve had to survive through this hell hole of a Forest for 5 summers now and I&#39;m starting to lose it. I really wish someone would he capable enough to not die when I meet them. </p>\n\n<p>I got to the door and unlocked it. I pushed it open to see the lush green again. For once it&#39;s actually safe to go outside with no weapon. Why? Because the creatures that want to eat me all disappear when it rains. I mean that quite literally too. I was in a tree hiding from a couple grater&#39;s and a few wolf people only to have it start raining and the creatures just... Turned into smoke. </p>\n\n<p>Either way the reason I&#39;m coming out here is to wash the blood off me. As the rain hit my face I ran my hands through my hair to find where I&#39;d been busted open. I found a small but deep cut. The rain was coming down decently fast so I was pretty wet after a couple minutes.</p>\n\n<p>I listened to the forest sounds or lack there of over the rainfall. I could hear footsteps but I wasn&#39;t sure. This was strange. I&#39;d never meet a person at my home before. I gripped at my waist for my knife and felt the comfort of the handle. I gripped it with a tense stare in that direction. </p>\n\n<p>As the steps got closer and closer I start to get a bad feeling about this. What was coming from around those clusters of trees. I watched a group of three trees grown in on each other in anticipation for a threat or a friend. As the leg came around the corner I instantly knew which one it was... </p>\n\n<p>The long grey limb slapped the ground with a wet sloop. As it whole body came around the corner I felt my stomach drop. </p>\n\n<p>&quot;Oh my god...&quot; I said aloud. </p>\n\n<p>This Thing was at least 10 feet tall, it&#39;s large teeth stuck out over it&#39;s bottom jaw. It&#39;s large eyes stared into me like pits straight into hell. it&#39;s arms were backwards, and twisted in impossible ways. It&#39;s arms had like thirty joints. It&#39;s breathing was a gagging gurgle. It stared at me with it&#39;s arms held up like a Mantis. It&#39;s hands were single sharp spikes. This thing was definitely one of the scariest fucking things I&#39;ve ever come across. How is it still here in the rain?! </p>\n\n<p>As soon as I thought that it turned to smoke!!! I jumped back in pure bewilderment as I did my best not let out a terrified shriek. I looked around quickly and only found the rain drops constantly beating down on everything it could hit. My fear was replaced by wonder as I lost the grip on my knife handle. I turned around to go back inside when a voice shattered the silence</p>\n\n<p>&quot;Hey buddy. You know the way back to the lodge I got a bit lost.&quot; A man&#39;s voice said behind me. If I had a surface to hit my head against in reach right now I&#39;d do it until my skull cracked. </p>\n\n<p>I turned around not trying to hide my emotion. He was about ten feet from me and he stopped when I turned around. </p>\n\n<p>&quot;Now that&#39;s a horror movie shot.&quot; He said in a sarcastic tone. It was at this moment I realized that what I was doing was far stranger then one would think. I was washing blood off my face with rainwater. I guess I&#39;d be a little cautious if I saw that sight to. </p>\n\n<p>&quot;Nope.&quot; I said shortly. He slowly recoiled and then I noticed the rifle on his back. Looked like a standard hunting rifle. They are sloppy and only have use in a very sticky situation. I&#39;d honestly prefer a sidearm to a rifle. This guy was a deer Hunter most likely and has no idea what he&#39;s gotten himself into. </p>\n\n<p>He was wearing camo that covered his skinny frame, he also had some mud on his face which gave him a small impression of survival ability. </p>\n\n<p>&quot;I&#39;m going to be honest with you man. That blood on your face doesn&#39;t make me want to get help from you.&quot; He said with a nervous smile. I wiped the blood from my face as best I could.</p>\n\n<p>&quot;If it helps any it&#39;s my blood. I can even show you the cut it came from too.&quot; I said looking up to see the rain stopping. I frowned. </p>\n\n<p>&quot;Come inside man, I&#39;ll get a protein bar out for you.&quot; I said turning and walking into my home. He followed and he shut the door behind him. The dim lighting from the slow burning candle provided light. My eyes have well adjusted to this level of light but I wonder how he&#39;s handling it. </p>\n\n<p>&quot;Ssssssssuuuuuuuffffffeeerrrrrr&quot; a voice said behind my ear. I whirled around with my knife drawn ready for a fight!... Only to have that dude stare at me strangely. The candle light flickered as his will did. I brushed it off and got him his snack. I can have good hospitality but I&#39;m not feeling good about any of this. </p>\n\n<p>&quot;Aaaaagggggoooonnnnnyyyy&quot; the voice said again. I shot up grabbing my bow and quiver. I bust out of my home at a dead sprint! I heard him say something but I didn&#39;t care. The rain was still stopped but I just kept running. </p>\n\n<p>&quot;Jjjjjjjjjjjeeeeesssssttttteeeeerrrrr&quot; it said again. </p>\n\n<p>&quot;GET OUT OF MY HEAD!!!!!!!&quot; I screamed as loud as I could. I continued to race through the trees as I felt the cold hands on my back. It pushed me faster. I gritted my teeth as the pain returned through my body. </p>\n\n<p>&quot;Pppppppprrrrrrrreeeeeepppppppaaaaarrrrreeeee&quot; the voice said in a deeper tone. I slid to a stop when it said that. Prepare? Prepare for what? I didn&#39;t feel that presence anymore. I also had no clue where I was. I walked the way I came and I started to see shadows from the corners of my eyes, and figures darting behind trees. I gripped my knife and waited for the woods to send me my next challenge. These things may think their king out here but these are my woods! </p>\n\n<p>I pressed on drawing the attention of whatever was stalking me. My adrenaline rush made time go slow. I could hear something out there but it was coming from multiple directions. It sounded like a group running around me. These things were fast but why not just attack me. </p>\n\n<p>I drew my bow and fired an arrow that cut a thick strand of moss causing a branch to fall to the ground. It tripped up one of those thing and the footsteps stopped completely. I didn&#39;t get a good look at the thing but it was up and gone before I could attack. The footsteps never returned. I sighed and turned to see how far I&#39;d walked. </p>\n\n<p>I turned around to horror... Standing in front of me was a woman. She had one eye that looked rotten, her hair was clumped together like a corpse. Her skin was charged and in parts she was missing flesh. Her hand was completely missing. This bitch had been through hell. She stared at me with that gross as fuck eye. </p>\n\n<p>&quot;Jjjjjjjjjjjeeeeesssssttttteeeeerrrrr&quot; she said in the same voice that was in my head. </p>\n\n<p>&quot;So it was you? How&#39;d yo-&quot; I got cut off </p>\n\n<p>&quot;PREPARE&quot; She screamed in low voice. I lurched backwards as she continued to stare into my soul. I scrambled to my feet and rage flooded my body out of nowhere. I got the sudden urge to kill her. It quickly changed to deep sadness for this woman... What happened to her. The rage came back and I lunged forward at her ready to rip her head off.  I only found the dirt. She was gone! </p>\n\n<p>Better yet my emotions were mine again. I got to my feet and ran towards my home. All the way there I could see her standing behind trees, next to shrubs, and once she appeared in front of me only to vanish when I got close enough. </p>\n\n<p>&quot;LEAVE ME THE HELL ALONE!!!!&quot; I screamed as my home came into view. I came to a slow trot as I came to the door. It was closed but not locked. The guy from before wasn&#39;t there at all. The mud where his boots tracked it in weren&#39;t there anymore. Plus the place smelled like copper.</p>\n\n<p>My mind was bending it seemed. The whole thing that just happened is too nonstop. My body hurts, my mind feels weak, and I&#39;m still not doing to well on food! I collasped onto a crate of supplies and prayed that someday I might get out of this place. </p>\n\n<p>&quot;Ssssssssuuuuuuuffffffe-&quot; I drew my knife. </p>\n\n<p>&quot;SHUT UP!&quot; I screamed as I thrust the knife forward as I whirled around in a flash of rage. </p>\n\n<p>My knife found it&#39;s Mark.... Right in the man from before chest! He locked eyes with me as I looked at the floor.... The mud was there again! He looked at me with fear and pain in his eyes.... I looked down at the knife in his stomach. The blood came from his mouth in a spray. Drops got on my face... </p>\n\n<p>A searing heat came from inside me.... It was fear, rage, pain, and calm all mixed into one emotion. My face went blank as I slowly slid the knife out. My ears were ringing too loud to hear his screams.</p>\n\n<p>He dropped to his knees and held his stomach as blood poured onto the floor. Am I going to just let myself just fall into misery? No fuck that! </p>\n\n<p>I pulled my hand back and thrist the knife into the man&#39;s throat! I ripped the knife out messily and he slumped forward.... </p>\n\n<p>I dropped the knife and walked outside again.... I fell to my knees. The blood covered me again. I went to my hands and knees and threw up. I felt sick to my stomach. Tears forced their way to the surface. I slowly looked up to see the woman again.... Except this time she had a friend... The man I&#39;d just killed! </p>\n\n<p>I Screamed as loud as I possibly could.....</p>\n</div>\n","author":"MemeSSJG"}