{"rank":"33","title":"Why I stopped playing Hide and Seek, in the Dark","id":"8khrfe","url":"/r/nosleep/comments/8khrfe/why_i_stopped_playing_hide_and_seek_in_the_dark/","time":"1526689651000","body":"<div class=\"md\"><p>When my parents and I lived with my grandma, who was on the country side, my cousins and I always played Hide and Seek in the dark when we got the chance to go outside at night, the oldest was Chance, the youngest was Ethan, making Jacob and I the middle. We always pulled straws or played &quot;rock, paper, scissors&quot; or &quot;Blue shoe&quot; to see who seeks and who hides. That night, Chance, was the seeker, and the rest of us got to hide, we all split up as we heard Chance counting.</p>\n\n<p>&quot;One, two, three...&quot; was echoed through the yard. I got into my hiding place which, was an old car my Uncle Micheal wrecked when he was younger, I got into passenger&#39;s seat an ducked down so I couldn&#39;t be seen through the window. After a few seconds, I heard Chance call out. </p>\n\n<p>&quot;Ready or not, here I come!&quot; There was pure silence until I heard whispering in my ear, </p>\n\n<p>&quot;You&#39;re not safe..no one is safe..&quot; is what I heard. I looked over and saw a black, shadowy figure looking down at me with bright white eyes through the window, I tried to scream but nothing came out, my eyes stung from tears running down my pale face, I ended up passing out...or so I thought.</p>\n\n<p>I woke up in a car, my mom got her license and wanted to drive me to school, the car looked just like the one I was hiding in but, it wasn&#39;t rusted, broken down and, covered in weeds. I was so confused what was going on. All of a sudden, a car that&#39;s going the opposite direction in the same lane, crashed into us, time slowed down, everything hurt, from the pieces of glass slicing into my forehead, to my body being crushed from the car, it was slow and horribly painful, as is someone threw me into a meat grinder and, I was being crushed very slowly. As my ears rang, I heard a mumbled voice, as if it were in a sound proof room and, shouting very loudly but, still comes out as a mumble. The ringing went down just a bit so I could here the voice. </p>\n\n<p>&quot;Wake up Macy!&quot; it called, it sounded like Chance. I immediately woke up and saw my cousins, my parents, and my grandma, they were all in tears. Chance looked me dead in the eyes before hugging me tight. </p>\n\n<p>&quot;Don&#39;t ever scare me like that again.&quot; he whispered, I smiled that everything was okay, not even realizing that I was crying too. When everything settled down, Chance told me that he found me in the car but, there was something off about me, my eyes were pure white like my eyes rolled to the back of my head, I was sitting up in the passenger&#39;s seat whispering, </p>\n\n<p>&quot;Not safe..no one is..&quot; Chance took immediate action, forcefully opening the car door, picking me up and rushing me to the house while screaming for my parents, this alerted Jacob and, Ethan to come out of their hiding spots and run into house. When he got inside, he gently set me on the couch, my mom was completely shocked. I was out of my body and in that other place for an hour but, it felt like days. </p>\n\n<p>Many days, months, and years passed by, I still see the figure I saw that night, I have night-terrors of being in that car and always dying in it, and it always whispers, &quot;you&#39;re not safe..no one is safe..&quot; I never played Hide and Seek in the dark ever again.</p>\n</div>\n","author":"PreciouslilPiggy64"}