{"rank":"5","title":"Dead Men (Part 1)","id":"8khtqd","url":"/r/nosleep/comments/8khtqd/dead_men_part_1/","time":"1526690398000","body":"<div class=\"md\"><p><em>&quot;What kind of legacy can you possibly leave, if every person you are living up to is dead?&quot; – Dr. Tamara Lippmann</em></p>\n\n<p>My therapist recommended I do this. She’s a wonderful person, though maybe too idealistic. She’s the one who asked me about the concept of a “legacy.” At one point she said I could be a great therapist, but I doubt I would have the emotional stamina to listen to people’s problems day in and day out without drifting off and analyzing the minutiae of my office, like how Newton’s Cradle never falters in its task, even with the windows open and a healthy Charleston breeze blowing through.</p>\n\n<p>Because that’s where the office would likely be: Charleston, South Carolina. My ancestral homeland. Not here, in some Big Apple high-rise where the air needs to be piped in and filtered because you’re too high up to open some fucking windows.</p>\n\n<p>This is getting away from me, let me start over.</p>\n\n<p>My name is Evie Sutton. That’s what I always introduce myself as, because the name on my birth certificate is a long and hideous millstone that I don’t exactly want to strangle someone with upon first meeting. I’m Evie, and I’ve been in therapy for about a year now to treat PTSD from events that happened… is it really two years ago now? I swear, sometimes it feels like only yesterday I saw that desiccated corpse curled up on the floor, the skeletal face frozen in agony and terror.</p>\n\n<p>I’m getting ahead of myself again. This happens every time I try to write down what happened, ever since Dr. Lippmann advised it as a way of processing those events. Every time, I start explaining who I am, and then somehow by the end of the paragraph I’m looking the boo-hag mummy square in the face. Like that.</p>\n\n<p>But now, I think I know why I couldn’t progress properly through the story. It’s not a matter of not having enough time – I’m juggling my classes just fine, I actually have pretty good time management skills. I thank <em>Maman</em> for that (miss you). No, the reason is because I always start with <em>me</em>. Which makes sense, of course. If you’re writing about something that happened to you, it’s only natural to start talking about you. The reason it’s hindering me in this case, however, is that the events themselves didn’t start with me. The seeds were planted generations ago.</p>\n\n<p>That’s why I had to consult the diary, leather-bound and weather-beaten. It’s not mine, as I have never been in the habit of documenting my day-to-day, though all things considered I should probably start. It belonged to my great-great-great-great grandmother Lavinia Breen Sutton. I handle it with utmost care anytime I open it, and the entries go a long way toward putting me in the right mindset for this, transporting me back to the days of willow tree canopies and crinoline.</p>\n\n<p>And before you ask, no, Breen was not her maiden name, merely a family name. Her last name was Sutton, just like mine, but she was a married woman – happily, as far as I’m aware. I’ve always thought it was impressive that she got to keep her own name in the 1860s.</p>\n\n<p>But that’s when the action really started. That’s when the “legacy” truly developed. I’ll try to give you the rundown. #</p>\n\n<p>Sutton Hall was built near the swamps of Carolina when European powers had reached the pinnacle of their colonization efforts in the New World. They laid claim to the virgin frontier and built massive Palladian structures, importing a host of enslaved peoples for the landed aristocracy to commence their new cotton, rice, and tobacco plantations. Exultations of noble heritage transformed over the next couple hundred years into an endless pursuit of the elusive “American upper class” – a miscellany of privileged yet wistful citizens longing for the titles of their aristocratic European ancestry from which they had become disconnected, industrialists and robber barons descended from unwashed paupers with nothing material to leave behind in their homelands, and the occasional poor greenhorn who stumbled into fame and fortune from a sunken valley to a towering peak and stared up at the shimmering stars overhead, wondering what he had wrought upon the world.</p>\n\n<p>I am descended from a union of the first and the last.</p>\n\n<p>As the tale has always begun – and I don’t know why I ever bothered to start it anywhere else – it was the eve of the American Civil War. South Carolina had voted to secede from the union, and Renard Sutton, widowed patriarch of Sutton Hall, felt the weight of the world crushing his increasingly frail bones. Renard had five children: four sons, and a daughter, Lavinia.</p>\n\n<p>His sons had already been having the “discussions,” which became even more impassioned with the vote for secession – leading to a literal war of brother against brother. They’d tell Lavinia to keep her nose out of it, though. Not to worry her pretty little head. After all, didn’t she have bigger, better things to worry about? Didn’t she need to transform herself into the perfect Southern Belle, marry into a good family, bear children of outstanding pedigree and manners, and in general be a lady? She couldn’t do any of that worrying about the threat of violence that was in the province of intelligent, discerning men like them.</p>\n\n<p>So they discussed. They argued. They fought – about the merits of secession, the feasibility of abolition, of living off slave labor for the coming generations, whether the abolitionists were morally right, ad nauseum. Within a year the verbal battles became ones of bullets and cannon fire, as three brothers joined the Confederate Cause while the second youngest son, ever the black sheep, trudged up to West Virginia to enlist in its seventh infantry volunteer regiment. He died in the Battle of Antietam. The other three died in Fredericksburg, Chancellorsville, and the Crater. Over essentially philosophical differences shrouded in wealth, they threw away every opportunity they had and went and died young and healthy, like a bunch of goddamned idiots. (Those aren’t really my words, by the way – I’m quoting Lavinia’s diary. She had no chill.) Having never married or produced children, they left Lavinia as their father’s heir.</p>\n\n<p>While his sons had been busy getting themselves blown to bits, Renard Sutton worked with Lavinia to secure them a future by creating a lumber business, foreseeing a more industrial south as the Cause grew more and more lost, all while taking in families driven from their Sea Island plantations by the Union forces. General Sherman despised the Suttons for this – he hated all things South Carolina anyway, which he had termed “the cockpit of secession,” but bore especial disdain toward landowners who helped each other out. Thus the Suttons’ precarious position as proprietors of a safe haven was ripped from them when Sherman’s men burned Sutton Hall, a historic Greek revival structure, to the ground.</p>\n\n<p>This part of the diary has often taken on an ethereal quality, the curves of Lavinia’s already meticulous handwriting becoming more careful, in every spidery hook of her C or double-loop of her O. As if she was afraid she would recount something incorrectly, the preservation of the record absolutely vital. She wrote that Renard, injured in the fire from a fallen beam, hobbled with her from the flaming wreckage of their home for miles, through humid, gnarled old growth forest and leech-ridden marshes. The stretch of untamed nature seemed eternal – until they stumbled upon a remote, ramshackle cabin on the marshy bank of a blackwater river.</p>\n\n<p>Have you ever seen a real blackwater river? They’re all over the southern United States, winding their ways through the wetlands, and they owe their existence to death itself: decaying flora release tannins into the water, staining it… well, black, like a cup of strong, bitter tea. The real fun starts, though, when the sun hits it just right. Then you get some lovely chocolate and caramel hues – or, if you’re really lucky, blazing copper and orange.</p>\n\n<p>Renard and Lavinia Sutton stood at the banks of one of these rivers, watching the sun peek through the canopies of the ancient trees to glisten on the water, the submerged peat rendering it orange, like a halo of lava underneath the shack. With nothing left to lose, they knocked on the door.</p>\n\n<p>It was answered by a tall, reed-like black man, with a thick mustache and eyes that missed nothing. Renard was surprised to recognize him – he was a former slave from a neighboring plantation, a Gullah man freed upon the death of his master and called Deadman for his trade as a gravedigger. Malachi Deadman. He stared them down at first, likely wondering how they traveled so far in their finery and judging the entire situation to be suspicious as all hell. Once he deduced that they were in fact telling the truth, he welcomed them into his humble abode.</p>\n\n<p>According to Lavinia, this gravedigger clearly didn’t know how to clean. Dust / dirt was all over his floor, the upper surfaces of his sparse furniture – hell, his <em>walls</em> apparently were dusty. Searching for a goddamned broom (again, Lavinia’s words; she was clearly fond of “goddamn”) so she could sweep up a place for her father to rest, she came across a shelf running the length of the wall, filled with jars of coarse herbs and spices. Interspersed among the jars were faceless poppets and a pincushion stuck with a dozen pins, and at the very end of the shelf lay a Bible… and a copy of “Sechstes und Siebentes Buch Moses.”</p>\n\n<p><em>The Sixth and Seventh Books of Moses.</em></p>\n\n<p>That last item lit a fire of apprehension in Lavinia’s soul.</p>\n\n<p>Malachi laid Renard on the cot, which I’m guessing wasn’t dusty after all, and pulled a chair to the bed for Lavinia to sit with her father. Renard’s skin warmed and flushed with fever as the gravedigger inspected his knee, which had become locked in a bent position, and the shoulder wounds that were turning putrid. When Renard, in a weak voice, asked him what kind of payment he wished for his services, Malachi laughed and told him, “None. Uh duh fehl… cheh’tey.” <em>I am feeling “charity” – charitable.</em></p>\n\n<p>(These translations are not my own – Malachi’s dialect is written phonetically in Lavinia’s diary, her translations along with it. She is clearly concerned with preserving his actual statements, and she translates as though she is intimately familiar with his language… which I suppose she was, but I’m getting ahead of myself.)</p>\n\n<p>Returning to the “fire of apprehension” bit, Lavinia was already distraught from her father’s injuries and the loss of her home. Upon his refusal of payment she panicked, accusing him of wanting to use her body in exchange for healing her father’s, and implored her father to see that it was ill fortune that brought them to the shack: “Papa, that halo came from below!”</p>\n\n<p>But Malachi took no offense and kept calm, assuring Lavinia, “Bey ehsey. No fey. Uh nuh huht ooh.” <em>Be easy. No fear. I won’t hurt you.</em> He gestured to Renard, who was drifting in and out of consciousness, and told her, “Uh guine he’p um.” <em>I’m going to help him.</em></p>\n\n<p>Having ascertained the extent of the damage done to Renard Sutton’s body, and what he would need to do to save him, Malachi retrieved his necessary supplies and laid them out on the floor: one poppet, one pin, the grimoire, and three different jars, no labels. Lavinia suspected labels would serve him no purpose – which would also explain why he had a German grimoire. He didn’t need to read the text.</p>\n\n<p>Lavinia was proven right when he flipped through several pages to get to the right one. She saw diagram after diagram, and doodles with arrows, and deduced that someone who knew the contents of the book had dictated them to Malachi, and he had drawn the rituals in a way that he would remember. He seemed to know his numbers, though, if the diagrams were anything to go by.</p>\n\n<p>“Ah,” he said when he reached the right page. From what Lavinia could see, it was a ritual of many numbered steps, involving a figure in a rectangle, surrounded by smaller circles. He fished a compass out of his pocket, and adjusted where he sat so that he could face east, causing Lavinia to move as well. He took a deep breath and released it slowly.</p>\n\n<p>“Ummm… Mr. Deadman?” Lavinia asked, unsure of how she should address him and wary of his earned surname.</p>\n\n<p>“Miss Sutton?” he responded as he opened a jar. He spoke her name as though he found it an exotic, pleasing language.</p>\n\n<p>“Should we not be… dressin’ my fatha’s wounds?” (Lavinia wrote her own speech phonetically, as well. As if she, a genuine Southern Belle, saw no reason for her own English to be superior.) She looked at her father’s feverish form on the cot, and felt compelled to be near him. But when she moved to stand, Malachi reached out and grabbed her wrist.</p>\n\n<p>“No move!” he exclaimed. Seeing how he startled her, he loosened his grip but remained firm. “No go ova deh. Stay. Back.”</p>\n\n<p>Lavinia resumed her seat. “Why should I stay back while my Papa’s dyin’? And would you mind very much tellin’ me what exactly you’re doin’?”</p>\n\n<p>“Necessary,” he told her, enunciating the word. “We no do dis, Miss Sutton, yeh fadda guine die.” <em>If we don’t do this, your father will die.</em> “Soon.”</p>\n\n<p>“But what is… <em>this?</em>” Lavinia demanded, gesturing wildly to the components laid out before her.</p>\n\n<p>“Da anger da gen’ral, Sherman, him call da fie er we, dem demon. Da’why yeh fadda sick. We tell dem demon say dem go, dem go, dem leff long um da sick.” <em>General Sherman’s anger called fire and demons on us. That’s why your father’s dying. We tell the demons to go, they’ll go, and they will take the infection with them.</em></p>\n\n<p>She didn’t really understand everything Malachi said at the time, but felt she got the gist of it, and nodded along. “Do you… need my help?” When he shook his head – “No now. Lehta.” – she subsided. And then she watched him work.</p>\n\n<p>He poured from three jars of herbs – Lavinia thought she smelled sage and figs, which was a strange combination – in an oblong shape around the poppet, which she noticed had three sandy hairs strewn across it. She recognized them as her father’s. The outline of the poppet now resembled a coffin, its feet facing her. What was he doing to her father? Malachi continued carefully strewing the herbs until they created six smaller circles along the head, feet, and side facing him. (Lavinia later learned this was considered the Twelfth Table of the Schemhamforash.)</p>\n\n<p>Then Malachi slammed his hand in one of the smaller circles. As soon as his hand slapped against the wood he proclaimed, “Buh you, O LORD, do no’ be fa’way! O mah he’p, come quick to mah aid!”</p>\n\n<p>That was one of the Psalms, she was certain. His accent altered some of the words, but given that the Psalms were originally in Hebrew, not English, Lavinia figured that the spirit behind the words mattered more than the words themselves. She hoped.</p>\n\n<p>He repeated this process again and again, with his hand in a new circle and speaking a new Psalm each time, until she lost count. Did she even know that many Psalms off the top of her head, without consulting her Bible? His knowledge humbled her.</p>\n\n<p>He reached the closest circle to her for the last time, finishing with “SHEM-HAHM-FO-ASH!” With that, he took the pin and stuck it in the poppet’s chest.</p>\n\n<p>Lavinia screamed at the action, and in the next moment felt the air around them shift, as if swirling around them, trapping them in a whirlwind. Her breath quickened when she realized that was exactly what was happening, the herbs floating up to enfold them in an umber cocoon that shut out all sound from the outside world.</p>\n\n<p>In the silence that followed, a tiny wisp formed over the poppet, glowing a soft yet icy blue. It hovered unassumingly, and Lavinia was so entranced she hardly noticed Malachi tapping her shoulder.</p>\n\n<p>“What?” she asked, unable to take her eyes from the wisp.</p>\n\n<p>“Uh nee’ yeh he’p now, Miss Sutton.”</p>\n\n<p>Lavinia was aghast. “With what? What’m I supposed to do?”</p>\n\n<p>“Tahk’um.”</p>\n\n<p>“Did you just say I need to talk to it? What… ’bout what, what do I tell it?!”</p>\n\n<p>Malachi did not offer any further assistance, however, leaving her to decide what was most important. Perhaps he said nothing so that she could realize she was the only one who could make such a decision. So Lavinia took a deep breath, and told the wisp the only thing she could think of: what she judged, at that moment in time, to be the simplest truth.</p>\n\n<p>“My name is Lavinia Breen Sutton. I’m twenty years old, and I mus’ care for my fatha. My Mamma’s long dead, and I lost four brothers to the madness that is this war. I don’t know what, or who, you are, but I cannot lose my Papa now, when I need him most.”</p>\n\n<p>At first, there was no response, and the wisp remained still and soundless in the air. Lavinia turned to Malachi and asked, “Did I do somethin’ wrong?”</p>\n\n<p>“Shhhhh,” he told her, not removing his eyes from the wisp. It grew, slowly, the outer halo becoming sharper, stronger, until the light was almost blinding. And then it burst into a white pillar more dazzling than the sun. Lavinia did her best to shield her eyes, but she could see the faintest outline of a figure beyond the bounds of the pillar of light – something “vaguely human,” as she wrote. It spoke to her, a voice of unimaginable strength and timbre that she felt in her chest more than heard with her ears:</p>\n\n<p>“THE FRUIT OF THE TREE SHALL BE GIVEN TO THE ELECT. THE SWEET ODOR SHALL ENTER INTO THEIR BONES; AND THEY SHALL LIVE A LONG LIFE ON THE EARTH AS YOUR FOREFATHERS HAVE LIVED; NEITHER IN THEIR DAYS SHALL SORROW, DISTRESS, TROUBLE, AND PUNISHMENT AFFLICT THEM.”</p>\n\n<p>With that, the pillar and its accompanying apparition faded from view, taking with them the herbs that had been strewn about, as well as the poppet and pin. Nothing lay before Lavinia and Malachi now.</p>\n\n<p>“Uh nee’ make anudda poppet now,” he remarked upon its absence, as if annoyed at the loss of his tools. Lavinia was too stunned to say anything. He tapped her on the shoulder: “Go, see yeh fadda. Uh guine make da tree now.”</p>\n\n<p><em>Make the tree?</em> Lavinia thought. But when she remembered her father still lying on the cot she dashed to him, rushing to examine his shoulder. Amazingly, there was no blood or infection remaining. In fact, there wasn’t so much as a single scar to denote that he had ever been injured at all.</p>\n\n<p>“Ugh…” Renard muttered, waking as if from a long sleep. “’Vinia, sweetheart… where am I?”</p>\n\n<p>“We are in Mr. Deadman’s cabin, Papa,” she told him. “Don’t you rememba? We came here afta…” She swallowed at the memory. “Afta the fire.”</p>\n\n<p>“Oh, good Lord…” her father trailed off before moving to sit up.</p>\n\n<p>“Are you sure that’s wise?” she asked, even though she could see he had no difficulty with the movement.</p>\n\n<p>“Can’t lie still, sweetheart, I’ll get stiff,” he told her as he rubbed his knees, which always bothered him. Rheumatoid arthritis had afflicted him for almost ten years. But then he stopped and fell silent, his eyes full of shock.</p>\n\n<p>“Papa, what is it?”</p>\n\n<p>“My knees, they’re… they’re fine. They’re fine!” With that, he laughed and leapt jubilantly from the cot with his arms out like an actor on the Shakespearean stage. Lavinia was shocked into happy silence, watching as he walked back and forth, marveling at his ability to move with fluid grace and purpose.</p>\n\n<p>His next question, however, startled her back into seriousness: “Lavinia… are we dead?”</p>\n\n<p>“No! No, Papa, we are very much still alive, and Mr. Deadman is right over there –” She broke off when she saw Malachi on all fours in front of the door to the cabin with a bit of charcoal in his hand, coloring in lines that looked as though they had faded with repeated footfalls. Lavinia followed the lines, the curves, and realized it was a drawing of a leafy branch – something like a palm frond. So not a “tree,” per se. In each leaf were Hebrew characters, drawn more than written, with painstaking attention to detail.</p>\n\n<p>Renard spoke to him: “I mus’ wonda why that Orrin Abercrombie ova in Lake Point would ever’a turned you away? Giv’n what you can do?”</p>\n\n<p>Malachi sighed as he stood, finished with his palm frond ward. “Da younga Ab-crumb… no’proof.”</p>\n\n<p>“Somehow I’m not surprised,” Renard replied. “But his fatha, Lavern – he approved, I’m sure?”</p>\n\n<p>“Ohhhh, yes,” Malachi nodded, a wistful look entering his sloe eyes. “Guess um way o’ thanks were turn me free.”</p>\n\n<p>An uneasy silence befell the group, and Renard was the one to dispel it. “Well, night’s a-fallin’, so why don’t I make use of my newfound vigor and make us a fire in that there hearth?” And before Lavinia could utter a word of protest her father commenced a task that ordinarily would’ve been carried out by a slave. Even Malachi smiled bemusedly at his actions. The man was just happy to move freely.</p>\n\n<p>Malachi, for his part, put his hands on his hips as he surveyed his humble abode and concluded soundly, “Uh nee’ clean.”</p>\n\n<p>“Oh no, let me!” Lavinia exclaimed before she could help herself. As she reached for the broom in the far corner, she recognized that no one was behaving normally in this place, but… didn’t really care. “You have already done so much, Mr. Deadman. Why don’t you sit down? I’m certain you’re tired.”</p>\n\n<p>His smile took on even more bemusement as he pulled up a chair. “Vey well… <em>Miss Certain.</em>”</p>\n\n<p>The way he said the nickname, with his Gullah lilt, sounded so much like her real name (Miss Sutton) that it took Lavinia a few moments to get the jest. When she did, she cast an amusedly vexed glance upward and witnessed a genuine laugh from him. It wasn’t a grand gesture, but the sound built and resonated through the cabin, magnified by the dimming light.</p>\n\n<p>As Lavinia swept, she figured she could get some questions answered. “May I ask, Mr. Deadman –?”</p>\n\n<p>“Malachi, miss,” he interrupted. “Call me Malachi.”</p>\n\n<p>“Very well… Malachi.” Lavinia was hardly accustomed to addressing men outside the family by their Christian names, but she found she liked the sound of his on her lips. She would have to ponder that. “May I ask how you came across that there book?”</p>\n\n<p>“Ooh may,” he smiled, poking fun at her politesse. “Fi’teen year ’go, uh work da field, pick da rice. Ovaseea Lawson were… mean mean man. ’E were dog, ’e bite ooh. ’E like pain… Uh heht um.” <em>Fifteen years ago, I worked in the rice fields. Overseer Lawson was a horrible man – if he were a dog, he would bite you. He liked pain. I hated him.</em> Malachi looked off in the distance before continuing his tale. “One day, dis man come from… Peh-sahn-ee-ah? Pah-soh-vahn-ee-ah?”</p>\n\n<p>Lavinia’s brows furrowed at the name before she realized what he was saying. “Was he from Pennsylvania?”</p>\n\n<p>“Das it!” he exclaimed. “Pen-seel-vehn-yah. Das it. ’E spoke da English an’ da German. ’E got da big, big beard, an’da… da eye-glass, an’da hat. ’E come ter Kimball an’ preach. Da buckrahs no like um, buh dem binnah go mad fuh dem ain’t beat a pretcha!” <em>He had a huge beard, big eyeglasses, and a big hat. He came to Lake Point to preach to us. The white men didn’t like him, but they couldn’t do anything and were going crazy, it’s not like they could beat a preacher!</em></p>\n\n<p>Lavinia raised her eyebrows. “No, I suppose they couldn’t do that! So, how long did this… Pennsylvania Dutch preacha stay with you all?”</p>\n\n<p>“Dutch? Um no Dutchie, um German. ’E stay fuh... near two year? Yes. ’E pretch da gospel ter we, ter da slave. ’E say Moses part da sea, lead um people.” Malachi made a motion with his hands like he was parting small waves between them. “’E do’um wi’da grace o’ da Lord. Magic, from God.”</p>\n\n<p>“You’re talking ’bout miracles?”</p>\n\n<p>Malachi nodded halfheartedly. “In a way. Buh sep’reh magic an’ <em>miracle,</em> ooh say magic bad, miracle good. Alltwo done fuh same. Good or bad, is all magic. Is all magic. Magic from God raise Christ, raise Lazarus, raise Samuel… Magic from God do so much, if ooh know God.”</p>\n\n<p>Lavinia was fascinated. Everything he said was heretical to what she had been taught since she was a child; however, she had just witnessed a summoning restore her father’s health and vigor. She had concrete proof of Malachi’s claims. He went on to explain how the tale of the Witch of Endor illustrates the necessity of wisdom in one’s approach to magic – otherwise, one drives out anyone who can help (witches and diviners), cannot find a solution from traditional outlets (dreams and prophets), and then seeks to resurrect a recently deceased prophet who did not wish to be woken (Samuel) only to be told bad news because all this time, one should have known better. Malachi emphasized that people who use magic unwisely are punished severely through their own recklessness, and are the reason there are warnings against divination in the Bible.</p>\n\n<p>Realizing she had ignored her father for some time, Lavinia turned around to see a fire in the hearth and Renard slumbering in the second chair. He was so peaceful she almost envied him. Still looking at her father, she relayed to Malachi the message given to her from the apparition; and when she turned back, Malachi was smiling.</p>\n\n<p>“Book of Enoch,” he told her. “Da bin Enoch, or Metatron. Da pretcha, um tell me. <em>You</em> ’ear um only.”</p>\n\n<p>This made sense. Lavinia remembered from Sunday school that the Witch of Endor could not hear Samuel. “Is the Pennsylvania Du… German preacha the one taught you magic?”</p>\n\n<p>Malachi nodded, this time much more firmly. “’E saw we suffah in da field. ’E heht Ovaseea Lawson, like me. Uh tell’um da story da Boo Hag. She steal yeh breath in yeh sleep, yeh skin if ooh struggle. Uh tell’um, say uh wish she steal um skin. Mehk’um stop hurt mine.”</p>\n\n<p>Overseer Lawson must have been horrible, indeed, to daunt this formidable man. But something bothered Lavinia: “You said this place was called ‘Kimball’?”</p>\n\n<p>“Das it. Kimball Long, on ’Ilton ’Ed.” <em>Hilton Head Island.</em> “Work for Massa Graves.”</p>\n\n<p>“But I thought you were from Lake Point, near us? With Mr. Abercrombie?”</p>\n\n<p>“Kimball b’fuh Lehk Pon’. Uh bin young a’ Kimball.”</p>\n\n<p>“You say that as though you’re an ol’ man!” Lavinia jested. “Hardly!”</p>\n\n<p>“Maybe no’ osside,” he replied, wistful. “Buh da pretcha, uh tell’um, say what uh say ’bout Ovaseea Lawson. ’E… ask me if true, uh tell’um, ‘Yes.’ ’E tell me if um he’p, uh kuh geh… geh ‘strung up.’ Uh tell’um, say uh dun kay if uh mehk um stop. ’E say, ‘Okay.’ Fuh two year, ’um show me da way o’ Moses. Affa two year, uh get a chance.” <em>I repeated to the preacher what I said about Overseer Lawson. He asked me if I was in earnest, and I told him, “Yes.” He told me that if he helped me, I could be hanged. I told him I didn’t care if I could make Overseer Lawson stop. The preacher said, “Okay,” and taught me the ways of Moses. After two years, I got my chance.</em></p>\n\n<p>“What happened?”</p>\n\n<p>“Dis girl, Patsy, we in da field. Massa Grave’ like’er…” He trailed off, as if hesitant to share this detail with a young woman like Lavinia. “’E visit Patsy a’night.”</p>\n\n<p>“Oh…” It was Lavinia’s turn to trail off now, in embarrassment more than anything.</p>\n\n<p>“Yes. Buh… Ovaseea Lawson like Patsy. She were swee’ girl. ’E heht ’er, an’e like’er. ’E heht we dark skin, but da buckrah no’ white white. I wuh tink um mudda or fadda like we, an’um heht dat part of um. In da aff’noon, now an’ den, ’e steal Patsy ’way.” <em>Overseer Lawson also liked Patsy. She was a sweet girl. He hated her, and he liked her. He hated our dark skin, but he wasn’t very light himself. I used to think his mother or father must have been like us, and he hated that part of himself. Every once in a while, in the afternoon, he’d steal Patsy away.</em></p>\n\n<p>“Good Lord. What did your masta think of him doing that? Did he care?”</p>\n\n<p>Malachi shrugged. “Dunno if’e know. Patsy respeck Massa Grave’, buh she <em>heht</em> Ovassea Lawson. She go’ wi’ chile, no’ know if Massa or Ovaseea da fadda. Massa Grave’… <em>assume</em> he da fadda, buh we know diff’ren. Chile come out… black as da night. She see um, she scream an’ die.”</p>\n\n<p>Lavinia sank back against the wall, the broom handle loose in her grip. She had not expected this turn of events. “I’m sorry.”</p>\n\n<p>“We tink dis mean um da son Ovaseea Lawson. Um dark, like me, um grow up in da field. Da ovaseea… ’urt um own son? Uh no leh dat ’app’n.” Malachi took a deep breath before continuing.</p>\n\n<p>“Da ree-chrool… diff’ren from dis. What uh do fuh yeh fadda, dat bring life. Dis… tehk ’way.”</p>\n\n<p>“You’re sayin’ you’ve performed magic to take someone’s life?” Lavinia asked with trepidation. “Doesn’t that kind of magic go against God?”</p>\n\n<p>Malachi threw a sardonic glance her way. “Da plague’ of Egypt, dey go agains’ God? Sometime is <em>necessary.</em> Buh dis ree-chrool… ya nee’ someone die <em>angry.</em> An’ Patsy were <em>angry</em>! Angry at da world. Uh gih’er revenge.”</p>\n\n<p>“Did you… summon her?”</p>\n\n<p>“Uh did. Were dang’russ, buh da pretcha, um guide me. Tehk dis ting, a… <em>ree-tor</em>? Strong iron, an’a… a spout, go down in a ‘flah-kohn.’ In da ‘ree-tor,’ we put da ‘green vih-chrool’ an’ we heat it up, hot hot. Da ‘oil of vih-chrool’ come down da spout, in da ‘flah-kohn,’ as we do da ree-chrool. Da oil, is vey vey dang’russ, muss no touch. We bey it in da field wey Patsy ress, an’ call’er for revenge.” <em>Take a strong iron retort, and have the neck lead into a flacon. Put the “green vitriol” in the retort, and heat it very hot. During the ritual, the “oil of vitriol” will flow down the neck of the retort into the flacon. The substance is extremely dangerous, you must not touch it. We buried the flacon in the field where Patsy was buried, and called her for her revenge.</em></p>\n\n<p>“We mehk lot of oil,” Malachi went on. “Nuff strength fuh kill Lawson. An’ she did.”</p>\n\n<p>Lavinia couldn’t move. “How… how did that enable her to <em>kill</em> a man?”</p>\n\n<p>Malachi merely shrugged. “Da oil let her steal um skin. ’E shrivel up, look like a mummy when she done!” He laughed quietly, but a fear entered his eyes that made him stop – as though he realized he shouldn’t be <em>that</em> morbid in the presence of a lady. “No ask how, uh dunno.”</p>\n\n<p>“Mr. Dead – um, Malachi – what you’re sayin’ is… you summoned a woman who died in the childbed, to kill the fatha of her chile, by shrivelin’ ’im up like Pharaoh?!”</p>\n\n<p>Malachi nodded, a gleeful smile spreading on his face. “Quite a sight!”</p>\n\n<p>“You… you watched it happen?”</p>\n\n<p>“Course! Me an’ pretcha, we nee’ see da ree-chrool work!” He said it as though she were crazy to even ask.</p>\n\n<p>Lavinia put her head in her hands, struggling to comprehend the tale. Deciding against it for the time being, she asked, “So after the ovaseea… shriveled up… what happened to you? What did Masta Graves do?”</p>\n\n<p>“’E bin terrified!” Malachi laughed in earnest now. “’E though’ we rise up! Massa Grave’ no tell da watch, fray dey burn Kimball to da <em>ground!</em> Buh Massa Ab-crumb, ’e impress’. ’E say ’e wan’ buy da man who do dis. A’firs’, we tink is a trap, but pretcha learn um serious. Pretcha let me take all da… da credit. ’E say uh learn ey’ting uh nee’. So uh tell Massa Ab-crumb, tell’um say were me who kill Lawson. Massa Ab-crumb say wan’ me work for um, in um house. No’ da field. So uh leff for Lehk Pon’. Work for Massa Ab-crumb till um die, den…”</p>\n\n<p>“Then you were free,” Lavinia finished. “But why live here, Malachi? So far from town? Is it because people are scared of you? How many people know what you can do?”</p>\n\n<p>“A few,” he admitted. “Buh… uh stay here for da quiet.” Then he changed the subject: “We shoo’ nyam.”</p>\n\n<p>“I’m sorry?”</p>\n\n<p>“Nyam!” he repeated, hoping she would understand. She didn’t, so he finally relented, “<em>Food. Dinner.</em>”</p>\n\n<p>“Oh, right, of course,” Lavinia agreed, suddenly starving – which made sense, as most of the day she had traveled with her father through swampland. Before Malachi moved to a cabinet that served for a larder, she called out, “Wait, I got one more question!”</p>\n\n<p>“Jus’ da one?” he teased, then laughed at her scowl. Finally, she asked, “Your name… Deadman… they don’t call you that ’cause you dig graves, do they?”</p>\n\n<p>His only reply was a mischievous grin.</p>\n\n<p>After gently waking Renard up, the tired trio partook in the simple fare of mutton and rutabaga roasted on sticks in the fireplace, like some kind of Civil War kebob. Malachi let Lavinia sleep on the cot, while he took a chair next to Renard – and she was grateful for the bed, even though it was a bit on the hard side; at least his pillow was soft. Before she closed her eyes, she watched slumber overtake the man who had saved her and her father. A real necromancer. The genuine article.</p>\n\n<p>Lavinia supposed she should be afraid of him. After all, if the story of Patsy and Overseer Lawson was true, then that meant he could summon the dead in order to kill. But she was not afraid. She witnessed the light from the flames dance across his skin, the color reminding her, strangely, of roasted pecans. The incongruous thought made her smile, and the image remained behind her lids when she finally fell asleep.</p>\n\n<p>No, she was not afraid at all. This ramshackle cabin, in the middle of the swamps of South Carolina, was the safest place in the world.</p>\n\n<hr/>\n\n<p>So, that’s the event that kicked off everything else. That’s how Malachi Deadman, former slave turned gravedigger – and also a practiced necromancer – befriended the Sutton family. Slave-owners themselves, so his charity toward them has always confused me (almost as though he knew what the ultimate outcome would be…). Not that they remained slave-owners for long: after the Civil War ended, the Sutton lands quickly moved from the traditional plantation model to a sharecropping system, facilitated by the fact that the lumber mill had remained intact (therefore still granting an income). Sutton Hall was rebuilt, the new incarnation smaller than the previous grandiose residence, though it still had a breathtaking view of the Wando River.</p>\n\n<p>As for the Suttons themselves… Renard revised his will to formally leave everything to his sole surviving child, Lavinia. Not that his possessions’ passage occurred soon after – the man lived to the ripe old age of ninety-five, long enough to witness the birth of his first great-grandchild, which bore his last name!</p>\n\n<p>Yes. About that. I’m sure discerning readers who were not already aware of the Sutton family legacy touted in the media still figured out fairly quickly that Lavinia married Malachi. The pecan line in the diary always makes me laugh (“food” ain’t necessarily my thing, but anyway). Many state anti-miscegenation laws were overturned during the Reconstruction, and rather remarkably South Carolina was among the participating states. Still others who left them on the books did nothing to enforce them. (It wasn’t until Jim Crow laws reared their ugly heads that anti-miscegenation became <em>en vogue</em> again.) So their union didn’t receive any pushback – not legally, anyway. Romantics would describe the tale as Malachi having swept Lavinia off her feet, Rhett Butler style. Cynics would argue that the Suttons felt indebted to him, and Malachi manipulated them to his advantage and climbed higher up the social ladder than most African Americans of the nineteenth century could even dream. Personally, I like to think the truth resides somewhere in between.</p>\n\n<p>I have a picture of them. I usually tuck it inside the front cover of the diary. It’s a daguerreotype, taken in their parlor in 1869, after reconstruction of Sutton Hall was completed and before the birth of my great-great-great-grandfather, Malcolm. Renard is in the picture, too, standing on the far right, left hand resting on his walking stick in a rather stately fashion, sandy hair appearing almost white with the exposure (it wasn’t actually white – I know this). On the left is my great-times-four granddaddy, Malachi Deadman Sutton. He has cleaned up well from his days living in the swamp, his hair neatly cropped, his mustache trimmed in a style somewhere between Natural and English. His dark topcoat and vest and buff trousers are impeccably tailored, and I notice a patterned ascot along with a chain on his vest from a pocket watch. He is posing in a classically nineteenth century fashion, with one arm in front of him and one arm behind. I showed this picture to a friend of mine once, and they told me he looked like “black Clark Gable.” At the time I agreed, chuckling a little at the similarity. But later I realized that Malachi actually lived in the time depicted in <em>Gone with the Wind,</em> so if anything, Clark Gable was white Malachi Deadman Sutton! Not that most people would care about my ancestry-bragging quibble.</p>\n\n<p>Then, of course, there is Lavinia Sutton. She stands between her husband and father, though turned more toward the former, her hands clasped demurely behind her back. Her face, on the other hand, is anything but demure: her eyes pierce the viewer with their determined intensity. They’re bright, gleaming – I think they’re aquamarine, like mine. Which would make sense, since I’m the spitting image of her, other than hair. The first time I beheld the picture I was blown away by the likeness. We have the same “heart-shaped” face, with wide cheekbones and a narrow chin. The same short Roman nose. Same uneven lips. I’m just a little darker than she was, more olive while she was fair. Oh, and my hair is auburn while she was a blonde. Like her father.</p>\n\n<p>Like my little brother. I Skyped with him a couple days ago. He’s seven now, and loves school. He speaks freely in both English and French, which I envy him. I miss him dearly, but know the arrangement is better for everyone this way. Maybe the memories will fade for him, to the extent that recalling what happened won’t cause him any pain. But I doubt it. That’s a foolish hope.</p>\n\n<p>My eyes return to the daguerreotype, to Lavinia’s dress. It was of a pale color and simple bustle design, but I once again notice the pleats in the bodice, designed to be let out as her body expanded with the pregnancy. I don’t think she’s even wearing a corset. This would have to have been before she gave birth to their only child, Malcolm. The diary recounts three miscarriages beforehand, and one after – infertility was a touchy subject for her, compounded by people in her social circle “suggesting” that maybe, just maybe, she shouldn’t be having Malachi’s child. I don’t know how she withstood the venom without turning everybody into toads. Or something. She certainly had the ability, given her husband’s training of her.</p>\n\n<p>You might ask how I seem to be able to infer so much about these people, beyond even what Lavinia wrote down. How I know Renard Sutton’s hair wasn’t actually white. That’s because I know these people personally. I have walked in their shoes. That account, up there? Where an angel came down to the ramshackle cabin near Little Hellhole Bay, South Carolina? I lived it.</p>\n\n<p>This is the part where I expect to be told I’m insane. This is what I’ve held back in my therapy sessions with Dr. Lippmann, who recommended I give some sort of testimony. I think she was thinking of me giving a prepared statement in front of a support group, but I prefer the security of writing everything down like this. Of not looking at my audience. I’d rather not be carted off to an asylum – but how else would most people respond to tales of ghosts, visions, or hoodoo rituals having demonstrable, and on the rare occasion fatal, results?</p>\n\n<p>I created a throwaway account just to write this all down, because I don’t want this connected with my regular account. Before I even started, I obtained permission from everyone involved who’s still alive. There was a media circus surrounding it for a while, but some of the names have been forgotten. Oddly enough, they all told me to go ahead. The police had trouble believing us, even with the support of evidence, but the truth needs to finally come out. Maybe then the ghosts can be laid to rest.</p>\n\n<p>Sitting here in my dorm room, in a brief respite from studying for finals or listening to my friends wig out over the new Childish Gambino single, I’m reminded of something my good friend Marie told me once, two years ago:</p>\n\n<p>“The thing about Southern Gothic, is that it’s <em>real</em>.”</p>\n</div>\n","author":"EvieSutton99"}