{"rank":"6","title":"The Wilderness of Dusios","id":"8khyzm","url":"/r/nosleep/comments/8khyzm/the_wilderness_of_dusios/","time":"1526692025000","body":"<div class=\"md\"><p>I was only a child when it happened. Roughly ten years old or so.</p>\n\n<p>My mother had decided to take us all on a walk through the forest. Ah, how I loved going into those woods.The peaceful atmosphere was truly something to behold. I loved hearing the sounds of the birds singing, arguing with each other. That was something I learned from a nature guide when I went on a field trip with my class. It was funny really. We listen to the birds&#39; songs and remark on how beautiful they are but really they&#39;re screaming at each other to make sure they know whose tree is whose.</p>\n\n<p>But I&#39;m getting sidetracked. Anywho, my mother decided to take the kids out for a walk. One of her friends had come over from the States, and she wanted to do something special with her. And the woods were excellent. A perfect choice, through and through.</p>\n\n<p>One reason I really enjoyed going to the woods was because I could pretend to be a dinosaur. That was always a lot of fun. This time I was going to pretend to be a Spinosaurus. So I broke off from the group as they wandered down the trail and went over this river nearby. It was a small one, not big enough to swim in or anything. Unless you were really ballsy. I imagined I was a massive beast, swiping at the water and pulling out giant fish while also hunting for any foolish herbivores that came to drink. There I was, back hunched and stalking along with my arms held close to my chest, snarling and growling. My mom always let me do this because she knew I would be back. This time, I had a plan in mind. To surprise them by lunging out. The younger kids were in the triple stroller, buckled up safe and snug. So I began racing forward, snarling and gnashing my teeth.</p>\n\n<p>I should let you understand the layout of this river. First off, the place in the trail I had branched off came upon a bend in the trail, which eventually lead to a bridge. The small river ran directly under the bridge, meaning that anyone traveling along the trail would have to go over it. I was sure that I would come out right on top of them...but when I did, no one was there.</p>\n\n<p>This was pretty odd. I was sure enough time had passed that they would be right in front of me, so I could ambush them...but they weren&#39;t.</p>\n\n<p>Confused, it took me just a moment to decide that they must be lagging behind, so I went back into the forest and lay in wait. They would probably see me coming as trying to hide in the undergrowth was extremely difficult. Then we would all be laughing and sniggering as I came charging at them, nibbling at my younger sister&#39;s necks as they squealed delightfully.</p>\n\n<p>But they didn&#39;t show up. I was waiting there for ages and ages, patiently wondering what was taking so long...but there was no sign of them. I couldn&#39;t hear my mother and her friend chatting with each other or my sister skipping along the path.</p>\n\n<p>Then I realized that I couldn&#39;t even hear the birds singing. I rubbed my ears first, thinking that there was something wrong with them, but still nothing. I looked around, but couldn&#39;t see any living creature around me. Not a squirrel or bird in sight. I could hear the river flowing gently, but that was it. Now that I thought about it, everything was quiet now. Very quiet. The trees had been gently swaying in the wind before but not anymore. They were completely still. When I walked over to one and ran my hand along its bark, I flinched back instantly. It was incredibly cold. Colder than any of the freezers I would parts of my body into on a date or do something like stay outside in the freezing snow in my underwear. God, I miss being ten years old.</p>\n\n<p>Now I was getting really freaked out. I started to back away from the trees, and called for my mom. But I heard nothing. Absolutely nothing. Shivering, I called for her again and again, saying how she was the best mother a person in the whole wide world. The tears began to run down my face softly as I began walking back down the trail to find her...but I didn&#39;t. There was no sign of them.</p>\n\n<p>I just kept walking, crying and screaming into the empty forest for my mother, my siblings, the friend. I gazed around at the vast expanse of green and planet life which threatened to completely envelope me. The trees seemed to be growing with every moment, and when I tripped, falling onto my hands, I cried out in pain. I had scrapped my knew and there was small black stones embedded in my palms, which I tried to brush away. It stung to do so. So I kept walking, screaming...and I saw it.</p>\n\n<p>It was a stone carving of a face, with a pair of curving horns on top. I wasn&#39;t stupid at all. My mother had read Narnia before bed. I loved hearing about Mister Thomas, and mom explained to me what a fawn was. What really struck me as odd was that I had never seen it before. Yeah, we all know how this scenario plays out in horror films. Thing is, my knowledge of horror films at the time basically amounted to &quot;they&#39;re scary and mom won&#39;t let me watch them.&quot;</p>\n\n<p>I was curious so I decided to investigate it. This carving was pretty old but also strangely beautiful. The faun was playing some kind of flute while sitting on a stool. Or something. I can&#39;t remember it too well. Yet the longer I stared at it the more off it felt. There was just something fundamentally...I don&#39;t even know what word to use to describe it. It was just really weird to look at. The eyes seemed to be engraved with some strange light that danced around and held my gaze while the fingers slowly moved up and down on the weird flute.</p>\n\n<p>As I kept watching, the carvings movements became more and more vivid. The faun was swaying ever so slowly from side to side, bobbing his head up and down in time with the music. With every graceful movement I felt my panic slowly fade away, replaced with utter tranquility. I don&#39;t know how long I stone transfixed by that image for, simply staring at it. It simply became more and more life-like, dancing and jumping about as it played the most mesmerising melody.</p>\n\n<p>Then I blinked, and the image was still once more.</p>\n\n<p>But I could still hear the music. </p>\n\n<p>Entranced, I followed the sounds of the flute deeper into the woods until I came to a clearing. Before me was a place of beauty unlike anything I had ever seen before. It was... completely amazing. Just wondering to behold. Everything looked so perfectly maintained, from the smallest flower to the oak trees which towered above me.</p>\n\n<p>And directly in the center, seated upon a gnarled tree stump, was a faun playing his flute.</p>\n\n<p>Tentatively, I crept towards him. He was a magnificent creature, with massive horns which portrayed backwards from his head and a pointed beard of black hair. His eyes were closed and he had his legs crossed together as he played, head leaning backwards as he softly played. His fingers moved deftly and with a precision I have never seen since. When I felt a twig snap under my foot, I froze, holding my breath in anticipation.</p>\n\n<p>The faun&#39;s eyes opened instantly, gazing into me as he stopped playing. He lowered the flute onto his lap, unfolding his legs and standing up from the stump. He tilted his head to the side as his face remained blank. And then he smiled softly.</p>\n\n<p>&quot;Did you enjoy the music?&quot; he said to me, walking across the open ground toward me.</p>\n\n<p>Dumbstruck, I could only nod my head. He chuckled.</p>\n\n<p>&quot;I do so enjoy an audience, especially when it is composed of children like yourself. Always such an air of wonder about you. Ah, how your tender young eyes sparkle. Would you like to hear more?&quot;</p>\n\n<p>For a moment, I thought about saying yes. The music was just so beautiful that I thought I could listen to it for ages. However, ever so faintly, I could swear I heard a woman - my mother - calling my name. I noticed the faun glance behind me at that moment, just briefly before his gaze met mine. Then my mind was made up.</p>\n\n<p>&quot;I want to find my mom.&quot;</p>\n\n<p>The faun exhaled sadly. &quot;Are you sure?&quot;</p>\n\n<p>I nodded my head.</p>\n\n<p>The faun moved his eyes up and down, scanning my body. Then he walked up beside me, placing his hand on my shoulder. &quot;Then let us find her then. But,&quot; he said quietly, bending down so his ear was right next to mine, &quot;if I help you find her, promise me something.&quot;</p>\n\n<p>&quot;What?&quot; I asked naively.</p>\n\n<p>The faun smiled as his hand rubbed my shoulder, thumb brushing against my bare neck. His eyes were a deep bronze color, full of some kind of energy which seemed ready to spring loose and consume me. &quot;A bride.&quot;</p>\n\n<p>This took me aback completely. I was just a ten year old kid who had only just started taking notice of the girls in my class. Me and the other boys did boy things like playing around with water balloons and rough housing. Some of said they had kissed a few girls here and there. But none of us had ever considered getting married at all. A few of the girls had made us play house with them but it wasn&#39;t anything serious.</p>\n\n<p>Without thinking, I said yes. And the faun grinned. &quot;Wonderful,&quot; he said, &quot;now let&#39;s go find your mother.&quot;</p>\n\n<p>He took my injured hand, and together we walked back through the woods. And as we did, I could faintly hear the sound of the birds returning. The trees began to move again, swaying gently. The faun&#39;s hand was slowly rubbing against my own, making me a bit squeamish. We talked for a few seconds, me explaining to him about my family&#39;s history and how my mother and father met. He didn&#39;t say much, but he did give me his name - well, as he put it, one of them. Dusios. He said he was old, very old. Yet all the while, as we kept walking, he would always just steal a glance at me, and the look in his eyes was...hungry. Very hungry.</p>\n\n<p>When we came back to the trail, I could hear my mother calling me, along with her friend and my siblings. Smiling, I was about to call back when Dusios put his hand over my mouth. &quot;Before you go, remember,&quot; he said softly into my ear, &quot;tell no one anything of this, and remember your promise to me. To Dusios.&quot; And with that, he kissed the top of my head, inhaling deeply, and disappeared back into the forest.</p>\n\n<p>I walked onto the trail and called to my mother. She had been so worried about me. Appearantly, I had been gone for over an hour, which seemed about right. I didn&#39;t tell her about Dusios or anything else, just explained I had gotten lost. We went straight back to the house after that where mom tended to my knee and hands.</p>\n\n<p>In the following years, life was good and J completely forgot about Dusios. Sometimes I could swear I heard the sound of a flute but I always thought it was just my imagination for a while. Except I started to notice that I only heard it whenever I was talking with a girl I liked. I found it weird for a while but gradually ignored it.</p>\n\n<p>And then I met Amber. She is the most wonderful woman I have ever met. Within a year we were married, and then within another year she gave birth to our daughter, Emily. She is the light of my life, full of energy and laughter. Everything was perfect.</p>\n\n<p>Until yesterday when Emily came into my study while I was working. &quot;Daddy,&quot; she said softly, &quot;I&#39;m getting married.&quot;</p>\n\n<p>Amused, I asked her was the lucky guy. I mean, this was just a game right?</p>\n\n<p>&quot;The man with the goat legs,&quot; she said, beaming, &quot;Dusios.&quot;</p>\n\n<p>When I heard that name, my blood turned cold. Everything came back in a flood. As I stared at my darling daughter, the soft tune of a flute wafted into my ears. Then Emily left, going upstairs to her room. Her face was still beaming with the widest smile.</p>\n\n<p>I immediately looked up that name, Dusios, looking through everything I could find. Dusios was a Celtic deity from Gaul, identifed with the Greek god Pan. God of fields, the wilderness, and sexuality.</p>\n\n<p>I ran up to my daughter&#39;s room, footsteps thundering, and when I entered I found Emily softly sleeping in bed, dressed in her white nightgown.</p>\n\n<p>Above her, taped to the wall, was a note, with a message written in bronze crayon.</p>\n\n<p><em>Pan est in sua sponsa.</em></p>\n\n<p>What have I done?</p>\n</div>\n","author":"SpaceGeneralAmerica"}