{"rank":"0","title":"These Lucid Dreams","id":"8ki1fb","url":"/r/nosleep/comments/8ki1fb/these_lucid_dreams/","time":"1526692749000","body":"<div class=\"md\"><p>I started having lucid dreams just a little bit ago.. maybe 2 weeks? But i&#39;m 15 years old about to turn 16 in June and these are honestly freaking me out. A lot. </p>\n\n<p>So, they have been occurring around 2:00 AM or before. I go to bed usually at 12:00 or 1:00 AM (Very bad sleeping schedule for a sophomore in high school, I know). These so called &quot;dreams&quot; begin as nothing scary really, just.. odd.</p>\n\n<p>On Monday, I had a freaky one. The &quot;dream&quot; began in my house. Oddly enough, it was pitch black. Like not middle of nighttime darkness, but like the color of your phone when it&#39;s turned off. COMPLETELY DARK. All of the sudden, I hear someone say &quot;Hey, I need you to come test these prototype rockets out.. i&#39;ll bring you to me.&quot; Right then and there I was then in a private science-lab-spaceship ready to jump out. This next part felt so real.</p>\n\n<p>I jump out while this mad scientist is instructing me on what to do with these rockets. They looked similar to those old grabber things with animal heads on them from the zoo, but just the handle and boosters on the bottom. He told me while i&#39;m falling through the sky to hold the booster button all the way down and go up right before I hit space. Right when I held those buttons down I was FLYING so fast  until next thing you know I couldn&#39;t breathe because of the lack of oxygen. He told me &quot;Just let go of the boosters now!&quot; I thought about not listening to him and just to go down with safety and &quot;float&quot; my way down but the booster setting was too high which caused me not to be able to. I saw the moon, and next thing you know - i&#39;m falling straight down into Earth.</p>\n\n<p>Before I hit the ground, (like all dreams seem to play out) I woke up with an adrenaline rush. This has never happened to me before, and I had the jitters. So I kind of brushed it off. Now, on Wednesday, I had a full on scary one.</p>\n\n<p>Now, i&#39;m afraid of demons. Movies and stuff that have demons in them like The Conjuring scare the absolute shit out of me. I still watch them anyways, just because they&#39;re so interesting. Besides that, this lucid dream started with me in my bed, just like the Mad Scientist one. It was pitch black again, but this time I heard whispering. A lot of whispering. From behind me, from the right, the left, under me, and in front of me.</p>\n\n<p>I did the little kid move by hiding under the covers not really knowing what to do. I then heard breathing from above my covers. The first instinct that came to me was to, as hard as I possibly could, jolt up very fast. I thought this would knock whoever or whatever was above me out cold. Until I noticed it was a demon, the scariest demon i&#39;ve ever seen actually. It looked at me with these sharp curved eyes, his pupils looked like snake eyes, they blinked like them too. He was draping this long black cape over me, and the smile he had. That image of his smile has been stuck in my damn head for this long. He proceeded to attack me, but then right when I heard his loud demonic scream I woke up.</p>\n\n<p>The first thing I noticed when I woke up is that I still heard whispering. I started to question myself in my head. &quot;Am I still sleeping?&quot; &quot;I thought I was attacked..&quot; These kinds of questions. I turned on my lamp, and everything stopped. Instantly. I was freaking out. It was 4:00 AM, I was so freaked out I couldn&#39;t go back to bed.</p>\n\n<p>I&#39;ve just been thinking about if those two dreams could be connected or if they mean something i&#39;m not too sure.. but when the demon one played into reality then I started to worry about my mental health. Am I okay? I really hope I don&#39;t have another one of these..</p>\n</div>\n","author":"Smuckyyy"}