{"rank":"18","title":"The Devil's Staircase","id":"8ki15z","url":"/r/nosleep/comments/8ki15z/the_devils_staircase/","time":"1526692671000","body":"<div class=\"md\"><p>To whom this may concern, my name is Jacob Lindell. I am 25 years old and I am afraid if I do not write this story down, then I will lose my sanity. An event has occurred that has scarred me for the rest of my days. I still have hellish nightmares about the event, and there is not a day that goes by where I do not think about it. Sometimes I hear scratching in these walls, as if there is something trying to snitch me. I hope it is my imagination. The event occurred over a month ago in the dead of winter. A dear friend of mine, Professor Raven, sent me a letter explaining his whereabouts. </p>\n\n<p>Professor Raven and I have been good friends ever since I attended Harvard University. On the first day of class, we made our acquaintance. We have been good friends since. Professor Raven has an odd aura around him though. His sleek, black and gray hair hangs down to his shoulders. He has a peppered goatee that he almost never shaves. His eyes are a piercing green, full of mystery and despair. You always saw him in a black, leather outfit. If you have ever seen a gunslinger, his outfit looked like that. He lost his wife just after they got married, which was a hard blow for him. He always enjoyed solitude. He loved to sit, cooped up in his office all day, writing and reading ancient books. Books of lore and legend. Professor Raven taught archeology. I, on the other hand, have short, brown hair. My eyes are a dark blue and I am clean-shaven. People often see me in a brown, leather jacket, with, of course, black checkered pants.  </p>\n\n<p>Two years before my graduation, Professor Raven disappeared for a while. He did not tell me of his whereabouts, nor did he teach our class. We had a substitute for the next two years. It frightened me of what had happened to him. Why would he not send me any letters? Was he dead? I was gravely worried for my dear professor; after all, he had acted weird the past months before he disappeared. He had been obsessed with one book that he bought in Arabia. It was a book that talked about curious spells and weird portals. There was this one spell in his book that he talked about a lot. He said it was a spell that could open a staircase to the underworld. </p>\n\n<p>A staircase that could lead to hell. </p>\n\n<p>I talked with Professor Raven a lot about this particular spell and staircase. I told him to leave it be, but he became obsessed with it. He would not stop thinking about it, and he would find ways to incorporate it in between his lectures.  </p>\n\n<p>Of course, everyone was pleased when I told him or her that I received the letter. </p>\n\n<p>The letter goes like this, </p>\n\n<p>“Dear Jacob, </p>\n\n<p>I am deeply sorry for my absence over the past two years. Please forgive me if you can. I am writing this letter to ask of you a favor. It is not for the lighthearted and weak. This favor is for the brave and daring. I need you to meet me in Arabia. As you know, I have been searching for a particular staircase that will lead to the underworld. I may seem insane, but I would like to meet the underworld and make a huge scientific discovery. Please visit if you can. </p>\n\n<p>Yours, Augustus Raven.” </p>\n\n<p>I sat in silence for a few minutes; reading the letter repeatedly and making sure, I was not hallucinating. Had Professor Raven really found the staircase to hell? If so, should I go to meet him in Arabia? I thought about all the dangers of going on this journey, and I decided to take the risk. I boarded a supplies ship headed to Arabia. It took us a few weeks to get there, but I managed. Professor Raven told me to meet him at the dock, and once I got there, he was smiling and waving. </p>\n\n<p>He greeted me with a firm handshake, but he did not look the same. His cheeks were hollowed in and had bags under his eyes. His hair was longer than usual and his outfit was untidy. To be honest, he looked dreadfully happy. </p>\n\n<p>“Jacob my boy! How are you?” He said. </p>\n\n<p>“Doing well sir, how about yourself?”  </p>\n\n<p>“I am as lean as a whippet!” Then, he started to chuckle. Professor Raven looked a bit thin too. It was as if he had not eaten in days.  </p>\n\n<p>“What have you been doing all these years? I have not seen you in forever.” I said. </p>\n\n<p>“I know, I know. It has been a long time, but this scientific discovery will be so great that the whole world will know!” He exclaimed. </p>\n\n<p>“Why do you say it will be great?” I inquired. </p>\n\n<p>“Let me show you.” He said. </p>\n\n<p>We walked off the dock and he showed me into his rental house. It was an old mansion, covered in a bit of moss and grass. The air was musty and stale as I walked inside. I was tempted to put a handkerchief up to my nose, but I thought it would be rude to do so. The walls were covered with peeling paint, and the tables were dusty and un-touched.  </p>\n\n<p>“Is this your home?” I asked politely. </p>\n\n<p>“Indeed it is, but I never use the downstairs. I am usually upstairs.” He said calmly, and with that, he led me up the staircase. </p>\n\n<p>There was a bathroom in the middle of the hall, which was neat and tidy. There was one more room just down the hall, and this was Professor Raven’s room. </p>\n\n<p>There was a single bed in the center of the room, and to the right of the bed, there was a large desk stacked with papers. These papers had weird sketches and drawings all over them. A lot of it seemed like witchcraft to me. Bookshelves surrounded the room. There were many books, including the one about the staircase. </p>\n\n<p>“So, have you really found the staircase?” I asked. </p>\n\n<p>“I have not seen it with my own eyes, but I indeed do know its whereabouts.” He said. </p>\n\n<p>“How does this not scare you? I am worried for you professor. I am worried for your sanity. Do you realize what is at stake here? You could be dragged into hell itself! For all I know, demons could be unleashed!” I finished. </p>\n\n<p>“You do not understand the brilliance of this discovery Jacob. This could change everything in the scientific field. You cannot back out on me now. You said you would come, and you did. I am going to hold you to it.” He said. </p>\n\n<p>I took a deep breath and sat down on the bed. For once in my life, I had thought about bowing out of this. I never thought that Professor Raven would be so serious about this. Had he actually gone insane over the years? I did not dare ask him if he planned to make me walk down the staircase with me.  </p>\n\n<p>“When are we going to investigate the staircase?” I asked finally. </p>\n\n<p>“Midnight. It is five in the afternoon right now, which means we will leave at 11. The spell requires to be said at the strike of 12.” He said. </p>\n\n<p>“Spell?” I said. </p>\n\n<p>“There is a spell that opens the staircase. I will say the spell, and if it is said correctly, the staircase will be opened.” He said. </p>\n\n<p>“Let us eat.” He said, then, from behind him, he pulled out a few loaves of bread and some cheese, and an 1890 red wine. </p>\n\n<p>“From Arabia?” I said, picking up the wine and food. </p>\n\n<p>“Indeed, there are many things you can find here. Why, you could find anything at all.” He said mysteriously. </p>\n\n<p>I looked at him curiously and we both ate our meal. We talked for a few hours. I told him that I graduated with excellence. I earned a degree in English and teaching; it had always been my dream to be an English teacher.  </p>\n\n<p>“Not an archeologist!” Professor Raven exclaimed. </p>\n\n<p>“I am afraid not. To be honest, I took your class so I could enjoy your company.” I said honestly. </p>\n\n<p>“Well, I do not mind. As long as were still friends at the end of this.” He said, then, he tried to smile, but failed. We both sat in silence for a while until the clock struck 11. He shot up and put on his coat. Then, he went over to one of his bookshelves and pulled a book out. </p>\n\n<p>I got up slowly and said, “So, it is time to go?” </p>\n\n<p>“Indeed, it is. I believe the location is a few miles from this house, but we should be there before midnight.” He said.  </p>\n\n<p>&quot;Sounds well.&quot; I said. </p>\n\n<p>We stepped out of the mansion. It was a warm night, even thought it was winter, but you must remember, this Arabia. Professor Raven lead the way with a map he had in his hand. He told me the whereabouts. It seemed that this unopened staircase was near a cave by the shore. </p>\n\n<p>They said this cave had been cursed by fellows who had attempted to open it before. I tried to reason with Professor Raven and tried to persuade him not to go, but he was relentless. </p>\n\n<p>He said that others died trying to get it open, which did not make me feel any better. </p>\n\n<p>It seemed like an eternity as we walked to the destination. We did not talk most of the time, but I could hear Professor Raven&#39;s breathing get faster as we neared our destination. He started to chatter about the staircase and its history. I tried to ignore my insane professor the best I could, but it was helpless.  </p>\n\n<p>Something must have driven him to this state. </p>\n\n<p>Maybe it was the staircase, but then again, I am only a man, not a psychic. </p>\n\n<p>Professor Raven started a jog when we were within view of the cave. I jogged with him and tried to stay at a steady pace.  </p>\n\n<p>Once we got to the mouth of the cave, I put my hands on my knees and breathed heavily. I looked over at Professor Raven and he was not breathing heavily at all. In fact, he looked like he was in a trance of some sort. His eyes were wide open, and his mouth was gaped open too. I took a glance at my watch and it read midnight.  </p>\n\n<p>Then, out of nowhere, a voice boomed. I did not realize it was Professor Raven until I saw him standing there with the book wide open. He was yelling words that were indescribable to the ear. Words of mystery. Words that echoed throughout the night. The sight covered my flesh in bumps. </p>\n\n<p>The spell ended just as the clock read one after midnight. </p>\n\n<p>Professor Raven slammed the book shut and took in deep breaths. Then, I could not believe my eyes from what I was seeing. </p>\n\n<p>The darkness of the cave seemed to glow a light orange. I could feel the heat from where I was standing. The orange got brighter until it died down into a low red. There was no more heat, and then suddenly, it got a bit cold. </p>\n\n<p>&quot;My God! What have you done?&quot; I exclaimed. </p>\n\n<p>&quot;We have just opened the staircase to hell.&quot; Professor Raven said, unusually calm. </p>\n\n<p>&quot;You really have gone insane.&quot; I muttered, backing away from the cave, but Professor Raven caught me by the arm with an iron grasp. </p>\n\n<p>&quot;You are coming with me.&quot; He growled with intensity. </p>\n\n<p>&quot;Never!&quot; I shouted, and then broke away from him. I tried to run, but he tripped me and pinned me to the ground. He hit me twice in the jaw and started to kick my side relentlessly. Then, he grabbed the back of my jacket and started to drag me towards the cave. I tried to break free, but this time, he did not have a weak grip. </p>\n\n<p>We kept getting closer. </p>\n\n<p>Closer. </p>\n\n<p>Closer. </p>\n\n<p>Then, Professor Raven stopped. I turned around and saw a feminine figure walking up the stairs. Her hair was jet black and it hung down to her waist. Her eyes were embers, and she had a wicked smile. </p>\n\n<p>&quot;We have been waiting Augustus Raven.&quot; She spoke soothingly. </p>\n\n<p>Professor Raven gazed, open mouthed and said, &quot;It is you.&quot; </p>\n\n<p>&quot;It is I.&quot; She said. </p>\n\n<p>&quot;You are the one I have seen in my dreams. The voice in my head these past two years.&quot; He breathed. </p>\n\n<p>&quot;It is I.&quot; She repeated. </p>\n\n<p>&quot;Mother.&quot; He said with tears in his eyes. He let go of me and he started to walk towards the figure he called Mother. </p>\n\n<p>I scooted away from the cave and watched, as my professor got closer to Mother. </p>\n\n<p>She opened her arms and they hugged. They started to kiss, and that is when the screaming started to arise. </p>\n\n<p>&quot;NO! NO!&quot; Professor Raven shrieked. </p>\n\n<p>Mother&#39;s smile widened and she started to drag him towards the staircase. </p>\n\n<p>I took a closer look at Professor Raven and saw that his face was missing. All there was left was raw flesh, blood, and two, green eyes poking out of their sockets. Mother had kissed him at first, but she was really eating him. </p>\n\n<p>&quot;Come with us Augustus Raven. We will be together forever.&quot; She whispered. </p>\n\n<p>&quot;NO! JACOB! PLEASE!&quot; He screamed. </p>\n\n<p>All I could do was sit and watch. I looked away as he disappeared down the staircase. I could hear ripping sounds and Professor Raven&#39;s screams echoing throughout the cave.  </p>\n\n<p>Then, the ground started to shake. I saw something black and wispy dart out of the cave, but it disappeared into the night. The staircase seemed to cave in, the red and orange light died, and then, everything went silent. The book was still on the ground, and I picked up. </p>\n\n<p>I got up, knees shaking and brow sweating and started to run back to the mansion with the book. I was hoping that I would not lose my way, and I did not. I got back to the mansion, bolted all the doors, and went up to his room. I sat down on the bed and tried to comprehend what I just saw. Was she a demon, or the devil in disguise? He called the figure Mother, which seemed odd because that was not his mother. I had met his mother before, and that was not her. </p>\n\n<p>I studied Professor Raven&#39;s writings and drawings. There were pictures of Mother that he had scribbled over his writing. It seemed like she had possessed him. I scanned through the book to find the word Mother scribbled everywhere. I did not know what to think. How had Mother possessed him before he opened the staircase? Unless he opened it many times before and has been trying to meet Mother. </p>\n\n<p>The thoughts focused on that one subject only. </p>\n\n<p>I saw a diary sitting on Professor Raven&#39;s desk. I scanned through it and saw journal entries from the past two years. It explained that he had opened the staircase many times before. In fact, so many times that demons welcomed him. He would stay in hell for a while, searching for Mother, but he could never find her. In his writings, he said that every single human was a demon. He said that we had a choice to become a demon or an angel. He said that we could all become the devil if wanted. I do not believe these words; Professor Raven was insane anyways. I cannot help but wonder though how Professor Raven managed to survive. He wanted to become a demon, and he wanted to spread the word. I was never going to let that happen. </p>\n\n<p>He said that the demons had made peace with him. I do not know how demons have mercy, but knowing Professor Raven, he could trick anyone. He explained that he had wanted to become a demon himself. So, over the past years, he had been trying to turn into a demon himself. I looked at all the books on his shelves and saw demonic symbols all over them. </p>\n\n<p>Professor Raven had been a devil worshipper the whole time. </p>\n\n<p>I took all the demonic things Professor Raven had and burned them outside. I started a huge bonfire and burned them all. The writings, books, sketches, everything. I could hear demonic screams as they all burned. I could hear Mother whispering, but I was able to block her out. I went back inside and let the fire rage outside.  </p>\n\n<p>It was all over. </p>\n\n<p>When I sat back down on Professor Raven&#39;s bed, I heard a voice in my head. </p>\n\n<p>&quot;Jacob.&quot; The voice said. It was Mother. </p>\n\n<p>&quot;No.&quot; I muttered. &quot;NO!&quot; </p>\n\n<p>&quot;Yes, it is me. Just like Augustus Raven, you will succumb to your true form.&quot; She whispered. </p>\n\n<p>&quot;You killed Professor Raven.&quot; I fumed. </p>\n\n<p>&quot;He was not strong enough, but you are. Please Jacob.&quot; She begged. </p>\n\n<p>&quot;Never in my life. Got to hell where you belong.&quot; I said. </p>\n\n<p>&quot;You will one day Jacob, and when that day comes, you will crawl to me. You will come to Mother.&quot; Then, the voice disappeared. </p>\n\n<p>I stayed where I was, and that is when I started to hear scratching in the walls.  </p>\n\n<p>The scratching has not ceased, nor has Mother. She is whispering through that staircase, begging me to open it again. Begging me to become the demon I was purposively destined to be. Begging me to become the demon we are all destined to be. </p>\n\n<p>I still refuse to do so. </p>\n\n<p>I am back in New York now, and I believe there is something wrong. </p>\n\n<p>I looked at my diary the other day and saw Mother scribbled all over the place. I ripped out those pages and burned them. I have begun to have constant thoughts about Mother and the staircase. I see her in my dreams, and I see a black, wispy figure watching me in the night. </p>\n\n<p>I am writing this in my office as I hear scratching and whispers. I keep thinking this is my imagination, but I know it is not. </p>\n\n<p>One day I am going to succumb. One day I am going to open that staircase again. </p>\n\n<p>It is only a matter of when. It is only a matter of when. It is only a matter of when. </p>\n\n<p>Mother, mother, mother  </p>\n\n<p>Mother. </p>\n</div>\n","author":"Dan100903"}