{"rank":"3260","title":"Growth","id":"8ki2sq","url":"/r/nosleep/comments/8ki2sq/growth/","time":"1526693198000","body":"<div class=\"md\"><p>Did you know that one in five pregnancies end in miscarriage?</p>\n\n<p>Some women are lucky. When they conceive, their child is born safe and sound. They grow up healthy and happy, they become doctors, lawyers, maybe even the president some day. Some women are not nearly as lucky, they lose a child the first or possibly even the second time, but then they have their lucky day and they’re blessed with an addition to their family.</p>\n\n<p>I’m neither of these women.</p>\n\n<p>I’d never been able to carry a pregnancy to term. Four times I’ve conceived. Four times I’ve miscarried.</p>\n\n<p>It’s never easy. I get my hopes up every time. I run to Mitchell with the pregnancy test, grinning and telling him that this is the time, this is the time our family will grow from two to three. The first time, my husband spun me around and kissed me several times on the cheek. He did that the second time too.</p>\n\n<p>The third time, he only smiled. The fourth time, the smile didn’t reach his eyes. I didn’t blame him. I couldn’t smile either. Even though hope was attempting to blossom in my heart, I knew I’d never get to hold the life growing in my womb.</p>\n\n<p>I threw myself into my garden to distract myself from my pain. Because of this, I have quite a beautiful garden. I grow vegetables of all sorts, carrots, potatoes, a few stalks of corn, I even grew pumpkins last year. When the harvest comes around, I store what I can and what I can’t I end up giving to my neighbors. The little kid next door took the pumpkin I gave them and carved it into the perfect Jack o’ Lantern. Well, mostly perfect, its smile was lopsided.</p>\n\n<p>A few months ago, I was in one of my gardening chatrooms when the subject of children came up. My heart ached as I brought up what me and my husband had gone through, and everyone was so comforting. One of the other women, her screen name was AbbyLovesApples, opened up about how she’d also had several miscarriages before she’d had her twins six years back. Twin girls, identical in every way. They were so cute I nearly cried. If only I’d had the desire to keep trying like Abby had.</p>\n\n<p>I nearly signed off when I got a private message from AbbyLovesApples.</p>\n\n<p>‘I can help you have a child. Let’s exchange email addresses, I can’t bare seeing you suffer any longer than you have to.’</p>\n\n<p>Of course, I assumed that she would bring up some sort of expensive medical treatment. Something that my husband and I couldn’t even dream of affording, not like he’d even want to try. He was already bringing up getting my tubes tied when our tax return came in.</p>\n\n<p>It wasn’t that at all.</p>\n\n<p>Abby sent me a long message about how she’d also given up hope about having children. How her husband had actually left her for another woman because she couldn’t give him children. She’d lost all hope and was two days away from jumping off a nearby bridge. She’d made plans, wrote out her will and was finishing up her suicide note when her elderly neighbor came to visit.</p>\n\n<p>That woman saved her life.</p>\n\n<p>The woman had brought her something to help her womb become as friendly as her garden. She’d given very specific instructions and Abby followed them to the letter. With luck and a random man she’d picked up off a dating website, Abby became pregnant and gave birth to Ivy and Iris.</p>\n\n<p>And Abby was willing to guide me through this process, with no payment necessary.</p>\n\n<p>I needed this. I knew Mitchell would never leave me, at least, I hoped he wouldn’t. But I had no other option if I wanted to give birth to my children.</p>\n\n<p>In a week I got a box in the mail. Abby’s instructions were simple but she insisted I had to follow them to the letter. If I didn’t, not only would I lose the baby, but I would risk my life as well. Thankfully, the instructions were simple. In the box was a bag of what I can describe as something like white sand. It was so fine but had a bizarre smell, almost like copper.</p>\n\n<p>I was to measure out a teaspoon of this stuff and mix it with a cup of water once a day, preferably around the same time, and drink it down. I know, it was stupid to drink something I got from a stranger on the internet, I was desperate. And Abby didn’t come off as a nutcase.</p>\n\n<p>It didn’t taste bad at least. It didn’t have much of a taste at all, just left my throat feeling rather grainy and uncomfortable.</p>\n\n<p>I was to do this until I became pregnant.</p>\n\n<p>It wasn’t hard to drag my husband into bed, I didn’t tell him what I was doing, but it wasn’t much of his business anyway.</p>\n\n<p>When I skipped a period, I knew I was pregnant. I’d stocked up on pregnancy tests beforehand and I took two to confirm. When my husband got home from work, I showed him the test with a hopeful smile.</p>\n\n<p>“Maybe this time, babe?”</p>\n\n<p>His smile didn’t have much hope, but he kissed my forehead. He knew I was happy. He didn’t know that this time I had a secret weapon.</p>\n\n<p>Now that I was confirmed to be pregnant, I had to up my dosage of the ‘sand’. Two teaspoons, one in the morning, one at night, taken with water. My husband caught me taking it at night once and asked what it was, I told him it was some prenatal vitamins that would help the baby. He didn’t say anything after that, just turned over in bed and turned out the light.</p>\n\n<p>His lack of excitement was a thorn in my side, but as weeks went by, I realized there truly was a spark of hope.</p>\n\n<p>Now, I had to be careful. Abby specified that I could not, under any circumstance, go to the doctor. Any ultrasounds might interfere with the powder’s effects and I’d have gone through all of this for nothing. I couldn’t take any other medication that helped with prenatal care. And it was recommended I didn’t tell anyone outside of my husband I was pregnant. Hide it for as long as I could.</p>\n\n<p>That last part made the most sense, if I ended up losing the child again I would’ve gotten up everyone’s hopes for nothing. I’d made that mistake twice before, I didn’t want to do it again.</p>\n\n<p>The pregnancy went smoothly at first, much to my surprise. I felt my stomach begin to swell, I started wearing baggier shirts just to be sure no one asked too many questions. My husband would carefully phrase questions about how my pregnancy was going, to see if I’d lost the baby yet and just hadn’t told him.</p>\n\n<p>I didn’t expect anything was wrong until I woke up and I was in the worst pain of my life.</p>\n\n<p>My tired brain initially thought I was on my period until I remembered I was pregnant.</p>\n\n<p>Then I realized I was losing the baby.</p>\n\n<p>I stumbled into the bathroom, shutting the door behind me and twisting the lock. My heart sunk. I was losing the baby again. I went over and over in my mind what’d I’d done wrong. Had I missed a dose? Had I accidentally taken too much or too little?</p>\n\n<p>I stumbled into the bathtub and laid down, digging my fingers into the sides and doing my best not to cry out as spasms of pain ripped through my body. I didn’t want to wake up my husband for some reason.</p>\n\n<p>I lost consciousness as I felt my child leave my body and when I came to again, blood and fluids were circling down the drain and there was my child.</p>\n\n<p>It was about the size of a potato, a lump of oval flesh that twitched and squirmed. Not comprehending what I was seeing, I picked it up, only to see that there was an eye staring back at me. An eye the color of mine.</p>\n\n<p>I dropped it back and bit the back of my hand to stop from screaming. It continued to squirm.</p>\n\n<p>It was alive. It was fucking alive.</p>\n\n<p>I stumbled out of the bathtub, wondering what the hell had happened to me, when I heard my cellphone start to buzz in the next room.</p>\n\n<p>Terrified my husband would wake up and see the… thing, in the bathtub, I hurried out and grabbed it before retreating to the bathroom. Thank god he slept through that.</p>\n\n<p>I answered it with a quiet hello.</p>\n\n<p>“Did you have your baby?”</p>\n\n<p>I didn’t recognize the voice, a calm, feminine voice with a southern drawl. But other than my husband, only one person knew I was pregnant.</p>\n\n<p>“Abby?” I asked.</p>\n\n<p>“Yeah, it’s me. Listen to me, did you have the baby?”</p>\n\n<p>I looked in the tub at the squirming lump of flesh. “… Yes. What… what is it, Abby? It doesn’t look like a-”</p>\n\n<p>“Listen to me, very carefully. This is the part where you have to be more careful than ever, but you also have to be quick. Pick up your baby. How many eyes are there?”</p>\n\n<p>Repulsion wracked my frame as I picked up my ‘baby’. I carefully turned it over in my hand a few times, shivering as I’d come across another eye. “… Three. Three eyes.”</p>\n\n<p>I heard Abby whistle. “Damn, that’s lucky. Congrats, you’re having triplets. Go to the kitchen, and find a sharp knife. Have you ever cut the eyes out of a potato before?”</p>\n\n<p>“… Yes.”</p>\n\n<p>“Same concept. Flesh is a little different to cut, but it’s doable with a sharp enough knife. After you’re done cutting out the eyes, plant them in a part of your garden that gives them plenty of space to grow. Keep the eyes close to each other though, they’d not like to be alone. The earth is the womb of the world, but it’s still lonely in the dirt. Hurry, you wait too long and the eyes will start to dry.”</p>\n\n<p>I nearly puked twice as I slowly cut apart the lump of flesh. It twitched and I swore I heard it make a sound like a cry, but Abby reassured me that was just me. I wouldn’t have made it through this without her.</p>\n\n<p>I planted my babies in the garden, in a plot I just hadn’t had time to plant anything in. I collapsed next to the dirt, the blood between my thighs starting to dry. “It’s… it’s all done, Abby. I did it,” I said, starting to feel tired.</p>\n\n<p>“Good. Get some good fertilizer, water them every day. Talk to them too. Your baby can hear your voice even when they’re like that… I’ll talk to you after you get some rest. Goodnight.”</p>\n\n<p>I was shaken awake next morning by my husband, who woke up to find blood all over the bathroom and the kitchen and nearly lost his shit. Not to mention the leftover flesh from the babies. I really hadn’t thought of taking care of it.</p>\n\n<p>He thought I’d finally lost it once I’d told him what happened. He threatened to dig up our babies to prove they were just figments of my imagination. That would have killed them. I couldn’t let him do that.</p>\n\n<p>I didn’t mean to hit him that hard with the frying pan, but perhaps it worked out for the best. I needed good fertilizer, after all.</p>\n\n<p>Abby moved in with me last week. She’s about ten years older than me, but we understand each other more than anyone else in the world. The twins are adorable, and very helpful. They love to sing to my garden, teaching their future sisters their favorite songs. Last night, we just finished painting the nursery. It was so much fun, Abby got paint on her nose and after I laughed she retaliated by dragging her paint covered hand over my cheek.</p>\n\n<p>We’ve finished right on time too. I can hear my babies start to cry at night, the earth around the place they were planted stirring and squirming. Any day now, they will be ready to be born.</p>\n\n<p>I can’t wait to be a mother.</p>\n</div>\n","author":"theoddcatlady"}