{"rank":"2","title":"I've sold my soul","id":"8ki3mg","url":"/r/nosleep/comments/8ki3mg/ive_sold_my_soul/","time":"1526693462000","body":"<div class=\"md\"><p>So I&#39;ve sold my soul to the devil. I&#39;m 49. Should have done this years ago! I feel younger, healthier more alive than ever before. But the main reason was to put these blinding migraine headaches behind me, and they seem to have gotten worse. Which almost makes me doubt the entire conversation took place, instead of just in my dream.</p>\n\n<p>Shadowy figure.\nA finger pricked.\nContract signed in blood.</p>\n\n<p>All within the confines of a dream so anyone would say of course it wasn&#39;t real! Nothing but a highly detailed nightmare. Yet in my waking life, my left index finger feels painful and throbbing. No puncture wound that I can see.</p>\n\n<p>A 25 year extension on my life was part of the deal, with only the minimum amount of aging. But extension...I realize now that I forgot to take into account my original death age, when I am supposed to die minus any 25 year extension. I can&#39;t die until that time is up, until the new clock stops ticking and the shadowy figure comes back to collect it&#39;s bounty. But when? Was I originally going to die 10 years from now? 20?  Or just minutes from now when I exit this building to be struck by a vehicle driving wrecklessly down the street?</p>\n\n<p>And what about injury? Something else I didn&#39;t take into consideration.\n &quot; Good health shall befall thee without influence of outside forces...&quot;\nI remember that line. It sounded reasonable to me in dream state but now I wonder what the hell does that actually even mean? Good health but what about major injury? Is that covered? Hell, I&#39;m thinking like a mad woman, I didn&#39;t purchase insurance! Ha! </p>\n\n<p>I remember that suicide is not an option, as if it ever would be. But these headaches! I need to get off my computer for a little while, the light is blinding me. Just step outside for a moment, get some fresh air.</p>\n\n<p>Will update later...\n5/15/18\n4pm</p>\n\n<p>I&#39;m laying here wide awake. It seems sleep will never come. And the only relief from this headache is sleep. The otc pain pills aren&#39;t working. Every light, every sound causes my head to throb. It&#39;s the dead of night. What will tomorrow bring? Sleep, please come. Going to try a sleeping pill.\n5/16/18\n320am</p>\n\n<p>I have this amazing energy now. It just thrums through my body like electricity. Thrums, that&#39;s a word isn&#39;t it. I&#39;m so silly. Last night was horrible, sleep never came for me. But now? Now I feel great! Other than the headache of course, always there. I called in to work today. I&#39;m going to spend the day walking on the river bank with my dogs. I may call in tomorrow too. Maybe I could get disability for these headaches! They certainly affect everything I do.\n5/17/18\n630am</p>\n\n<p>I still haven&#39;t slept. Still have my headaches. The energy, yes, the ENERGY is both fantastic and absolutely insane. It&#39;s like my brain is electrified, but at the same time I KNOW I need sleep. Laying in bed is not an option. My house has never been so clean!\n  It may be my imagination. Just over thinking perhaps? Due to sleep deprivation. My dogs don&#39;t seem to want to be around me. Normally when we walk along the river or go hiking they stay close to my side. But yesterday when I took them to the river the minute I unleashed them they both took off. I called and called but they never came back. They always come running to me when I call them. I ended up walking by myself, calling, whistling for them, then gave up and walked back to my truck. They were both laying down in the shade of the truck, waiting. But they didn&#39;t greet me with tails wagging as they normally do. So strange. Maybe it was just too hot for them to walk yesterday? \n5/18/18\n820pm</p>\n\n<p>I see the down-votes. I&#39;m disappointed but I&#39;m not sharing my story for that reason. I just want to know if anyone out there has gone through something like this? Of course I don&#39;t believe in the Devil or selling my soul or anything of the sort but something has legitimately changed in my life. Not just something, everything. And it all revolves around that stupid dream! How long can a person go without sleep before the body truly begins to suffer?</p>\n\n<p>My dogs. My sweet, beloved golden retrievers, happy go lucky and loyal to a fault. They want nothing to do with me anymore. It&#39;s not my imagination. Neither of them will snuggle with me. I so need a snuggle. Try to pull them close for a hug, they back away. Sophie actually whined as she pulled back from my arms, desperately wanting to get out of my grasp. Their eyes following me, my every movement, as if they feel I must be watched warily. Taking them outside for a walk? They don&#39;t even want me to touch them, much less put on the leashes and go for a walk. I feel my heart breaking. Even more, I feel my sanity beginning to shred, unraveling at the edges...\n5/19/18\n446am</p>\n</div>\n","author":"valeriestorm1234"}