{"rank":"144","title":"Never Sail the Open Ocean Alone","id":"8ki470","url":"/r/nosleep/comments/8ki470/never_sail_the_open_ocean_alone/","time":"1526693636000","body":"<div class=\"md\"><p>We all live with the expectation that everything will be okay. Nobody is immune to the concept. Every day, we drive in ridiculous hurdling pieces of metal reaching one hundred miles an hour, whistling and holding our breath past graveyards filled to the brim with souls who made one wrong turn to the left. We shoot smack into our veins and huff smoke into our lungs, laced with that same stupid understanding. It is like we have this innate aura of idiotic invincibility inborn and embedded into our genes. We just can&#39;t shake it. And you know what? I am the same way. One stupid choice led me to this path and to this story.</p>\n\n<p>As a child, I fell in love with the Ocean. My dad had an old single engine boat, <em>Blue Mystery</em>, and if we weren’t on the water every weekend, we were at home scrubbing off the barnacles, washing the deck, and keeping her primed. My siblings despised the old metal trap. It became a chore to them, simply something that needed to be taken care of before the morning cartoons. I was the middle child, anxious for a calling card of my own, and so I soaked in the bonding time fishing and other maritime activities brought my dad and me. When he passed away, I made a deal with myself. Someday, someway, when I was a grown up… I would make my triumphant return to the sea and make it my home.</p>\n\n<p>And so at ten years old, I set the wheels of my dream in motion. Those days, I saved money shoveling the snow from neighbors&#39; driveways. In the summer when I was fifteen, I picked up a job on a fishing charter boat in town. I did anything they would ask of me. Scrub the deck, haul in the day’s catch, cut up and filet the fish for the rich people who were too lazy to do it themselves. Not long after that, I was promoted to first mate after the old one went on a meth bender. That meant five days a week out on the water, with the sun soaking my back and nothing in the air but salt water and stale cigarettes from the customers clotting the open sea.</p>\n\n<p>But it wasn’t enough. Every night I came home to real world expectations of homework, girlfriends, and family obligations. They all became a bore, a chore of my own to pass the time until I was out fishing again. There was no point to any of it, nothing to gain and nothing to advance my dream. It was absolutely stifling. I had heard the term landlocked in a history class, and I couldn’t shake it from becoming a personal description of myself. I was trapped, surrounded by obstacles on top of a train headed for a stop that wasn’t mine. Puzo had it right all along. Every man has but one destiny. I thought about that line a lot.</p>\n\n<p>I kept up a façade I knew my mother would adore. What I lost in social graces, I made up for with good grades and hard work, and that landed me in a top state school shortly before my eighteenth birthday. Landlocked for another four years. I delivered pizza as much as I could, paying my bills and fueling my dreams on the drunk orders of frat boys and girls sometime before the crack of dawn every day. Call it luck, but my dad&#39;s social security checks over the years had become enough to cover my state college tuition. This money wasn&#39;t for that. This was for the boat.</p>\n\n<p>I bought her soon after my graduation, and she was christened <em>Blue Devil</em>, stenciled in fresh paint on a classic white backdrop. The name was as an homage to my old man, with a bit of my own immature collegiate twist. She was a lot bigger than Mystery ever was, and she cost a fortune. Maybe a little more than that. In fact, every penny I ever made, from that tender age of ten, went into improving <em>Devil</em>. First, I made her as unsinkable as possible by spending thousands on reinforcing the hull and adding bilge pumps to the front and back. Then I outfitted her with the amenities, including a finished cabin with a massive big screen TV, the latest in radar and fish finding technologies, a king-sized bed, desalination machine, air conditioning... the works.</p>\n\n<p>It took me a few years, but by my twenty-fourth birthday she was ready for her first big journey.</p>\n\n<p>There was two things that were certain - I wanted a paying gig and I did not want to deal with people. Those conflicting facts made my job search nearly impossible. It took an entire year of searching, scumming, and renting out <em>Devil</em> as a charter to make ends meet on her improvements before I found the perfect situation. The potential employer was responsible for maintaining sea marks, or buoys, along international shipping routes across the world. This particular job was regularly scheduled maintenance, every two years, on a particular shipping route in the North Atlantic Ocean. With the journey and the maintenance each job was expected to last six months for a minimum two-man crew.</p>\n\n<p><em>Two</em> man crew. I still remember the feeling of my heart in my stomach.</p>\n\n<p>But I went on the interview anyway.</p>\n\n<p>It was perfect, and I was perfect for it. I lied and said my second crew member was sick, but would be ready for the job when it came. The interview went so well that they never asked about him again. Besides, there was one other crew member. My ten year old German Shepherd, Sookie, loved being out on the ocean just as much as me. After a formal inspection of my boat, the interviewer gave me a low down of what to expect.</p>\n\n<p>The job would be paid in cash, and I should leave on the first of the month. I was given a map and GPS coordinates of the sea marks, and a set of standard instructions to check the battery and buoy itself. I signed whatever official legal documents they put in front of me without much of a glance. The former crew had retired at the ripe age of seventy, a point I stressed to my mother repeatedly over the phone. But they had used their own ship as well, so my insistence on using <em>Blue Devil</em> was met with warm regards and a bump in my pay. I left the following Monday.</p>\n\n<p>Never being one for goodbyes, I packed my stuff and had dinner at my mom&#39;s one last time before leaving. Chicken and pasta, a lifelong favorite. She begged me to be careful, not to go at all. But she had to have known it was pointless, that my mind had been made up years ago. Begrudgingly, she hugged me goodbye after forcing a promise to check in on the satellite phone each and every night.</p>\n\n<p>There was something about her sad smile that stuck with me that first day at sea. About the chicken and pasta, and the memories we had in that living room gathered around the television. Don&#39;t get me wrong, I hated myself for it. My dreams had come true, and there I was sniffling like a child at the site of our old jetty sinking into the distance. I think I should have listened to myself a little more in that moment, but I didn&#39;t. I pushed the reminiscence out of my mind with the help of a fresh beer and the wind whipping past my thinning hair.</p>\n\n<p>The first lesson learned on the open ocean was that it was important to stay in shallow water, or find a sandbar, to anchor for the night. Being a one man operation, it wasn&#39;t like I could turn over the keys to Sookie and ask her to keep course. My first sea mark was far off the coast, and in my stupidity it took me all of the first night to find a sandbar in such deep waters. My searchlight was big enough, but it was the only one in the visible distance. Other than providing a naturally spooky afterglow in the ink-black night, it did little to help the search. Sometime around five that morning, I got lucky with the radar and found a sandbar in my vicinity. I dropped the anchor and headed into the cabin to sleep just as dawn started to break through.</p>\n\n<p>The second lesson learned was that it was not easy to sleep on the open sea during the daytime, no matter how tired you might be. The sun has a way of peaking through the windows and forcing your eyelids to squint and flutter nervously. Sometime around ten, the sleeping pill kicked in. By four in the afternoon, I was awakened by the deep baritone of a ship horn.</p>\n\n<p>My first thought was that my anchor slipped and I was blocking a shipping lane. I muttered a few quick shits to myself as I threw on a shirt and stumbled up to the deck. My eyes squinted and my unchanged contacts balked at the gleam of the last few rays of sunlight disappearing beneath the horizon. When they readjusted, I chuckled to myself and dipped below beck to grab some nicer pants.</p>\n\n<p>It was a family on an old ship not too different from my own. They looked lost - a wife was seated on deck staring intently at the radar as the husband gestured frantically in my direction. Sookie was barking in the cabin and his engine was still running, so I motioned for him to cut it with a slitting motion to my neck. He gawked at me nervously for a minute before he caught my meaning and pulled his boat within shouting distance. Then he turned off the motor and stared.</p>\n\n<p><em>&quot;Did you catch the wrong exit?&quot;</em> I shouted through cupped hands, a nervous joke to cut the now profound silence.</p>\n\n<p>He didn&#39;t laugh. Just stared some more. After a minute, he cupped his hands and shouted back.</p>\n\n<p><em>&quot;We were attacked last night. Our radio is out and my daughter is sick. We&#39;re low on water. Can you help us?&quot;</em></p>\n\n<p>For the briefest of moments, I considered calmly pulling my anchor and hitting the gas for the coast right then. Maybe I should have, but I didn&#39;t.</p>\n\n<p><em>&quot;Attacked by what?&quot;</em> I yelled.</p>\n\n<p><em>&quot;We were able to radio for help before it was smashed. Sir, I... don&#39;t know how to say this.&quot;</em> His wife stood and gave him a sharp look before he continued. <em>&quot;I&#39;m not a killer. But I killed a man last night. I killed a man who came onto this ship in the middle of the night and tried to lie in bed with my daughter.&quot;</em></p>\n\n<p>It was my turn to stare. He saw this and shouted louder, sealing his hands around his deep red beard.</p>\n\n<p><em>&quot;I admit this willingly. We are all as shocked as you must feel right now. But I was defending my family, and I would do it again. We aren&#39;t armed, not anymore. You can check for that if you like. Everything we are telling you, we radioed into the police before the damn thing died. They asked us to wait at these coordinates and sit tight. So that&#39;s what we are going to do, whether you jet for the coast or not.&quot;</em></p>\n\n<p>I walked over to my radar, making no effort to hide the gun holster at my waist as I did. There was some nervous chatter, and the family&#39;s engine started up again. When I turned, the family had gone to hide in the cabin. Only the father remained on deck, cowering nervously behind a railing as he shouted <em>&quot;We mean you no trouble,&quot;</em> he shouted, somewhat meekly.</p>\n\n<p><em>&quot;And I won&#39;t give you any. I&#39;ll keep close until they get here. But lets keep at a distance for both our safety.&quot;</em> I hollered back.</p>\n\n<p>After confirming the coordinates for them, I tied a rope to a sturdy railing on my end of <em>Devil</em> before throwing it over to their ship, which was about fifteen feet away. He grabbed it graciously and did the same. When that was done, I threw over a few extra water bottles as a token of good will. I resolved that would be all the sleep I had for the night.</p>\n\n<p>I passed the next few hours by fishing, and keeping an eye on the distance between our two boats. I had tried my radio and satellite phone to confirm their story, but we must have been out of range. Neither was working.</p>\n\n<p>Nonetheless, the family was a nice one. The daughter seemed to be feeling better too, because she was on deck for a bit in the bear grip of her mother. Her name was Jasmine, I soon learned. The husband was Earl, the wife, Penny. The boat was named <em>Grand Pinnacle</em>, and it teetered as nervously as it&#39;s inhabitants in the light choppiness of the early evening. They were scared, and they should be. Nothing about that set off any alarms in my head.</p>\n\n<p>At one point in the night when the ladies were asleep below deck, I stole a stare at Earl and noticed that he had fallen asleep in his chair. I called over to him, trying to ease his distrust with a joke.</p>\n\n<p><em>&quot;You know, you could fall in that way!&quot;</em> I shouted.</p>\n\n<p>He snorted, and glanced up in bewilderment. I wondered when the last time was that he was able to get some sleep.</p>\n\n<p><em>&quot;I can keep an eye on things. Get yourself some rest.&quot;</em> I said it in the most reassuring tone I could muster for a murder mystery on the open seas. He sighed, glanced at his watch and stood up with a yawn. He took another long look at me, nervously, seeming to focus on my gun on my hip before he started for the short walk to to his cabin. <em>&quot;Have a good night,&quot;</em> was all he said.</p>\n\n<p>That line must not have gone over well with the Mrs, because in a few moments she was on the deck; eagle-eyed and ready for her watch. I watched shamelessly, even admired her from afar, because I was not the suspicious one at this point. Penny looked to be in her late thirties from what I could tell, with long, straight flowing blonde hair that cut off neatly above her waist. It followed her lazily in the wind as she glided across the deck of <em>Pinnacle</em> neurotically. She was thin - the type of women who looked to be losing weight just by worrying. She was also dressed inappropriately; a cream colored turtle neck stuck out through her life vest to match her tight black business pants. I joked to myself that at least there weren&#39;t heals involved.</p>\n\n<p>I must have dozed off at some point.</p>\n\n<p>When I woke up, it was to the sound of a few very low-toned growls from Sookie. I was groggy and dehydrated, so it took some time to rub the sleep out. When my eyes adjusted, they found Penny on the deck in her usual stance, gazing off starboard into the sea, fixated on some distant point. I thought it could be a whale, so I followed her gaze only to find nothing at all. It wasn&#39;t until a minute later that the source of my dog&#39;s growls were clear.</p>\n\n<p>As quietly as the night, a figure of a man was pushing it&#39;s way effortlessly through the waves towards <em>Grand Pinnacle</em>&#39;s starboard ladder.</p>\n\n<p>I stared at it dumbly while Sookie cried quietly behind me. It was too dark to tell, but at a distance he looked nothing more than a man going for a swim in the middle of the Atlantic.</p>\n\n<p>Once he reached the ladder, the Man hoisted himself up it with a soft plopping noise that seemed to do nothing to awaken Penny from her trance. When he reached the top of the ladder, the lazy beacon of the boat light finally found his figure in it&#39;s entirety.</p>\n\n<p>I wanted to yell to her, to warn her that someone was coming, but it all happened so quickly. The sounds of dripping water from it&#39;s soaked boots harmonized with the lapping of the water of the boat. It was so silent and innocent that I could barely tell the difference myself. The owner of the boots was a man, that was sure enough. But this man was covered in seaweed, and his skin sagged from his bones like waterlogged turkey. The seaweed meshed with his long, blackened hair and parted around only his eyes and mouth, making them look like distant lights on a dark sea. The nails were the toughest to comprehend. They were nearly as long as his legs. </p>\n\n<p>He walked haphazardly, dragging one foot quietly before the other. Except when he chose to move. In a flash of a sprint, he was across the deck, leaving a trail of sickly brown slime behind him.</p>\n\n<p>It was all so much to handle that I froze, fumbling for my gun like an asshole. In a matter of seconds, the man slid across the deck and pushed a freaking fingernail inches into poor Penny&#39;s spine.</p>\n\n<p>One thing was sure, the sound of her scream set the night on fire. I heard Earl shout out to his wife from bed. There was a whimper and the horrified cries of Jasmine from below deck. Thinking of the child, I found myself and pulled the gun from it&#39;s holster, firing at the Man uselessly as he darted across the deck towards the cabin of <em>Pinnacle</em>. My bullets popped into the water like darts, fucking up some poor fish&#39;s day but doing nothing to save the family that had put their faith in the hands of a useless twenty-something coward in way over his head. The Man looked at me for a moment, tilting his head inquisitively from a distance. And then he smiled. A smile with teeth so white they would make any dentist blush.</p>\n\n<p>Earl popped open the door just in time for all ten of the Man&#39;s nails to puncture his ample belly. There were no sounds, at least none that I could hear from the distance. When he fell to the floor, both of them turned and looked at me. It was the most bizarre thing of it all. They looked at me, from fifteen feet away. The Man&#39;s eyes were empty, black in the middle and as white as those teeth were on the outside. But Earl&#39;s baby blues were accusing. Even his pudgy, over-shaped chin seemed to be blaming me for it, accusing me, the Good Samaritan of this whole fucked up thing. I knew it then, immediately I knew that Earl held me accountable in his final moments, not the Man. And it stopped me from firing my weapon.</p>\n\n<p>Earl looked as if he were about to yell, to hurl an accusation; but the Man twisted his knife and blood gurgled from his gaping lips. He slumped forward, fell on his face, and was dead. Earl&#39;s blood pooled neatly around his body, mixing in with the slime to form a disgusting brown liquid on the deck.</p>\n\n<p>I fired once more, recovering my confidence, and this bullet glanced off the ceiling of <em>Pinnacle</em>&#39;s cabin. The man gave me another long stare, tilting his head back and forth like a fucking jackrabbit. There was no sense to it, it did not seem physically possible. But his neck twisted back and forth like a video stuck on loop, and all the while those eyes glared into my own. Finally his neck stopped, and pulled his knife from Earl dramatically, as if it were such a bother to do so. And then he spoke, in a voice so loud and powerful that it seemed to shake even <em>Blue Devil</em>.</p>\n\n<p><strong>&quot;No, no, no,&quot;</strong> was all it said.</p>\n\n<p>The man stared at me some more as he slowly turned the door of the cabin and walked inside. I was left with nothing but the vision of a trail of seaweed and bodies on deck.</p>\n\n<p>I was paralyzed again, but this time for good reason. Jasmine was in that cabin, and it was boarded shut with no way to look in. My bullets could hit Jasmine or whatever the fuck this thing was. I didn&#39;t know what to do, so I stood there stupidly, reloading my weapon like a coward and waiting for what felt like an hour before I decided it was time to cut and run.</p>\n\n<p>I ran up to my control panel and pulled up the anchor quietly, keeping an eye on the cabin door with my pistol ready. When it was done I jumped up to the wheel and punched the gas, forgetting about one vital piece - the rope.</p>\n\n<p>When <em>Blue Devil</em>&#39;s engine roared into action, <em>Pinnacle</em> lurched forward dramatically in response. I cursed and ran for the rope without even stopping the motor, and hacked away with at it with my fishing knife angrily. It wasn&#39;t getting through, and I cursed myself for spending more on knives than ropes right around the time the Man exited the cabin.</p>\n\n<p>This time, I did not wait. I unloaded an entire round of my pistol into his best aimed vicinity. Two of them caught him - I know that much because his body jerked back in an insulted reproach. He started to advance towards the ladder, annoyed but unaffected, and that was when finally the rope holding our boats together snapped with awesome timing. I ran back towards the wheel as <em>Devil</em>, free at last, raced forward recklessly.</p>\n\n<p>As I was adjusting the ship&#39;s direction towards the coast, I looked back and saw the figure standing still on the deck, watching me. <em>Pinnacle</em> had lurched dramatically in the other direction once freed from the rope, and without a crew to correct her; the cheap, over-weighted top drifted too far to the left and was in danger of capsizing.</p>\n\n<p>The Man, the lone survivor on deck, adjusted to this change lazily. He fought it at first, surprised at his supposed defeat, then held onto the railing that slipped into the dark sea with the rest of <em>Pinnacle</em>&#39;s deck. Even as he was out of sight, I heard that voice rattle through the night one more time.</p>\n\n<p><strong>Take me home,&quot;</strong> it said. <strong>&quot;I want to go home.&quot;</strong></p>\n\n<p>Once sure there was enough distance between <em>Devil</em> and <em>Pinnacle</em>&#39;s burial ground, I surveyed the damage for the two day journey home. The radio was still broken, the satellite phone was missing, and I managed to shoot my own desalination machine. But that wasn&#39;t the worst of it.</p>\n\n<p>My water bottles were gone.</p>\n</div>\n","author":"FirstBreath1"}