{"rank":"8","title":"Something's In The Walls - Part 2","id":"8ki9vv","url":"/r/nosleep/comments/8ki9vv/somethings_in_the_walls_part_2/","time":"1526695450000","body":"<div class=\"md\"><p>I didn&#39;t go to the police. I told myself that it would just get blamed on me, and I couldn&#39;t find out what happened in prison. I needed to know what was in the walls. I eventually unbarricaded the bathroom, and again found myself with a feeling of darkness. Something no one should feel, almost a hollowness inside my chest. It happened whenever I approached the bathroom door, and after about a half hour of talking myself out of a panic attack I finally got the bathroom door open. </p>\n\n<p>It was gone. All the blood, the tufts of hair and some questionable chunks in the bathtub were all gone. It was cleaner than even before, all the tile sparkled with a brilliant white I had never witnessed since when Simon and I first got the apartment. </p>\n\n<p>The hole in the wall was the same, a gaping emptiness with seemingly no hint to what was inside. I dared to creep a bit closer, moving much like a cautious mouse. There wasn&#39;t even any pieces or fallout of wall, as if the hole had merely grown by itself. It was a pitch blackness inside, and as I knelt a bit to peer inside I couldn&#39;t even see the back. </p>\n\n<p>A sound like small feet running along the tile floor sounded from behind me, making me release a frightened squeak as I leap into the tub with faster skills that I believed possible. I barely caught sight of the creature, it moved in a blur. It was small and round, about the size of a full grown Chihuahua. Although I distinctly noticed what looked like spikes coming from the thing, spikes that rubbed roughly against the wall skimming the top of the hole. </p>\n\n<p>I shudder, now deathly afraid to leave the tub.  I stare at the hole intensely, not allowing myself to even blink. There was no more movement, and as I contemplated my next move I heard the sound of the buzzer from the living room. I jump, starting at the open door debating on the risk. Finally I take off running, my bare feet slapping the tile floor and it&#39;s not until I reach the front door I realize I had been squealing the whole way. </p>\n\n<p>Again I collect myself before clicking the buzzer button and holding it in.</p>\n\n<p>&quot;Y-Yes? Who is it?&quot; I stutter, eyeing the bathroom as I do. </p>\n\n<p>&quot;It&#39;s your mother, let me up. I need to talk to you.&quot; Is the reply, and for once I was ecstatic to hear my mom&#39;s voice. I quickly press the buzzer once, and buzz her up. In the wait for her to take the elevator up I quickly race across the kitchen and close the bathroom door just as my mother strides through the front.</p>\n\n<p>I freeze with my hand still on the knob as if I had done something wrong, a look of guilt etched across my features. She studies me and then the bathroom, staying silent for a few seconds.</p>\n\n<p>&quot;Your... man-friend is in there?&quot; She asks rather awkwardly, because of course she never did call Simon by his name. </p>\n\n<p>I mutely nod, he technically was. She seems a bit relieved, and I assume she simply doesn&#39;t want to have to face him. </p>\n\n<p>&quot;What did you need to talk about?&quot; I ask as casually as I can, now leaning my back against the door with both hands on the knob behind me. </p>\n\n<p>She seems to contemplate what to say, staring somewhere over my left shoulder.</p>\n\n<p>&quot;It&#39;s about your twenty-first birthday. A lot of responsibility comes with being twenty-one. I wanted-&quot; </p>\n\n<p>&quot;Listen Mom, I get it. Drink responibily and all that. Now really isn&#39;t a good time.&quot; I interrupted her, earning a familiar sharp look in result. </p>\n\n<p>&quot;Deidra, don&#39;t interrupt. It&#39;s rude.&quot; She starts, but I zone out when I begin to notice a strange sound from behind me. A scratching sound, starting soft and tentative before picking up in volume and pace. Something was scratching at the door. </p>\n\n<p>I must be looking all sorts of horrified because my mom stops in whatever she was saying.  She stares from the bathroom door to me, then back again. The scratching filled the room, and my mom seemed to shrink into herself and physically staggered back.</p>\n\n<p>I start to think of some excuse, but she is quickly moving to sit down at the now crooked table. </p>\n\n<p>&quot;They&#39;ve come already then. Have you seen them yet? It doesn&#39;t matter. This is what I came to speak to you about. They come to every female member of our family. It&#39;s a curse, yet a blessing. It is now your responsibility to take care of them, and keep them fed. They won&#39;t harm you, but anyone else if fair game to them.&quot; She starts off voice strong, but it was barely a whisper at the end. </p>\n\n<p>I stare at her, realizing instantly she was telling the truth. My mom never lies, she doesn&#39;t have the time. </p>\n\n<p>&quot;What are they? Where does the blessing part come in?&quot; I ask softly, realizing the scratching had stopped.</p>\n\n<p>&quot;Why, they&#39;re Brownies dear. The blessing is while they&#39;re in your care they grant you the gift of immortality. Or at least until you have a daughter that turns twenty-one, then they pass down to her and you become perceptible to death once again.&quot; Her voice quivers at her last sentence, a look of fear in her eyes. Well well, my mom wasn&#39;t totally fear proof. </p>\n\n<p>Of course she would be frightened of the one thing that was inevitable. Unless...</p>\n\n<p>&quot;So what if I don&#39;t have kids?&quot; I ask slowly, gazing at the bathroom door in a completely different way than I had been moments ago.</p>\n\n<p>&quot;Then they stay with you until you do, and you won&#39;t die. Not of disease, accidents, or even old age. You&#39;ll age of course, but slowly. Trust me when I say it&#39;s not something you want. I thought the same, until it began to wear on me. All the death and gore, having to lure someone to the room every time they were hungry only to hear silence. They have quills with some type of venom, completely paralyzes the victim until death.&quot; She explains, yet I&#39;m now thinking and barely listening. </p>\n\n<p>Immortality. I had the fountain of youth in my bathroom, and all I had to do was allow someone to use my bathroom. </p>\n\n<p>... </p>\n\n<p>Needless to say I fed them again that night. I even went out and got a lock for the outside of the bathroom door, not only to make sure they stay out of the rest of the house but to keep the food inside.</p>\n\n<p>They even clean up after themselves, always keeping the bathroom sparkling clean. I only saw a bit of them again that night when I fed them, as I peeked though the keyhole. On closer inspection I realized they had humanoid arms and legs, but I never got a look of their faces. They were covered in pitch black quills that looked razor sharp, obscuring most of their body from view. They almost reminded me of a sea urchin mixed with a porcupine.</p>\n\n<p>They get hungry often, and as the days pass it was easier and easier to choose the victims. People that wouldn&#39;t be missed, anyone from clubs I could lure home with empty promises of sex. For some reason the disappearences never appeared on TV, and no one came asking questions.</p>\n\n<p>I even eventually had the bathroom remodeled, enlarging it and making the hole hidden by a new cupboard. It was rough work, I had to keep rehiring workers.</p>\n\n<p>I wouldn&#39;t ever forget the first person I willingly handed over to them.</p>\n\n<p>My mom didn&#39;t feel a thing. </p>\n\n<p>...</p>\n\n<p>Say, you want to come to a party at my house? I just had a Jacuzzi installed in the bathroom. You&#39;ll love it.</p>\n</div>\n","author":"AnnabeeBuzz"}