{"rank":"2","title":"\"Snow White! Snow White!\"","id":"8kif5f","url":"/r/nosleep/comments/8kif5f/snow_white_snow_white/","time":"1526697072000","body":"<div class=\"md\"><p>It happened every single night for 3 weeks. I would be sitting on the sofa watching TV, then I&#39;d hear him scream &quot;Snow White! Snow White!&quot;. I&#39;d then run to his room to see him sobbing while pointing to an empty corner of the room. I would tell him that he was imagining things, he&#39;d argue with me, I&#39;d tell him to go to sleep. He&#39;d grab my leg and say &quot;Please don&#39;t leave! Please!&quot;. I&#39;d pry him off my leg and put back in bed. He&#39;d come to where I was watching TV and whine about what he&#39;d saw. I&#39;d strictly tell him to go to bed, and he&#39;d  obey with some hesititation. I got really tired of this fast. I finally decided to get to the bottom of this.</p>\n\n<p>3 days ago, I sat with my son on the sofa and asked him &quot;Peter, who is this &#39;Snow White&#39;? Is she the one from the Disney movie?&quot; &quot;No, she&#39;s not.&quot; he responded. &quot;The Disney one is nice, this one is very mean and scary.&quot; &quot;Do you think it&#39;s a person?&quot; &quot;No, it&#39;s a ghost or witch or something.&quot; &quot;What does she look like?&quot; &quot;I don&#39;t think it&#39;s a girl, but I&#39;m not very sure.&quot; &quot;What do you mean?&quot; &quot;Well, it looks like a girl, but it sounds like a boy.&quot; &quot;That&#39;s interesting, but what does it look like?&quot; &quot;It has white hair, white skin, a white dress, white shoes and white eyes.&quot; &quot;Do you think it could be your imagination?&quot; &quot;No, I think it&#39;s really there when I see it.&quot; &quot;How do you know it&#39;s name is Snow White?&quot; &quot;It told me when I first saw it.&quot; &quot;Ok, this is good to know. Thanks for telling me.&quot; As I got up and walked away, Peter stopped and said &quot;Do you think you can bring Mom back to life so she can protect me?&quot; I responded with a tear in my eye, &quot;Peter, Mom won&#39;t be coming back. She&#39;s gone.&quot;</p>\n\n<p>My wife died shortly before this whole ordeal got started. We were supposed to have a fun vacation to Florida. We were walking on the beach when my wife found an apple on the ground. She took it to our hotel,washed it and took a bite out of it. For 10 minutes after, she complained about a sore throat. I went down stairs to get ice for our cooler to come back to find her laying down motionlessly on the ground. I picked her up, grabbed my son and drove to the neerest hospital. The doctors said she was dead upon arrival. I just happened to bring the apple with me so they could look at it to see if it was the cause.  They said it was a Manchineel apple, and it was definately the cause. Me and my son were devastated. All we wanted was to have a nice vacation as a family, but turned into a trajedy very suddenly.</p>\n\n<p>2 nights ago, Peter started complaining about Snow White again. I began to think that my wife&#39;s death my have been the cause of this whole thing. So yesterday, I decided to take my son to a child psychologist. We waited in the waiting room for an hour, but Peter wasn&#39;t bored because he was watching some cartoons on a TV. When it was finally our turn, I explained everything to the Psychologist. He said that what Peter is seeing is most likely a hallucination and my wife&#39;s death was most likely the cause. He decided to come to our house to make Peter feel calm in his room and show him that there&#39;s nothing there.</p>\n\n<p>When he got to the house, he went my son&#39;s room and told me to wait in the family room. I rested for 5 minutes. I was awoken by a loud thump and the sound of Peter screaming. I ran to his room as fast as I could. I slammed open the door to se a horrifying sight. The Psychologist was laying on the ground with the back of his head splattered all over the floor! It was a horrifying abstract of purid reds, blacks and yellows. I slowly approached his body. He suddenly jerked towards me and grabbed my pants. He was still alive! All that came out of his mouth was mindless gibberish while his brain matter began dripping out of his head and onto the ground and my shoes.</p>\n\n<p>I was already numb with fear. I then realized something that only built up the already overflowing fear inside me: Peter was nowhere to be seen! &quot;Peter! Where are you?&quot; No response. &quot;Peter, what did you do to the Psychologist? Peter! Stop hiding! This isn&#39;t funny!&quot; I then heard him sobbing under his bed. I looked down there and asked what&#39;s wrong. He pointed behide me and said &quot;Snow White.&quot; I turned around and saw it! Peter was telling the truth. It then lunged at me, everything suddenly went black.</p>\n\n<p>I woke up this morning. The Psychologist&#39;s body was still there, except it was now covered in flies and maggots. On the wall, written in blood was &quot;Peter&#39;s mine. I can&#39;t live without him.&quot; I looked all over the house, Peter was nowhere to be seen. I even contacted the police, they are still looking for clues. As a father, I know that Peter is still alive some where. If you have any idea where Peter might be, please let me know.</p>\n</div>\n","author":"Angelfishfan"}