{"rank":"0","title":"Pirate Party","id":"8kihud","url":"/r/nosleep/comments/8kihud/pirate_party/","time":"1526697921000","body":"<div class=\"md\"><p>    I don’t celebrate my birthday, anymore. Not because I feel like I’m too old and have grown out of it, or anything. But because the last one I had a party for. . . I almost didn’t survive. </p>\n\n<p>    </p>\n\n<p>I was eleven. Just old enough to know exactly what I wanted but not nearly old enough to know. . . ha ha. . . exactly what I wanted! Like I said: I was eleven; and my birthday was only two days away. I had been planning for weeks how I wanted my birthday to go!</p>\n\n<p>I was really into pirates that year. Why? I’m not exactly sure. The idea of independence and just living among the waves, in search of buried and sunken treasure thrilled me! Having a subordinate crew beneath me. . . was always. . . I don’t know. I always appreciated a chain of command; be it in the military, movies about gangs, and especially pirates! Pirates had their own laws. Had their own plans. Let nobody tell them what to do. </p>\n\n<p>Maybe that was the reason I liked them so much. </p>\n\n<p>You see? I was a push-around kid. At school, I took so much crap off from EVERYBODY. There wasn’t any difference between the students and the faculty, either. </p>\n\n<p>    I tried to tell my parents about it, time and time again. But among their work schedules and. . . whatever it was grown ups did back then. . . wine parties, maybe? They were away from the house all the time. But they left me in good hands. My big brother. He didn’t ignore me. But we were in two completely different schools, so he couldn’t help me when I needed, either. He just dropped me off in the morning and picked me up in the afternoon.  When we got home, though, it was always about me; I mean, after homework. </p>\n\n<p>I do not miss homework.</p>\n\n<p>    So, two days before my birthday party, my big bro asks,</p>\n\n<p>“Did mom and dad ever order your party stuff?”</p>\n\n<p>I shrugged. He had a look of confusion on his face,</p>\n\n<p>“Come on, dude. How can you not know?!”</p>\n\n<p>I looked at him and said the first thing that came to mind,</p>\n\n<p>“I haven’t seen either one of them in, like, a week. I doubt they even know my birthday is coming up!”</p>\n\n<p>He leaned in, lightly punching my arm,</p>\n\n<p>“Don’t say that.” he laughed, “OK. I’ll find out. What did you want? Pirates?”</p>\n\n<p>I stared with half-shut eyes at my brother, in half disbelief and half non belief that he couldn’t remember. Then I looked around my room. He followed to notice all the pirate “memorabilia” covering my walls. With the exception of my calendar, which had birthday reminders, all within a foot and a half of it; marking the day when I would finally be. . . twelve!</p>\n\n<p>“Got it.” he chuckled, removing himself from my bed.</p>\n\n<p>“I got it.” he repeated leaving the room completely.</p>\n\n<p>The phone was just inside the kitchen, which was just outside my room. I heard the receiver lift, followed by the singular speed dial button being pressed. . . I listened,</p>\n\n<p>“Hi, is Pat around?”</p>\n\n<p>. . . </p>\n\n<p>“Yeah. It’s her son.”</p>\n\n<p>. . . </p>\n\n<p>he sighed, “yeah. The oldest one.”</p>\n\n<p>. . . </p>\n\n<p>. . . </p>\n\n<p>. . .</p>\n\n<p>“Hey! Mom!” he became aware of his volume; lowering his voice, “. . . hey. . . did you get Bruce’s party scheduled? . . .”</p>\n\n<p>. . . . . .</p>\n\n<p>“. . . you’re kidding, right?. . .”</p>\n\n<p>. . . </p>\n\n<p>“. . . seriously?. . . how could you forget your son’s birthday is this week?. . . </p>\n\n<p>. . . . . .</p>\n\n<p>“. . . no, mom. . . it’s fine. . .”</p>\n\n<p>. . . </p>\n\n<p>“. . . ok. . . yeah. I’ll call dad. . . maybe he was more helpful than you are. . .”</p>\n\n<p>. . .</p>\n\n<p>He hung up the phone with a bit of agitation.</p>\n\n<p>He dialed the next speed call button.</p>\n\n<p>He followed with a sequence of button mashing. Dad worked in an office, so he had an extension line. </p>\n\n<p>. . . </p>\n\n<p>“Yeah! Dad!”</p>\n\n<p>. . .</p>\n\n<p>“Dad. . . it’s me. . . who else would call you ‘Dad’?”</p>\n\n<p>. . . </p>\n\n<p>“. . . yeah. . . not funny. . .” he started talking quietly again. </p>\n\n<p>Almost like he knew my parents were failures.</p>\n\n<p>Thinking back on it, maybe I should be more respectful.</p>\n\n<p>“ . . . hey. . . you ever order Bruce’s party stuff? . . .”</p>\n\n<p>. . .</p>\n\n<p>“. . . no. . . Dad. . . you’re just as useless as mom. . .”</p>\n\n<p>SLAM! He threw the phone down, harder this time.</p>\n\n<p>“Bruce?” he called from down the hall.</p>\n\n<p>I waited a few moments, then stepped out, </p>\n\n<p>“Yeah?” I tried to say without letting my chin quiver too much.</p>\n\n<p>“Hey!” he seemed super excited, “Hey! Mom and Dad ordered it about a week and a half ago! They just need me to call and confirm it!”</p>\n\n<p>I smiled. I knew he was lying. I heard everything he said prior to hanging up the phone. So. . . I smiled.</p>\n\n<p>I headed back toward mom and dad’s room,</p>\n\n<p>“Hey,” he called from behind me, “Where ya goin’?”</p>\n\n<p>“Um. . .” I thought real quick, “. . . I gotta pee!”</p>\n\n<p>I looked back at him and he nodded, turning back to the phone.</p>\n\n<p>I rushed to their room, closed the door, slowly; and picked up their phone. Just in time, too:</p>\n\n<p>“Th-th-th-thanks for c-c-calling ‘Party People’s’: where our d-d-d-dr-dream is to m-make yours c-c-c-come t-t-true!” the voice was of a teen about my bro’s age.</p>\n\n<p>“What w-w-wish c-c-c-can I gr-gr-g. . .” he sighed, and tried again.</p>\n\n<p>“Wh-what wish c-c-can I grant y-y-you today?”</p>\n\n<p>“Tom?!” my brother recognized the voice. . . or maybe the stutter. “You work at Party People?”</p>\n\n<p>The voice laughed, with heavy anxiety, </p>\n\n<p>“Y-y-y-yeah! M-my folks o-o-o-own it. Who-who-o is this?”</p>\n\n<p>“Hey, man! It’s Sonny! From school!”</p>\n\n<p>“Oh-Oh, y-y-yeah! H-hey, dude! What’s up?”</p>\n\n<p>“Hey, my little bro is turning twelve in couple days. And my retarded parents forgot to set something up. Do y’all have pirate stuff?”</p>\n\n<p>I could hear the roomy echo in the phone. I wondered if he could hear it too. If so, he never said anything.</p>\n\n<p>The voice hummed, </p>\n\n<p>“P-p-pirates?”</p>\n\n<p>My brother repeated, </p>\n\n<p>“Yeah. ‘Pirates’.”</p>\n\n<p>“W-w-w-we have J-Johnny Depp stuff.”</p>\n\n<p>“Nah-ha-ha!” Sonny laughed sarcastically, “Wait. . . Really?”</p>\n\n<p>“Y-yeah! Just like. . . w-wait-wait. No. Ju-just a c-c-c-cardb-board c-c-cut out.”</p>\n\n<p>. . .</p>\n\n<p>“Y-yeah! We-we-we ha-ave p-p-pirates! Do you w-want just cha-cha-characters, c-c-cake, or th-th-the c-c-combo?”</p>\n\n<p>“Send all ya got!”</p>\n\n<p>“O-O-OK! How-how will y-y-you be p-paying for this to-to-to-today?”</p>\n\n<p>“Credit card.”</p>\n\n<p>I sneaked out of the room while he was reading the card number off to the the guy. </p>\n\n<p>I was so happy! But I had to contain it from fear that my brother would know that I knew! </p>\n\n<p>The next two days dragged by.</p>\n\n<p>But when my birthday came, I couldn’t have been more excited! My mom and dad were both there. I know, that doesn’t sound like something I should HAVE to say. They tried, that day, too. Mom made me a cake and Dad was blowing up balloons. They didn’t float. Maybe I was just ungrateful. Maybe they deserved it. But, at least they did try. Because it was my birthday…? ...because they didn’t have to work…? Maybe both. </p>\n\n<p>Sonny kept staring at the clock. My parents didn’t seem to notice too much, but I did. It was 11:05 when the doorbell rang. The “friends” that were going to come had already made it about an hour earlier. There weren’t many. So their parents stuck around for the entertainment to arrive. And at 11:05, they arrived. </p>\n\n<p>Dressed in gnarly pirate costumes, it was a group of five. The Captain strode in, first. Swinging his throat-cut over the heads of the parents. Then laying it over his shoulder, marching, eyeballing my guests. Next were the first mate and two buccaneers waving and popping off the plastic bang guns, kicking their knees high in the air. Finally, and for some reason, there was. . . a mermaid. Decked out from her shimmering tail, to the seashell bikini. But, she was no Little Mermaid. She was just as dirty and rank as the pirates! Still, true to character, she squirmed on her hands through the doorway. The pirates “yo-hoed,” and “arr-harred” all the way through the living room,</p>\n\n<p>“Where be the salty birthday dog?!” The Captain growled.</p>\n\n<p>He pulled out his pop gun, shiny as a real one, and spun in place. The room shuddered with solitary giggles from parents. The children were a little frightened, myself, included. Which is why I was slightly apprehensive when they called for me. </p>\n\n<p>“Arrgh!” claimed the First Mate, “When the Captain asks ee question, he deserves an answer!”</p>\n\n<p>The parents still laughed. Mine shoved me to the Captain.</p>\n\n<p>“Ah!” he gleamed, “Ye be the scoundrel! What’s the matter? Catfish got yer tongue?”</p>\n\n<p>The mood was...heavy. These guys were really into their roles. Then, the Mermaid approached me. She started to sing,</p>\n\n<p>“Happy Birthday, to you</p>\n\n<p>Happy Birthday, to you</p>\n\n<p>Happy Birthday, ye scallywag”</p>\n\n<p>CLICK! I heard the front door lock. One of the pirates twisted the deadbolt…</p>\n\n<p>Odd, I thought…</p>\n\n<p>“Happy Birthday, to. . .”</p>\n\n<p>BANG!</p>\n\n<p>I fell. My chest felt like it was collapsing. I heard screaming and watched through fuzzy eyes as the other kids scrambled. The parents didn’t move much. Until the Mermaid drew a small knife from her waist and stabbed one of them in the throat!</p>\n\n<p>BANG! BANG! CHING! POW!</p>\n\n<p>Flashes and cries surrounded me as I faded.</p>\n\n<p>I woke up several days later in the hospital. I could hardly breathe. And my chest remained heavy. Nobody was around, until the nurse came in. She called for the doctor as soon as she realized was awake. I couldn’t speak. I could hardly hear. </p>\n\n<p>I wasn’t cognitive enough to make anything out. I stayed groggy, and unable to be awake too long. It wasn’t until I was able to get out of bed that anyone explained what happened. And why nobody was there with me.</p>\n\n<p>“Do you remember what happened, son?” the doctor stood at my side, not looking up from his clipboard but every so often.</p>\n\n<p>I shook my head. After trying to speak; but words hurt.</p>\n\n<p>He put his board down and with a sigh, began:</p>\n\n<p>“A few weeks ago, at your home, you were shot by an escaped convict. Your mother, your father and brother, along with a few more of your house guests sustained gunshot and knife wounds. Three of your friends did not survive. Only one of their fathers walked out of the house, with little to no injuries. He was an off-duty police officer. Fortunately, they carry their weapons all the time. But two children, not including yourself, are stable. Only three adults survived. Sadly, your mother, your father, or your brother, did not. I’m sorry, son.”</p>\n\n<p>I shut down. And fell back out of consciousness. </p>\n\n<p>From the day I left the hospital, I was placed in a foster home. A lot of the time, it felt like my real home. . . Always being ignored and forgotten. Unless somebody needed to blame me for something. Then, I was the center of attention. I only missed my brother. He was the only variable between that life and this one.</p>\n\n<p>I never spoke to anyone about why I was put in that place. </p>\n\n<p>Those “pirates” were all escapees from the state prison which was located just one county over. Serendipitously, for them, the Party People’s van was heading to my house as they met the road. They were all killed by the cop at my party. It wasn’t until they were dead could he get back to his car and radio for help. </p>\n\n<p>Well. . . I’m 20, now. I don’t celebrate my birthday, anymore. Usually, I just take the pills and sleep it away. I hope after every dose that it will be my last. Then, maybe, I can celebrate my birthday with my brother. But. . . As the years pass. . . I’m beginning to think the doctor is giving me placebos. I just go to sleep. I. . . just. . . don’t want to wake up, anymore! Maybe this dose will do it. . . </p>\n\n<p>Happy Birthday, Dear Scallywag. . . Happy Birthday. . .</p>\n</div>\n","author":"JGWillikers"}