{"rank":"0","title":"Happy birthday?","id":"8kintd","url":"/r/nosleep/comments/8kintd/happy_birthday/","time":"1526699800000","body":"<div class=\"md\"><p>They say that there are plenty of fish in the sea. But then they also say that no two people are the same, and that everyone is special and unique. That&#39;s exactly how I felt about my wife. She was perfect. WE were perfect. We had had a happy and stable relationship for three years. But in this harsh, cold world that we call home, nothing good ever lasts, does it? Here&#39;s how my chilling story goes...</p>\n\n<p>She was actually pregnant at the time of the incident. I felt i was ready to become a father, and had been anticipating our child&#39;s birth for months. The night the incident took place was on our anniversary. I had booked us in at a really nice restaurant. It&#39;s the same one we&#39;d been going to for our past anniversaries, so it had almost become tradition at that point. I left our house early that morning in secret. I had found the perfect anniversary gift for her, but I had to pick it up and the store was a three hour drive there and a three hour drive back. But i didn&#39;t care. The gift was perfect.</p>\n\n<p>I still sent her a message once I&#39;d left the house. I told her I had to pick something up and that I&#39;d meet her at the restaurant for dinner later that night. Once I had picked up the gift, I drove back to the restaurant. I thought she&#39;d be waiting for me there, but it turns out that I had somehow arrived before her. I waited for about half an hour. She still hadn&#39;t arrived though. I decided to message her asking where she was. She replied back saying: &#39;I&#39;m home sweetie&#39;. </p>\n\n<p>I was quite confused by this statement. I had told her that same morning to meet me as the restaurant by this time. I messaged back asking when she&#39;d be leaving. She read the message, but she didn&#39;t reply. So I assumed she had just left the house. </p>\n\n<p>Another fifteen minutes passed by, and I was still sitting alone at my table. I tried calling her, but there was no answer. I messaged her asking where she was. She replied once again with: &#39;I&#39;m home sweetie&#39;. I was starting to get chills running down my spine. Something didn&#39;t feel right. &#39;What are you still doing at home?&#39; I asked. She still just replied with &#39;I&#39;m home sweetie&#39;. </p>\n\n<p>I didn&#39;t even bother replying. I jumped in my car and drove straight home. Something was very wrong about the whole situation. I was worried. I didn&#39;t know how else to feel about this. I arrived home and ran to the front door. It was already open. My wife&#39;s car wasn&#39;t in the drive way either. I headed inside, but just before i entered, I received a message. It was from my wife again. It read: &#39;Welcome home sweetie&#39;. </p>\n\n<p>What I found inside of my house will haunt me forever. There were decorations all around the dining room. The table was set up nicely as well. There was a very beautiful spread on the table. There was a massive sign that read &#39;happy anniversary&#39; hanging on the wall above the table. There was even a card on the table, with a bow wrapped around it. However, there was just one thing missing from this nightmare disguised as a dream. My wife. Stacey. Her phone lay on the table, but she wasn&#39;t there. She wasn&#39;t anywhere in the house either. I called the police, but they found no trace of her. None at all. They still haven&#39;t found her to this very day.</p>\n\n<p>What haunts me the most about this is the illogicality of it all. It just doesn&#39;t make any sense to me, how she could&#39;ve messaged me as I arrived at the house. It&#39;s almost as though she had completely disappeared from existence. And the card that was left on the table. The message left on it is what really haunts me the most. I had to force myself to open it a few weeks after she disappeared. The curiosity had broken me by that point. I couldn&#39;t handle the suspense of not knowing what was inside. So I opened it. I wish I hadn&#39;t. There was a single question inside. It asked: </p>\n\n<p>&#39;Are you still ready to become a father?&#39;</p>\n\n<p>It&#39;s been a few months since all of this happened. It was actually my birthday yesterday, from the time of writing this, that is. I&#39;ve been feeling too depressed to care about anything lately, and my birthday was no different. I did receive one present though. It&#39;s a package that&#39;s quite big and relatively heavy. It didn&#39;t say who from. But I haven&#39;t opened it. I&#39;m not sure if I will. I&#39;m not sure if I should...</p>\n\n<p>It&#39;s still crying. It&#39;s still yearning out for me. But I&#39;ve been ignoring it for the time being. </p>\n\n<p>Am I really ready to become a father?</p>\n</div>\n","author":"_Illegal_Carrot_"}