{"rank":"4","title":"Has anyone heard of a demon that breathes smoke? [Part 4] Finale","id":"8kipcw","url":"/r/nosleep/comments/8kipcw/has_anyone_heard_of_a_demon_that_breathes_smoke/","time":"1526700330000","body":"<div class=\"md\"><p><a href=\"https://www.reddit.com/r/nosleep/comments/8jr4bs/has_anyone_heard_of_a_demon_that_breathes_smoke/\" rel=\"nofollow\">Part 1</a></p>\n\n<p><a href=\"https://www.reddit.com/r/nosleep/comments/8k0fh8/has_anyone_heard_of_a_demon_that_breathes_smoke/\" rel=\"nofollow\">Part 2</a></p>\n\n<p><a href=\"https://www.reddit.com/r/nosleep/comments/8k9our/has_anyone_heard_of_a_demon_that_breathes_smoke/\" rel=\"nofollow\">Part 3</a></p>\n\n<hr/>\n\n<p>This is Tom.</p>\n\n<p>Fuck all of you guys. I didn’t read any of that bullshit my mom wrote about my piece of shit brother, but fuck all of you for encouraging her. He deserves to die. He deserves to rot in prison, but if that’s not possible he deserves to rot in the fucking mental hospital they put him in.</p>\n\n<p>Mia is dead. That piece of shit murdered her when she was five years old. I decided to leave straight from the wedding for the farmhouse so we could spend all day Sunday with Luke. Mia didn’t even change out of her flower girl dress. Before we left I saw I had missed calls from Luke but he didn’t answer when I tried to call back, so we said good-bye to Nicole and left. </p>\n\n<p>It was past midnight by the time we arrived. Mia had slept on the drive but woke up when I parked in front of the house, so I told her to go wait for me inside while I unloaded our bags since it was so cold. She let the door slam behind her, like she always did at home. </p>\n\n<p>I gathered all our things and I had carried them onto the porch steps when I heard her running from inside. I thought she was just excited to be in a new place.</p>\n\n<p>Then I opened the door. I heard her small voice say, “Uncle Luke.” I saw my baby girl fall on the ground with a knife lodged in her beautiful face. My brother stood over her, staring with his mouth hanging open. The police asked me a million times, so I’ll say it again here: There was no one else there. Just my murderer brother. No, there wasn’t a “demon in a red robe.” And no, I didn’t smell any fucking smoke. My brother murdered my daughter.</p>\n\n<p>He screamed, “Get the fuck away from her!” at nobody, and charged at Mia’s body.</p>\n\n<p>I felt nothing; I just moved. I grabbed the first thing I saw, Luke’s power drill, and hit him in the head with it before he could touch her again. Then I carried Mia out to the car and drove my daughter to the hospital as fast as I could. I don’t know how I made it there; I was sobbing the whole time and I couldn’t bring myself to look at her slumped in the passenger seat. I held her hand, but she didn’t grasp back and she just kept getting colder.</p>\n\n<p>It was too late. She was pronounced dead-on-arrival after I staggered into the emergency room with her. I had to call my wife and tell her that our beautiful daughter was dead. And I burned with shame when I told her my own fucking brother murdered her.</p>\n\n<p>They found Luke in the woods that morning covered in blood. Mostly his own because the fucking coward had slashed his wrists. The hospital was able to save his worthless life, but not Mia’s. She would be turning 16 next month, and I’ll never know what she’d look like or sound like or what she likes to do or who her friends are. I’ll never set a curfew or ground her or awkwardly meet a boyfriend or girlfriend or whoever.</p>\n\n<p>Luke was found not competent to stand trial. He supposedly couldn’t remember anything about the murder, just kept talking about some monster in a red robe following him and drinking blood from a bowl. They said he was delusional and psychotic. He was sentenced to a mental ward indefinitely and he was there for almost 10 years.</p>\n\n<p>Maybe that fucking weed he was smoking was laced, I don’t know. All I know is he murdered my baby girl and I will NEVER forgive him for that. Every counselor I’ve seen tells me to forgive him. Fuck that. Forgiving someone means accepting what they did and why they did it. I can’t accept a goddamn thing about this. She was my only child. They day she was born was the happiest day of my life, and Luke destroyed that. The reasons why make no difference to me. My baby girl is dead.</p>\n\n<p>As for my mom, she’s dead to me now too. I tried to tolerate her. I changed the subject or hung up the phone or left the room whenever she tried to talk about Luke around me. But I’m fucking done. He murdered her granddaughter, but she still tries to defend him. I think she believes the bullshit he told his doctors and the court about a demon. She still visits him every week. I see her once a month at best. Well, not anymore. I’m done.</p>\n\n<p>But you assholes want to know what happened to Luke next, don’t you? Mom told me Luke’s doctor wanted to go to where our grandparents’ farmhouse was before he fucking burned it down. Mom never sold the land. Luke was convinced that this thing would make him kill every 10 years, I guess because he reread that fucking confession he wrote that my mom shared with you all. They thought taking him there on the 10th anniversary of Mia’s murder (or “the tragedy” as those fuckers will only call it) would give him closure when nothing bad happened.</p>\n\n<p>Anyway, some doctor took him out there yesterday, and guess what headline I saw today? “Mental patient murders therapist, escapes.” Yeah. He smashed a doctor’s head in with a rock, escaped from the orderlies, and disappeared, 10 years to the day from when he murdered Mia. There’s a manhunt and the last I heard was that they still haven’t found him, but I’m not looking for updates. Hopefully he’ll finish what he started last time and just kill himself.</p>\n\n<p>Serves that doctor fucking right though, thinking he deserves closure. What the hell closure have I gotten? What closure is even possible when you lose your child? Good riddance to the people who defend child-murderers.</p>\n\n<p>I hope my brother rots in hell.</p>\n\n<p>I love you forever, Mia.</p>\n\n<p>*</p>\n</div>\n","author":"miasdaddy2003"}