{"rank":"8","title":"The Most Beautiful Smile I Had Ever Seen","id":"8kiru6","url":"/r/nosleep/comments/8kiru6/the_most_beautiful_smile_i_had_ever_seen/","time":"1526701164000","body":"<div class=\"md\"><p>Tonight I have had the best and last date of my life. Here’s what happened.</p>\n\n<p>Her name was Emilia. She was in my government class and I had the feeling that she didn’t like me much. It was nearing the end of the semester and we were all just waiting for graduation but our teacher insisted on us doing a project in class. He split us into groups of seven and I ended up with Emilia and some of her friends. I was surprised after the first day that we ended up agreeing on a lot of the issues, also I was able to make her laugh a few times. </p>\n\n<p>The next day I couldn’t help but look at her every time she laughed or smile. I thought to myself.</p>\n\n<p>“She has the most beautiful smile I’ve ever seen.” </p>\n\n<p>Then I noticed she was looking right back at me and I heard a little voice in my head. </p>\n\n<p>“I can hear you. Thank you” </p>\n\n<p>I immediately looked away and tried to stop thinking about her but that little voice continued.</p>\n\n<p>“It’s okay. You’ll understand soon.” </p>\n\n<p>I avoided looking at her and tried to rejoin in the discussion. It worked and I thought I was saved by the bell, I was wrong. Again that voice seeped in.</p>\n\n<p>“Meet me in the hall.”</p>\n\n<p>I was skeptical but also very curious so I hung around in the hallway outside the room and tried to not notice her when she walked up.  </p>\n\n<p>“Are you doing anything right now?”</p>\n\n<p>My plan earlier that day was to go home and take a nap. But now I was really interested. She was the one talking to me on my head. </p>\n\n<p>“No. I was just going to go home and chill.”</p>\n\n<p>She look relieved... and also kind of excited. </p>\n\n<p>“You want to go get some food and talk?”</p>\n\n<p>I really wanted to find out how she could read my thoughts so I figured that I might as well. Plus maybe something else would develop between us. </p>\n\n<p>“Sure. Do you want to me somewhere or me pick you up?” </p>\n\n<p>“I actually don’t have my car today so we can just leave from here.” </p>\n\n<p>Looking back it’s pretty strange. An 18 year old girl going somewhere with a guy she’d only met the day before. But I was really excited to spend time with her and I think she knew that. We went and got takeout from a cheap Chinese place. Once we got our food she whispered.</p>\n\n<p>“There’s too many people who might hear, do you know anywhere where we can be alone?” </p>\n\n<p>I saw this as my chance. </p>\n\n<p>“Yeah i know a place. It’s a little bit of drive, about 10-15 minutes.”</p>\n\n<p>“That’s okay.” </p>\n\n<p>I’ll never forget the smile she flashed after that. It was just as beautiful as before, but there was something aggressive behind it. </p>\n\n<p>The place I was taking her was on the edge of civilization, or as close as we could get. My father had shown me this place. It was a backroad to a backroad to a dirt road which led to the old reservoir road. When they dammed the river, the water over took the road and they blocked it off. I could back my truck down the road until i was just up against the water and the sparking sunset was the best you could get in the whole county. Plus there weren’t any houses around for at least 2-3 miles. </p>\n\n<p>“We should get there a while before sunset, it’s so beautiful on the water.”</p>\n\n<p>“The sunset? I hope we get there before it. I love watching the sun set.” </p>\n\n<p>She giggled and flashed me another smile. She was the most beautiful girl I’d ever taken out here and I knew it would be an amazing night. Especially if I could get her to go skinny dipping in the moon light. </p>\n\n<p>“Wow that’s really something” </p>\n\n<p>She climbed out of my truck as I put it in park. The sun was just over the trees and reflecting beautifully on the water. </p>\n\n<p>“Come on, let’s sit down. I got a blanket.” </p>\n\n<p>We sat down and ate our food as the sun slowly set. I decided to make my move after we ate. I reached up and out my arm around her. The hairs on my arm stood up when she touched me but she rested her head on my chest and leaned into me. I couldn’t believe it. This was going better than expected. I decided that we could talk about her reading my mind on the drive home. </p>\n\n<p>The sun was gone now and I considered turning on my truck lights. I didn’t want to move her and risk breaking the moment, the moonlight was bright enough anyway. I moved my hand down and rested it on her inner thigh. To my surprise it was quite hairy but I put that off saying that she didn’t have time to prepare for that night. I was wrong. </p>\n\n<p>Her breathing became louder and deeper. I had  nodded off the sleep until it woke me up. The moon was high in the sky and I figured it was around midnight. I figured I should wake her up. She must have taken off her hair tie because her hair was covering her face.</p>\n\n<p>“Emilia. Hey wake up. Your parents probably want you home soon.” </p>\n\n<p>I looked down and saw two beast eyes looking up at me. I scramble to my feet and jump back towards my truck. </p>\n\n<p>“Where’s Emilia?” </p>\n\n<p>The creature smiled at me. </p>\n\n<p>“You don’t recognize my smile? You said yourself that it was the most beautiful you’d ever seen.” </p>\n\n<p>Sure enough it was her mesmerizing smile. But her canines were like those of a wolf. She had hair all over and  claws where her fingernails should have been. I bolted for my truck as she lunged at me. </p>\n\n<p>She digs her claws into my ankle and cuts my Achilles. I kick her with my free foot and jump in the car. I lock the doors and started the engine. She jumped up on the hood and howled. I saw pairs of eyes appear in the woods, one by one. I slammed the gas and tried to race away in the dirt road. </p>\n\n<p>All I needed to do was reach the first house. I could see the lights from where I was. They were right behind me and the road doubled back. I think one of them lunged at my tire because my truck lost traction on the dirt road and I went into the woods until I was stopped by a large oak tree. </p>\n\n<p>Now you’re all caught up. I’m using voice to text to tell you this. The police will never believe me. The back window’s almost shattered. I can hear them circling me. My leg stops me from running, not like I could outrun them anyway. I hear many voices in my head but with divine authority. </p>\n\n<p>“His meat will be plentiful. Great thanks to Mersaja for providing for our feeding.”</p>\n</div>\n","author":"SmudgyYeti"}