{"rank":"177","title":"I'm Not Part of Amazon Vine Anymore","id":"8kivhn","url":"/r/nosleep/comments/8kivhn/im_not_part_of_amazon_vine_anymore/","time":"1526702429000","body":"<div class=\"md\"><p><a href=\"https://www.reddit.com/r/nosleep/comments/86vz5m/ive_been_getting_some_really_weird_deliveries/\">Original</a></p>\n\n<p><a href=\"https://www.reddit.com/r/nosleep/comments/875g80/i_finally_opened_the_latest_weird_delivery_from/\">Part Two</a></p>\n\n<p><a href=\"https://www.reddit.com/r/nosleep/comments/88mmsu/amazon_vine_has_been_sending_me_cooking_supplies/\">Part Three</a></p>\n\n<p><a href=\"https://www.reddit.com/r/nosleep/comments/89x4ol/so_amazon_vine_basically_sent_me_a_disney_prince/\">Part Four</a></p>\n\n<p><a href=\"https://www.reddit.com/r/nosleep/comments/8bwx9u/turns_out_amazon_vines_demon_disney_prince_has_a/\">Part Five</a></p>\n\n<p><a href=\"https://www.reddit.com/r/nosleep/comments/8g44no/i_opened_my_last_package_from_amazon_vine/\">Part Six</a></p>\n\n<p>Amazon kicked me out of the Vine program.</p>\n\n<p>I got the email a few hours after my resurrection. In spite of everything, it was quite the emotional blow.</p>\n\n<p>When I’m upset, I like to share my misery. So I spent my first evening home in Charlie’s front yard. I pestered Fye, who clearly wasn’t well. Soft spots marred his skin: large, pitted bruises that reminded me of rotting jack o lanterns.</p>\n\n<p>“I don’t have any answers,” he finally snapped. “Every last one of my plans went to hell and in hindsight, they’re all ridiculous anyhow. I can’t help you. I’d very much like to, but I can’t.” He took a deep breath. “Keep the mask the worm gave you. Beyond that…I don’t know.” </p>\n\n<p>Down the slope, the front door slammed. Charlie emerged, followed by Angeline and several hooded companions. Celandrian scurried behind them. </p>\n\n<p>“Where are you going?” Fye demanded.</p>\n\n<p>They all gave him a terrible glare that was half-frightened, half-hateful. Not for the first time, I wondered what Fye had done. He was irritating nd incredibly arrogant, but fundamentally helpful. He’d even orchestrated Celandrian’s escape from Amazon.</p>\n\n<p>So why did they all hate him?</p>\n\n<p>“Going to work,” Charlie said. </p>\n\n<p>Fye grinned humorlessly. A bruise at the corner of his mouth split. “You mean you’re going to destroy another weak creature and cut him open –” he jabbed a finger at Celandrian – “to kill it in the most painful way possible.”</p>\n\n<p>“It’s none of your concern,” Celandrian said.</p>\n\n<p>“It’s entirely my concern.”</p>\n\n<p>“It’s a little late to be playing father of the year,” Angeline sniped.</p>\n\n<p>Fye bristled. “If anything happens to him –”</p>\n\n<p>“If anything makes him bleed, it dies,” said Charlie. “He’s safer than the rest of us.”</p>\n\n<p>They continued down the slope, but Celandrian lingered.</p>\n\n<p>“What is it?” Charlie asked.</p>\n\n<p>“What about her?” He paused, face working as he found words he was allowed to say. “She shouldn’t be alone with him.”</p>\n\n<p>“They’re too close,” Charlie said. “And the worm marked her. They both stay. Come on.”</p>\n\n<p>Together, they all disappeared down the slope. Fye watched them go, looking more miserable every second. It was almost enough to tug my heartstrings.</p>\n\n<p>Almost.</p>\n\n<p>“Fye.”</p>\n\n<p>His eyes remained fixed on the ridge, reflecting the dark lavender sky with eerie clarity. </p>\n\n<p>“<em>Fye!</em>”</p>\n\n<p>He stood. The deepening twilight made his bruisy, sunken welts look even worse. “Yes. I’m his father.”</p>\n\n<p>“Is Nicnaiven his <em>mom</em>?”</p>\n\n<p>“Of course not.” He beckoned. “Stay close. Charlie’s foray is going to end poorly, and I doubt you’re equipped to handle what’s coming.”</p>\n\n<p>“Well…why don’t you stop him?”</p>\n\n<p>“Clearly you haven’t noticed, but I’m beholden to everyone else, not the other way around.”</p>\n\n<p>After several minutes of awkward silence, I asked: “What’s the plan here? For real?”</p>\n\n<p>“Originally, for you to extract Nicnaiven from the prison. After that, I expected you to play a part in reuniting her with Celandrian.”</p>\n\n<p>“But why? Isn’t getting them away from Amazon and Wal-Mart enough?”</p>\n\n<p>“No. They made a mess together. They have to repent and perform their penance together, and they have to do it quickly.”</p>\n\n<p>“Fine, but seriously, why am I here?”</p>\n\n<p>“Because you’re convenient and willing to help.”</p>\n\n<p>“That’s it?”</p>\n\n<p>“What did you expect? Chosen ones and foretold destinies are fairy tales at best, horror stories at worst.” For the first time since I met him, he looked more monstrous than beautiful.</p>\n\n<p>After a while he lay down in the grass. To my surprise, he fell asleep in minutes.</p>\n\n<p>Twilight gave way to night. Cricket song shrilled across the hills, and cold wind rippled the bracken. </p>\n\n<p>I stood and stretched, shivering slightly; the evening was surprisingly chilly. The last, faint hints of light touched the western horizon. A gust of wind carried strains of Charlie’s chanting.</p>\n\n<p>On a whim, I decided to check out Charlie’s latest attempt at demon-hunting. Grass and gravel crunched under my feet. Oak groves loomed ahead. The moon rose, cold and small and bright. Looking at it put me at ease. </p>\n\n<p>I crested a grassy yellow hill and found myself treated to a spectacular view of the valley. </p>\n\n<p>The worm’s mask suddenly became uncomfortably warm. Alarmed, I reached into my pocket.</p>\n\n<p>“Don’t,” Fye wheezed. I turned and saw him at the bottom of the slope. He shook his head just as Angeline’s panicked voice echoed over the ridge.</p>\n\n<p>“CHARLIE! CHARLIE, NO!”</p>\n\n<p>The air grew abruptly colder. Goosebumps rippled over my skin as my breath clouded.</p>\n\n<p>The short distance between me and Fye somehow warped, shuddering into something solid. Bright lights swarmed and abruptly darkened, resolving into hideous, half-rotted toad almost as tall as the trees.</p>\n\n<p>“No,” Fye said plaintively.</p>\n\n<p>It exhaled, enveloping me in a blast of icy air. Bulging eyes rolled lazily, reminding me of something. </p>\n\n<p>The tadpole, I realized. It reminded me of the tadpole. This was the father, the demon Charlie meant to kill.</p>\n\n<p>“Where’s the boy?” Angeline shouted. “<em>Did it eat the boy</em>?”</p>\n\n<p>The toad hopped forward, causing the ground to quake. I retreated involuntarily, heart seizing when my heel slid off the rocky ledge. </p>\n\n<p>“Why are you here?” Fye asked.</p>\n\n<p>The toad regarded me with a bright, eerie eye the size of a dinner plate. A thousand colors swirled within. “Brother.” Gravelly and labored: like every word, every breath, cost it dearly. “You are so much older than I, yet much less wise. And I am not wise.”</p>\n\n<p>A chorus of panicked voices joined Angeline’s as the cliff crumbled under my feet. </p>\n\n<p>“I am sorry for this,” the toad gasped. “But it must be done.”  Its eyes rolled and flashed. Then its head distorted, widening dangerously as the mouth stretched: a silent, expansive motion like a black hole erupting into existence. </p>\n\n<p>And <em>people</em> came out of it.</p>\n\n<p>One, two, three, four people in dark hazmat suits, wielding guns.</p>\n\n<p>“<em>What</em>?” Fye screamed. “<em>You are an elder god</em>! Why are you helping them? What could they have possibly offered you? Crickets? <em>Flies</em>?”</p>\n\n<p>“No,” the toad moaned. “They know my name, brother. And they know yours.”</p>\n\n<p>A vicious sting blossomed over my throat. Immediately the world blurred. As if sensing my distress, the mask lurched in my pocket, inching around like an uncomfortably powerful slug.</p>\n\n<p>That was the last thing I remember.</p>\n\n<p>An indeterminate amount of time later, I woke to the whine of a drill.</p>\n\n<p>Pain quickly followed: immense and incredibly deep, emanating from a thousand points. Like bugs, boring through my marrow.</p>\n\n<p>I opened my eyes. Indistinct shapes swam in front of me. Flecks of blood and flesh misted the air. I tried to sit, but only twitched.</p>\n\n<p>“She’s coming up,” a man barked. “Get him in a different room, now!”</p>\n\n<p>Wheels rattled. Something cold seeped into my arm. </p>\n\n<p>More nothingness. Then voices, unfamiliar and anxious. </p>\n\n<p>“You can’t put them on display because we haven’t fostered the relationship! There’s nothing to show!”</p>\n\n<p>“I don’t need a demonstration. I only need to show that they exist.”</p>\n\n<p>“But they aren’t progress. They’re just potential. Isn’t the god enough? Drug him up, pretend you’re a worshipper, and he’ll do anything you want.”</p>\n\n<p>“Our investors have the data on their unique molecular similarities. Now they need to see the bodies that produced this data. Get her ready.”</p>\n\n<p>I drifted off one last time, and finally woke for good on a gurney in a lavish conference room. I sat up, whining as pain exploded in my bones.</p>\n\n<p>“Ah! You’re alive,” Fye slurred happily.</p>\n\n<p>Amazement overshadowed agony. Fye and Celandrian stood along the opposite wall, dressed in what appeared to be red wetsuits. They practically radiated health. Gone were Fye’s ominous bruises and Celandrian’s death head pallor. They looked vibrant, healthy…</p>\n\n<p>And ridiculously high.</p>\n\n<p>“I thought you were dead again.” Fye prodded Celandrian. “He says they pulled your bones out.”</p>\n\n<p>The whine of phantom drills filled my head. I shuddered. “No, I’m here. And…bony.”</p>\n\n<p>Fye gave me an unfocused, vaguely wicked smile. “How wonderful for you. What with all the stress…I can’t remember the last time I was bony.”</p>\n\n<p>Celandrian snorted with laughter as the door opened. Five people entered: three women and two men. A tall man swept in after them and locked the door.</p>\n\n<p>“Fiallan,” he said. “These are worshippers.”</p>\n\n<p>Fye rolled his eyes. “I apologize. I thought I’d killed them all. But don’t worry. I’ll take care of these sniveling sadists as well.” </p>\n\n<p>“No. These are the good kind of worshippers.”</p>\n\n<p>“Nothing good ever worshipped me.”</p>\n\n<p>“This is different. You’re different. Remember?”</p>\n\n<p>Fye’s merriment melted away, replaced with a painfully vulnerable uncertainty. </p>\n\n<p>The man smiled encouragingly. He was tall and unusually pale, with striking dark eyes. “Show them what you can do.”</p>\n\n<p>“What do they need?”</p>\n\n<p>The man turned. “You heard your god. Tell him what to give you.”</p>\n\n<p>“Hair,” a bald man suggested. </p>\n\n<p>Fye balked. “What? That’s foolish.”</p>\n\n<p>“Do it, Fiallan.”</p>\n\n<p>“Oh all <em>right</em>.”</p>\n\n<p>The bald man yelped and began scratching his pate. Hair rushed past his fingers. Thick and lustrous, shinier than a Pantene commercial, past his shoulders and down his back.</p>\n\n<p>“That’s enough.”</p>\n\n<p>The bald man yelped again and grabbed his crotch.</p>\n\n<p>“Fiallan! Stop!”</p>\n\n<p>The cascade stopped abruptly.</p>\n\n<p>“That’s very interesting,” a woman said. “But – and excuse my language – he just seems like a garden-variety shithead demon to me.”</p>\n\n<p>“Fiallan,” the man said. “Take us to the ocean.”</p>\n\n<p>The room faded away, replaced with a wild, rocky beach. Stormy skies swirled overhead. Cold spray crashed over the cliffs, carrying the scent of brine.</p>\n\n<p>“Fiallan, take us back.”</p>\n\n<p>“But I’m tired.”</p>\n\n<p>“Fiallan,” the man repeated, “<em>take us home.</em>”</p>\n\n<p>The room reappeared. </p>\n\n<p>“Better.” The woman sounded suitably impressed. “Much better. Now who are they?”  She motioned vaguely at Celandrian and me.</p>\n\n<p>“The son. Less impressive than his father, but with unique properties of his own. For example, his blood is a potent weapon against the serpents and spectrals.”</p>\n\n<p>“What about the woman?”</p>\n\n<p>“A bone mate.”</p>\n\n<p>“Is there any other kind of mate?” Fye asked. “I mean, <em>really</em>?” He and Celandrian dissolved into laughter.</p>\n\n<p>“She and the son are uniquely linked on a molecular level. Due to several factors including his age, upbringing, and the matriarchal nature of his society, she can control him.”</p>\n\n<p>“Really?”</p>\n\n<p>“When all is said and done, yes. We extracted some of her marrow, and we’re currently running experiments to see if we can replicate the effect via transplant.” The dark-eyed man gave us an appraising look. “Let’s continue this conversation outside.” He led them into the hall and locked the door behind him.</p>\n\n<p>“Fye,” I hissed. He blinked heavily and started to nod off. “Fye, wake up!”</p>\n\n<p>No answer. I watched helplessly as both he and Celandrian drifted away.</p>\n\n<p>The realization that I was trapped was overwhelming. I began to cry.</p>\n\n<p>“Shhh,” said a muffled voice. “Cheer up.”</p>\n\n<p>I looked hopefully at Fye. </p>\n\n<p>“No, stupid.” Beneath the bandaging, my thigh started to itch. “Under here.”</p>\n\n<p>It took a great deal of courage, but I peeled the bandages away. On my thigh was a translucent face. Calm, genderless, indistinct.</p>\n\n<p>A mask. The one gifted by the worm, grafted to my flesh.</p>\n\n<p>“Thank you!” it exclaimed. “It’s so nice, being able to breathe. Now peel me off, please.”</p>\n\n<p><em>This is it,</em> I thought. <em>I’ve cracked. I’m insane.</em> “Why?”</p>\n\n<p>“So I can take us somewhere safe.”</p>\n\n<p>I studied the mask. There was no seam, no separation between its drained-blister flesh and my own skin. “How?”</p>\n\n<p>“Just tear me off,” it said cheerfully.</p>\n\n<p>“I can’t!”</p>\n\n<p>“That’s too bad,” it sighed. “But maybe…” The barely-contained excitement set off several internal alarms. “Maybe you can cut yourself and feed me the blood. Then I’ll be able to tear <em>myself</em> off.”</p>\n\n<p>“Um…”</p>\n\n<p>“But we have to do it fast,” it whispered. “Before <em>he</em> wakes up.”</p>\n\n<p>“Who?”</p>\n\n<p>“Fye.”</p>\n\n<p>“But I can’t leave him here.”</p>\n\n<p>Fye snapped back to life. “Why not? Everyone else has.”</p>\n\n<p>I rolled my eyes.</p>\n\n<p>“You have to,” the mask insisted. “He’s a bad man. Everyone knows it. He’ll hand you over if it suits him. And guess what? <em>It suits him.</em>”</p>\n\n<p>“No,” Fye said indignantly. “It most certainly does not.”</p>\n\n<p>“But me? I just want to make you safe. But you need to pull me off first.” It lurched to the side, tugging my skin painfully and creating a creepy flesh ruffle. “Just like this.” It twisted the other way.</p>\n\n<p>“Don’t let it do that,” Fye said.</p>\n\n<p>“I’m not <em>letting it</em> do anything!”</p>\n\n<p>The face kept turning like a metronome. My skin quickly reddened. “Really. He’s a bad man. We don’t need him.”</p>\n\n<p>“Don’t let it bleed you!” Fye yelled, but it was too late: with a sharp, sparking pain, the mask tore my skin. Blood dribbled down my thigh. The mask stuck out a long, narrow tongue and slurped it all up.</p>\n\n<p>We had a moment of unremarkable silence.\nThen the mask shuddered and bubbled out, expanding like a hot air balloon. It grew to the size of a softball, then a basketball, watermelon, beach ball….</p>\n\n<p>And it kept growing. My leg trembled and sank under its weight. I started to cry and tried to back away, but of course it came with me. It was part of me, after all.</p>\n\n<p>An enormous mouth rippled across the expanding orb, uneven and snaggle-toothed. A single lucid thought cut through my hysteria: it looked like a goddamned rage comic.</p>\n\n<p>Fye crawled away, screaming. That giant head turned toward him as it continued to expand. “Bad men,” it rumbled, “never change. Nobody needs you or your pitiful repentance, <em>Fiallan.</em>”</p>\n\n<p>The door slammed open. The pale man strode into the room. “What is going –”</p>\n\n<p>He froze. His companions peered over his shoulder. Upon seeing the head, two turned and ran. Three, however, pushed past him for a better look.</p>\n\n<p>“Amazing,” the formerly-bald man breathed. “Is this an experiment, Wingaryde?” He stepped forward.</p>\n\n<p>“Stay back!” the pale man ordered, but it was too late. My car-sized Pac-Man tumor heaved forward. Before I could utter a sound, it massive jaws closed over the bald man’s head. Then it shoved itself down and bit him in half at the waist.</p>\n\n<p>A ridiculous amount of blood geysered up, spattering everyone.</p>\n\n<p>The mask made short work of the man’s legs. Then it twisted around to face me. “Time to get safe!” It opened its mouth. That dark cavern overtook my vision, impossibly black except for a bright, pulsing spot of light at the back of its gullet.</p>\n\n<p>“Don’t look!” Fye grabbed my foot, fingers circling my ankle like iron. Then he caught Celandrian’s hand.</p>\n\n<p>The head rolled toward him again. Its pulsing throat-light brightened ominously, then disappeared as the room plunged into darkness. The head screamed and shuddered.</p>\n\n<p>Everything became terribly cold. Suddenly I smelled pines.</p>\n\n<p>Slowly, the blackness lightened to a starry night sky. I tried to stand, but could barely move. All around me I felt a soft, almost mucousal barrier: wet, transparent, and stretchy. With a scream, I forced myself forward. It gave way, splitting like cling wrap and spilling me into fresh air.</p>\n\n<p>The head still blossomed from my thigh, but it was vastly reduced: the size of a football, horrifying but manageable.</p>\n\n<p>Fye dragged me to my feet. “Hurry,” he panted. “We don’t have time.”</p>\n\n<p>He pulled me through a frosty winter forest. Towering pines were dark against the star-swirled sky. Sweet scents of snow and evergreens perfumed the air. It was beautiful. But I was in too much pain to enjoy it. The chill sank into my damaged bones, making every movement exquisitely painful. </p>\n\n<p>We finally reached a snowy clearing. A pond stood in the middle, still as glass and somehow unfrozen. Fye led me to the edge. “Jump in.”</p>\n\n<p>“What? No!”</p>\n\n<p>“Your second head will subsume you if you don’t.”</p>\n\n<p>As if on cue, the mask wrenched, throwing me off balance. Before me, the pool shone like silver glass. Looking at it produced a dreadful, stomach-curling anticipation.</p>\n\n<p>But I jumped in.</p>\n\n<p>The cold shocked all air and warmth out of me. Moonlight streamed into the water, turning the bubbles into a thousand brilliant stars. I tried to kick up but couldn’t move.</p>\n\n<p>Finally I felt a warm hand, tangling in my hair. Before I knew it I’d been hauled from the water. I convulsed on the snowy ground, fighting to do anything more than gasp.</p>\n\n<p>Fye sat me up and carefully bent my leg at the knee, baring the face to the moonlight.  With a wretched scream, it reared up and peeled itself away. Tatters of flesh came with it. The pain was exquisite, dirty, and overwhelming, and it took forever.</p>\n\n<p>But finally, that limp, translucent mask lay crumpled on the snow, inert and lifeless.</p>\n\n<p>“Pick it up,” Fye said. </p>\n\n<p>It took several tries, but my numb fingers finally closed over it.</p>\n\n<p>“I’m sorry,” he said. “I know you’re cold. But I need to recuperate before I can take you somewhere else.”</p>\n\n<p>“Where’s your kid?”</p>\n\n<p>“Already at Charlie’s, unless I made a mistake.” He lowered himself to the ground. We shivered in silence for a long time.</p>\n\n<p>Finally I mustered the bravery to speak. “I’m done. I want out.”</p>\n\n<p>“You can’t,” Fye said. </p>\n\n<p>“Why? Because you linked me to him?” My teeth chattered, splitting each word into a dozen syllables.</p>\n\n<p>“<em>I</em> didn’t link you.” He drew a particularly ragged breath. “Do you remember when Celandrian spoke of stars and carbon?”</p>\n\n<p>I nodded.</p>\n\n<p>“The matter in our bodies comes from stars, meteors, even the cataclysm that spawned the universe. We all have remnants of sentient dust and crystal spiraling through our marrow. Like any family, these particles want to be together. In our myths, they slowly traverse universes and planes, hurtling untold distances until the end of time, in an effort to find one another and reform.” His chest heaved dangerously. “I didn’t choose you because you were unremarkable. I chose you because you’re made from the same star as my son and Nicnaiven. That’s why he was susceptible to her influence, and why he’s now susceptible to yours.”</p>\n\n<p>Another silence descended. I began to feel numb and sleepy.</p>\n\n<p>“I’m sorry.” His voice was unexpectedly weak. “Now that they’ve lost Celandrian and Nicnaiven, they want you.”</p>\n\n<p>“Why…?”</p>\n\n<p>“You heard them. They want to transplant your marrow to replicate the bond.”</p>\n\n<p>“Will it work?”</p>\n\n<p>“I don’t know. But you aren’t safe. You can’t get away from this.” He stood. I tried to follow suit, but couldn’t feel my legs. </p>\n\n<p>Suddenly children’s laughter rang out, shrill and sweet. Conditioned by decades of horror movies, I froze.  Out of the corner of my eye, I saw shapes darting through the trees.</p>\n\n<p>An almost palpable panic descended over Fye. “We have to leave.” He leaned down and hauled me to my feet. I stumbled and fell. He caught me just as a woman appeared among the pines.</p>\n\n<p>Fye froze.</p>\n\n<p>She came forward, flanked by half a dozen children. “Who’s there? Don’t be afraid.” Her voice was sweet and incredibly kind. “I won’t hurt you.”</p>\n\n<p>Fye’s composure broke right as the forest disappeared. Before I knew it, we were back in Charlie’s yard.</p>\n\n<p>Fye lowered himself to the ground, gasping. To my horror, I realized he was crying. “What’s wrong? Are you hurt?”</p>\n\n<p>He shook his head. “Just wrestling with the reminder that no matter how far I come or how much I do, it’ll never be enough.” </p>\n\n<p>“For what?” I shifted anxiously. “What exactly did you do?”</p>\n\n<p>“Everything I shouldn’t have, and nothing I should.”</p>\n\n<p>“What do – ”</p>\n\n<p>“I was a god.” His face twisted. “A terrible one. Terrible enough that Celandrian killed me.”</p>\n\n<p>“Fye – ”</p>\n\n<p>“But I didn’t stay dead. And I changed. A great cosmic joke, returning a monster with a reformed heart to serve the people he terrorized. Nothing I do will ever be enough, but I can’t stop trying.”</p>\n\n<p>“To what?”</p>\n\n<p>He gave me a haunted, broken look. “To rectify it.”</p>\n\n<p>“How?”</p>\n\n<p>“By freeing you. All of you, from us. From our influence and power. To save you from the weapons they’re making from us. To let you finally be free, in all ways, of sadistic gods.”</p>\n\n<p>“So that’s your plan? What about Wal-Mart and Amazon?”</p>\n\n<p>“I want to stop them, too. Like I told you, I want to take away their means of developing weapons. But it goes far, far beyond that. In order to do what must be done, Celandrian and Nicnaiven have to work together. You have to work with them.”</p>\n\n<p>“To do what?”</p>\n\n<p>He didn’t answer.</p>\n\n<p>I pressed: “So I’m only here because of random stardust?” Frustration and a sense of desolation gnawed through me, leaving me hollow and cold. “I thought chosen ones and destinies are crocks of shit.”</p>\n\n<p>“No. They’re fairy tales at best, horror stories at worst.” He wiped tears from his face. “I thought this would be simple. I’m sorry.”</p>\n\n<p>I didn’t know what to think, let alone say or do. But I was numb and exhausted, and he was veering toward a breakdown.</p>\n\n<p>“Let’s go inside,” I said.</p>\n\n<p>I led him down to the house. We found Celandrian lounging in an oak tree near the door. He spared Fye a murderous look that quickly turned to surprise when he saw me. He struggled briefly, mouthing a stream of words before asking, “Are you all right?”</p>\n\n<p>“Yeah.”</p>\n\n<p>He smiled tentatively, and god damn it, I felt it. Not love, not attachment, certainly not attraction. But <em>belonging.</em> Fye was right.</p>\n\n<p>The long-haired little bastard feels like home. </p>\n\n<p>It’s been several hours. Fye’s been asleep since breakfast. Charlie and Angeline are fawning over Celandrian and ignoring me, I guess because I don’t hate Fye.</p>\n\n<p>Anyway, I’ve had a lot of time to think. </p>\n\n<p>I don’t have all the pieces of the puzzle, but I think I know what Fye wants. He is – or was – a god. He wants to rid the world of beings like him.</p>\n\n<p>Celandrian tried to kill him once, and failed. But if Celandrian is whole – if he has his bone-mates, for lack of a better term – he’ll be stronger. Maybe strong enough to kill his father and keep him dead.</p>\n\n<p>That would explain his uneasy truce with Charlie.  They have the same goal: destroy evil nonhumans.</p>\n\n<p>Except I don’t think Fye is evil. I believe he was. But not anymore. And I’m not going to hurt him. I know it&#39;s ridiculous, but he&#39;s the best friend I&#39;ve ever had.</p>\n\n<p>When he finally wakes up, I’m going to ask questions. What he wants from me, how it’s supposed to work, how the hell he expects me to make friends with Nicnaiven.</p>\n\n<p>And I’m going to ask him about the woman in the forest. A glimpse of her brought him to his knees. So she’s important. I guess we all are. </p>\n\n<p>And together, surely, we can foil the military contract aspirations of Amazon and Walmart <em>without</em> killing Fye.</p>\n</div>\n","author":"Dopabeane"}