{"rank":"13","title":"I'm a call center employee, and I think my breakroom's haunted","id":"8kivqu","url":"/r/nosleep/comments/8kivqu/im_a_call_center_employee_and_i_think_my/","time":"1526702515000","body":"<div class=\"md\"><p>I work at a call center, and things are getting really weird. Any call center employee can tell you that it&#39;s a messy business, but I&#39;m not talking about that. I think there&#39;s something...supernatural going on at work. My poptarts have been disappearing.</p>\n\n<p>Now I know that doesn&#39;t sound like a big deal, but stay with me. I keep poptarts in my own locker at work. No one has access to my locker but me, the manager, and the assistant managers. Two of them hate poptarts, and the other has an allergy to raspberry. But they&#39;ve been disappearing for weeks.</p>\n\n<p>Today, I got ready for work, just like usual. I wore my cleanest shirt (it&#39;s so hard to get work stains out), some dark slacks, my gloves. I packed my two tinfoil bags of poptarts, just like I do every day, into my backpack and came into work. I put it all in my locker, lock it, and head out to the desk.</p>\n\n<p>It&#39;s your typical morning. I take calls for a couple of hours. No Splatterers yet, thank heavens. Any call center employee will tell you that those are the worst. But still, it&#39;s just mindless, numbing work.</p>\n\n<p>I get one customer who&#39;s angry about their cable bill. &quot;[Competitor cable company] gave me a discount for being a school principal, why can&#39;t you?!&quot; he asks for the fiteenth time. High, screechy voice that&#39;s so loud I get feedback in the headset. </p>\n\n<p>&quot;Sir,&quot; I say for the fifteenth time. &quot;We aren&#39;t [competitor] we&#39;re [horrible cable company]. We don&#39;t offer discounts to educators.&quot;</p>\n\n<p>&quot;But I&#39;m a principal, and [competitor] used to give me a discount!&quot;</p>\n\n<p>I want to facedesk but my manager is watching me. I have to stay polite. And the manager only really deals with Splatterers, so I&#39;m stuck with this guy until his phone disconnects. Who knows why, I don&#39;t care, I&#39;m not paid to think.</p>\n\n<p>Anyway, I go to lunch, check my locker, and what do you know: one of my foil bags is open , and a poptart missing. Just one. Seriously, again? The only one else there is my assistant manager Chris, drinking coffee. &quot;Did you eat this pop tart?&quot; I ask. &quot;No,&quot; he says. &quot;Are you sure you didn&#39;t eat one before work? Because no one else has had lunch yet,&quot; he says. </p>\n\n<p>I&#39;m mad about the pop tart, but I eat my sandwich and one of the tarts. I go back to my desk. It&#39;s hard to focus because Enrique is crying after dealing with a splatterer. Enrique&#39;s new, so that won&#39;t last very long.</p>\n\n<p>I spend over two hours dealing with one elderly customer. She&#39;s almost done installing our software on her laptop, and she keeps pushing &#39;no&#39; on the last step.</p>\n\n<p>&quot;Ma&#39;am, to complete this installation, you must press &#39;yes&#39;.&quot;</p>\n\n<p>She says, &quot;I pressed no.&quot;</p>\n\n<p>I say, &quot;Okay, we need to start over. Click the &#39;install&#39; icon again.&quot;</p>\n\n<p>Ten minutes later...</p>\n\n<p>&quot;Okay,&quot; she says, &quot;It&#39;s saying &#39;Are you sure you want to proceed?&#39; with a big red X. The X means no, right?&quot;</p>\n\n<p>&quot;Please press yes, ma&#39;am,&quot; I plead.</p>\n\n<p>&quot;I pressed no.&quot; I mime flopping onto the floor, dead. My manager chuckles but points to my chair, which I get back in with a sigh.</p>\n\n<p>I take a quick bathroom break. I peek in the breakroom. What do you know, another of my poptarts are missing! The locker is locked, people! This is when I begin to suspect supernatural behavior.</p>\n\n<p>I come back. Freddy from maintenance is trying to clean up after a Splatterer. What a mess. </p>\n\n<p>Any way, the day is almost ever when I got one of Those Calls.</p>\n\n<p>&quot;Thank you for calling [horrible cable company], how can I help you?&quot; I ask.</p>\n\n<p>The ship is falling down and no one will survive. You do not recognize the bodies in the water.</p>\n\n<p>I often thought to myself in those fateful days that I would be the first to die.</p>\n\n<p>&quot;The often is to down in! No fateful survive. That do would recognize first bodies die water!&quot; I hear.</p>\n\n<p>A Splatterer. Day wouldn&#39;t be complete without one (call center employees know what I&#39;m talking about). I sigh and wave over my manager before putting down my headset and standing back. He puts on his plexiglass helmet and grabs a baton. The other assistant manager arrives just in time (Chris is nowhere to be seen). My laptop bulges and swells, seams cracking and popping. It splits open and an angry, swollen, purple man emerges from it, screaming and running at the manager. The manager blocks him and pushes him back, but the Splatterer doesn&#39;t stop until Chris comes out of nowhere, crumbs spilling fom his mouth, and smacks him down with a chair. </p>\n\n<p>The splatterer is out cold, and they finish him off. The manager lifts his shoulders while the assistant managers grab his feet and they carry it to the bin.</p>\n\n<p>I checked out a new laptop from IT and patted Freddy on the back in sympathy as I walked by. &quot;Hey, that&#39;s only two today,&quot; I say. </p>\n\n<p>&quot;Two&#39;s too much for me, man,&quot; said Freddy. &quot;I&#39;m going back to retail.&quot; I shrugged, and went back to the breakroom. The poptarts were completely gone this time. My locker was open, and the wrappers were just lying on the ground. No one was even in there.</p>\n\n<p>I&#39;m worried that the breakroom&#39;s haunted. Do any of you have experience with ghosts?</p>\n</div>\n","author":"craiglocke"}