{"rank":"7","title":"I just wrote it and I want your opinion about it","id":"8kiyzq","url":"/r/nosleep/comments/8kiyzq/i_just_wrote_it_and_i_want_your_opinion_about_it/","time":"1526703640000","body":"<div class=\"md\"><p>Its been a while since this happened, around 8 years ago. I was 15 by that time and my family had a beach house down in a small city here in Brazil named Guaxindiba. It was a big house, 2 floors, the first one with a bedroom, bathroom, living room,  dining room, kitcken, laundry area and a deposit, and the second floor had 4 bedrooms and a bathroom. The house also had a huge frontyard that could fit around 4 cars and still have some space for the kids to play.\nSince before I was born, my family had this tradition of reuniting everyone there on every summer vacation, we would spend a month together and enjoying the beach almost everyday, It was really great and I have some great memories of that place, unfortunately, also the worse ones.\nWith the time some members of my family grew apart and started not going with us anymore when summer vacation came, but we always had a good amount of people to come with us, and this year there were 7 of us. Me, my parents, my 10 years old sister, my 2 grandmas, and 1 grandpa.\nThe first couple of days went as usual, we arrived there, unpacked, took a ride by the beach, stopped a little, felt the fresh air and the wind blowing, nothing like the sound of waves crashing and the wind blowing against your face, haha. Anyway, and so it went for around 5 days, and that is when things started getting weird. \nI had brought my mom’s laptop, It’s not really good and the internet there wasn’t great, but I just wanted to play some pokemon fire red on the Gameboy emulator I had downloaded, and so I did. It was 23h and I was playing at the front porch of the house, while my father watched some TV. He finally got tired and went upstairs to sleep, everybody used to sleep upstairs, the bedroom downstairs was kinda small, usually used when there was no room anymore, so as there were only 7 of us, nobody was using that it. I said good night to my father and kept playing my game, as I was almost reaching for vermilion city with my charmeleon on level 23. There was nobody passing by the street anymore, so I was left with only the game song as the background sound of my night. \nAround 1 a.m. I clearly heard someone coming down the stairs,  and when the sound approached my ears, I turned my head a little bit just to check and with my peripheral vision I could see a tall shadow passing by the dining room and heading to the kitcken. Among the people who came with us, only my father was that tall, so I asked him.\n- “Hey, what are you doing up so late” . I asked.\n- “I could ask you the same thing”. He replied in a low, hoarse voice as he opened the fridge and drank some water. \nI followed him to drink some water too. He had the jar in his hand, so I just got a cup.\n- “Can you poor me some water?”. I asked. He stopped for a second, stared at me and gave me the creepiest grin I had ever seen and then he whispered\n- “You know… he can hear you typing, he can hear you breathing and he told me you smell like fear”.\nI couldn’t move, I just stood there with my glass held up and stared at that creepy grin in his face, as he put the water back in the fridge and went back upstairs to his room. Even after he went away, I couldn’t move for like, 5 minutes, and when I finally did, I could only think about going to sleep, so I rushed upstairs like a frightened teenager who didn’t want to succumb to fear. I went up the stairs and crossed the hall to reach for my room, the door was open and as soon as I got in I could see him, he was still smiling, still with that creepy smile in his face looking at me. Again I couldn’t move for what it felt like 15 minutes but it was probably some seconds, until he finally said “Good night, we gonna have some fun tomorrow”. After that the smile suddenly went away, and he was just a normal person sleeping.\nI rushed to my bed and hid underneath the covers, and refuse to let myself out, even when I started feeling hot, I just stood there for around 2 hours until I finally managed to get some sleep.\nThe next morning my mom woke me up around 9 a.m. to go to the beach, the morning sun is healthier, she used to say. I quickly looked for my father as I realized he was right behind my mother, packing some cookies like nothing happened, I refused to ask him anything and just acted normal. \nThe day went out pretty well and common, despite my awareness of everything and everyone (If you had seen what I did, you would be like that too) apparently everything was fine, and as the day went by I was starting to feel relaxed again, yet I couldn’t find any reasonable explanation for what happened. I wasn’t going crazy, last night happened and I was sure of it. But everything was fine now and… Fuck, I just didn’t know what to think or do.\nSo the night came, and with it, the fear. I decided I was going to go to sleep early today, so at 9 p.m. I was ready to sleep. Both of my grandmas were already in bed, and also my little sister. So I said goodnight to my parents and my grandpa and went upstairs. The room we were using is the first one by the stairs, but you have to go through the hall to get in it, and there is a window on the room wall that heads to the stairs. As I finished going up the stairs, I glanced through our bedroom’s window and again I was paralyzed.\nThe window was facing a mirror in the opposite wall, and in the mirror I could see myself in the window outside, and inside the room, I could see my little sister right beside me, with her backs against the wall, staring directly at me with the same grin my father did last night. This time I decided I was going to scream as loud as I could, the problem was… I couldn’t… I could only stand there and stare at that creepy smile as she slowly whispered to me.\n- “You’re next” . And as she finished those words, I could only watch her heading to her bed and going to sleep.\nThat night I didn’t sleep, I made an excuse to my parents that I was sick just to have a reason why I would stay up all night, and to have someone awake with me all the time. Needless to say, the next morning I was so tired I could barely think. I had to get some sleep and yet I was too afraid. The only thing I was focused on was,  what does it mean “you’re next”? \nI kept myself up until around 6 p.m. of that day, when I was laying down on my bed and my eyes just closed.\nI had the weirdest dream that night. I was at our family’s beach house, and my mother was up late washing the dishes, I woke up, went down the stairs and when I saw her I went to her and just stared at her, until she noticed me and I said: “You are the last one”. I could see she was pretty scared, and yet for some reason, I couldn’t stop smiling… </p>\n</div>\n","author":"aguiarheitor"}