{"rank":"13","title":"Do you ever get that feeling?","id":"8kj7u8","url":"/r/nosleep/comments/8kj7u8/do_you_ever_get_that_feeling/","time":"1526706701000","body":"<div class=\"md\"><p>Do you ever get the feeling someone&#39;s watching you when you&#39;re all alone? Like someone is standing in the shadows, just outside out your range of sight? You know they&#39;re there. You can feel their eyes glued to you as you go about life, attending to your daily chores ot trying to sleep. They never make themselves known, and they most likely never will. But, just because you can&#39;t see them, doesn&#39;t mean they aren&#39;t there. </p>\n\n<p>I&#39;ve developed this skill when I was very young, 4 or 5 maybe. A skill that allows me to see those creatures that watch you. And, let me just say, they are far from nice.</p>\n\n<p>All of them are different, yet the same. They come in different shapes and sizes, but their faces are all similar. Shrived and wrinkled. Features, like the nose and eyes, in places they don&#39;t belong. Pale and gorey, a dark green liquid slowly dripping down it&#39;s chin in some cases. Some of their necks are twisted unnaturally, almost resembling a spring or a coil, others are completely normal. </p>\n\n<p>One thing is always the same, though. Those cold, pure black, angry eyes. Those eyes that stare at you while you sleep. Those eyes that watch every single word you type or read. Those angry, vengeful, bulging eyes. They&#39;re way too big to even be possible. Almost like an anime character or one of the Powerpuff Girls. </p>\n\n<p>I tried to tell people about it, but they&#39;ve always written it off as my &quot;vivid imagination&quot; or say I &quot;watch too many horror movies.&quot; So, I stopped talking about it. </p>\n\n<p>I don&#39;t know what attracts them, but, there was one girl in particular that they flocked to like flies. Her name was Mia Class. She was quiet most of the time, always kept to herself. She wasn&#39;t picked on or bullied, in fact she had quite a few friends, but, man did these things love her. I would see at least ten around her at all times, following her around campus with big grins. I&#39;ve only ever seen them smile around her, though. It was odd.</p>\n\n<p>After a few weeks of seeing them around her, I could tell it was taking a mental toll on her. She was always checking behind her and walking fast in the halls, once she even broke down and started screaming in the middle of class. No one really understood why. No one, except for me, that is. </p>\n\n<p>This went on for months. Day after day, Mia would run off to the bathroom and sob her eyes out, slowly slipping into the dark pit of insanity. Each day, those creatures would smile wider, stretching their wrinkled, bedraggled faces more and more. </p>\n\n<p>Eventually Mia lost all of her close friends, her grades fell from A&#39;s and B&#39;s to F&#39;s, her usual happy and cheerful face turned miserable and tortured, her well-kept hair was uncombed and greasy, and she started wearing the same T-shirt and jeans every single day. It was almost like she was a completely different person. </p>\n\n<p>A few months later, she snuck off to the bathroom and the creatures followed, skipping and tripping over each other to get closer to her. My curiosity got the best of me and I followed her. I&#39;ve never seen those things act like that before. They&#39;re usually so angry and hateful. </p>\n\n<p>As she walked into the bathroom, I stayed outside of the entrance, looking in slightly so I wouldn&#39;t be spotted. I watched her stare into the mirror at herself for a good five minutes. She then reached into her bag and pulled out a piece of paper and a pen, scribbling frantically. She taped the paper to the mirror and pulled out a small pistol. She quickly put it in her mouth and pulled the trigger, wasting no time so she couldn&#39;t stop herself. </p>\n\n<p>I watched blood and brain matter paint the stalls behind her as she fell limp, collapsing onto the floor. The creatures cheered and reached down, tearing her body apart, limb from limb. I watched them feast on what was left of Mia like she was a turkey on Thanksgiving. </p>\n\n<p>I took the chance to walk into the bathroom and grab the note she had wrote moments before. It read:</p>\n\n<p><em>&quot;They won&#39;t leave me alone. No matter what I do, those twisted freaks won&#39;t leave. This is my only way out.&quot;</em></p>\n\n<p>My eyes widened as I looked up at the mirror. The creatures that were once following Mia were standing right behind me, looking down and smiling with blood stained mouths.</p>\n</div>\n","author":"Memeyusername"}