{"rank":"38","title":"What happened to me at Mary's Bluff","id":"8kjgmb","url":"/r/nosleep/comments/8kjgmb/what_happened_to_me_at_marys_bluff/","time":"1526709833000","body":"<div class=\"md\"><p>It’s been almost 20 years since I lived in Mary’s Bluff, and no one in my life has admitted to its existence. My mother was single, ex-peace corps, adopted me late in life and passed away just six months past, before I could extract any truth from her.</p>\n\n<p>“Mary’s Bluff?” She used to say. “I think you’re thinking of Richmond, honey. That’s where you were born. Virginia.”</p>\n\n<p>A Google search of any variation of Mary’s Bluff will turn up churches and cemeteries dedicated to the biblical Mary, but the village’s namesake, if I recall correctly, was after its founder, a Mary Stockley (at least, that’s what I think her name was) in the 17th century.</p>\n\n<p>I’m a firm believer in the brittleness of memory. I’ve read that someone can remember something that seems stark and clear in their mind, when truthfully, it’s only a muddied version of the actual occurrence. Personally speaking, I think that’s true to a point. The events in Mary’s Bluff are so singularly unique, I can’t have misremembered them.</p>\n\n<p>I was thirteen then. There are quite a few facts I recall about the village, but I was too absorbed in the ballet school I attended there to really piece the information together in a helpful way. Mary’s Bluff was seaside, definitely. A crabbing village. The boats would go out in the early morning, lanterns aflame, and remain glistening there in the placid dark. I still have nightmares about that water.</p>\n\n<p>The bulk of my memory was in the ballet school. The movements. The other girls in their dark leotards. Our sharp-featured instructor who we all thought was Russian. I distinctly remember my mother saying that she was, in fact, Polish.  Later in life, she was the only commonality in childhood memory my mother and I had. But she insisted I was taught by her in Richmond, and we could never remember her full name.</p>\n\n<p>It was my ballet instructor that told our class the village’s history. I can’t remember key details. There were important ones, I’m sure, names of places and people, specific migrant diasporas that made up the village’s demographic, but I didn’t retain any of them.</p>\n\n<p>It was notable that during the witch hunts, Mary’s Bluff was one of the only religious centers that sheltered innocent women accused of dealings with the devil. I can still see the village’s motto written on the school blackboard, perfect in my mind’s eye: “Leave Judgment to the Lord.”</p>\n\n<p>Mary Stockley was the first mayor of the village. She was of noble heritage, the daughter of either a plantation owner or a barony, who rejected her heritage. You’ll have to forgive me for having read a lot of classical romance at that age. Jane Austen, Bram Stoker, etc. I get the backgrounds mixed up. But Mary Stockley definitely wasn’t fiction.</p>\n\n<p>There were photographs.</p>\n\n<p>Vera was 15, and my senior in ballet, and I was slightly in love with her, as most of the village’s children were. I still have the battered copy of Moby Dick we scribbled on, the only physical evidence of Mary’s Bluff I own. I still wonder where she went, and whether she has blocked the memory of it out, though I’ve been unable to. But it was Vera who noticed something strange in the photographs.</p>\n\n<p>They were kept in a display case at the ballet school. As we waited for evening class to start, me and Vera stood in the hallway and stared at the old pictures. Vera pointed at one of Mary Anne Stockley, the granddaughter of Mary Stockley, standing beside a group of girls our age. They were all wearing black dresses and smiling unenthusiastically.</p>\n\n<p>“Look, Mary Anne is crossing her fingers here,” she said. “And here. And this one, too. Most of these pictures she has her hands behind her back. I feel like she’s crossing them in every picture. Don’t you think?”</p>\n\n<p>“Maybe something’s wrong with her hands,” I said, thinking of my mother’s carpal tunnel syndrome.</p>\n\n<p>There was one picture of Mary Stockley herself, but it was what was known as a daguerreotype, the oldest known method of taking a picture, and she was over a hundred years old in it. To me, Mary Stockley was just an ancient woman sitting in a chair with a sullen expression, her hands folded in her lap, her back bundled in a slight hunch. She looked like someone who had crawled out of a cave.</p>\n\n<p>“She’s doing it, too,” said Vera, pointing at Mary Stockley.</p>\n\n<p>I could see that she wasn’t crossing her fingers, but the bell for class had been rung, and I couldn’t argue the subject. I didn’t know what Vera really meant until much later, when we were at the docks.</p>\n\n<p>The Outing was an annual village celebration. Our ballet troupe danced for it, a fluid, flowing dance in tutus made to look like crow’s feathers. I can’t remember much of the performance, but my mother used to say I was a young genius at ballet.</p>\n\n<p>I haven’t been able to touch my feet for years now.</p>\n\n<p>The rest of the evening’s festivities were more food focused, with people from the farming and fishing communities featuring their accomplishments.</p>\n\n<p>When we gathered for a group picture, Vera nudged me in the ribs. “Look!” She seemed to say, nodding toward our “Russian” ballet matron. The woman was posing for the camera with her arms folded in front of her. I knew that Vera wanted me to see if the finger crossing was some sort of bizarre tradition in village photos, but I could clearly see that the matron’s fingers weren’t crossed at all.</p>\n\n<p>I looked at Vera. She was frowning at our matron.</p>\n\n<p>I had never thought of Vera as older than me before that night. We were the same height, and we had the same interests. We loved adventure stories and were among the best students in the ballet school. But Vera had a secret history, which she talked to me about as we made our way out of the lights of the celebration, and into the darkness of the pier, and I was reminded of just how little of life I’ve seen.</p>\n\n<p>She told me her suspicions began a few Outings prior, when Vera asked her grandmother what an Outing was. Her grandmother had given her the modern definition, as well as what was known in the village as the true origin: that the celebration was originally a festival called the Crossing Out. Her grandmother had relayed to her an old village rhyme, which Vera later wrote in the copy of Moby Dick I mentioned:</p>\n\n<p>“Played with hexes, give them X’s! Played for nought, cross them out!”</p>\n\n<p>Vera didn’t think anything of it, until she discovered in a book about sailing, that noughts and crosses was the antiquated name of what we all now know as tic tac toe, played by sailors and pirates alike. Little Vera then realized that the imagery of X’s and O’s was all over the village. When she said this, I realized she was right. The village’s chapel had a cross, but it was framed in a smaller circle, and this was true for every cross found inside. On the sides of Mary Bluff’s oldest boats, carved into the wooden hull, a pattern of X and O.</p>\n\n<p>I laughed then, because it seemed silly to me how obsessed the village was with a kid’s game. But Vera hadn’t finished her story. She had continued investigating the patterns, thinking it was some sort of mystery that led to buried treasure, but quickly realized the patterns had a more ritualistic significance. The word Vera used was “churchy.”</p>\n\n<p>We stopped walking. The village square was behind us now, concealed behind seaside houses, and the cold and damp ate into our coats. I remember wishing I wasn’t wearing just my tutu underneath it.</p>\n\n<p>“I came here last year,” said Vera, “and I saw something… bad.”</p>\n\n<p>We looked out into the sea from behind a collection of barrels. There was very little light to go on, but I could see the outline of the crabbing boats all crowded beside each other. A cloud moved, however, and the full moon illuminated the dock where four men stood.</p>\n\n<p>I could feel Vera’s hand tighten over mine, trembling wildly. I felt uneasiness seep into my stomach, but I remained rooted to my spot, for fear of informing anyone or anything of my presence.</p>\n\n<p>The men were in fishing waders, standing still with bowed heads, encircling a fourth figure. Vera whispered at me harshly, inaudibly, but I understood her reaction. We knew who it was. Her name was Kathy or Kelly, some variation of it, a prima ballerina in our school who we thought had transferred to a more prestigious ballet school months ago. Her face and expression were clear in the moonlight, like someone who had just woken up, and was still under the spell of a dream.</p>\n\n<p>She was in a cage like the type they kept crabs in, though in her exact size, the rough metal wrought in the now-familiar X and O pattern. The four of them seemed to be speaking in whispers. I couldn’t read lips, but I’m sure that whatever it was they were saying, it was being repeated over and over.</p>\n\n<p>The nearby fishing boat’s crane moved with a loud creak. I could see a man in the crane box, slowly lowering the crane’s hook down to Kathy’s cage. Their chanting stopped. The men passed something through the bars, an empty sack that might have once been a sandbag. Kathy pulled it over her head. There was a red circle drawn on it, framing the face we could no longer see.</p>\n\n<p>“This happened last year,” said Vera. Her voice shook, echoing itself. “But it was someone else. It was someone else, and I was scared, and I ran.”</p>\n\n<p>We watched in silence as the cage was lowered into the ocean, Kathy’s body limp and compliant until she was submerged. The fishermen remained unmoving. After a time, they slowly brought their arms above their heads and crossed them.</p>\n\n<p>When they completed this movement, the water where the cage was lowered began to bubble and thrash violently. I jumped. Beside me, Vera’s heavy breathing stopped completely. We saw blue hands tear wildly at the surface of the water, struggling desperately for a handhold. I wanted to scream. We watched them grasp at nothing for five minutes and, just as suddenly as they began, they stopped.</p>\n\n<p>Vera and I glanced at each other. Stillness. The fishermen didn’t budge, though the youngest of them (he looked only several years older than us) was shaking slightly. In retrospect, it might have been the boy’s first time.</p>\n\n<p>This is the moment where my nightmares usually begin. I’m confident now that if me and Vera had just turned around and gone at that moment, I would have forgotten Mary Bluff completely. Even if I didn’t end up forgetting the murder, it wouldn’t eat at my mind; I could separate it from myself, put distance between me and the crime I witnessed, live my life with some fear, sure, but never unwaking terror. But I remembered what happened next. I remembered it every night, for 20 years.</p>\n\n<p>I would never forget the moment the water started to move again.</p>\n\n<p>At first it was small ripples, like the movement of fish in a shallow pool. Then the hands reemerged, Kathy’s hands, blue-white and gleaming in the moonlight. They moved calmly, gracefully, in a circular and repeated pattern, like miniature swans darting toward the surface. I looked at Vera, who had gone pale and almost lifeless with shock. She looked at me with pleading eyes. She wanted to know if I was seeing what she was.</p>\n\n<p>The crane lifted the cage out of the water. I remember thinking that I had to cover my eyes, but I didn’t budge. I was afraid my shadow would betray me.</p>\n\n<p>I couldn’t put a name to what I saw arise from the ocean. I couldn’t call it Kathy, because it wasn’t. I hesitate to even call it something approaching human, though human shaped it was. But it danced slowly in its prison of iron, carefully, repeating movements me and Vera learned in class, but somewhat rehearsed, as if it had been waiting eagerly for this performance.</p>\n\n<p>Kathy’s dress clung sickeningly to the entity’s skin, and the head inside the sack moved ferally, like a bird rapidly swiveling its head round and round to take in its surroundings, in sharp contrast to the calmer movements of its arms and legs. It spun slowly and gestured, and repeated its movements with only slight alterations.</p>\n\n<p>The fishermen on the dock stayed where they were. The man in the crane box, however, had to watch his work. His face was certain, but lined with horror, and he held crossed fingers up like a ward against some invisible force. He released the lock on the cage, and the door to it clicked and opened wide as soon as it returned to the dock.</p>\n\n<p>The entity lunged slowly out of its prison, though it looked as if it didn’t care which direction it went. It didn’t even seem to acknowledge the men standing there, unmoving, unwatching. It danced.</p>\n\n<p>“Let’s go,” said Vera. “I want to go.” She let my hand go and turned around.</p>\n\n<p>It happened in seconds that felt more like years. The first thing I saw when my eyes went from Vera back to the dock was the face of the man in the crane box. He held up his crossed fingers and looked directly at me. Initially, I got the sense the men would get angry at us, but his expression erased those assumptions. His eyes were bulging out, and his face, pale and stretched taut by his open jaw, was quivering. He shook his head and mouthed something incomprehensible at me.</p>\n\n<p>The second thing I saw was entity. It had stopped moving. It instead stood fixed in a reminiscent, ballerina sort of pose, with feet crossed and arms bowed out beside it. I could see what was left of Kathy’s face through the cloth of the sack, eyes glistening white through that painted red circle.</p>\n\n<p>You know Pippi Longstocking? We had a dance recital at ballet school, based on the books. I was Pippi’s understudy, and I knew all the lines by heart. I got to perform as her on the closing night. I don’t remember much of it now, but as a child it was one of my proudest memories.</p>\n\n<p>The entity was speaking to me on that dock, but not out loud or in my mind. It was like it had whispered, and I could hear it from far away, not unlike the sensation of a paintbrush on my ear.</p>\n\n<p><em>You’re a strong girl, Pippi. You’re the strongest girl in the world.</em></p>\n\n<p>It began to dance a new dance, a quicker one with more turns. I was so enchanted by the movement that I realized several seconds late that it was moving rapidly toward us.</p>\n\n<p><em>I want to see it. I want to see you lift a wagon. A boat. An iron cage.</em></p>\n\n<p>The next moment was a blur. I grabbed Vera’s hand and sprinted up the slow incline that led up to the village center.</p>\n\n<p>I only looked back once as we rounded the corner.</p>\n\n<p>The entity was standing where we had just been crouching, just thirty or so feet away, spinning perfectly on its toes like a doll in a music box.</p>\n\n<p>My mother scolded us when we returned to the Outing. The normal kind of scolding about tripping in the dark and hitting my head, or being kidnapped by strangers, or getting lost at sea. But she finished with a troubled look on her face. After the celebration, she gave me a cross to wear around my neck, and I kept it on the rest of my time at Mary’s Bluff. “My gift for that beautiful performance of yours,” she had told me, although later in life she’d say that, not being religious herself, she had no reason to ever give me a cross</p>\n\n<p>As for what happened to the cross necklace, I gave it to Vera to remember me by. She gave me Moby Dick. Beyond that exchange, we talked very little. Not once did we mention the docks. But the general dread was there, and we feverishly ignored it.</p>\n\n<p>She moved a week after the incident and, shortly after, so did me and my mother. The moving process is lost in my memory; I had slept so little that month that I was catching up in the long car ride to California. But when I woke, I was sure that what lay behind me was anything but a dream.</p>\n\n<p>No one can persuade me that Mary’s Bluff wasn’t real.</p>\n\n<p>Though I couldn’t find any evidence of its existence, I did run into all sorts of clues. I always refer to the Biblical Passover, an event in the book of Exodus where the ancient Jewish people protected their homes by crossing their doors in lamb’s blood. I also think about how witches during the American witch hunt were drowned to prove their guilt. Did the people back then have some precedence with that ritual, or was it just violent fearmongering?</p>\n\n<p>I read John Webster in college and, though probably unrelated to my investigation, his words are haunting to me:</p>\n\n<p>“Do you not weep?  Other sins only speak, murder shrieks out: The element of water moistens the earth, But blood flies upwards and bedews the heavens.”</p>\n\n<p>To be honest, at my age, I’ve lost all personal interest. I have a life that I need to live, goals I need to aspire to. I just want other people to hear my story once, to feel validated. Really, I don’t need anyone’s belief but my own.</p>\n\n<p>I just wish I could see Vera again. Sometimes I fantasize a life with her, adults now, but still like-minded as ever, but with no horrors dancing between us.</p>\n</div>\n","author":"Darumin"}