{"rank":"436","title":"Be Kind, Always Rewind","id":"8kjh61","url":"/r/nosleep/comments/8kjh61/be_kind_always_rewind/","time":"1526710038000","body":"<div class=\"md\"><p>This is a story from when I was younger. I normally never talk about it. My parents know the story, which led to the police knowing, and eventually, my psychologist.</p>\n\n<p>When I was twelve, I found a serial killer.</p>\n\n<p>I grew up in a small town that only had a video store and a few pawn shops. The video store would revolve owners and names every few months. I remember &quot;You-Rent-It,&quot; &quot;Movie Night,&quot; QuixRent,&quot; and a few others. Between changing hands, it would be shut down a lot. No matter what the name on the store was it had the same inventory, frozen from the late 80s.</p>\n\n<p>Instead, I had to rely on pawn shops for my movies. I loved movies, and I, at one point, wanted to be a screenwriter. I would devour whatever movie I could get my hands on--breaking it apart, studying it, and learning from it.</p>\n\n<p>The town I lived in had a lot of older folks, and they would dump their collection of movies at the stores. It wasn’t until I moved that I realized we treated them more like thrift stores, where people would sell junk for pennies, and someone else would buy them for a little more money.</p>\n\n<p>The one I visited frequently wasn’t too far from my home, and it was owned by a friend of the family. We called him Bubba, but I heard other people call him Eugene. He would let me rent movies from the shop if they weren’t too busy. He was a huge influence on my interest in cinema, and we would talk a lot about movies. He told me he worked on a few films, and I wouldn&#39;t stop asking him questions when he wasn&#39;t busy.</p>\n\n<p>I remember the day I found the first video cassette tape. It was Christmas time when I saw a copy of “Honey, I Shrunk the Kids.” It was rare for him to have movies that were released in the last ten years, so I instantly grabbed the copy. Bubba waved me off and said I can settle up when I returned it, if I let him know how it was.</p>\n\n<p>My bedroom was on the second floor on the opposite side of the house of my parents, who stayed in the master bedroom downstairs. I think they picked this arrangement, so they didn’t have to listen to me watching movies all the time.</p>\n\n<p>It was a Saturday night, and I stayed up a little later to watch the movie. I had popcorn and a hot chocolate, and I was wrapped in a blanket since it was chilly.</p>\n\n<p>After the trailers for some other movies, there was a weird trailer for something else. It was filmed using a camcorder, and it was showing parts of my town. It was completely silent. The 3-minute clip showed the camera walking through the woods near where we lived and stopping in the backyard of a house. You could clearly see into the windows, where a family of four were eating dinner. As the camera got closer to the house, suddenly almost jogging, the family seemed jolted by a noise in the opposite direction.</p>\n\n<p>Then, the clip cut off.</p>\n\n<p>The movie played exactly as normal. It was okay.</p>\n\n<p>The trailer didn’t really bother me at the time; I thought it was some new horror movie coming out. Trailers for the Blair Witch were coming out, though I guess it wouldn’t have appeared on a movie from the 80s. I went back to the shop to return the movie and talk to Bubba.</p>\n\n<p>“How was it?”</p>\n\n<p>“It was good. They had a giant ant as a friend!”</p>\n\n<p>“Too cool, kid, too coo—aw, Christ,” Bubba said noting the tape. “Someone marked on the sleeve. I hate when people ruin copies of movies like that.” He rubbed his thumb over a black circle—a perfectly rounded circle—on the side of the cassette. I remember exchanging that for another film, “Honey, I Blew Up the Kid.”</p>\n\n<p>Hey, I was a child; I had simple tastes.</p>\n\n<p>As Bubba marked the movie in the ledger, I pointed out the side of the tape.</p>\n\n<p>“That has a circle too.”</p>\n\n<p>“God… doggit” he caught himself as he remembered me. “I’ll have to order some sleeves. I’ll get on Tyler for not inspecting these better. Sorry, buddy.” I shrugged, thanked him, and took the tape home.</p>\n\n<p>Admittedly, by this point, I forgot about the trailer totally. Unfortunately, when I watched this movie, I realized it was a teaser for something much worse.</p>\n\n<p>The tape ran with the normal trailers and the movie—it was less okay. However, in the middle of the credits—which I always watched because I wanted to be in them one day—the screen went to static, and the same style of video as the trailer started.</p>\n\n<p>I could see four people in the scene: two were dead in the background while two others were tied to chairs, set at the dining room table. I knew it was at the house from the previous footage. One of the people at the table was an older woman, who clearly was the mother. She was sobbing through a rag stuffed in her mouth. The other was a boy younger than me. The camera was on a tripod facing them with the chair for the head of the table out of view.</p>\n\n<p>“Aren’t you going to ask me how my day went?” a voice from off screen asked. I heard a click like it was being filtered through a machine. “It was really bad… I did something to our kids. I killed one of them, Molly. It was all my fault.” A hand appeared from off screen and gripped the woman’s hand. “But, we will make it through this! We’ll fix this together. As a family. Little Roddy, you, Molly, and me. We’ll forget about whatever her name is. See! We are already moving on! Roddy, you get to be an only child now.” The hand tousled the tied up boy’s hair. “That means spoiling.” The voice took in a sing-song quality until the boy leaned back and began crying. “God dammit! Why must you ruin dinner time!” He shouted, his real voice almost breaking over the modulator. “I guess, I’ll have to find a better family.” The sound of a chair scooting out and hard boot falls boomed. The shadow of someone tall and forbidding came in the screen near the camera. The woman began to shriek through her gag, and the video cut off and returned to credits.</p>\n\n<p>I slept with my light on after that.</p>\n\n<p>I wanted to tell someone… anyone… what I saw, but I wasn’t exactly sure how. I also was afraid to bring it up and make it real. If I could pretend it was just some fucked up dream, then I knew I’d be able to forget about it.</p>\n\n<p>It took a few weeks, but I got over it. The further I got away from the experiences, the more I could pretend it wasn&#39;t happening. Trauma can short circuit an adult mind, and I was only twelve.</p>\n\n<p>After some time, I went back to the shop, and Bubba was excited when I walked in. He said some guy dropped off massive garbage bag of movies from the last five years. I was floored and started to forget my fears. He let me sift through it and take whatever I wanted, so long as it wasn’t R-Rated.</p>\n\n<p>I keep thinking of the millions of possibilities that could have gotten me to the point where I am now. Had I come later, had I picked other movies, just an infinite number of choices, and everything would be different.</p>\n\n<p>I could be dead.</p>\n\n<p>I saw “Honey, We Shrunk Ourselves,” and my hands were sweating and shaking. On the side of the tape, I saw a wet circle. Ink stuck to my fingers when I pressed on it. I nervously grabbed it and a few others.</p>\n\n<p>I waited until my parents were asleep, and then, I popped in the movie.</p>\n\n<p>There was nothing different until the midway point. The video went to static, and I could taste that metallic sensation of fear. The video started in a cabin or building made of wood. Outside was totally dark, far darker than the town usually got. A chair was shrouded in the dark, lit only by moonlight, and then, a candle was lit illuminating it better.</p>\n\n<p>Into the scene walked a man wearing a cloak that covered his body, and a mask that looked like it was a homemade version of the Beast from “Beauty and the Beast.” It covered his entire head. He reached up and pressed something under the mask. There was a whooshing sound like air.</p>\n\n<p>“I have been working for a very long time to get what most people fall into. I have gone through this life realizing the act that everyone subscribes to, and understanding that if I didn’t also become an actor, I wouldn’t ever find my part. This world is imaginary, and all of this is an elaborate theater. Every good theater needs a villain, so I realize that is my role. However, even bad villains have a family. Hitler had one. David Koresh had one. Jim Jones, Jeffrey Dahmer, Ted Bundy, Charlie Manson; they all had people who cared. I do not. So, I continue to use the theater to fulfill my duty to the act—to become the villain—so long as I can use the script to get what I want: a family.”</p>\n\n<p>The video switched to a vignette of scenes of various towns and cities.</p>\n\n<p>“I’ve looked a lot. I’ve found candidates.” The vignette showed the cameraman talking to women and children, shaking their hands, helping them with groceries.</p>\n\n<p>“But, then I learn we aren’t on the same side.” Then, the video showed the same people being bound and strangled with gloved hands. “I am running out of patience. I ran out of my soul. I need to make this happen.” The video shifted to my town. It showed the family I watched from the first two tapes being strangled, one-by-one, with their voices muted. Their eyes were wide, staring deep into the camera as the hands pressed hard enough to dig into their throats. “But, then, I found one of promise. One who is compelled and attracted to the pageantry and arts like me.”</p>\n\n<p>Then, it showed me walking into the thrift store. It showed me carrying videos and going home. It showed the outside of my window, filled with flickering lights and colors of the movies I was watching.</p>\n\n<p>“I know you well, my son. Don’t worry. Daddy’s coming home.” The voice said. I swear it sounded like it was smiling.</p>\n\n<p>I showed my parents, and they immediately called the cops. Who then immediately seized Bubba’s collection to find all the others like it. I told my therapist about it, trying to work out how to go on knowing I’d been stalked by this monster.</p>\n\n<p>They never arrested anyone, and it stayed out of the news because when they searched the house from the first two tapes they found no evidence of a murder whatsoever, and no one ever reported the family missing. By all accounts, they were still on vacation since their cards were being charged in Florida and other places.</p>\n\n<p>I tried very hard to forget it all happened, but I never could.</p>\n\n<p>Then, I got a VHS in the mail. It was addressed “My Son.” It was a copy of a movie called “Honey, I Am Coming Home.” On the spine, there was the black circle. I haven’t watched it because I don’t have the VHS, but I called the police. They are on their way to help. They promised me everything would be okay.</p>\n\n<p>“We are sending a car now.” The operator said. “You are safe. Everything will be okay again.” The voice paused. “We will be a family at long last.” The call dropped before I could say anything else. And now, I am waiting with a gun trained at the door, writing this to keep my mind at ease. Posting this with the hopes my story gets out there even if I don’t.</p>\n</div>\n","author":"IUsedToLikeMovies"}