{"rank":"44","title":"He changed his mind during the twenty sixth week","id":"8kjmmg","url":"/r/nosleep/comments/8kjmmg/he_changed_his_mind_during_the_twenty_sixth_week/","time":"1526712230000","body":"<div class=\"md\"><p>I was stationed on my post as the overnight patrol when I heard the ambulance roar a mile away from the hospital. I quickly knew from instinct that what it carried was in grave situation. The orderlies aided the two nurses inside the vehicle who then proceeded to rush the patient—then in tubes, casts, and wraps—to the ER.</p>\n\n<p>A taxi soon arrived in the same crashing noise and a family of three emerged. One of them was an elderly man who stomped briskly and inquired with the hospital aide if they could come see his daughter, the one brought earlier. By hospital policy they were asked to wait after the stationed nurse provided them with some darkly reassuring news.</p>\n\n<p>His daughter, an eighteen year old student, was seven months pregnant, and in a very dire situation at the moment—she and the child she was carrying. It was apparent that her family did not know about the conception and judging from what I saw earlier when the patient was brought in, I wouldn’t find out myself. There had been no bulge on her stomach.</p>\n\n<p>The graver news was that her boyfriend had tried to kill her and almost managed to succeed.</p>\n\n<p>Inspectors soon arrived and began their investigations. From their inquiries, it was found out that she had been locked up by her boyfriend for an entire two days in his apartment. There, he had first tried to convince her to kill the child inside her womb. After the patient’s repeated refusals, the guy had her strapped to the walls and gagged, and then subjected to psychological torture and beatings.</p>\n\n<p>“He suddenly changed his mind about keeping the baby when I was already twenty six weeks pregnant, but I never allowed him,” Rebecca sobbed when she was finally able to respond to the inspectors. “That was when he managed to trap me in his apartment and all this happened. He didn’t want to kill our child himself. David wanted to drive me to the point where I would decide to stab my own womb.”</p>\n\n<p>The hospital also discovered that for about three weeks before her admission, her boyfriend had been feeding her cockroaches and rat meat without her knowing. David had been making her stuffings and sandwiches from the vile. It was theorized that it was his subtle attempt to poison the child inside. And when none of it didn’t work, he locked Rebecca in his dormitory.</p>\n\n<p>For more than twenty hours straight, David had blasted his room with speakers; the sounds coming from which were a repeat of a woman being raped, a dog that was being cut alive, horses being drowned, and a laughing clown. One time, he took in a drugged prostitute and raped the same in front of Rebecca. After the failed psychological attempts, David proceeded to beat her with his fists and his clothes iron. She was eventually rescued when the apartment’s boarders complained about the noise.</p>\n\n<p>“She’s carrying the devil,” The news coverage of David’s trial showed. “I dreamt of it for nights. I’ve seen the end with my own eyes. If it weren’t true, then how would you explain the voices? Anyone? That woman is carrying the devil. If only I could kill it myself—“ He pleaded guilty and was sentenced to two counts of attempted murder, kidnapping, physical abuse, and other legalities I’d care to list down.</p>\n\n<p>Oddly enough, Rebecca and the child survived. A girl. I was there when they named her Pandora, from her grandmother.</p>\n\n<p>Oddly enough, the day Pandora was born in the hospital, one of my mates in the patrol found four mutilated bodies of children splayed on the parking lot. The janitors reported hordes of mice and cockroaches being found dead all around the grounds—one of the elderlies even confessed to witness a lone rat attempting to jump from the hospital’s windows before it suddenly quivered and fell dead on the floor.</p>\n\n<p>Another three days from her birth followed with a series of similarly bizarre occurrences. Flocks of clowns started arriving in ambulances due to random accidents, a stampede of hysterical farm horses from out of nowhere stormed the driveway and jumped down headfirst from the bridge, and almost the entire pack of dogs from the neighboring streets crowded the front lawn of the building, howling in succession for hours.</p>\n\n<p>Oddly enough, nobody asked questions.</p>\n\n<p>Pandora’s family and friends simply waved the events off. “It’s the 21st century, human beings. Someone will find a logical explanation.”</p>\n\n<p>If only David was still around.</p>\n</div>\n","author":"AdvancedAccounting98"}