{"rank":"165","title":"Two cups","id":"8kjnhv","url":"/r/nosleep/comments/8kjnhv/two_cups/","time":"1526712599000","body":"<div class=\"md\"><p>It all started when I woke up in the middle of the night, in the mood for some aggressive cuddling. When I went to wake my wife, Hannah, to see if she felt the same, I noticed that she wasn&#39;t in bed; our German Shepherd, Captain, was laying in her spot. I went looking for her, and found her sitting on the floor in the living room. All the lights are off, and she&#39;s sitting there staring into a big mirror, with a lit candle in front of her.</p>\n\n<p>&quot;Should I ask what you&#39;re doing?&quot;</p>\n\n<p>She jumped when she heard me.</p>\n\n<p>&quot;Damn it, I think I was getting close.&quot;</p>\n\n<p>&quot;Close to what? Is this another fetish?&quot;</p>\n\n<p>What Hannah was doing, she explained, was trying something she saw on Reddit, called dimensional jumping. The method she was trying was called the mirror method; you sit in front of a mirror with a candle, and stare at your reflection until you travel to another dimension. I couldn&#39;t help but laugh at the absurdity of it.</p>\n\n<p>Hannah was all the time trying stuff like this; Charlie Charlie, the elevator game, ouija boards. Nothing ever came from any of it, so I didn&#39;t really care. But with this, she kept insisting that it really worked, and that I should try it.</p>\n\n<p>Let me tell you a little about myself; I&#39;m a doctor, specifically an orthopedic surgeon; inserting pins to hold broken bones together, that kind of thing. I make about $300,000 a year. With that kind of income, it didn&#39;t take long to pay off my student loans. Hannah and I got married 2 years ago, bought a house together, and were discussing having a child. The reason I mention all this is because after several days of her suggesting it, I gave in and decided to try this dimension jumping thing.</p>\n\n<p>In addition to the mirror method, there&#39;s another called the two cups method. Basically you take two cups and label them; one with your current situation, and the other with the result you want. Fill the &quot;current situation&quot; cup with water, and pour that water into the other cup and drink it. As Hannah was preparing dinner, I label the two cups; one saying &quot;Life is good&quot; and the other one saying &quot;Everything goes to shit&quot;.</p>\n\n<p>&quot;Don&#39;t! Please. I know you think it&#39;s a joke, but trust me, that is a really bad idea.&quot;</p>\n\n<p>Since I was thirsty and holding a cup of water, it seemed like a good idea to me. Despite her protests, I drank the water. To my surprise and amusement, Hannah looked to be on the verge of tears.</p>\n\n<p>&quot;Hannah, stop being silly; nothing is going to happen. What are you cooking?&quot;</p>\n\n<p>She sniffles, &quot;Fettuccine.&quot;</p>\n\n<p>&quot;Well, I&#39;ll leave you to it.&quot;</p>\n\n<p>I went to my study to play Fortnite. In the middle of my third round, I heard a loud crash, and Captain started yelping. Rushing to the kitchen, I saw what happened; as Hannah was carrying the pot to the sink to drain the boiling water, Captain had jumped up on her, making her drop it and spill it all over him.</p>\n\n<p>By the time we got him to the vet, a large portion of his fur had fallen out, the skin underneath red and blistered. They sedated him right away, and said he would need to stay at the clinic for a while, and that we should go home. He died the next morning. Hannah was inconsolable; Captain was the grandson of a dog her family had when she was a little girl. Over the next week, I found Hannah several times watching old videos of Captain as a puppy and crying.</p>\n\n<p>I stayed with her as much as I could, but I had patients that needed my help. She slowly started returning to her normal self, getting a bit better every day. I couldn&#39;t help but get the feeling that she blamed me for Captain&#39;s death, even though she was the one who spilled the water on him.</p>\n\n<p>A former patient of mine came into the E.R. one day; he had fractured his tibia and fibula in a rock climbing accident and had to have a titanium rod inserted in his leg. He came in complaining of severe pain and swelling in his leg. When the nurses took an X-ray they found that one of the screws holding the tibial nail in place had not been properly secured, and had come loose. All costs related to his care were waived, and I was placed on administrative leave.</p>\n\n<p>A month later, things had more or less returned to normal, except the fact that I was still suspended; that changed when we were woken up in the night by the smell of smoke. It was seeping in under the bedroom door, thick and black. For some reason the smoke detectors hadn&#39;t gone off.</p>\n\n<p>Luckily, we were able to climb out the window, unharmed. The firefighters did what they could, but the house was beyond saving. The investigation showed that the power supply on my computer had overloaded and started an electrical fire.</p>\n\n<p>Then the day arrived where everything truly went to shit. Hannah and I were at this outdoor cafe, waiting for our food to be served. I kept trying to make small talk but she would only give one word responses, or no response at all. I quickly got fed up and slammed my fist on the table.</p>\n\n<p>&quot;If you got something you want to say to me, Hannah, then just say it!&quot;</p>\n\n<p>&quot;Fine, I&#39;ll say it! You just had to be an asshole, and do the two cups like that. Everything that&#39;s happened since then is your fault!&quot;</p>\n\n<p>&quot;You think me drinking a cup of water made our house burn down? And if I remember correctly, <em>you</em> killed Captain!&quot;</p>\n\n<p>She looked shocked, then her expression hardened; we stared at each other coldly. Any affection we had for each other was gone in that moment.</p>\n\n<p>&quot;Give me the car keys. I&#39;m going to get my stuff out of the apartment.&quot;</p>\n\n<p>I snorted. &quot;And go where?&quot;</p>\n\n<p>&quot;I&#39;ll stay with my brother.&quot;</p>\n\n<p>I threw the keys onto the table.</p>\n\n<p>&quot;Yeah, go stare into a mirror some more. Maybe you can travel to a dimension where you didn&#39;t kill the dog.&quot;</p>\n\n<p>She snatched the keys up and stomped to the car, slamming the door closed. Then she sped out of the lot and to the road, right into the path of an oncoming semi truck. It hit her on the drivers side, sending the car flipping.</p>\n\n<p>I rode in the ambulance with her, our argument completely forgotten. When we got to the hospital, the same one I worked at, Hannah was immediately rushed into surgery, where she stayed for the next nine hours. Sitting in the waiting room, I feared the worst; all I could think of was the last thing I&#39;d said to her, and how to explain what happened to her family.</p>\n\n<p>Finally, a nurse came out to update me, and my fears were realized: Hannah had suffered a severe skull fracture and despite the surgeon&#39;s best efforts, she was declared brain dead. I&#39;d been expecting to hear something like that, but what the nurse told me next floored me.</p>\n\n<p>&quot;There&#39;s a chance that the pregnancy is still viable. If you have power of attorney, then you need to decide if she should be kept on life support.&quot;</p>\n\n<p>Hannah had told me that if something like this ever happened that she didn&#39;t want to be kept alive. But she had always wanted children. I don&#39;t know if she would still want to be taken off life support when she&#39;s pregnant. What do I do?</p>\n</div>\n","author":"Alexander_Glover"}