{"rank":"8","title":"Know Thyself","id":"8kk2af","url":"/r/nosleep/comments/8kk2af/know_thyself/","time":"1526719432000","body":"<div class=\"md\"><p>Know Thyself, that’s the ancient maxim, it’s a pity I didn’t follow this sage advice. If I had, perhaps I would not have found myself in the predicament I was in for many years, I would never have wound up in a crappy job that paid peanuts. I would never have married a woman just because I accidentally got her pregnant and find myself trapped in a loveless marriage to a nagging slob who liked to mock me, bring up my failures and intentionally goad my kids into disobeying me.  </p>\n\n<p>But I’m getting ahead of myself, let me start at the beginning; I always wanted to be a cop, but I was unwilling to admit to myself that I was completely unsuited to the role of a police officer, so I did what many people who failed to get accepted to the police academy have done, I became a security guard. </p>\n\n<p>Security guarding is a lowly paid, lowly regarded job, in addition to potentially risking your safety for near minimum wage, you also often find yourself getting assigned various menial tasks that nobody else wants to do, i.e. a bunch of stuff needs to be moved but moving it is not really anybody’s job?, let the security guy do it, afterall, he is just sitting around, the garbage cans need to be moved? The security guard can do it. Afterall, it’s not like we are gonna make one of the suits demean themselves. </p>\n\n<p>Anyway, life trudged on at its tedious unpleasant pace, miserable job, asshole boss, asshole clients, nagging wife, bratty kids, I was living in my own personal hell. </p>\n\n<p>But one day I got assigned to a new site, night shift at a museum. I was actually quite happy to be offered the chance to work at the museum, I figured that it would be fairly safe compared to other sites a guard may be assigned to, and I always loved ancient history, the Greeks, The Egyptians, etc. I was looking forward to it. </p>\n\n<p>Like I said, I had been looking forward to it, but things soon turned sour. Remember earlier I said how guards often get assigned a lot of miscellaneous menial tasks? Well it was constant, help set up this display, help carry this stuff to the storeroom in the basement. Constant foot patrols up and down stairs to various floors. By nature I am a lazy and would rather sit on my ass, stare at the cameras and daydream. The constant movement and having to physically move things left me perpetually irritable and surly. </p>\n\n<p>But, there was one small solace. Between patrols, when I had down time, I could look at all the cool stuff, swords and armor from Rome, frescoes from Greece, Mummy’s from Egypt. But what really captured my attention was the wing devoted to Sumeria. Sumeria is the oldest known civilization, older even then Egypt, and to me seems darker and more mysterious. I would lose myself staring at the statues and the grave goods, reading the placards about the gods and the underworld.  </p>\n\n<p>I became particularly fixated on the statue we had of the deity Lamashtu. Lamashtu was a demon in Sumerian mythology who was said to terrorize populations by killing infants and women in childbirth, spreading sickness and disease plus infecting rivers and wells among other things. She also, if you sacrificed to her and worshipped her, would give her worshipers power and grant their desires. </p>\n\n<p>I always bowed when I passed her statue, that’s why she favored me at first, I think so anyway. Oh it took me a while to realize she was alive and not just a lump of rock. It started when I had a minor argument with Carlo, one of the night janitors who I had never gotten along with, he snapped at me for walking on the floor he had just mopped, I snapped at him for speaking to me rudely, it devolved into an argument, a few minutes later I later as I walked past the statue I bowed and jokingly asked Lamashtu to get Carlo out of my life. I continued my rounds and forgot about it. The next night I found out that Carlo had been hit by a car and was in a really bad way, he was going to be in hospital for weeks and would not be able to return to work for months, if at all. </p>\n\n<p>I felt no remorse and didn’t really think that Lamashtu had anything to do with it, but part of me couldn’t help but wonder, if I hadn’t asked her to remove Carlo from my life, would the accident still have happened? </p>\n\n<p>The next time I had to make my rounds, I again stopped in front of the statue and impulsively asked it to fix my life. I thought of all the shit that made miserable, arguments with my wife, arguments between my kids, my annoying boss. I asked Lamashtu to make it all go away. To give me the life I had dreamed of, instead of the one I had settled for. The night continued on uneventfully and I went home when my shift ended at 5AM. </p>\n\n<p>I knew something was wrong the moment I stepped in the door, not because furniture was out of place, not any more than usual anyway, and not because it was quiet, it was normally quiet when I arrived home. It was a feeling, a sense of foreboding that hung in the air, almost a presence.  </p>\n\n<p>I walked down the hall toward my bedroom, as I passed my kids rooms I decided to look in on them, make sure nothing was amiss. I stuck my head into my daughter&#39;s room and was greeted by the sight of blood. </p>\n\n<p>So much blood. </p>\n\n<p>She looked like she had been stabbed a million times, blood was everywhere, on the floor, on the walls, all over her, or what was left of her. My heart pounded at what felt like a thousand beats per second, I raced across the hall to my son&#39;s room, same scenario. </p>\n\n<p>Where was my wife? Was she dead too? I ran into our bedroom, she was lying in bed, no blood and no wounds though, in fact, nothing looked amiss, except one thing, I couldn&#39;t put my finger on it, and then it hit me, the stillness and silence. She was not snoring, she was not breathing, she was dead too, but she had not been killed the same way the children had, not at all. </p>\n\n<p>My heart racing, I ran out of the house, I vomited, called the cops, the next few hours were a blur. </p>\n\n<p>According to the detectives who investigated, the theory is that my wife had snapped, she had stabbed both of our children to death, drugging them beforehand so that neither would wake up when they heard the other scream. She then showered, washing all the blood of herself before overdosing on sleeping pills. A peaceful death for herself after the butchery she committed on our children. </p>\n\n<p>There was no note, no motive, but I knew, I knew the truth at that point; Lamashtu. </p>\n\n<p>I was given time off work, received an outpouring of sympathy, but eventually it was time to go back.  </p>\n\n<p>On my first night back, I waited until the last janitor had left so I was the only living human being in the entire building. I approached that statue, that terrifying evil visage with its stone-cold eyes. I did not understand how it &#39;worked&#39; was the statue itself sentient? Or was the demon some spirit in some far-off realm that could see and hear through the statue? I did not know, but what I did know was that something very powerful could hear me and understand me. It had taken away my wife and kids because of my idle words. </p>\n\n<p>I stood in front of the statue and I said the words that I had held in since that day I came home and found my wife and kids dead; Thank You. </p>\n\n<p>I was so happy that I did not have to deal with their squawking and squabbling anymore. No more nagging, no more arguments. The main source of my stress and misery were gone. The only other major source of stress was my job, and I think that’s going to improve soon.  </p>\n\n<p>Remember how I said I originally wanted to be a policeman? Well I made friends with one of the detectives investigating the murder-suicide. They often say it&#39;s not what you know but who you know. With my new friendship with him plus Lamashtu working in the background, I am going to reapply to the police academy, and I am optimistic that they will take me. Lamashtu will make sure they do. Afterall, I am now a devout follower. </p>\n\n<p>Still I live with regret, I mean, I regret not having a life insurance policy on my wife or kids. I could have really come out of this situation on top! But we can&#39;t have everything can we? Still I look forward to serving and protecting your neighborhood in the near future. </p>\n</div>\n","author":"cutterglut"}