{"rank":"607","title":"Stuffing","id":"8kka1s","url":"/r/nosleep/comments/8kka1s/stuffing/","time":"1526723116000","body":"<div class=\"md\"><p>Mark and I met at a book auction. We were both after a first edition Charles Dickens. I won, and Mark came over to congratulate me. I always thought it would be impossible to make a best friend in adulthood, let alone one as passionate about books as me, but I was wrong. Mark and I clicked immediately and went for coffee. We were like school girls chattering about our crushes, except our crushes were of the inanimate variety.</p>\n\n<p>From then on we were nearly inseparable. Every book fair, auction, or yard sale was our playground. We never went alone anymore. After five years of this, the line between our collections was paper thin. What was his was mine, and mine was his. Together we had a complete collection of many first editions, including Dickens, and we only had to spend half the price. </p>\n\n<p>Mark’s wife, Audrey, put up with our endless rambling time after time. Often taking her and kids out to lunch just to avoid the book talk, only to come home to a lounge covered in open volumes – and more than once. Mark and I loved to take them out just to inspect them. </p>\n\n<p>I often thought that if I wasn’t a man, and Mark wasn’t married, we’d have made a perfect couple. </p>\n\n<p>On April 25th, 2018, Mark and I arrived at a small swap meet in Cincinnati. We were on our way to a larger expo where a few of our grails were up for grabs, when we stopped in at the side of the road setup just in case. You never knew what was hiding in the trunk of a car.</p>\n\n<p>After half an hour of snooping our hope was faded. The only catch we spotted was an old chair, but we didn’t have the room. </p>\n\n<p>Mark and I split up to cover more ground, and then met up at the car ten minutes later. I was empty handed, but Mark had found something. An old cheap looking hard cover written in French. It was untitled, but inside was a hand scrawled note: Le subjugué/pt.1: bourrage.</p>\n\n<p>Neither of us spoke French, so I ribbed on him a little.</p>\n\n<p>“I couldn’t leave empty handed,” he admitted. “They looked like they could use the money, anyway.” </p>\n\n<p>We got to our motel at nine. The auction was tomorrow and we planned to get there as early as possible. We ordered take out, then got comfortable on our respective beds to watch TV. Soon, Mark pulled out the french book and began to flip through. </p>\n\n<p>“Je suis…” I said. “Je suis…uh, merde.” He didn&#39;t seem to hear me. He set it aside when the food arrived. </p>\n\n<p>City slickers played that night and we laughed until we cried, then it was lights out. I dreamed of a field of flowers. I was wading through it, trying to find something. But I couldn’t find it and became frustrated. Then someone called my name, and when I whirled around to see who it was, I woke up. </p>\n\n<p>I lay quietly for a while, unsure what about the dream had unsettled me, had made my heart race, when I heard the gentle rustle of paper. I looked to Marks bed. It was dark, but I could see a faint glow coming from his blankets. He was reading under the covers by phone light, probably to avoid waking me up. I smiled to myself, then went back to sleep. </p>\n\n<p>We headed for the auction early as planned. The place was everything we’d dreamt of and more. Mark was nearly bursting with excitement. </p>\n\n<p>We found our grails and patiently awaited their turn in the limelight, all the while ogling the books that were out of our reach. Some serious collectors were there, and they had deep pockets. We could only hope they didn’t bid against us. </p>\n\n<p>They did bid against us, and they won. We left with only three books, and none of them were what we came for. Still, we were happy. The journey had been fun, the time off work even funner. </p>\n\n<p>We decided though to make the trip home without stopping over night, mostly because Mark missed his family. It wasn’t easy, but we made it. I pulled up at Marks and we went in together. That moment was one of the best of my life. The kids rushed to meet us, and I felt like I was their father too. I know how crazy that might sound, but I’d always thought I was just that wacky friend of dad&#39;s to them.</p>\n\n<p>I stayed for dinner. We had roast chicken. It was amazing, which is why Mark surprised me when he excused himself from the table and didn’t come back. I went to look for him when his dinner started to get cold, and found him in his study, poured over that French novel. </p>\n\n<p>“It can’t be that interesting,” I said from the doorway. He didn’t react, barely even moved. “Mark, your dinner’s cold. Audrey demands an explanation.” Again, nothing.</p>\n\n<p>I walked to him. There was something about it – something I didn’t like. The way he was slouched there at his desk. The way his hands sat on either side of the book, totally still. I looked over his rounded shoulder, glimpsing the pages below him, when he suddenly slammed the book shut and turned his face up at me. </p>\n\n<p>“Out in a second.” He said with a slight smile on his lips. </p>\n\n<p>“Alright.” </p>\n\n<p>We stared at each other a moment. I chuckled, something I do when I’m nervous, but he didn’t react. He watched as I left the room, then asked me to close the door, please. I did. </p>\n\n<p>He came out not ten minutes later. It was the Mark I knew and loved, not the man I’d just met in his study. </p>\n\n<p>But my night was already dampened. I left early, kissing Audrey on the cheek – something I never do. She asked if I was ok. I said I was and she nodded, then she asked if Mark was ok. </p>\n\n<p>She’d sensed something. The same something I’d sensed. I said he was fine.</p>\n\n<p>I went home and slept. I was in the field again. This time a woman was saying my name. </p>\n\n<p>I awoke to knocking at the door. My heart sunk when I saw it was the police. </p>\n\n<p>They told me Mark was dead. And Audrey. And Hannah. And Kyle. Erik, the youngest, was in hospital being treated for shock. </p>\n\n<p>The next few weeks were a blur.</p>\n\n<p>The Harrington’s were buried together. Not Mark, though. He was buried alone, away from his family. I was one of only three to attend his burial. </p>\n\n<p>I couldn’t believe it. </p>\n\n<p>Couldn’t believe Mark had killed them. And that the chaos had begun soon after I’d left. Maybe even before I got home. While I was sleeping, Audrey was suffocating in the fridge. Hannah was in her toy chest, as was Kyle. They’d both been taped shut. The police had to cut them out. </p>\n\n<p>Erik had been put in the oven and the door had been taped as well. It wasn’t turned on. He passed out in there, and when he came to he began to scream. The neighbors heard him in the early hours of the morning. </p>\n\n<p>They thought Mark had run at first; they couldn’t find him. Soon enough the dogs did find him though – he was in the safe that sat in the corner of his study.</p>\n\n<p>I can’t imagine him in there. It barely came to our thighs.</p>\n\n<p>Erik claimed he couldn’t remember what had happened that night. He could only remember waking up in the oven. The police told me Audrey had bruises on her wrists, indicating a struggle. But other than that she was unharmed, so were the children. It’s as if she resisted for a hot second, and then decided to suffocate willingly, the kids too. </p>\n\n<p>Mark’s book collection arrived at my home yesterday. He left it all to me. I’d organised the same for him in the event of my death. Fresh pain welled up when I realized I had to change my will. </p>\n\n<p>I went through his books slowly, carefully. Many had handwritten notes we’d made together and ones he’d made long before me marking things of interest and importance. I cried sitting there surrounded by his things. I couldn’t think of him as a murderer. I just couldn’t. And then I picked it up – a familiar moss green cover. <em>Le subjugué.</em></p>\n\n<p>The day’s exploits washed over me. I laughed, it didn’t last long. The book felt… Cold. I looked at it for a long time. I thought of Mark reading it in the night – yes, he had been reading this book, I was sure. I thought of Mark reading it in his study. We’d rushed home to see his family. He’d rushed home to read. </p>\n\n<p>I turned over the cover to see the hand scrawled note. Then another page. It was a wall of text, handwritten in perfect type, foreign and unreadable to me. Yet I did read it. And I understood it. It was only one sentence, repeated over and over and over again, all 246 pages. j&#39;aime les petits espaces. j&#39;aime les petits espaces. j&#39;aime les petits espaces. j&#39;aime les petits espaces. j&#39;aime les petits espaces. I like small spaces. </p>\n\n<p>I put the book in the trash. I hate it. Yet I fished it out earlier and placed it with my other novels, because it deserves to be read. I don’t know why. When I did, I felt like crawling into the trash can. But it wouldn’t be good enough, not dark enough, safe enough. I don&#39;t want to be out here anymore. I feel disgusted out here. My fridge is small, but I think I could fit. </p>\n</div>\n","author":"harrydownto"}