{"rank":"58","title":"I am a germaphobe and I had to fly in a public airplane.","id":"8kkxbt","url":"/r/nosleep/comments/8kkxbt/i_am_a_germaphobe_and_i_had_to_fly_in_a_public/","time":"1526732388000","body":"<div class=\"md\"><p><a href=\"https://www.reddit.com/r/nosleep/comments/8kcl2x/paroxysmal_zombie_syndrome/?st=JHEVJ1M4&amp;sh=25b05f1b\">related</a> </p>\n\n<p>I’m terrified of getting sick. I caught the swine flu one time when I was little and I nearly died. After that incident my immune system has been permanently damaged and my doctor warned me that even minor illnesses could hospitalize me or kill me. Never again. After my close encounter with death I never went more than an hour or two without washing or sanitizing my hands in some way.  Whenever I am in public spaces I try to stay as far away from people as possible and to touch as few surfaces as possible. I even  wear a dust mask over my face especially on the metro and other forms of public transportation.</p>\n\n<p>I am paranoid about being sick. I want no part in it whatsoever. So you could understand that my first ever ride in a airplane was stressful to me to say the least. </p>\n\n<p>My brother was getting married and I hadn’t had a chance to see family in several years so I decided I to fly out of necessity.</p>\n\n<p>Security and the terminal itself immediately had me on edge. Crowds and crowds of people being in a relatively small area had me on high alert. My face mask was on before I even entered the building, so that comforted me somewhat. Boarding the plane was the worse part for me though. </p>\n\n<p>The plane was fairly large as far as I am concerned. 4 rows of 3 seats each went on and on down the plane. Oh and did I mention that my flight was going to be 8 hours nonstop? Yeah that is an important detail. </p>\n\n<p>Then I boarded and found my seat. Almost smack dab in then middle. I politely asked a flight attendant if my seat could be reassigned. The flight attendant said she would see if anyone would be willing to move. The flight attendant didn’t come back and I was forced to be seated in the middle row.</p>\n\n<p>We hadn’t even taken off yet when the coughing first started. A slightly overweight middle aged man began to cough and cough trying and failing to cough into his arms and hands. He stood up, a flight attendant told him that we were taking off and that he should be seated but he didn’t listen. He began to make his way to the middle of the plane where a restroom was located, coughing and yacking the whole time he walked. After almost 20 minutes the man left the restroom and began to make his way back to his seat, all the while still coughing on everyone unlucky enough to be in his path. Fortunately for me he passed on the aisle across from me, but he was still facing me so I managed to get a good look at him.</p>\n\n<p>His skin was pale white. The area surrounding his eyes was pink and irritated. Sweat dripped down his forehead. His hair and shirt were messy and he staggered as he walked. When he got closer I was able to hear his confused mumbling. No words were spoken just noises and syllables making a gurgling sound coming out of his throat.</p>\n\n<p>A flight attendant helped him into his seat and asked if he was alright. I heard his wife (I assume it was his wife) explain that he had the flu and that they’d see a doctor at the end of their flight. The flight attendant seemed satisfied but gave the man a mask similar to my own.</p>\n\n<p>The man must have fallen asleep for a few minutes because the coughing ceased for a few short minutes. Then abruptly he stood up and rushed to the restroom once more. For the few minutes he was inside, I began to hear more coughing. Several people had began coughing the same wet sick cough the man had been coughing.</p>\n\n<p>Minutes later, the man burst from the restroom and began to frantically move to the back of the plane. His face was blood red this time. His eyes were oozing dark red blood. His mask was stained from the inside with more blood. He reached his hands to his throat and began to gag as if he were choking. Seconds later he hit the floor with a violent slam. </p>\n\n<p>Someone quickly ran to the mans aide from the nearby seat. He began attempting CPR on the man. It was clear no progress was being made. His wife was holding her husbands nearly dead body and sobbing. In all of the confusion, his mask must have slipped off. His dust mask that was the only thing between the air we breathe and his infected lungs had somehow fallen off. The man continued CPR, but after only only a few seconds, blood erupted from the mans mouth and nose. The sick man then began to shake and twitch for about 30 seconds before finally going limp forever. </p>\n\n<p>The man who had attempted cpr and the sick mans wife were both covered in the blood from the sick man. They dragged the corpse to the back of the plane with the assistance of a flight attendant.</p>\n\n<p>Fear and panic were like a thick cloud in the air. Things really started serious when dozens of other people started coughing. </p>\n\n<p>Everything got out of hand so quickly, it was a blur. Where the first man took about 20-30 minutes to die plus the time he was infected before entering the plane, the people he coughed on started having seizures and vomiting blood all over surrounding passengers in 5 minutes or less. I ran past several people and went to the front staff bathroom and locked the door. In the next hour or so people banged on the door and begged to let be let into the cockpit. The final people left alive ended their begging with a desperate gurgle as they drowned in their own bodily fluids in a slow painful death.</p>\n\n<p>It was difficult to open the door to the restroom with so many corpses piling up in the wall way, but I managed to make a gap big enough to fit through. The sight of the passenger area was revolting. People piled up in the walkways were literally stacked on top of each other. Other passengers were still strapped into their seats in a pool of their own blood. I quickly removed my shirt to tie around my face for extra protection. I knocked on the captains cabin. </p>\n\n<p>“Don’t you realize what has happened? Land the damn plane!” I shouted through my face masks.</p>\n\n<p>“Don’t open the damn door! Stay back!” I heard someone shout from the other side of the door.</p>\n\n<p>“I’m not infected, but we will all die soon if you don’t land soon! Every single person on this plane is dead or dying!” I shouted back at him.</p>\n\n<p>I heard them murmur to each other before one of them responded. “We’re going to land in Atlanta. But you’re going to have to stay on board because you could be infected”. </p>\n\n<p>“What do you mean?! If I was infected I’d be dead by now! I’m covering my face with cloth and I don’t know if it will work for much longer. How long until Atlanta?”</p>\n\n<p>“We’re 10 minutes out.” They said, then they left me in silence.</p>\n\n<p>I decided that going back in the bathroom was probably the best idea so I didn’t have to be near the blood and corpses.</p>\n\n<p>We landed. I opened the door and looked towards the captains cabin to see the pilot and co pilot making their way out the emergency exit with a look of disgust and terror on their faces. </p>\n\n<p>“Stay the hell back!” They shouted at me.</p>\n\n<p>“We’re going to go get help and you need to stay here so you don’t get anyone else sick.” He said with a voice of authority. I followed them to the emergency door and inhaled a deep breath of fresh air. </p>\n\n<p>Within minutes 3 unmarked SUV’s arrive and men in biohazard suits made their way toward me. I was escorted to one of the SUV’s where I was closely examined and tested for about 30 minutes. </p>\n\n<p>The police showed up next along with several other government agencies. A few men in black suits came up to the pilots and they started talking. I watched in horror as the pilot covered his mouth as he coughed and the man in the black suit recoiled away. </p>\n\n<p>The suited man called for the biohazard team to detain them, but before they could reach the pilots, they were running towards the loading and unloading terminal. </p>\n\n<p><a href=\"https://reddit.com/r/yumkimilstories\">- D</a></p>\n</div>\n","author":"Its_YumKimil"}