{"rank":"26","title":"Angel","id":"8kl0ev","url":"/r/nosleep/comments/8kl0ev/angel/","time":"1526733477000","body":"<div class=\"md\"><p>I hung in the dark water like an angel. </p>\n\n<p>My chin above the surface, eyes open, all-seeing, all-knowing. I looked down to the murky depths where my vision failed and for the first time in a long time, it crept over me. The fear of what might be waiting just below.</p>\n\n<p>Something rough wrapped around my ankle, dragging me down. My skin chafed as I desperately tried to pull away. Water rushed into my mouth, burned my throat, filled my lungs. </p>\n\n<p>When I woke from the dream, miles from the lake, the warmth of the single bed did nothing to quell my shivering. </p>\n\n<p>I&#39;d slept early on purpose. I arrived at the forest, dragging the kayak behind me with one hand, the cooler held in the other, the oar tucked under an arm.</p>\n\n<p>As I broke out of the forest to the lake’s shoreline, I glanced around the clearing. The lake was empty tonight, a flat blue mirror in the evening light, surrounded on all sides by ancient woodland. I dumped the cooler on the bank and took out a bottle, swallowing a big gulp of beer. A lovely night, the lake all to myself, but I couldn’t get the nightmare out of my head. The feeling of drowning, of utter hopelessness as the waters closed over me…</p>\n\n<p>I finished the beer. Tonight would not be ruined by a bad dream of all things. This was my time alone, kayaking by starlight. I relished my weekend nights. </p>\n\n<p>I waded out to knee height, pushing the kayak ahead of me, and climbed in. I twirled the oar in one hand, reaching with the other for the red ribbon tied around the handle. As lucky charms go, it was cheaper than a rabbit’s foot.</p>\n\n<p>I paddled a lap round the lake. The kayak sliced through the water, responding to the slightest touch, turning at the lightest lean. In those blissful moments, it was hard to tell where I ended and the boat began. </p>\n\n<p>Evening passed away to true night. The cooler emptied. The final rays playing on the pastel lake faded to sables and greys. The air smelled fresh, like midnight.</p>\n\n<p>I stopped in the middle of the lake. I had the strangest feeling that someone was watching me. I scanned the tree line, but even in broad daylight it would have been hard to tell if anyone was standing there.</p>\n\n<p>Looking down at the dark waters, my insides twisted into a painful nervous ball. No matter how hard I stared, I couldn&#39;t see more than an inch below the surface. On any other night I would have laughed it off. </p>\n\n<p>Not far from my kayak, a ripple played over the surface. Too big to be a fish.</p>\n\n<p>I strained my eyes. Stared. The lake stared back. It won. </p>\n\n<p>I called out. No answer. Of course not. There was nobody here. Nobody but me. Was there?</p>\n\n<p>I almost missed the ripple, an inch closer now. There was no denying it anymore. My legs forced into flimsy, hollow plastic, drifting on thousands of litres of dark water, and I was not alone. </p>\n\n<p>The moisture fled from my throat. I couldn&#39;t swallow. I couldn&#39;t speak. A low moan escaped my lips. An animal keening. </p>\n\n<p>I dropped the oar and paddled with my hands, trying manically to get closer to shore. A rational part of my brain told me to stop, the splashing would only bring it closer. I listened. Froze. </p>\n\n<p>The kayak held me in place, trapped my legs. It felt like a grave. I would have screwed my eyes tight shut if I hadn&#39;t forced myself to watch for the ripples, closer and closer. </p>\n\n<p>I looked into the lake and tried to imagine how deep it was. </p>\n\n<p>I prayed to all the gods I&#39;d ever heard of to save me, save me, oh god, please save me. </p>\n\n<p>I saw movement in the murky water. </p>\n\n<p>I had a glimpse of something pale, rapidly rising through the water until-</p>\n\n<p>A torrent of freezing water drenched me. I covered my eyes like a child, hunched and whimpering. If I couldn&#39;t see it, it couldn&#39;t see me. If I couldn&#39;t see it, it couldn&#39;t see me.</p>\n\n<p>After long minutes I plucked up the courage to dart my eyes towards it.</p>\n\n<p>It floated beside me, a pale fleshy mound. A hand floated on the water’s surface, a head face down. </p>\n\n<p>I lifted her onto the kayak. Her sodden white frock, ripped and torn. Her pigtails, only one tied with a red ribbon. The ice-cold water must&#39;ve preserved her almost perfectly. Poor lamb. </p>\n\n<p>I walked my fingers down the soft skin of her leg, until I reached her bare ankle and naked foot. A length of rope had been roughly tied around her ankle; I found the frayed end. Rotting in the lake’s water, it had suddenly snapped. The stone had fallen away, and her body rose like an accusation from the heavens.</p>\n\n<p>Poor, beautiful girl. Her prayers went unanswered. There were plenty more rocks in the lake, and I had all night.</p>\n</div>\n","author":"TigerHall"}