{"rank":"59","title":"Just Another Day In Salem (Part 3)","id":"8kl28o","url":"/r/nosleep/comments/8kl28o/just_another_day_in_salem_part_3/","time":"1526734132000","body":"<div class=\"md\"><p>Part 1 is <a href=\"https://redd.it/8jpzzy\">Here.</a>  </p>\n\n<p>Part 2 is <a href=\"https://redd.it/8k4itg\">Here.</a></p>\n\n<p>“What!? Where?” Kristobol was wigging out, looking out the windows from behind the displays as if avoiding a sniper.</p>\n\n<p>I rubbed my temple. “No, not here-here. She’s nearby, somewhere in town. Looking for you, I’m sure. She’ll be here soon. We need to move, now. Let’s go.”</p>\n\n<p>We all went outside. Bethany and I left Kristobol to lock up Octal while we made our way to the Cauldron. It was sundown on a Tuesday in March so there weren’t many people on Essex. Even so, my eyes were darting around for trouble. “Walk slow and normal”, I told Bethany. “We don’t want to attract attention.”</p>\n\n<p>We managed to get to the Cauldron and inside without any trouble. I locked the door and hung the “Go Away, I’m Busy” sign in the window. Bethany took off her coat and stood near the back, looking around. “I always like coming here, Nat. It’s so, I dunno, homey. Ooh, is that a monkey skeleton?”</p>\n\n<p>I glanced where she was peering. “No, that’s a cat.”</p>\n\n<p>She continued to study it. “They look so different from the inside.”</p>\n\n<p>“Yeah, I suppose we all -” I never finished that sentence. The black light and crap taste came back, stronger this time. Denise was homing in. After it passed I shook my head and went to the herb rack, picking out a few things.</p>\n\n<p>“Did you sense her again?” Bethany asked worriedly.</p>\n\n<p>“Oh, yeah.” I crushed what I had picked out in the palms of my hands and breathed in the aroma. Immediately I felt better. “And she’s getting closer. I have a hunch we’ll have a visitor soon.” The crushed herbs I put in an empty coffee cup on the counter, for later use.</p>\n\n<p>“What do we do? Kristobol is on his way here.”</p>\n\n<p>“Maybe.” I brushed my hands clean. “I’d bet even money that he hops in his car and leaves town. Even if he comes here, he won’t show up for a while. We have some time.”</p>\n\n<p>“To do what?”</p>\n\n<p>There was a tap-tap-tap on the door. I looked and saw a young woman with a bit of a tomboy look smiling and waving at me. I half-turned to Bethany and said, “Negotiate.” Then I went to open the door.</p>\n\n<p>“Hi”, I greeted the stranger. “You must be Denise.”</p>\n\n<p>“The one and only. You must be Natalie.”</p>\n\n<p>“That I am. Let me guess – heard about me on the Octal podcast?”</p>\n\n<p>“Eric did have a lot to say about you. May I come in?”</p>\n\n<p>I stepped to one side. “Might as well.”</p>\n\n<p>“Thanks.” She stepped inside. I closed and locked up again as she said, “I have to say, I’m kind of surprised you’re helping Eric, given all the nasty things he said about you.”</p>\n\n<p>“Well, he did ask nicely”, I drawled as we walked into the shop. “But, truth be told, I’m not helping him. I’m helping her.” I pointed to the rear, and Denise turned to see Bethany in all her devil-girl glory.</p>\n\n<p>Bethany waved sadly and gave a quiet, “Hi.”</p>\n\n<p>“Oh”, Denise said with genuine sympathy. “Oh, hun, I’m so sorry. Has…has your tail come out yet?”</p>\n\n<p>Bethany scratched her butt. “It’s on the way.”</p>\n\n<p>“Get some aloe. It will help, I know.” She turned her attention to me. “So. I’m guessing we have some things to talk about.”</p>\n\n<p>“We sure do. Stating with how you’re going to turn Bethany back to normal.”</p>\n\n<p>Denise shook her head slightly. “Wish I could. I’m afraid the change is permanent.”</p>\n\n<p>My eyebrow went up. “Eric said you had the same problem. Yet, here you are.”</p>\n\n<p>“Yeah, about that.” She brought her hands up so we could see the rings on her fingers. On one was an engagement ring with an impressive setting. The other had a thick silver band covered in black etchings. She removed the later. Instantly her look faded from attractive tomboy human to infernal devil-girl, nearly the same as Bethany but for her full set of horns and tail. “This is the real me, now. I made this ring so I could be out in the world without the pitchforks-and-torches crowd bothering me. It’s a glamour.” She slid the ring back on her finger and immediately resumed her human form.</p>\n\n<p>Bethany looked a little weepy. “So, I’m going to be like this forever?”</p>\n\n<p>“Dunno. My family and I spent a year looking for a counterspell, no luck yet.” Denise smiled weakly. “Look at the bright side. You’ll save a fortune on footwear!” This only caused Bethany to make sad kitten noises. Thinking fast, Denise fished around in her coat pocket and produced a ring box. “Here. Why don’t you take this.”</p>\n\n<p>I took it from her hand. “Let me have a look first.” Opening the box revealed a ring identical to the one Denise was wearing, a silver band etched in sigils. “You brought a spare?”</p>\n\n<p>“For Eric. My plan was to use it as a lure to get him to come back home with me.” She sighed. “Look, I know this all seems kinda harsh, but think about what he’s done. He broke his vow to me, he offended my family, he stole one of our sacred texts! Then, he turns me into a walking Coop poster and runs away!” She crossed her arms with a huff. “You know, when he asked me out the first time, everyone told me he was bad news. But, did I listen? Nope!”</p>\n\n<p>I’d handed the ring box to Bethany. Then, it struck me what Denise had said “Wait. He told us you asked him out first, in the book shop where he worked.”</p>\n\n<p>Denise raised an eyebrow. “And you believed him? After all the stuff he made up about you on his podcast? That boy is a snake. He spent five years alienating everyone in Boise with his get-rich-quick schemes. He got fired twice from regular jobs because he was always shirking his duties. That book shop was the only place that would hire him, and that’s only because his cousin owns it. My parents were worried when I first brought him home, but he’s such a smooth talker, said all the right things, you’d think he’d been studying us. And, he had. I found out since that he’d been down to City Hall, looking up all there was about Daddy’s businesses. Don’t believe a word he says.”</p>\n\n<p>“But, you fell for it.”</p>\n\n<p>Now it was Denise’s turn to get a bit weepy. “Totally. At first he seemed like a perfect fit, but now? What a phony, and what a mooch.”</p>\n\n<p>Bethany put her new ring on. Instantly she was back to her old self. After a moment’s self-exam she began jumping up and down excitedly. “I’m me again! I’m me! Ow, itchy bum.” And she set to scratching again.</p>\n\n<p>“Yeah”, Denise said to Bethany, “it’s not real. Only seems that way to everyone else.” Then, looking at the floor, “Like Eric.”</p>\n\n<p>I was weighing the options. I had an adept with a legit grievance on one side, and a member of our community on the other. Only, he wasn’t a member, was he? Kristobol – Eric – had been living a lie since he came here a year ago. He was a fugitive. A con artist, and a bad one at that. And she was a woman scorned. We protect him, we risk a magical war with the followers of an old god. But that would never happen. No one in Salem would go to war for him, not after what he’d done. Furthermore, Denise did try to make amends for her mistake by gifting Bethany with the ring. The path was clear. I made my decision.</p>\n\n<p>“Okay”, I said after a moment, “let’s say you take Eric back with you. What assurance do we have that he won’t be carved up on a slab in your temple?”</p>\n\n<p>Denise was mortified. “We don’t do that. We never have. Why would you say that?”</p>\n\n<p>“Because Eric told us about the ritual, how he ran out when you brought a man in as the offering. He said what you did to him made him run for his life.”</p>\n\n<p>After a moment’s pause Denise did something I wasn’t expecting: she laughed. “Oh, for crying out loud! He is such a drama queen. He ran out because he’s afraid of needles. The guy we brought in was a new initiate. He was being ritually tattooed, as Eric was supposed to be that night. All the male members of the church get the mark of our god tattooed on their, um, their…” She gestured to her lower torso. </p>\n\n<p>“Their wee-wee?” Bethany asked, wide-eyed.</p>\n\n<p>Denise nodded. “Yeah, that. Look, we’re a fertility cult. Our god is a god of the harvest. Of course he’s gonna want his priests marked down there. And in our rituals the High Priest and Priestess drop their robes and do the nasty in honor of the god.” Bethany gasped as Denise continued, “There’s no need for human sacrifice. We grow potatoes, for crying out loud.”</p>\n\n<p>“Fine. So, what happens if you take Eric back to Boise?” </p>\n\n<p>“Well, I promise you he won’t be hurt. But, he did pledge himself to the god, and the god will hold him to his promises. If he can’t fulfill his duties as the future High Priest of the cult, then…other arrangements will have to be made.”</p>\n\n<p>“That was an ominous pause.”</p>\n\n<p>Denise held up her left hand to show her engagement ring. “He also made a promise to me, and I’m going to hold him to it.”</p>\n\n<p>“You want that? To be in a loveless marriage to a man you can’t trust?”</p>\n\n<p>Her face grew set, resolved. “Like I said, arrangements will be made. I have my obligations as well. Let’s just say this – next time you hear from me, I’ll say the phrase ‘Pink Flamingos’ to you. Remember that.”</p>\n\n<p>Bethany thought on it a moment. “I don’t get it.”</p>\n\n<p>“Boise, Idaho?”</p>\n\n<p>I shrugged. “Nope. You lost us.”</p>\n\n<p>“Well, it doesn’t matter. That’s what I’ll say.” There was a knock at the door. I peered around the shelves to see Kristobol – soon to be Eric from Boise once more – standing at the window, clutching a small leather book. </p>\n\n<p>“Showtime.” Denise stepped back from view and removed her ring.</p>\n\n<p>I let Eric in and locked the door behind him. He was all in a huff as he walked into the store. “Oh, man! I was so worried that Denise was going to be here, waiting for me.” He looked at Bethany, seemingly human once more. “Bethany, you’re normal again? How did you do it?”</p>\n\n<p>That was when Denise, devil-girl Denise, emerged from the alcove she had been standing in. “Hello, lover.”</p>\n\n<p>They must have heard Eric’s shriek down at the Hawthorne.</p>\n\n<p>A few months later I got an email with a link to a video of their wedding. It kind of baffled me. There was Denise, looking surprisingly timid in her elaborate wedding dress, while Eric, clean-shaven and dressed in a designer tux, leaped about in confident happiness. After about a minute of montage from the ceremony and reception there was a close-up of the happy couple looking into the camera. Denise looked like she wanted to be rescued, while Eric looked right into the lens, gave a wink and said, “Hey, Natalie! Pink Flamingos!” Then he laughed as the video ended.</p>\n\n<p>I sat there a moment in confusion. Why did <em>he</em> give <em>her</em> secret phrase? She said it would be her who would say…damn. I understood in a flash. She had kept her promise. Nothing happened to Eric because she needed him in top condition, that is, she needed his body in top shape. Because she needed his body. Soul transference. Damn, that girl had powers.</p>\n\n<p>“Welcome to the Monthly Club, Eric”, I said to myself. “You’ll make a great High Priestess.”</p>\n\n<p>Bethany came out from the back room, wearing her new ring and old face. I’d hired her when Octal closed. Turned out she was great with the customers and a boon for my business. She saw what I was watching on my tablet. “Oh, is that the wedding? Can I see?”</p>\n\n<p>“Here”, I said as I handed her the tablet. “Have a look.”</p>\n\n<p>Bethany watched the video, then sniffled a bit. “Aw, I love happy endings!”</p>\n</div>\n","author":"TheAncientMarinade"}