{"rank":"11","title":"Blue Veins","id":"8kl27b","url":"/r/nosleep/comments/8kl27b/blue_veins/","time":"1526734116000","body":"<div class=\"md\"><p>I’ve thought about it constantly for the past fortnight and I’m not any closer to tracking down the moment when this started. Or how it started, for that matter. I’ve spent hours poised like a mannequin over my desk at work, absently staring at the chalky, woven material of my cubical divider until my eyes burned. Thinking about how it started has become an obsession. Thinking about how it started means I don’t have to think about how it will end. </p>\n\n<p>I guess I thought I’d been depressed for a few months. I hadn’t been sleeping well; the world seemed distant from me, and I felt keenly aware of my otherness. My boss eyed me warily over the edge of the divider and reminded me about the copy due on Thursday. I started at the sound of his voice, blinking and nodding furiously, but I couldn’t think of a word to write about anything as banal as contemporary furniture. When I took the tube, the commuters voices blurred into an incoherent buzz, their laughs muffled. My fridge got emptier. None of this concerned me much. I wasn’t feeling much of anything at all. Then, one evening, I noticed. It registered. That feeling of horrifying realisation crept over me like a hot, prickly blanket and filled me with a deep, unsettling feeling of dread. </p>\n\n<p>It’s a short walk between the station and home. It was late. The street lamps had painted the world a murky orange by the time I passed the string of shops around the corner from my flat. Their dark windows reflected my lonely figure and the row of terraced houses across the road. This dog was barking at me. It was barking so loudly and fiercely I began to feel uncomfortable, it’s terrible maw speckled with foam as white as the visible edges of its eyes. It strained against its lead, which was looped around the lamppost on the corner ahead of me. I slowed. I edged around the dog, eyes fixed on it. I backed towards the road intending to cross, but I couldn’t look away from that snarling, wet mouth. I stepped backwards off the curb and fell, stumbling for a few seconds before landing on my arse. I never took my eyes off that dog, scrambling to my feet and running the last 50 yards to my flat, hearing the barking fade into the distance. Only when my shaking hands raised the key to the door did I see the broken glass shard jutting from my palm, reflecting the orange glow of the street lamps into my eyes. It looked deep, but it didn’t hurt. In my shock I could barely feel it and resolved to sort it out once I was safe in my house, taking one last uneasy glance back towards the dog before turning the key and slipping into the dark hallway. </p>\n\n<p>I sat on my sofa with a bowl of warm water, some gauze and a bottle of TCP on the glass coffee table in front of me. I brought my palm to my face, studying the wound and preparing to remove the glass. It did look deep, the edges already puckering. This was going to bleed everywhere. I held my left hand over the bowl, gripped the glass with two fingers, braced, and pulled. It slid out without much force, gently tugging at my palm. I let the air rush out of me, unaware I’d been holding my breath. It hadn’t been bad at all, barely felt a thing. I dunked my hand into the bowl, preparing for the gush of red - but nothing came. I lifted my palm. The incision was clearly visible, whitened edges, almost 2 inches long. The piece of glass I removed had been a half inch deep; there should be blood. I felt my heart rate quicken. I wiped the wound with TCP-soaked gauze, my face contorting into a frown - not because of the antiseptic sting, but because of the lack thereof. I still felt nothing. Bringing my palm back towards my face, I prised the edges of the wound apart. I felt twisting in the pit of my stomach when I looked into that deep, bloodless wound and jerked my hand back as if it was hot. My head was swimming, my heart painful in my chest. Why wasn’t I bleeding?</p>\n\n<p>I poured myself a gin and sat back on the sofa, trying to regulate my breathing and staring at my hand, palm up on my knee. The wound opened and closed as I flexed my thumb. I still hadn’t felt any pain, and I searched my brain for the last time I’d hurt myself. I broke my arm when skiing a couple of years ago, that certainly fucking hurt. I was sure I’d cut myself at some point - everyone gets a scratch or a graze every now and again. But I couldn’t remember any recent occasion when I’d bled. I pulled open the wound again, staring at the whitish pink flesh inside, deep into my hand, clean as a drained corpse. I shuddered. It was unnatural. I needed to see myself bleed. </p>\n\n<p>The rest of that night and early into the morning was spent making small, deep incisions into discreet parts of my body and examining them. My stomach, my thighs. My chest. The soles of my feet, my upper arms. I felt no pain, and not a single drop of blood bloomed from the wounds that looked to me like cuts into plasticine. I began to feel dissociative. As dawn broke, in anguish (and somewhat impulsively) I drew the razor across my wrist, hard and fast. The empty gash looked like a ghastly smile. A small, strange laugh escaped my mouth. It didn’t sound like me. I studied my arms; no hint of the blue lines that once ran from elbow to finger tip.</p>\n\n<p>I called in sick to work that day. I fingered the edges of my wounds and wondered what had happened to me. How could I be alive? I had been feeling empty for a while, but I couldn’t recall any strange experience, nothing out of the ordinary. I hadn’t been exposed to anything dangerous, bitten by anything wild. Not to my knowledge. I’ve spent my time in the office, in the flat and travelling between. I guess I had a social life before that... it feels like a really long time ago. </p>\n\n<p>That was about 2 weeks ago. I went back to work the next day, but I haven&#39;t got a thing done. Deadlines are piling up. I hear whispering that turns to silence when I walk into the room. My boss is becoming agitated. At first, I thought about nothing but how this happened to me. Like I said, it stops me from thinking about how it will end. But now, I keep thinking about the blood. Where is the blood? &#39;If I could just feel it&#39;, I think. My fingers prod into an open cut under my shirt sleeve. I stare over the divider at the girl next to me. At her blonde hair against her pale neck. If I look hard, I can see a blue vein pulsing under the fluorescent lights.</p>\n</div>\n","author":"4fuxache"}