{"rank":"458","title":"I think my grandfather might be a serial killer. Part 11 of 12.","id":"8kl3aj","url":"/r/nosleep/comments/8kl3aj/i_think_my_grandfather_might_be_a_serial_killer/","time":"1526734495000","body":"<div class=\"md\"><p><a href=\"https://redd.it/8epbdy\">Part One</a>  </p>\n\n<p><a href=\"https://redd.it/8fg0wx\">Part Two</a>   </p>\n\n<p><a href=\"https://redd.it/8g3t9k\">Part Three</a>   </p>\n\n<p><a href=\"https://redd.it/8gmv5o\">Part Four</a>   </p>\n\n<p><a href=\"https://redd.it/8h7vaz\">Part Five</a></p>\n\n<p><a href=\"https://redd.it/8hjvu5\">Part Six</a></p>\n\n<p><a href=\"https://redd.it/8htpr5\">Part Seven</a></p>\n\n<p><a href=\"https://redd.it/8i5k72\">Part Eight</a></p>\n\n<p><a href=\"https://redd.it/8ivfxi\">Part Nine</a></p>\n\n<p><a href=\"https://redd.it/8jnl02\">Part Ten</a></p>\n\n<p>&nbsp;</p>\n\n<p>I know it comes as a shock, and yes, I’m sure I really do have a seed in me.  Let me explain.</p>\n\n<p>&nbsp;</p>\n\n<p>I’m 77 years old, and I’ve been at this since I was 45.  It’s a long time to do anything, much less something this dangerous.  And like I’ve told you, the key to being successful is in being smart and careful.  If you are having to actually fight an outsider, even in human form, you’ve already made one or more serious mistakes.  Just because they aren’t physically enhanced when they look like the people they’ve overtaken doesn’t mean they aren’t dangerous—just like a normal human, they can hurt and kill you.  And bear in mind that the mind powering that body isn’t the same mind as the person it inhabits.</p>\n\n<p>&nbsp;</p>\n\n<p>These beings aren’t perfect.  They can be tricked, they can make mistakes, and they can be outsmarted.  But they are very intelligent and very ruthless.  They do access and utilize the brain and the memories of the person they inhabit, and it seems from my experience to have some impact on their behavior—how they talk even when the mask of emotion is gone, for instance, or how they might go about accomplishing their individual goals.</p>\n\n<p>&nbsp;</p>\n\n<p>My point is that they are always a threat, regardless of their form.  And even when things go well, which they don’t always, there is always a physical component to this kind of work.  Being stealthy, carrying equipment and bodies, fighting or running when something goes wrong.  It takes a toll.</p>\n\n<p>&nbsp;</p>\n\n<p>In the first five years of hunting these things, I lost thirty pounds of fat and gained twenty pounds of muscle.  Some of that is I made a point of exercising more to improve my odds against them, but most of it was just the work itself.  In some ways, I was healthier in my late forties and early fifties than I had ever been in my life.</p>\n\n<p>&nbsp;</p>\n\n<p>But by the time I hit my early sixties, I could feel things starting to slide back the other way.  I would give out of breath easier, and I could feel myself getting a little weaker over time.  If I got hurt, it took longer for me to come back from it, and my joints weren’t as limber any more.  Now I’d estimate I was still well above average for someone that age, but most people weren’t doing the kinds of things I was doing either.   And while it concerned me some, it wasn’t unexpected.  All I could do was mitigate the effects of aging as best I could and keep working on improving how I did my work.</p>\n\n<p>&nbsp;</p>\n\n<p>Then one day, I got sick all of a sudden.  I was in a grocery store and I felt a wave of nausea and dizziness overcome me.  I would have fallen if not for the shopping cart I was pushing.  I stood there gripping that cart for support for long enough a couple of different people asked if I was okay.  I was able to reassure them and eventually get moving again, but I had to give up shopping and head to the car.  By the time I was cranking up, it had faded somewhat.  I still felt bad, but I was okay to drive.  So I drove home, drank some water, and went to bed.</p>\n\n<p>&nbsp;</p>\n\n<p>I woke up twelve hours later, and my first thought was to get a feel for how I was doing.  Was there any sign of weakness or nausea?  Of fever?  But no.  Not only did I not feel bad any longer, I felt great.  I got out of bed easily, and as I cautiously tested myself, I could tell that I had none of the aches and pains that I would have normally expected after being in bed so long.  </p>\n\n<p>&nbsp;</p>\n\n<p>Over the next few days, the feeling of wellness and strength only grew.  My endurance was better than it had ever been and I could lift as much as when I was twenty-five.  I knew this was all abnormal from the start, and I considered that a seed could have been implanted from an early stage, but you have to understand that I was trying to be cautious.  I was monitoring myself very closely, and so far I wasn’t seeing any negative side effects or indications of anything usurping my control.  </p>\n\n<p>&nbsp;</p>\n\n<p>Plus, seeds didn’t make outsiders physically stronger or better in their human form.  When I began to worry more about the possibility I had one implanted in me, that was the fact that I could always return to as a way of assuaging my fears.  Or rationalizing them away.  Because I admit I didn’t want it to be a seed, and I didn’t want the way I felt to go away.  It was easier to just keep enjoying the benefits and keeping watch for any trouble rather than getting a definitive answer.  I had already learned I could detect seeds with an MRI, but when the thought of testing myself would periodically arise, I would always have an excuse for delaying it, waiting until I had gathered more data.  I was being foolish and selfish, trying to lie to myself and doing a poor job of it.  But then I got shot in the chest.</p>\n\n<p>&nbsp;</p>\n\n<p>While I’ve had several encounters with the House of the Claw over the years, today was only the fourth time I actually had real combat with them.  The first time was when I was in my fifties, and the second time was a short time later with the remainder of the first group, which taught me the importance of killing an entire cell when you can.  The third time was about six months after I had gotten sick in the store and woke up the next day feeling so much stronger.  I had hunted down two outsiders in that six month period, but the second one had a group of the House that were serving it—which I learned a few days later when they ran me off the road.</p>\n\n<p>&nbsp;</p>\n\n<p>There were only four in that cell, and the first two I actually managed to run over with my car by playing possum when they approached to see if I was dead.  The third started to run and was actually shot and killed by the fourth as some kind of weird cult court-martial.  Then he turned the gun on me.  </p>\n\n<p>&nbsp;</p>\n\n<p>My gun had gotten dislodged from its normal place behind the passenger seat somewhere between my getting run off the road and turning the two House guys into speed bumps.  The fourth member was too close for me to search for the gun and at a bad angle to try and hit him with the car, so my thought was to reach him with my baton before he turned his attention from the cohort he was murdering back to me.</p>\n\n<p>&nbsp;</p>\n\n<p>I almost made it.  I was raising the baton to bring down on his arm when he turned and fired into my chest.  His aim wasn’t perfect, but it was good enough.  The bullet perforated my right lung and went out my back, chipping a rib along the way.  I spun from the impact and had the presence of mind to keep turning, whipping the baton into his face as I drew even with him.  It struck him with a wet and meaty crunch that dropped him immediately.  I fell the next moment, my chest burning painfully with each breath.  I knew I likely had only a short time before my lung started collapsing, so after making sure number four was dead, I headed back to my car and started trying to find the duct tape.</p>\n\n<p>&nbsp;</p>\n\n<p>When you get shot in the chest, one of the biggest risks you face is your lung collapsing.  This can be caused by outside air coming through the hole which stops your lung from being able to expand.  This is called a pneumothorax.  Another way is that if the area around the lung fills with blood, again it can’t expand.  This is called a hemothorax.  Either one can cause you to slip into unconsciousness and die.</p>\n\n<p>&nbsp;</p>\n\n<p>I needed to get to a hospital, but first I needed to do what I could to slow down any collapse.  Taking off my shirt, I layered strips of duct tape to make a bandage for my back wound and then for my chest wound.  After applying the back bandage with some difficulty, I took an empty ball-point pen barrel and inserted it into the bullet hole on my chest before sealing and securing it with the remaining strips of tape.  The idea is the same as a needle decompression.  You’re giving the air outside your lungs somewhere to go so you can continue to breathe.  The problem is that what I had done would only help a pneumothorax, particularly when I still had to be upright and driving.  My chest cavity and lung could still be filling with blood and kill me just a quickly.</p>\n\n<p>&nbsp;</p>\n\n<p>I started towards the nearest hospital, but I knew it was over twenty minutes away even if I drove fast, which I wasn’t capable of doing.  I could feel myself getting weaker and every breath was painful, to say nothing of the gunshot wound itself.  I kept driving as I tried to think of better alternatives to my current plan, and as I went I realized I was feeling better.</p>\n\n<p>&nbsp;</p>\n\n<p>At first I thought it was my imagination or the onset of physical shock, but as the minutes passed, I could see tangible improvements.  The pain was fading and I wasn’t having problems with my breathing.  Finally I pulled over and carefully removed the pen barrel and tape from my chest.  The hole actually looked smaller and wasn’t bleeding any more.  I gingerly reached back to where the bullet had exited and peeled away the tape.  When I probed with my fingers I found tender but untorn flesh.</p>\n\n<p>&nbsp;</p>\n\n<p>I started driving again, still headed toward the hospital at that point.  My mind was swimming, and I was already chastising myself for not having looked into what was happening to me more.  For not finding out if I had been compromised by a seed or some other outside influence.  I promised myself that if I survived this I wouldn’t turn a blind eye for convenience’s sake ever again.</p>\n\n<p>&nbsp;</p>\n\n<p>When I reached the hospital parking lot, I looked at my chest again.  It was completely healed.  I had no pain or problems that I could tell.  Instead of going in I went to my own office and ran tests.  I had just started leasing an MRI machine the year before, both for my medical work and my after hours studies, and it didn’t take long for me to find the dark speck lodged in the deep folds of my left temporal lobe.</p>\n\n<p>&nbsp;</p>\n\n<p>I could have done a lot of different things at that point.  Killed myself or try to have it removed being two obvious choices.  I struggled with the decision and what it meant if I stayed alive and left the seed where it was.  My reasoning was ultimately based on a few assumptions.</p>\n\n<p>&nbsp;</p>\n\n<p>First, it seemed clear that I had been targeted for a seed, because as we discussed before, the odds are far too great to make it likely I got selected for one by chance.  But that would mean that they know about me to some extent.  Yet I’ve never had someone assault me at work or home, or track me down other than in response to specific actions I took, such as killing an outsider associated with a House cell.  Attacks against me seemed to always be about what I had done, not some greater knowledge of who I was or what I had done in the past.  Now that was still a guess.  They could have reasons for not attacking me at times while knowing everything about me, but my suspicion was that they targeted people by some means independent of knowing a name or specific address.  My experience since then has continued to bear that out.  It’s almost instinctual I think, though that instinct is propelled by intellect and purpose.</p>\n\n<p>&nbsp;</p>\n\n<p>Second, I knew that my newfound strength and resiliency wasn’t normal for those that received a seed.  Setting aside the possibility of getting a different kind of seed than most or having some unique property in and of myself that changed the seed’s effects, both of which seemed unlikely all things considered, I found the most likely answer was Salk’s blood.  Even if they had invaded thousands of people, the odds of any of those having ingested and been altered by an outsider’s blood prior to receiving the seed was very unlikely.  I couldn’t question that Salk’s blood had irrevocably changed me.  Even long after his blood should have faded from my system, I retained and even further developed my ability to sense outsiders.  It seemed likely that however it permanently changed my body also afforded me some level of protection from the seed and granted other benefits as well.</p>\n\n<p>&nbsp;</p>\n\n<p>Third, I assumed that the outsiders themselves or whoever they call master did not realize this would happen.  I saw little benefit for them in making someone like myself stronger and harder to kill.  If that was correct, it was a sign of their fallibility.  And it gave me hope that I could use their attempt to punish and subjugate me against them.</p>\n\n<p>&nbsp;</p>\n\n<p>For years that’s exactly what I’ve done.  All the time keeping a close check on myself for signs that I was changing or being taken over.  For the longest time I saw none.  But about three months ago I started having strange dreams.  It started sporadically, but then it became a nightly occurrence.  </p>\n\n<p>&nbsp;</p>\n\n<p>Then a few days ago I noticed myself having odd thoughts.  You have to understand that whatever my mistakes in all of this, I have truly tried to remain responsible and have trained myself to be hypervigilant to any signs of a problem since getting the seed.  Part of that has been examining my internal self, going into my inner dark and finding the person who lives there, coming to know them well.  </p>\n\n<p>&nbsp;</p>\n\n<p>I know my thoughts, and some things lately…it’s not me.  I haven’t lost control, not that I can tell, but I can’t continue on like this any longer.  It’s too great a risk to everything I care about, including you.</p>\n\n<p>&nbsp;</p>\n\n<p>I’ve made friends over the years.  Some are people I have helped, others are on the inside of this thing like I am and…well, like you are now, at least to some extent.  One of those friends is a doctor.  Not a surgeon really, but I helped save his daughter a few years back and he owes me.  He knows enough and I’ve told him enough that he can do the procedure I’ve taught him to remove the seed from me.</p>\n\n<p>&nbsp;</p>\n\n<p>I’ve never done this procedure on someone before, and I have no way of knowing if it will work.  One of several things will likely happen.  One, he will be able to extract the seed with minimal brain damage and no fracture of the seed.  If that happens, I will likely live and be okay.  Two, he will extract the seed intact but it will cause significant brain damage, either killing or severely impairing me.  That is not my favorite outcome.  Three, he will fracture the seed during extraction and I will get transported either alive or dead to wherever these things come from.  Hopefully dead, because I don’t think they will greet me warmly.  Four, the seed will react to being extracted and either take me over or kill me.</p>\n\n<p>&nbsp;</p>\n\n<p>Now, there is another possibility in all this.  Given our history, I think it’s unlikely, but I can’t rule it out.  If my doctor friend Prakesh has been gotten to…he may try to kill me while I’m under.  In that event, or if the seed does start taking me over, it would be useful to have an insurance policy.</p>\n\n<p>&nbsp;</p>\n\n<p>As I can tell, you’ve already guessed that I’m talking about you.  This is nothing you have to say yes to, and I hate the idea of putting you at more risk than I already have.  The procedure isn’t going to be for four more days, so you have time to decide in any case.  My original plan was to help you finish sorting out your folks’ stuff and then come have the procedure on my own.  If I didn’t make it, well, I got to spend some time with you and you would hopefully have some good final memories of your grandpa.  </p>\n\n<p>&nbsp;</p>\n\n<p>But things never work out quite like you plan.   Your knowledge and involvement today opens up a new possibility, but one that you need to seriously consider before you decide what you want to do.  If you say no, I’ll spend the time I have with you now if you’re willing, and I can always look you up later if things go well.  If things don’t…well, we’ll discuss contingencies before you leave if you decide you want out.  If you say yes, then you have to commit to it for not only my sake but yours.  I can’t have you in a dangerous situation that you aren’t prepared for.</p>\n\n<p>&nbsp;</p>\n\n<p>What I’m saying is, if you decide to stay and help, you have to be ready to kill my friend.  You have to be ready to kill me.  You need to think about it for awhile before you answer, because this hole only goes deeper and darker the further in you go.  I think I’ve done some good in my life, but I have no illusions about who its made me, or more accurately, what its brought out in me.  I’m a killer, and that’s not an easy thing to face and live with for a lot of people.  It’s up to you to go into your inner dark like I did and find the person that’s waiting there.  See what they are and aren’t capable of living with, and if you can embrace that. </p>\n\n<p>&nbsp;</p>\n\n<p>Just remember that when you really find them, past all the bullshit and self-deception, you’ll have found something valuable and true.  Whether they want to stay or go, kill or run…whether you love them or hate them, that inner self won’t lie to you.  Sometimes I think that’s the worst part.  They’re so God-damned honest.</p>\n\n<p>&nbsp;</p>\n\n<p><a href=\"https://redd.it/8lgnmj\">Final Part</a></p>\n</div>\n","author":"Verastahl"}