{"rank":"51","title":"\"The Doorway To Nowhere\" Documentary Project","id":"8klo5s","url":"/r/nosleep/comments/8klo5s/the_doorway_to_nowhere_documentary_project/","time":"1526740997000","body":"<div class=\"md\"><p><strong>Blog Post #1</strong></p>\n\n<p><strong>May 19th, 2018; 2:27</strong></p>\n\n<hr/>\n\n<p>Before I go on to introduce myself, I should probably at least tell you about what it is that I do for a living. I&#39;m not much of an internet user, so it&#39;s the first time I&#39;m ever trying to do a &quot;blog&quot; or whatever it is a lot of people on the internet do these days, just to do something more interesting. I don&#39;t use social media much, but I guess I can write to you guys about my process of making this documentary, or possibly what I&#39;m going to call my &quot;magnus opus&quot;.</p>\n\n<p>So, my name is Simon Wheatstone, founder of the independent film company, Shadowluck Entertainment, with only one feature film made so far and a second one currently in preproduction. Founded around March 2011 with my long-time best friend/partner, Owen Santos, we both formed a film company where we&#39;re willing to make any movie of any kind possible.</p>\n\n<p>Owen and I were friends since our middle school years, we loved making home videos around town, that was if we were bored. We usually made short movies about either cheesy action spy adventures, like the Austin Powers franchise, or just funny skits we did to show to our parents. I would be the camera man, and Owen would be the actor and the guy who came up with the ideas of shorts to make. My parents appreciated the creativity we both put into our work, but Owen&#39;s parents didn&#39;t. He told me once that the reason was because they didn&#39;t want Owen to grow up to be a comedian or filmmaker, thinking he would make a fool out of himself and the family, but instead they wanted Owen to grow up to be a baseball player. Owen also played sports too back in the day, so there&#39;s that. </p>\n\n<p>So that&#39;s basically what our relationship was like.</p>\n\n<p>When we left from college, we formed our own film company and made our first feature film, <em>The Confidential Files</em>, an action comedy adventure about two life-long friends who try to solve a mystery involving a series of grisly murders and stolen United States government files, based on our short home movies we made as young teenagers. I know, pretty unoriginal concept for a film, but it was best to start off with something simple, like an appetizer before the main course. </p>\n\n<p>After we sent that movie to a few film festivals and wait for the word about an official DVD and Blu-Ray release, Owen and I had talked about doing something different from what we&#39;ve done before, and we suddenly had an idea to do a documentary. My idea of a documentary was to talk about a room in a house in Columbus, Ohio that caused many deaths and disappearances of people who have encountered it. Inside the room was said to supposedly appear to lead to nowhere but pure darkness, hence the title of the documentary being <em>The Doorway To Nowhere</em>, and some people who were involved with the strange occurrences involving the room were able to tell their stories about their experiences, which is what the documentary will be about. Most of the experiences involve the effects of viewing inside the room themselves, which would cause either paranoia, insanity, or a great urge to commit suicide, and even going near the house has some minor effects.</p>\n\n<p>I was inspired by writer Susan Fowler, an American author of many books talking about legends and folklore, who had written a book about the room, which also talked about predictions of what could be in that room that caused many of these deaths and disappearances of many people who had encountered it without thought. Her book was published under the title, <em>The Columbus House From Hell: A Mysteries Debunked Book</em>. Surprisingly, this was her first book where the mystery wasn&#39;t debunked, but she did make good points about the room. For example, she pieced things together about every person who had either lived in that house or had went inside it without permission, some people had done that before. Susan had talked with people who were either related to those missing people, or witnesses that were around at the time they disappeared, which I&#39;ll post some content from the book into these blog posts (with Susan&#39;s permission). When I first met Susan Fowler at a book signing a few months ago, I had talked with her about the documentary I was planning on making, and she was excited with the project, she signed up to become part of the project. Susan Fowler&#39;s book was the whole inspiration of <em>The Doorway To Nowhere</em>.</p>\n\n<p>One of the biggest known experiences about the room is a televised interview on a news channel that was broadcasted the night after Halloween last year with a kid named Freddy Black who had a friend named Jacob Evans who (for some unknown reason still trying to be solved) led himself into the house and into the room.</p>\n\n<p>And here is the transcript of the interview, if you want to check it out.</p>\n\n<hr/>\n\n<p><strong>QUESTION #1: Where were you on Halloween night?</strong></p>\n\n<p><strong>&quot;I was trick-or-treating with him, it was when the night was almost over, kids were getting home, but me and Jacob wanted to find more candy. So we continued looking around for houses that were still passing out candy, and we couldn&#39;t find any, except for this one regular looking house that had lights on.&quot;</strong></p>\n\n<p><strong>QUESTION #2: &quot;Was there anything strange about this particular house?&quot;</strong></p>\n\n<p><strong>&quot;Nothing that I found weird or nerved about, no, except for the fact that there was an empty bowl on the porch that had a small note inside. Me and Jacob read the note, it said &#39;Want more candy? Come Inside.&#39; I knew something was off, but Jacob wanted more candy and tried to open the door, but it appeared locked. I checked for cars or a sign of any police nearby, surprise there wasn&#39;t any, but I didn&#39;t want to get caught because of him. He tried to slam himself at the door, and of course, the door finally opened. He broke the lock. I tried to tell him that we should go and eat whatever we had of our candy, but Jacob ignored me and tried to scout over the house for some candy. This wasn&#39;t like Jacob at all, he was just acting strange. Every time I tried to get him to leave out of the house with me, he&#39;d just growl at me and threatening me. He was freaking me the fuck out. Sorry for the language, sir, but he was freaking me out. I also tried to mention this to him, but I never spoke of it to him. I tried to tell him this, but he never listened to me at all.&quot;</strong></p>\n\n<p><strong>QUESTION #3: &quot;And what did you try to tell him?&quot;</strong></p>\n\n<p><strong>&quot;. . . the house . . . it . . . it was for sale. Nobody lived there . . .&quot;</strong></p>\n\n<p><strong>QUESTION #4: &quot;Did Jacob notice this when he approached this house?&quot;</strong></p>\n\n<p><strong>&quot;No, he didn&#39;t. I did, however, but when I tried to talk him out of it, he never listened to me at all. Something changed in him, I just know it!&quot;</strong></p>\n\n<p><strong>QUESTION #5: &quot;Before you can tell us why you think that, could you tell us more about what happened next after you went in the house with him?&quot;</strong></p>\n\n<p><strong>&quot;Sure . . . he started looking through the bedrooms, the cabinets, the refridgerator, and even the bathrooms. He even looked down in the basement for some candy, but I didn&#39;t go down there with him, because of how dark it was down there. He went down there without turning on the lights, which was the weird thing. I known Jacob since we both were in kindergarten, he was afraid of the dark, and always slept with the lights on. He just ran down the stairs without stopping to turn on the lights, he went to search in the dark. I was oddly weirded out and scared. He came back up a few minutes later, saying he didn&#39;t find any, although the lights were off. Jacob then told me there was one more room he didn&#39;t check, and it was another room in the upstairs hallway. It seemed like he skipped this room on accident, but without hesitation, as he ran up the stairs, he immediately grasped the door knob and twisted it. He opened the door, and this was where I felt like Jacob was losing his mind. It was another dark room. I couldn&#39;t even tell what room it was, but it was definitely dark. Jacob tried to search for a lightswitch, but he said there wasn&#39;t one. And another thing he said that freaked me out more . . .&quot;</strong></p>\n\n<p><strong>QUESTION #6: &quot;What did he say?&quot;</strong></p>\n\n<p><strong>&quot;. . . look, can this be over please? I can&#39;t take it, just telling you about this whole situation anymore! PLEASE! CAN YOU JUST END THE INTERVIEW??&quot;</strong></p>\n\n<p><strong>&quot;Not until all of our questions are answered. This is very important, Fred. You need to tell us what he said to you. So just calm down, take a deep breath, and whenever you feel comfortable, tell us what he said.&quot;</strong></p>\n\n<p><strong>&quot;He . . . he said that the walls were . . . God, this is just too freaky to imagine. I don&#39;t think I can take it anymore!&quot;</strong></p>\n\n<p><strong>&quot;Fred, we&#39;re all here with you. Trust me, nobody is here to hurt you. We just need a few more questions answered, okay?&quot;</strong></p>\n\n<p><strong>&quot;He said that the walls were . . . they were . . . squishy. Felt like warm, clammy human flesh.&quot;</strong></p>\n\n<p><strong>QUESTION #7: &quot;What did he do next after he told you this?&quot;</strong></p>\n\n<p><strong>&quot;He went in the room, and when I watched him walking in there, alone, he seemed to keep on walking forever. It was as if he was going to walk into eternal darkness. I think that was what the room was. Eternal darkness. He said that he couldn&#39;t see anything at all, it was darker than the basement, he said. He kept looking around for candy, but then he told me that the room felt empty, Jacob asked me if I wanted to go in the room, but I said no, already scared to death. He kept on walking forward. From my perspective, he was small, far away from me as if he was out in the open. It wasn&#39;t normal for a room to be this big in a house like this, I thought. But then he stopped, saying he found a bowl full of candy. He held up a bowl filled to the brim with candy, which I could barely see. Then he looked up, and there was a pull chain, just hanging down in front of his face. I didn&#39;t recall it being there when he found the bowl of candy, but he just stared at it, then told me he was going to turn on the light, so that I can go in with him too. And then Jacob pulled the chain down, and as he did so . . . the door shut.&quot;</strong></p>\n\n<p><strong>QUESTION #8: &quot;The door shut? By itself?&quot;</strong></p>\n\n<p><strong>&quot;YES! The door suddenly shut itself the moment he pulled the chain, locking himself in there. Alone. I tried to open the door, but it was locked from the inside, somehow. I started banging on the door, trying to see if he was okay in there. I heard nothing, just nothing but the sounds of breathing, his breathing. He didn&#39;t speak at all, he was just breathing. I couldn&#39;t open the door at all, I tried to break the door down, but the door wouldn&#39;t budge at all! I ran to call for help, but nobody answered when I was outside, so I went to Jacob&#39;s house to have his parents call the police.&quot;</strong></p>\n\n<p><strong>QUESTION #9: &quot;And have the police opened the door?&quot;</strong></p>\n\n<p><strong>&quot;They told us that they couldn&#39;t get the door to open. They tried their best, they said. The door wouldn&#39;t break open. Jacob was left in there . . . or I think he was . . .&quot;</strong></p>\n\n<p><strong>QUESTION #10: &quot;Why do you think that?&quot;</strong></p>\n\n<p><strong>&quot;Well, when I went to bed that night, I woke up from a loud banging noise from outside my bedroom window. I sat up, turned on the light, because I couldn&#39;t see what was banging on my window. And as I did, I saw him. Jacob.&quot;</strong></p>\n\n<p><strong>QUESTION #11: &quot;You saw him?&quot;</strong></p>\n\n<p><strong>&quot;At least I thought I did.&quot;</strong></p>\n\n<p><strong>QUESTION #12: &quot;Did he say anything to you?&quot;</strong></p>\n\n<p><strong>&quot;Surprisingly, he did.&quot;</strong></p>\n\n<p><strong>QUESTION #13: &quot;What did he say?&quot;</strong></p>\n\n<p><strong>&quot;He told me to come into the house with him, into the room . . .&quot;</strong></p>\n\n<p><strong>(LONG PAUSE)</strong></p>\n\n<p><strong>&quot;His body was MANGLED and BLOODIED all over!! That&#39;s what he looked like, there was no way he made it out of that room, something made him change and lured him into there!! I know what I saw, Jacob was right there outside my window, dead and alive at the same time!! WHY IS THIS HAPPENING TO ME?? PLEASE, JUST END THIS FUCKING INTERVIEW!!&quot;</strong></p>\n\n<p><strong>QUESTION #14: &quot;Okay! Okay! Okay . . . just relax yourself, watch that language of yours, and just listen to one more question. Just one more question, Fred. We promise.&quot;</strong></p>\n\n<p><strong>&quot;. . .&quot;</strong></p>\n\n<p><strong>&quot;Just one more question is all we need, Fred. Okay?&quot;</strong></p>\n\n<p><strong>&quot;. . . okay . . .&quot;</strong></p>\n\n<p><strong>&quot;Was that the last time you seen him? Yes or no?&quot;</strong></p>\n\n<p><strong>&quot;. . . yes . . .&quot;</strong></p>\n\n<p><strong>&quot;Okay, thank you for answering our questions, Fred. You can go home with your parents now. The interview is over, we got all the information we need.&quot;</strong></p>\n\n<p><strong>&quot;. . . thank you . . .&quot;</strong></p>\n\n<hr/>\n\n<p>A few days later after the interview was broadcasted on television, Freddy Black had committed suicide from poisoning from pills at a young age. Really unfortunate.  </p>\n\n<p>So that&#39;s just to give you an idea on what the documentary will be like, we do have a script written by Susan Fowler and I, that way we&#39;ll be able to tell the whole story and possibly try to explain why it&#39;s happening. The filming for <em>The Doorway To Nowhere</em> will start somewhere in early June, we don&#39;t have an official date yet, but I&#39;ll keep up to date about the documentary and more on information about whatever could be behind the door and its effects on people.</p>\n\n<hr/>\n\n<p>If you have any questions to me, you can comment here below, or give a follow. I don&#39;t have any social media pages at this point, so you can just check me out here on my profile on Reddit.</p>\n</div>\n","author":"shadowluckENTMT"}