{"rank":"417","title":"A Father's Love","id":"8kmaps","url":"/r/nosleep/comments/8kmaps/a_fathers_love/","time":"1526747133000","body":"<div class=\"md\"><p>“Daddy, my shadow is scaring me.” Choking back tears, my daughter whimpered as she spoke.</p>\n\n<p>Dawn had struggled with phobias from a young age. She’d overcome many of her fears, but new ones always seemed to crop up. I’d try to be encouraging, but truthfully, at times I found my patience waning. Tough love was something I struggled with, and I suspected my actions were enabling Dawn’s behavior — but change is difficult. </p>\n\n<p>“Your shadow? Dawn, a shadow is just your body blocking out light — nothing to be afraid of.” I stroked Dawn’s hair, keeping the tone of my voice calm and soothing. </p>\n\n<p>“When your not around, he tries to get me. He said he wants to take me away!” She sputtered out the words, tears flowing down her cheeks. I wrapped my arms tightly around Dawn, bringing her in close. </p>\n\n<p>“Dawn,” I let out an exasperated sigh, “Remember when you were afraid of the statue at school? What happened then?” I stated matter of factly.</p>\n\n<p>She didn’t immediately respond, taking time to consider her response. Just like her mother, she was stubborn as a mule — one stubborn ass mule. I was sure she’d try and retort how this time was different, just as she did every time. </p>\n\n<p>“You don’t believe me, do you?” Rather than the argument I expected, my daughter sounded defeated.</p>\n\n<p>“Honey, you know you’re my sunshine and moonlight, but this has got to stop — for your own good.”</p>\n\n<p>“Please, let me sleep in your room tonight — please!” The tears started up again, even fiercer than before. Dawn wasn’t listening, this much was clear.</p>\n\n<p>“Alright, alright! You can stay in my room tonight, but the rest of the week you’re sleeping in your own bed — and don’t even think about fighting me on this.” My voice was forceful, hoping to make my point crystal clear. </p>\n\n<p>Before heading upstairs, I warmed a glass of milk for Dawn, something her mother used to do for her. Patting her delicately on the head, I swooped her into my arms and headed for bed. </p>\n\n<p>That night I tossed and turned, unable to sleep. My daughter laid motionless, oblivious to my insomnia — for that I was glad. Laying next to my daughter, my thoughts drifted towards my late wife, painful yet beautiful memories. Three sleeping pills later, I finally drifted into an uncomfortable slumber.</p>\n\n<p>I awoke to Dawn screaming into my ear, as if death himself had come for her. </p>\n\n<p>“Daddy, daddy — he came back!” Her voice was filled with absolute terror.</p>\n\n<p>Half asleep, it took me a moment to register her words. “What in the world are you talking about?” I groggily responded, shielding my eyes from the sunlight streaming through the window. \n“My shadow, when I woke up he was waiting for me. He told me you were keeping me here and that it was time for me to go — what does that mean?!?!” Her wailing intensified, body seizing with every cry.</p>\n\n<p>The hairs on the back of my neck shot up higher than savannah grass, a cold shiver slowly descending down my spine. That was not the first time I’d heard those words spoken, and I dreaded ever hearing them again. </p>\n\n<p>Right before she passed on, my wife had uttered the same thing to me. Staring at some unseen entity behind me, her ice-cold hands clenching me tightly, she whispered those same exact words — the same fucking thing.</p>\n\n<p>Taking a deep breath to calm myself, I turned towards my daughter — my beautiful daughter. She was my only child, the last thread in this world I had to my wife. The love I felt for her was beyond what I could comprehend, it was a love that stretched beyond the eons, cutting through both life and death. The prospect of losing her, that was a thought I would not even entertain. </p>\n\n<p>“I’m sure it was just a bad dream. I would never let anyone take you away — never ever.”</p>\n\n<p>We spent the rest of the day sitting on the couch watching TV, although Dawn seemed rather disinterested. Physically she was there, but mentally she was not.</p>\n\n<p>“You enjoying the movie buttercup?”</p>\n\n<p>“Yes daddy.” Her response was curt, voice listless. </p>\n\n<p>“Is something wrong sweetheart?” I looked lovingly at my daughter, voice filled with sympathy.</p>\n\n<p>“I don’t think I should be here, Daddy, I need to go — it’s starting to hurt.”</p>\n\n<p>I could see the agony in her eyes, just like her mother before her. It was only a matter of time before the decomposition would begin to set in, no matter how hard I fought to stave it off. </p>\n\n<p>“I’m so sorry, I just — I just can’t let you go.”</p>\n\n<p>I’d already lost her mother, and I had promised myself that I would never let the same thing happen to Dawn. Genes, the silent killer — they never stood a chance in this life, but in the next one I found another way. In death, I had found life. </p>\n\n<p>Dawn’s shadow loomed ominously in the foreground, looking at me with hateful eyes. The natural order had been disturbed, and there was hell to pay for it. </p>\n</div>\n","author":"SpookBrain"}