{"rank":"312","title":"One man hide and seek","id":"8kmghc","url":"/r/nosleep/comments/8kmghc/one_man_hide_and_seek/","time":"1526748657000","body":"<div class=\"md\"><p>So you’ve probably heard about one man hide and seek before. It’s a paranormal game where you use a doll to summon spirits. Some would say it’s stupid and doesn’t work , some would say it’s dangerous. I agree with those who say it’s dangerous , very dangerous. PLEASE , do not try this game. </p>\n\n<p>Two weeks ago I was watching some creepy pastas , as I enjoy creepy stuff like that. I was about to stop watching and go to sleep when I saw a video. It was titled , “One man hide and seek - PARANORMAL GAME”. I of course instantly clicked it. I was all about paranormal games. I had tried Bloody Mary , the elevator game , and other stuff like that , with no result. So after watching the video and learning how to play , I decided to try it. </p>\n\n<p>I went into my attic and grabbed an old doll. I also found some red thread , rice , and the other tools needed to perform the game. I began the game by filling the doll with rice and my own finger nail clippings , like the video said to. I then stitched the doll up with the red thread and went into the bathroom. To play you are instructed to name the doll , I called the doll Mary. So I turned on the bath and put Mary inside. I let it fill up and waited. I then continued the game as instructed. Everything went fine , until it was Mary’s turn to be it. </p>\n\n<p>“Your it Mary , your the new it Mary” , I chanted to the doll. I then left the room without turning back , a crucial instruction the video said. I went into the hallway closet to hide. At first things were pretty normal. I didn’t hear any noises and after 10 minutes without being found I was about to give up. But then I heard small footsteps down the hall. My heart began to race. I felt a mixture of terror and excitement. But the footsteps got louder and louder. I remembered the video said , “ if you feel the doll is about to find you , you must end the game immediately”. So as I heard the footsteps grow closer I grabbed the glass of salt water required to play , and poured some into my mouth , holding it there as instructed. I opened the closet and found the doll sitting at the end of the hallway. My heart raced as I poured the glass of water onto the doll , and spit the water from my mouth onto it as well. I couldn’t believe it , the game had actually worked ! I so excited. And I had ended the game before Mary found me. So I assumed I was safe. I would later find out I was very wrong. </p>\n\n<p>The weird things started happening the next day. It started with me finding Mary sitting in the kitchen. I know what your thinking , “what’s weird about that ?”. Well I forgot to mention , I burned the doll after the game. So upon finding Mary perfectly fine sitting in the kitchen I nearly had a heart attack. I grabbed the doll and threw it into the fire pit. I watched it burn. I stood there terrified watching the doll I had previously burned burn again. Every day after that I would hear foot steps in the attic and on the stairs , but upon searching , I saw nothing. I began to get extreme anxiety. Every night I lay paralyzed in fear. I played the game right , didn’t I ? What had I done wrong ? I decide to rewatch the video to make sure I hadn’t done anything wrong , but upon searching it , I found the video had been deleted by the uploader. I almost puked when I saw this. </p>\n\n<p>I messaged the uploader through YouTube and email with no reply. But I did find myself blocked by the uploader. At this point I was terrified. I was sure I had done everything right so why was this happening to me ? That’s when I heard the small foot steps. But I didn’t hear them from the attic. And I didn’t hear them from the stairs. No. I heard them from right behind me. </p>\n</div>\n","author":"mackenzie04"}