{"rank":"35","title":"The Phantom Headlights","id":"8kmn0l","url":"/r/nosleep/comments/8kmn0l/the_phantom_headlights/","time":"1526750304000","body":"<div class=\"md\"><p><a href=\"https://www.reddit.com/r/nosleep/comments/8i2d4z/taxi_cab_confession/\">Taxi Cab Confession</a></p>\n\n<hr/>\n\n<p>I don’t sleep most nights. Four hours every couple of nights is fine. Staying up doesn’t bother me much though. I was an MP in the Marines, so I was used to long nights of driving around. After I got out I figured I might as well get paid for it. </p>\n\n<p>Two years ago, I got stabbed in the stomach by a junkie looking for quick cash. I was stupid and tried to wrestle the knife away from him. Turns out I was little rustier in defensive tactics than I thought. The junkie took my wallet and left me to die with my intestines hanging out.</p>\n\n<p>Somehow, someway I managed to drive myself to the E.R. I vaguely remember collapsing just outside the front door. The doctor told me that I had died for a minute and forty-six seconds on the operating table. It took me a few months to recover, but before long I was back on the road. </p>\n\n<p>Something changed after I died though. I started seeing things, strange things. I’m not sure how to explain it. Its as if my Third Eye opened. I see ghosts, ghouls, and monsters of all sorts roaming the streets at night. </p>\n\n<p>I thought I’d share another one with you all.</p>\n\n<hr/>\n\n<p><strong>The Phantom Headlights</strong></p>\n\n<p>I don’t like Jersey. It’s a nasty, dirty and trashy state. I’m sorry, but it’s gotta be said. Whenever I cross State lines to drop off a fare into Jersey, it feels like I need to take a shower. Send me your hate mail Jersians.</p>\n\n<p>It was around ten P.M. when I dropped off a fare deep into Jersey. I don’t normally like long hauls, but its quick and easy cash. Fucker didn’t even bother tipping. Typical.</p>\n\n<p>On the long and barren highway, I noticed that I needed to stop and get gas if I wanted to make it home. Just ahead I saw a sign for gas station chain that I had never heard of (Gasco, real clever), but it was my only choice. I took the exit a few miles down the road.</p>\n\n<p>It didn’t take long for me to find the Gasco. It’s bright neon lights illuminated the night sky for miles. When I was approaching, I saw an old beat-up minivan sitting at the pump with an attendant. Did you know they still pump your gas for you here? Weird fucking state.  </p>\n\n<p>I pulled the cab into an open pump just a few spots down. The bell clanged as I rolled over the wire laying on the ground, but no attendant came out. I stepped out of my car and looked over at the minivan. The attendant pumping gas for the van offered a weak shrug. I sighed and walked into the mart.</p>\n\n<p>When I walked in the bell chimed, and I saw a middle-aged man perusing the various unhealthy baked goods. He was hefty boy and wore a shirt that was somehow tight and loose in all the wrong places, with camo cargo shorts and thin flip flops to boot. On his head he wore a Dallas Cowboys ball-cap; a sight that would’ve gotten him lynched in Philly.</p>\n\n<p>The fat man paid me no mind as I worked my way towards the energy drinks. People say they’re awful for me, but I don’t mind. Tastes better than coffee at least. I grabbed the cheapest I could find and snagged a pack of donuts for the road.</p>\n\n<p>I worked my way over to register only to find it unattended. The bell chimed again, and the attendant from earlier walked in as the fat man walked out. He got behind the register. The attendant was just some punk kid wearing an ugly red and yellow uniform. </p>\n\n<p>The kid looked exhausted and his eyes screamed “I’m exhausted.”\n“Can I get you anything else?” The kid spoke lazily as he clicked away at the register. </p>\n\n<p>“40 on pump…” I looked over to see which pump my cab was at. It was at three, my lucky number. When I was looking though, I saw the fat man working his way back to the store. He didn’t seem happy.</p>\n\n<p>“Number three,” I tossed him a crisp fifty-dollar bill. I don’t carry debit cards or credit cards. Hard cash is the only currency I’ll deal in. “Keep the change.” I added as he tried and failed to scan my Monster. The bell to the store clanged once more. </p>\n\n<p>“What the fuck man? You didn’t fill ‘er up,” He boomed at the attendant with a thick southern accent. Upon my second inspection of the man I realized just how tall he was, and that not all his weight was fat.  </p>\n\n<p>“You didn’t think I’d notice you fucking retard?” He was standing next to me as I watched the attendant barely react. Something told me that this wasn’t the first time he had dealt with assholes.</p>\n\n<p>“Sir, you only gave me twenty-five dollars. I can’t just fill ‘er up,” I chuckled at the attendant’s piss-pour imitation of the customer. Always a bad idea to get involved. </p>\n\n<p>“Something fuckin’ funny pal?” Big and Tall turned his attention to me. I sighed again and turned to face him.</p>\n\n<p>“Nah man, sorry,” I apologized meekly. He stood almost a foot taller than me and I didn’t need to get my ass kicked over nothing.</p>\n\n<p>“That’s what I thought,” He spoke cockily. I got the feeling that he was used to getting his way through brute force. I squared up with him for just a moment before simply walking around him. “Pussy.” He added as I began to walk out of the store. I stopped for a moment, before continuing to my cab. </p>\n\n<p>When I stepped outside I got a good look into his van. A brunette, middle-aged woman was sitting in the passenger seat, and she looked scared. Two kids were sleeping harmlessly in the back. My heart sank for a beat, but I brushed it off. Back in the day I might’ve said something, but I wasn’t an MP anymore.</p>\n\n<p>I could hear the man at the kid from my pump while I snacked on my donuts. Before too long the douchebag came back out and stormed over to his pump. I heard him open the cap, and he began to pump more gas.</p>\n\n<p>I was about to start pumping my own gas when I heard the familiar sound of a lighter sparking. I glanced over and saw that the douchebag was lighting up a cigarette at the pump. Without any sign of hesitation, I went to confront the colossus of a man.</p>\n\n<p>“Are you fucking retarded man?” I spoke louder than I expected myself to. The behemoth jumped slightly before regaining his composure. “You’re gonna blow us all up with that thing.” I pointed to the smoke. </p>\n\n<p>“You got a problem pal?” He pulled the smoke out with one hand and shoved me with the other. I silently wished that I had my old stun baton again.  Big and Tall shoved me again and I nearly lost my balance. </p>\n\n<p>“I just don’t want to explode dude. Your kids probably don’t either,” I raised both of my hands defensively and pointed towards his van. If he came at me again I was ready to use some of my defensive tactics they taught me at MP school. Instead he flicked the cigarette butt at me. It exploded into flames on my chest, and my old jacket nearly caught fire.</p>\n\n<p>“You’re insane,” Was all I could offer. Big and Tall smiled at me before putting the pump away. He climbed back into his van without another word. It didn’t take long for his headlights to disappear off in the distance. I cursed silently and finished fueling up. </p>\n\n<hr/>\n\n<p>The clock on my radio said it was a quarter till midnight. I wasn’t tired at all after the confrontation with Big and Tall. Dozens of scenarios played out in my head as I drove along the empty highway. Each scene ended with me kicking the douchebags ass, but I knew it was only a fantasy. My hubris got me killed once before.</p>\n\n<p>As my cab cruised down the highway I watched the thick forests on either side. Deer around these parts tended to be suicidal. Just ahead I saw what looked to be headlights deep into the woods. I figured it was a hunter, or some teens trying to get high. </p>\n\n<p>It didn’t take long me for to pass the headlights. When I did, I checked the rear view mirror. As I did, the headlights pulled out of the forest. Four bright unusually bright beams of light illuminated the road behind me.</p>\n\n<p>“Another douchebag with his high beams on” I said to no one in particular. The car behind me caught up quickly, and soon my entire cab was lit up by the lights. I rolled my window down and motioned for him to pass, but they stayed in place. The headlights flickered for a moment before illuminating the car and road again. \nI motioned again but the driver ignored me.</p>\n\n<p>Typical Jersian douchebaggery at its finest. </p>\n\n<p>It wasn’t until I felt the goosebumps covering my arms. Something wasn’t right, but I was still too pissed off from earlier to care. Instead of trying to play nice again, I brake checked the car. </p>\n\n<p>The driver didn’t seem to find it as funny as I did, and before long he was just behind my cab. I checked the rearview mirror again and realized that I couldn’t see an outline of a car. There were only 4 bright headlights relatively low to the ground.</p>\n\n<p>I ignored my instinct to pull over. Instead I reached over to my glove box and pulled out the .38 I keep in there. Ever since I got mugged I don’t leave home without it. Jersey has strict gun laws, and I was initially worried that maybe I pissed off a cop. That didn’t explain the goosebumps. </p>\n\n<p>I looked in the rear-view again. The lights were still behind me. I’ve never seen a cop car with 4 headlights before, so I brushed off that suspicion.</p>\n\n<p>Without warning the headlights split as they prepared to overtake my cab. I breathed a sigh of relief and assumed it was a duo of motorcycle assholes. I was confident I could scare them off with my revolver. They didn’t sound like any motorcycles I had ever heard. In fact, they were dead silent.</p>\n\n<p>Both pairs of lights moved to either side of my car. They sped up just a little bit before they were just along my front doors. I could see that they weren’t motorcycles either.</p>\n\n<p>They looked like old, hairless and wrinkled men. Their skin was a sickly gray, and their eyes seemed to be empty, save for the lights. Their bodies were bent awkwardly, and they were hunched down low. Their feet moved quickly, and it was if they were trying to create the illusion of being a vehicle. Their eyes continued to illuminate the roads ahead of us. The lights flickered for a moment again, and I could see that it was them blinking in sync.</p>\n\n<p>I thought about swerving into them, but instead opted for cocking the hammer for my .38.</p>\n\n<p>The sound seemed to attract the creature on my left though, and his head quickly snapped towards my car. I was blinded by the incredibly bright light coming from its eye sockets. </p>\n\n<p>My cab shook violently. I could hear screeching metal, shattering glass, but I couldn’t see a damned thing.</p>\n\n<p>I fired my gun blindly into the lights and I heard one of the creature’s shriek. It sounded like nails on a chalkboard.  </p>\n\n<p>The lights disappeared, and I could see that the creatures had taken off down the road. A trail of what looked like engine oil followed one of the creatures. I thanked my lucky stars and pulled over to inspect the damage. All doors were totaled, as there were deep gashes along the either side. </p>\n\n<p><em>They were trying to get in.</em></p>\n\n<hr/>\n\n<p>I had to limp along the highway in my newly created hunkajunk. It was around two AM when I saw the van from the Gasco pulled off to the side of the road. Light poured out from every window, and I couldn’t see into the car. Every door was like an old wrinkly shirt. The driver side door had a deep gash, which had light pouring out, that must&#39;ve hit the driver... Big and Tall.</p>\n\n<p>The light coming from the car looked different somehow. It was darker and had a reddish hue. The van rocked gently as I approached. The reddish lights flickered for a just a moment, and in that moment, I could see blood coating the glass. The van rocked harder the closer I got. I wish I could say I was brave and saved everyone, but I just kept driving. </p>\n\n<p>Fuck, I <strong>really</strong> hate Jersey.</p>\n\n<hr/>\n\n<p><a href=\"https://www.facebook.com/TheR.W.Rawls/\">R.W. Rawls</a></p>\n</div>\n","author":"CriticalMarine"}