{"rank":"10","title":"Have You Ever Loved Someone?","id":"8kmr83","url":"/r/nosleep/comments/8kmr83/have_you_ever_loved_someone/","time":"1526751370000","body":"<div class=\"md\"><p>Have you ever loved someone? Have you ever looked into someone’s eyes and just knew that as long as they were with you, everything would be okay? That’s how it was for me when I met her, the love of my life.</p>\n\n<p>Her name was Katrina. She was amazingly beautiful. We met at a coffee shop. I was making a drink for her and she was attempting to flirt with me. I didn’t pick up on it at first, but over time, I realized she was interested in me. We flirted and talked everyday when she came in. I still remember the drink she ordered; it was a cup of hot cocoa. I know right? I laugh about it too. She gave me her number one day and that’s where our happiness started.</p>\n\n<p>We did everything together. We talked about everything and anything, hell we were even into the same things. One moment we’ll be all lovey-dovey, snuggling with each other. And, the next moment, we’ll be yelling at each other as we kick each other’s asses at Mortal Kombat. People were jealous of us, friends were shocked, and families loved us.</p>\n\n<p>Things went well for a long time. After a few years, we decided to move in together. I got a better job, but we still went to that same coffee shop to drink hot cocoa and just talk. Of course, something bad always has to happen, huh?</p>\n\n<p>I came home from work early one day to surprise her. When I walked in, I heard commotion upstairs. Light bumps and groans. Thinking the worse, I grabbed a knife from the kitchen and rushed upstairs. I followed the noise to our bedroom and quietly opened the door... My love! My baby was on top of another man... NAKED!!! The anger and betrayal in me rose to unspeakable levels and I.. I killed them. I slit their necks and watched them bleed and beg for help. When she reached out to me, I simply pushed her away and stepped back as she slumped to the floor.</p>\n\n<p>Have you ever had that first kill and felt nothing? You probably haven’t, but that’s fine, you will one day. I looked at my hands and watched the blood drip on to the floor for hours. I screamed and yelled for a long time, “WHY?!” “Why did you do this?!”. I don’t remember much of what happened after that, all I know is that some woman keeps coming in to see me and tell me she’s me wife, that I went crazy and killed our neighbors. I don’t believe her, she just wants me to feel guilty, it won’t work.</p>\n\n<p>The man named Doctor, looked up from his clipboard and looked at the man as he fidgeted in his straight jacket. He stared at the man intently, “Are you going to respond?” The Doctor asked. The man kept staring, not answering the question. He looked past the man into the 2-way mirror and said, “He’s gone Miss Petrova... I’m sorry.” The Doctor got up and left the man in the room.</p>\n\n<p>“Are you going to respond?” The Doctor asked me. “I have been responding! Can’t you hear me?!” I watched as the Doctor looked past me and said, “He’s gone Miss Petrova... I’m sorry.” “I’m not gone! I’m right here!” I watched as the man got up and left the room. I thrashed in my seat as I struggled to escape from my confinement, but to no avail. I gave up and thought about my wife and how we first met. I was making her favorite drink, hot cocoa, and she was attempting to flirt with me...</p>\n</div>\n","author":"Privatechief117"}