{"rank":"1836","title":"Something happened in the psychiatric ward","id":"8kmsl8","url":"/r/nosleep/comments/8kmsl8/something_happened_in_the_psychiatric_ward/","time":"1526751718000","body":"<div class=\"md\"><p>I’m a medical student and in the last two weeks I’ve been attending the scheduled internship in Psychiatry.</p>\n\n<p>I happen to be very interested in the subject, to the point of considering it as a career path after graduation, and as it happens I’ve gotten into probably the best department I could have ended up in; or the worst, depending on your point of view.</p>\n\n<p>It is a sort of intensive care unit, but for psychiatric patients; they basically get the worst cases, patch them up as best as they can and send them to an appropriate structure.</p>\n\n<p>Everything is locked up and strictly controlled, as we get a bit of everything, from those at high suicide risk, to those suffering from bipolar disorder, to schizophrenic people talking to God, who, incidentally, is always their father. The problems with these last ones come when this “God” tells them to beat up other patients, as, obviously, they are infidels.</p>\n\n<p>Things went on, with ups and downs and the usual problems tied to the profession, such as the guy who walked in and went on to casually announce that he was carrying a number of knives inside his suitcase, or the ex-convict who insisted on coming in the Doctor’s office because he disagreed with the therapy and decided to sit beside me while vehemently arguing with the on-duty psychiatrist.</p>\n\n<p>I kind of hope I was still there, sitting beside the ex-convict and trying to make myself basically invisible.</p>\n\n<p>Five days ago, a middle-aged man, I’ll call him Mr. R. for privacy’s sake, came in. He did so of his own volition.</p>\n\n<p>In his own words, he “really needed for them to be silent for a while”.</p>\n\n<p>R.’s appearance was a bit peculiar, balding and stocky he had a sallow complexion and wore ill-fitting sunglasses. Like, always, outside as well as inside.</p>\n\n<p>His mannerisms were unconventional as well: twitchy and nervous, he always seemed to be on the lookout for something.</p>\n\n<p>Some might think that it wouldn’t be so strange to see someone behaving like that in such a place, but most patients usually looked lost and confused, unfocused, as if they had too many thoughts at the same time, or not enough at all.</p>\n\n<p>He was nothing like that, he at most seemed slightly distressed.</p>\n\n<p>I was given the opportunity and privilege to attend Mr. R.’s first session, as proposed by the doctor and under the patient’s agreement. He agreed.</p>\n\n<p>It’s safe to say that I was absolutely fascinated by his case.</p>\n\n<p>You see, most schizophrenic patients start suffering from an early age, usually around 16-18 years old, from auditory hallucinations, which can take different natures.</p>\n\n<p>Some insult the person, constantly degrading them to the point of driving them to suicide, some tell them what to do, and can be rather dangerous.</p>\n\n<p>Another common characteristic is that the patients are completely unaware that the voices only exist within their minds and only they can hear them.</p>\n\n<p>R. was an exception in every respect.</p>\n\n<p>First of all, he introduced his case by stating clearly that he was aware that the figures he saw, he was the only one who saw them.</p>\n\n<p>“It’s the sickness that makes me see them.”, he said.</p>\n\n<p>That’s right, he didn’t just hear, he saw things. Not people. Figures. He called them “demons”, four of them.</p>\n\n<p>He could even describe them in detail, citing horns and claws, and cold, dark eyes that looked like pure void. They could even turn to a more draconic appearance when they turned more hostile. They could even “wear other people’s faces as their own” to trick him.</p>\n\n<p>The first time they appeared it was in his mid-thirties. As he came home, he saw them trying to possess his mother, and they tried to use her to kill him, he said.</p>\n\n<p>They hadn’t left him since, and only meds seemed to keep a hold of them and at least make them silent.</p>\n\n<p>He kept telling us about them, adding details and stories each time, until yesterday.</p>\n\n<p>Then, something happened.</p>\n\n<p>During our third session the psychiatrist asked him where those demons were.</p>\n\n<p>R. silently pointed at the windowsill. The very same windowsill I was standing next to, silently taking notes.</p>\n\n<p>“Are they telling you something?” asked the psychiatrist.</p>\n\n<p>“No… they’ve been silent as of late.”</p>\n\n<p>“Do they do something? Are they doing something right now?”</p>\n\n<p>R. looked around, a bit in distress, but eventually nodded.</p>\n\n<p>“What are they doing?”</p>\n\n<p>When I didn’t hear an answer, I looked up from my notes. R. was pointing directly at me.</p>\n\n<p>“What are they doing?” repeated the psychiatrist.</p>\n\n<p>“They are looking at him. Staring.”</p>\n\n<p>I couldn’t help but feel a shiver run down my spine. I knew those were just hallucinations, but his finger pointed at me. His… face - <em>It was the stuff of nightmares.</em></p>\n\n<p>“Sometimes in the last few days they disappeared. When I find them again they’re with him. They’ve been following him.”</p>\n\n<p>The psychiatrist glared at me with a furrowed brow.</p>\n\n<p>“Do you know what they want? Do they want to use him to do you harm like they did with your mother?”</p>\n\n<p>“No, not at all. They don’t want to hurt me.”</p>\n\n<p>Today R. came directly to me as I was getting ready to go home, taking off my white coat.</p>\n\n<p>He took off his sunglasses and looked at me with those eyes, dark and endless, as if made of pure void.</p>\n\n<p>“Thank you, doctor. Finally, I’m free.”</p>\n\n<p>I’m writing this, sitting at my desk, a mere half hour later.</p>\n\n<p>I’m writing this to make sure someone knows what happened, and that I’m not crazy.</p>\n\n<p>Because I can’t see anything, nor hear anyone. But I can feel their breath on my neck.</p>\n</div>\n","author":"misterdoctor6"}