{"rank":"70","title":"Knock knock","id":"8kn3nb","url":"/r/nosleep/comments/8kn3nb/knock_knock/","time":"1526754546000","body":"<div class=\"md\"><p>“Knock knock,” giggled Gwen, squirming with mirth in her high chair.</p>\n\n<p>“Who’s there?” Jim tried to maneuver a spoonful of oatmeal into our daughter’s mouth while at the same time taking an oversized gulp of coffee. He would have succeeded had Gwen not suddenly kicked her legs up, jostling the spoon. Jim scowled at the resulting stain on his white dress shirt while Gwen placidly drew designs in the spilled oatmeal. Then she fixed me with a meaningful stare.</p>\n\n<p>“Knock knock!”</p>\n\n<p>“Now I’m gonna be late,” muttered Jim, pushing abruptly away from the table and heading upstairs to change shirt. Just me and Gwen now. I sighed and took up the gummy oatmeal spoon, hoping to guide at least a fraction of its contents into her mouth.</p>\n\n<p>“Knock knock!” Gwen repeated insistently.</p>\n\n<p>“Who’s there, sweetheart?”</p>\n\n<p>Gwen considered. “I don’t know.”</p>\n\n<p>I tried not to smile. Jim and I had been telling knock knock jokes to Gwen since she was two months old, because even when she was too young to respond, she loved the soothing cadence of it, kicking her chubby legs and gurgling with glee. Now at three and a half, she was trying to formulate her own but hadn’t quite gotten the hang of coming up with a punchline.</p>\n\n<p>“How about orange?” I prompted.</p>\n\n<p>“Who’s orange?”</p>\n\n<p>“No sweetie, it’s orange who, remember?”</p>\n\n<p>Jim came stomping down the stairs while adjusting his tie with one hand and checking his watch with the other. </p>\n\n<p>“I’ve got a meeting at 4:30 so I’ll probably stay downtown for a bit with the clients. Don’t worry about dinner.”</p>\n\n<p>“Yeah, whatever.”</p>\n\n<p>Jim ignored my tone and instead gave a cheery wave to Gwen. She was too preoccupied with her oatmeal to notice. Then the door had slammed behind him, and the day stretched in front of me like warm taffy. </p>\n\n<hr/>\n\n<p>“Knock knock!”</p>\n\n<p>I paused in the middle of loading the wet laundry into the dryer, digging a hand into the small of my back in a futile to relieve the constant ache. I could feel it growing and pressing behind my eyes, the exhaustion that threatened to overcome me if I ever stopped moving. Shaking myself awake again, I went to see what Gwen was up to.</p>\n\n<p>She was sitting in the middle of the living room, illuminated by a sunbeam, vaguely scribbling on some scrap paper while chanting in a sing-song voice.</p>\n\n<p>“Knock knock. Who’s there? I don’t know! Knock knock. Who’s there? I don’t know!”</p>\n\n<p>She didn’t even notice me watching her. </p>\n\n<p>It was just past noon but I felt as though I’d been awake for hours. Looking at Gwen occupying herself so peacefully, I sensed that I could vanish like a soap bubble and no one would be the wiser. Not Jim, no doubt sweatily entangled with a youthful coworker or client at the moment, not my own coworkers I hadn’t seen in the three years since Gwen’s birth, not my parents, too busy looking at Florida timeshares.</p>\n\n<p>Not even Gwen.</p>\n\n<p>No, that wasn’t fair to her.</p>\n\n<p>“Mommy’s gonna take a quick nap, okay sweetheart?”</p>\n\n<p>Gwen glanced up at me with a furrowed brow and protruding lower lip, telltale signs of an imminent tantrum.</p>\n\n<p>“I don’t <em>wanna</em> take a nap!”</p>\n\n<p>“You can stay out here,” I replied hastily. “Just be a good girl and make Mommy a nice picture, okay?”</p>\n\n<p>“Okay,” she echoed doubtfully.</p>\n\n<p>“Just a few minutes of shut-eye.”</p>\n\n<hr/>\n\n<p>When I woke up it was night.</p>\n\n<p><em>Shit.</em></p>\n\n<p>I bounded out of bed, raced down the stairs and into the living room. No Gwen. Her discarded drawing lay on the floor and something compelled me to scoop it up. By the sulphurous glow of our porch light I saw that she had scribbled over the paper with a black crayon, the angular lines forming some approximation of a person. Red slash for a mouth, expressionless blue eyes.</p>\n\n<p>“Knock knock.” Gwen’s voice floated faintly from her bedroom.</p>\n\n<p><em>Thank god.</em></p>\n\n<p>“Gwen?” I called as I dropped the picture and started climbing the stairs. The panic hadn’t yet disappeared, lending a nervous warble to my voice.</p>\n\n<p>“Knock knock, knock knock.”</p>\n\n<p>Her normally sweet voice sounded somewhat brittle, and I realized that there was another sound, a metallic tapping in time with each word. She must be accompanying herself, I thought as I reached the top of the staircase and headed down the hall.</p>\n\n<p>“Knock knock.”</p>\n\n<p>Then the heart-rending crash of broken glass.</p>\n\n<p>I was in her bedroom in a heartbeat, face to face with a gaping hole in the window next to her bed. Tiny shards of glass littered the carpet and bedspread, glittering like wasted tears in the moonlight. </p>\n\n<p>The sheets and blankets were ruffled, as though my daughter had climbed upon them to see out of the window. </p>\n\n<p>“Gwen?” I whispered, but I knew it was no use.</p>\n\n<p>A scrap of paper fluttered through the air and landed amidst the glass. Numbly I bent down and picked it up. On it was scrawled a single sentence.</p>\n\n<p><em>You don’t know me, but your daughter will.</em></p>\n\n<p>Finally, I knew her punchline. </p>\n\n<p><a href=\"https://www.facebook.com/LindenWriter/\">x</a></p>\n</div>\n","author":"stange_loops"}