{"rank":"49","title":"My first time.","id":"8knmqh","url":"/r/nosleep/comments/8knmqh/my_first_time/","time":"1526759434000","body":"<div class=\"md\"><p>There is not anything particularly special about this house but hey this is my first time. </p>\n\n<p>It’s an old two story Colonial. The paint is chipping and the concrete driveway has eroded into a morass of ruts. Sometimes when it rains the back door doesn’t lock. It’s a fixer upper for sure. Out off all the places to settle. There was cheaper, newer, better but it had to be this one. </p>\n\n<p>For all of its blemishes, the yard is perfect. The house is set back on a double lot and twin oaks flanking the porch keeps the house shaded. Tall evergreen hedges wall in the property and all manner of flowers and smaller trees occupy the space in between. </p>\n\n<p>It’s quiet and the people here keep to themselves. It’s the perfect place for a busy single mom with an imaginative little boy to start over. </p>\n\n<p>So busy in fact, that the gaps in the blinds went unnoticed. They were probably already there right? When they appeared to multiply, my sweet little boy took the blame. He’s upstairs in his room right now, still in trouble for a crime he didn’t commit.</p>\n\n<p>Then came the noises. Small at first, light scratches. Squirrels no doubt. Then the bumps, cracks and creaks. All easily explained away as a wheezing old house, freshly occupied. But it was the slams that would scare the shit out of anyone. Every one deals with fear differently. </p>\n\n<p>At first it was checking the whole house with a flashlight. Then it was Ambien and a nightcap. Finally Dan started to come over. He checked the whole house too. Then the yard and even the basement where that old water heater is ready to give out. After he searched it was movies, popcorn and sex on the couch. That seemed  to do the trick. He’s such a nice guy to drive all the way over after the third  hysterical call of “someone is outside!” And the way he plays with my son like he is his biological father it just melts your heart. </p>\n\n<p>But Dan’s not his father you cold, heartless bitch. I am. I wish it didn’t have to come to this. We could have worked this out. You didn’t have to move out. You didn’t have to end it. You certainly didn’t have to move across the country. A son needs his father. I’m not going to let her do this. </p>\n\n<p>I’m watching that cunt now. Here it is 1PM and her lazy ass is sitting on the couch with a gin and tonic reading a magazine. Bitch, you should’ve trimmed back those hedges. </p>\n\n<p>You should’ve listened to our son. Remember when he told you he saw Papa under the tree? You called him a liar and sent him to his room so you could surf Tinder. So sad, what would Dan think?</p>\n\n<p>I have a gun, a knife and a rope. I’m not sure how I’m going to do this yet. Like I said, this is my first time. We’ll find out tonight. </p>\n\n<p>It’s supposed to rain.  </p>\n</div>\n","author":"PapaBear506"}