{"rank":"69","title":"The Damned Thing","id":"8knorl","url":"/r/nosleep/comments/8knorl/the_damned_thing/","time":"1526759972000","body":"<div class=\"md\"><p>It wasn&#39;t unusual for Miria to wake up to darkness. She had always had trouble staying asleep for more than four hours at a time. Tonight was no different.</p>\n\n<p>Her eyes lulled open. Thin beams of moonlight peered through the curtains, illuminating a room Miria was too foggy-eyed to see. Her head shifted to the side, eyes squinting at the red lights bleeding through the darkness.</p>\n\n<p>“00:21” read the digital clock.</p>\n\n<p>Her eyes rolled in annoyance. She knew now that tonight would be one of a few good hours of sleep, broken up by intermissions of frustrating awakenings, leading to a dreary day at the office.</p>\n\n<p>She had been dealing with this for so long that she knew her routine by heart. Habitually, her hand reached for the book next to the clock, resting upon her bedside nightstand.</p>\n\n<p>A few minutes of reading always gets her right back to sleep.</p>\n\n<p>As Miria stretched, however, she felt a tug on her legs. An unregistered pressure was currently pinning her legs down.</p>\n\n<p>Had her daughter sneaked into the bedroom to lie down with her parents? She must have had a nightmare. But, how did she not wake Miria?</p>\n\n<p>She looked foreword, very much expecting to see Lizzie. But, that wasn’t what she saw.</p>\n\n<p>The room was dark, but what light that was available outlined a shadowy figure laying across the bed covers.</p>\n\n<p>A mound of midnight flesh was lying before her, spanning the entire width of the bed. A tuberous, thick neck of grotesque length connects this mound to a near human head with a thin, elongated cranium. Fatty thighs extend off the bed connected to backward knees and spindly lower legs.</p>\n\n<p>Miria stared in horror, a silent shriek stuck in her throat. Her muscles all clenched instinctively, freezing her in place.</p>\n\n<p>Her eyes must have been fixated on the thing for near a minute, but the creature didn’t do anything. The only movement Miria could see was the gentle rise and fall of the afore mentioned mound, which coincided with a quiet breathing.</p>\n\n<p>It was asleep.</p>\n\n<p>Upon realizing this Miria attempted to calm her breathing, to make it as quiet as possible. She slowly turned her head, not looking away. Her eyes then flicked over towards her husband; completely hidden under the covers. She noticed, immediately, the large hand that lay between them.</p>\n\n<p>It was somewhat better illuminated than the rest of the creature.</p>\n\n<p>The skin was still a midnight blue and looked far too tight on the bones and muscles. The arm did have a heavy musculature, but the hands were disturbingly thin. Claws punctured through the fingertips, which look like they had exploded outward only to heal enough to not be bleeding. The claws, while mostly translucent, had a sickening yellow tint.</p>\n\n<p>Seeing this gave her a moment of hesitation. But, only a moment. She sneaked her arm over, careful not to shift her weight or move her legs in any way.</p>\n\n<p>Her hand brushed up against the sheets over her husbands face; it was slick and sticky.</p>\n\n<p>She hadn’t any idea why this might be, but proceeded to gently pull away the sheets. But, just as she did so, she caught, in the corner of her eye, the slightest movement.</p>\n\n<p>Her head whirled towards the thing. Her stomach clenched in fear. Her eyes quickly scanned the area, but she couldn’t see what had changed. The thing was still breathing, back rising and falling rhythmically, but it remained stationary.</p>\n\n<p>Moonlight was beginning to pour even more through the window. And now Miria could see the things head a little more clearly.</p>\n\n<p>She could see now the head was completely bald with wrinkles running the entire length of the cranium. But still she didn’t see what could have made the movement.</p>\n\n<p>She decided to keep her eyes on the thing while she woke her husband.</p>\n\n<p>She moved her hand around the arm and under the sheets, heading towards her husbands mouth. This, hopefully, would keep him from making any noise as he woke.</p>\n\n<p>As Maria’s hand made contact, however, she felt a familiar slick stickiness on his face. It was warm.</p>\n\n<p>Concern filled Miria’s stomach. She turned to look at her husband as she pulled the sheet from his face. She nearly screamed at the defiled corpse of her husband.</p>\n\n<p>His eyes had been punctured through, with gore and blood leaking out the sides and through his nose. His lips had been torn off leaving him with a skeletal smile covered in his blood. A long gash cut him from chin to collarbone, leaving his throat on full display.</p>\n\n<p>Miria could feel bile rising in her throat, but she still did her best to only heave silently.</p>\n\n<p>She turned her head away, warm tears beginning to stream down her face. She moved her hands to her mouth, trying to contain herself.</p>\n\n<p>Moments passed as she quietly sobbed knowing full well her love was now dead.</p>\n\n<p>Her misery did not pass, but it did begin to share its place with a horrendous rage.</p>\n\n<p>Her stomach burned with a singular desire: to grab whatever she could and hit this damned thing as hard as she could for as long as she could, until it killed her.</p>\n\n<p>Most of her wanted to hurt the damned thing and just die. But, a small part of her knew not to. It wasn’t a rational part of her mind telling her it was pointless. Nor the fear in her stomach that was trying desperately to cling to life.</p>\n\n<p>Miria had a daughter. Elizabeth. She was alive, she had to be. Miria couldn’t imagine this world without her. Miria had to protect her child. It rang so clear in her head. Elizabeth, had just lost her father, but Maria would be damned if she was about to let her daughter walk this world alone, especially with this monster still around.</p>\n\n<p>She knew she had to escape; for her daughter.</p>\n\n<p>Her sorrow wasn’t lessened by this, but her resolve had strengthened. And her mind frantically began to analyze the situation.</p>\n\n<p>The door was maybe three meters away. And the floor was carpeted up til the hallway. If she could get out the door and close it quietly, it would muffle the sound of her walking til she made it to Lizzie’s room. From there the two could sneak out Lizzie&#39;s bedroom window.</p>\n\n<p>The only thing keeping her from getting to Lizzie was the fact that her legs were pinned under this damned thing. She would have to slip out somehow.</p>\n\n<p>She looked to the right for anything that might help her. Resisting every urge to peer to the left, knowing seeing her husband again would only make it harder to think straight. A lump reformed in her throat just thinking about it.</p>\n\n<p>Through still teary eyes, she could only recognize the clock and book on her nightstand. The lamp was close by, but she couldn’t reach it without moving; a risk she couldn’t take.</p>\n\n<p>Her first thought was: the book. She could use it to get a small amount of clearance if she could slide it under the monster.</p>\n\n<p>It was soft cover, but still it would be hard to slip it under without awakening the beast.</p>\n\n<p>She would need to soften the movement. For that she needed something soft.</p>\n\n<p>Soft, she thought. Soft like a pillow. She turned her head to see an ample amount of fluffy pillows.</p>\n\n<p>She would have to do this softly.</p>\n\n<p>She grabbed the pillow and slowly moved it toward her lap. However in the middle of this she again saw the flicker of movement from her peripheral.</p>\n\n<p>She froze. Her stomach clenched.</p>\n\n<p>She peered through the corner of her eye. She, again, saw nothing. No unusual movement. The beast still lay asleep.</p>\n\n<p>Her fear was beginning to make her paranoid. Besides, whatever it was, it was nothing she could deal with if she couldn’t escape.</p>\n\n<p>She proceeded to place the pillow under her sheet then between her legs. She slowly massaged the pillow under her legs then pulled either side until the edges stuck out and the pillow was underneath both legs.</p>\n\n<p>She began directing it forwards, careful not to move too fast, her eyes not moving from the damned thing.</p>\n\n<p>It was soon enough, in place; an inch or so below the monster.</p>\n\n<p>Miria looked at the book. It was too late, but she realized how easily this plan could fail. With her only backup being pulling her legs out as fast as possible and hoping that, in its groggy state, the monster wouldn’t chase her until both she and Lizzie had made it out of the house.</p>\n\n<p>She decided to keep that as her plan b. She pulled the book off the night stand and angled it under the pillow, slowly pushing until she saw it one more time. The flicker of movement. This time she could zone in on the location of it. It was the creature’s head. She peered at it again. But, nothing had changed, yet again.</p>\n\n<p>She continued looking though, both morbidly curious and horribly afraid.</p>\n\n<p>She peered at the darkness that consumed the creature’s face. Then she saw it. A glint of light she hadn’t registered before, disappeared behind a veil of midnight flesh. It then reappeared, just as quick.</p>\n\n<p>Horror took Miria as she realized she was staring into a glassy black eye. It was awake. It had been awake, watching her efforts to escape. Until now it had done nothing. But this time, as she stared into its eyes, it saw she now knew it was awake.</p>\n\n<p>From the shadows, a wall of yellowing white daggers appeared. The damned thing was staring at her, smiling.</p>\n</div>\n","author":"C_C_Lorrwich"}