{"rank":"4","title":"Vision's from Hell...part one.","id":"8knpbg","url":"/r/nosleep/comments/8knpbg/visions_from_hellpart_one/","time":"1526760098000","body":"<div class=\"md\"><p>June 30th,1990</p>\n\n<p>Saturday, 9 pm: I was restfully warm as I drank ale sitting by the fire.A bunch of kids from school were here at the bonfire. Everyone talked, laughed and shared jokes. After a while it grew quiet. People were gathered into separate groups. In ours there was myself, Shannon, Jake and Ryan. Shannon is one of my best girlfriends. Ryan is Shannon’s boy toy and Jake is Ryan’s best friend. Anyhow, I needed this night out. The school year had ended and we all have so much time on our hands. Time for what?</p>\n\n<p>I wasn’t sure.Not ready to go home quite yet, we all decided to take the dirt path through the woods to the nearby lake, a popular swimming hole during daylight hours. I wasn’t getting in, I had no swimsuit and the idea of Jake watching me in my undies was just too much to bear. How could I ever? He’s got dazzlingly blue eyes, a chiseled face and a smile that can light a room. The dirt path wasn’t very long and shortly we arrived at the lake and Shannon, attractive, effortlessly confident Shannon was daring enough to strip down to only her little black bra and panties to jump into the lake.</p>\n\n<p>I sat alone beside the lake.&quot;You okay over there, Amy?&quot; Jake asked from the water. Sure, I said. I&#39;m fine. It was more than okay with me. I’d grown tired of socializing and enjoyed my own company. After a while they tired of swimming and we started heading back to where the campfire had been.</p>\n\n<p>We all made small talk, approaching what was left of the party. Then there was a bright light. Someone was shining a light into the woods. Shining the light at something there in the dark. I turned towards the light, it was a boy from school, I didn’t know him well at all. But I often saw him around. He held a flashlight. And he was pointing it at someone.The person had their face shrouded by some type of cloak. Then they backed away, turned heel and walked faster and faster until they were just gone. “Okay…wonder what that was all about?” said Shannon.</p>\n\n<p>“Who knows.” Said Jake. The kid from school was just about to put his flashlight away when something caught his eye. An opening in the ground. “The guy was standing right there” he said. We all approached the carefully dug hole in the ground. A dead rabbit lie still, it’s abdomen had a careful looking incision. Blood matted its fur. There were also small bones I suppose they belonged to other long dead animals and there was a type of book.I picked it up and looked it over it appeared to be old. On it was scrolled some words in Latin. Everyone was circling me, as still as scarecrows. I turned the page to open the book and read aloud...</p>\n\n<p><em>You will see visions from hell</em></p>\n\n<p><em>You will not believe them</em></p>\n\n<p><em>But soon you will beg to be freed</em></p>\n\n<p>“That’s really freaky”, remarked Shannon. “Yeah, it&#39;s odd”, said Jake. “Well, just put it back.” Said Ryan. “Whoever that guy was, I’m sure it belongs to them. Just look at this stuff, a dead animal, small bones that look like other dead animals and now these cryptic poems?” I dropped the book back down in the ground and together we kicked dirt to fill it in. Then we all went back to the area where the bonfire had been. Everyone got into their cars and went home.</p>\n\n<p>Shannon was my ride. We pulled into my driveway at around 12 a.m. “Thanks for inviting me! I needed to get some fresh air and have conversation with someone other than my mom” I said. “Right! Anytime. You know I love you,Amy. “Shannon replied. We briefly hugged and I got out and went up to my house. Mom wasn’t home. Her job as a night nurse kept her busy. I took a shower, put my night gown on and lied down. Soon I was off to sleep…</p>\n\n<p>2 AM: I’m awakened by something. I sit up in my bed. Looking all around the shadowed room, I was just about to file it as a bump in the night, when I heard another sound. In a guttural voice a bit louder than a whisper, I heard a voice say “Run”.Where was this voice coming from? Run from what? The fear that gripped me in that moment was so overwhelming that I could hardly stand it. “Run!” the voice yelled at me.I flung the covers off then and stood,I felt terror weighing me down like a thousand pound anchor.Am I in a nightmare?</p>\n\n<p>I sprinted to my bedroom door and opened it prepared to make a run for the first floor.I made it a few steps.But then I noticed a figure in the shadows.Someone else was already down there.Like they had been <em>waiting</em> for me! The shadowy figure started moving then. It’s steps becoming deliberate and hurried, headed for the staircase now.Something about the way it moved looked abnormal. It took all of my mental faculties not to scream out like the damsels In horror movies.</p>\n\n<p>But this was real and I did not want whoever was down there to get to me. I ran into my bedroom locked the door and made a break for my window, lifting it felt like trying to lift cement. Come on! Come on! I screamed in my head. Whoever it was standing just outside my door now, was jerking at the handle to my bedroom with so much force that the slamming sounded like explosions.Whoever it was , was trying to force its way inside like some hungry, insatiable monster.</p>\n\n<p>I put one leg out of the window and then the other. Carefully maneuvering my way out onto the roof. My foot slipped and I reached for the window sill holding on for dear life. The bedroom door flew open . And I froze. The figure in the doorway stood still for a moment.It had been tugging violently at my door one moment and now carefully still. Suddenly I felt, that this presence was unearthly.</p>\n\n<p>Not something meant to roam .It entered my room. It walked like its legs were mangled and the body looked contorted. It ogled everything. Seeing no one there it started to leave.Then it ran full speed toward the window, grabbed the window sill and leaned out , it’s withered, decayed face in full view now. Partly flesh and partly skeleton. It was what looked to have been a teen boy once.My same age. But this was no boy any longer.</p>\n\n<p>“Come here.You’re already dead!” it shouted and lunged at me. A primal scream ripped from my throat and I crash landed on the ground. The ghastly abomination wasted no time in its efforts to get to me. I heard it’s loud , pounding footsteps running through the house,breaking things and knocking stuff over in its haste to get to me . I bounded to my feet.Ignoring the pain all over my bruised body and I tore down the dimly lit street in fear for my life.In fear of an agonizing death. Hoping and praying that if this was a dream , that someone would save me right now. Please. Wake. Up! But sadly I knew this wasn’t a dream….</p>\n</div>\n"}