{"rank":"5","title":"I Know Where Susan Went","id":"8knzs6","url":"/r/nosleep/comments/8knzs6/i_know_where_susan_went/","time":"1526762888000","body":"<div class=\"md\"><p>The hand is under the door and the fingers run up it like snakes racing after prey, dozens of joints clicking and overlapping as they groped for the knob, until the tip of the many-segmented index brushes the worn brass of the knob and the other four fly to it. Then, the unlocking, the simple turn of the lock from vertical to horizontal, the sharp and broken and grimy nails pushing and pulling until it hears the gentle click of opening. Sometimes it takes minutes for it to find the knob, and longer still for the unlocking as I watch, spellbound and horrified. Other times the door swings open before I even know what&#39;s happening.</p>\n\n<p>The click is the signal for me to close my eyes. I can&#39;t bear to look at it, not even the thought of it, but I can still hear it shuffle toward me, and the smell—like rotting leaves and raw sewage—pooled in the back of my throat. I never have a blanket to wrap myself in, or even a pillow to hide my head under. Just me trembling in my pajamas, on the bed, anticipating the wrap of the fingers around in a bony cocoon. </p>\n\n<p>Once, in high school, my friends had wrapped me in duct tape just for the hell of it, to see what would happen, and the overwhelming thing I remember from that is the tightness of it, how I could barely even strain my shoulders against the tape. The fingers are worse. They&#39;re stronger, and colder, so much colder, so cold my flesh burns when they coil under my clothes and constrict me. </p>\n\n<p>If I&#39;m laying on my stomach, I stay that way, but it flips me over if I&#39;m on my back or side. The air gets chillier and damper, and branches scratch my face, and I open my eyes now. It always takes me here, to the small forest on the outside of the town, somehow hovering and holding me under it like a hideous version of a zeppelin as we float toward a certain white pine I&#39;ve grown to dread. We sink from the canopy to just a few feet above the forest floor, the fingers tightening slightly and the nails biting into my flesh, as we float toward the bones. They lie scattered about the carpet of pine needles. The skull&#39;s eyesockets poking just above the needles, as if it&#39;s peeking warily at me, while the other bones are scattered about and stick stark-white out of the dim orange. </p>\n\n<p>It taunts me, sometimes, putting my face in front of every bone, savoring my discomfort, lingering especially on the skull—the skull that must be Susan&#39;s, who was lost so long ago—and other times it&#39;s content to leave me hanging just a second, the inaudible message of you&#39;re next clearly conveyed as I feel the burning coldness of the fingers begin to tear me apart—and I wake up. I know where Susan went, somehow, some part of my subconscious realizes it, and reminds me every night. </p>\n</div>\n","author":"BlockyTeaThree"}