{"rank":"147","title":"I'm Sick of \"Yanny or Laurel\"","id":"8ko6yc","url":"/r/nosleep/comments/8ko6yc/im_sick_of_yanny_or_laurel/","time":"1526764822000","body":"<div class=\"md\"><p>By now you have probably heard the debated audio clip of “Yanny or Laurel”, but if not, here:</p>\n\n<p><a href=\"https://www.youtube.com/watch?v=7X_WvGAhMlQ\">Yanny or Laurel</a></p>\n\n<p>Are you hearing the pronunciation of Yanny or Laurel? The debate has divided the internet and spun the social media compass the last few days. This trend has gotten plenty of attention, caused conversations, then quickly died into the millennial’s memory with Shiny Legs or Paint and Kim Kardashian’s butt breaking the internet. However, Yanny or Laurel is different from a video or image since it is purely auditory. </p>\n\n<p>The explanation is in how your brain processes the information with different frequencies. High frequencies yield Yanny and lower frequencies yield Laurel. My friends are divided with most of them hearing Laurel, but I’m hearing neither. At first I thought it was a joke my friend Sam was playing. Gaslighting me is easy with my gullible attitude, but every audio clip I found online sounds nothing like what everyone else was talking about.</p>\n\n<p>“I am the Yanny, whom grows in your head, I am the Laurel, whom rises from the dead.”</p>\n\n<p>The automated voice quickly repeats this phrase over and over. It doesn’t matter the website, volume, frequency or originator, they all say the same thing. To my dismay after my friends never gave up on their alleged joke I realized they weren’t hearing the same phrase. I even called distant relatives, knowing they couldn’t be in on a joke, only to have them repeat the same as my friends.</p>\n\n<p>I was the only person hearing it.</p>\n\n<p>“I am the Yanny, whom grows in your head, I am the Laurel, whom rises from the dead.”</p>\n\n<p>Speculating the fad would go away shortly it has only increased over the last few days. What was quickly picked up and forgotten by America’s young has made its way to their parents. Media socialites, YouTubers, new’s hosts and Redditors have pulled the audio clip into the mainstream. Articles have been published giving opinions from scientists and experts. Everyone seems to be having so much fun.</p>\n\n<p>Except me.</p>\n\n<p>It started several hours after initially hearing the audio clip. Whispers of “Yanny” in the break room. The usual “ding” of the elevator was replaced with a high pitched “Yanny”. A crow outside my office window kept cawing “Yanny”. I thought I was losing my mind.</p>\n\n<p>The next morning, to put myself in a better mood, I wore my favorite dress and had breakfast at my favorite diner before work. It didn’t help. Everyday noises were replaced with subtle nuances of “Yanny”. My mother text me “Yanny” over and over. I asked her why she kept sending me the same message which persuaded her into calling me to only exacerbate the situation. I immediately started crying when the only words from her mouth were bellows of “Yanny, Yanny, Yanny”.</p>\n\n<p>Every coworker would smile, wave and say “Yanny”.</p>\n\n<p>Every client that called would greet me with “Yanny”.</p>\n\n<p>Every email was To: Yanny, From: Yanny, Subject: Yanny</p>\n\n<p>Even the brand of snacks I brought to work were labelled “Yanny”.</p>\n\n<p>I couldn’t make it past lunch. Although every key stroke I pushed furthered the spelling of Y - A - N - N - Y, I did my best to email my boss. I told her I would not be coming back to work after lunch due to a medical emergency. I hoped her “Yanny” response meant “That’s fine. Get better soon”.</p>\n\n<p>I returned home, took some leftover prescription pills and went to sleep.</p>\n\n<p>This morning I woke up covered in sweat. I slept throughout the night, but still felt exhausted. My muscles ached, my back tinged with pain and my hands were covered in blisters. By then every piece of text spelled “Yanny”. On my nightstand was my Yanny Macbook, my Yanny Kate Spade purse hung on my doorknob, and my Yanny Yanny Yanny sorority picture laid on my stack of Yanny electric bills. I got up to make a pot of Yanny Keurig coffee but froze after hopping out of bed.</p>\n\n<p>I was covered in dried caked-on dirt. Dirt collected in my hair and twisted around my roots. Bits of grass and rock fell off as I searched my apartment only to find a muddy trail into my jacket closet. The doors were closed but the interior lights were on. The yellow light called from under the doors like a beacon. I followed the trail and after a deep breath threw open the closet doors.</p>\n\n<p>A muddy shovel laid at the bottom of my closet. The edges were slightly dented from use. The foam handle was compressed. The entire shaft was obscured with dirt and grime. I recalled my blistered hands and wondered what I had been doing all night? I didn’t remember anything. That’s when I noticed what was hanging above the shovel.</p>\n\n<p>All of my jackets had been tossed on the ground. In there place hung the favorite dress I had worn the previous day to work. I don’t remember leaving it on, but it was covered in mud . . . and blood.</p>\n\n<p>I looked back at my phone for clues, but was halted with “Yanny” at every finger tap. I can’t remember what I did or if I did anything. Is anyone else having these troubles?</p>\n\n<p>I don’t know what happened last night but I regret hearing the “Yanny or Laurel” audio clips. On top of all that my once favorite dress is giving me difficulties. </p>\n\n<p>After cleaning it off I can’t tell if it’s black and blue or gold and <a href=\"http://drelsewhere.com/\">white.</a></p>\n</div>\n","author":"DrElsewhere"}