{"rank":"0","title":"The Mill","id":"8koji8","url":"/r/nosleep/comments/8koji8/the_mill/","time":"1526768236000","body":"<div class=\"md\"><p>Me and my friends were always adventurous. It was me and one of my guy friends and one of my friends who was a girl. we always were going Hiking and planning trips. One day one of my friends said he had a plan. We should visit the half burned down mill. I had my hesitates but my other friend liked the idea. Rumors always were spread about the souls of animals that died during the industrial revolution. We planned it on a Saturday night.</p>\n\n<p>That night we followed the train tracks to the mill. (this is VERY illegal because it is trespassing and the horrible state of the building) We go into the basement first as it is how we get in. We go to the indoor stables that housed the animals long ago. My friend climbs into the stable saying it&#39;s not haunted. A black figure that looks like an old timey mill worker appears behind him and he touches my friends cheek and disappears. My other friend grabs my arm as she is clearly spooked. My friend climbs out of the stable quieter than he usually was. We continue down the building and we find four old toys and my friend (the one who climbed into the the stable) moves one and is immediately shoved back and we walk away. On the way out there is a little girl saying “leave before he gets you” I just assume she was talking about another spirit.</p>\n\n<p>About halfway down the building to get out we hear police sirens. We all break into a Sprint. My friend (the girl) trips and my other friend stops to help her and tells me to keep running. I do hesitantly. I get out and the cops don&#39;t catch me and call off the search after about an hour or so. I don&#39;t find my friends the rest of the night and thought they must’ve dipped to their houses.</p>\n\n<p>The next day the police are at my door saying my friends were reported missing. I confess and tell them we were in the mill. I am a suspect for a day or two until my friend (the guy) shows up and seems a lot quieter than before. He is questioned and says he lost my other friend escaping the police. </p>\n\n<p>The next night they find him trying to dump his dead body in the canal that once powered the mill. The found a pocket knife that was used to kill her. A black bladed pocket knife that had a black spider web design handle with red spider design. I quickly identify it as the personal pocket knife of the friend that killed the other. </p>\n\n<p>The police have me be one of the people to tell the family of my friend that their daughter was dead. The mourned for over a year.</p>\n\n<p>My friend was sent to jail immediately. I was a witness at the trial and I explained how we got in and how we ran when we heard the cops and how he told me to keep running. He is sentenced 75 years. As he left he said the little girl was right. We should&#39;ve looked out for him. He told me to kill her and I love the idea of it even now.</p>\n\n<p>As I leave the courtroom I realize that the spirit touched his cheek and disappeared and went into my friends body.</p>\n\n<p>I am on one of the lead members of the people helping tear down the mill. I am still only fifteen. I hear the little girl still and she tells me where the man is that day. I tell the people helping tear it down because they cannot hear her.</p>\n\n<p>It seems only me and my friend could hear her. Only I listened. I finally realized she was talking about him.</p>\n</div>\n","author":"WaufleIron"}