{"rank":"8","title":"Northern California woods encounter","id":"8kojq4","url":"/r/nosleep/comments/8kojq4/northern_california_woods_encounter/","time":"1526768301000","body":"<div class=\"md\"><p>I&#39;m a 18 year old male, and this took place last year. Last summer in June, I went camping in the woods in Northern California, which I was told were a beautiful place if you want to get away from the big cities. My friends and I had saved up money to spend 2 weeks in a pretty big cabin next to a decent sized lake. We drove about 3 and a half hours to our destination and were in awe of how awesome the area was. Our first day was spent setting things up in the cabin, such as kitchen supplies, beds, a way to keep clothes warm, medicine, and a place to store the guns we brought. It should be noted, that there were 7 of us, and we had brought three .22 rifles that were from my side of things, a .44, and 3 lever actions. If you were to ask us why we went to such an extreme length to be armed, it was because we were told by people that bears and mountain lions would always be in the area, and that a family had a bad run in with a lion that hospitalized one of the kids, who somehow survived the encounter, but I digress. Anyway, we had just finished preparing things, so me and my two friends went out to the lake to scout out the area for fishing tomorrow. The lake was very clear, and we saw fish such as Trout, bluegill, bass, and the occasional carp. We were walking back, when we thought we saw something across the lake. The figure had been moving behind some trees and didn&#39;t seem to notice us until my friend accidentally made a lot of branches fall into the water. Like I said, there are dangerous animals around the area, so we walked pretty fast to the cabin. We didn&#39;t tell the rest of the group what we saw, as we didn&#39;t want the camping to be cut short by a few days. We shrugged it off and all went to bed. </p>\n\n<p>The next three days were uneventful, and were full of fun activities, and for me, some alone time with a female in bed. On the Saturday, me and the two guys in the group got our rifles and went hunting for small game, as we were going to make lunch and save the rest for dinner. We walked around the area where we had seen the figure a few days ago, and were hoping it had moved on and there was small animals in the area. After walking up a hill and getting to the top, we sat down and were talking about how we should have gone fishing, when, my friend gets hit in the chest with a rock that makes him swear and hold his chest. Me and the other guy, James, go to look at it, when another rock flies by and misses us. We thought it was one of the girls playing a crude joke, but what we all saw, made us get back to the cabin and lock it down for the remainder of the stay. It was large, hairy, and had the biggest teeth I had ever seen on something like it. The guys flipped out and sprinted down the hill, shouting across the lake for everyone to get inside the cabin. We could hear growling from where we were, and James flipped around really fast to shoot his .44 in the direction to scare whatever it was away. When we got back, all we heard was the rest of the group panicking and scared as hell.</p>\n\n<p>&quot;What was that! That is not a bear or a lion. It is the same damn thing we saw on the first day.&quot; James said, he was probably the most afraid out of all of us. The girls ran inside after us and locked the door and put the unused table in front of the door. That night, everyone stayed up around the fireplace, and began talking about possibly going home in two to three days. As we were talking, we heard branches breaking and a splash of water coming from the lake area, which is about 500 feet away from the cabin. Guns were drawn and we all hid away from the windows. Silence followed, and the girls really wanted to go home, away from the area. The silence that had lasted 5 minutes was broken by loud thumps coming from all directions. The girls screamed and all three of us guys shouted and made a lot of noise, which seemed to work for a hot minute, and that was when a large log came bursting through the window. Out of fear, I wildly shot my .22 at the area. I hit something, and saw a large figure sort of jog away from the area. I quickly boarded up the window and huddled everyone upstairs. For the rest of the night, we were on edge and scared, and one of the girls began to cry hard. When morning came, we opened the door to see the side of the cabin had scratches and cracks in the wall. There were footprints leading to the edge of the lake. But, there were more than one set. It looked like there was a group of whatever it was outside, so we packed our stuff and got ready to leave. We had to drive around 6 PM, and as we were driving away, we saw another car in the area, with people, who said they also had an encounter with the mystery animals, and had to also flee the area. Our group hasn&#39;t gone to the area since, and we all still talk about it to this day. Scariest damn thing that happened to me, and I don&#39;t know what those things were....</p>\n</div>\n","author":"Waterhickory98"}