{"rank":"32","title":"The Toy Train","id":"8kos12","url":"/r/nosleep/comments/8kos12/the_toy_train/","time":"1526770606000","body":"<div class=\"md\"><p>When I was around five years old, my little brother passed away. He was two months old when he died and his untimely death broke my family.</p>\n\n<p>As a little girl, I didn’t understand death. I remember the day we found him.. The day I found him. I was going to wake my parents up and there he was, laying between my parents, his purple face still etched into my brain all these years later..</p>\n\n<p>My mother was an emotional wreck from the entire thing and essentially the loss and stress of it all caused her to have health issues I won’t get into.. My dad was broken as well, but showed it in a different way.. He would sit down in this room with his buddies, smoking weed with the music cranked whilst my mother looked after me with a broken heart.</p>\n\n<p>Time went on, and the pain still shook the core of my family, but they had to work through it because of me, being a helpless little girl.</p>\n\n<p>One night, when I was probably around six, I had been at my grandfathers house for the night and my parents were home and had a few friends over. My mother had been upstairs alone and my dad was downstairs with his friends. One of the friends came upstairs and my mom and him had idle chit chat.</p>\n\n<p>In the midst of their conversation, my mother heard noises come from my bedroom. It was music, almost like from a toy or something. Clearly confused, my mother proceeded to go into my bedroom and peek into the darkness. What she discovered was that my favourite toy train was randomly playing music by itself.</p>\n\n<p>Now this toy train was actually a caterpillar. It had buttons along the top if that were multicoloured and when you pressed them, it played music and lit up essentially. Knowing this, my mother was quite startled because this colourful caterpillar train was going off all by itself.</p>\n\n<p>My frazzled mother flicked on the light and went to this toy, accidentally touching more buttons and making the loud music ring through the bedroom again. After fussing with it, she managed to get find the spot for the batteries and took them out as quickly as she could..</p>\n\n<p>Setting the toy down, she let out a sigh and left the room, flicking the light off behind her. </p>\n\n<p>She essentially told the friend about the whole ordeal that just happened and he was quite confused by it all too. After minutes of starting another conversation, the two forget about he situation that just happened and continued to talk, not having a care in the world..</p>\n\n<p>But then, the toy train went off and my mother froze.. Hadn’t she just taken the batteries out? The music once again rang through the darkness of my bedroom and she quietly approached it. Her hands trembled as she flicked on the light, and there it was, that far too familiar caterpillar train, lighting up on my bed and playing music. </p>\n\n<p>To this day, my mother remembers that story like that back of her hand.</p>\n\n<p>She knows wholeheartedly that it was my little brother, playing with that train, with or without batteries.</p>\n</div>\n","author":"cuddlyandsmall"}