{"rank":"33","title":"The Constant","id":"8kotaf","url":"/r/nosleep/comments/8kotaf/the_constant/","time":"1526770953000","body":"<div class=\"md\"><p><em>A Constant: Something that is invariable or unchanging, such as a fixed number or a logical term.</em></p>\n\n<p>It had been one of those days when everything went wrong. After getting up I bumped my head, causing a giant bruise and an ongoing headache. Then I missed my train, couldn&#39;t find a taxi and arrived half an hour late for work.</p>\n\n<p>It wouldn&#39;t have been a big deal if it wasn&#39;t the exact day of a meeting with a valuable customer. He ended up leaving as I arrived. My manager informed me that this would have serious consequences. That promotion I&#39;d been working for, he said, I could forget about it.</p>\n\n<p>When I finally arrived at home, after hours of overtime, I had a quick meal. It was the precooked microwave type.</p>\n\n<p>I went on Netflix and clicked through the list of series and movies for a bit. Then I closed my browser again. For a while I sat in my chair, contemplating going to bed. </p>\n\n<p>Instead, I decided I&#39;d go for a walk. After a day like that, I needed to unwind. My phone showed me that it was a gentle and mild night. So I went on my way.</p>\n\n<p>As I locked the front door, the idea of walking out and never coming back crossed my mind. It didn&#39;t sound bad, I thought.</p>\n\n<p>By now night had fallen, and I walked along the almost empty roads of the city. </p>\n\n<p>At first, I had only wanted to take a short walk, a couple of minutes to unclog my mind. Now though, I found myself walking on. I saw people here and there. Otherwise, my only companions were street lights, lighted storefronts, and neon signs.</p>\n\n<p>I didn&#39;t know how long I&#39;d been walking when I reached the big river dividing the city. For a while, I looked at the dark, cold waters rushing past me. Then I continued alongside the riverbank. </p>\n\n<p>As I checked my phone, I saw that it was almost midnight. I should be at home in my bed, sleeping, I thought. Somehow I didn&#39;t care about that right now.</p>\n\n<p>I had followed the path for a quarter of an hour when I noticed a hill ahead of me. It seemed as if it had appeared out of nowhere. How did I not see it until now? Was there even a hill like that in the middle of the city? I shrugged it off. I must have walked further than I thought and reached the outskirts already.</p>\n\n<p>Once I was closer, I saw a small path led up the hill. Two wooden pillars marked its beginning. They formed a sort of gate. For a moment I searched for a sign, but then I decided to follow the path. </p>\n\n<p>On one side was the steep, dark hill, on the other I was able to look over the city. I continued onward and noticed that the path ahead of me was illuminated. It was a paper lantern mounted on a small stone pillar. The first of many. Their dim light was barely enough to illuminate the ascent. Instead, it filled the area around them with shadows and figures that weren&#39;t there.</p>\n\n<p>The walk seemed to go on forever. As I got further, I started to hear noises. At first, it was only faint, but soon I was able to make out voices. It must be coming from the top of the hill, I thought, and looking up I could see lights. </p>\n\n<p>With each step, more voices reached my ears. The light too grew brighter. </p>\n\n<p>When I finally reached the top, it surprised me how many people there were. In the dim light, I could make out dozens, or even hundreds of forms. Some were sitting in front of smaller fires. Others were dancing. </p>\n\n<p>There was low music playing. It was a cacophony of sounds and humming that came together in a ghastly, almost hypnotic melody. It was strangely enticing, calling me forward to join the dancers.</p>\n\n<p>What sort of festivity was this? Wasn&#39;t it the middle of the week? </p>\n\n<p>As I watched them, some of these dancers were shifting and moving their bodies in strange ways. They were entangling each other like snakes, only to separate again, moments later. I wasn&#39;t sure what I saw in what little light there was.</p>\n\n<p>Standing there, I felt misplaced. What strange gathering had I stumbled upon here, I thought. It was probably for the best if I left. </p>\n\n<p>When I turned around, I froze up.</p>\n\n<p>For a second I saw the familiar outlines of my city, the buildings, the streets, the lights and the parks. Then a sprawling, greenish-black metropolis replaced it. It was an unplanned, grown-together mess, more organic than architectural. It reminded me think of a giant colony of mushrooms and not a city. A bluish light illuminated the many different levels and areas of this abominable city. </p>\n\n<p>While I still tried to understand what was going on, things in front of me shifted once more. The mushroom city was gone, and now I saw an almost empty plain. Here and there I could make out groups of tents and hairy beings that shuffled around them.</p>\n\n<p>Moments later an alien landscape replaced the plain. It was a dark, grey floor, from which strange whitish things extended into the sky. At first, I thought they were constructions, but soon I saw what they were. It was gigantic living organisms. Those giants stood unmoving, their many arms wrapped around their bodies. They were towering over the hill in sheer endless rows. I shuddered when I saw their faces. They all were looking upwards at the sky in a haunting, almost pleading expression.</p>\n\n<p>Then I saw my city again. </p>\n\n<p>&quot;What was that just now? What had I... seen? Am I hallucinating?&quot; </p>\n\n<p>I looked around and smelled the air, but there was nothing. Everything was normal. No one else was alarmed. Was I the only one that had noticed it? Before I could follow that train of thought, my city vanished once more.</p>\n\n<p>This time it changed to an endless blue ocean, under which I saw a shadow of colossal proportions. As I watched on, I it moved closer to the surface. The waves exploded into foam, but I didn&#39;t see what revealed itself.</p>\n\n<p>Right at that time I felt a hand on my shoulder and jerked around. Behind me stood a figure in dark cloth. An equally dark mask was hiding its face.</p>\n\n<p>&quot;First time here, struggler?&quot; the figure asked me. Its voice was calm, almost reassuring.</p>\n\n<p>After my initial shock was gone, I nodded.</p>\n\n<p>&quot;You are lucky to have ended up here and not in one of the other places.&quot;</p>\n\n<p>&quot;Wait, what is this place? What sort of gathering is this?&quot;</p>\n\n<p>And then I pointed at what had been a giant ocean moments before.</p>\n\n<p>&quot;And what the hell is this!?&quot; I asked.</p>\n\n<p>By now reality had changed into a scorched plain, covered in fire and volcanic ashes. In the back, I saw a massive, flaming mountain. An endless army of dark creatures flooded from a crack in its middle.</p>\n\n<p>&quot;Just one of the many manifestations of reality.&quot;</p>\n\n<p>I turned towards my interlocutor with an empty face. What the hell was he going on about?</p>\n\n<p>&quot;Are you trying to tell me that those are different dimensions or something?&quot;</p>\n\n<p>I must be dreaming, I thought. I had most likely fallen asleep in front of my computer. None of this could be real.</p>\n\n<p>&quot;That would be much too easy an explanation. The form a reality takes always depends on those who are looking at it.&quot;</p>\n\n<p>&quot;Then why are they all so horrific?&quot; I asked as the sight in front of me shifted once again.</p>\n\n<p>&quot;What makes you think they are horrific?&quot;</p>\n\n<p>I looked at him and then at the muddy plain beyond. Disgusting, hairy insectoids populated it.</p>\n\n<p>&quot;But this is just...” I blurted out.</p>\n\n<p>&quot;It might be for you, struggler, but what would they think about your reality?&quot;</p>\n\n<p>I couldn&#39;t answer. How could I. This whole thing was absurd, yet I understood the implication he was making.</p>\n\n<p>I couldn&#39;t see my new friend&#39;s face behind the mask, but somehow I knew that he was smiling.</p>\n\n<p>&quot;So, what is this place up here?&quot; I asked once more, this time in a more demanding tone.</p>\n\n<p>For a moment he was quiet and seemed to watch yet another manifestation of reality with interest.</p>\n\n<p>This one was normal enough. It was a land covered in lush, green vegetation. Scores of white creatures moved around atop the trees. They were too far away to recognize their features, but they were scarcely human. After a while, my interlocutor spoke again.</p>\n\n<p>&quot;We are at a <em>constant</em>.&quot;</p>\n\n<p>When he saw the look on my face, he started to explain.</p>\n\n<p>&quot;A constant is a place in the net of the different manifestations of reality that is always the same.&quot;</p>\n\n<p>&quot;How did I get here?&quot;</p>\n\n<p>&quot;There are many ways one can stumble upon such a place. Many do, but only a few ever realize it. Others search them out, like them.&quot;</p>\n\n<p>With that, he pointed at some of the dancers behind us that were moving around their small fires.</p>\n\n<p>&quot;But how did I get here? I was taking a walk, and this hill appeared out of nowhere.&quot;</p>\n\n<p>My interlocutor giggled.</p>\n\n<p>&quot;So that&#39;s how it was.&quot;</p>\n\n<p>I waited for him to say more, but he kept quiet. For a while I stood there, next to him, looking down as one horrific reality followed after another. At times I thought I saw my city again, but I couldn&#39;t be sure. </p>\n\n<p>&quot;How do I get back? Do I wake up?&quot;</p>\n\n<p>&quot;Wake up from what?&quot;</p>\n\n<p>&quot;I am asleep, aren&#39;t I? This is all a dream, right?&quot;</p>\n\n<p>I got no answer.</p>\n\n<p>&quot;Oh come on,&quot; I cursed to myself, &quot;stupid brain. Ok, did I pass out? Am I at the hospital? Did I die? What is it?&quot;</p>\n\n<p>With that, he started to laugh.</p>\n\n<p>&quot;None of those. You are wide awake. You are here. At this very moment, this is your reality.&quot;</p>\n\n<p>After a short pause he continued, but this time he was musing on, more to himself, than to me.</p>\n\n<p>&quot;Your kind is strange, struggler. I have watched countless manifestations in the net of realities. There are so many different ones, but yours is one of those that still puzzles me. It is so closely influenced, yet so reluctant to see. Everything, all hints, all touches, you call them illusions, hallucinations or dreams.&quot;</p>\n\n<p>A shiver went down my back as I listened to these words. I wondered what he was talking about. Why are his words so cryptic, I thought. Was he talking about religion? About God? About iracles? Or something completely different? I was about to ask again, as the low music around us stopped.</p>\n\n<p>The twisting, dancing bodies all came to a rest. Finally, a new fire was lit in the middle of the procession. At first, it was nothing but a small flame. Within seconds it grew into a large purple fire before it became a column that extended into the sky. Further and further it reached, and for the first time, I looked at what was above us.</p>\n\n<p>Instead of the night sky, there was an immeasurable amount of stars. It was if space itself was alit. I could see strange, glowing, translucent beings that moved between them. They reminded me of spiders, because of their many limbs.</p>\n\n<p>&quot;What are...?”</p>\n\n<p>&quot;They are the menders of reality. Gods that are endlessly creating, fixing and changing all these different realities. They dangle from the net of reality itself, tending to it and ever extending it.&quot;</p>\n\n<p>For a long while, I watched the glimmering beings. I watched as they crawled on the thin, almost invisible net that was spanning between the stars.</p>\n\n<p>I noticed too, certain darker parts, which were devoid of stars and light. I turned back to ask my interlocutor about those.</p>\n\n<p>By now though, I could make out many of the other dancers. I cringed back a few steps in sheer fear and disgust. I had to cover my mouth not to scream out loud. What I had thought were unnatural twisted dances, was their true nature.</p>\n\n<p>&quot;What the hell are they!?&quot; I asked in shock.</p>\n\n<p>&quot;The same as you. Strugglers that came here as you did, some by accident, others by their own, free vocation.&quot;</p>\n\n<p>I scanned the group of monstrous strugglers around the pillar of purple fire. Some were humanoid. Others looked like wild beasts. I saw a twisted abomination of grown together flesh that almost made me gag. Another one was nothing but a shifting mass of light and particles. </p>\n\n<p>It took me quite a while before I was able to avert my eyes from the spectacle.</p>\n\n<p>&quot;So you are a struggler, too?&quot; I asked him.</p>\n\n<p>&quot;No. I am a guide. I am here for strugglers like you who recognize that they are at a different place. I help to bring context, to explain things and to keep order where order is needed.&quot;</p>\n\n<p>&quot;Keep order, where order is needed?&quot; </p>\n\n<p>He chuckled for a bit before answering my question.</p>\n\n<p>&quot;To make sure you find your way back.&quot;</p>\n\n<p>&quot;Are you a human like me, then?&quot;</p>\n\n<p>&quot;I take the form that is easiest to comprehend and speak the language you speak. My appearance differs, depending on who it is that comes here.&quot;</p>\n\n<p>For a while I eyed the guide, thinking about what his true form must be.</p>\n\n<p>Then I turned towards the pillar again.</p>\n\n<p>&quot;What&#39;s up with the fire?&quot;</p>\n\n<p>&quot;It&#39;s a ritual. They are calling on beings from outside to visit this constant. In rare occasions, it is the menders you saw before. Those you see here, they hope to learn, to be enlightened by a share of their knowledge. They want to know the secrets of reality itself. Only a select few were ever deemed worthy. But it can and did happen before.&quot;</p>\n\n<p>&quot;To learn the secrets of reality?&quot;</p>\n\n<p>A strange desire was kindled inside of me. Understanding all this? Getting knowledge that no else had? It was strangely alluring? </p>\n\n<p>&quot;Be warned though. The menders are much too busy. Most of the time it is <em>other</em> beings that visit. It is the dark influences from outside who prey on those who want to learn. They will try to taint their mind.&quot;</p>\n\n<p>For a moment I shuddered as I thought back to those dark areas in the sky. Not even the menders seemed to visit them. What horrors must lurk there, I wondered?</p>\n\n<p>The strugglers near the pillar stepped closer, turning their faces upwards. A strange curiosity overcame me. I almost rushed forward, to push myself between them.</p>\n\n<p>Suddenly the guide next to me cringed back. Fear washed over me as I noticed the defensive posture he had taken.</p>\n\n<p>I had no time to react. In an instant, the stars above us were blotted out as the sky turned into thick, heavy darkness. Then, for a short, terrible moment, I saw something different that almost broke my mind. I can&#39;t hope to describe what it was. </p>\n\n<p>Once it was over, I found myself on the ground. I was breathing heavily, covered in sweat and my heart was beating against my chest. </p>\n\n<p>For a moment the sky stayed dark. Then it turned back into the ocean of stars it was before. The flame pillar was gone. </p>\n\n<p>Many of the other strugglers were on the ground like me, and I knew it had not been a benevolent visitor. I wondered if the few that were still standing had been waiting for this other type.</p>\n\n<p>Still scared I looked at the guide once more.</p>\n\n<p>&quot;Are we in danger?&quot;</p>\n\n<p>He laughed again.</p>\n\n<p>&quot;There is no danger at a constant. These are the rules. You can teach, and you can haunt. You can invite or reject. Yet, you can’t do anything without the will of the one you want to influence. That&#39;s how it has been established.&quot;</p>\n\n<p>I didn&#39;t try to understand what he was saying.</p>\n\n<p>By now many of the other strugglers got up. They soon moved away from the remains of the pillar and walked towards the path ahead.</p>\n\n<p>&quot;Is it over?&quot;</p>\n\n<p>The guide nodded. </p>\n\n<p>&quot;So I have to leave as well?&quot;</p>\n\n<p>&quot;No. There are no rules like that. Stay or leave. Relight the pillar or leave it as it is. It is all up to you.&quot;</p>\n\n<p>What a strange dream this is, I thought. For a moment I considered relighting the pillar to chance another visit. Then I changed my mind.</p>\n\n<p>&quot;How do I find my way back?&quot;</p>\n\n<p>&quot;You follow the same path you used to get here. That&#39;s all there is to it.&quot;</p>\n\n<p>For a moment I didn&#39;t know what to do, then I gave the guide an awkward nod and went on my way. I wondered if there&#39;d be any of the other strugglers on their way with me, but the path was empty. Was this path was only for me?</p>\n\n<p>As I descended the hill, I looked towards where my city should be and saw yet another terrifying world. I saw thousands of metallic monoliths that housed disgusting, slimy organisms. I felt sick as I looked at them and instead I focused on the path ahead of me.</p>\n\n<p>For a moment I wondered why the path looked the way it did. Then I remembered the words of the guide. If he took on the form easiest to comprehend for me, then did the constant itself too? Did it look different for all the other strugglers?</p>\n\n<p>At the end of the path, I mustered up my courage to look away from it once more. This time it was unmistakably my city. As I got closer to the end, I wondered what would happen if I ignored the gate and crossed over from where I was.</p>\n\n<p>The thought of ending up in one of the nightmarish visions I had seen made me discard the idea in an instant. </p>\n\n<p>When I reached the end of the path, I hesitated for a moment. Once I was sure it was my city I stepped through the gate. </p>\n\n<p>I was back on the path along the riverside.</p>\n\n<p>Next to me was the familiar dark river and on the other side was the glowing city. I turned around to look at the hill one last time, but it had vanished. </p>\n\n<p>Checking my phone revealed that it was still only around midnight. It felt as if I&#39;d spent hours on the hill, at this <em>constant</em>. In reality, though, no time had passed at all. </p>\n\n<hr/>\n\n<p>Even now, weeks later, I am not sure what happened that night. The next day, life went on as it did before.</p>\n\n<p>It felt like a dream. Had my mind drifted off while I walked or stood near the riverbank?</p>\n\n<p>Somehow though, I can&#39;t seem to shake off what the guide said about our reality:</p>\n\n<p>&quot;It is so closely influenced, yet so reluctant to see.  Everything, all hints, all touches, you call them illusions, hallucinations or dreams.&quot;</p>\n\n<p>The more I think about it, the more I am inclined to search for these influences, these signs. If only to prove that <a href=\"https://www.facebook.com/r.rehnwriter/\">what happened that night was real.</a></p>\n</div>\n","author":"Rakushasu"}