{"rank":"18","title":"My prison cell mate","id":"8koulq","url":"/r/nosleep/comments/8koulq/my_prison_cell_mate/","time":"1526771332000","body":"<div class=\"md\"><p>When I was 18 years old I did some really stupid stuff. Me and my friend stole some cars and after my friend crashed his, the police got his DNA from inside the car and managed to prosecute us.</p>\n\n<p>I was sentenced to 9 months in prison. I was sent to a prison in South Yorkshire for for the first 3 weeks but then afterwards I was thankfully sent to Northallerton prison in North Yorkshire, which was only about 45 mins from my home town.</p>\n\n<p>Northallerton HMP is said to be one of the oldest serving prisons in the United Kingdom. From outside it looks like a dungeon, and from inside it looks like a typical prison you would of seen in any 1960s TV sketch set in a jail. My first week I was on an indication wing, first night was OK, took a while to fall asleep but wasn&#39;t too bad. The second night however was one of the most frightening experiences in my life.</p>\n\n<p>There was only me in this cell, one bed, toilet a sink and a big box type thing to store clothes in where the TV would sit on top. After I had finished reading in the early evening I decided to watch a bit of Tele, it must of been around 11pm and I switched the TV off to go to sleep. There was always crazy people shouting around and people banging on doors and what not, but after everyone had settled down I was just about to fall asleep when I heard breathing. Not my breathing or anything outside the cell, but full on heavy breathing, as if someone was stood in my cell, fast repatative breathing. MY heart started to pound, so much so that it started to drown out the sound of the breathing as I hid underneath my cover, after a minute or two I had calmed down and convinced myself it was the heating or something like that. I listened, and for a few seconds didn&#39;t hear anything. Then to. My horror it started again, I wanted to run out my cell and run all the way home. I was filled with dread, the feeling of been locked in a room with a sound that I couldn&#39;t explain, a sound I couldn&#39;t escape from. I couldn&#39;t even tell the guards, what could I of said. I was in the cell for 10 days, and probably around 4 or 5 nights I could hear the breathing, I started to ponder who it could of been, and if he committed suicide in my very cell or maybe was murdered by another inmate. When I was moved to the main part of the prison I was so releaved and obviously couldn&#39;t wait to leave that cell.</p>\n\n<p>Prisons are full of energies, negative, positive and mixed. I met some really evil people in prison, murderers and rapists, and some of the feelings from these people are horrible. I once played table tennis with a man that had cut someone&#39;s ears off, I didn&#39;t know it at the time but when I was told I felt a little disgusted. I&#39;m so glad I was moved from the first prison as I really didn&#39;t think I belonged to be with those people. The second prison where I experienced hearing the breathing in my cell was a lot better, even if I was experiencing some not so nice noises at the side of my bed. When I was transfered onto the real wing, after my induction I was paired up with a guy from Hull. He was a little strange, and wanted to keep in contact with me after I got out but I just wanted to forget about everything of that time in prison. Apparently a few months before I arrived a young lad hung himself in a cell across the hallway and he died. I can&#39;t conform if that really happened or not, but it really wouldn&#39;t surprise me. I saw people been bullied in prison, and it wasn&#39;t nice. Like a pack a hyenas ripping into a dead body on a daily basis. Some kid was so scared he didn&#39;t even shower because he was constantly picked on.</p>\n\n<p>If I can give some advice, stay away from trouble. I used to think I was some rebel not made for this modern day society and that I would make my own way. And I would make my own money somehow without having to work completely honest for it, but I&#39;ll tell you something. You don&#39;t feel like much of a man went your bent over and a guard is inspecting your asshole for drugs or a mobile phone. </p>\n</div>\n","author":"Rumlad1122"}