{"rank":"5","title":"Be safe when your in the woods","id":"8kovks","url":"/r/nosleep/comments/8kovks/be_safe_when_your_in_the_woods/","time":"1526771621000","body":"<div class=\"md\"><p>So I’m 16 and me and my dad decided to go visit my pawpaws house out in the country. His house is not very big but his land is huge. And to give you a better picture. My pawpaws dad owned that land before him and it was used for raising cattle. Now that land is not used for anything and it’s very over grown with trees. Well now that you got the picture let’s cut the main reason why I’m saying all this.</p>\n\n<p>So my dad just bought a new Can Am ATV and we wanted to go riding in the woods for fun. Well we went and bought 2 machetes and 2 pairs of boots to go back there and clear some trails throughout my papaws land to ride the ATV. Well behind the land is a very bad neighborhood where a lot of drug addicts live. </p>\n\n<p>We got to the land and then cut right to the chase and adventures into the woods. We were greeted with sticker bushes and very overgrown land. It was very difficult to clear but we got the hang of it very soon.</p>\n\n<p>We soon came to a small clearing very close to the edge of our property. We saw a shack that was very poorly made. It wasn’t big at all almost like a shed that was about 7ft y’all and about 5 ft wide. It was very rusty and looks to have been there for a while. </p>\n\n<p>Me and my dad got pissed because we soon realized that someone was on our land probably making meth or aiming else illegal. We waited there for a while to see if anyone was going to enter or leave. No one was seen so we decided to make the mistake of entering this shack.</p>\n\n<p>What we found was horrifying. About 4 ft away from the shack we smelled a putrid smell emitting from the shack. We decided to keep going. We opened the cracking door hanging poorly on the wall. We were greeted by a table with a woman on it. We noticed she was missing her legs and was very pale by the loss of blood. There was blood everywhere and all over that walls was creepy pictures of dead body’s that were decapitated and even some looked alive. The pictures were in black and white and made by one of those cameras that you would have to shake the picture for it to come out.</p>\n\n<p>As we inspected the pictures something horrifying happened. I will never forget the sound of the door crack open ass a y’all maybe 6ft 4 guy that was very skinny entered and stared at us. My dad is about 6 ft 1 and told me to run as he threw himself into the guy and they both flew out the door. The man then overpowered my dad and got on top of him a rn was about to stab him with this big ass buck knife he pulled out of his pocket. I kicked him in his head with the steel toe boot I had on and I saw teeth and blood fly as he fell over and was out cold. </p>\n\n<p>Me and my dad ran back to my pawpaws house and called the cops. They went back there and found the shack and said the girl we said was there had died and the man was nowhere to be found. They called dog squads saying this guy could be a serial killer that could have been the reason behind multiple missing people cases around the area.</p>\n\n<p>The cops didn’t find the man and told my pawpaw to keep his doors locked at all times and dont go into the woods. My pawpaw said as he went outside to feed his dogs he noticed this big man matching the description me and my dad told him a and ran inside and grabbed his rifle. My papaw said he ran trough the front door so the man wouldn’t see him and hid behind a bush and shot the man. He said the man ran into the woods and my pawpaw called the cops the cops came and said they found him dead. </p>\n\n<p>The cops did a investigation and said that he had a pistol on him and decided the man had the intentions of killing my pawpaw.</p>\n\n<p>I’m just thankful that my pawpaw is safe and the killer is dead. But I think me and my dad are going to find a better place to ride our ATV.</p>\n</div>\n","author":"SewerStain"}