{"rank":"2","title":"Just Blood part three","id":"8kp2mt","url":"/r/nosleep/comments/8kp2mt/just_blood_part_three/","time":"1526773734000","body":"<div class=\"md\"><p>This is crazy. I have no idea what is going on. When I got off work I went home and immediately called my best friend. I told her to come over my house because we needed to talk. When she arrived, she was smiling. She noticed that I wasn’t. She began speaking in a cheerful voice, “How have you been? You had me worried-“ I cut her off and interjected., “How do you know my co worker?” she looked puzzled, but that was just to throw me off. I know when she’s lying. “What coworker?&quot;, She asked. With the straightest face I could make I replied, “The one you called today. How do you know her?” “Oh I know who you are talking about. I met her at a bar. “ I looked at her as if I was not pleased with her explanation. </p>\n\n<p>“What are you guys up to and why am I secretly involved in it? “Involved in what?” “Cut the bullshit, I’m not stupid.” I confided in you, you drugged me so I would pass out, and you have been entering my house without my permission. Oh yeah and the fucking bodies in my basement. You better start talking now or I’m calling the police.” She looked scared and hurt. She finally screamed, “You would call the police on me?” Calmly I replied, “Why not? You were willing to frame me.” I cannot describe the look on her face when I said that. She couldn’t believe that I thought she would frame me. I have no concern for what she believes.</p>\n\n<p>She has been hiding things from me for a while now. “Are you going to start explaining to me or the police?”, I said sharply. “These guys were harassing me at a bar. Your coworker was there and she asked me if I was alright. While we were talking the two guys came over and started harassing me again. I decided to leave and they followed me outside. I had just made it to unlock my doors. One of them grabbed me by the arm and I panicked. I took the crowbar out of the backseat. He let my arm go but he seemed amused. He ran towards me and I hit him with the crow bar. I was just trying to get him to leave me alone, but when he fell he didn’t get back up. After the other guy got over his initial shock he ran towards me too. I was about to get in my car and lock the door, but that’s when your coworker tripped him. </p>\n\n<p>When he fell his head hit the back bumper and snapped his neck. So there we were basically two strangers standing beside two dead bodies. We couldn’t just leave them there so we put them in the trunk.” I am just standing here trying not to look surprised at what I am hearing. I don’t even know if I believe any of it. “So how did the bodies end up at my house?”, I said nonchalantly. “We didn’t know what to do then I remembered that you have a freezer that you never use in a basement that you never go in. We just figured that we could put the bodies there until we figured out what we were going to do. We put the clothes in bags because we were going to burn them, but before we got the chance to we heard commotion upstairs and we thought you heard us. We heard a glass break so we tried to escape out of the window, but we couldn’t get the boards off. I slipped and fell and that must have been when I knocked the plug out of the outlet.”</p>\n\n<p>“You heard a glass break? When was this?” I said puzzled. “Some days ago, basically the night all of this started.” She replied. “I never broke a glass.” I said back to her. She looked at me and said, “I never tracked blood in your house.” I wanted to believe her, but I wasn’t sure that I could. “Well why did you erase my camera feed?.” She looked at me just as puzzled as I was and said, “There was no footage when you handed it to me.” I had a thought that chilled me to my core. “Were you two followed here because if so that means that whoever it was probably followed the both of you home too?”</p>\n\n<p>She looked so scared, just as scared as I was. Then I remembered the cameras that I set outside her windows. I told her the we needed to go to her house to retrieve them. She was kind of mad about the cameras, but given everything that has been going on she got over it quickly. We got in her car and went to her house. When we got there the lock was broken. We decided not to go in the house, we just got the cameras and went back to my house. We realized that her and my coworker were in over their heads. Two men entered her house twice. The first time they picked the lock and just looked around. My camera was only pointing at the living room so we don’t know what they were looking for. The second time they entered they broke the lock. It looked as if they did it on purpose, like they wanted her to know that they were there. They had weapons the second time. The video did not show them leaving the house. It was a chance that they were still there, but we weren’t sure. </p>\n\n<p>We decided to call my co worker to see if anything had happened to her. She did not answer. We called again and got the same result. We decided to drive past her house to see if she was home. Her door was wide open. Every light in the house was on. We went to my house and called the police. At this moment all I could do was think about the irony. We had been through so much and this was the only time that we actually called the police. They checked her house and she was not there. They said it definitely looked like it had been a struggle. I wanted to tell the police about the footage from my best friends house, but she did not want me to. She thought that they would eventually track everything back to her. I wanted to tell her that it would probably happen anyway because we called the police about our co worker. I didn&#39;t want to make her upset. Shortly after we saw the missing persons story on the news. </p>\n\n<p>I wonder why the two guys that they killed were never shown on the news. I asked her what they did with the bodies. She looked at me with the blankest expression that I have ever seen. &quot;Um about that, see we put the bodies in the back of a pickup truck, but you were starting to wake up so I came back down stairs and she tried to listen beside the window. When we went back to the pickup truck the bodies were gone.&quot; &quot;Gone! What do you mean gone!&quot; She looked at me with shame written across her face. &quot;We were just happy that we didn&#39;t have to deal with it anymore.&quot; I looked at her like she was the stupidest person that I have ever seen. &quot;So it never crossed your mind that whoever took the bodies might have taken her also?&quot;</p>\n\n<p>She looked down at the floor and said, &quot;Yes it did. I just didn&#39;t know what to do.&quot; I told her that we have to tell the police. That her life was in danger. Before either of us could finish our thoughts she received a text message from a number she did not recognize. It was a picture of my coworker. I knew at that point that we definitely had to tell the police. We called the police and they came right over. We explained everything with as much detail as we could. The strange part about it is the police didn&#39;t even look surprised. They did not look amused at all. &quot;Is this the only time that you were contacted?&quot;, One of the police officers said inventively. &quot;What? That is the only question that you have?&quot; I screamed at the top of my lungs. </p>\n\n<p>&quot;Well we already knew everything else. We have been watching you for a while now.&quot;, &quot;He said as he wrote something down in his notepad. &quot;What do you mean watching us? If you were watching us then how did my co worker disappear?&quot;, I replied while still screaming. &quot;Well these guys that your friends killed are....extremely well connected. They are also....extremely dangerous. We have been trying to catch them for months then your friends kill them just like that. We didn&#39;t interfere to see if it would bring out the people that they work for.&quot; He said as if he was happy about it. &quot;So we have just been pawns in your sick little game?&quot; I said confused. &quot;Well lets not forget that your friends started this sick little game. With all that out in the open there is something else that you need to know. They have been in your house before. </p>\n</div>\n","author":"TheBigBadWolfLetMeIn"}