{"rank":"47","title":"I Used to Work On Movies...","id":"8kp53x","url":"/r/nosleep/comments/8kp53x/i_used_to_work_on_movies/","time":"1526774496000","body":"<div class=\"md\"><p>So, I don’t know if this is the right place to post something like this, but as far as my friends have told me, this is where you post all of your horrifying, traumatic experiences or whatever.</p>\n\n<p>I used to work on movies in 2015-2016. Nothing you’d have probably heard of and I didn’t do anything that you’d probably care about. I was in charge of craft service. I’d buy a couple dozen donuts, order a pizza or two every couple of hours, it was an easy gig, even for a college kid. I got to hang out on the set of a small-time movie and snack on the latest in a long line of buffalo wings orders. No way to screw it up, no way anything could go wrong</p>\n\n<p>That’s what I thought about it at the time anyway. On the third or fourth day of working on some milquetoast rom-com for some shitty hallmark channel knockoff that doesn’t even exist anymore in sound stage #14, a camera guy came in late with his kid. He was around 6 or 7. The kid I mean, not the camera guy. I guess his mom had work or something and couldn’t watch him. I won’t lie, I didn’t really care at the time. As long as he kept his distance from my domain of nachos and gummy bears, I was cool with it. The dad had a talk with the director for a second and they eventually came to some agreement that involved the kid &quot;sitting over by craft service and keeping goddamn quiet until we wrap for the day&quot;. Great. The dad knelt down next to his son and whispered what I assume was instructions to toddle over in my direction, because that’s what he did. He was quiet, but obviously excited to be able to watch the magic of film making or whatever. </p>\n\n<p>&quot;Alright everybody reset...and...action!&quot; filming resumed. They got through a couple of scenes and I had barely noticed the      kid-Marcus, I think his name was. At least I <em>didn’t</em> notice him until he started tugging on my sleeve half way through a scene involving some particularly unfunny hi-jinks. &quot;What?&quot; I whispered a little harsher then was probably necessary. &quot;I wanna talk to daddy.&quot; &quot;Well daddy’s a little tied up at the moment little buddy. You’re gonna have to wait.&quot; Then, as if I hadn’t just told him not to, Marcus got up and ran up to his dad, who was running the camera, in the middle of shooting a scene, on an actual professional movie set. &quot;Daddy I hear a loud noise. My head hurts, can we go home now?&quot; The director lost it. &quot;Christ fucking a goat Jensen, didn’t I tell you to keep that little prick silent?&quot; &quot;I’m sorry sir,&quot; Jensen knelt down to his son’s level again. &quot;Marcus, daddy can’t take you home right now. Daddy has to work, okay, Marcus? I need you to go sit back down next to Spencer over there.&quot; </p>\n\n<p>Marcus begrudgingly made his way back over to the craft service table and sat his ass down next to me again. I’m the Spencer he was talking about by the way. Yay for me, right? The kid lasted a whole 30 minutes or so before he had to jump up and make the same plea to his old man, this time with honest desperation. Once again, he was told to head back my way, this time, by our friend the piece of shit director. Marcus started walking, slowly. He made it to my station, but instead of sitting down he faced the wall we were set up against. He just...stared at it. &quot;You okay little buddy?&quot; I said trying to be nice as I could to mask the fact that I was kinda creeped out by this. </p>\n\n<p>I quickly found out that the answer was no. Marcus put his hands against the plaster wall and bashed his head into it again, and again, and again, and again. &quot;No, no, no! stop!&quot; I screamed. I didn’t know what to do. Hit after hit after hit, screaming a blood curdling scream the whole time. He was trying to kill himself. I just stood there, petrified by fear, yelling at this little boy. &quot;Jesus Christ! Stop it!&quot; His dad bolted towards us and snatched his son up as fast as humanly possible. I was completely frozen by now. I just stared at the bloody divot Marcus&#39; tiny skull had just pounded into the wall. I couldn’t move. All I could do was listen. I heard the director telling Jensen that he’d better take his son home. I heard Jensen call a cab as I guess they didn’t have a car. I felt Jensen&#39;s eyes burning into the back of my head, scolding me for my inaction. I stole myself and turned around to confirm that, yes, Jensen was glaring at me as he held Marcus close. &quot;I- I couldn’t-I-&quot; Jensen turned his back on me. I guessed that he was just gonna wait for his cab in silence.</p>\n\n<p>10 minutes passed until a car horn sounded, alerting an irate Jensen to the fact that his cab was here. Jensen let go of Marcus, just for a second. It couldn’t have been any longer than that, just one second. But it was enough for Marcus to bolt. Within that second, he was out of his father’s arms charging towards the wall next to me with his head down. <strong><em>Crack</em></strong>. It was definitely a cracking sound that rang throughout the small studio. The crew members all gasped and screamed in terror. Jensen sprinted over to see what had become of his son Marcus. He held his son in his arms. Through the crowd all I could see was Jensen weeping over his boy, who’s head flopped backwards as he held him close. </p>\n\n<p>The paramedics came not long after. There were some on the next set over. I guess <em>that</em> film had the budget for medics and security and stuff. He was pronounced dead on the spot. He hit the wall cranium first, and his neck snapped on impact. Jensen recoiled in shock. His expression was unknowable. How could anyone hope to understand the emotions that slithered through his mind at that moment. He waited, tears in his eyes, saying nothing. Security showed up and began escorting everyone out of the stage area. Jensen wasn’t having it. He snatched one of the officers’ guns off of his hip and fired it into his mouth. The bullet went straight through his neck, severed his spinal cord, and killed him. </p>\n\n<p>Obviously, the movie was canned, the channel went under not long after, and the sound stage was closed down. It was later revealed that the mysterious dark force that drove Marcus to his gruesome suicide was nothing more than feedback. I didn’t know this at the time, but apparently there are some frequencies that kids can hear, but not adults. Somewhere between normal sound and a dog whistle. A mic that we were using for the shoot was apparently emitting one such high-pitched noise for the whole 4-hour shoot, and it drove poor Marcus insane. He couldn’t take it anymore and decided to end it as fast as possible. Obviously, Jensen’s death was attributed to his grief, though of course there were rumors.  </p>\n\n<p>Stage 14 was reopened a year ago and it can now be rented out again. There have been several reports of feeling a cold presence, or a sad presence, or a suffering presence, or blah blah blah. Hearing a maddening high-pitched noise was also among the rumors. I don’t believe any of it. These are either just demented, disgusting people looking to leech attention off of the death of a child and his father, or idiots caught up in the whole situation thinking they see things that don’t exist. The rumors ended after a few weeks and the stage has been functioning without incident ever since. I’m going back there with my boyfriend for the first time since the incident next weekend. I’ll add to this post if something “spooky” happens, but I’m doing it more for closure’s sake. I know Jensen blamed me for what happened. Honestly, he was probably right to.</p>\n\n<p>P.S. Because I know people are going to ask, no, I’m not going to say what the channel that was making the film was called. It was owned by a parent company which is still around. They tried to distance themselves from this whole event and I can’t deal with a law suit right now. The film itself was called something generic like “The runaway heart” or something equally inane. I have no idea if there’s any info out there about it but there you go.</p>\n</div>\n","author":"Doctor_Spooks"}