{"rank":"98","title":"Do you want to see a dead body?","id":"8kpdql","url":"/r/nosleep/comments/8kpdql/do_you_want_to_see_a_dead_body/","time":"1526777096000","body":"<div class=\"md\"><p>My uncle died recently.</p>\n\n<p>Our family is close, closer than usual in a day of social media and distances pulling apart fragile relationships so all that&#39;s left is a phone call on holidays and birthdays.  </p>\n\n<p>Before he died, I mourned albeit briefly, I knew it was going to happen.  After he died, I mourned; a deep and meaningful experience I expressed with tears and depression.  When you bury events, it takes a toll.  When you cannot tell family for what it will do to them, you ball it up.  But you, a group of strangers, I will share this with.  A way to exercise a demon that lay dormant in me for so many years.  Maybe I will be able to let it go, or at least share this burden with more people.</p>\n\n<hr/>\n\n<p>I was maybe ten or eleven.  My best friend Harry asked, &quot;Do you want to see a dead body?&quot;</p>\n\n<p>He asked, not in a curious tone, but in a an empty way.  I never expected this from him.  He had lost his mother, kid sister and Grandma in two years; it was amazing he was still going to school.  If it were me, I&#39;d be a wreck.</p>\n\n<p>&quot;Sure,&quot; I said apprehensively, &quot;Where is it?&quot;</p>\n\n<p>&quot;It&#39;s in the woods, behind my house.&quot;</p>\n\n<p>&quot;Cool.  Let&#39;s go now,&quot; I suggested.</p>\n\n<p>&quot;No, it must be dark.  You can only see it if it is dark.&quot;</p>\n\n<p>&quot;That doesn&#39;t sound like a dead body.&quot;</p>\n\n<p>&quot;It is.  We will go after dark,&quot; he said, disappearing into the kitchen.</p>\n\n<p>Night fell quick in the dead of winter, along with the temperature.  We moved with pace through the open fields lit up by the bright full moon.</p>\n\n<p>&quot;It&#39;s not very far in,&quot; Harry said, the uplift in his tone was noticeable.</p>\n\n<p>He skidded to a stop as the forest floor fell away to a small ravine.</p>\n\n<p>&quot;Look!&quot; he said pointing.</p>\n\n<p>In the bottom of the ditch, bathed in moonlight, was a skeleton.</p>\n\n<p>&quot;That&#39;s not a body, it&#39;s a skeleton,&quot; I said slightly confused.</p>\n\n<p>&quot;I showed you, now no one else in my family will die,&quot; he said turning and running back towards the house.</p>\n\n<p>&quot;Hey, Harry?  Wait for me!&quot;</p>\n\n<p>I watched my friend disappear through the undergrowth.  I looked back at the bleached bones that lay so perfectly, in the shape of a tall person, an unusually tall person.</p>\n\n<p>Peering into the black holes that were once its eyes I jumped as the jaw opened and fell off.  In one swift movement I turned on my heels and ran.</p>\n\n<p>Back at the house, the doors were locked.  </p>\n\n<p>I walked back to my house that night without seeing Harry.  That night was the last time I&#39;d ever see him.</p>\n\n<p>Months later, my mother was ill, a tropical illness she contracted while in Brazil for work.  She deteriorated fast.  My Dad said to expect the worst and be strong for her, this is when she needs you most.  I couldn&#39;t though, but I didn&#39;t want her to hear me cry, so I sat outside, in the front yard.  </p>\n\n<p>That was the first time I saw him.  Across the road.  A tall man, wearing a black trench coat, his face obscured by the darkness and the large brimmed hat that hung out in front.  He was tall, so tall in fact he stooped.  He appeared to be looking in my direction, a long tendril like finger beaconing me to approach.  I didn&#39;t.</p>\n\n<p>I saw him every night, until my curiosity got the better of me.  My mother was not speaking anymore, just laying there, waiting for death to free her from her waking prison.  I crossed the road and waited.</p>\n\n<p>&quot;Do you want to see...&quot; It said in a raspy tone, &quot;a dead body?&quot;</p>\n\n<p>I thought about it, then nodded.</p>\n\n<p>He pointed towards my house.</p>\n\n<p>A feeling hit me like a punch to the stomach, I ran back to the house and opened the front door.  I heard the rhythmic sound of the footsteps descend the stairs, slow and purposeful, it was my dad.  Tracks of tears glistened on his cheeks.</p>\n\n<p>&quot;She&#39;s gone, son,&quot; he said crying.</p>\n\n<p>I looked over my shoulder, the man was gone.</p>\n\n<hr/>\n\n<p>I thought about that man a lot.  It would be twenty years before I saw him again.</p>\n\n<p>A dark and frosty winter&#39;s night, I left my house to make the short journey to the shops.  A light and fluffy layer of snow had gently blanketed the street, its substance crunching under my feet.</p>\n\n<p>I stopped when I saw him, as if he had the gaze of Medusa, turning me to stone.  He was tall, so tall in fact he stooped.  He appeared to be looking in my direction, a long tendril like finger beaconing me to approach. </p>\n\n<p>&quot;Do you want to see... a dead body?&quot; he asked.</p>\n\n<p>I wondered who it could be, no one in my family was ill.  He turned and loped off down the street at a speed that I had problems keeping up with.</p>\n\n<p>As I turned the corner I stopped, seeing the horrific scene.  A fireball and two mangled cars.  The man pointed.  It&#39;s a small world, it was my Uncle&#39;s car.</p>\n\n<p>Now, as I look at his body.  I have to hand it to the funeral parlour, you&#39;d not known he&#39;d burnt to death, not unless you looked closely. </p>\n\n<p>I would have thought a warning would help with the grief, but it makes it worse.  There is a sense of dread  that something bad is going to happen and you know you cannot stop it.</p>\n\n<p>Do you want to see a dead body?  It&#39;s in the woods, behind my house.</p>\n\n<p><a href=\"https://www.facebook.com/theedwincrowe/\">xx</a></p>\n</div>\n","author":"ecrowe"}