{"rank":"261","title":"I Tried to Create a Drug that Condensed Sleep - Part 1","id":"8kpkn2","url":"/r/nosleep/comments/8kpkn2/i_tried_to_create_a_drug_that_condensed_sleep/","time":"1526779219000","body":"<div class=\"md\"><p>Let&#39;s be honest, getting 8 hours of sleep every night is impossible. Especially if you&#39;re a student or have work. Nobody likes being short on sleep, but it&#39;s something we all go through. This is what I tried to fix, but it went horribly wrong. So wrong, that I&#39;m now on here. I need to take you back to the beginning. Back in 1988.</p>\n\n<p>I was a young man (I physically still am) fresh out of college, and still foolish enough to think I could climb any mountain. My classmate, Eddie, and I had come up with a brilliant idea. At least I thought it was brilliant. It was a bad idea and I was unsuspecting. Blind to Eddie&#39;s true nature.</p>\n\n<p>We planned to create a pill that would augment sleep. It would double it. If someone slept 4 hours, they&#39;d feel like they had gotten 8 hours of sleep. With 3 hours, it would feel like 6 hours, and so on. This would be invaluable for students or anybody with a demanding schedule.</p>\n\n<p>I&#39;m not even going to attempt to explain how the pills worked. Eddie and I were business majors, not medicine or chemistry experts. That was where Eddie&#39;s friend, Mike, came in. We all had a role in this: Eddie had a rich family, so he was the funding. We didn&#39;t need any loans thanks to him. Mike was the science. And I was the salesman. I was the most charismatic of our group, and I&#39;d be the best salesman. My role would mainly be sidelined until we achieved success.</p>\n\n<p>I&#39;m not sure what was in the drug, but I&#39;d bet a big stack of cash it wasn&#39;t all legal. Probably some narcotics, depressants, or hallucinogens. Like I said, I&#39;m not a chemist.</p>\n\n<p>The process was uneventful at first. In fact, I barely saw the other two in this time. Mike was doing his work, with help from Eddie&#39;s money of course. Because I had not yet landed any jobs associated with my degree, I still worked as a cashier at a shitty little corner store. The rest of time was spent with my fiance, Jane. </p>\n\n<p>She objected to the project because of Eddie. She always thought he was a creep. She relented when it was clear I wasn&#39;t going to abandon this business venture. God I wish I had listened to her.</p>\n\n<p>After about 2 months of trial and error, Mike had a pill he was satisfied with. Of course, no people had taken it yet. But he knew it was nontoxic. We would be sampling the pills ourselves.</p>\n\n<p>I took mine when I had an early shift at the store. I went to sleep a lot later than usual  - about 3 hours before I had to wake up. And with that pill, I felt fine. I didn&#39;t feel tired or deprived at all. I was ecstatic. </p>\n\n<p>But there was a downside. I couldn&#39;t sleep that night, or even the next night. And it felt like my blood was itching. I&#39;m no chemist but I still knew what withdrawal was. I had to tell Mike to fix that. I wasn&#39;t panicked until the night after. </p>\n\n<p>Even though I couldn&#39;t sleep, I could still dream. That night I was simply watching TV since I had nothing else to do. I reached for the remote, only to scream. I saw not a remote, but a severed hand. I dry heaved, but nothing came out.</p>\n\n<p>I staggered away from the hand only to bump into someone. I turned around to see a thermal human yelling violently at me. I tried to run but my legs moved slow, just like they do in dreams.</p>\n\n<p>Something shook me back to reality. Jane screaming my name and shaking my shoulders. The horror movie I&#39;m front of me faded away, replaced by my normal living room.</p>\n\n<p>&quot;You&#39;re having a nightmare Josh!&quot; Jane was screaming.</p>\n\n<p>I looked around panicked.</p>\n\n<p>&quot;I was asleep?&quot; I asked. &quot;I haven&#39;t slept in 3 days.&quot;</p>\n\n<p>&quot;No, Josh. You&#39;ve only been home from work for 10 hours. You&#39;ve been in and out of sleep. You&#39;re sleeping with your eyes open!&quot; She practically sobbed.</p>\n\n<p>That pill had really fucked me up. I promised not to take anymore of them, and resolved to tell my experience to Eddie and Mike. I actually felt better in the morning, I guess the pill had left my system. Thankfully I wasn&#39;t experiencing withdrawal.</p>\n\n<p>I called Eddie that morning, assuming he had suffered a similar experience. As soon he answered he said we needed to meet immediately. I took this as a sign that he was in the same boat as me.</p>\n\n<p>The three of us met later that day in Mike&#39;s basement, where he had set up his lab. Mike was aghast as I told my story. Eddie, however, looked unfazed.</p>\n\n<p>I ended my narrative by saying that we needed to abort the project, or make serious changes.</p>\n\n<p>&quot;But why? Everything is going as I planned.&quot; Eddie stated coldly.</p>\n\n<p>Before I could process or react to what he said, I felt a pair of hands on my shoulders and the stick of a needle in my neck.</p>\n\n<p>And then, nothing but blackness.</p>\n</div>\n","author":"Clarkinator69"}