{"rank":"19","title":"My Grandpa's Deal With The Devil","id":"8kpldl","url":"/r/nosleep/comments/8kpldl/my_grandpas_deal_with_the_devil/","time":"1526779441000","body":"<div class=\"md\"><p>My Grandpa’s Deal with the Devil </p>\n\n<p>My grandpa was the typical old racist rich white man that walks around like his shit don’t stink. He was cut throat, didn’t give a damn about anyone and was also the luckiest man I ever met.  Unnaturally lucky in fact. He just happened to get in on the ground floor of McDonalds, Walmart, Walgreens and on and on and on. Won the lotto multiple times. Walked out of the world trade center 2 minutes before it got hit by an airplane. The list is long. He had so much money from his investments he could literally wipe his ass with it. Now who is that lucky? No one.  I couldn’t stand his ass. Until recently the narrative was he worked for everything he had, he earned that fortune and the family is benefiting from it, so we shouldn’t ask questions. We have just hit a streak of bad luck. But I knew better. I saw through his bullshit. I always had a weird feeling about him. I never trusted him. I thought it was so weird how kids would scream around him, and animals would walk a wide radius around him. He never smiled and hardly spoke, but when he did it was usually hateful and full of venom. He was a horrible man, but it just seemed like the world bent to his will, and I’m convinced my family is now suffering for it. Today…...I finally found proof after weeks of searching. Proof that we all must die, and there isn’t a thing we can do about it.</p>\n\n<p>It started 3 weeks ago when my grandparents house burnt down, with them asleep in the upstairs bedroom. Both were burnt alive, well, that’s what the evidence pointed to initially. There were 2 indentions in the bed. 2 sets of burnt up clothes in little rock-hard nylon blobs in the shape of a person. But what the investigators couldn’t figure out was the set of footprints that walked out of the room, down the stairs and out the front door, leaving behind burnt out patches of dry Texas grass in the shape of feet behind. No one could. By the time the checked the hospitals, banks, etc. for any sign of my grandpa they had learned his accounts had been cleaned out weeks prior and no one had seen him at any of the local hospitals, let alone find any records of his past visits or even a birth certificate. A vehicle was left behind so he must have been on foot most would think. But who would miss a burnt up 102-year-old man who probably looked like Freddy Fuckin Kruger? We spread my grandmothers ashes a couple days after the fire with no sign of grandpa. </p>\n\n<p>The initial days after the fire my family was so busy with preparations, and all still in disbelief we didn’t spend much time talking about it. After the fire department had cleared what remained of the house and deemed it safe for us to try and salvage anything we could we got to work. Most of the house had been scorched but the basement was still intact, as well as a bathroom, spare bedroom, and part of the den where my grandmother had stored her expensive China. My mother and aunts claimed the china immediately while my siblings and I went to the basement. We sifted through items warped by the heat looking for anything of value, the hisses and loud bitching of my mother and her siblings echoing from upstairs. We didn’t find much, mostly junk to be honest, but my sister found an old photo album, and my brother found and claimed a box of old video game systems my grandma collected after we tired of them. I hadn’t found anything yet, so I kept looking while they went upstairs. I began shifting old tubs of decorations and furniture around when the leg of the side table I had been moving caught on a lip in the wall. I pulled hard and a section of the wall pulled away burping an acrid smell and stale air from the gap. I quit pulling and watched as the section moved back and set against the wall, nearly flush and impossible to see with the naked eye unless you knew where it was. I moved the surrounding debris out of my way and tucked my fingers beneath the gap and pulled, retching at the stench that greeted me. I opened the door wide while pulling out my cell phone and turning on the flashlight and stepped inside.</p>\n\n<p>What greeted my once my eyes adjusted was exceptional to say the least. The room was cavernous with bookshelves covering 3 of the 4 walls with thousands upon thousands of books lining the shelves. There was what looked to be a workbench in the middle of the room with miscellaneous items piled upon it. I scanned the room with my flashlight and saw an indention in the floor a few paces from me. I walked over and peeked inside and saw a small pile of 3 gold bars, gleaming in the light of my flashlight. The fucking mother load I thought! I snatched them up quickly and shoved them in my pocket, my excitement overwhelming me until I noticed the hundreds of small indentations in the hole, remnants of the hoard that had occupied the space previously. Happy with my discovery I started circling the rooms and scanning the books on the shelves. Most looked ancient, leather covers cracked and faded. I pulled one from the shelf and saw it was written in some language I didn’t understand and tossed it over my shoulder onto the dirt floor. It hit with a quiet thud and fell apart into a tattered heap. I continued along the wall when a massive book caught my attention. It looked to be older then the ones around it, leather so cracked and faded it looked like a sun baked mud brick. It wasn’t tall, but god damn it was wide, nearly as wide as my abdomen. I grabbed it and took it from the shelf, its weight throwing me off and making me walk with a waddle toward the table in the center of the room. I heard a crash of china from upstairs, breaking against the tile floor. Someone fucked up I thought as I cleared off a small patch and set it down with a thud, several papers floating away with the small breeze. I could have walked away at that moment, I could have remained ignorant, but I had to look. It was the most overwhelming feeling I had ever experienced.</p>\n\n<p>The front cover pulled away in my hands and I set it down, mesmerized by the first page within the book. A painting of a demon graced the page, beautifully intricate and amazingly well preserved. Almost like it was painted yesterday. I turned the page and saw nothing but writing in a language I didn’t understand, the loops and swoops smeared with a dark ink. I scraped at it with the tip of my finger and it flaked off and smeared my sweaty fingertips. After a moment I realized it was blood. My grandfather had a fucking book written in blood?  I wiped the blood on my pants and flipped through the pages, careful not to get anymore on me. Every page was the same, written in blood a language that I did not know. Flipping rapidly through it, the pages cracking and showing their fragility as I did, I was nearing the end when something caught my eye. It was my grandfather’s name, written in a distinctly different handwriting, his signature obvious to me after seeing it signed on thousands of checks my family used. Below it was the signature of whoever had written the rest of the book. A chill ran down my spine when I heard a scream from upstairs and what sounded like shattering glass and rustling of bodies. I closed the book violently and picked it up and ran out of the room, hiding it beneath a box on my way up the stairs.</p>\n\n<p>What greeted me upstairs was a nightmare. My mother had dropped a piece of China, and in my aunts fit of rage she stabbed her with a sharp piece through the eye socket. My mother lay dead at my feet with my aunt screaming like mad on the floor, flailing with the broken piece as my uncle and siblings tried to calm her down. My uncle reached in to restrain her and was cut on the arm, blood immediately pouring from the wound. He rushed off for a towel while I ordered my brother to call the cops and pulled my sister away from her. She began foaming at the mouth, screaming a harsh language I didn’t understand, contorting and writhing on the floor. It was the scariest thing I had ever witnessed. I covered my sister’s ears and tried to block out the noise when my brother returned and locked his gaze upon my aunt. She raised one unnaturally bent arm and pointed at him, shouting like crazy. He ran off and hid, brushing past my uncle who had returned to help me with my sister. We picked her up and carried her off after she appeared frozen in terror unable to move. Once we got her to the other room with my brother my uncle and I returned to my aunt, my uncle recording what was happening with his phone for evidence while I covered my mother with a sheet. </p>\n\n<p>A knock on the door interrupted me after a minute and I let the cops in, my aunt never quieting, never ceasing movement. The officer stepped inside and began advancing on my aunt, whispering quiet words meant to soothe her. Once he got within arms reach she stopped her writhing and stood up wildly, limbs still contorted and inhuman looking. The officer stepped back and drew his firearm, when my aunt with the broken china clutched so tightly in her hand she was bleeding raised the impromptu weapon and slit her throat, mouth making words with no sound emanating, a look of absolute clarity upon her face. The officer cleared us out of the house and asked if we had somewhere else to go. We left, but once the first responders had left for the evening I snuck back inside and grabbed the old book from the basement, my mothers blood dripping slowly from the old wooden ceiling into a puddle on the dirty floor.</p>\n\n<p>The officer who had responded to the house had been wearing a body cam, and experts were brought in to decipher what my aunt was saying before she killed herself as well as analyze her lip movements and guess what she was trying to say before death. Most was inconclusive, a jumbling of ancient words they had no context to cross analyze with. Sumerian, Egyptian, Greek, Persian, and a little-known branch of Native American language were pulled from the video, but she was saying the same thing in all of them, or at least what they could piece together.</p>\n\n<p>“The debt will be paid. The debt must be paid. You have had your chance and failed to act. I will take what is mine.”</p>\n\n<p>That had got me thinking about Grandpas book. It was still fresh in my mind while I sat on my couch with the book, doing my best to decipher it. I was making progress, albeit slowly, when I heard a knock from my front door and I went to answer, thinking it was weird for someone to stop by after dinner. An officer greeted me, a somber look on his face. He informed me someone had broken into my brother’s house in the early morning and stabbed him to death. 152 times to be exact, with nothing missing from his place to their knowledge. I began to feel sick, a feeling of realization hitting me, and I closed the door, pulling my phone from my pocket to call my sister. </p>\n\n<p>“Jules it’s Nathan, did you hear about Wyatt?”</p>\n\n<p>Muffled breathing greeted me with short sobs in between. I repeated my question.</p>\n\n<p>“I heard, what the fuck is going on?!”</p>\n\n<p>“I don’t know but we need to talk. Call Uncle Alan and meet me at the Starbucks on 52nd. Meet you there in an hour.”</p>\n\n<p>“Nathan I’m scared, all I can picture is Wyatt when I close my eyes and Mom on the floor. What the fuck do we do now?! What the fuck is going on?!”</p>\n\n<p>“Just meet me there, I have an idea.”</p>\n\n<p>And I hung up.</p>\n\n<p>I rushed to the Starbucks to meet my uncle and sister with the book shoved into a backpack hoping to keep it dry through the pouring rain that had started up. I waited nervously, my mind swirling with possibilities when I saw them walk through the door, soaked to the bone. They sat down, and I launched into what I had found in the basement, the book I had taken and what I had deciphered so far. They sat wide eyed while I told them this. \n“You know how grandpa had ridiculously good luck? How he was the richest man any of us have ever met, got in on the ground floor of every major corporation that rules the market, and still seemed to be an asshole? I think I figured out why, I’m not completely sure but from what I have deciphered I’m willing to make a guess.”</p>\n\n<p>Shaking heads were my only response.</p>\n\n<p>“Okay, well I was working on this last night. From what I can decipher its talking about Grandpa becoming not just rich but powerful. Influential. But he would owe a debt, of which I am not exactly sure what he would have to do to repay it. I found his signature in the very back of the book along with another I can’t recognize. I think Grandpa made a deal with the Devil. I think Grandpa backed out of that deal, and now were paying for it. I think that selfish fucking asshole has sacrificed us all, so he can keep living the good life. I need more information to be certain, but it makes sense. At least to me. I mean how the fuck did he get out of that fire alive? Bank accounts cleaned out? He knew something he didn’t tell anyone. I want to know what.”</p>\n\n<p>My uncle stood violently and left Starbucks, a look of disgust on his face. My sister followed on his heels closely, tears pouring from her eyes. I’m guessing they didn’t believe me. I sat there for a moment deciding whether I should follow or not. I decided against it and just watched them as the left and began walking across the street, my uncles’ arms waving and my sister lowering her head. They were completely wrapped up in what I told them they must not have heard the horn of the bus. I rose from my seat to rush outside and scream their names as the bus was bearing down on them, but I was too slow. The bus collided with their bodies, pulverizing and mangling while throwing them in the air, smacking the ground with a wet slap near my feet. All I could do was begin to cry, turn on my heels, and run.</p>\n\n<p>It’s been 4 days since my uncle and sister died. I’ve been holed up in my house with the book working. I have at least 100 missed calls and just as many voicemails I didn’t answer. Officers had been coming to my home knocking on the door, but I had boarded up the windows. Locked the doors and refused to answer. I haven’t slept for 4 days and the book is nearly deciphered. My grandpa had made a deal with the Devil. The. Fucking. Devil. For riches and prosperity, a long life, everything a person could want. All he had to do was multiply and sacrifice his children, and their children, casting their souls to Hell to satiate the Devil and fulfill his part of the contract. I discovered my Grandfather was much older then we thought, at least 1300 years old and maybe older. Sacrificing his children and moving on to find a new mate to make more. If they made it to adulthood he’d sacrifice their children. No wonder he was such a fucking asshole. Until he met my grandmother. I can’t figure out what it was about her that stopped him from sacrificing his children, but he didn’t. He didn’t fulfill his side of the bargain. He had betrayed the Devil. And the Devil was getting his revenge. He was claiming us all, and then he would claim my grandfather, dragging us all to Hell to remain for the rest of eternity. After my uncle and sister were killed I was the only one who remained.</p>\n\n<p>The Devil will come for me I just don’t know when, or how. I’ve thought of killing myself to spite the mother fucker, but I can’t bring myself to do it. I’m so scared I haven’t left the house. But I’m running out of food and money to pay the utilities. I can’t stay here much longer. I have contacted the local priest for help, but he has begun to ignore my calls after he said he would stop by to help me and never showed. I’m so alone and I don’t know what to do anymore. </p>\n\n<p>Another fucking knock at the door. Maybe it’s the priest.</p>\n</div>\n","author":"Nickrich30"}