{"rank":"9","title":"Cow Head","id":"8kppba","url":"/r/nosleep/comments/8kppba/cow_head/","time":"1526780700000","body":"<div class=\"md\"><p>When it comes to the past time can be kind or cruel. A speck of dust forever immortalized in the never-fading purgatory of time. All civilizations have three fates to be remembered, stuck in lore or  forgotten. Sometimes fate takes pity on certain civilizations and lets them be discovered on the brink of being fully devoured by mother nature, but at a cost of the truth not being fully known. </p>\n\n<p>I believe this is what lead me to the path I&#39;m currently on in hopes of becoming an archaeologist. In hopes of discovering the forgotten and solving mysteries. Last spring when I and a group of other students went to Japan to intern at a new archeology site, I wasn&#39;t participating in what would be found.  Given that you have to expect anything when it comes to these sites and the treasures they house. No matter how horrific they maybe-It speaks of how humanity as a whole evolved from such primitive ways of thinking. </p>\n\n<p>It was a beautiful spring day and the countryside was like that of a fairy tale. Cherry blossom tres with their blushed color flowers swayed gracefully in the breeze. The rice fields and mountains where so serene. It hard to think such places still exist. But even such beauty can house a darkness that goes beyond that man can understand or even comprehend of existing. That is the one thing surprising about the world in which we live.....With all of its beauty, there is just as much terror. </p>\n\n<p>After what seemed like hours we finally came to the picturesque spot. It didn&#39;t look like anything at first glance. Just an open field. We got out of the van stretching out what everybody part felt cramped as we made our way to the professor and his team that would oversee us. Another place of the area the only thing that remains of the village we would be extricating was only the outline of the homes and other buildings that use to be. Almost like a reminding specter to present time forwarning of what could be. We began work right away, I was stationed at what was believed to be a barn. Digging lasted for hours until I saw something... It was extremely small glimpse but it was ivory white. </p>\n\n<p>Calling the professor over he rushed over and order his team members to come and dig the rest up. When they finished revealed to our disbelief was a  disfigured skeleton. The following days more research was done since it they only full skeleton we could find in the whole entire village. We lovingly nicknamed the skeleton Gozu, since we all agreed it was proper to give the skeleton and identity. Gozu was a young adult male who had Proteus syndrome. Which made his head and face look cow like while at the same time disfiguring other parts of his body as well.  He lived and died during the time of the Yowa famine.</p>\n\n<p>Gozu would have probably never known happiness or love since his condition was so severe he would have been probably thought as a folkloric yokai. I don&#39;t know why but I remembering when I was looking at the skeleton, that I felt a distinct mass amount of hatred emanating from it. At that moment I just tallied it up to my thoughts being overwhelmed to how lonely he must have been.   The following days the team was engulfed with euphoria over the finding of Gozu since we thought we would find more. </p>\n\n<p>The weeks went on and the only other things we found was a few pottery pieces, plates, and a few butchering tools. There was on building spot that seemed to have nothing but ash and sand under what use to be the foundation. It was concluded that the rest of the villagers left and Gozu stayed behind. I couldn&#39;t shake off the feeling that something wasn&#39;t right, the feeling ha grown after coming back to the site after Gozu was discovered. I couldn&#39;t put my finger on it there was just something off.  As the internship was coming to the head the professor decided that the reason why nothing else could be found.The last night, I drifted into an inhume deep slumber. </p>\n\n<p>I remember feeling nothing at first but then the hard firmness of ground and the weird crunching sound of a light straw. Sitting up I found my self in some type of barn with a single cow. She eyed me from her peripheral. I set myself up and surveyed my surroundings.  There was a dark corner that made my instincts higher more than they already were.  Not daring to turn my head, my suspicions were answered. Slowly moving out of the shadows in a clumsy way was a young man who was horribly disfigured. In fact, he looked exactly like how Gozu must have looked like before death. He had unkept shoulder length hair, clothes dirtied, skin full of scars and blemishes, and a small steady stream of drool that flowed from his gaping mouth. </p>\n\n<p>Oddly he seemed to not notice my presence and it was when I saw him that I knew I must be dreaming. Having a morbid curiosity of what his life was like, I let this visionary specter guide me through my fantasies. An older man came into the barn clearly frustrated and worn, I could on presume it was Gozu&#39;s father. Gozu looked at the man as if in fear. The man stormed over to Gozu and started to beat him, cursing him.  He yelled at Gozu that he is an embarrassment, a curse, that he should have died since no woman would give him a breast to suckle from as a baby and that if it wasn&#39;t for the cow he would have died. The man mutter that Gozu was only good for scaring off armies. </p>\n\n<p>He went even more into a blind rage beating Gozu continuing to spew abuse while Gozu coward and made animals noises.  Sometimes he stopped and looked at the cow. He took a  hatchet that was on a working table and went over to the cow. I believe that the man wanted to kill his son but knew death would be too kind. To hurt the creature that had shamed his family and also to supply food since at this time food rations would have been running low. Started to chop at the cow. The only creature to show Gozu any type of affection. The cow cried in pain and betrayal of how it&#39;s master who cared for it for probably years could make it feel nothing but pain and agony. </p>\n\n<p>It was a long and gruesome kill. There wasn&#39;t one place where blood didn&#39;t touch.  A steady stream leads to Gozu who looked like his world was shatter into a million of pieces. The man took some a couple of legs and left. It was only when he did that I followed Gozu&#39;s lead and took a look at the stable.  The cow had been horribly butcher. Various entrails and bodily bits littered over the cow&#39;s corpse and walls. Gozu let out the most animalistic cry that I didn&#39;t think was possible for a man to make. My heart pound and my mind raced.</p>\n\n<p>Even though I knew this wasn&#39;t real I felt real genuine fear. My instincts telling me to run get away from Gozu-but I must know what happens, what really happens to the other villagers, the animals, everything. Gozu sat beside the cow&#39;s body for a few moments before slowly getting up. His body had a sinister language to it. He went to retrieve a farming tool and slowly went out into the village. My body didn&#39;t move, curiosity didn&#39;t matter anymore since I knew what was about to take place was going to be the stuff of nightmares. It wasn&#39;t even thirty minutes later that I started to hear screams of various people.  I looked out the window of the barn and saw villager silhouettes running frantically away from Gozu who was wildly attacking anything that moved. I moved away from the window and into the nearest corner where I covered my hears trying to deafen the sound of screams. As fast as it had started it ceased. </p>\n\n<p>I  could hear a wet sloshing sound approaching the barn. I held my breath and kept telling my self that&#39;s only a dream, I can&#39;t be hurt. Gozu had returned, he slowly turned his head to the corner I huddled and in and slowly came over. My eye widens, my heart felt like that if it could jump out of my chest it would.  He didn&#39;t acknowledge me before, so why now.  He got an inch away from my face.  His black eyes pierced mine. He was covered in blood and sniffed me. Closing my eyes not knowing what to expect he let out the inhuman scream that he had done back when the cow was killed. </p>\n\n<p>I awoke in a cold sweat, safe in my bed. As my group and I were leaving and on our way to the airport. we were notified by the professor and his team that the sand and ash that we had found in one of the buildings wasn&#39;t sand or regular ash but of human and various animal bones. </p>\n</div>\n","author":"macabrenocturnelle"}