{"rank":"21","title":"The house across the street: the dream (Part 4)","id":"8kprch","url":"/r/nosleep/comments/8kprch/the_house_across_the_street_the_dream_part_4/","time":"1526781347000","body":"<div class=\"md\"><p><a href=\"https://www.reddit.com/r/nosleep/comments/8jxjc7/the_house_across_the_street_the_stain_part_3/\">Part 3</a></p>\n\n<p>I&#39;m sorry I haven&#39;t written in a while. Something happened yesterday and every time I try to write it down, I start shaking. I don&#39;t feel afraid. It&#39;s more like something is trying to keep me from putting it down in words. So I&#39;m forcing myself to do it, not just to keep you guys updated, but for my own sanity. I have to do SOMETHING that makes me feel in control.</p>\n\n<p>The night before last, I had a dream. I got out of bed and everything felt right. All the things that have happened over the last week didn&#39;t matter. Everything was okay. I walked out of my house and onto the porch. It was night. Across the street, the lights weren&#39;t just flashing; every single one, in every room, was on. More than that, the house was <em>singing.</em>Not in words. This isn&#39;t fucking Beauty and the Beast, where the fucking furniture dances for you and shit. It was a wordless cry, like shattering glass and ringing metal. Human somehow in its expressiveness. The worst part of it was that it was alive. I knew it was, and beneath the surface kindness of its music, there was a roiling sea of anger. It was calling me. I knew that, somewhere deep in me.</p>\n\n<p>I walked across the street. The low panic I&#39;ve come to associate with leaving places where I&#39;m in control grew, but it was distant, drowned out by the house&#39;s song. As I stepped onto the Palace&#39;s porch, I felt excitement rising up in me; not mine, if that makes any sense, but it propelled me anyway, pushed away the fear. The door opened in front of me and there they were. Marvin, his wife, his daughter, my great-uncle, and two native-looking folk I didn&#39;t recognize. Even though they didn&#39;t move, I could feel that they were happy to see me. Even as black blood began to flow freely from their eyes as they watched me unblinking, I could feel them smiling. Even as a fly crawled into his half-opened mouth, I could hear my great-uncle speaking. <em>You&#39;re home, boy. Home at last. Sit with us, son. You haven&#39;t visited in so long.</em></p>\n\n<p>I tried to move away, but it was like moving through molasses. I turned my head to look behind me, struggling against the flow; even that, it didn’t want me to do. It was dark behind me, not like night, with things in it, more like it was empty. Out of that emptiness stretched hands, pushing me towards the door. The panic went up another notch when I realized that molasses feel on my head was from three or four of them pressing on the side of my face. I moved inside and sat in the overstuffed armchair I remembered so vividly from my visits. The panic was stronger now, a steel keening at odds with the song of the house. I knew I wasn&#39;t in control. It was the house. It was him. He <em>was</em> the house. It moved now, the planks beneath my feet, the house’s bones, roiled like the sea. I could feel a deep rumbling from the bowels of the home, like a heartbeat. It was overwhelming. My heart was beating in time with it. I couldn&#39;t stop it. I couldn’t change. I couldn’t leave. It was like I was fused to the chair. As I felt my own vision cloud over with black blood, the panic finally won, and I woke up.</p>\n\n<p>I don&#39;t sleepwalk, I never have. But yesterday morning, just as the sun was rising, I found myself lying on my porch, an inch away from the stain. You guys were right, sort of, when you said that it was trying to keep me from leaving. It&#39;s trying to make me do <em>something</em>, but it&#39;s not to stay here. It wants me for its little fucking collection of bloody dolls. It wants me to be there. The stain grew that night, and the next night. It&#39;s over half the porch now. It&#39;s trying to get me, to take me over there. I don&#39;t want to think about what happens when it reaches the door. I&#39;ve set up ritualistic protections to keep it from moving. They&#39;ve slowed it down, I think.</p>\n\n<p>I guess the house is kind of a stupid motherfucker, because I&#39;m planning to go over there anyway. But I&#39;ll have protections. I won&#39;t be naked and defenseless the way that fucking house wants me to be. See, there&#39;s a ritual my grandma told me about. I found it in the nvwodhi. Back when the East Cherokee rose up against the settlers, they used it to make themselves invulnerable. Only a handful of them even got hurt, and those not badly. I fuckin&#39; pray that that invulnerability applies to mental shit too, cause if it doesn&#39;t, I&#39;m well and truly screwed. It takes four days to finish. I started yesterday, so I&#39;ll be heading over on Monday night. And when I get over there, I&#39;m burning that son of a bitch to the ground.</p>\n\n<p>The last thing I&#39;ll say, before I sign off and get back to work on the ritual, is something I&#39;ve been thinking about a lot since the night before last. In Cherokee culture, when a relative has so badly befouled a place, either through violence or through bad medicine, it&#39;s the family or clan&#39;s responsibility to hire a medicine man and take care of it. And that dream made it clear that whatever else he was, my great-uncle had <em>something</em> to do with what&#39;s going on.</p>\n\n<p>There is no medicine man around here, not anymore. If I told my family about it, they&#39;d lock me up. So it&#39;s my responsibility, and mine alone. The other part of that responsibility is that you&#39;re supposed to log it, to write it down, to prove that you did your duty.</p>\n\n<p>So, spirits, if you&#39;re there, see this. No matter what else I am, know that when things went wrong and shit went bad, I did my duty.</p>\n</div>\n","author":"xnyrax"}