{"rank":"124","title":"My Shop is Full of Extraordinary Things [Part 1]","id":"8kptvy","url":"/r/nosleep/comments/8kptvy/my_shop_is_full_of_extraordinary_things_part_1/","time":"1526782115000","body":"<div class=\"md\"><p>Have you ever imagined a dream manifested in real life? If not, I want you to picture it right now. Everything you thought impossible, everything your eyes would not believe … see it in front of you in the most curious display: a Wonderland pulled right out of the storybooks. This is what you’ll find should you ever stumble upon a small, dimly-lit antique store that perhaps you never noticed before. But I assure you, this isn’t just any shop full of dusty old garbage. It’s a shop that buys and sells only the most extraordinary things.</p>\n\n<p>When you walk in, you won’t see a desk or a clerk. Not at first. You’ll see shelves and displays, maybe even cages, cluttered - or as I like to say, <em>lovingly stacked -</em> with antiques of all kinds from all over the world. First you might notice the more familiar items: a few dolls, some paintings on the walls, fine sets of teacups, old musical records. They may look mundane, but I promise even the most ordinary-looking items carry incredible secrets. If you venture further, you’ll see my favorite displays as well. There are carved human bones, medical samples, taxidermy creations, a mirror without a reflection. You may be wondering who would purchase these. Let me tell you right off the bat that there is a buyer for everything. Should you stay long enough to look around, you may meet a surprisingly ordinary man who would gladly tell you everything you need to know about any item in the store.</p>\n\n<p>That man will be me, and consider this a friendly invitation should you ever decide to visit <em>Alberich’s Antiques.</em></p>\n\n<p>I could explain plainly exactly what makes these items special, but I think it would be best told in a more anecdotal form. I have far too many interesting stories about former clients not to share a few of them while my days are so agonizingly slow.</p>\n\n<p>Not a week earlier, a customer stopped in to buy one of my all-time favorite items in the collection. As sorrowful as I was to see it go, I have to admit that it’s nice to see it catch some interest. It’s a gorgeous antique, really. A middle-aged woman came into the shop, looking for something to decorate her home with before entertaining company over the weekend. While she looked around the shop, she professed multiple times that she ‘never even knew the store was here’. I hear that a lot. She avoided the eerie displays and instead let her eyes fall upon a six-foot tall standing mirror draped in a rich purple cloth. After noting the intricate gilded decoration at its base, she eagerly asked if she could see the glass for herself.</p>\n\n<p>I was happy to oblige, and pulled the fabric away to reveal a perfectly un-cracked (albeit somewhat scuffed) surface. Her eyes fell on her own reflection, and while there was nothing extraordinary about that, I could tell she was smitten with the object already.</p>\n\n<p>“This mirror is special.” I told her. She never took her eyes off of it, even when she answered me.</p>\n\n<p>“How so?” She asked. “Did it belong to someone important?”</p>\n\n<p>I shrugged my shoulders, watching how her fingers twitched in some hesitant temptation to touch the surface of the glass. “It’s belonged to so many people that I couldn’t really tell you.”</p>\n\n<p>“So it’s very old.” She assumed. I smiled at that.</p>\n\n<p>“Oh, yes. Yes, it’s very old. And you know, some have said looking into the mirror is a lot like looking into another world, actually. You may see one thing today, but tomorrow? Only time will tell what it decides to show you.”</p>\n\n<p>She must have found some amusement in that pitch, as she chuckled and glanced towards me for only a split second before turning back to the artifact. I didn’t stop her when she extended a hand to touch the glass. In fact, I encouraged it. They rested there against the surface for only a moment before she pulled them away, looking at her fingertips curiously.</p>\n\n<p>“I felt something.”</p>\n\n<p>“You did?” I folded the purple blanket in my arms, having a distinct feeling I wouldn’t need it again. “And what did you feel, ma’am?”</p>\n\n<p>Her eyes were still fixed on her hand, as if she saw something dancing in her vision that I couldn’t see. She looked hypnotized, her face in an expression of profound peace. “Warm.” A small, dry chuckle left her and she dropped her hand down to her side, nodding her head decisively only a second later.</p>\n\n<p>“I’ll take it.”</p>\n\n<p>__</p>\n\n<p>The buyer’s name was Liz O’Connor. She was delighted, almost in a dreamy state of euphoria, as I helped to gently pack up the mirror in a cushioned box so that it could be safely transported home in her minivan. While I did, she looked over a piece of paper with a scrutinizing gaze, hesitating to sign her name on the contract for her purchase.</p>\n\n<p>“I’ve never had to sign any paperwork at an antique shop.” She said, flipping to read the second side. “No refunds and no returns?”</p>\n\n<p>I wore a smile as I leaned across the front desk, tapping a finger against the wood. “I get new stock so often that I can’t really guarantee I’d have space to take it back. However, you can <em>try</em> to sell it if you insist. I just can’t promise that everything here could find a new home.”</p>\n\n<p>With a quick glance around, she made her own assumption about what I meant. The mirror was an exceptionally beautiful piece in comparison to some of the more grotesque or tarnished oddities in the shop, and apparently that comfort was enough to convince her to sign her name at the bottom of the paper and slide it across the desk with her payment.</p>\n\n<p>“Thank you so much,” she told me as she wheeled the box out on a metal cart. She was all smiles when she left, and so was I.</p>\n\n<p>“Good luck.” was all I whispered after she had turned her back.</p>\n\n<p>Mrs. Liz O’Connor did not return to the shop, but I did hear from her not long after he made the purchase. It was evening, just before time to close the shop, and the perfect time of day for me to do a quick dusting to all of the items on display. I was just polishing the glass case to a particularly fragile-looking mummified hand when I heard the phone ring at the front of the store. It was after hours, but I had a feeling this wasn’t just an accidental call.</p>\n\n<p>“Good evening, this is Alberich’s Antiques.” My customer service voice was still present, but the voice on the other side of the phone didn’t seem to be looking for a purchase.</p>\n\n<p>She said nothing for a good, long moment, and then I heard her take in a sharp breath and speak in the most tired, woesome voice I could imagine. Poor Liz had been having herself an awful week.</p>\n\n<p>“Y-yes, I bought a mirror a few days ago.” Her voice trembled. “I … I don’t know what to do with it. I want it out of here. My reflection is just all wrong.”</p>\n\n<p>I knew the reflection itself wasn’t the problem. With a calm, soothing voice, I answered her without concern. “Mrs. O’Connor, how often have you been looking into the mirror?”</p>\n\n<p>“E-every day.” She answered after a hesitant pause. “I c-can’t stop. I look in it every time I pass and sometimes it keeps me there for hours. I see myself looking ill, I see myself prettier, I’ve seen myself with … with people I don’t even recognize! Children I don’t recognize. <em>Men</em> I’ve never seen before ...Oh, god, Mr. Alberich, I’ve seen even worse.”</p>\n\n<p>“Worse?”</p>\n\n<p>“I’ve… I-I’ve seen myself dead. And I’ve seen nothing at all. I’m sitting in front of it right now and there’s <em>nothing</em> in there! I’m absolutely, completely invisible.”</p>\n\n<p>Perhaps it was the wrong time for it, but I couldn’t help but chuckle at those words. I shook my head, dismissing the very thought. “No, Mrs. Connor, you are not invisible. I promise you that. I told you what the mirror does, don’t you remember?”</p>\n\n<p>There was silence on the other line, and finally she stammered out an unsure answer when her memory had returned. “You said … something about another world. What did you mean?”</p>\n\n<p>“Exactly what it sounds like.” I smiled over the phone. “Mrs. O’Connor, there’s no reason to worry about the reflection. What you’re seeing is simply what may exist in another version of our world right at this very moment. If you had made a different choice, gone a different path in your life, or perhaps if someone else had changed along the way, your life could be very, very different right now. Think of it like looking into a crystal ball of every single possibility there could be but never knowing which one you will get. Maybe a Liz O’Connor in a world very different from ours could be seeing <em>your</em> reflection right now.”</p>\n\n<p>“Wait, but … no.” She suddenly sounded skeptical. “No, that doesn’t make sense. A mirror can’t show that, <em>nothing</em> can show that! It’s impossible to--”</p>\n\n<p>“Impossible?” Now it was my turn to be the skeptic. “But you’re seeing it with your own two eyes, Mrs. O’Connor. You can’t doubt that.”</p>\n\n<p>I could hear her sharp intakes of breath, trembling in either fear, sorrow, or both. It was a long time before she said anything, and in that time, I took a seat at the desk and crossed my legs as I patiently waited.</p>\n\n<p>“What do I do?” she asked next, her breathing uneven as if she were fighting back tears. “I c-can’t stop myself from looking. Nothing is coming back. D-does that mean that somewhere, I don’t exist?”</p>\n\n<p>There was no easy way to say it, but with the utmost tenderness that I could muster, I did my best. “In a simple answer, yes.”</p>\n\n<p>It didn’t help. I only heard another choked sob, her next words a bit more difficult to understand amid the sounds of her despair. “A-and my f-fa-mily… my ch-children too? They wouldn’t b-be there at all?”</p>\n\n<p>“That is correct.” I softly told her exactly what she did not want to hear, but I couldn’t lie to her. I’m a businessman, a collector, but above all, I always strive to be <em>honest.</em></p>\n\n<p>Liz exhausted herself eventually, the only solution I could give being to cover the mirror until she could find it a new, more well-suited home. She begged for me to take it back from her, but I’m afraid that simply couldn’t happen. She signed the contract, and unless that contract ceased to be, my honest self could not just break it.</p>\n\n<p>That was the last time I heard from Liz O’Connor herself.</p>\n\n<p>Days passed without incident. A few more items were sold, one or two more were brought in for me to purchase. I was more than happy to see an old set of marbles go to a new home. The way they freed themselves from their pouch and formed patterns on the floor at night was starting to become a slipping hazard, but a stressed father proved to be eager to get them out of my hair if it would stop his children from fussing. More than that, I was <em>delighted</em> when a fascinating object was brought to the store and sold to me for a mere one-hundred dollars. It’s a beautifully crafted walking stick, but the old man bringing it to me seemed all too happy to let it go.</p>\n\n<p>“I can’t imagine parting with such a gorgeous antique.” I told him, but he merely shook his head, strands of wispy white hair falling haphazardly over his wrinkled, spotted forehead.</p>\n\n<p>“Believe me,” he croaked in a dry, ancient voice. “Give it a few weeks, you’ll never want to see it again…”</p>\n\n<p>He put it into my hand and I gave him the money in return. He didn’t even bother to count it, as if the price didn’t matter much to him at all. He turned and slowly hobbled away while I inspected the painstaking detail on the cane’s wooden handle. I brushed a finger over a jewel laid in the center, admiring its shine before I noticed something startling even for me. My own hand began to change from just a touch, turning from tight, youthful skin to loose wrinkles in mere moments. I pulled both hands away after setting it down on the desk, my skin gradually settling back into a more familiar appearance. <em>Oh, thank god.</em> It was then that I heard the jingle of the front door and looked up to see the old man taking his first step out onto the street.</p>\n\n<p>He suddenly didn’t seem to hobble so much anymore.</p>\n\n<p>I made the professional decision to place the walking stick in a secure glass case, labeling it as a display item <em>never</em> to be opened. Regardless of the effects, it was indeed a very attractive treasure for the store if the right buyer happened to find it. And they always did.</p>\n\n<p>That night, I got a rather unfortunate phone call from a hysterical man. He wasn’t only in tears, but <em>furious,</em> and it didn’t take me long to learn why.</p>\n\n<p>Oh, Mrs. O’Connor… She couldn’t stand to see what she couldn’t have. The poor woman, who only meant well, left her husband a note before taking her own life. It would appear she was unhappy with the paths she had chosen, unable to accept the reality she had in front of her. Her husband, who threatened to smash the mirror to bits for giving her what he called “an obsession with her aging face”, has given me one day’s time to take back what now belongs to the shop.</p>\n\n<p>There are no refunds and no returns, but I’ll let you in on something. Death is the only surefire way to break a contract.</p>\n\n<p>I’ll be picking up the mirror tomorrow and putting it back on display. Such a gorgeous piece of decor really should not be left on the side of the road. After all, there&#39;s no telling who would find it. I’m sure one day, perhaps tomorrow or perhaps not for a while, the mirror will find itself another worthy home. It’s had so many, the poor thing.</p>\n\n<p>But until then, there is no shortage of extraordinary things to see in my quaint little shop, where every item has its own story to tell.</p>\n\n<p>You never know what you might end up taking home.</p>\n\n<p><a href=\"https://www.reddit.com/r/nosleep/comments/8lf4k6/my_shop_is_full_of_extraordinary_things_part_2/\">Part 2</a></p>\n</div>\n","author":"wendingus2"}