{"rank":"189","title":"Knees","id":"8kq40b","url":"/r/nosleep/comments/8kq40b/knees/","time":"1526785506000","body":"<div class=\"md\"><p>When I was little, I used to sleep with my knees against my chest. I am not sure why but doing so always made me feel more comfortable as I lay in my bed. Maybe it was my subconscious wishing to return to a type of in utero state; maybe it was just the feeling of my body heat keeping me extra warm under the covers. Who knows? The point is I never remember having a more restful night of sleep than when I had my knees to my chest.</p>\n\n<p>This ended about the time I turned 7. I had been staying with my grandparents for a weekend, and just before tucking me into bed, my grandmother noticed how I curled my legs up. She told me to stop, saying that wasn&#39;t a normal way to sleep. To this day, I don&#39;t know why she even cared, but rather than get in trouble, I did as I was told. The bed immediately felt colder, and a wave of uncomfortable chills swept over my body. The only word I could think to describe the feeling as was “unsafe”. But my grandmother tucked me in, my body slowly acclimated as I drifted off, and from that day on, I slept with my legs fully extended like a “normal person”.</p>\n\n<p>Cut to two nights ago. I am 22 years old now, and I had just ended my shift working in the kitchen at my local college. I was absolutely exhausted as I made my way up the stairs to my bedroom, and I collapsed onto the mattress without so much as turning on a light.</p>\n\n<p>As I lay in the pitch black room, wave after wave of thoughts floated through my brain. With them came a feeling of sadness I had never felt before, at least not this intensely. I hated my job. I hated my apartment. I hated my life. And with this depression came that old creeping chill, one that I had not felt since I was 7. The “unsafe” feeling I had all but forgotten about.</p>\n\n<p>That’s when the thought hit me. As if an old instinct had awoken in my head, I slowly slipped under the covers and curled my knees to my chest. A smile immediately spread across my face as I felt the warmth wash over me. I was safe. I was…happy. I felt like nothing could get to me. With those thoughts replacing the intrusive ones, my eyes finally slipped closed, and I fell into a deep slumber.</p>\n\n<p>My alarm clock woke me up the next morning. As my consciousness returned to me, I became aware that I slept curled up the entire night…and I felt great. I’ve never been a morning person, but today, I was ready to take on the world. My job didn’t seem so stressful. I looked around my room with a new appreciation. I truly thought everything was going to be okay.</p>\n\n<p>These thoughts vanished as I glanced at the foot of my bed and saw the deep long claw marks raking across my covers, right where my feet would have been, and dragging down under the mattress…</p>\n</div>\n","author":"GrinningBoogeyman"}