{"rank":"1","title":"I Can't Wake Up Sometimes","id":"8kq7az","url":"/r/nosleep/comments/8kq7az/i_cant_wake_up_sometimes/","time":"1526786605000","body":"<div class=\"md\"><p><em>Let me explain very simply; I am a heavy sleeper, a sleepwalker, a sleeptalker. Somewhat all of those connect, as I had a traumatic event happen when I was younger that made me develop sleep issues. I&#39;m more awake while I sleep, simply put. I seem to have these odd occurences every now and then. Such as, waking up on the couch cradling a broom like a baby: The bathtub on, filled, me in it: And my personal favorite; Waking up completely hungover with beer bottles surrounding me from a party both my subconscious and conscious thought I had.</em> </p>\n\n<p><em>However, they&#39;ve been getting worse, less amusing; Like these past few. And yes, before you say it, I&#39;ve talked to my doctor about this. He says all of these &quot;Uncapped&quot; dream experiences are due to lack of use of body energy in the day. Trust me, I&#39;ve tried that. He said I should exercise more. I actually try to get running in once a day, but my job kind of cuts in. So, maybe he&#39;s right. Not going to go into much detail, but I used a few more colorful words than I should&#39;ve when I left that office. Needless to say, I stopped seeing him.</em> </p>\n\n<p><em>I think perhaps I should keep you all updated on these dreams, as they are getting progressively darker.</em> </p>\n\n<pre><code>Number One,\nApril 10th\n</code></pre>\n\n<p>_______________________</p>\n\n<p>To make this a bit more factual, and to give it more sense, I&#39;ll give a few brief thoughts of my own as to why these dreams exist. My good friend, Kazz, ended her life a few weeks ago. I&#39;ve not been able to sleep much. My dreams have not been memorable, or really even existent in these past few weeks. I&#39;ve been working hard to get over it, and put work before thought. I believe this is sort of explanatory to this dream.</p>\n\n<p>In the dream, I was in Kazz&#39;s room. Kazz&#39;s room is composed of a small space, with a master bathroom. Her house was always kind of odd. In this particular dream, Kazz was standing in front of me. I remember she had been holding this broom in her hand, sweeping around her slightly darkened room. There were a few moments of silence before she turned to me, and dropped the broom. Her eyes were very dull from what I could tell. She looked like she had when I last saw her. Her lenghty pastel blue shirt, her hair in a messy bun. Only, there was definitely something different about her. Her eyes were composed of nothing. They were empty eye sockets. She just stared at me, before saying, &quot;Hit me,&quot; repeatedly. I didn&#39;t want to, but I did hit her. I picked up the broom, and proceeded to beat the hell out of her. As she began to stop moving, she turned towards me one last time and said, &quot;Want to have a drink?&quot; And that was the end of that. I know, I thought &#39;What the hell,&#39; too.</p>\n\n<p>I woke up at this corner of my house, a broom in hand, beating a hole into a wall. It was annoying to say the least, but I patched the hole up. </p>\n\n<p>_____________________________</p>\n\n<pre><code>Number Two\nApril 15th\n</code></pre>\n\n<p>My thought processes have been getting a bit weirder recently. I feel like I&#39;m beginning to reduce to an edgy teenager. I&#39;ve probably thought too hard about that Kazz dream, even if it wasn&#39;t all that important. Honestly, I&#39;ve had dark thoughts before. I&#39;ve done the &quot;Dirty,&quot; as the cutting community calls it. I stopped taking those pills about a year ago, when I could finally cope with everything again. However, these thoughts are beginning to return. This dream kind of mirrors them in a way. </p>\n\n<p>In this dream, I&#39;m standing next to a coworker, who is telling me to &quot;Chug!&quot; something. There was this cup in front of me, full of glass. I, for whatever dumb reason, drank the entire cup. I remember the coworker congratulating me, telling me I had &quot;Won a prize,&quot; or whatever. She then pats me on the back, and I feel a shard poke out of my throat. She, and suddenly a bunch of other people, are cheering for me. This dream goes on until my entire neck is but a bloody mess of glass. It wasn&#39;t very appealing if you&#39;re wondering. You&#39;re not missing much visual appeal.</p>\n\n<p>I woke up in tears, throwing up from dish soap poisoning. This was when I began to lock my door.</p>\n\n<p>_____________________________</p>\n\n<pre><code>Number 3\nMay 17\n</code></pre>\n\n<p>My mind is actually seeming to somewhat make it through this edgy phase again. Honestly, writing this is kind of agitating, as I feel not as threatened by my dreams. I feel like a silly little kid, running to their mom or dad to hide from a nonexistant monster. Sure, it&#39;s been hard these last few weeks, but alright.. I&#39;m fine.. It&#39;s kind of ridiculous now.</p>\n\n<p>In this dream, I am sitting at a dinner table with my family, eating. The lights are not on, and the dining room is dark while we eat. I remember my mom asking me about a man named &quot;Randy.&quot; I have a lot of extra names in my head, so I&#39;m not really surprised. If my mom came up with Logan, then how different am I? Anyhow, I began to tell her about this &quot;Randy&quot;man. I tell her, &quot;Randy hasn&#39;t visited lately,&quot; and that is about it. I think her response was something along the lines of, &quot;I thought Randy really liked staying here,&quot; As if he were some travel man. The conversation went to that of a dream, and I did not know what we were talking about much after that. However, in the final part of the dream, my dad finally speaks. His voice was low and gruff, as if he was scolding my siblings or I when we were kids. &quot;Randy never needs to go there, Joy,&quot; </p>\n\n<p>And that was it.</p>\n\n<p>I woke up sitting at my desk, a piece of bill paper set up like a plate, a pencil and pen like silverware. And my finger, slowly dripping blood, the dressing. I&#39;ve began to tuck myself in tighter, maybe be a bit more careful about what I leave out.</p>\n\n<p>________________________________________________</p>\n</div>\n","author":"Logan_Is_Gone"}