{"rank":"398","title":"Bruises.","id":"8kq8yq","url":"/r/nosleep/comments/8kq8yq/bruises/","time":"1526787174000","body":"<div class=\"md\"><p>I eat two vitamin c tablets every morning with breakfast. Mom makes me eat them because she says it helps your skin to not bruise as easily. I don’t mind the taste of the tablets much, they’re chalky and have a hint of orange. Within the first few months, the vitamin c worked somewhat, but after a while my skin bruised just as much if not more easily than it had before. I still eat them though because I think it makes mom feel better that I’m trying.</p>\n\n<p>My bruises aren’t like other peoples, they hurt, badly. Yeah I know when other people get a little bruise on their shoulder, they’ll joke with their friends not to poke it because it hurts. But my bruises are another level of pain and torment. </p>\n\n<p>Mom says that when I was a baby I would wake up screaming on random nights. She would have put me to sleep with not a mark on my soft skin, but on particular nights I would wake up crying, covered in bruises. She says it would seem that I was in such pain, but she had no idea what to do. At first they would disappear by morning and the pain would be gone. But as I grew older, the bruises began to grow darker, last for hours if not days, and they began to take shapes. </p>\n\n<p>The last bad one was five days ago on Saturday. I woke up at 8am; sitting up out of bed felt a little more difficult than usual. My shirt was off as I walked into the bathroom to piss, and I caught a glimpse of my upper body in the mirror as I unzipped my pants. On both shoulders, wrapping around my front deltoids onto my trapezius muscles, was the faint bruising of what appeared to be large handprints. I stared at them and examined them closely, knowing I was going to be in hell. </p>\n\n<p>By the time I finished pissing, the bruises evolved from a faint pink irritation against my pale skin, into a lighter greenish blue color that was getting darker by the moment. I knew the darker the bruise got, the worse it was going to be. But the skin was the least of my worries at the moment. The pressure pushing me back that had held me down slightly as I had gotten out of bed, was growing more forceful as the discoloration worsened. I washed my hands in the sink hurriedly at the end of my reach, feeling as if I was being shoved away from the water. I kept quiet because I didn’t want to wake mom yet, but admittedly I was nervous. I fought my way to my room as if I was being driven backwards by the force of a lineman, but finally, I made it onto my bed. I laid down feeling my shoulders being driven into the mattress by an ever increasing force. The squeezing feeling into my shoulders was noticeable, but it was nothing in compared to the force pushing me downwards. Some days the pressure, pain, or force in the bruises would let up after a short while, but other times I had no idea if or when they would ever stop. </p>\n\n<p>I kept quiet in bed until 830, when the pressure on my shoulders had grown so immense that my neck was getting strained by the pillow under my head. I yelled for mom to come help. She came running quickly. I could see the tears welled in her eyes when she came in and saw the blackened outlines of hands on my bruised skin. She removed the pillow and asked how bad. “7. Not as bad as the sharp ones in the liver, at least.” I said.</p>\n\n<p>Mom went to the kitchen, got two tablets of vitamin c, and fed them to me while she ran her fingertips through my red hair. She told me how much she loved me and how sorry she was. I told her I’d be okay, I had been for the last twenty years, but truthfully I was getting scared. I didn’t want to worry mom, but deep down I was terrified because I had thought the bruises were getting worse, and this last one confirmed it.</p>\n\n<p>The grip and force against my shoulders let up around 7pm that night. Like a tide against the moon, slowly the force drifted away until it was simply gone. Mom woke up from the chair she had dragged into my room as I sat up out of bed. She ran over and hugged me, leaving a little wetness where the gripping bruise had been no more than 5 minutes before. </p>\n\n<p>That brings me to the current problem.</p>\n\n<p>Ten minutes ago I had looked into my iPhone’s facial recognition, and in the screen I saw something on my throat. I went to the camera app and turned the focus towards me. Lifting my jaw and angling the camera, I saw a light pink outline of a hand around my throat. I jumped out of bed, dropping my phone to the ground, and ran to the bathroom mirror so I could get a better look at it. Flipping on the lights, I lifted my jugular and observed. Wrapping from just under one side of the base of my jaw to another, is the same right hand from Saturday printed onto my skin.</p>\n\n<p>I could feel the pressure building. Only this bruise isn’t like the one that was against my shoulders, instead of pushing back, this bruise is gripping my throat tightly. I let out a reflexive “fuck” when I looked in the mirror, the words came out in a harsh tone as if I had begun to lose my voice. The bruise had grown to a bold pink by the time I flipped off the bathroom lights and ran for my phone.</p>\n\n<p>Mom is at her sisters, thirty minutes away. I called her and told her to come home quick. I had to shout as my Adams apple scratched against the grip on my jugular with each word. Mom could barely make out what I was saying, but heard the panic in my tone and said she’d be home immediately. </p>\n\n<p>That was five minutes ago. I don’t know how long I have left. </p>\n\n<p>I am sitting in the corner of my room. By the time I got through the door, I was to out of breathe to make it on top of my bed. The grip has gotten so tight that each breathe is a struggle and I can feel my lungs begging for oxygen. My deprived muscles are week and my heart beat has grown rapid as it works overtime to pump oxygenated blood. My vision is beginning to fade and all I can hear is the wheezing sound of struggle coming from my throat. Mom is 25 minutes away. I can’t call 911 for help because I can’t talk. </p>\n\n<p>I just looked at my jugular on my phones screen through the camera lens. I barely had the strength to lift my phone. The bruise against my throat is still only a light blue, far from black. The discoloration hasn’t gotten anywhere near as bad as it is going to get, and I know the grip squeezing the life out of my body hasn’t either. </p>\n</div>\n","author":"whothefuckisG"}