{"rank":"1297","title":"UPDATE - Has Anyone Ever Heard of Phantom Social Workers?","id":"8kqgfo","url":"/r/nosleep/comments/8kqgfo/update_has_anyone_ever_heard_of_phantom_social/","time":"1526789853000","body":"<div class=\"md\"><p><a href=\"https://www.reddit.com/r/nosleep/comments/8jsd6s/has_anyone_ever_heard_of_phantom_social_workers/\">My mother disappeared in August of 2003</a> along with my six-year-old brothers, Phillip and Patrick. They left me behind. My dad died when the twins were infants and there were no living relatives on either side, so I went into foster care.</p>\n\n<p>It’s been almost sixteen years. I haven’t heard anything from or about them since.</p>\n\n<p>Until a few days ago, when I got a letter containing an old Polaroid of my brothers, along with a note that read: <em>One is still alive.</em></p>\n\n<p>I immediately called the police. After receiving a lackluster response, I hired a private investigator. While I’d toyed with the idea before, I never went through with it because always afraid of what I’d find. It’s one thing to suspect your mom didn’t love you. It’d be quite another to find your family living the high life, happy and content without you.</p>\n\n<p>But knowing they were safe was more important to me, so I bit the bullet and hired a PI.</p>\n\n<p>Perhaps unsurprisingly, I had trouble focusing at work.</p>\n\n<p>I work at a jail where I provide counseling and classes to inmates. I’ll be direct: some of my patients killed their children. Some of them fit the stereotypical definition of evil. Far more, however, are incredibly sick and had no help. Not that anything excuses what they&#39;ve done. But when you work with this population, you have to understand that they need help and you better be ready to give it.</p>\n\n<p>One of these patients is named Molly. As you can imagine, our sessions often focus on her child’s murder. Molly spends most of her time in a drugged haze, so she isn’t always up for therapy. I’m not sure I’ve seen her in a completely coherent state.</p>\n\n<p>That changed a few days ago.</p>\n\n<p>I entered her cell as usual, blinking against the painfully bright light.</p>\n\n<p>She stood by her bunk, straight-backed and wide awake. My hackles immediately went up. It’s never a good sign when the routine changes.</p>\n\n<p>“You didn’t tell me,” she said quietly.</p>\n\n<p>I fought the urge to beckon the guard. I was her therapist; if I betrayed any fear or discomfort, she might never trust me again. “What didn’t I tell you, Molly?”</p>\n\n<p>“You didn’t tell me,” she repeated, “that they used your brother like they used my daughter.”</p>\n\n<p>The cell suddenly seemed too white. Molly herself looked painfully technicolor against the blindingly pale backdrop of her cell.</p>\n\n<p>“Lucky,” she whispered. “He ate your brother, but at least you have one left. He ate my daughter and now I have no one.”</p>\n\n<p>A thousand tiny chills crawled down my spine. </p>\n\n<p>“He likes cows, you know,” she said. “The kind with horns.”</p>\n\n<p>“Where did you hear that?” Terror and rage pulsed in time with my heartbeat. This stupid bitch, this stupid, crazy, child-killing <em>bitch</em>. Fucking a cop, probably, some sick detentions officer with a big mouth and a power kink. “Who’ve you been talking to?”</p>\n\n<p>She backed away nervously. “You know who.”</p>\n\n<p>“Molly, tell me where you heard that.”</p>\n\n<p>“We played a game last night.”</p>\n\n<p>“Who’s ‘we’?”</p>\n\n<p>“I won, so he showed me all about you.”</p>\n\n<p>“Who are you talking about?”</p>\n\n<p>“Mr. Ball,” she answered.</p>\n\n<p>Suddenly I was back at my mother’s kitchen table on a long-ago summer night, sniping at Patrick about his imaginary friend while an ember-eyed social worker watched.</p>\n\n<p>I realized, dimly, that Molly was crying. “He ate my daughter and he ate your brother. He would’ve eaten the other one, but his priest loves little boys, so he let the priest pick one. He has a new name. My daughter never got a new name. But your brother, his new name is - ”</p>\n\n<p>Fifteen years of rage and pain exploded, and I screamed: “Shut the <em>fuck</em> up!”</p>\n\n<p>The guard hurried over, boots scraping on the concrete floor. His hand hovered over his taser. “Ms. Hammon? Is everything okay?” </p>\n\n<p>Humiliation and guilt swept over me, extinguishing the rage like a candle flame. I mumbled an apology and left.</p>\n\n<p>My supervisor found me pretty quickly, and gave me a choice: suspension, or a long vacation. I took the vacation.</p>\n\n<p>Honestly, I can’t believe I’m not fired. Then again, this is a department that went to bat for five deputies who beat an inmate to death in the jail basement. I guess I should count myself lucky.</p>\n\n<p>Once I got to my car, I called the detective in charge of my case. He didn’t answer, so I left a brief message about an inmate possibly having relevant information.</p>\n\n<p>Then I went to see my friend, Juli. Juli used to work with me. Last year she transferred to Property and Evidence. By necessity, she now has full access to the criminal report database. As a therapist, I don’t. I’ve never cared.</p>\n\n<p>But I do now.</p>\n\n<p>I told Juli I needed access to a report for a work. She knew I was lying, but didn’t care. Now that she’s working evidence, her favorite hobby is reading the case files of former patients.</p>\n\n<p>This is what I found out about Molly. Fair warning, it&#39;s very disturbing.</p>\n\n<p>Molly strangled, decapitated, and dismembered her infant daughter, then called 911 on herself. When deputies arrived, she was covered in fresh blood.</p>\n\n<p>But the baby’s body was gone.</p>\n\n<p>Molly was inconsolable. She claimed she’d killed her baby to save it from demons, but they came and stole her anyway. When investigators asked who’d taken the baby’s body, she said it was her father’s friend, Mr. Ball.</p>\n\n<p>Whether her father had such a friend is a mystery that will never be solved, since Molly’s father died in prison twenty-three years ago.</p>\n\n<p>The police looked for an accomplice, but eventually decided Molly had disposed of the body alone. One grisly theory posited that she’d run the pieces down the garbage disposal and followed with drain cleaner. There wasn’t any explanation for that theory, but it made it into the reports nonetheless.</p>\n\n<p>Molly pled guilty and begged for the death penalty for “failing her baby,” but ended up with a life sentence instead.</p>\n\n<p>Three years after the trial, hikers found the infant’s skeletal remains at a campground in L.A. County. According to the autopsy report, the bones were covered in knife marks. Some were consistent with the dismemberment, but others were noted to be “strange and symbolic.” The file included photo attachments, but all were corrupted.</p>\n\n<p>“They’ll have hard copies at the coroner’s,” Juli told me. “We can do a field trip.” </p>\n\n<p>I barely heard her. By this point, I was on the verge of a breakdown. It looked like my brother’s imaginary friend wasn’t all that imaginary. But that meant a human monster had preyed on my brothers. It meant I hadn’t noticed.</p>\n\n<p>Which meant it was my fault.</p>\n\n<p>I excused myself and ran to my car, where I promptly burst into tears. I was about a minute into my crying jag when the shrill ring of my cell phone gave me a heart attack.</p>\n\n<p>It was the PI.</p>\n\n<p>I took a deep breath and answered. </p>\n\n<p>He cut right to the chase. “Ms. Hammon, I’m sorry to bother you, but when do you get off work?”</p>\n\n<p>Dread coiled in my guts. “I can come now. May I ask why?”</p>\n\n<p>“I found some information that I want to cross-reference with you. It’s nothing terrible. This kind of thing just doesn’t really go down well over the phone.”</p>\n\n<p>I agreed to meet him at his office at 5PM.</p>\n\n<p>He worked out of a retail space in a dying mall. To be honest, I thought the place had shuttered years ago, but a small strip bustled with shops, real estate offices, dojos, and even an adoption agency.</p>\n\n<p>His office was at the end, right next to the closed-off remains of a Gottschalks.</p>\n\n<p>The honey-colored wood floor, white walls, and cheap Greek-inspired flourishes reminded me of my high school days, specifically the kind of trendy clothes a foster kid couldn’t even dream of. It’s stupid, but it dredged up negative feelings.</p>\n\n<p>The PI was nice, though. Younger than I expected, with a calm, assured demeanor. He dressed and walked like a plainclothes cop, which enhanced the illusion of competence. When I introduced myself, he told me to call him Dusty.</p>\n\n<p>He led me into a cluttered yet neatly organized back office. Filing cabinets lined the walls. Printouts, a giant desktop, and a laptop competed for space on an L-shaped desk.</p>\n\n<p>I recorded the conversation with my phone. I figured it might help law enforcement, if nothing else.</p>\n\n<p>“I apologize in advance,” Dusty said. “I’m very blunt. If I say anything that upsets you, call me right on out.”</p>\n\n<p>I nodded. He looked at me carefully, then sat down and unlocked the computer. “I’m going to be straight. This is a rabbit hole. Bear with me, all right?”</p>\n\n<p>“All right.”</p>\n\n<p>“First, DHS had a problem with so-called phantom social workers back in the ‘80s and ‘90s. They chalked it up to bad recordkeeping, but it came up in at least one big trial.  In 1988, a couple faced serious charges in regard to three foster children. During discovery, the DA found out they were supposed to have custody of seven. The foster parents said the missing kids were taken by a social worker named Michael Alder. Everyone assumed it was nonsense, so authorities ignored the lead.”</p>\n\n<p>“That’s awful,” I said quietly, struggling to hide my mounting frustration. What did this have to do with anything?</p>\n\n<p>“It’s a drop in the bucket. This county has a lot of trouble keeping track of foster kids. The sheriff classifies most of them as runaways. Which might make sense, if they were all teenagers. But around seventy-five percent are under twelve, and a full half are less than two.” He glanced at me. “Are you still following?”</p>\n\n<p>“Yep.”</p>\n\n<p>“Okay. In a couple of cases, the foster parents disappeared with their foster kids. That’s what happened with your mother and brothers, yeah? They all disappeared together, and the authorities decided it was a parental abduction.”</p>\n\n<p>“Yes.”</p>\n\n<p>He leaned forward. “Here’s the thing. Parental abductions specifically refer to situations where a guardian violates another guardian’s rights to the child via kidnapping.”</p>\n\n<p>“But my dad’s dead. He died when the twins were babies.”</p>\n\n<p>“Did you ever meet him?”</p>\n\n<p>“Of course.”</p>\n\n<p>“What was his name?”</p>\n\n<p>“Elliott Hammon.”</p>\n\n<p>“Okay. Well… you don’t have a father listed on your birth certificate. Your brothers do, but it isn’t Elliott Hammon.”</p>\n\n<p>I felt like I was sinking. What the hell was going on? I’d seen my damn birth certificate. How did I not know this? “Well…who else could it be?”</p>\n\n<p>“The father of record is Michael Alder.”</p>\n\n<p>I struggled to keep my composure.</p>\n\n<p>“And there’s more. Your mother took out a pretty hefty life insurance policy after she disappeared with the boys. I traced it to an insurance agent in Burbank.”  He riffled through a manila folder and extracted a printout. “And the sole beneficiary is Michael Alder.”</p>\n\n<p>“Okay, I don’t understand. Are you saying my brothers’ father is a guy some child-abusing foster parents made up?”</p>\n\n<p>“I know it’s confusing. But we’re almost done. I know you were a minor at the time, but did anyone release your mother’s death certificate to you once they identified her remains?”</p>\n\n<p>For a long second, I didn’t comprehend what he’d said.</p>\n\n<p>Then it all rushed in, physical and breathtaking as a blow to the gut. I tried to speak, but couldn’t even think of words, let alone voice them. </p>\n\n<p>He repeated: “Did they?”</p>\n\n<p>My face twisted. I smiled reflexively in an attempt to hide it, even as my eyes filled with tears. “What do you mean?”</p>\n\n<p>“I’m sorry?”</p>\n\n<p>“I didn’t – what do you mean? She’s not dead.”</p>\n\n<p>He looked like a deer in headlights. “The sheriff identified her remains in 2004.”</p>\n\n<p>I tried to speak, but couldn’t breathe.</p>\n\n<p>“Didn’t anyone <em>tell</em> you?” He leaned forward, hand hovering a few inches over mine, then leaned back. “Oh my God.”</p>\n\n<p>Somehow, I got myself under control. Maybe due to embarrassment, maybe because she’d basically been dead to me for so long. Whatever the reason, I recovered in record time.</p>\n\n<p>“I’m okay,” I said. “Sorry. Go on.”</p>\n\n<p>Looking nervous as all hell, he said, “That brings me to my next point. I’ve dealt with this before. Not necessarily on this scale, but I’ve seen it. It looks like the sheriff mishandled the investigation and covered it up.”</p>\n\n<p>My breath hitched dangerously. “Okay, but can you help me find my brothers?”</p>\n\n<p>“I can find Michael Alder because he collected the insurance payout.” He hesitated. “But can I be blunt?”</p>\n\n<p>I nodded.</p>\n\n<p>“Missing persons more often than not are dead ends. The trail probably stops with Alder. Even if it doesn’t, I think we’re looking at the worst case scenario. Are you prepared for that?”</p>\n\n<p>“Yes,” I lied.</p>\n\n<p>An anxious silence followed. </p>\n\n<p>“I’m sorry,” he said again. “If you need resources or help, I can –”</p>\n\n<p>“It’s fine,” I interrupted. “I’m fine. Is there anything else?”</p>\n\n<p>“That’s what I have right now.” He stood briskly. “I’ll call you the minute I know more. Feel free to call or stop in any time.”</p>\n\n<p>I drove home in a numb daze. But the minute I stepped inside my house, a dam broke. Anger and horror washed over me like a tide. I went on a screaming rampage. Furniture, bookshelves, decorations, literally everything but the TV ended up on the floor.</p>\n\n<p>When I was done, I collapsed in the middle of the chaos and wept until I fell asleep.</p>\n\n<p>I woke up long past dark to the chirping of my phone.</p>\n\n<p>I reached for it, half-expecting to see my supervisor’s number. I could practically hear her voice: <em>I’m really sorry, hon. You’re fired.</em></p>\n\n<p>But no. It wasn’t even a phone call.</p>\n\n<p>It was a string of text notifications.</p>\n\n<p>They kept piling up, dozens cascading in faster than the phone could display them. Most were utter gibberish, but in that tangle were a handful of coherent messages:</p>\n\n<p><em>They ate one but I saved one</em></p>\n\n<p><em>We don’t always know who we are</em></p>\n\n<p><em>They mark the bones</em></p>\n\n<p><em>It’s a game. They like to leave clues in the open</em></p>\n\n<p><em>Law enforcement knows. They’ve always known</em></p>\n\n<p><em>I’m sorry I have the wrong number this is a joke for someone else sorry if I scared you :)</em></p>\n\n<p>Three of the messages were photos:</p>\n\n<p>My brothers, standing together in a dark room, with puffy eyes and tear-streaked faces.</p>\n\n<p>The second was the strangest: blurry video still, complete with a bar of static. It showed a big room filled with masked people. A golden carpet cut through the crowd. One of my brothers, identifiable only by his tawny hair, marched up the promenade. A woman walked with him. A procession of adults in animal masks followed. </p>\n\n<p>The final photo was a creep shot of a willowy young man. It was either sunrise or sunset; the orange light and the distance obscured his features. Nevertheless, his face was exceptionally fine-boned and androgynous. It could have been nobody. Just a rando snapped by a hoaxer. </p>\n\n<p>But the thing is, my brothers spent their one and only school year being tormented for looking like girls. </p>\n\n<p>How would a hoaxer know that?</p>\n\n<p>I could barely breathe. It felt like the thin breaths were burrowing in my guts rather than my lungs.</p>\n\n<p>I called 911. The dispatcher scolded me for tying up an emergency line and transferred me to the voicemail of the detective in charge of my case.  </p>\n\n<p>In a panic, I called Dusty. To my shock, he answered. I explained what happened. He told me to screenshot the messages and send them over. I did it immediately. </p>\n\n<p>Now it’s a waiting game.</p>\n\n<p>I wish I hadn’t lost my temper with Molly. The psychological damage I undoubtedly did to her is unforgivable. But there’s another reason, a selfish reason.</p>\n\n<p>If she’s right, my brother has a new name and she knows what it is. But that bridge is burned now. I have no one to talk to and nowhere to go. I don’t know what to think.</p>\n\n<p>I just know it&#39;s going to be a long night.</p>\n\n<p>Update: <a href=\"https://www.reddit.com/r/nosleep/comments/8lqdck/2nd_update_has_anyone_ever_heard_of_phantom/\">https://www.reddit.com/r/nosleep/comments/8lqdck/2nd_update_has_anyone_ever_heard_of_phantom/</a></p>\n</div>\n","author":"Dopabeane"}