{"rank":"7","title":"It never Left","id":"8kqk1y","url":"/r/nosleep/comments/8kqk1y/it_never_left/","time":"1526791162000","body":"<div class=\"md\"><p>I recently have been experiencing some strange things that I can&#39;t explain and am in need of some advice. So without further a due let me give someone background information.</p>\n\n<p>I&#39;m a 16 yr old girl, and I live on an Indian reservation in the northern part of Minnesota. Not much happens around here except for your drug busts, fights, and more recently... Murders. Anyways with all this crime happening I&#39;m not allowed to be out and about anymore. My once relaxed parents became protective prison guards. (Which is completely understandable) I&#39;ve been cut off from hanging out with my friends really, so when my mom finally agreed to let me have some over I was thrilled.</p>\n\n<p>I had two of them over, and for privacy sake we will call them June and April.  We didn&#39;t really do much since we&#39;re not allowed to leave. But my parents decided to go out for the night so I could have some space. They leave and after a few hours of horror movies we decide that we should play with a Oujia board. (I&#39;ve always been interested in the paranormal) So we prep ourselves, April got the board together, June looked up rules and precautions we should take, while grabbed my sea shell and sage, my blessed tabacco, and a few charms that I had our medicine man bless. </p>\n\n<p>Around 1:00a.m is when we began. And at first I felt silly. Like no one&#39;s gonna come through, June and April are probably moving the playing Chet. So I ask to speak with my Grandma (She had passed very recently, end we ended on bad terms. Like I hadn&#39;t talked to her in months) The chet then moved over the letters D E A D.  And immediately I got chills. I brushed it off though and thought that my friends were playing a really screwed up joke on me. </p>\n\n<p>I wanted to call them out on it so I put the board to the test. I asked the them an impossible question, that there was no way they could have known the answer to.</p>\n\n<p>~More background info~</p>\n\n<p>When I was younger my sister and I went up to a cabin up in Canada with my Grandma.  She had a friend (who we&#39;ll call Greg) who had a jet ski.  My sister and I wanted to ride so badly so he took us on a small ride just around the island. He turned the corner to sharp and we went flying off. I remember feeling the seaweed wrap around my legs, and water filling my lungs. I still see the disgusting weeds and mucky water to this day. The fact that they had caught a 53 inch fish in that spot the day before didn&#39;t help either.  Luckily we fell close to a dock and help was able to get to us. We were pulled out of the water, and we&#39;re fine it was just really traumatic. Soon after Greg committed suicide by shooting himself in the head. </p>\n\n<p>~back to the story~ </p>\n\n<p>The question I asked was &quot;If this is really you, then what was the name of the man driving the jet ski?&quot; At this point I had never even mentioned the accident to anyone other than family ( since it was so long ago and I just wanted to never remember it.)</p>\n\n<p>Slowly the chet slid over the letter G. Must just be a coincidence? Then R. There&#39;s alot of people who&#39;s names start with GR right? Then E. And my heart stopped. As the chet slid over the last letter G, i felt more chills and removed my hands from the board. Something felt wrong but this was the proof I was looking for isn&#39;t it? All the things I wanted to know we&#39;re being proven right in front of my eyes. June scolded me for moving my hands and forced me to put them back on. I reluctantly did so, and figured since this was real I might as well ask the question I was dying to know. </p>\n\n<p>&quot;Do you forgive me?&quot;</p>\n\n<p>Almost instantly the chet slid over No. My blood turned cold. It was almost like a sinister feeling took over the room. None of us could continue after that, and went to bed.</p>\n\n<p>Despite how hurt I was over this I didn&#39;t think she would stay. But ever since then I&#39;ve been having nightmares. So often that I&#39;ve resided to just avoiding sleep at all costs.</p>\n\n<p>The first one took place outside. I stood at the end of my porch steps, starring out at the tree line. When something started moving slowly towards me. At first I couldn&#39;t make out what it was, but soon enough I could see the awful creature. There walking towards me was a human like figure that was basically just bones with a thin layer of skin over them. It was dirty and moved very oddly. Each step it took the sounds of bones breaking could be heard,  it moved so robotic like. Its hand bent all the way backwards, one leg was snapped at the center of the shin, and over moved like a Stop motion picture. As soon as she was about 30ft away from me. She charged at me. I tried screaming but nothing came out. All I could do was feel it&#39;s sharp claws on me as it screamed &quot;LEAVE! LEAVE!&quot; Over and over again. I must of actually screamed in my sleep, So loud that my sister heard me and woke me up before that thing could finish torturing me.</p>\n\n<p>Another one I had was when I walked out of my bed room and looked into the kitchen. Across the dining table, and out the window was a man. Pale, almost greyish skin and long black hair. But it wasn&#39;t his body I was staring at... It was the dark pits, where his eyes should have been. He looked right at me. And I couldn&#39;t move... I also took notice that his head reached the top of the window... That wouldn&#39;t be to weird, if we we&#39;re on the first floor. With a blink of an eye he was inside my home. And just before I woke up he whispered something in ojibwe... I translated it later and realized what he said was </p>\n\n<p>&quot;I never left&quot;. </p>\n\n<p>I&#39;m terrified because I&#39;m starting to wonder if that was even my grandmother I was talking to? And if it wasn&#39;t her, then what did I invite into my home? Any suggestions would be helpful I&#39;m getting pretty tired, and haven&#39;t slept in days... </p>\n</div>\n","author":"janel_daniels"}