{"rank":"480","title":"Don’t ever take Exit Zero from the interstate.","id":"8kql1s","url":"/r/nosleep/comments/8kql1s/dont_ever_take_exit_zero_from_the_interstate/","time":"1526791533000","body":"<div class=\"md\"><p>Now, you may be thinking “There is no Exit Zero anyway, so why would I worry about taking it?” </p>\n\n<p>Edit: I’ve been informed there are real Exit Zeros, but the one I’m referring to appears in the middle of nowhere.</p>\n\n<p>There is such an exit. It’s a phenomenon of the road throughout America, but it seems to choose victims far from the beaten path - out on lonely desert highways or remote mountain roads, for example - and who’ve been driving far longer than is healthy.</p>\n\n<p>By the time you’re exhausted enough for Exit Zero to appear, you’ll be long past the point of realizing there should be no interstate exit with that number, and the signs for the exit will tell you it has exactly whatever it is you want most - a motel to sleep in, a Flying J truck stop for coffee, or in my case, a Waffle House. Call me a hick if you want (you wouldn’t be wrong) but coffee and hashbrowns will do it for me at any hour.</p>\n\n<p>Please, fellow travelers, remember this warning if you see those signs. It’ll be in the witching hour of the night, you’ll be struggling not to fall asleep, and the signs will offer exactly what you want, but do not take that exit. I think I might be the only fool lucky enough to have ever escaped.</p>\n\n<p>If you take Exit Zero, everything will look right, friendly, <em>normal</em> - until you open your car door. The first thing you’ll notice is the cold. No matter where you were when you took the exit, it takes you to what I call the Cold Place. Such terrible, frightening cold. Not the kind of invigorating cold you feel on a clear, snowy winter morning. It’s oppressive. Predatory.</p>\n\n<p>As your breath is freezing in front of your face, you’ll notice your surroundings. Trees, endless miles of tall, skeletal trees towering over you, permanently dead from the unnatural cold.</p>\n\n<p>Then you’ll hear it. Snow crunching and branches snapping, moving towards you. Something lives in those woods. I don’t know what it is, but it is so terribly, terribly hungry. Such a frightening, overpowering hunger I could feel it just being nearby. </p>\n\n<p>Get back in your car, put it in reverse, and floor the gas. Don’t touch the steering wheel. Adjust it at all, and you will never find your way out of the Cold Place. And then he - whatever he is - will find you. I saw what happened to those poor sods. Frozen wrecks of cars just off the path of my own, torn open from the outside, no bodies inside.</p>\n\n<p>If you just hit the gas in reverse, the trees behind you won’t stop you. They’ll shatter like glass and you’ll make it back out to the interstate. </p>\n\n<p>But do not turn. Don’t try to turn around rather than reverse, and don’t try to dodge trees. They’ll toughen up and stop you dead in your tracks, and then, well...</p>\n\n<p>If you heed my warnings and make it out, you’ll be by the side of the road, no exit in sight for miles. And then, take my advice: go to sleep.</p>\n</div>\n","author":"adamc789"}