{"rank":"11","title":"\"His Final Thoughts\"","id":"8kqnjn","url":"/r/nosleep/comments/8kqnjn/his_final_thoughts/","time":"1526792507000","body":"<div class=\"md\"><p>Hi, I am the type of person to go hiking a lot and so naturally I tend to find many objects (mostly trash) on my ventures but one day I found an old, weathered book. Out of curiosity, I opened it. I have no idea what to do about the horrors I found in this book will definitely change my life forever. Heres a brief excerpt of the horrors I found in the final pages of this unfinished journal.</p>\n\n<p>&quot;June 27, 1987</p>\n\n<p>Today I went on a hike in an uncharted area around my campsite, I got an overall weird vibe from a specific area near the outskirts of my camp. It was probably nothing but I really don&#39;t feel like ever going back to that place. Anyways other than that, today was a very uneventful day.&quot;</p>\n\n<p>&quot;June 29, 1987</p>\n\n<p>Today something weird happened, but I&#39;ll get into that later. The reason I haven&#39;t written for the past few days is that I misplaced my journal, even though I swear I put it in the same place every day. Anyways, the abnormal thing that happened today is that I found what looked like old, crusted blood splattered on a tree near the strange part of the woods. I don&#39;t know, It was probably my imagination but I could have sworn it was blood. And yes, I did go back to that part woods but it was because I felt like I needed to investigate.&quot;</p>\n\n<p>&quot;July 6, 1987</p>\n\n<p>Yet again, I misplaced my journal again, except for much longer this time. I&#39;m starting to notice other things besides misplacing my journal very often, for example, I&#39;ll feel a dark presence in my room at night and also I&#39;ll catch the flash of eyes reflecting the light coming from my cabin in the treeline. I&#39;m really starting to consider heading home early because of this.&quot;</p>\n\n<p>&quot;July 15, 1987</p>\n\n<p>At this point, I shouldn&#39;t have to state why I haven&#39;t written in almost ten days, I&#39;ve started to have a sort of sick feeling in the pit of my stomach, like the way you fell when you know something bad is going to happen. I&#39;ve been having horrific, vivid nightmares recently but yet I can&#39;t help falling asleep so easily I honestly don&#39;t even feel like going into the woods anymore, I&#39;ve decided to go home early, I&#39;ll pack up in about two weeks.&quot;</p>\n\n<p>&quot;July 28, 1987</p>\n\n<p>I&#39;m supposed to pack up and head home tomorrow and of course, my journal has been missing since the last time I wrote an entree. I&#39;m going to skip the pleasantries... I&#39;m going to die tonight, I know it, &quot;Bradley 1969-1987&quot; was carved into my chest when I woke up. Consider this my final thought, See you guys around.&quot;</p>\n\n<p>I didn&#39;t know what to think at first, eyes In the woods? vivid nightmares? that sounds absolutely haunting. I noted the presence of dried blood on the page, &quot;Wow, did I really do such a sloppy job that he bled so much?&quot; I remember asking myself, also I didn&#39;t realize my part of the woods gave people such a bad vibe. I might have to start using a different sleep medication on my victims, the side effects of eyes in the woods and vivid nightmares horrified me.</p>\n</div>\n","author":"Ciananman"}