{"rank":"78","title":"People Are Being Replaced","id":"8kqrvy","url":"/r/nosleep/comments/8kqrvy/people_are_being_replaced/","time":"1526794172000","body":"<div class=\"md\"><p>I don&#39;t really know why I&#39;m typing this. I&#39;m sure there&#39;s only a few people this message can get to, by now. Everyone else is already long gone. I guess I just want to let you few people know that you&#39;re not crazy. I don&#39;t know why or how any of this happened, but I do know when, for me at least. I could remember that day clear and vivid, starting in the cafeteria. I never liked any of the food my school served. The only reason I even went there was due to a friend of mine going.</p>\n\n<p>I would give him my lunch while we talked and made jokes. That&#39;s how it was for the majority of the school year, but it never managed to get repetitive. When it happened, when I first noticed it, we were both sitting at our usual table, near the exit. I was facing the exit-door while Jason, my friend, was facing the rest of the cafeteria.</p>\n\n<p>We were talking about nonsense, just as we always did when I... detected it. It wasn&#39;t that I felt something was somehow wrong. It wasn&#39;t that there was something in the back of my mind telling me that there was some kind of presence. There was nothing; that was the problem. I felt that there was something missing behind me. At that point, I couldn&#39;t quite describe the feeling I was experiencing.</p>\n\n<p>When I turned around, I didn&#39;t see anything out of the ordinary. That feeling was still there, however. I tried ignoring it, but I was incapable of doing so. I couldn&#39;t ignore that lack of... something, that void. It stayed lodged in the back of my mind, always present. Jason interrupted me from my thoughts by asking what I was staring at. I turned back, not fully hearing his question. My mind was too transfixed on uncovering where this feeling originated from. I did hear enough of it to understand its meaning, though. Instead of answering him directly, I answered him with a question of my own.</p>\n\n<p>&quot;Hey, you, uh... you feel that?&quot; I left the question intentionally vague.</p>\n\n<p>Before he even replied, it was clear from his expression of confusion that he had no idea, &quot;What? I don&#39;t know what you&#39;re talking about.&quot;</p>\n\n<p>His response calmed me a bit. I knew, for the time being, that whatever I was experiencing had to be all in my head. Maybe it was from the breakfast I had that morning. I probably didn&#39;t fully cook everything properly, and I was beginning to feel the ramifications of that. I didn&#39;t feel sick, however; it was something else. I couldn&#39;t stay in the cafeteria with that feeling, still lingering. It was too much. After telling Jason where I was going, I left to the bathroom. While walking, the feeling became less noticeable. The further away I was from the cafeteria, the less intense that feeling became. It had completely dissolved when I finally reached the bathroom.</p>\n\n<p>Although I didn&#39;t have to use it, I stayed in there, seeing as the period was almost over. In that relatively short amount of time, I pondered on what could have caused me to feel that way. It would be simple to say that I just felt queasy, but that doesn&#39;t give reason as to why that queasiness gradually went away as I walked further and further from the cafeteria. Even with that realization in mind, that was the only explanation I could think of to explain why I felt the way I did.</p>\n\n<p>I want to say that the rest of the day was normal and that what happened in the cafeteria could be written off as being a self-contained irregularity that was typical with being a high school student. I can&#39;t say that because I felt that... void for my remaining time at school. The feeling didn&#39;t stay in the cafeteria. It would come and go.</p>\n\n<p>There was a pattern to it, however. During class, the feeling would be stationary, but during our transition periods when we would go to our next classes, it would move, sometimes closer and sometimes further. Even with my desperate attempts at ignoring it, I thought of what that had to mean. My suspicions were confirmed during my last class, for that day. It was on the first floor at the end of the hall.</p>\n\n<p>With each and every step I took closer to that class, that feeling, that had seemingly come from nowhere, developed into a more pronounced version of itself. By continually experiencing it, from lunch until then, I was actually able to build some kind of tolerance. It didn&#39;t go away; I was just able to bare the feeling. When I entered the classroom, I could pinpoint exactly where it came from.</p>\n\n<p>In the back of the class, a student sat in his desk, with his head down. This wasn&#39;t out of the ordinary for him to do. Usually, I sat near him, only being separated by a few seats, but I decided sitting in the front row, in the desk closest to the door, would be the better option. I wanted to stay as far away from him as I could. Throughout the class period, he didn&#39;t say or do anything out of character.</p>\n\n<p>He acted as he normally would, so why did I have this feeling, embedded deep within me? Furthermore, I didn&#39;t feel terror or even dread, so what was it trying to tell me? After the school day ended, without me getting answers to those questions, I walked home trying to determine why that feeling emanated from one of my classmates, but it was pointless.</p>\n\n<p>I thought about telling my parents, but as I stated before, I didn&#39;t feel sick, so they probably couldn&#39;t do much for me. Instead of telling them, I would try ignoring it. After getting home, I did what I would always do. I spent most of my time watching TV, mindlessly scrolling through my phone, and before going to bed, I did any homework I may have had.</p>\n\n<p>My alarm went off, waking me at 6:00am. I took a shower, got dressed, ate breakfast, and made my way to school. The walk wasn&#39;t far, but it still took some time for me to get there. Through the months of me walking to school from home and vice versa, I&#39;ve learned to zone out. This meant that the twenty-minute walk would seem to take only five or ten minutes. This day was different, however. Instead of zoning out, I remained conscious of every step I took.</p>\n\n<p>I&#39;d been so used to zoning out by that point that I actually noticed that it wasn&#39;t occurring. It took me a while to figure out why, but when I did, I stopped immediately. It was that feeling again; it was back. I looked around trying to pinpoint who or what was emitting it. My mind raced back to the day before, to that student. It couldn&#39;t have been him because he took the bus to school, and plus, he lived nowhere near me.</p>\n\n<p>It had to be coming from someone else... something else. I stood still, searching for the source. I was standing on a block with an apartment complex, and while the occasional car passed by, I was out there alone. The feeling resonated from within that building, but I couldn&#39;t put my finger on where in the building exactly.</p>\n\n<p>I turned my body right, the direction the building was in. I was actually thinking about trying to find out where the feeling was coming from. I left before I could fully consider my options. I was only five minutes away from school, so I went on, trying to forget but I couldn&#39;t. That feeling was still there, and it grew stronger the further I walked away from the apartment complex and the closer I made it to school.</p>\n\n<p>When I did make it to school, the feeling was greater than what it had been, a day prior. I struggled to stay there, let alone find its source. I couldn&#39;t ignore and bare the feeling for much longer. I arrived a little early to school, so I stayed in the cafeteria, and I sat where I always would, without Jason.</p>\n\n<p>He would never make it in time for breakfast. The feeling seemed to come from all around me. I decided to leave, not to the bathroom this time but, out of one of the side doors of the school. There were staff and a few teachers around the entrance, so finding an alternative route was my only option.</p>\n\n<p>I loitered around the side exit of the school. Part of me wanted to wait for Jason. I tried calling him, but I was immediately redirected to his voicemail. The bastard didn&#39;t charge his phone. I left after a few minutes of waiting, partly due to not wanting to be caught. I didn&#39;t really know where to go. My first thought was of going home. My dad would be well on his way to work, but my mom didn&#39;t have to start work until 9:00am.</p>\n\n<p>What was I going to do? I couldn&#39;t stay at school, even with how much I wanted to. I started walking home, trying to forget about why I was doing it. To my dismay, the walk wasn&#39;t placid. The feeling visited me. With every car that pass, with every passerby, with every building I walked by, that feeling lurked from within each of them. My walking soon turned into running.</p>\n\n<p>I could see my house in the distance, only being separated by a few blocks. I saw my mom&#39;s car still parked in the street, so instead of heading to my front door, I took a detour to my backyard. I lived in a street with a dead end, where houses surrounded it. My house was directly to the left. Behind my house layed the woods, and they were as far as the eye could see.</p>\n\n<p>I made my way to those woods. The feeling was tolerable by that point, so I slowed to a walking pace. I felt stupid for doing this, but that didn&#39;t stop me. I made it to my backyard and thought of walking through the backdoor of the house. I decided against it because it was possible that my mom would be downstairs, and I didn&#39;t want to risk having a confrontation with her. I walked around to the side of the house, where my room would be.</p>\n\n<p>A tree was close to my window. If I could conceivably climb said tree, I might be able to get to it. There were two things that I could only hope for if I attempted this. I hoped that it was unlocked and that my mom wasn&#39;t snooping in my room. The tree was relatively easy to climb. Aside from a minor scratch on my arm, I received from one of the branches, I was unscathed.</p>\n\n<p>Now, I was eye level with my window. I looked inside from what limited view I had. I didn&#39;t see my mom. I slowly and carefully reached for it, with my other hand gripping the tree. Thankfully, my window was open. When it was halfway open, I stopped. First, I backed up as far as I could, and then, I dashed forward and hung from the windowsill. I climbed in immediately, hoping no one saw me.</p>\n\n<p>I shut the window, closed the blinds, locked my door, and layed in my bed. I made it. I checked the time on my phone, and it read 7:43am. I had a little over an hour to wait until my mom left. I spent that time scrolling through videos on my phone, listening to them through earphones. While I was searching for what to watch next, I heard the opening and closing of the front door.</p>\n\n<p>It was 8:55am. I&#39;d completely lost track of time, but this did mean I had the house to myself for the next few hours. I didn&#39;t do much of anything. I stayed mostly in my room, playing my game console and listening to music. My parents would both get home after I&#39;ve already arrived, so I didn&#39;t have to leave and come back, to cover my tracks; that&#39;s what I thought at least. My mom was the first to come home.</p>\n\n<p>I could hear her footsteps reign through the house, straight to my room. She banged on my door, and when I opened it, she demanded that I tell her where I was during school hours. I tried lying to her, but she took out her phone and played a voicemail she received while she drove home. I sighed and made up a story about how I was hanging with the wrong crowd. I couldn&#39;t tell her the real reason.</p>\n\n<p>&quot;What has gotten into you?&quot; I remember her asking.</p>\n\n<p>Without making eye contact, I replied, &quot;I don&#39;t know. I just... I... I don&#39;t know.&quot; I thought about saying more, but I reasoned that being vague could work to my advantage. It would mean that I&#39;m less likely to get caught up in a lie.</p>\n\n<p>She brushed passed me and entered my room. &quot;Look at this place,&quot; I heard her mutter.</p>\n\n<p>She walked up to my bed and took my phone from its resting place. I thought of protesting, but I stood down. Before leaving, she told me that I wouldn&#39;t be seeing my phone or game console for the next month. After she left, I layed in bed, anticipating what my dad&#39;s reaction would be. I know this is going to sound hard to believe, but whenever I think back on that moment, a smile manages to creep its way on to my face.</p>\n\n<p>It reminds me of the typical life of a teenager. My dad came home later that day, and he fully agreed with my mom&#39;s decision. For the next month, I couldn&#39;t contact anyone from my social media accounts, and for the next month, life actually began to go back to normal. The feeling emanated from more and more people, but it never reached my parents or Jason, the people I really cared for. It grew stronger, but as I stated before, I managed to build a tolerance to it. Everything seemed to be normal. That was until my mom got a phone call.</p>\n\n<p>Jason and I were in my room, playing some fighting game when we both heard my mom sobbing. At this point, we stopped, and I went to see what was going on. My mom was in the kitchen with her phone clutched in her hand. Moments after I entered, my dad ran in, trying to comfort her. He asked repeatedly what was wrong, and after a few attempts, she whispered something that I couldn&#39;t quite make out. My dad could, and he told me to tell Jason to leave. I went back upstairs and did so, without question. When we made it downstairs, my parents were already making their way to the car. Jason and I said our goodbyes, and I rushed towards them, asking what happened.</p>\n\n<p>My dad responded by telling me to just get in the car. I did and soon after, he drove. The drive was silent, and it took me some time to figure out where exactly we were going. After a while, it became obvious that we were going to the hospital. I couldn&#39;t place a reason as to why, however. When we got there, both of my parents rushed over to the counter and asked to see someone.</p>\n\n<p>They asked to see someone that I somehow forgot about. It was my grandfather. I had never been particularly close with him, only visiting him a hand full of times in my childhood. After he was diagnosed with cancer, I never heard from him again. My dad told me to follow him after speaking with the woman behind the counter. We were assisted to his room, by a doctor.</p>\n\n<p>My mom had stopped sobbing when we entered the hospital, but as soon as her eyes layed upon her father&#39;s frail body, all of her emotions were unleashed. She ran in with tears flowing down her cheeks, hugging him tightly. My dad and I came in seconds after her. He reassured her that everything would be okay and kissed her forehead. That feeling resonated from within his body.</p>\n\n<p>I hadn&#39;t noticed before since I had gotten so used to it. My grandfather&#39;s attention only stayed on my mom for that initial hug. He turned his attention to me as soon as I was in his view. He said he couldn&#39;t believe how old I was. He said he could remember when I was still a child as if it were only yesterday. He said everything a grandfather should say upon seeing a grandchild they haven&#39;t saw in years.</p>\n\n<p>Even with him saying those things, I knew that the man... no, the thing, lying in that bed, wasn&#39;t my grandfather. It was the ultimate imitation. He asked my parents to leave so him and I could do some catching up. When they left, when it was just me and him, he spoke.</p>\n\n<p>&quot;How&#39;s life been going, bud?&quot; he asked with a slight smile.</p>\n\n<p>I didn&#39;t respond. It was partially due to being scared, but it was also something else. My attention wasn&#39;t on that thing posing as my grandfather. It was on that feeling. Until this point, I had mostly tried ignoring it, but now, I was focussed on it. I felt the familiar emptiness. However, it came from its head. There was something missing from the inside of that thing&#39;s head. I thought about what it could possibly be.</p>\n\n<p>That was until he chimed in with, &quot;Not much of a talker are you? Hey, if it&#39;s because of you seeing me like this, then you-&quot;</p>\n\n<p>&quot;No,&quot; I said abruptly, &quot;it&#39;s not that.&quot;</p>\n\n<p>&quot;Oh, well if that&#39;s the case, I was hoping we could talk.&quot;</p>\n\n<p>Hearing him say those words sent a shiver down my spine. I thought about what this talk could be about before finally uttering, &quot;Sure. About what?&quot;</p>\n\n<p>I waited for the big reveal. I waited for everything to be explained to me. I waited for that slight smile to turn into a sinister grin. Instead, he repeated, &quot;How&#39;s life been going?&quot;</p>\n\n<p>We went back and forth, talking about things he did in his life and things I&#39;ve done in mine. That feeling kept me on edge, and while he was reciting something from his past, I figured it out. I figured out why that feeling originated from within the head of my grandfather&#39;s impostor. The thing that I had engaged in conversation with was missing the key element of what it meant to be human. It was missing its consciousness, and I somehow could sense it.</p>\n\n<p>I don&#39;t know why or how I could do so. It&#39;s like a sixth sense. That&#39;s the best way I can explain it. When I figured this out, my mind was filled with questions, too many to list here. He stopped speaking, noticing my heavy breathing, and ask what was on my mind. I only stared at him. He took a deep breath and stuck his hand out, gesturing for a handshake.</p>\n\n<p>He said something about this being the last time we&#39;ll probably see each other again. I walked forward, but with every step I took, a new feeling grew stronger that was there ever since I entered the room. I know this is going to sound cliché, but I felt complete dread with every step. There was something telling me not to get any closer to that hand.</p>\n\n<p>He put his hand down and took another deep breath. He didn&#39;t follow it up by saying anything, however. I could feel tears stream down my face. I started doubting myself. I began thinking that this was my grandfather and that I was being delusional. </p>\n\n<p><em>No</em></p>\n\n<p>That&#39;s exactly what it would want me to think. I practically ran out that room after coming to that realization, crying uncontrollably. I wanted nothing more than to go home. Both my parents comforted me, and after they said their farewells to that thing, we left. The moon shined bright in the sky. My mom was asleep in the passenger seat while my dad drove.</p>\n\n<p>I was about to join her, but my dad spoke, &quot;You still up?&quot;</p>\n\n<p>&quot;Yeah,&quot; I replied in a whisper, &quot;Why?&quot;</p>\n\n<p>&quot;I was just wondering if you,&quot; he search for the right words, &quot;felt something.&quot;</p>\n\n<p>&quot;What?&quot;</p>\n\n<p>He said in a hurry, &quot;Nevermind, just forget what I sai-&quot;</p>\n\n<p>&quot;Wait,&quot; I interrupted, &quot;Are you talking about grandpa. If you are, then yes, I did feel something.</p>\n\n<p>We had a conversation that I&#39;ll never forget. He told me that he and my mom have been experiencing this feeling for a while. They never told me because they didn&#39;t want me to think they were crazy. When I told him that was essentially the same reason I had never told them about it, he sighed in relief. Our conversation ended with him telling me to be careful, and we drove the rest of the way home in silence.</p>\n\n<p>When we arrived, my dad tried waking my mom. However, she wouldn&#39;t wake up. He tried shaking her, but it was pointless. He said that he would carry her inside, giving me the keys to unlock the door. I got out the car and opened the front door. When I turned around, I could see my dad already opening the passenger side door. I didn&#39;t see a reason to stay, so I left to my room.</p>\n\n<p>About five minutes or so later, I noticed that I never heard the front door close. I went back downstairs, curious more than anything. What I saw shocked me. My dad layed collapsed over top of my mom, only inches from the door. I ran down towards them while shouting for them to wake up. None of my attempts worked, so I tried something else.</p>\n\n<p>I ran back to my room and called the police. Ten minutes go by, and they finally arrived. I went back downstairs, and I saw two police officers standing outside the front door. I walked towards them, but before I could walk the full distance, one of the officers told me to stay back. I noticed that they had their guns out as if they were ready to fire.</p>\n\n<p>&quot;It&#39;s that feeling,&quot; I heard one of them whisper to the other.</p>\n\n<p>&quot;Is it coming from the kid?&quot; the other whispered back.</p>\n\n<p>&quot;No,&quot; the other responded.</p>\n\n<p>&quot;What&#39;s going on?&quot; I asked. I didn&#39;t ask out of confusion. Hearing what the first officer said gave me all the information I needed. There was something else too. The feeling was back, but it didn&#39;t come from the officers. It came from both my parents. My breathing became heavy, and my legs began to wobble. No. This wasn&#39;t happening. This couldn&#39;t be happening.</p>\n\n<p>One of the officers said, &quot;Kid, you need to come with us. Walk towards us, but try not to touch them.&quot;</p>\n\n<p>I did what I was told, and I soon found myself in the back of their cruiser. They drove while I wondered about the events that had just transpired. I finally built up the courage to asked what was going on. The officer in the passenger seat told me that there&#39;s something spreading.</p>\n\n<p>&quot;It&#39;s some kind of virus that takes over the brain, destroying the nervous system,&quot; was his reply.</p>\n\n<p>&quot;So, how does it spread?&quot; I asked.</p>\n\n<p>He responded with, &quot;It spreads via contact with an infected person&#39;s blood, saliva, and well you get the point. Once someone&#39;s infected, they&#39;ll go on, living life as they always did, but their personality will change slightly. They&#39;ll be more friendly and inviting. We think this is to spread the virus to as many people as possible.&quot;</p>\n\n<p>I thought back on how this could have happened to my parents. I remembered the visit to the hospital that happened only hours before, and I remembered the kiss that imposter gave to my mom on her forehead. While dad carried my mom&#39;s body into the house, she... no, it must have woken up and infected him as well. My mind traversed on the rest of what the officer said. I asked with tears starting to form, &quot;So, wh- why don&#39;t they just spit on people or something. Wouldn&#39;t that be a better way to spread the virus?&quot;</p>\n\n<p>&quot;Think about it kid. You could feel it too. If people who gave off that feeling started spitting on others, and then they started spitting on others too, don&#39;t you think there would be some kind of resistance? It&#39;s by being discrete that there able to live on. We can&#39;t start killing people just because we get a weird feeling from them. It would have disastrous consequences if we did so.&quot;</p>\n\n<p>He was right. There was really nothing left to say. There was still one more question I had, however, &quot;Where are we going?&quot;</p>\n\n<p>&quot;We&#39;re going somewhere you&#39;ll be safe.&quot; The ride was silent after that. I was woken up by one of the officers and was told that this would be my new home. The sun illuminated the horizon, and I got a good look at my new home. It was a college campus. I was taken to a room with two bunk beds and a bathroom, where I meant three others, who were all around the same age as me. I introduced myself, and they all did the same.</p>\n\n<p>It&#39;s been a few days since then, and somehow I&#39;m actually starting to get used to my new living arrangement. I&#39;ve tried asking around to see if I could find Jason. I tried calling him, but it immediately went to voicemail. I made a request to find him, and I&#39;m currently still on a waiting list. I hope to God that he&#39;s alright. There are still so many more questions I need answers to, but I wanted to type this first.</p>\n\n<p>This is a warning to anyone out there that feels like there&#39;s something not quite right about a person or a group people. I want to let you know that you&#39;re not crazy or delusional. Go find others that are like you and hide. Try to stay as far away from people, who give off that feeling, as possible. If you can&#39;t do that, then try to hide in plain sight. I&#39;ve learned a little more about the virus while being here. I learned that unlike us, it can&#39;t sense who it has already spread to.</p>\n\n<p>I hope we find a way to put a stop to it. Until then, I hope everyone who&#39;s not already infected can find a safe haven.</p>\n</div>\n","author":"MeliousIntent"}