{"rank":"57","title":"The Path of the Moon","id":"8kqscj","url":"/r/nosleep/comments/8kqscj/the_path_of_the_moon/","time":"1526794357000","body":"<div class=\"md\"><p>I had just broken up with Troy. On vacation, of all places. I should have known it was a stupid idea to go on vacation with a guy I’d only been dating 6 months. But what’s done is done, and there I was, stumbling down the beach less than sober, with a half-empty bottle of warm beer sloshing in one hand. </p>\n\n<p>I didn’t want to go back to the hotel, since I wasn’t sure if he’d be there or not. So, a long walk on the beach seemed my best option. At least it was a beautiful night. The ocean was black and as smooth as glass, with the tiniest of waves tentatively licking the shore. The moon was full and cast a brilliant white path across the water. </p>\n\n<p>I remembered being a little girl and excitedly imagining what that moon path led to. We’d be camping and I’d sit with my brothers at the edge of the lake; they’d fish and try to push each other into the water,  and I’d sit there kicking my feet in the water and making up stories in my head. Of course the moon path led to the other side of the lake, but what was over there? I could see what I thought were other campfires, but maybe they weren’t. Maybe there were giant fireflies. I hoped they were friendly......</p>\n\n<p>I took a swig of warm beer and the memories floated away. This silvery white ribbon across the ocean didn’t look as friendly or inviting as I remembered from when I was a child. It was a cold light. Strangely enough, it looked almost hard. Despite this, that old feeling of being a kid and wanting to walk across the moon path and find out what it led to wouldn’t go away. Listing slightly to the side, I found myself drifting closer to the water and then dipping my toes in. I splashed through the surf and even skipped a little. I dropped my beer bottle and it sunk beneath the waves. </p>\n\n<p>It wasn’t long until I had almost reached the place where the moonlight touched the shore. I wanted to swim in the light, so I pulled my top off and threw it onto the sand. I started running again, planning on splashing into the light and then diving in. I gathered speed, whooping and laughing, having a hell of a time, and - fell flat on my face. </p>\n\n<p>I picked myself up, coughing and spluttering and trying to get the salt water out of my nose. After a few choice expletives I turned around to see what I’d tripped over and hopefully throw it far into the ocean. I couldn’t see anything in the dark water. Approaching carefully, I reached down toward the strip of moonlight. My hand stopped when I touched it. </p>\n\n<p>It was hard. Well, not hard per se. It’s difficult to explain exactly what it felt like. The closest thing I can compare it to is those experiments with cornstarch where it’s soft if you touch it slowly and hard when you hit it. It had that same kind of hard but soft feel, except it didn’t give when my hand touched it, but merely moved away from my fingers ever so slightly. Since I was still a little drunk, this was more fascinating than surprising to me. I touched it some more, putting both hands on it and pushing. I walked down into the ocean until the water was waist deep, poking and prodding as I went. The feeling didn’t change. It seemed a legitimately solid surface. So I went back to the edge of the water and set one foot on the path. </p>\n\n<p>It rolled ever so gently under my foot but supported half my weight, so I stepped into it with my other foot. It moved more noticeably this time but not enough to throw me off; I relaxed and moved intuitively with it. I don’t think I would have balanced so well had I not been inebriated, actually, because I was loose enough to move with the path and not against it. I took a step forward. And then another. </p>\n\n<p>I was shocked at how easy it was to walk. Once I got the hang of the motion I was able to move pretty quickly. The moonlight felt amazing beneath my feet. Silky, cool, wet but somehow not slippery. The undulating of the path seemed to help propel me forward. I broke into a jog and then a full run. </p>\n\n<p>I was running on the moonlight across the water. 8 year old me would have been so amazed! And vindicated. I laughed out loud and picked up speed. The water around me was so smooth and calm. I ran with no goal, no destination, no object besides keeping this amazing feeling going for as long as possible. I had no awareness of the passing of time. Time is a confining thing, and I was free. Freer than I had ever been or hoped to be. </p>\n\n<p>I don’t know how long I ran for. I only stopped when I began to fatigue - just a little, the faintest hint of exhaustion. But it brought me back to the moment, and I slowed to a walk, then stood still. The only sounds were my breathing and the rippling of the water. </p>\n\n<p>Looking ahead, I could see nothing. No lights from ships, no possible land masses, absolutely nothing. I wasn’t scared yet. More curious than anything, I turned around carefully and looked back to where I had run from. </p>\n\n<p>I could not see the shore. Only the moonlight slicing through the dark water. For the first time that night, fear sounded in the back of my mind. I took a step in the direction I had come from. </p>\n\n<p>Behind me, I could sense the light change ever so slightly. I turned again. </p>\n\n<p>It took me a moment to register what was about to happen. A large dark cloud had just started to obscure the edge of the moon. Its shape was familiar and menacing, but I couldn’t place it. All I knew was the moon was about to disappear behind it. I pivoted and ran as fast as I could. </p>\n\n<p>It wasn’t fast enough. I could see the path in front of me fade and narrow, until it was a knife’s edge I was trying to balance on. Then it was gone and I plunged into the ocean. </p>\n\n<p>The water was colder than it had been next to shore and I gasped as I went in. I barely managed not to breathe in any water, and turned myself onto my back as quickly as possible. I floated for a moment to let my breathing calm down before I started to swim. When I was ready I turned over and prepared to start for shore. </p>\n\n<p>Except I didn’t know which way it was. </p>\n\n<p>There were no lights in front of me. I jerked my head around. No lights that way either. No lights to my left or right. There was nothing around me as far as I could see in any direction, besides inky blackness. </p>\n\n<p>The fear that stabbed me was so cold the water felt warm in contrast. I was alone. Completely and totally. </p>\n\n<p>It’s impossible to describe the feeling unless you’ve experienced it. Very few people, in their lives, will find themselves in a situation with absolutely no hope of survival or rescue. It’s too much for the brain to comprehend, so it shuts down. I know for sure mine did. I started screaming, at the top of my lungs, for as long as my voice held out. When it failed, I kept screaming. I yelled and screamed and cursed and shouted until I couldn’t breathe, and at last I slipped beneath the water. </p>\n\n<p>I woke up this morning (afternoon? I’m not sure) in a small, windowless room, with a man sitting beside my bed. I shifted and tried to sit up; he looked up from the book he was reading and smiled. </p>\n\n<p>“Oh good! You’re awake. And in splendid time too. Don’t try to move too much. Lie still, and when you can, try to tell me how you feel.” </p>\n\n<p>“I.....” my voice was gone. </p>\n\n<p>“That’s all right, that’s all right. I just need to know if you’re in any pain. Hold up one finger for none......” </p>\n\n<p>After he quizzed me, I mimed writing and got him to give me a piece of paper and a pen. “What happened?” I wrote. The things I thought I remembered couldn’t have been true; I must have dreamed them. I wasn’t wearing my own clothes though. Where were they? Why would I have taken them off? </p>\n\n<p>“Oh, you decided to take a swim late last night and almost drowned. You’re on board the Coranado now. We were out fishing when we heard you screaming.”  He chuckled. “Quite a set of lungs you’ve got there. Saved your life. Well, that and the fact that sound carries across water. I could tell you couldn’t see us or hear us for some reason and by the time we got close enough you’d gone under. I’m just glad we were able to get you breathing again. Now, can you recall the name of the cruise ship you jumped off of? I’ll radio the captain. Guessing you have some pretty concerned family or friends right about now.” </p>\n\n<p>I was still groggy and confused, but felt like I might be able to use my voice again. </p>\n\n<p>“I wasn’t on a cruise. Why do you think I jumped off a cruise ship?” I croaked before doubling over coughing. </p>\n\n<p>When I finally stopped coughing, I looked up to see the man staring down at me with a look I’ll never forget. </p>\n\n<p>“........because we found you ten miles out.”  </p>\n</div>\n","author":"5kfiend"}