{"rank":"23","title":"My Roommate is Reproducing","id":"8kqvk5","url":"/r/nosleep/comments/8kqvk5/my_roommate_is_reproducing/","time":"1526795743000","body":"<div class=\"md\"><p>I don&#39;t know for certain, but I am thoroughly convinced that my current roommate is asexually reproducing and I&#39;m not really sure where else to put it besides here. I know it sounds super bizarre but I assume most followers of this sub are used to it.</p>\n\n<p>To preface, I had been rooming with my roommate, Wyatt, for roughly six months now. We lived in a cheap run-down apartment not too far from the university we both attended. Wyatt and I had been friends since high-school, we were dorm-mates for the first two years of college and just nine months ago we decided to move off campus and live together. To say we were close was an understatement, we practically did everything together. Movies, video games, rec sports, parties, and just hanging out in general. Even though Wyatt and I didn&#39;t look very similar, friends in our social circle often called us &#39;the twins&#39; due to us doing everything together. The only thing Wyatt and I didn&#39;t have in common was our declared majors. Wyatt was going to school to study in microbiology, while I went to school to be a mechanical engineer. I often clowned him on how he wasn&#39;t going to get a job after college and he often retorted with how his studies will benefit humanity, but anyways, I digress. </p>\n\n<p>I first noticed something wrong with Wyatt after a movie one night. Wyatt and I were sitting on a bench outside the theater, excitedly chatting about the movie when I noticed a wart-sized red bump near the base of his neck. </p>\n\n<p>&quot;Woah, dude what the hell is on your neck?&quot; </p>\n\n<p>&quot;Oh, it&#39;s just like a bug-bite or something. I probably got it when my lab group and I went and studied those bacteria in the marsh last week.&quot;</p>\n\n<p>&quot;You should put some cream on it, it doesn&#39;t look too good. Really gross actually.&quot;</p>\n\n<p>Wyatt rolled his eyes.</p>\n\n<p>&quot;Thanks for that helpful assessment doctor, it itches like hell, if it doesn&#39;t go away I might get it checked out or something,&quot; he shrugged. </p>\n\n<p>But being broke college students with no time and even less money, Wyatt never got it checked out. The next time I saw the bump it had grown slightly, about to the size of pea, and had moved down closer to his chest area. I only noticed it when he was napping shirtless on the couch, something he commonly did on hot afternoons. The bump was even redder than before and looked incredibly disturbing. I debated whether to wake up Wyatt and ask him why he hadn&#39;t gotten it treated yet, but against my better judgement I didn&#39;t. He was a grown man, he didn&#39;t need me nagging him to take of himself. In retrospect, I really wish I did make him go to the doctor though. </p>\n\n<p>Weeks passed and I forgot about the bump, but Wyatt&#39;s behavior began to get a lot stranger than usual. It started off with him just sleeping way more than usual. After work or class everyday Wyatt would come home and sleep for multiple hours. It got to a point where he never did anything outside of work, class, and sleep. He stopped hanging out with the group in order to sleep. On the rare occasions Wyatt was awake, he acted incredibly odd. Wyatt was always a sarcastic and jokey person who never shut his mouth, but when I would catch him awake he was always solemn and quiet. </p>\n\n<p>His eyes were wide and darting, and he almost seemed in a constant state of paranoia. I was relieved when about three or four weeks later, Wyatt began to sleep less, returning to a normal schedule, but he didn&#39;t lose his paranoid or quiet demeanor, in fact it was probably worse at that point. In place of sleeping he started to eat, a lot. First he ate up just about everything in our fridge and pantry, and then he began to bring home bags of groceries only to carry them into his room and shut the door. Muffled sounds of crunching and cellophane wrappers could be heard throughout the apartment. </p>\n\n<p>My interaction with Wyatt had basically dwindled to none. We only acknowledged each other when he walked in the after work/class and briefly nodded at me only to head straight to his room and close the door. I went to movies alone, I showed up to social gatherings alone, my life suddenly had a hole in it. </p>\n\n<p>One Friday, I had fallen asleep watching a movie on the couch. I woke up around roughly two in the morning, and had to pee worse than a drunk college girl leaving a club. I hobbled to the bathroom in the dark and quite literally smacked face-to-face with Wyatt in the hallway. I fell away backwards and began to say sorry but Wyatt cut me off quickly.</p>\n\n<p>&quot;Jesus I am so sorry dude! I didn&#39;t even see you.&quot; </p>\n\n<p>&quot;No problem, mannnn...&quot; I slurred. I  may have had a few beers while watching that movie. I might have been tipsy but I wasn&#39;t drunk enough to not notice that when I had smacked into Wyatt I felt the bump again, and it had moved down once more, right on Wyatt&#39;s  left abdomen, off-center. It had grown again to the size of an orange and felt like it was pulsating very slightly. I was very concerned at this point. </p>\n\n<p>&quot;Wyattt... man... you gotta get that bump like... chec-&quot; but I was promptly cut off by the sound of his door closing. In my alcoholic-haze I just shrugged and stumbled off the bathroom, falling asleep directly afterwards. When I woke up, the bump was a lost to my memory. Sort of like those dreams that you can almost-remember when you wake up but not quite. </p>\n\n<p>Summer started, and if Wyatt wasn&#39;t a recluse before the incident, he sure as hell was now. I didn&#39;t see him at all. The only way I knew he was alive was the telltale occasional sounds of cellophane or the toilet flushing. Somehow he always managed to be in his room every time I was home. I was used to not sharing my life with Wyatt anymore. Although I was sad I was never the type of person to confront things. I figured that this was a phase he would get out of soon and I would have my witty, sarcastic, and funny best friend again. </p>\n\n<p>It wasn&#39;t until one sweaty summer day I barged into Wyatt&#39;s room for the first time in months. He wasn&#39;t home and I really needed to find some batteries for my portable fan. Wyatt had knack for keeping handy things in his room. When I walked in, I halfway expected for it to be a complete mess, a nest or filth that resulted from the twenty-plus hours Wyatt spent in here doing god knows what, but I was pleasantly surprised when I saw that his room was neatly organized like usual. The only messy thing was his desk in the corner of the room, which was piled high with bookmarked textbooks and loose papers. </p>\n\n<p>In one corner of the desk was a microscope and a multitude of petri-dishes haphazardly scattered around. My curiosity preceded me. I crept over to his desk, tip-toeing as if he was here in the apartment. Before I reached the desk my sock landed on a slightly damp cloth on the floor. I looked down to see a bundle of wet towels under Wyatt&#39;s desk. At first I was disgusted at what these towels may have been, but then i noticed a very slight movement in the bundle. I reached in, and pulled the towel back. Underneath was a lump of flesh, slightly throbbing and criss-crossed with veins. At first my confusion prevented an immediate reaction, but then my jaw began to drop as I slowly realized what this fleshy mass was. The bump. I could recognize it from anywhere, the memory of the hallway and bumping into him flooded back to me. Wyatt had somehow detached this tumor from himself and it had grown almost to the size of a bowling ball. <em>What the hell is going on?!</em> I thought, holding back a gag. Then I heard the front door unlocking. I put the blankets back in the way I found them the best I could and practically sprinted out of the room. </p>\n\n<p>I barely managed to get on the the couch and compose my poker face before Wyatt quietly entered the front door. He gave me his usual nod and proceeded to his room. All I could do for the next couple weeks was wonder in silent horror what was going on behind his door. He almost never left the house at the same time as me, so it was near impossible to sneak back in there. The more rational explanations I tried to make for why my roommate was keeping a growing, liv<em>ing f</em>lesh in his bedroom only led to more questions.</p>\n\n<p>About two weeks after I discovered the bump, another incident happened. I sat in the kitchen fixing a sandwich when I saw Wyatt leave the house for the first time in a long time. He had on a long overcoat despite it being summer and looked much more pale and gaunt than usual. </p>\n\n<p>&quot;I- I have to go out, ok? I won&#39;t be very long,&quot; he said with the paranoid overtone that had overlain his voice for the past couple months.</p>\n\n<p>With that, he shut the door quietly and I heard his footsteps grow farther on the concrete. I looked out the living room window and waited until I saw his car pull out and drive away before I sprinted to his room. It took me a almost twenty minutes to pick the lock he had put on his door a week prior, but I finally managed to unlock it. I put my hand on the handle and slowly braced myself for whatever grotesque scene I might see, and one I did. When I swung open the door I saw the tumor/bump/monstrosity smack in the middle of the floor, sitting on a nest of wet towels again. It was, again, even bigger this time. Like the size of a large yoga ball. I gasped loudly and it began to throb violently, as if in response. </p>\n\n<p>&quot;What the-&quot; I began but then I was cut off when the monstrous flesh throbbed and began to shake even more intensely than before. I fell backwards with a mixture of horror and fascination as I watched the blob continue to move violently, and then suddenly, without warning, there was a sharp ripping noise followed by a wet gushing sound. A slit appeared on the surface of the blob and slowly expanded down the circumference of the thing. I could only stare silently as two glistening hands shot from the slit and gripped the sides. What the blob was dawned on me, the eating, the growing, the moist towels. <em>It was a damn egg</em>. My body was completely frozen, and all I did was watch as a full human body pulled itself from the flesh blob akin to how a turtle pulls itself out of the confines of its leathery egg. The naked body flopped on the floor, dripping some unknown reddish liquid everywhere. After what seemed like an eternity it lifted its head and looked at me. </p>\n\n<p>Oh god. </p>\n\n<p>Its face. </p>\n\n<p><em>it was Wyatt.</em></p>\n\n<p>He, no <em>it,</em> shot me a grin. A grin I was so familiar with yet hadn&#39;t seen in so many months, the grin of my roommate, my best friend. My body kicked into full action, I stood up with surprising speed and in two quick bounds made it into my room across the hall. I shut the door and barricaded it with my dresser and whatever else I could find. That brings me to now, the thing that looks like Wyatt is banging on my door, saying my <em>name</em>. The actual Wyatt still hasn&#39;t returned and it&#39;s been nearly three hours. I left my phone in the living room, all I have is my computer and it&#39;s quickly losing charge. I don&#39;t know what&#39;s going on and i&#39;m too scared to leave my closet. My roommate is reproducing.</p>\n</div>\n","author":"SeaSaltStrangla"}