{"rank":"34","title":"The New Hebrides Incident","id":"8kr3yz","url":"/r/nosleep/comments/8kr3yz/the_new_hebrides_incident/","time":"1526799419000","body":"<div class=\"md\"><p><a href=\"https://www.reddit.com/r/nosleep/comments/8eb21t/the_seal_island_incident/?st=jhef0t7s&amp;sh=d716dc2f\">The Seal Island Incident</a></p>\n\n<p>Hearing that sound again, that hellish aural lure, shook me to the core. It’s been years since that night off the coast of South Africa but I was instantly back there, glass shattering as my colleagues died around me.</p>\n\n<p>The first thing I did was get the hell out of that canyon. The very next thing I did was call Callum.</p>\n\n<p>It’s fair to say that South Africa broke Callum. I know he blamed himself, despite the fact that none of us could ever have had any idea what was down there. Cal took it hard, though; retreated from the world, dropped his scientific pursuits, and started focusing on nothing but the beast. He wanted to find out what it was so badly that he sank all his money into the chase. Most of the colleagues who once admired him now shunned him entirely, called him crazy. Maybe he was a little, too, but I could hardly blame him. He was no less brilliant for it and I knew he’d been chasing this thing obsessively for years so he seemed the logical choice.</p>\n\n<p>Callum was in Brisbane, a week or so away from heading out on another expedition. When he heard what I had to say, though, he shelved it and made plans to come to Perth as soon as he could. \nThat night, he sent me a reasonably chilling email.</p>\n\n<hr/>\n\n<p>Ellie</p>\n\n<p>I need to tell you a story before I come out there, because I haven’t got many allies anymore. Not after what happened. But I need closure. I need to find what’s out there and I’m willing to take the rest of my life to bring it to light. And I know you understand that even if you disagree with my approach.</p>\n\n<p>I only ever found bits and pieces. Some murky audio on a SOSUS mic, or stories about something that might be tangentially related. I have so many faint, barely audible shrieks that sound completely alien but must have been recorded from about a thousand miles away. Once we got called out to a beach where half a sperm whale carcass washed up. The thing was shredded, but it was badly decomposed and apart from the fact the spine had been severed by something we couldn’t get anything concrete. Last year, though, someone found a large shark long-liner drifting somewhere south of New Caledonia. A handful of the crew were missing, and those left on board were all dead. It was pretty hush hush, I think mostly because it was an illegal boat, but also because of all the bodies. They said it was not pretty; the poor bastards must have got a full blast. I’ll spare you the gory details but suffice to say that one of the things their injuries were consistent with was sonic trauma. This had to be sonic trauma on a massive scale, though. Worse than what we went through. Some of these guys died in reasonably open areas. They reckon 190 decibels is enough to burst most peoples’ eardrums, and 240 decibels or something would be fatal 100% of the time in an enclosed space. I can only imagine how horrible that blast had to be to kill men on the deck. </p>\n\n<p>We were never allowed near the boat or the bodies, but that probably doesn’t matter. I’m not exactly qualified to make much of whatever I would find anyway. We did manage to find out that the ship had stopped in Vanuatu, so we knew that to get where it was found it had to cross the New Hebrides Trench. That was worrying, because as you know there’s an awful lot of cruise ship traffic going back and forth over certain parts of the trench. It gave us somewhere to look, though. We’d been back to South Africa a few times and found nothing major, although we did get more audio it was much further away. Given the range of potential recordings I figure these things probably get around in the really deep waters, coming up into shallower spots to feed or when their path dictates. They can pretty much cross the whole ocean without ever leaving the abyssal zone. </p>\n\n<p>I’m sure you can imagine that I haven’t got a lot of serious scientific backing on this. Which is to say I have zero backing. But you’d be amazed at the kind of help you can get from other sources. I’ve been working with a couple of Cryptozoologists, which is an interesting experience, although they have actually studied biology so they do know what they’re talking about for the most part. Money takes care of the rest; people will do just about anything for the right amount of dollars. We haven’t got top of the line tech, but it’s still better than the stuff we were working with when we first started out!</p>\n\n<p>New Hebrides isn’t far offshore, really. In real terms it runs about 50km off Port Vila and 20km off Mare Island, so access wasn’t a problem. We even got a half decent ship for the mission, a bit older but solid as a rock and bigger than I expected. It was based out of Noumea, which meant a slightly longer trip to the trench, but I figured we’d just go south-north instead of north-south for the survey. The idea was we’d run a lawnmower survey pattern across the width of the trench with the mapping sounder, as well as hydrophones, and then dive anywhere that seemed promising. We had a couple of tow cameras, but they had a very limited field of view. I wanted an ROV if I’m totally honest, but all I could get was a salvage sub so it would have to be manned dives. I didn’t really think a sub would be big enough to interest these things, but I also knew that sitting in a thick, metal sphere, we were just dead if we got caught in a blast. At close range I don’t even think a bathysphere would block enough out to save us. </p>\n\n<p>We were never going to be able to survey the whole trench, but we knew that the long-liners had encountered the creature somewhere north of New Caledonia anyway and I thought that was the best place to look. The trench bends towards Fiji as it passes the New Caledonia coast, so we steamed almost due east from Noumea and intercepted it at the curve. I wanted to spend a little time just listening, so we hung around quietly for a full day and night with the hydrophones out. </p>\n\n<p>That first sperm whale coda got me sweating. I was terrified, but it quickly became clear that it was actually a pod of whales. They were close, too, popping up from one of their hunts within maybe a kilometre of the ship and just relaxing for an hour or so, even giving us some nice big signatures on the sonar as they swam underneath us. It was good because we got a good range of sounds from them to compare to the lure, if we heard it. They’d also clearly been hunting, which was good because whilst I still don’t really know much about what the creatures we’re after feed on, I know that lure is tailored to sperm whales and I’m near enough to certain that whale carcass had been torn in half by one. So an area where the whales are feeding is likely to attract them. Either they feed on the whales, or they feed on the big squid that the whales are feeding on, or probably a bit of both. Our whales looked quite relaxed, though, so we decided we’d start a slow search pattern, moving north in the direction the long-liner would have drifted from. </p>\n\n<p>I was a bit leery about using the sonar, at first. I remembered how the one in the Southern Ocean reacted, and I can’t help but wonder if our sonar is part of what caused it to attack. Maybe if we’d just been sailing over the top everyone would still be alive. I don’t know. But we definitely needed to see what was happening down there as best we could, and I knew that if it moved through the trench below us we’d see it on the sounder. I also decided to tow the cameras. There was obviously a huge risk of losing them, just because of the sheer length of cable needed to reach a useful depth, but I couldn’t just stare at a glorified fish finder all day and night and I was excited about the trench. It’s not one that’s been heavily explored, so even with a poor field of view I thought we could potentially see some ground-breaking things if we towed the cameras. </p>\n\n<p>We did see some awesome stuff, too. Lots of cusk eels, but also squid and octopus and an absolute myriad of different jellies and shrimp. We even got a Fangtooth and a Viperfish, which was just brilliant. The amount of life down there was staggering. But we weren’t seeing any signs of what we were actually looking for, until we were pretty much halfway up the trench from where we started.</p>\n\n<p>Out of the blue we got something strange on the sounder. It didn’t look like a living thing, but something seemed to be blocking a shallower part of the trench. The cameras proved useless here; we couldn’t tow them accurately enough to get an idea what we were looking at. So down we went.</p>\n\n<p>Look, I’ve done a few deep dives in my time. Nowhere near as many as you, but a few. That dive was the longest dive of my life. The descent was an abysmal experience. I basically spent the entire time entirely resigned to death, wondering when I was going to see a gigantic eye open out the porthole and be blasted into oblivion by a wall of sound. I don’t even know if these things have eyes, but I couldn’t shake the image. Eventually, we reached the bottom and started looking around, although the decision to turn on the lights was another very tough one. </p>\n\n<p>It was pretty clear that what we’d seen on the sounder was a rock fall. The western wall of the trench, coming off the basin where it goes through a series of short drops, had partly collapsed. It clearly wasn’t an immediately recent fall, but it wasn’t very old either. We were swinging around, light playing over the wall to the side of the rubble, when it caught something that made both myself and the co-pilot gasp. Running for maybe 150m down the wall were six parallel lines gouged into the rock, maybe three feet apart. I don’t want to say what it looked like, but I think I have to, don’t I? It looked like something with a gargantuan claw had scrabbled down the wall. </p>\n\n<p>We poked around for a bit longer, but suddenly we were buffeted by a strong current coming from the north. Through the radio, somebody shouted at us to turn the lights off and get out of there, and my heart was immediately in my throat. We were looking for a giant, killer creature at the bottom of the sea in a tiny steel coffin…it was a fair bet that whatever the surface guys were seeing was not good for us. I immediately made a beeline for the surface, but you know how long it takes to come up from that sort of depth and we were in an older sub. It felt like a hundred years, even if the guys topside did calm down a bit once we broke away from the bottom. </p>\n\n<p>When we were back on board, I raced into the ops room to see what had happened. The cameras didn’t pick anything up; visibility is limited down there anyway and we were looking at the wall at the time. But the sonar showed a huge shape appearing almost out of nowhere a few hundred metres to the north and moving further up the trench. This one looked even bigger than the one off False Bay, and we’d been maybe three or four hundred metres away without ever knowing it. That shook me, badly. I spent the night mindlessly staring at the sounder output, completely unable to sleep, telling myself we’d call it all off and go home in the morning. </p>\n\n<p>Sometime during the night, I decided to check the hydrophones, and I heard it. Identical to the last one. A fucking coda, repeating exactly the same way at exactly the same rate. It was close, too. Not directly under us, but within a few kilometres. Honestly, at that stage, part of me wanted to go home more than ever. Just buy a house miles from the ocean and stay there forever, never even look at the water again. But the part of me that needs to know was stronger. I was closer than I’d been since the original incident, there was no way I could walk away now.</p>\n\n<p>We couldn’t dive the next day. The sub had taken a buffeting and, even though we never actually hit anything, I wanted to make sure it was all in working order. That damned lure just kept repeating incessantly, like it was toying with me. I was recording it, though, so that was at least useful data to lock away with all the other circumstantial evidence I’ve got hidden for the big reveal, whenever I get there. I couldn’t help but keep an eye on the sonar when I was in the ops room, but it didn’t seem like the creature was moving. It seems like that’s their MO; they’re happy to move around within the environment but their hunting strategy, or at least their hunting strategy for targeting sperm whales, is an ambush. Get them within striking distance and then blast them with the sonic taser. They must move up into shallower water to hunt them, though. No way sperm whales are diving 7km down, and it definitely seemed like this coda was coming from higher in the water column. The top of the trench walls were easily within range of a diving whale at this point, so I figured it must have been sitting on the drop, waiting. </p>\n\n<p>We ran the search pattern overnight, trying to find a more precise location. Interestingly, the sonar didn’t show anything unusual, so I had to literally play it by ear. After a certain point, the strength of the coda started to fade, so we figured we must have passed over the creature. Working back, we plotted a rough location and got ready for the dive. </p>\n\n<p>I didn’t want to go down there. I really, really didn’t want to go down there. But I’d spent years chasing ghosts and the chance for something concrete was only a few thousand metres away. I had to go down and see where it lead. </p>\n\n<p>We reached the bottom a lot faster, given that we weren’t dropping down to the trench floor. It was still deep enough that there was no light. I didn’t think it was a good idea to turn the lights on again, though, so I’d taken off one of the cameras and put in a red light version. Obviously, red light is invisible that far down, so hopefully we wouldn’t be seen. I probably should have done that originally, but hindsight is always 20/20. It meant that we were almost blind, apart from the screen which enhanced the low light, so I was kind of glad I hadn’t relied on it to navigate the rock fall anyway. </p>\n\n<p>When we bottomed out at the edge of the trench, I knew instantly we must have been close. The lure resounded all around us, loud enough to put our teeth on edge. This was very different to South Africa, not only because we were in the water with this thing, but because we’d been using our own sonar the whole time and it showed absolutely no reaction. I still wonder what that means about their behaviour. Did this one spend a lot of time in the area, where ships pass over all the time? Did we spook the other one, or was it more aggressive than this one? Was it younger, less experienced? I still know absolutely nothing about them. Don’t get me wrong, I was obscenely glad that this one wasn’t reacting the same way, but the scientist in me was tossing up theories at a million miles an hour. </p>\n\n<p>We had quite a lot of bottom time at that depth, which I suppose is one advantage of a salvage sub over a research one. Built for longer stints on the bottom. We crept around slowly, scanning for any sign of a giant monster, but there was nothing. Absolutely nothing but mud. We could still hear the lure, maddeningly loud even with protection, almost taunting us, but there was no sign anything was out of the ordinary. The faint red light illuminated an empty sea, the black abyss nibbling at the edges of our tiny little island of illumination. It was on that edge that I first saw it.\nI don’t know to this day if it was the creature, or some part of it. Or if it was something completely unrelated. But in the gloom, just barely visible on the very edge of the light, I saw movement. Something big, too. Small things move quickly, always looking out for trouble. Bigger things move slower, more confidently. Whatever I saw was just languidly passing by the sub. Like I said, I don’t know if it was even related to the creature, but I know beyond a doubt that what happened next was.</p>\n\n<p>The sub stopped dead. I don’t mean we lost power, or we got fouled on structure. There was nothing around us, just the flat wasteland of the basin and the drop off into the trench off to the right. This was a reasonably big sub, too, not one of those research subs that fit in the average lounge room. But we weren’t going anywhere. Then slowly, almost delicately, we began to move towards the edge of the trench. Whatever was happening, it was dragging us down into the abyss. </p>\n\n<p>Panic is an understatement. I figured if we went over the drop, we were dead. I don’t know why I felt that so strongly. Maybe it was just the panic, or maybe I knew that we were in the grip of something that could probably crush us like a sardine tin and could absolutely liquefy our brains with sound. I guessed it probably didn’t know what we were at the point, but that it wouldn’t be gentle for long. </p>\n\n<p>My co-pilot was a retired salvage diver with about six hours in a sub and the rest in training, so he was absolutely no help. I can’t blame the guy. I tried gently goosing the engines, trying to break the grip of whatever horrific appendage had control of the thing, but it was no use. All the equipment was pinned. As the edge of the chasm approached I played my last hand; I flicked on all the floodlights.</p>\n\n<p>Boy, did that get a response. There was a god-awful screech and suddenly we were tumbling violently through a cloud of silt, like whatever had hold of us had recoiled in fright. As we tumbled, through the silt, I saw the faintest glimpse of something dark and linear swinging by awfully close to the sub. It was easily big enough to rock us again, sending us careening off in yet another direction. At some stage I smacked my head, which dazed me, but I still had the sense to flick the emergency ascent switch. I couldn’t tell up from down and there was no way the silt was going to clear quickly enough, plus I had no idea how bad the damage to the sub was. I just prayed that the systems were all still working properly. Beyond that there was nothing I could do but wait. The thoughts of giant eyes and a shrieking death were with me the whole way up.</p>\n\n<p>Thankfully we made it to the surface, barely. We stopped maybe 5m below, actually, but the recovery equipment managed ok and we made it back on board with just some cuts and bruises. I’m pretty sure the co-pilot will never go anywhere near the water again, but we were theoretically fine. </p>\n\n<p>We had to head back to Noumea, though. The sub wasn’t in any state to dive again and there was no way we were going to be able to fix it at sea. I can’t say I was all that upset, on balance. I was a little annoyed that I’d finally got close to one of these things again and come away with nothing concrete, but I was fried and I just needed time to take stock. I flew to Fiji not long after we made landfall, and just sat in a dodgy resort and contemplated everything.</p>\n\n<p>I think that the creature sat on the wall of the trench. That’s why we never saw it, and why it was dragging us back there. That’s also why we never saw it on the sonar until it moved. It was clinging to the wall, using the depth of the trench to hide itself. I think that this one was larger than the one we encountered originally, too. The scale of it moving on the sonar struck me a lot more. I’ve been over the tapes and it’s hard to make out a lot, but the signature seems to be at least three times the size of the echo we got off some of those whales we saw early on. One or two of those were big bulls, 20m long and 50 tonnes or more. You ramp that up three times and you’re looking at something creeping around the bottom of the ocean that’s comparable to a blue whale, and properly predatory. </p>\n\n<p>After the first time, with only the sonar images to go off, I got the impression of a big, solid mass. This time I got the impression of something quite long and powerful. And fast, this thing shot off the sonar at unbelievable speed when I flicked those lights. Obviously the way it&#39;s oriented towards the sounder changes the signature, but I think the longer image is probably a better guess.</p>\n\n<p>I had to send you this before I came out, because I need you to be prepared for what we might face if we do run into another one of these things. It could be so much worse than what we went through in South Africa. I’m not sure if the one we came across in the trench was the same one that killed the long-liners, but if it is then it can generate an even deadlier sonic wave and might be twice the size. And if it wasn’t, then maybe there are even bigger examples out there.</p>\n\n<p>I’ve managed to get a flight out there in two days. I’ll text you the details. I’m going out to the canyon, Ellie, and I hope you’ll come with me but I needed to tell you all this so you could make the most informed decision. These things, whatever they are, are not to be taken lightly. </p>\n\n<hr/>\n\n<p>I re-read Callums’ story four or five times, horrified. To think that he was that close to one of these creatures gave me a lasting chill. To think that we might have only encountered a relatively small one…well, I didn’t really want to even think about it, honestly. \nI had to think long and hard about what I wanted to do.</p>\n\n<p>In the end, though, it wasn’t really a choice. These things were out there whether I went looking for them or not and sitting at home on dry land wasn’t going to change that. I made a few calls, half making up a story about picking up an interesting acoustic signature and this being the perfect time to test some of the gear on one of the ROVs, and putting together a few people who wouldn’t baulk at what I was planning.</p>\n\n<p>Callum would arrive in two days. We’d set sail in three. </p>\n</div>\n","author":"CreepyAus"}