{"rank":"5","title":"Small town, ghost town","id":"8kr8v4","url":"/r/nosleep/comments/8kr8v4/small_town_ghost_town/","time":"1526801702000","body":"<div class=\"md\"><p>My family grew up in a small town and I am visiting my grandparents and parents for the week.  It’s located up north and it is literally the last town on the road before the ocean.  </p>\n\n<p>As the years have gone by the town has become close to a ghost town, aside from some retired people here and there.. so I packed books, and electronics to keep me entertained during my stay in the house my Nonno built. </p>\n\n<p>There are 6 other houses beside that he built and there is a forest surrounding.</p>\n\n<p>I arrived 3 days ago and everything was good and everyone was happy, it was like old times.</p>\n\n<p>Tonight we had dinner and listened to classic music from the 60s (Sinatra, Elvis) to make my grandparents happy, all was good and the night was drawing to an end, we decided to get to bed for sleep so we can go to church tomorrow morning.  </p>\n\n<p>I went to the bedroom they prepared for me, rested my head on the pillow with a smile thinking of the good times at dinner while my eyes slowly shut.  </p>\n\n<p>As I lay in bed I could hear a faint whistle every now and then from outside so being curious I opened the blinds of the window to look outside and can barely see anything as it looked pitch black but I noticed it was windy barely making out the cedar trees swaying in the wind, so I looked at the time 11:11pm and made a wish then went back to bed and closed my eyes.</p>\n\n<p>All of a sudden I heard a scream that sounded like it was from inside my head, a bad dream I thought, I immediately woke up and my room was pitch black, so I start looking for my phone and look at the time, I had slept for 4hrs when I realized in my peripherals I could see outlines of hooded figures at the foot of my bed. I looked in disbelief thinking I’m seeing things so I put the phone down and see 4 hooded figures looking darker than the pitch black.  Immediately I panicked and shouted for my family with no response.  As I shouted once more they lifted their heads with their hoods and moved in closer speaking a weird language I didn’t recognize and they were speaking repetitive terms like a ritual ..so I threw my pillow and bedsheet at them which didn’t seem to affect them it only went through them like a ghost.  So I said f*** this I got off my bed ran through the door sprinting to my parents room, heart pounding.  I get to the door and bust it open only to see 4 more hooded figures with candles speaking the same repetitive language like a ritual.  I snapped a picture then I turned the lights on and they disappeared like they weren’t even there.. </p>\n\n<p>I noticed my parents were not in the bed and the bed was perfectly made like it was never used.  I didn’t have time to think about it as I was in panic mode.  I sprinted down the hallway to my grandparents room and opened the door and turned on the lights immediately only to see an empty perfectly made bed.. I check my phone at it is 4 in the morning, there is no where to go I am so confused and nervous, scared, everything.  I run through every room spamming the light switches turning every light on in the house, dripping sweat with adrenaline at this point.  </p>\n\n<p>I looked in every corner to find any evidence of where my family is or what they did..  after finding nothing and thinking of the bizarre figures I saw I decided to call my parents,  the phone didn’t even ring, the numbers didn’t exist..so realizing how bizarre the situation is I tried calling the cops and the phone rang, and rang, and rang.. it must of rang for 5 minutes before I heard static and some voice appear.. it was the same repetitive language I heard.. I dropped my phone on the ground and felt my heart skip a beat.. I started shouting for my family again very loud.</p>\n\n<p>I looked at the time and it was 430ish in the morning.. I couldn’t do nothing I thought, ‘something is wrong here’ I thought.i checked all the doors and locks and nothing was compromised.</p>\n\n<p>I decided to grab a flashlight and walk to the neighbours to ask if they may have seen or heard anything from my family to just leave with no warning..</p>\n\n<p>As I walked out there was absolutely no wind.. it was pitch black aside from where I shined the light.. I got to my neighbours house and rang the doorbell to wake them up.  I heard nothing and waiting again for what seemed like 5 minutes and decided to go to the next neighbour when I turned my back I heard the door click and slowly slide open, I got a nervous shiver down my spine and instinctively turned around quickly to see an empty dark doorway with these hooded figures walking toward me slowly, they were about 2’ taller than me and in 5’10.. I freaked out and shined the light on them only to see them fade away in the light.. trying to hold it together I almost puked.. I ran back to my grandparents house and noticed all the lights were off.. I looked back and saw the other 6 houses were no longer there, and the hooded figures appeared in the location where the houses were.</p>\n\n<p>With no other options, feeling helpless I ran to the car I had parked and locked myself in the car and kept the flashlight on.. shivering and shaking from nerves I closed my eyes and prayed and prayed until so fell asleep.  </p>\n\n<p>I woke up after what seemed like hours, and noticed I was in my grandparents house in the bedroom.. it was morning and the sun was shining through the blinds.  I opened them and could see the neighbours houses, I smiled feeling reassured and comfort.</p>\n\n<p>I thought to myself as I was getting out of bed recollecting my thoughts of what seemed like the worst bad dream in history.  </p>\n\n<p>I opened the bedroom door and walked to my grandparents room, opened the door and saw a perfectly made bed, I laughed feeling deja vu and proceeded to walk to my parents room.  I opened their door and saw a perfectly made bed like it wasn’t used at all.  Again I laughed thinking this is a joke, I turned around and went to the bathroom to get ready for the day, shower and brush my teeth etc.. </p>\n\n<p>I entered the bathroom and saw no toiletries, completely empty. Feeling that same bizarre feeling I called out for my family.. no response so I walked downstairs to the kitchen.  </p>\n\n<p>I got into the kitchen and opened the fridge.  Empty and then I knew something was weird, the phone rang, the ID said unknown.. I hesitated but ultimately picked up the phone. Only to hear a static sound so I hung up.  I started to think about everything happening when the phone rang again.. unknown ID yet again.  I thought this is a joke, a game... wtf, I’m not picking it up I said to myself.  </p>\n\n<p>I let it go to answer machines and heard the same static,  after the message it immediately rang again.. and I stared in disbelief at the phone.. letting it go to voicemail again when I got a random text msg saying “answer”</p>\n\n<p>I let it go to voicemail.  I heard static again only this time I could hear the same voices in my dream saying the same ritual sounding language,  it got louder and louder.  I freaked out and unplugged the phone landline..  I started panting, adrenaline kicked in..  what is happening!?  </p>\n\n<p>The phone rang while unplugged and I lost it, ran outside to the neighbours house and rang every doorbell like a mad man,  no one answered.  No one was home or perhaps no one lived there at all?</p>\n\n<p>I went to my car and turned it on drive to the main road and booked it to the closest town speeding the whole way.. luckily I had a full tank of gas.  </p>\n\n<p>I got to the nearest small town and headed to the police station.. when I got in there no one would listen to me, or look at me or even acknowledge me like I was invisible.  I couldnt understand.. very frustrated I went back to the car, the day was ending and daylight was fading.  </p>\n\n<p>I went to a local motel for the night and looked at the picture I took the night before and I noticed something weird.  The hooded figures were spirits, performing what seemed like a ritual. </p>\n\n<p>I decided to go back to the police station at night to get this straight and figured out.  I drove up and the police station was dark, every building in town was dark, it felt odd and I started to realize something was off.  I looked in the window of the station and saw the same hooded figures. I puked in fear and passed out in the car..I woke up the next morning in the parking lot.  I looked up at the station and saw it empty, the entire town looked empty.</p>\n\n<p>I walked in to the police station and saw a man staring at me looking very odd and I asked him “where is the everybody?” </p>\n\n<p>He looked up, grinned at me and said</p>\n\n<p>“Dead”</p>\n\n<p>I said what about you? Why are you here? </p>\n\n<p>He said the same thing</p>\n\n<p>“Dead”</p>\n\n<p>I asked “what about me?”</p>\n\n<p>He said the same thing</p>\n\n<p>I didn’t believe him I was just talking with my family the other day,  it doesn’t make sense but at the same time the clues did.. so I went back to the motel and even the wifi password was death.  I turned on the TV and turned on the news.  The breaking news was about the small towns.  Volcanic activity in the crust released a toxic gas killing the entire towns population.. my jaw dropped and the TV turned to black noise static.  A hooded figure appeared on the screen, speaking an unfamiliar language.</p>\n\n<p>Maybe the towns never existed and my family never existed? I looked at my photo I took in the house and saw the hooded figures in a blur.</p>\n\n<p>So I turned the phone around and took a selfie, when I looked at the photo I saw a blur of nothing.</p>\n\n<p>That’s when I knew.  </p>\n\n<p>We died in our sleep</p>\n</div>\n","author":"Killuminati523"}