{"rank":"33","title":"I think my school is trying to kill me","id":"8kra1c","url":"/r/nosleep/comments/8kra1c/i_think_my_school_is_trying_to_kill_me/","time":"1526802270000","body":"<div class=\"md\"><p>My middle/high school sits in the comfortably dark suburbs deep within the pacific northwest. Though I&#39;ve never seen a Bigfoot in the mountains or a sea serpent in the Sound, I&#39;ve had my fair share of weird experiences. However, the school I go to is another level of unsettling. I&#39;ve learned to go through my days in a blurry haze, ignoring all that&#39;s strange. Teachers come and go, seasons pass by, and one by one newcomers are silenced. It&#39;s as if the school itself is built on unspoken rules.</p>\n\n<p>When I started here, I had a crush on a math teacher who wore cross earrings and black lipstick and drew unicorns on the board to teach us about imaginary numbers. I joined the cheerleading squad just so I could be around her more, I was simply enamored, even as a little middle schooler.</p>\n\n<p>But like I said, there are rules here, rules everyone has to follow. I still see her around, six years later in my sophomore year. Her eyes are dull and her earrings are gone. She married a man who I met once. They had a baby in a little carriage and her husband smiled at me. His eyes were blurry and his features seemed to change each time I blinked. I hated him.\nSome days it&#39;s worse than others, some days the very air fizzes and I can&#39;t ignore the doors that go nowhere. Some days when I sit in the sun the air is still. Some days there&#39;s peace.</p>\n\n<p>I guess I should probably go back to the whole &quot;doors that go nowhere&quot; business. I actually only started noticing recently, but sometimes on campus there&#39;ll be a locked door that seemingly attaches to nowhere. From the outside some of these doors seem to be second doors to classrooms, but if you look from the inside of the room there&#39;s no door. Other times the doors just attach to the edge of the building, but they&#39;ll be places like the second floor with no emergency stairs below them or apparent exits when looking from outside.\nI&#39;m a theater kid, so when I have time after school during rehearsal I tend to wander campus. The doors watch me.</p>\n\n<p>I wandered up to the roof once. The wind pushed me to the edge, and as I stared down at the flowering campus grounds, it was as if the breeze itself urged me to jump. Death seemed merely a concept, a human inconsistency to be laughed at. I neither believed I could fly nor wanted to commit suicide, I just felt a sudden need to fall.</p>\n\n<p>I&#39;ve never gone up to the roof again.</p>\n\n<p>I looked it up, supposedly this is called high-place phenomenon, the paradoxical desire to jump from heights when presented with a beautiful fall, but I wouldn&#39;t be including this story if I thought it was simply a psychological anomaly.</p>\n\n<p>A few weeks later I was getting water from the fountains in the cafeteria next to the microwaves. Nobody was around, and the microwaves were off as far as I could tell, but just a second later one of the appliances started sparking. I barely jumped away before the microwave exploded, shards of glass shattering and scattering across the floor where I had been standing. I ran away before the staff got to the scene. No one knew I was ever there.</p>\n\n<p>Apparently there was a fork in the thing and it overheated, igniting and sparking, but I don&#39;t remember either microwave being on or even plugged in while I was there.</p>\n\n<p>Another time I was leaning on the balcony in one of the concrete stairwells, hiding from the commotion and staring out the window. The balcony creaked and groaned, and I got up when I realized there were a few screws sitting in a strange pattern, the spikes up to the sky next to my hand. The balcony pipes shifted as I hastily hand-screwed the pieces back together. I don&#39;t remember taking them out, or them being there when I sat down, but I must have done it absentmindedly, right?</p>\n\n<p>I&#39;ve tried to figure the place out. I talk to the janitors and the construction people, but they just keep their heads down and shuffle past, plastic smiles reaching their lips and nowhere else. Meanwhile I wonder if I&#39;m going crazy.</p>\n\n<p>Before my boyfriend broke up with me, I remember he asked me, &quot;do you think this place is weird?&quot;\n&quot;What do you mean?&quot; I asked.\n&quot;I don&#39;t know, it just sometimes feels like something&#39;s off. Even when it&#39;s sunny it&#39;s like the air is...frozen or something.&quot; He wouldn&#39;t look at me.\n&quot;It&#39;s almost like the place itself is breathing,&quot; I muttered.\nHe didn&#39;t talk to me for a week after that evening, and then just as suddenly, he said we couldn&#39;t be together anymore.</p>\n\n<p>Since then it&#39;s like the air&#39;s been getting tighter. Day by day it&#39;s building tension. Doors pop up and disappear faster. Maybe I&#39;ve broken too many of its rules.</p>\n\n<p>Something&#39;s going to happen soon.</p>\n\n<p>I can feel it.</p>\n\n<p>How do you fight something you don&#39;t even know is real?</p>\n</div>\n","author":"saturnjelly"}