{"rank":"10","title":"The Thing in my Wall (Part Two)","id":"8krg2x","url":"/r/nosleep/comments/8krg2x/the_thing_in_my_wall_part_two/","time":"1526805258000","body":"<div class=\"md\"><p><a href=\"https://www.reddit.com/r/nosleep/comments/8hjwil/the_thing_in_my_wall_part_one/\" rel=\"nofollow\">Part One</a></p>\n\n<p>It has been about two weeks now, so I thought I would do another update before anything else decided to happen. I would have posted about this sooner, but as you read this part and the next one, you will realize there was some... things I had to take care of. My life has become Hell.</p>\n\n<p>Starting from the night I uploaded the first part, I also uploaded a photo of the hole, showing where the fingers appeared. I decided it was best to sleep on the couch that night since I was terrified of my own room. I lied down on the couch and kept looking around, as I usually do when I&#39;m scared, terrified it would come into my living room to terrorize me some more. Eventually,  I gave up and shut my eyes as tightly as I could.</p>\n\n<p>My eyes shot open to violent shaking. My first instinct was an earthquake, so I checked my phone, the time only being 27 minutes after I fell asleep, but I hadn&#39;t gotten an alert as I have an app that tells me. I thought that maybe it just wasn&#39;t that reliable of an app for them. I dove for cover under my kitchen table and stayed there, but something was weird about it. Parts of my house were still, and others were still shaking. My kitchen was completely fine, just how I had left it before bed, but my living room was nearly destroyed. Decorations on my fireplace mantle had fallen off and shattered, My bookshelf was on its side, its contents were spilled out in front of it. I furrowed my eyebrows in confusion.</p>\n\n<p>I crawled out from under the table and realized I couldn&#39;t even feel the shaking in the kitchen. The more I realized, the more confused I got. I walked back into my living room, I could still stand as it wasn&#39;t that powerful anymore. I walked into my hallway, the shaking getting stronger with ever step I take. I started to stumble because the trembling had become too unbearable. I ended up having to crawl on my knees to my bedroom door, as that is where the strength of  the shaking had lead me. With a quivering hand, now with small glass shards in from the pictures that had fell in the hallway, I reached up for the doorknob. Once my fingers grazed the knob, my own personal earthquake stopped. I sighed of relief and stood up, my legs shaking, I had to get support from the wall. Once I composed myself, I opened the door, to my surprise, my room was just fine. The only thing that was off was on my mirror doors. Written in dark red was &quot;delete the photo.&quot; How did it know I posted the photo? My head was spinning. I couldn&#39;t concentrate on anything. I pulled out my phone from my pocket, hurried up and opened Reddit. Deleted it and changed the original post. I also deleted the picture from my camera roll. </p>\n\n<p>I sighed once again and walked towards the exit of my room. A few feet away from the doorway, I feel a cold breath on my neck that makes the hair on it stick straight up and causes me to shudder. My breath hitched and I stood still until the feeling went away. I ran to the exit, shutting the door behind me quickly. I let the doorknob leave my grasp as I slowly walk back down the hallway, dodging the picture frames and glass shards. I walk into the kitchen and grab a cup from the counter to get a glass of water, but immediately, it falls from my grasp as I wince, the glass shattering all over the floor. I should have taken my brother&#39;s advice on plastic cups- I&#39;ve always been the clumsy one. I didn&#39;t realize I had glass in my hand. I didn&#39;t even feel it. </p>\n\n<p>I inspect it and decided it would best to let a professional do it, so I called an Uber as I didn&#39;t want to drive with my hands like they are. I live in a relatively small city, about 10,000 people I would say. Mostly everyone I know of is nice so I don&#39;t get to tell those weird Uber stories that you see online. After maybe 15 minutes, I arrived at the hospital. After saying &quot;Thank you&quot; and exchanging some &quot;have a good day&quot;s, I walked inside. I checked in and all that good stuff. The wait was terrible as I wasn&#39;t an emergency. People in car accidents would have to wait sometimes. I probably should have gone to a better hospital, but this one was the closest and I didn&#39;t want to pay more than I already am.</p>\n\n<p>After a few hours, I finally got called. I stood up and followed the man to a room. He was tall and skinny. Had short brown hair that had short bangs that were slightly swept to the side. He had dark under eye circles and a five o&#39;clock shadow. Seems like they are probably understaffed. After asking a bunch of questions that I would not like to share on here, obviously, he takes me to a room and tells me to wait for someone to come to remove the glass from my hands. As he was leaving he let out a laugh. One eerily similar to the night before last. I, again, become disoriented, confused, and scared. I don&#39;t have a clue about what is going on. This is insane. How is this possible?</p>\n\n<p>I had just finished calming myself down when a nurse came in to tell me to take something so it doesn&#39;t hurt. I pulled out my phone after she left and watched some random TV show on Netflix while I wait. After around 45 minutes, someone else came in. After putting my phone away, I watched as he pulled out some intimidating looking tools. Once he was set up, he turned to walk away but then turned back.</p>\n\n<p>&quot;I figure you already have common sense not to touch the tools- as they are sterile. We had some problems with other people today and don&#39;t want it to happen again.&quot;</p>\n\n<p>I nodded and took my phone back out, this time going to Reddit to browse. Eight minutes pass and a doctor walks in, sits down next to the tools, and smiles at me.</p>\n\n<p>&quot;Hello, I&#39;m Dr. Finn. Just between us, I don&#39;t like my last name, so you can call me Valerie.&quot;</p>\n\n<p>I laugh, &quot;Shut up, Val. When did you transfer here?&quot;</p>\n\n<p>&quot;A few weeks ago. Real question is, how did this happen?&quot;</p>\n\n<p>&quot;Nothing interesting really. I dropped one of my cups. You can figure out what happened.&quot;</p>\n\n<p>Valerie proceeded to remove the glass as we talked. Soon, she was all done. She stitched the gashes that needed to be stitched and bandaged both my hands.</p>\n\n<p>&quot;I&#39;m about to get off if you want me to drive you home, we haven&#39;t spent time together since new year&#39;s eve.&quot;</p>\n\n<p>I smiled and nodded. I walked to the exit as I couldn&#39;t go with her, as it was off limits to non-workers. After some time, she walked back out. We went to her car and drove to my house, after stopping at hers, so she could get some stuff. Once we had pulled into the driveway, I realized that I had forgotten that my house was an absolute fucking disaster. I got nervous but didn&#39;t say anything. I wasn&#39;t sure what to do, so I just went to the front door and unlocked it. To my surprise, everything was neat, exactly the way it was before the &quot;earthquake.&quot; I didn&#39;t act like it bothered me since Valerie was here, but deep down it did. Did it even happen at all? Of course, it had to because my hands are cut. Who cleaned it up then? It seems like my life is just a thousand questions for the past two weeks.</p>\n\n<p>I think I&#39;m going to upload part three sometime in the next couple days as this one is already getting long. See you again, soon...</p>\n</div>\n","author":"oO_tristin_Oo"}