{"rank":"16","title":"La Llorona","id":"8kri1o","url":"/r/nosleep/comments/8kri1o/la_llorona/","time":"1526806282000","body":"<div class=\"md\"><p>It was night, festive day althought I cannot remember what the pueblo was celebrating, I was in my grandma&#39;s old house and as tradition lots of family members were there. 3 of my cousins were going to another house and me and my younger brother wanted to go but mom wouldn&#39;t let us so being 10 and 9 years old we started crying and being silly.</p>\n\n<p>The dinning room was almost outside 2 &quot;walls&quot; weren&#39;t there just a big open to the yard in one side and in the other side the exit to the garage then a street that went to a corn field, you have to know that there isn&#39;t a garage just an entry to the property and park cars and thats it, beyond the entry is the corn field and after that its just fields.</p>\n\n<p>My brother angry and crying goes to the garage entry outside the house with his back turned to the corn field and sits there in the dark, I&#39;m inside with my family also angry and crying, grandma is changing the diaper of a baby inside the house when suddenly we hear it, a single long crying moan as if it was reaching with a hand coming somewhere from the corn field not loud nor quiet just a single very long moan. (Damn got goosebumbs just remembering it)</p>\n\n<p>We all rise our eyes and start looking at each other in disbelief and my brother slowly walks in very pale, mom as mexican as can be starts &quot;andale, keep crying and la llorona is gonna take you, she doesn&#39;t like cryba...&quot; mom hasn&#39;t even finished when behind the wall where theres a big tree we hear a lugh so menacing of a baby, some sh*t you would only hear in the movies except is so weird it almost felt like I could hear it all around the place not just behind that wall.</p>\n\n<p>Now it gets real, we all look at each other truly scared, nobody moved for minutes and grandma finally comes as if nothing had happened, we tell her about it and says she didn&#39;t heard anything which is strange because of everyone, grandma has the most stories and experiences with the paranormal, she has lived now in the same house for over 40 years and she always has stories but out of all the stories she has told us, and even she told us that same day, she has never ever heard la llorona or a baby laugh.</p>\n\n<p>I have always asked my brother if he turned around and saw anything but he always says no, strangely, he gets weird when I ask him and almost angry and to this day almost 9 years no he has not tell me what he saw but I very well know he saw something. Grandma&#39;s house has always had something going on there I have many strange things that have happened to me before and after this and even mom and dad have some of the most horrific sh*t I&#39;ve heard, if you want I&#39;ll keep updating or posting more stories, sleep well.</p>\n</div>\n","author":"elchivillo8"}