{"rank":"6","title":"Horror Boat Trip","id":"8krkju","url":"/r/nosleep/comments/8krkju/horror_boat_trip/","time":"1526807493000","body":"<div class=\"md\"><p>Hello. I would like to start this off by saying that I am 28 years old, and this event took place six years ago. Six painful years ago. I am writing this because, because I fell like I need to lose this weight on my heart. Maybe writing this out will make me fell better. I hope it does.</p>\n\n<p>We were squeezed in the car tight. It was eight of us, and the car only had six seats. It wasn&#39;t comfortable, but yet, we were all excited for the upcoming boat trip. Here&#39;s a brief information about my friends.</p>\n\n<p>There was Jack, he was 22 and my best friend from school since the 3rd grade. </p>\n\n<p>Anna, Jacks girlfriend, she was 20 and with blonde hair. She was very pretty.</p>\n\n<p>Then there was Robert and Peter. Twins, both had black hair. They were both 23.</p>\n\n<p>Sarah and Emily. Two sisters, Sarah was only 18 and Emily was 21.</p>\n\n<p>There was also my girlfriend Ashley. She was 19 and the most wonderful person on earth.</p>\n\n<p>And finally, me. 22 year old hothead with dark brown hair.</p>\n\n<p>We arrived at our destination at 11am, after driving for 5 hours. Me and Jack went to meet the owner of the place, while the others packed our stuff, since the trip was planned to be about 6 hours long. The owner of the place was in his sixties, and his name was Samuel. I won&#39;t bother you with the conversations we had, but after about 40 minutes we were all set and ready to get into the boats.</p>\n\n<p>There were 4 boats in total.</p>\n\n<p>Boat 1-Jack and Anna.\nBoat 2-The twins.\nBoat 3-Sarah and Emily.\nBoat 4-Me and my girlfriend.</p>\n\n<p>I was the one who would ride the boat. Ashley would just take pictures.</p>\n\n<p>We pushed our boats into the water and started down the river. For the fist two hours nothing happened. The river was very calm and I could finally relax. We chatted a lot and I had a beer. We were on the water for almost 3 hours when the river split. We stopped our boats. That was weird. The man had never mentioned this happening. -We should all go left, I said, but, of course, nobody listened to me.- We argued for 10 minutes and this is the decision we came to.</p>\n\n<p>The twins would go right, and the rest of us, left. If The river ended or got too fast, the would climb out and carry the boat back. It was a rubber boat, so it wasn&#39;t anything heavy. Obviously, me being the hothead I am, I decided to be the first one to go right. Those two decisions were the worst ones I ever took. </p>\n\n<p>We said goodbye and split up. To this day, I do not know what happened to the twins. I don&#39;t want to know.</p>\n\n<p>The river was calm for the first half hour, but then it started to go faster, and rocks were appearing here and there. Then in front of me I saw a large, sharp rock. I screamed it to the others and tried to stop the boat, but when I submerged the paddle, it got stuck and broke off. We were much faster then I thought. I had a split second decision to make. I saw a large branch and grabbed it. The rock was only a few meters away. With all my strength I pushed against one side on the river and dodged the rock.</p>\n\n<p>Before I could take a breath the river made a sharp turn, and I saw something I will never forget.\nSarah turned her head, and there was a sharp branch head level to her right after the turn. Her sister didn&#39;t have enough time to turn the boat. I watched and the branch violently split Sarah&#39;s throat open, the blood spilling from the wound. She fell into the river. I heard a chilling scream that only someone in terrible pain and shock could make. There was a sharp rock in front of Emily&#39;s boat. I wanted to scream to her, but the words clogged in my throat. I saw her rubber boat get split in half, and she fell headfirst into the river rapids. </p>\n\n<p>Then, the river was calm. For some time. Ashley and Anna cried a lot. Me and Jack just focused on getting out of this river. We could have climbed out, but we had no idea where we were, so we decided to keep going. I only had one paddle, so it was hard to control the boat.</p>\n\n<p>Then we got pulled in the rapids again. This time the river was faster, but there were no rocks for some time. We rode through the river for an hour, just trying to stay stable. Then I saw that the river split again in front of us. I screamed it to Jack, and he saw it. But, there was only one of the split parts that went on. The other one, the one were Jack was heading, just ended in a huge rock.</p>\n\n<p>My brain didn&#39;t process this part. All I remember is that the river got too fast, and the last thing I saw as Anna jumping to our boat, and Jack crashing into the rock. There was nothing left from him except spilled guts and bones. I broke from my trans and looked in front of us. There was a motherfucking waterfall. It was too late to do anything, so I just closed my eyes.</p>\n\n<p>Two weeks later I awoke in the hospital. This is what they told me. I had broken both of my legs and my neck was damaged. Somehow I was still alive, but they were not sure if I could walk again. As about my friends, the twins were never found, and the sisters too. Jack&#39;s body, or what was left of it, was found two miles away from where he crashed. I asked about Anna and Ashley. They said that Anna had somehow only broken her arm. I knew what we would tell me. I didn&#39;t want to hear it. Ashley had broken her back and died instantly from the impact. We fell onto rocks when the waterfall ended.</p>\n\n<p>Moral of the story? Research the place you take a boat trip in, otherwise it could end like this.</p>\n</div>\n","author":"NightWalker991"}