{"rank":"0","title":"Attack_0f_the_Tum0r","id":"8krs5n","url":"/r/nosleep/comments/8krs5n/attack_0f_the_tum0r/","time":"1526811249000","body":"<div class=\"md\"><p>Hey I wrote this story in one night. I used it for my science project. Please tell me how I can improve, also keep in mind I wrote this late at night. </p>\n\n<p><strong>Part 1</strong> </p>\n\n<p>He was at the lowest point in his life. Only 4 weeks ago had Wolfgang been diagnosed with Stage IV cancer and it was only growing. The doctors had told Wolfgang that he had only 12 more short months to live. And Wolfgang wasn’t having it. Wolfgang was a man in his late 20s who made all his money by agreeing to be a guinea pig to large medical corporations for a quick buck.Wolfgang was able to make a living on testing drugs easy because there were loads of big Pharma companies in New York City. He had a widow’s peak, wild unkempt jet-black hair, scratchy unhealthy white skin that was purple in some areas, a face that has been through ages despite being so young, one brown eye and the other changed to green as a side effect of another drug, and a beard that was only allowed to grow because his appearance was never cared for. The reason he got cancer in the first place was that he agreed to try out a new drug called Xanameth. It looked like a red spherical pill. This drug promised to give you better sleep but it denatured a protein called p53 and that is the protein that protects against cancer. It also gave him a jitter which makes him shake and stutter whenever he talks. And with the worries of cancer Wolfgang can barely sleep at all. However, he got a letter from the Research Lab Of Declined Immunology which asked him if he wanted to join a program that was developing a cure for cancer. In this program, he would be the lab rat like always. Despite his previous negative experiences with being an experiment, he agreed anyways. </p>\n\n<p><strong>Part 2</strong> </p>\n\n<p>Wolfgang traveled to the Research Lab Of Declined Immunology and he met a fellow named Dexter Pills. There were other employees there but none would talk. They didn’t do anything matter of fact. They just watched, almost like there were robots observing Wolfgang- trying to see what he would do. Dexter Pills was an eccentric man in his late 60s. He was like a mad scientist except he was lacking a pair of goggles, white hair, and a lab coat. He wore formal attire except for his fanny pack which had “I heart New York” written on it. And had combed back blonde hair, wrinkled black skin, and one blind eye with a blue eye to match. He also had a tick that would change his volume of voice randomly. </p>\n\n<p>“So we are going to inject you with a p53 booster that was developed right here, in this lab” Dexter Pills barely uttered quietly.  </p>\n\n<p>“What di-da-did you say.” Wolfgang managed to force out. </p>\n\n<p>“Sorry, I have a speech impediment that I can’t shake” Dexter Pills spoke in a normal tone. </p>\n\n<p>“Oh. What do I have to do to beat ca-can-ca-ca-cancer.” Wolfgang stuttered. </p>\n\n<p>“DON’T WORRY, WE HAVE AN INJECTION HERE FOR YOU” Dexter Pills shouted. </p>\n\n<p>Then, Dexter Pills hit his chest in annoyance and moaned out “AHHH, this happens every single time!” </p>\n\n<p>“I hope it’s an above belt injection,” Wolfgang thought hopefully. </p>\n\n<p>“How does it work” inquired Wolfgang. </p>\n\n<p>“S,o your p53 has been denatured, so we are going to inject you with more p53 and the rest of it will try to renature your old p53.” Dexter Pills explained with a passion in his eyes. </p>\n\n<p>“How are you going t-t-ta-tah-to renature my p53.” Wolfgang wanted to know, mostly because he has made the mistake of not asking what they are injecting him with. </p>\n\n<p>“The p53 we are injecting you with will surround the old p53 and heat it up. Hopefully renaturing your other p53. That’s why it is a p53 booster and not a cure to cancer” Dexter Pills spoke quietly but was just loud enough for Wolfgang to hear him. </p>\n\n<p>“O-o-okay.” remarked Wolfgang. </p>\n\n<p>Then Dexter Pills scribbled on his clipboard in the classic bad doctor’s handwriting. Dexter Pills grabbed his fanny pack with joy, took a syringe out of it. The syringe had white label stickers around the shaft. It was like they didn’t want anyone to see it. Wolfgang unzipped his fly and undid his belt. Dexter Pills shook his head no and Wolfgang put it back on and zipped it his pants up. He wasn’t even aware he was doing it, he was just going through the motions like he had so many times before. Dexter took Wolfgang’s arm and injected him with the syringe.</p>\n\n<p>“JUST COME BACK within a week to receive a second injection” Dexter Pills exclaimed loudly but spoke softly in the middle of speaking. </p>\n\n<p>“Will do” Wolfgang spoke with a twitch.  </p>\n\n<p><strong>Part 3</strong></p>\n\n<p>Wolfgang walked home twitching and spazzing while he went. When he had arrived he was so exhausted and relieved at the same time. He not gotten good sleep ever since he was diagnosed but something about getting injected with that p53 booster had him relieved enough to rest well.  Wolfgang woke up 2 days later and just brushed off the fact that he slept for 2 entire days. He had a strange feeling when he had awoken. He had lost his sense of touch. Wolfgang didn’t know if this was an effect of the booster, mourning drowsiness, or if it was an effect all the drugs he had taken over. He had also felt extremely ill. More than he usually was. He was so sick he had vomited. He puked his breakfast, lunch, dinner, and his practically his guts. There was a decent amount of blood in the throw-up so he was worried. He went to his bathroom and was horrified when he gazed in the mirror. He saw his naked body, covered in little balls of flesh. It was tumors, all over his body. He was encrusted with tumors from head to toe. He had called Dexter Pills immediately. </p>\n\n<p>“Dex-da-da-dexter I think I might be experiencing some side effects” Wolfgang shook so violently that he nearly threw his phone. </p>\n\n<p>“What might they be” Dexter Pills wondered. </p>\n\n<p>“I have small tumors all over my body, I can’t feel, I upchucked with blood, and I feel pretty weird” Wolfgang spoke with a spaz and concern. </p>\n\n<p>“That might not be good” Dexter Pills hushed almost silently. </p>\n\n<p>“Wh-wa-when can I see you” Wolfgang interrogated. </p>\n\n<p>“COME EARLIER TODAY” Dexter Pills exclaimed. </p>\n\n<p>Wolfgang rushed forward onto the Research Lab Of Declined Immunology. He let nothing get in his way, even his condition. When he arrived at the Research Lab Of Declined Immunology the same scientist stared at him. They doodled on their clipboards but Wolfgang wasn’t paying attention. Wolfgang came to Dexter Pills office. There, Dexter took out another syringe out of his beloved fanny pack. </p>\n\n<p>“Oh n-n-na-no! You are n-n-na-not putting that back into me” Wolfgang spoke furiously. </p>\n\n<p>“Don’t WORRY it’s EMPTY” Dexter half-exclaimed. </p>\n\n<p>Wolfgang could see that this needle was see-through. He put his arm out and Dexter took a blood sample from him. </p>\n\n<p>“IT WILL BE READY IN 3 DAYS” Dexter annoyingly declared. </p>\n\n<p>“I’m going to have to wait 3 days!” Wolfgang cried while convulsing. </p>\n\n<p>“I’m sorry but that’s how long it takes to calculate the results” Dexter coped to say normally. </p>\n\n<p>“I hope that won’t be too late” Dexter imagined. </p>\n\n<p>Dexter struggled home in defeat. </p>\n\n<p><strong>Part 4</strong> </p>\n\n<p>Wolfgang survived the 3 days and took a taxi to the Research Lab Of Declined Immunology to look at his results. His condition had gotten worse, they weren’t little tumors anymore. They were more like 5 lbs weights all over Wolfgang. He couldn’t even walk to the Research Lab Of Declined Immunology even if he tried. He hobbled into Dexter’s office and collapsed. Dexter obliged Wolfgang with his blood test results. He saw that his suffering would only get worse from here. </p>\n\n<p>“The reason this has been affecting you so bad is because the solution in the booster that was suppose to renature your p53. It actually renatured them but reversed the gene. So, it made the p53 function to cause tumors at an accelerated rate instead of removing them.</p>\n\n<p>“Dexter Pills, can you just kill me” Wolfgang exposed. </p>\n\n<p>“I don’t know if I would be able to do that. I’ve never killed someone before” Dexter nervously blurted out. </p>\n\n<p>“Either I’m going to die a less painful death or you will kill me by letting me continue this less than existence. Either way, you will be the cause of my death because you administered the booster to me” Wolfgang said in which you could hear the pain in his voice. </p>\n\n<p>About the only positive result of the drug was that it made the jitter go away. Wolfgang could actually feel pain from the tumors. This was strange because his feeling of pain went away long ago from the many of drugs he had participated in. He knew in his heart now that he didn’t just test drugs for money. He did it out of pure enjoyment. He enjoyed the feeling of being high and finding out the side effects. He realized he couldn’t be a drug dealer because he couldn’t justify giving people drugs. He knew it would impact their lives very negatively and he had very strong morals. But when it came to testing drugs, he could indulge in what felt like a perverted pleasure. He could justify this career because he was saving lives from medication that could murder. They always say to do what you love. But he hated the feeling after he came down and he solved this with more drugs. </p>\n\n<p>Dexter Pills secretly knew the booster would have some negative effects. That’s why he covered the syringe with white label stickers. He knew morally he should kill Wolfgang but he knew he would get fired from the Research Lab Of Declined Immunology. Afterall, the purpose of the testing was not to make a treatment for cancer. The purpose was to stop the aging process by speeding the cell cycle just fast enough. Which was highly illegal. The booster made the cell cycle too fast and that’s why Wolfgang was suffering the way he was. However, Dexter Pills wasn’t a monster. That’s why he agreed to be apart of the project. He thought that his experiments would benefit the masses but they just brought suffering to people. He knew he would have to kill himself along with Wolfgang. </p>\n\n<p>“OK, I’LL DO IT” Dexter really yelled and wasn’t part of his speech impediment. </p>\n\n<p>“THANK YOU DEXTER PILLS” Wolfgang was filled to the brim with gratitude to finally die.</p>\n\n<p><strong>Part 5</strong> </p>\n\n<p>Dexter Pills shot Wolfgang in the face with a 9mm pistol that had a suppressor he kept under his desk. The Research Lab Of Declined Immunology didn’t know he had a gun. And the reason Dexter kept it was because Wolfgang wasn’t the only experiment that Dexter had performed. Every single Experiment Dexter Pills performed ended tragically. Dexter Pills was a failure in almost every aspect, from his speech to his career. But he still wasn’t a monster and felt pain for every single experiment. That was the reason the Research Lab Of Declined Immunology even took him as a researcher. They took him because he would have to do everything they said for he had nowhere else to go. And right as Dexter Pills was ready to pull the trigger on himself he heard a groan from Wolfgang. Dexter unloaded the entire magazine on Wolfgang straight in the face. He still didn’t die. Dexter took out another spare clip and used it all on Wolfgang. What should have killed him in 1 shot wasn’t enough. And it just made his condition worse His tumors grew rapidly. The injury had his inner cell cycle increase to repair him as an organism taking his tumors from being about 5 lbs to over 50 lbs. </p>\n\n<p>“I’m so sorry” Wolfgang tearfully whispered. </p>\n\n<p>Wolfgang had lost the ability to speak from tumors in his lips. He could only moan in pain. Dexter Pills locked Wolfgang in a separate room for experiments. And tried to develop a serum to kill Wolfgang. Dexter Pills didn’t tell the Research Lab Of Declined Immunology because if they knew he was trying to kill their experiment they would do more than just fire him. They would hunt him down, string him up and leave him as a warning towards anyone who dared mess with the Research Lab Of Declined Immunology And about 1 hour later that is when the unthinkable happened.  </p>\n\n<p><strong>Part 6</strong> </p>\n\n<p>The automatic gunshots could be heard for miles away. The Research Lab Of Declined Immunology was going to face the consequences of their actions. The government had found out about how illegal and immoral the experiments of Research Lab Of Declined Immunology were and had brought in the military. The military was firing off rounds left and right. Researchers were being filled with lead and their building was painted red. There were a few security personnel who were firing back. But they were outnumbered, outgunned, outskilled, and out of options. Some had killed themselves, some were trying to escape, and some were still fighting. But eventually, every single researcher had died. The scientists who were studying Dexter Pills and Wolfgang were dead. The robotic reign of these cold, greedy, and malice of the Research Lab Of Declined Immunology was over and everyone was dead. </p>\n\n<p>Except for 1, Dexter Pills was still locked in his office with no hope of escape. Dexter was overcome with terror. He had wanted to kill himself but that was before Wolfgang was unkillable, incurable, and in pain. He knew he wouldn’t have the chance to kill him or cure him. But he could at least contain him. With military firing guns at everything that moved and Wolfgang’s regenerative ability there was no other option. He would have to take a soldier hostage or die trying. And only an empty pistol it would likely be the ladder. He took his empty hand cannon and escaped his office without making a sound. He had 2 advantages. And that was that he knew the layout of the building and he knew how to do maneuver through the building without anyone finding out he was even there. He climbed in the air shaft in the room right next to his office. He would then try to find a lone soldier, knock him out from above, and hold him hostage in a secure place. And he would have to do it soon. As he was climbing through the air shaft, he found his victim. He had no plan on how to take him out or what he was going to do after the ransom. He had no idea if they would even give him what he wanted. And that was to leave Wolfgang contained and alone. He jumped down and pistol-whipped the army man. The soldier was on the floor and knocked out. Dexter picked the man up and put his gun to his head. He dragged his body all through the hallways of the once occupied building. Then, the soldier woke up. </p>\n\n<p>“Move and you die,” Dexter said with a strang, calm. </p>\n\n<p>The soldier nodded his head and then ran through the hallways together. Dexter always behind the man. And they came upon a squad roaming for survivors. Dexter hugged the man from behind and put a gun to his face. </p>\n\n<p>“Alright, do everything I say and he doesn’t die,” Dexter said almost naturally. </p>\n\n<p>The soldiers didn’t hesitate. They shot right through the soldier that was held hostage to shoot Dexter. Dexter dropped to the ground and let go of his gun. The soldier collapsed and died. </p>\n\n<p>“Please, there is a man in 1 of these rooms who has a condition. Whatever, you do don’t shoot him. It could kill us all, he can’t be stopped” Dexter spoke out with his last words. </p>\n\n<p>The leader came up to him. He extended his gun and shot him. Dexter was dead.</p>\n\n<p><strong>Part 7</strong></p>\n\n<p>The men then checked Dexter’s weapon only to see that it was empty. They also checked his body and found an ID, a key to Wolfgang’s tomb, notes about Wolfgang, and his prized fanny pack.</p>\n\n<p>“What a shame,” told one of the soldiers.</p>\n\n<p>“It was his own fault for not defending himself,” said another. </p>\n\n<p>“All the data from this place and files about this place destroyed” inquired a soldier with multiple face tattoos. </p>\n\n<p>“All but the man with the condition our good friend Dexter told us about” answered The Captain.</p>\n\n<p>The captain was a man in his late 40s. He had scars across his face from being shot by a shotgun fired at a long distance. He was the main reason this whole operation was taken into place. He heard about the Research Lab Of Declined Immunology from a connection at the press and knew it had to be shut down. He also understood the only way it would is by force. </p>\n\n<p>“There is only 1 room we haven’t cleared. The reason we haven’t cleared it is because the entrance is too strong for us to break down. We tried bullets, grenades, everything” explained the only engineer on the squad. </p>\n\n<p>“That must be where the man with the condition is. And now we got the key. I can’t wait to tell him about our great companion Dexter” blood lustfully replied The Captain. </p>\n\n<p>The squad went to the last room in the building. Wolfgang was inside. The Captain opened the entrance with the key he took from Dexter. Inside, they found Wolfgang. He was even worse than before. If they had not opened the door, Wolfgang would just expand till he broke the room open. </p>\n\n<p>“Jesus Christ, it’s hideous” revolted the soldier with the face tattoos. </p>\n\n<p>“Men, it’s time to fire” exclaimed The Captain gleefully. </p>\n\n<p>The squad fired all their clips off of their M16s into what had became of Wolfgang. Their bullets couldn’t get through the blobs of excess flesh that was his tumors. </p>\n\n<p>“What in the name of God is that! Our bullets didn’t do anything to it” uttered The Captain in terror. </p>\n\n<p>“Fire more rounds” The Captain snapped back to reality. </p>\n\n<p>They had no more ammo. Not even in was supposed sidearms. But they did have 1 last grenade. The Captain took it and threw it at where Wolfgang’s neck should be. Wolfgang’s head exploded over on the wall, but the brain was intact. What anyway of his head was caved in and tumors grew back where the rest of his head should be. He that even faster and of. </p>\n\n<p><strong>Part 8</strong> </p>\n\n<p>Out of anger, Wolfgang rolled over crushing The Captain and killing him. Wolfgang then outgrew the building and killed the rest of the squad. Wolfgang rolled into the rest of New York City. He couldn’t process pain and he could hardly think for himself due to the grenade that The Captain had thrown. He grew out of control and squashed citizens and even small buildings. Nothing was safe, Wolfgang wrecked houses, destroyed cars that ran under him, and killed citizens under his weight. The Wolfgang creature that emerged couldn’t be considered human anymore. Despite the immense danger, Wolfgang wasn’t that fast. He was so slow the other half of New York City thought he was no danger to them. The rest of the military that didn’t die at the Research Lab Of Declined Immunology evacuated the half of the city Wolfgang was in. Although Wolfgang wasn’t fast, he was growing larger and larger. The wear and tear from everything under him made him grow faster. The ground from underneath him caved in. They thought it was safe because he was trapped. He rolled over the trampled ground and moved onto more secure ground. He was now the size of small skyscrapers. </p>\n\n<p>The military put in helicopter units to combat Wolfgang. They wouldn’t send in ground units because it was too dangerous for them. The helicopters flew close to Wolfgang but not in rolling distance. They fired missiles and bullets at Wolfgang but it made him grew faster. Wolfgang was now growing at 500 times his rate when Dexter put him in the experimental room. They figured out from survivors of the Research Lab Of Declined Immunology that shooting him would only increase his size. </p>\n\n<p>Also, from them, they recovered Dexter’s notes and data. From these notes, they were able to create a formula to combat the threat that was Wolfgang. To get this weapon done fastest they used top-secret medical machinery to develop it within 3 hours of the find. They filled over 5 missiles full of the formula so that it could penetrate. They fired the first one and it missed. It exploded in a Dominoes’. They fired the second one and it hit Wolfgang. Despite it hitting Wolfgang the tumors grew back so fast the formula couldn’t get into his blood. They fired the third one and it had the same effect as the second one. They were cautious when firing the fourth missile. They fired it at his head that way it would get into his bloodstream. But they missed. </p>\n\n<p>They were down to their last missile. Unexpectedly, Wolfgang stopped. He bowed his head in a way so they could kill him. And he began to speak </p>\n\n<p>“Uhh. Pl-please kills me” Wolfgang moaned. </p>\n\n<p>With a clear shot to his head, they fired the fifth and last missile filled with formula. The missile zipped through the air and hit Wolfgang in the head. The weapon got into his bloodstream. He exploded into literally a trillion pieces. New York City and the world will never forget The Day the Tumor Leveled the City.</p>\n</div>\n","author":"InSomnia_Mathias"}