{"rank":"2","title":"Reality Or Oblivion?","id":"8ks63j","url":"/r/nosleep/comments/8ks63j/reality_or_oblivion/","time":"1526817443000","body":"<div class=\"md\"><p>I don&#39;t even know why I&#39;m writing this, maybe its to clear something off my chest, maybe its to gain attention, I don&#39;t even know anymore, all I know is that I live in a constant state of fear and misery, and that I don&#39;t want to live in this world anymore. And no, this isn&#39;t some fake story to lure people into believing into some &quot;Boogeyman&quot; or some other made up bullshit, this is a statement about how people are so are so oblivious about the fact of how we are living in a true nightmare, where we are watched every single second, where we have no control over our own lives, where we&#39;re literally controlled by society to look and act a certain way or else we are considered &quot;outlandish&quot; or &quot;weird&quot; and then are cast out by society.</p>\n\n<p>This is what our current reality is, a technologically driven nightmare that has devices control us and our outlook of life, making us believe that we have control over our own lives and our own freedom, where in reality society is all controlled by an expectation of how we all should look and act and feel in accordance to what is considered to be the &quot;acceptable image&quot; of someone due to social media and ideally driven expectations.</p>\n\n<p>Now a lot of you reading this are probably rolling your eyes as you read these past statements, but trust me, this is what i mean when i say that you are oblivious to what is truly going on, we all have become enslaved to technology, allowing it to control our expectations, making us change our true selves to uphold an &quot;ideal image&quot; forced upon us, making us judge each other by what clothes we are wearing, what cars we drive, and who&#39;s party we attended. We have literally become enslaved by our phones and computers, making us trend following zombies, causing us drift away from true reality day by day. And no I&#39;m not crazy and I&#39;m not wearing a tinfoil hat, I just have finally opened my mind and my eyes to the true nightmarish reality we all live in.</p>\n\n<p>I can give you multiple examples where the media has literally ruined lives, reputations and even countries, the media literally controls all of our opinions and it makes us believe that we are in control of our own lives. And I know so far this doesn&#39;t seem scary to you fellow reader, but let me ask you this, when was the last time you were able to last a whole day without your phone without being asked and judged about why you don&#39;t have a phone? When was the last time yo didn&#39;t feel the need to post a picture? When was the last time you actually felt secure about yourself without needing to check your messages or your news feed?</p>\n\n<p>As you think about these, try to be honest with yourself, because you&#39;d be lying to yourself if you believe that none of those above statements never happened to you or have just happened once, because those questions are insecurities faced daily for every person who owns a phone or computer, showing us how literally technology holds us by the balls. Now your probably starting to think about what I&#39;m saying and its starting to make sense more and more to you as you start facing the truth of our reality, realizing that technology has created for us a fabricated lie that holds control over us and our lives.</p>\n\n<p>Now I know that you expected this to be a Creepypasta that would make you scared about some made up creature or make you mind fucked about some twisted tale, instead your just getting the terrifying realization about the true horror of reality, about how we are all controlled by our devices, enslaved by our idealism, and how we all are just oblivious to this as true horrors of war and damage that is happening in our world and we don&#39;t even flinch because we are distracted about the new iPhone. So let me leave you all with one final question, do you really feel in touch with reality anymore?</p>\n</div>\n","author":"monster134"}