{"rank":"30","title":"Satan's Lullaby Pt. 1","id":"8ksnif","url":"/r/nosleep/comments/8ksnif/satans_lullaby_pt_1/","time":"1526823524000","body":"<div class=\"md\"><p>As a new father, the thought of our first daughter coming into the world was one of the most exciting things in the world. Leading up to her birth, we pretty much bought everything she could ever want and more, toys, a whole assortment of clothes, fancy crib, anything that we could find so she could have more than my wife and I ever did growing up. The only piece of furniture we couldn&#39;t find new, because my wife wanted it specifically, was this pink and white bassinet she saw on Amazon. I tried getting her to pick another one that was actually in stock but she wouldn&#39;t budge from it. It HAD to be that one. This wasnt an argument I would win, let alone even want to start, so I decided on my day off to go search some secondhand stores to see if I could find anything remotely close to what she wanted.</p>\n\n<p>After searching three different stores and nearly exhausting my gas tank, I pulled into a station to fill up and contemplate my next move. As I was standing there waiting for the tank to fill, I noticed a store that hadn&#39;t popped up on my GPS search. It was called &quot;Madeline&#39;s,&quot; and featured a bunch of almost new looking baby furniture in their windows. I figured I might as well try there, what could it possibly hurt? I finished topping up my car and quickly drove across the street to see what I could find.</p>\n\n<p>My first thought upon entering the store was that of awe. Rows and rows of assorted baby clothes ran throughout the store all sorted by age and color. Each wall was littered with assorted baby toys, books, and random supplies. What caught my eye though was the used furniture section directly to my right. I made my way through the section, sleuthing over ever piece to find something, anything that was remotely close to the real deal. One piece caught my eye though. I rubbed my eyes a little out of disbelief and did a fast walk towards it only to be proven true. There it was, the exact bassinet that my wife picked off Amazon, with a little sign saying &quot;50% Off! Slightly Used but Lovingly Cared For!&quot; I couldn&#39;t believe it, here it was, what were the odds? My amazement though was interrupted by a quick hand slapping down around one side of the bassinet, making a metallic ringing sound, followed by, </p>\n\n<p>&quot;Well howdy there! I see you&#39;re interested in this bassinet! It&#39;s a lovely little piece it&#39;nit! We just got it in yesterday and guaranteed to work like new!&quot; She chimed excitedly.</p>\n\n<p>I dont think I barely managed to get a word in as she started going over this big rant about how nice it is. It allowed me to notice though, how strangely odd this woman was and even behind her friendly demeanor that there was something off. Eventually I snapped to and told her I&#39;d take it, mainly just so she would calm down and breathe for a second. I pushed the bassinet over to the register, pulled out my card and payed half the price of what we would&#39;ve payed and headed out the door on my way home. Before I could get in the car, I noticed the woman staring at me from inside with the most fake smile I&#39;d ever seen. Yet somehow, she looked almost sad at the same time. Weird.</p>\n\n<p>Upon arriving home, I surprised my wife with the bassinet and I swear I&#39;ve never seen her this excited in months. So much so that she immediately embraced me and lead me to the bedroom. Hours passed and I realized that I hadn&#39;t eaten all day. I pulled myself from bed to go raid the pantry real quick, walking by and admiring the new bassinet in all its&#39; glory. A few feet from it though, I heard a slight rustle of cloth. I turned towards the bassinet and didnt see anything in the dark but saw that the dressing of the bassinet was wavering a bit. I must really be hungrier than I thought. So I shook off my weird feeling and got myself a snack of banana with peanut butter on it. I was curious about our new piece of furniture though. I walked over to it and decided to see what the three buttons did. I pushed the first one, the one with two waves on it. The bassinet starting making a weird buzzing noise. When I touched it, i noticed the buzzing was caused by the whole thing vibrating. I had heard that a lot of these have vibration settings because it&#39;s supposed to soothe babies so I thought that was pretty cool. I turned it off and pressed the second button, the one with a lightbulb on it. Light softly illuminated from the plastic piece to fill the empty bedding with a yellow glow. Neat. I turned that off and went to push the last button, the one with a music note on it. It made a resounding &quot;click&quot; but didnt do anything. Damn, this is what I get for shopping secondhand. </p>\n\n<p>&quot;HONEY!&quot; I heard my wife scream from the bedroom as I fell back startled.</p>\n\n<p>I quickly scrambled myself up and burst through the bedroom door to find her clenching her teeth and breathing heavily.</p>\n\n<p>&quot;Honey, it&#39;s time. To go. Shes coming. Right now!&quot; She managed to barely get out between breaths. </p>\n\n<p>I quickly threw on some clothes, gathered our hospital bags and helped her out of bed. We made our way to the door and I was stopped by the most grotesque music I had ever heard as it lurched through our living room. I didnt know what it was or where it was coming from until I remembered that I had pushed the music button on the bassinet a few minutes ago. I looked towards it and sure enough the sound was clearly coming from it. Not only that but in the midst of the darkness, I swear I saw a set of glowing teeth smile back at me from underneath the bassinet skirt accompanied by two white eyes. I I shook my head quickly from disbelief and turned to ask my wife if she had saw that but was interrupted by, </p>\n\n<p>&quot;WHY ARE YOU JUST STANDING THERE!? SHE IS COMING, RIGHT NOW!&quot; My wife roared through clenched teeth. </p>\n\n<p>I didnt argue. I helped her through the door with all of our stuff and saw the bassinet through the closing door. The music had stopped and there was no sign of the shadowy face from before, but I knew what I saw. I wasn&#39;t crazy. </p>\n</div>\n","author":"SavageGarp"}