{"rank":"60","title":"I was on a secret research team to create biological weapons for the government. Pt. 2 - the safe zone","id":"8ksoah","url":"/r/nosleep/comments/8ksoah/i_was_on_a_secret_research_team_to_create/","time":"1526823778000","body":"<div class=\"md\"><p><a href=\"https://www.reddit.com/r/nosleep/comments/8kcl2x/paroxysmal_zombie_syndrome/?st=JHEVJ1M4&amp;sh=25b05f1b\">part one</a> </p>\n\n<p>For hours I sat in my room listening as the nurses and doctors became more and more frantic and frightened of the situation. By midnight that night, there was no normal hospital activities taking place from what I could see.</p>\n\n<p>It was early in the morning. I was going in and out of consciousness due to dehydration when I heard the first set of gunshots rip through the air. In the hours before dawn I listened to the sound of gunshots and screams from both civilians and infected alike. Once whoever was doing the shooting got to my floor I was able to determine that most of the shooters were not military, not police, nor civilians. The unit of soldiers who had been rescuing uninfected were more or less mercenaries hired by a private company with no government affiliation. </p>\n\n<p>I yelled and banged on the glass, and eventually once the floor was clear, I was allowed out of my room turned jail cell. The hallway was a mess. The dim red emergency lights revealed Blood smeared the walls, corpses littered all over the floor along with various documents and medical items.</p>\n\n<p>“I need water, please” I begged in a raspy near in audible voice. Right as I finished my sentence one of the mercenaries turned to face me. He was opening his mouth to speak to me when from out of the darkness a dark figure pounced on him. He screamed as the infected slammed its face into his over and over. Once the mercenary was no longer able to struggle, the infected began to discharge large amounts of blood all over the mercenaries face. </p>\n\n<p>Crack. The infected hit the ground with a wet flop. I looked in the direction of who had just shot and saw another mercenary with a look of urgency in his eyes.</p>\n\n<p>“He’s been infected! Shoot him before he tries to attack us next!” I did my best to scream at the man. The mercenary aimed his rifle at his now infected colleague. The infected mercenary began to twitch and convulse all over the floor. His mouth opened and copious amounts of blood sprayed out onto the floor and nearby objects.</p>\n\n<p>“What the hell are you waiting for!? Kill him!” I barely had time to finish my sentence before an explosion came from the soldiers rifle and his colleagues head exploded in a could of red. His body did not stop twitching the rest of the time I could see him.</p>\n\n<p>I was escorted to the main lobby where all of the other survivors had been gathered. I was given a blanket, two bottles of water and a large piece of dried bread in a plastic wrap. I inhaled both water bottles and scarfed down the entire piece of dried bread.</p>\n\n<p>“I know it’s not much but it will have to make due until dawn. We have supply trucks bringing in reinforcements, medical personnel, and more food. For now, get comfortable, it is a long time until dawn.” No one spoke. Most people just sat still staring into space, clearly suffering from shock. </p>\n\n<p>“What the hell is wrong with those people?” one woman asked with a look on her face like she was unsure if she really wanted an answer.</p>\n\n<p>“That’s what we’re here to find out Ms. When we know anything substantial we will be sure to let everyone know.” This guy was clearly one of the guys in charge. You could just tell. He walked back to the welcome desk where he began shouting orders over the radio.</p>\n\n<p>I tried to sleep. I really did. But with gunshots echoing through the halls on a minutely basis and my crippling anxiety, I could not find sleep that night.</p>\n\n<p>Sunlight was beginning to shine into the ground floor windows, this was the first time I was able to see the street outside. Dozens of bodies littered the streets and sidewalks. An ambulance was turned upside down in the unloading area. </p>\n\n<p>Then I noticed the infected. Imagine being drunk and walking home at 2am, but you’re also on acid - that is how the infected walk when they are inactive. After several minutes of watching the infected wander the street outside, I watched as all at once they snapped to attention and began to sprint around the corner of the building. Moments later the supply truck convoy was quickly driving into the emergency unloading area of the hospital. </p>\n\n<p>The mercenary who had talked to us the night before led a squad of 10 men armed with rifles outside the hospitals front doors. The infected began to drop one by one as bullets riddled their bodies. Once all of the infected were taken care of, the reinforcements began to carry supplies into the hospital. A giant crate was placed in the middle and a soldier used a crowbar to open it. This crate has some food and water inside. Take as much as you need, but after this crate serious rationing will be put into effect. </p>\n\n<p>A long line formed as people picked up various items from the crate and brought them back to their respective areas. I was able to get a box of crackers, a small bag of beef jerky, and a unlabeled large bottle of water. </p>\n\n<p>That day the soldiers went back and forth to the hospital bringing back various amounts of survivors to the hospital. After a while, room in the lobby was filling up and the soldiers noticed. The soldiers began constructing fortifications around the parking lot of the hospital. A electronic gate was installed and everywhere else was fenced in by a tall chain link fence topped with barbed wire. </p>\n\n<p>The soldiers began setting up large tents inside the new perimeter they had created. Myself and many others were assigned tents outside while a lucky few remained inside the safety of the building. </p>\n\n<p>We stayed this way for almost a week. Each day the soldiers brought in less and less people. Eventually it got to the point where they would only rescue one or two people a day. Often less mercenaries than they had left with would return from these rescue missions. </p>\n\n<p>The people inside the safe zone were beginning to get restless. People were constantly walking or running at the fence line for exercise at this point. Then it went wrong a woman apparently not paying enough attention got to close to the fence during her run. The infected outside managed to get ahold of her and spit their fowl blood onto her face. She screamed and dropped to the ground were she began to convulse in a intense seizure. Blood started to seep from her eyes nose and mouth and her screams began to fade into quiet gurgles.</p>\n\n<p>She turned faster than any infected individual I had seen this far, in a matter of a minute or so, and began to sprint towards a group of people where she managed to infect 3 others and only barely miss the fourth before being shot down by the guards. With no known treatment, the mercenaries decided it would be safer to execute the infected before they could turn. And that’s what they did. Using their sidearms they executed the seizuring infected one by one.</p>\n\n<p>That was two days ago. Later that evening of the same day something big happened. I saw one of my colleagues from the lab. </p>\n\n<p>I yelled for him to come over to me and when he saw me a look of fear came over his face. He quickly came over to me and told me to shut up and that we should talk somewhere else.</p>\n\n<p>I took my colleague into a supply closet inside the hospital and he began speaking frantically.</p>\n\n<p>“They’re after us. I don’t know why, but they took the other two guys who got out. They’re going to take us next if we don’t leave right now!” He said in a hushed tone.</p>\n\n<p>“Who wants to take us? Take us here? You’re not making sense here.” I said trying to calm him down but with no avail.</p>\n\n<p>“Those mercenaries! Their boss had something to do with the contamination leak at the lab!” He said even more panicked than before.</p>\n\n<p>Before we could say more the door to the supply closet opened and we were met with a puzzled face of not a mercenary, but a nurse from the hospital. </p>\n\n<p>“What’re you doing in here?” She asked with genuine confusion smeared on her face.</p>\n\n<p>“We were getting supplies to clean up our tent.” I lied. She seemed convinced and asked for a broom which I handed to her. </p>\n\n<p>“We have to leave this place before they can get to us. Do you know of any way we could get out undetected?” He asked.</p>\n\n<p>“Not really. They shoot to kill when people try to climb the fence and won’t let anyone out of the gate.” I replied.</p>\n\n<p>“What if we made some kind of distraction and got away in the confusion?” He suggested. </p>\n\n<p>“I can’t think of anything that would really get the attention of the guards. They watch the outside like a hawk though, so infected would definitely get their attention.” I told him.</p>\n\n<p>“I know you’re not going to like this, but this plan may be our only shot.” He said solemnly.</p>\n\n<p>I followed him around until he found a map of the facility where he then continued walking. Eventually we reached the maintenance room where he rammed the door down. </p>\n\n<p>I waited outside in the hallway for him for some time. All the while hearing clanking sounds as he rummaged through tools and other metal objects.</p>\n\n<p>I was about to ask what he was looking for but before I got the chance he had appeared in the door frame.</p>\n\n<p>“I found it, follow me.” He said as we began to walk back the way we came. He was holding bolt cutters.</p>\n\n<p>We reached the outside where we managed to sneak past prying eyes. I still didn’t realize his plan until he had reached the fence. </p>\n\n<p>“Hell no! We can’t do this! There are innocent people in there!!” I said angrily.</p>\n\n<p>“Listen to me. If we are found and captured here, a lot more than however many people in here will die.” He said. I could tell he was serious. </p>\n\n<p>I decided to listen to him. I felt guilty as hell after the fence had been cut and we snuck out.</p>\n\n<p>However, nothing could prepare me for the guilt I felt after I heard the first scream.</p>\n\n<p>We started running. We ran and ran and after what seemed like miles, we could no longer hear the screaming, but now we could hear gunshots. We kept moving until eventually he found a working vehicle and we started driving. He wouldn’t answer where we were driving to, but I could tell where we were going. </p>\n\n<p>We were headed to the bioweapon lab.</p>\n\n<p>[- D](reddit.com<a href=\"/r/yumkimilstories\">/r/yumkimilstories</a>)</p>\n</div>\n","author":"Its_YumKimil"}