{"rank":"95","title":"Real life fairytales aren't so nice (Part 1)","id":"8kswvy","url":"/r/nosleep/comments/8kswvy/real_life_fairytales_arent_so_nice_part_1/","time":"1526826312000","body":"<div class=\"md\"><p>The apartment was not exactly the type of place I thought I’d end up. I had to lean my shoulder against the front door, pushing aside the trash piled in front of it to slip inside. My roommate, Devon, was passed out on the couch, beer cans scattered around the floor around him, and a pizza box resting on his bulging stomach. I couldn’t help but stare at him for a minute before I stepped over the piles of trash and made my way towards my bedroom at the back of the apartment.</p>\n\n<p>It’d been hard trying to find a place to rent that wouldn’t ask questions, wouldn’t require me to sign my name down on any papers. Disappearing in the digital age wasn’t something easily done, and it felt like I was spending a small fortune in burner phones. But, despite how it must seem, I don’t want my family worrying about me. I like to check in and let them know I’m still alive.</p>\n\n<p>Sometimes I even think about going home again. Dad wouldn’t question it if I showed up on his doorstep. He’d take my bags and haul them up to my room, we’d be a family again for a while, my stepmom keeping her mouth shut because if she chased me off, she’d join the list of ex-wives my dad had going. But eventually dad would suggest I go see a doctor, get put back on medication that never helps.</p>\n\n<p>See, Medication only helps when the things you see aren’t real – what I see are real. And the monsters would find me again the moment I set foot back in town.</p>\n\n<p>I think the reason I’ve stayed with Devon so long is that he’s the first person who didn’t bat an eyelash when I asked him to cover the mirrors in the house. He doesn’t have much use for them – Devon works from home and has next to no social life, as far as I’ve seen. Half the time he spends the whole week wearing the same stained t-shirt and boxers, only changing them when I give him a look.</p>\n\n<p>I was halfway through the trash covered living room when I noticed that the TV was on, but the channel was static. I knew what would happen if I stood there watching it, I’d start to see the shapes, hear the voices trying to call me back to that other place.</p>\n\n<p>I knelt down on the floor, pulling the knife free from my boot. The trip to the bedroom was hurried. I didn’t care about kicking piles of trash now – what I cared about was getting my ass out of the apartment. Six months, I’d gotten six months before they found me.</p>\n\n<p>It was the longest on record.</p>\n\n<p>I threw my clothes into a pack when I reached my room, grabbed my other bag, which had all my travel papers and other odds and ends, and made my way out of the apartment, Devon not stirring the entire time – I wonder if he’s asleep or enchanted.</p>\n\n<p>I took the stairs, the elevator had mirrors and I didn’t trust them not to grab me through them, witnesses or no witnesses.</p>\n\n<p>It was an uncomfortably long walk to the train station, but at least it gave me time to think about my life choices. Part of me wondered why I was even trying to get away, people didn’t get away from the monsters – you could run, but eventually they always found you.</p>\n\n<p>I booked my ticket at random and flopped down on a plastic seat to wait. I’d no sooner sat down when the world shifted sideways. It wasn’t a full shift, but enough to let me know that someone knew the general area I was in – enough to talk to me at least.</p>\n\n<p>“It’d be easier if you just came home, Alice.”</p>\n\n<p>O’Malley.</p>\n\n<p>I turned my head to regard the old man, surprised that they’d sent him after me. It seemed a lifetime ago that I’d been a waitress at his ‘Authentic Irish Pub’. I’d adored him – until I saw what he really was.</p>\n\n<p>As if reading my mind, O’Malley frowned, his shamrock green eyes narrowing. “Don’t go giving me that look, girl.” He chided, “I’m not the one who went and opened your eyes to the whole thing!”</p>\n\n<p>“No, but you didn’t try to help me after, either.” I reminded him.</p>\n\n<p>O’Malley winced. “She wouldn’t have really eaten you, you know.” He said quietly.</p>\n\n<p>I raised the sleeve of my t-shirt and showed him the scar that the Witch had left on my arm. “She made a good show of it for not actually eating me.”</p>\n\n<p>O’Malley took a step forward, as if to touch me, but his hand vanished when he tried. He didn’t know where I was, so he wasn’t actually solid enough to interact with me. “Ian put a stop to her after he found out.” He said quietly, “But you’d gone by then.”</p>\n\n<p>“Did you think I was just going to stick around and wait for the next supernatural asshole to try and take a bite out of me?” I demanded. “You guys acted like I’d set out to see you, when I was just trying to be normal. It wasn’t my fault that my parents decided to move to the most supernatural place in America.”</p>\n\n<p>“The only supernatural place in America,” O’Malley corrected me. “Or the only place where we could live.”</p>\n\n<p>“I don’t really care.” I glared at him. “All I know is that one second I’m a normal high school girl in California, the next I’m being moved to bumfuck nowhere, to a town that is full of things out of fairytales and supernatural books, but the kicker is that most people don’t even know that their next-door neighbor is the reason their pets keep going missing.”</p>\n\n<p>“You’re still salty about the cat.” O’Malley mused.</p>\n\n<p>“Of course I’m still salty about the cat!” I screamed at him, not caring that people in the train station probably thought I was a mental case. “He ate my goddamn cat!”</p>\n\n<p>“I’m sure he didn’t mean…” O’Malley trailed off before sighing. “Alice, listen to me, please. You see far too much. It’s not safe out there for someone like you. If you come home, we can protect you.”</p>\n\n<p>I nearly laughed, until I felt a sharp stabbing pain that jerked me out of the vision and back to reality. The stabbing pain was the pair of claws currently making a good show of tearing my stomach open. The claws belonged to an elderly woman… correction, hag. She was totally a hag.</p>\n\n<p>I kicked her square in the face. The result was her screaming bloody murder, me screaming in pain, and her claws slicing clean through my stomach, resulting in a ton of blood going everywhere.</p>\n\n<p>Overall, I don’t recommend letting someone do that.</p>\n\n<p>The only benefit to having lived in Gentry Ohio was that I took a lot of interesting things with me before I ran. Such as the pretty red bottle of health potion that the witch who tried to eat me was brewing the day she tried to… eat me. I’m sure she was brewing it for someone else, but I stole it, and the Folk tend to be amused when you manage to outsmart them – I think stabbing a fireplace poker through the Witch’s face took her from amused to murderous, but then I followed it up with robbing her blind before leaving town.</p>\n\n<p>I’d already survived four years in Gentry before the Witch happened. My only friends at the time had been Ian, the man who owned the only gas station in town, and O’Malley, the pub owner who seemed to be really, really lucky when he placed bets on things. And there was nothing more O’Malley loved than betting and gambling.</p>\n\n<p>Ian… Ian was something else. I tried working at that gas station for a while, but the dead bodies kept showing up on his back porch, most of them half eaten by dogs. I’d watch people come in, chat Ian up, and the next day someone was dead. Ian was always gone when the bodies showed up, but he’d come in before my night shift was over and the body would be gone.</p>\n\n<p>The worst, and it happened right before the witch, was when I was bitching about a classmate who’d started to bully me. I damn near had a heart attack when I saw her body outside the door, along with a simple gold coin. Ian appeared seemingly out of the shadows and picked the coin up off the ground, it had her blood on it, and offered it to me.</p>\n\n<p>“You only get one free request.” He told me. “next time you need me to help you, you’ll have to pay for it.” He pressed the bloodied coin into my hand.</p>\n\n<p>I still had that coin.</p>\n\n<p>The Hag had picked herself up off the ground, almost before I was able to uncork the bottle and drink the contents, which tasted like soured apples, and stumbled away from her, still clutching my now healing stomach. At least this time, my insides stayed insides, there’d been one time where they hadn’t, and I’d had to push everything back inside before my skin healed wrong.</p>\n\n<p>“Wretched brat,” The hag hissed, “if you knew better, you’d just lay down and die.”</p>\n\n<p>“No fun in that.” I reached down and took my knife out. The blade was cold iron, the only thing I’d found that worked on these monsters.</p>\n\n<p>The Hag stared at the blade for a long moment before she lunged, faster than any thing that looked like a little old lady should ever move. My knife came up, plunging into her chest, but not before she took a chunk out of my shoulder. We both fell to the floor of the nearly empty train station. My bag was too far away for me to reach another potion, and even if I could each them it was dangerous to drink so much at a time, all I could do was watch as my blood spread across the tiled floor.</p>\n\n<p>Great, years of running from the monsters and I was going to die alone in some shitty backwater train station.</p>\n\n<p>Or I listened to O’Malley and went home…</p>\n\n<p>I fished the chain out from around my neck, the one with Ian’s coin attached. Would it work? Or was I just summoning a bunch of hell hounds to come and kill me? Did it even matter? I was dead if I didn’t… I held the coin tightly in my hand and asked for help.</p>\n\n<p>The sound of baying hounds was the last thing I heard before the darkness took me.</p>\n\n<p><a href=\"https://www.reddit.com/r/nosleep/comments/8lnrnp/real_life_fairytales_arent_so_nice_part_2/\">Part 2</a></p>\n</div>\n","author":"Rosewhisper"}