{"rank":"40","title":"Inside Kyoto's Lipstick Lounge","id":"8kt28j","url":"/r/nosleep/comments/8kt28j/inside_kyotos_lipstick_lounge/","time":"1526827823000","body":"<div class=\"md\"><p>One True Story from Japan’s Shutter Alleys</p>\n\n<p>To paint a picture for you, my friend and roommate Trevor and I are pretty average American males in our early to mid thirties. You probably know guys just like us: we work at the same boring office job, we live in an apartment that could be described as fairly unluxurious but we have a lot of DVDs. In the evening, we like to watch wrestling and play XBox to basically unwind.</p>\n\n<p>However, there is one little difference that sets us apart from average: we love anime, ramen, and literally anything from Japan. You probably know the type at your job or school. So when we learned about an all expense paid trip to Japan through our company back in 2009, we literally jumped at the chance to go. Our Japanese was what a Japanese person would probably regard as nonexistent and we therefore tried our best to brush up and learn on the airplane ride over there. Imagine two average white guys trying to teach each other a new language and mix in the turbulence of an airplane ride and, yeah, you get the idea of how things went I think. I would sometimes lean over and listen closely near Trevor’s cheek and I could hear his headphones clearly and it was not a Japanese lesson unless the lesson was being given by Dave Grohl of the Foo Fighters. </p>\n\n<p>Finally, we landed and it was like we finally arrived home for the first time. Like diving headfirst into a giant bowl of ramen, that’s just how warm we both felt. And let me tell you, it was a fantastic feeling. Little did we know that that feeling would soon become one of cold, pure terror.</p>\n\n<p>Our first day was like riding a rollercoaster inside a whirlwind: taking a train to Kyoto and loading up on authentic Asian ramen before checking into our hotel and then passing out from still having jet legs. </p>\n\n<p>We awoke late that night in Kyoto and let me tell you that it is truly the city that can not sleep. We found ourselves wandering around until 4 in the morning, drinking at little bars and even eating “okonomiyaki” which the guidebook said was like Japanese pancakes but it was really made of eggs and cabbage that we had to cook on our table! To say it was weird would be an understatement, but it was an exciting kind of weird, not the kind of weird that you grow to fear in your basement or in some other equally dark place. It was not like IHOP either. </p>\n\n<p>We drank a little too much and upon awakening at noon the next day, discovered that we had bought or found some oversized Super Mario hats, one was a traditional red Mario cap and the other was yellow and its inverted “M” signified that it belonged not to Mario but his archnemesis, Wario. We decided to wear them while we were out and about just for fun and we thought the Japanese would think “who are these two goofy guys anyway and what are they doing here?” We were not wrong. Everybody was checking us out! </p>\n\n<p>With the assistance of our trusty guidebook, we were easily navigating the twists and turns of the Japanese railway system. We went to the Fushimi Inari Shrine, which has thousands of these giant red gates and you climb through endless tunnels of them. I could hear stray cats meowing forlornly in the depths of the woods, but the bright red gates blocked all vision. It was pretty spooky to say the least. We got to a place where there are all these miniature versions of the wooden gates that you can buy and draw on and hang up so of course we did that. We wrote some really funny stuff on them, mostly rated PG-13 or maybe even R if you catch my drift. We were laughing so hard that Trevor forgot that he put the guidebook down to write on the little gate and we didn’t notice until we got back to the street. Trevor and I are what you might call ‘husky’ and are not fond of exercise, so we looked at each other as if to say “no way we are climbing back up there!” and just continued on our adventure without the book. Little did we know that this was a huge mistake that we would soon regret.</p>\n\n<p>We had been practicing the names of our hotel and more importantly the area around our hotel, which is basically downtown Kyoto. Looking it up now with the magic of the internet, I know that we were trying to say “Sanjo Shotengai.” A shotengai is a covered shopping arcade with restaurants and stores and stuff, and the Sanjo one was a huge popular one right by our hotel, you just had to walk through it and then keep walking straight. It would basically be impossible to get lost once we were there. More like if we got there. We were saying so much weird garbage to the confused old Japanese man who was driving our taxi that he kept shaking his head and pointing at our Mario hats. Finally, Trevor said some total gibberish like “Sanjai Shinchoden” and the withered old gentleman looked at us and, in what I would call a serious Japanese voice, said something that sounded kind of similar but at the same time was totally different. We were both relieved, believing that we had finally gotten him to understand. He turned on the meter and took off and we congratulated ourselves on not needing the guidebook afterall. </p>\n\n<p>After driving for some time, we started to get kind of worried because nothing looked familiar. Or should I say, everything looked familiar because every building looked the same. It seemed like we were driving too far though. Finally, we arrived at the entrance to a shopping arcade but it looked old and there weren’t many people around. Trevor said that it was probably just an old entrance that branched off of the main area and we would be fine if we just followed it. It looked much narrower than the other arcade areas we had been to and in fact if I stood in the center I could almost touch the shutters on either side. This is what we learned later was called a “shutter alley” because most of the businesses had closed down and were now permanently shuttered. </p>\n\n<p>It was quite eerie. Not only was it deserted, but it was darker in there as well due to the ceiling, which prevented light from shining through. There were also all of these dusty pink ribbons hanging from the ceiling like there had been some sort of celebration here back in the 1980’s and then everything closed before they could take down the decorations. We walked for what felt like an eternity, and every single place was closed down. It really made the mind ponder at what was once there. It was hard to imagine actual people doing things like eating and shopping in such a truly ominous setting such as this. Rust clung to every inch of the metal doors and Trevor mentioned how weird it was to see rust in such an obviously unmoist environment. Other than the question of rust, we didn’t talk much for awhile, and just took in the sights.</p>\n\n<p>Further down the dark arcade, we saw one of those Japanese coin machines that dispenses toys of various types in plastic eggs and we went directly for it like dogs salivating because they hear the dinner bell. The machine looked like it was a million years old and rust clung to it too even though it was quite dry. Trevor even remarked on how dry it was for a rusty old machine and I had to agree. The display was a picture of a bunch of black figures dancing or surfing on lipstick kisses. They looked like people wearing all black spandex bodysuits or something. There was a weird shape that looked like someone screwed up in a game of Tetris. It was just a bunch of random tangled rectangles. Classic Japan weirdness. There was text at the top in English but it looked as if someone had typed it out on a typewriter and then clumsily glued it on. It said “Kyoto Detectives Club,” which meant nothing to Trevor or myself but we were nonetheless very excited. My fingers grasped my Japanese money and trembled like a baby excited to buy his or her first toy. </p>\n\n<p>“This is probably treasure” we were simultaneously thinking out loud. I had no idea what was going to tumble out of the little rusty chute as I turned the filthy and creaky plastic knob in my shaky hands. I wasted no time in retrieving the plastic orb and Trevor was already inserting his coin as well even before I could pop that sucker open. It opened suddenly with a pop and something flew out like a small weird bird and crashed with a metallic tinkle onto the concrete amidst our feet. Trevor started complaining and said “Aw man, that was the last one! You got the last one and I just lost a coin!” I told him that he sounded like the namesake of his hat, the famously greedy Wario and suggested that perhaps the hat was changing his personality and we both laughed so hard that I nearly forgot about the metal prize that my plastic egg had spewed forth onto the concrete below. It was there twinkling by my shoe: a normal looking old key that cost me 100 yen. I held it up and turned it around in my now calm fingers, contemplating a lot but mostly focusing on what this key could open. “What do you think it goes to?” I asked. “I think we both got ripped off,” Trevor replied. </p>\n\n<p>We decided that we had to get home somehow because it was starting to get dark and we had no idea where we were. We started to walk back in the direction we had come. Our plan was to find the road where the taxi dropped us off and hopefully flag down a new taxi and maybe just say “downtown Kyoto” or something and hope for the best. As we began walking, I noticed something: all of the shutters that were pulled down on either side of us had big padlocks that were keeping them shut. </p>\n\n<p>I pulled out the key and began trying to thrust it into the keyholes with little to no success. The key just wouldn’t turn. We started making jokes about how hard it was to be in the Kyoto Detective’s Club and then saying “it’s a living!” every time the key wouldn’t turn. Then we took a left and in the distance we could see cars driving by on the road. I tried the key again in the first lock on the left and was obviously shocked when it turned easily and the lock popped open. Trevor and I exchanged glances to express our disbelief at this situation and then we both said “It’s a living!” and high fived while laughing. The lock slid off and greedy Wario-Trevor slipped it into his bag. The latch, on the other hand, was beyond rusty and it took both of our combined strength to push it four inches to the left. We were both a little freaked out by this. Were we breaking into someone’s store? What if someone was living inside?</p>\n\n<p>In the end, it was just too weird to not continue to investigate further. I went to the middle of the road and was a lookout for any pedestrians though, of course, there were none, while Trevor attempted to push open the shutter. It wasn’t easy. He was pushing it up inch by inch until it was about a foot off the ground. He took a break and we sat on the ground sharing a lukewarm Azuki Pepsi. Trevor was taking a big swig when suddenly someone turned on the lights and we both stood up. There were lights along the top of the arcade that we hadn’t noticed but they seemed to be on a timer. The whole place was lit up even though we were the only ones there. It was a little spooky but after we got over the shock and realized that we hadn’t been caught breaking in, we went back to work, this time we double teamed the shutter and it creaked slowly but surely up until it was above our heads.</p>\n\n<p>In front of us now, about three feet from where the shutter had been, was a solid wall with a red door in the center. There was a dirty brass plaque over it that said “Lipstick” in fancy cursive writing. I asked Trevor for the lock which still had the key thrust inside of it. I removed the key and tried it in the keyhole. It fit like a charm and I turned it gently to the right. The door creaked open, revealing a narrow set of stairs that led down into the dark. I know what you’re thinking. Here’s the thing though: Trevor and I had known each other for ten years at this point and had always talked about having a wild adventure some day, and now a literal adventure was staring us in the face. So we had to see where it led. Some people would probably have not gone down those stairs, and believe me when I say that I wish we hadn’t. But we did. </p>\n\n<p>We busted out our flip phones and began our descent into the unknown. For whatever reason, we started conversing through whisper, with Trevor breaking the ice of silence to comment on how dry the air felt. I whispered back a quiet agreement. It was dark so I held out my hands and felt the concrete walls on either side of this very narrow staircase. It must have went down 30 or 40 feet. We were either in some kind of basement or perhaps even a sub-basement to be honest. Eventually, after a period of time that felt like forever, we reached another door. It was difficult to see by the light of our phones but it appeared to be an ordinary door and did not have any significant markings or plaques like the Lipstick Door had had. I placed my slightly shaky but excited hand on the cool knob of the door and twisted ever so gently. It turned.</p>\n\n<p>I looked at Trevor and I could tell he was nervous and excited too. Even if I couldn’t see him very well, I just knew his personality after all this time. We clenched our hands together tightly in a show of brotherly solidarity and whispered “it’s a living” one more time since it had become our battle cry. The door opened slowly but surely into more darkness. I stuck out my hand and felt something soft. A long velvet curtain was hanging just a few feet inside the door. I pulled it aside and we walked into the unknown with our cheap flip phones providing a weak light that was just enough to kind of see where we were going. We stood there at the entrance, just inside the velvet curtain while our eyes adjusted. The air felt warm and heavy like this place hadn’t been ventilated in quite some time.  It smelled musty and gross like dust and old food. Was this an old restaurant or something? </p>\n\n<p>We made our way along the wall, until we found a red leather booth and we both sat down like we were at a customers at a normal restaurant. In a funny loud voice, Trevor said “Hey, can we get some service here?” and then he looked at me and in a much quieter voice said “I actually am hungry. What is this place? The walls are covered in mirrors.” I looked at the wall behind our booth and could see the smooth surface of a mirror that seemed to stretch from the floor to the ceiling. </p>\n\n<p>I moved my phone over to get a better look and noticed some candles at the far end of the booth and a couple of books of matches. I grabbed the matches and noticed they had the same pair of lips on them and said “Lipstick Lounge” in English, along with some Japanese at the bottom. We examined them for a minute before Trevor had the bright idea of lighting the candles with them. Before lighting the first match he said “Welcome to the Lipstick Lounge” and then laughed menacingly. It was pretty funny, I had to admit, and the candles on our table were gradually increasing our realm of visibility. </p>\n\n<p>Trevor was staring at the mirrored wall and said “Check it out, dude.” Upon viewing the mirrors in the light, I could see that there were lipstick kisses covering the entire thing, including up near the ceiling where it would be very difficult to kiss. What was this place? That was the question we were asking and attempting to answer as we looked around the room. I took one of the candles and carried it over to the booth across from ours. There were more candles, which we started lighting as well. </p>\n\n<p>Trevor found a long bar that had thick candles melted onto it and he was lighting them in a row, about 20 feet away from me, when he suddenly screamed. It wasn’t a mild scream either, but a blood curdling one. “Oh fuck, there’s a dead body or something over here, man!” I looked at the far end of the bar that was beginning to be illuminated and, sure enough, there was a body sitting upright on one of the stools, their head slouched down as if they were drunk or dead. </p>\n\n<p>My heart was going a mile a minute at this point, but for some reason I just knew it wasn’t a real person. I walked over to where Trevor was and we both stood there staring at the unmoving figure. Even in the darkness, I could tell it wasn’t a human. The outline of the head seemed too small or just not the right shape exactly, it’s hard to explain. But I would be lying if I said I wasn’t freaking out inside as I walked over to it and gave it a light shove. I was imagining it grabbing me or something. It didn’t do that though. It just slid onto the ground with a gentle thud. It wasn’t as heavy as a real human body either. I picked it up and noticed that is was a life-size human doll that was made out of black cotton material. It didn’t have an features on the face and the hands were little black mittens. I held it up in front of my body and made it wave at Trevor and then in a creepy voice I joked around and pretended that the doll was talking. “Don’t be afraid, Trevor, I just want to haunt your life forever!” </p>\n\n<p>We propped it back up in the stool and examined it some more but there wasn’t much to learn beyond the fact that it was really creepy and why would anyone make this thing and put it here? To scare away intruders like a scarecrow for people? Or was it part of whatever the Lipstick Lounge used to be? We sat on the spinning bar stools on either side of the dummy and talked about these things while gazing out into the semi darkness of the lounge, the candles we had lit illuminated the wall to our left and part of the bar behind us. </p>\n\n<p>Suddenly, Trevor was quiet and then said “Oh shit, there’s another one,” and grabbed one of the candles behind him and walked over to the other side of the lounge where he placed the candle on a table. The light illuminated another black cloth doll, this one was sitting in a booth with its arms spread out like it was relaxing. “This one smells like potpourri or something!” he said. I glanced over at the doll next to me and leaned in to smell it. It smelled… weirdly good. Like soap or something. “This one smells good too!” I called back. Trevor had left the candle on the table and was making his way back. “Why do they smell so good? Are they stuffed with perfumed cotton or something?” Trevor asked as he poked the dummy from behind. “It’s soft like a pillow.” </p>\n\n<p>We sat there in a brief silence, both attempting to piece together the weird information that was piling up around us. Then, he said something like “Man, nobody’s gonna believe that this place is real.” I mentioned the matches but he shook his head and said people were just gonna think we went to a strip club or something and made up a weird story about it. I was half joking when I suggested we take one of the dolls and ship it to our apartment in America. We joked around about how it would come to life and haunt us but what we would really be upset about is that it made the place smell nice. </p>\n\n<p>No, it was too creepy to take home. We needed a picture. I got out my flip phone and Trevor posed with his arm around the black doll at the bar, giving the peace sign like Japanese people tend to do in photographs. The light from the candles made it look really spooky, like he was telling a scary story around a campfire. When we looked at the photo, however, there was a minor problem: both Trevor and the dummy were black. You could see the outline of both of them, but they were pure black. Just two black silhouettes in the candlelight. We took some more, messing around with candle positions, and all of them were like that. He even took some of me. We decided there just wasn’t enough light in that place for flip phone photography. </p>\n\n<p>We grabbed a candle in each hand and decided to walk around the perimeter before leaving. Maybe there would be something we could take as a souvenir. We walked past the booth where the second doll was still reclining and I glanced over at it. “Trevor, did you move its arms behind its head like that?” Trevor stopped walking and looked back. “Chill out, man. Weren’t they like that?” I could hear his voice quivering slightly. </p>\n\n<p>I’m sure we were both deciding to get the hell out of there right then when suddenly the doll slumped forward as if it had been pushed and lay sprawled out on the table with its head directly in front of the candle. I could hear my heart thudding in my chest like it was trying to escape which was exactly what I wanted to do. We both stood there staring for about 10 seconds. The only things moving were the flames from the candles. Trevor started to say something but all he got out was “Holy-” before the candle in front of the black doll went out. </p>\n\n<p>Of course, it would probably be more accurate to say that it was blown out. Like a child making a wish on his or her birthday. Be careful what you wish for because it just might be a nightmare. The next couple of seconds were literally a blur where I ran into Trevor’s back and burned my hands with candle wax. My candles, of course, went out and I threw them behind me. I think Trevor’s went out too, because we were running in total darkness in the back of the club, both swearing a lot and bumping into chairs and tables. I tripped over something and landed on my friend, who started wrestling with me until I was like “chill out man, it’s just me.” </p>\n\n<p>We got up off the floor and looked toward the front of the lounge, which was apparently huge, judging by the distance of the candle flames we had left on the bar and tables. I saw the dark figure approach one of the candles, moving its limbs in a jerky manner I would describe as being too slow and awkward for a human being. It bent its head over a candle and froze for a few moments and then the candle went out. </p>\n\n<p>Trevor instructed me to get down on the ground and I did. We crawled along the side of the wall, and suddenly I could smell the distinct smell of extinguished candles wafting through the dusty air. Trevor was crawling like a terrified baby in front of me when suddenly I heard him exclaim “What the fuck!” and it sounded like he was really struggling. </p>\n\n<p>I stood up to assess the situation but it was really dark. I could hear him struggling and maybe punching things but all I could see was rolling darkness on the floor. Then someone kicked me in the shin and I was like “fuck it” and elbow dropped the floor in front of me like a blind Macho Man Randy Savage. I crushed someone and thankfully it wasn’t my friend. I saw his white t-shirt in the sea of black and pulled at it while kicking someone else. It wasn’t a fight as much as a struggle, hands grabbing and pulling at me and me kicking at them with all my strength. I pulled Trevor up while prying off someone with my foot and I could see him land one more punch in the darkness. “They’re all over the floor,” I heard him say behind me as we were running.</p>\n\n<p>I had my arm outstretched along the wall so I could feel the velvet curtain, which turned out to be a great idea because I found it. I pulled the curtain aside and Trevor ran toward the staircase first. “Oh fuck!” I heard him shout and then saw what he was referring to: another one of those black cloth doll people was sitting on the staircase, kind of reclining with its head back a little. Trevor kicked the thing in the chest as hard as he could which turned out to be stupid because it was just a doll and he kicked it and the stairs really hard and yelled out in pain. The doll just kind of slouched down and I remember walking on it and it just felt like walking on a pillow or even a pile of blankets. As we ran up the staircase, the thought that the door leading outside would be closed passed through my mind because I was seriously freaking out. </p>\n\n<p>Fortunately, it was still open, and the shutter was half opened, just like we left it. We ran, taking huge gulps of the fresh and crisp autumnal air into our lungs. We kept running toward the street and didn’t stop to look back or anything until we made it to a convenient store. Outside, when I first looked at Trevor, I thought he was covered in blood. “Holy shit, are you alright?” I asked and he seemed confused. “Yeah, I think I’m fine, actually. Why? Oh man, we lost our Mario hats.” That’s when we really moved into the light of the convenience store and we could really see ourselves. Trevor’s face and most of his white t-shirt were covered in dark red  lipstick kisses. </p>\n\n<p>If you are planning a trip to Japan, I honestly think you should go, because it’s really a great place. Just don’t go anywhere you are not supposed to be, and always bring your guidebook with you because it is really easy to get lost where no one will ever find you.</p>\n\n<p><a href=\"https://www.youtube.com/watch?v=TnpR-ykrkdo\">https://www.youtube.com/watch?v=TnpR-ykrkdo</a></p>\n</div>\n","author":"HorrificChild"}