{"rank":"2130","title":"Dear Melanie,","id":"8ktai1","url":"/r/nosleep/comments/8ktai1/dear_melanie/","time":"1526830126000","body":"<div class=\"md\"><p>I could tell that you were the one from the moment I saw you. Your dark hair was pulled up into a ponytail, and you weren’t wearing any makeup. That’s okay, you probably didn’t have time in the morning to get yourself all fixed up. I’m the kind of guy who knows how to look <em>beyond</em> superficial things like that. Besides, you probably didn’t expect to run into someone like me, someone that you feel that instant jolt of connection with. I completely understand. Love finds us in the strangest places, doesn’t it? </p>\n\n<p>When we first met, I could tell that you weren’t in the best of moods. After all, waiting in line for an hour at the DMV can do that to anyone. You were even a little- how can I put it - <em>bitchy</em> - when it was finally your turn. Again, that’s okay. I can see past a temporary situation like that. I know that underneath the bad day you were having, you’re a really sweet girl. </p>\n\n<p>I noticed that you bite your nails. I asked you if you have a lot of stress in your life, and if that’s why you bite your nails. You gave me a strange look and hid your hands behind the counter after that. You didn’t have to be embarrassed. I know that nobody’s perfect. </p>\n\n<p>I started to process your paperwork. I had already seen you out in waiting room, so I had everything ready before I called your number.  All I had to do was snap a picture of your license with my phone. Remember when I pretended to look for a pen and I turned my back to you for a second? That was all it took. It was so nice to finally meet you, Melanie Gordon of Sagebrook Lane. I can’t wait to get to know you better. </p>\n\n<p>You don&#39;t wear a wedding ring, so I figured you weren’t married. To make sure that you didn’t have some undeserving boyfriend hanging around, I went online after work and looked you up. I found a lot of pictures of you. A pretty girl like you needs to be more careful about what she posts online. I really liked the pictures from your camping trip last year. I like the outdoors, too.</p>\n\n<p>I have everything ready back at my place. I hope you like it. I’ve been working on it for so long, searching for the right girl to bring home. I put in those special UV lights that mimic real sunlight, and I put up some curtains over the concrete to make it look like there’s a window. There’s even a bed for you, and a shatter-proof mirror, so you can do your hair and makeup for me whenever you want. I bought a few things for you to wear, nighties and such. I picked up some red lipstick too. Red is really your color. I know you’ll want to look your best for me.  </p>\n\n<p>I’ve been sitting outside your house in my van for hours now. That’s okay, you’re worth waiting for. You seem to be a bit of a night owl. Do you suffer from insomnia? I’ve read that a lot of women have insomnia because they’re always worrying about something - dead-end jobs, cheating boyfriends, or back-stabbing friends. Don’t worry Melanie, you won’t have to worry about any of those things anymore. All of your problems are over. It’s going to be perfect, just you and me, from now on.</p>\n\n<p>The lights up in your bedroom just went off. I’m going to give it a few more minutes, but I’ll be up to see you soon. Wait and see, Melanie. You’re going to make me <em>so</em> happy.   </p>\n</div>\n","author":"writing_in_circles"}