{"rank":"6","title":"The Stream","id":"8ktkjg","url":"/r/nosleep/comments/8ktkjg/the_stream/","time":"1526832735000","body":"<div class=\"md\"><p>Okay, here goes nothing...</p>\n\n<p>I guess my name doesn&#39;t really matter, but you can call me E. Forgive any mistakes I make. I haven&#39;t really been getting much sleep over this.</p>\n\n<p>One week ago, my school decided to take a field trip to a park one state over. I&#39;m not exactly popular there, so I sat at the back of the bus with my buddy, let&#39;s just call him JJ. Everyone&#39;s excited for the trip and chattering with each other on the bus, but only I hear the muttering coming from the row in front of us. At first it blends with the other collective noise throughout my bus, but then I hear something interesting. &quot;Did you hear about the (Park we&#39;re going to, which will remain nameless) Hermit?&quot; One says to the other. The two are known for being more nerdy type kids, and they&#39;ve been known to lie just to get the spotlight. I mostly shrug it off, but I bring it up with JJ since we&#39;ve gotten bored. </p>\n\n<p>&quot;Dude, I heard from (The kids in front of us) about the (Park) Hermit. Have you heard anything on it?&quot; I asked. JJ simply shook his head, as he wasn&#39;t typically one for words. JJ usually knew about any and all rumors and gossip, so this confirmed in my mind that this was a load of crap. The main chaperone on this trip, who will be called Mr. I for privacy purposes, patrolled the aisles making sure no rules were broken. I was tempted to ask him about the park hermit when he came by, but I assumed he wasn&#39;t the type of person to be very superstitious. </p>\n\n<p>We got to the park, and the trip was mostly normal. We walked along the hiking trail, listened to Mr. I lecture us about wildlife, and ate lunch at the splintery wooden tables. JJ and I were eating lunch, but were both surprised when the two nerdy kids from the bus sat with us. Their eyes were rapidly shifting, as if they were looking for something. &quot;Have you heard of the (Park) Hermit?&quot; They asked me. I sighed when I immediately realized what they were trying to do. &quot;If you&#39;re going to spread a rumor, start with someone else.&quot; I said in a snarky tone. &quot;I swear it&#39;s real! I heard it from my older sister!&quot; She replied, which hardly convinced me. She sighed and walked off, chattering with the other nerdy girl. I don&#39;t know what she was expecting, since I was generally a sarcastic kid. I kept talking to JJ, still shrugging off the stupid rumor she was trying to spread. I knew where it was going. It was one of those stories where a man lives in the woods and eats children or whatever. What I thought then disgusts me now. </p>\n\n<p>At the end of the trip we went to a river near the woods. Mr. I said he was going to the restroom, so we were free to talk and throw rocks into the stream. This was when it happened. Like I said, our small group, which included the nerdy kids, was throwing rocks, when JJ suddenly started panicking. &quot;Dude... we&#39;ve gotta go, <em>now</em>.&quot; He rarely talked, and his eyes had widened. I thought he was pulling a prank, like he usually did in school, but suddenly I heard what JJ heard. Leaves crunching in the distance. I thought it was Mr. I at first, but then I noticed something that chilled my bones. It was coming from the other side of the riverbank. Without hesitation, I ran away from the bank, as did everybody else. By this point, everyone was screaming. The leaves crunching were getting closer. Tears ran down my face. I should have listened. As we were leaving, I dared to look back. I was horrified to see that JJ had tripped and was now screaming and crying. The hermit was now visible. I got a clear glimpse of him for half a second. I could see a face with a bumpy nose, light skin, and some stubble. The hermit was real, and it had JJ.</p>\n\n<p>We made it back to the bus, and told the chaperones reluctantly. After about three hours, my parents had driven to the park to pick me up after hearing what had happened. Many other parents did the same. In the past couple days, I&#39;ve been talking with authorities on the incident. They&#39;ve told me that they will find JJ, and I should take the next weeks off of school. There&#39;s an investigator that has interrogated the nerdy girls, a couple other kids, and me. </p>\n\n<p>It&#39;s been ten days, and I still have no idea what happened. JJ, wherever you are, please stay safe. You will be found.</p>\n\n<p>-E</p>\n</div>\n","author":"TheMartyrOfReddit"}