{"rank":"11","title":"Masochism","id":"8ktobi","url":"/r/nosleep/comments/8ktobi/masochism/","time":"1526833747000","body":"<div class=\"md\"><p>The thought of his wife waiting for him at home was all that kept him alive. With what felt to him like one of his last breaths he ripped out the hook lodged into the right side of his stomach. </p>\n\n<p>Gasps for air and screams of pain filled the small room he had spent the past immeasurable amount of hours in. </p>\n\n<p>Reaching over to his left side of his stomach he placed his hands around the second and third hook piercing through his flesh. And with one quick motion the second hook was removed. </p>\n\n<p>Another motion, this time much slower and more painful, and the third hook began to free itself. He screamed in agony, crying, and bleeding with his face buried in the floor. </p>\n\n<p>With his new freedom he reached over to the stool sitting near the edge of the room. Just within his reach was the hammer lying on top. He gripped tightly to the hammer and brought it over to him, clutching it tightly to his chest. </p>\n\n<p>He looked down at his feet. Four nails in the left, seven in the right. And he had to remove each and every one to free his lower body from its hold. </p>\n\n<p>Painstakingly he brought the edge of the hammer down to his left foot and maneuvered it under one of the nail heads. </p>\n\n<p>Blood poured from the newly opened hole in his foot as he ripped free the first nail. The metal clanged as it hit the floor and spun into the crack between wood planks.</p>\n\n<p>The second and third nail were close enough together to get at once, however the pain only multiplied comparatively as he ripped them free from their home. </p>\n\n<p>Blood was seeping out of his foot fast. He tried applying pressure to no avail as his hand was quickly submerged in a pool of his own viscous. </p>\n\n<p>The more nails he ripped the shriller his shrieks became. His voice breaking and cracking as he kept grasping for all the air in the room, hoping this would all end soon. </p>\n\n<p>The final nail bent as he tried to remove it causing it to sit at a strange angle and not at all in an easy way to pull from the floor. In a fit of desperation and fear he shook his foot violently, pulling his foot through the nail completely tearing a gaping hole through the bottom of his heel. </p>\n\n<p>He cried, holding the more injured of the two feet up to his chest and clutching it tightly. </p>\n\n<p>He eventually pulled himself up onto his feet and after some balancing adjustments, stood up, slouching over heavily.</p>\n\n<p>He began to limp over to the door on the other side of the room before the end of the chain around his stomach reached its length and restricted him. </p>\n\n<p>The chains dug into the hook wounds in his sides as he tried to extend the length of his entanglement to no results. Tears continued to form at the edges of his eyes. The cold metal of the chain pushed further and further into the deep cuts and then all at once untightened as he lost his energy and fell over.</p>\n\n<p>He grabbed the hammer that had fell out of his hand and pushed the head of it against the ground to help push himself to his knees.</p>\n\n<p>He began to slam the hammer against the chain, attempting to free himself. This did not work and eventually he chucked the hammer against the wall in frustration. The hammer bounced back and flew right past his head, just barely missing him. </p>\n\n<p>The hammer slammed against the tile wall behind shatter multiple of the tile squares. One chunk skidded across the floor to where he was crouched, panting. </p>\n\n<p>He grabbed the shard in his right hand, not caring that the sharp edge dug itself into his palm. With two repeating motions he began to saw at the beginning of the length of chain as it stretched from his torso. </p>\n\n<p>He kept at it for hours until he finally made it half-way through the chain, breaking the last strand of metal of one of the two bars that held it together. </p>\n\n<p>Fumbling with his hands he pulled himself closer to the wall so as to relax the tension on his hold. He managed to turn the broken piece of chain so as to release from the rest of the chain still connected to the wall. </p>\n\n<p>Pulling himself all the way back up to his feet, he looked at the door. For the first time unsure if what was behind it was better than what had been before it. </p>\n\n<p>There wasn’t any use dealing with hesitation though. He inched his way closer to the door and when he arrived he turned the handle without a second thought. </p>\n\n<p>As the door creaked open he saw the silhouette of a body hanging from a noose at the ceiling. Upon closer inspection he realized it was his wife. </p>\n\n<p>He cried and when he stopped crying he grabbed the hammer back from the floor and stuck the prying end in his mouth. He pulled down on the hammer ripping his jaw open and quickly bleeding out. </p>\n\n<p>Three words were written in blood on the wall behind his wife’s body. </p>\n\n<p>“You did this.”</p>\n</div>\n","author":"ShoeEatingAssassin"}