{"rank":"22","title":"Down By the Creek (Part 1)","id":"8ktxr0","url":"/r/nosleep/comments/8ktxr0/down_by_the_creek_part_1/","time":"1526836148000","body":"<div class=\"md\"><p>My name is Scott Anderson. I am 23 years old and I now live in a mental institution. I was taken in as “mentally ill.” I’m not insane, I can tell you that right now. I can hear scratching noises in the walls right now and it’s driving me crazy. I’m here because of an event that happened when I was 8 years old. </p>\n\n<p>My family lived in the suburbs of Memphis, Tennessee. We had a one story house and creek in our backyard. The creek leads downstream and it eventually leads into a swamp.  </p>\n\n<p>I was an all-around idiot back then. I looked like one too. My hair was down to my eyes, I had freckles splattered all over my face, and my glasses always had adhesive tape on them. </p>\n\n<p>I was a total nerd, but I hung out with the wrong crowd. </p>\n\n<p>I would always hang out with the bad kids. The kids sent out in the hallway and the kids who disobeyed their teacher. I was a bit of a toady. I let the bad kids take control of me. Sometimes they bullied me and sometimes they didn’t. Their favorite place to pick on me was down by the creek. My mom was a bank teller downtown and my dad worked at an engineering plant. My parents didn’t get home until 7 pm.  </p>\n\n<p>I was lucky enough to get my homework done by 5 pm, right before the bullies came after me. Somehow, they found out how to open my back door. So every day at 5 pm, they would come into my house and take me down by the creek. </p>\n\n<p>I would fight them sometimes, but that occasionally led to a bloody nose, so I didn’t try it often. </p>\n\n<p>On good days, they forced my head into the creek, and on bad days, they’d throw me in. I practiced excuses for my parents in my mirror because of my wet clothes.  </p>\n\n<p>Those were rough times, but there was one day that I will never forget. The event on this day also landed me here, in this mental institution.  </p>\n\n<p>It started on March 5, 2004. I got home from school with tons of homework to do. I was miserable that day, the bullies got ahold of one of my favorite books and ripped a page out of it. Once I got home, I went up to my room to get tape, and that&#39;s when I heard a knock on the door. </p>\n\n<p>The bullies were early. </p>\n\n<p>I ran downstairs and tried to get past the door, but one of them reached out and pulled me down by my hoodie. I slammed hard on the wood floor and the air got knocked out of me.  </p>\n\n<p>One of the bullies, Allen, leaned over me and smiled. His teeth were yellow, and his braces made it worse. His face was like a loaded pizza with all the acne. He was 2 years older than me. He was fat too, and he always wore XL3. His hair was in a buzz cut. </p>\n\n<p>&quot;What&#39;s up puke face!&quot; He shouted. </p>\n\n<p>The other bully, Ralph, came up and beside me and made me scream. </p>\n\n<p>&quot;Hey four eyes!&quot; He yelled. </p>\n\n<p>&quot;Shut up.&quot; I grumbled. Allen had my arm in an iron grip. </p>\n\n<p>I try to jerk away but his grip tightened. &quot;You&#39;re not going anywhere puke face, just down by the creek.&quot; </p>\n\n<p>&quot;Can we go somewhere else.&quot; I said. </p>\n\n<p>&quot;Nope,&quot; Ralph said, &quot;I think we&#39;re going to throw you in today.&quot; </p>\n\n<p>I didn’t like going down by the creek and into the swamp. Not just because that’s where they like throw me in, but because there was something lurking there. I remember when I was 5 years old, and I had wandered off down by the creek. I was exploring the swamp when this huge tentacle came up to grab me. I saw it out of the corner of my eye and I ran away as fast as I could. The same thing happened again the year after. I knew there was something in that swamp, and it wasn’t just some squid monster. It was an evil.  </p>\n\n<p>Something unfathomable.  </p>\n\n<p>Something sinister, and I wanted no part of it. </p>\n\n<p>&quot;Can we please go somewhere else,&quot; I pleaded, &quot;anywhere.  </p>\n\n<p>&quot;No way booger breath,&quot; Ralph said, &quot;we&#39;re going down by the creek.&quot; </p>\n\n<p>&quot;Ass wipe.&quot; I muttered. </p>\n\n<p>&quot;What was that puke face?&quot; Allen asked, his face was contorted with confusion.  </p>\n\n<p>&quot;I think he called me an ass wipe.&quot; Ralph said, then he got up in my face. Ralph was one of those skinny kids. He was a toady, like me, but he was worse. His hair was tied in a ponytail and we always wore clothes that were too short for him. His nose was always filled with boogers. </p>\n\n<p>&quot;Why don’t you call me that again excrement eater.&quot; Ralph egged on. </p>\n\n<p>&quot;Why don’t you get out of my face!&quot; I yelled, then tried to jerk free again. I hated being a toady. </p>\n\n<p>Then a large fist rammed into my face. White, hot pain flashed through my face and I was on the ground. I could feel blood running down my nose and back my throat. I gagged.  </p>\n\n<p>&quot;How&#39;d you like that puke face.&quot; Allen said. </p>\n\n<p>&quot;I think you can come up with a better insult than puke face.&quot; I said smugly. That earned me a kick in the ribs from Ralph.  </p>\n\n<p>&quot;Shut it smartass, now let&#39;s go down by the creek. We have something special in store today.&quot; Ralph said. </p>\n\n<p>With that, they pulled me up by the armpits and continued to drag me out the back door and into the backyard. It was raining outside, and my glasses immediately started to cloud up. The creek wasn’t far behind my house, only a few meters away. The creek went downhill to the left and that&#39;s where the swamp was. Going down there meant &quot;going down by the creek.&quot; </p>\n\n<p>The grass continued to stain my jeans until I decided to get up and walk.  </p>\n\n<p>&quot;There you go barf boy.&quot; Allen said and then he patted me hard on the back, on purpose. </p>\n\n<p>A few minutes later, we were down by the creek. It was foggy that day, and the swamp kind of looked the swamp of Dagobah in The Empire Strikes Back.  </p>\n\n<p>&quot;So,&quot; Ralph said, &quot;what to do today.&quot; </p>\n\n<p>&quot;Let&#39;s just get it over with Ralph.&quot; I said, pleading.  </p>\n\n<p>&quot;No, no, no Scott, we&#39;re going to take our precious time.&quot; Allen said.  </p>\n\n<p>&quot;Instead of just throwing you in the swamp today,&quot; Ralph said, &quot;we&#39;re going to throw you out in the center of the swamp. Where your imaginary monster lives.&quot; </p>\n\n<p>They both started to snort laughter. </p>\n\n<p>&quot;It&#39;s not funny,&quot; I said, &quot;there really is something down there. Something evil.&quot; </p>\n\n<p>This made them laugh harder. </p>\n\n<p>Anger flooded through me and I tried to jerk away once more. Allen shoved me down quickly and dragged me to the edge of the swamp. The swamp water reeked of sewage.  </p>\n\n<p>&quot;Ready to dive in?&quot; Allen asked Ralph. </p>\n\n<p>&quot;Ready when you are.&quot; Ralph said, and with that, they dragged me into the water.  </p>\n\n<p>The water was freezing, and goosebumps crawled up my skin. Ralph dunked my head in the water and water got up my nose. I was gasping for air. </p>\n\n<p>They continued to drag me to the center of the swamp. </p>\n\n<p>Once we got to the middle, they lifted me up. I was light for my age.  </p>\n\n<p>&quot;On three!&quot; Ralph shouted. </p>\n\n<p>&quot;No! No!&quot; I yelled. I tried to break away, but Allen had an iron grip. </p>\n\n<p>&quot;One!&quot; Allen said. </p>\n\n<p>&quot;Oh my God!&quot; Ralph shouted, and then he dropped me.  </p>\n\n<p>&quot;What the hell Ralph!&quot; Allen said. </p>\n\n<p>&quot;Something has my leg! It huurts! Ahhhhh!&quot; He started to wail. </p>\n\n<p>I looked at the water and saw blood forming. I heard crunching sounds while Ralph was screaming. I started to swim away.  </p>\n\n<p>&quot;Help me!&quot; Ralph shrieked. Blood started to spurt out of his mouth like a fountain, along with vomit. I saw something come up and pull his head down, then he was gone. He came up again, gasping for air, all the screaming, and then he went back down again. </p>\n\n<p>Bubbles floated towards the surface. </p>\n\n<p>I could have sworn I heard muffled screams. </p>\n\n<p>&quot;Oh my God!&quot; Allen screamed. He pointed a finger at me. &quot;You,&quot; He seethed, &quot;you killed him.&quot; </p>\n\n<p>&quot;I swear to God I didn’t!&quot; I said. I started to hyperventilate. </p>\n\n<p>&quot;I&#39;m going to kill you!&quot; Allen screamed at the top of his lungs. He lunged after me. It was as if he had lost his mind. </p>\n\n<p>I swam away as fast as I could. I was almost back to shore when I heard loud screams behind me. I turned around and saw Allen jerking through the water. He was trying to swim after me, but something was holding him back. I could see blood around him in the water. </p>\n\n<p>&quot;Oh God! It huurts!&quot; He shrieked. He broke free and started to limp towards me. His fingers were stretched out and he was pleading, &quot;Help me.&quot; </p>\n\n<p>Then, he was jerked backwards, and that&#39;s when I saw it. The monster was this huge, black mass. It bulged in and out and it had one, single eye in the middle. It was around 8 feet tall. I screamed and ran to the shore. I heard something smack onto my arm and it burned, but I kept running.  </p>\n\n<p>My chest was burning by the time I got back to the house. The blood in my nose had dried and then I started to cry. My glasses slid off my nose. &quot;That didn’t happen.&quot; I muttered to myself, but it was no use. I had just witnessed a murder. I started to breathe heavily, and I looked at the spot on my right arm that was burning. There was black spot in the center of my inside forearm. It was about an inch in diameter and I could have sworn I saw an eye blink in the middle of it. I touched it, and it burned. I shouted aloud. The substance was sticky. </p>\n\n<p>I got up off the ground and went inside to wash it off. I went to the bathroom sink, got some soap, and started to scrub it. After a few minutes of good, hard scrubbing, I stopped to look at it. It hadn&#39;t washed off, in fact, it was as if it was a tattoo.  </p>\n\n<p>I scrubbed harder, but it was no use. I started to panic. What was I going to do? </p>\n\n<p>Only time would tell. </p>\n\n<p>My life was pretty much a blur after that.  </p>\n\n<p>Once my parents got home, I told them the story about the monster and showed them the spot on my arm. They tried to calm me down, but by the time I was done with my story, I was screaming. It was almost like PTSD. </p>\n\n<p>They took me to the doctor the next day and he said that I should go to a rehab center for a while. </p>\n\n<p>That&#39;s when all hell broke loose.   </p>\n\n<p>Ralph and Allen were reported missing and they sent out a search party. They never found them. I finally built up enough courage to tell the psychiatrists, and they questioned me about them, and I told them what happened, but of course they didn’t believe me. </p>\n\n<p>The police came, and they questioned me too, and I told them the truth, but they didn’t believe me either. It took the judges eight days to rule me for manslaughter, it only took them hours to rule me, guilty by insanity. </p>\n\n<p>So, here I am. </p>\n\n<p>A perfectly normal person, right? </p>\n\n<p>Nope. </p>\n\n<p>I will be spending my life in this mental hospital. </p>\n\n<p>I can survive the therapy sessions and the food, but the only thing that has gotten bad is the spot on my arm. </p>\n\n<p>You see, it&#39;s not really a spot anymore. Over the years, the spot has started to spread. In the first 3 years, it covered half of my arm. Another 3 years, my whole arm. Another 3, my chest. Another 3, my right leg. At the end of the next 3, up to my neck. </p>\n\n<p>Other people who live here think it&#39;s a tattoo. The doctors don’t know what it is, but they don’t care, only if it isn&#39;t harming me. </p>\n\n<p>The spot isn&#39;t harming me. It&#39;s infecting me. </p>\n\n<p>I can feel the spot moving sometimes, shifting across my skin, as if it is alive. I can hear whispers and scratches in the middle of the night. </p>\n\n<p>That day when the monster killed those bullies, I think a part of itself latched onto me, trying to turn me into the monster. </p>\n\n<p>The eye on the spot is in the center of my chest now. Sometimes it blinks, and I can feel it too.  </p>\n\n<p>A 23-year-old with a monster infecting him, how nice. </p>\n\n<p>I am scared too. </p>\n\n<p>If the monster takes over, what happens to me? </p>\n\n<p>Will I just die, or will I control the monster? </p>\n\n<p>That I don’t know, but only time will tell... </p>\n</div>\n","author":"Dan100903"}