{"rank":"127","title":"An App Called Autopilot (Part 1)","id":"8ktxdr","url":"/r/nosleep/comments/8ktxdr/an_app_called_autopilot_part_1/","time":"1526836050000","body":"<div class=\"md\"><p>I’m going to just cut straight to the chase. I found an app that lets me skip time, kind of. I know, crazy right? I wouldn’t have believed it either if I hadn’t experienced it for myself. </p>\n\n<p>A bit of background really quick. My name is Zach, I work graveyard at a food stocking company. We deliver to local movie theaters, convenience stores and the like. I’m not exactly what you would call, passionate about my job, but it pays the bills. Recently though I’ve just been in a bit of a rough patch. </p>\n\n<p>I try to be optimistic about things. For some time now though a grey cloud has just been clinging to me. I just get lost in a typhoon of self-loathing and apathy. It’s only while I’m at work though, outside of there I feel great. I think a lot of it stems from a combination of overly long shifts which can sometimes last upwards of sixteen hours, incompetent and idiotic management and a nocturnal schedule messing with my circadian rhythm. </p>\n\n<p>I don’t know how exactly this all came about. I was watching YouTube late into the night about aliens when I found it. Somehow, I stumbled upon what appeared to be a self-help video in that strange part of YouTube that we all arrive at eventually. The guy who made it basically buttered me up like a waffle right out the gate.</p>\n\n<p>“Are you tired of working a meaningless job? Tired of wasting your time for a company who would replace you in no time if you dropped dead? Feeling underappreciated and overworked with little hope for improvement?”</p>\n\n<p>Yes, to all of the above. I swear the dude was reading my palm or something. I thought for sure he was about to reveal his pyramid scheme, get rich quick type of scam, but his next question caught me off guard.</p>\n\n<p>“Do you wish you could just skip past the boring parts of life?” I thought about it for a moment. Yeah I do wish I could do that, but it’s not like I’m Adam Sandler from Click.</p>\n\n<p>“Well my friend, have I got the app for you.” Ahh there it is. Now’s the point which I enter my credit card details and buy some shitty self-help app right?</p>\n\n<p>“Autopilot. For when the remedial parts of life become too much to manage.” The graphic on the video turned to a basic icon of an app with an airplane. In the plane was a small squirrel looking character, with a wide smile on his face, aviator glasses and a “thumbs up” gesture. </p>\n\n<p>“Autopilot is specifically designed to allow your brain to complete things it has been formally trained to do, with the absence of higher cognitive function. The body continues to operate on muscle memory, with no need for coherent thought process. Time will fly by extraordinarily fast, with hours passing in what will only feel like seconds to the user.”</p>\n\n<p>I couldn’t help but scoff at the concept. It’s not as if something like this could actually work right? An autopilot mode for your brain? It seemed too good to be true. I scrolled down to the comments section and saw the number indicating that over 100 people had commented. I thought for sure all of them would be lambasting the creator of the video, but to my surprise the opposite was true.</p>\n\n<p>“This is incredible! Thank you so much!”</p>\n\n<p>“This app has changed my life, I cannot thank you enough.”</p>\n\n<p>“Best app ever created, I love it!”</p>\n\n<p>Their comments surprised me, but I figured it must just be bots programmed to heap praise for the sake of marketing value. I scanned through dozens of them, and not a single one could be construed as in any way negative. Unheard of for YouTube comments sections. Well okay there was one comment which seemed negative, I guess.</p>\n\n<p>“Eat ass.” It read. There’s always at least one. The users seemed genuinely thankful for the app and I began to wonder if this wasn’t just the work of trolls or in some way related to a meme which I wasn’t aware of.</p>\n\n<p>I let the rest of the video play and watched closely. The disembodied enthusiastic voice proceeded to state that the concept used a sort of hypnosis induced via binaural beats to achieve the autopilot mode. Upon opening the app, the user would first set their preferences and activate the tone. The session lasted about 6 minutes, and after which the user would supposedly enter the autopilot mode. They would retain all motor functions, intuitive ability and even personality. All without being consciously aware of what was transpiring. The user would set a clock to a predetermined interval like 8 hours or 12 hours. After which a tone would play and nullify the effect, and the user would regain full consciousness once again. </p>\n\n<p>The concept intrigued me, and I’ll admit it sounded at least somewhat legit. I’m sure a bit of my own confirmation bias was at play as well, because I truly wanted it to be authentic. With yet another week of loathsome work on the horizon, I decided ‘screw it, I’ll give it a shot’. </p>\n\n<p>I searched the same video on my phone and clicked the link for the app in the description. It rerouted me to a couple different tabs. Eventually I was given a prompt notifying me of the download. I pressed accept, and moments later I saw the same app with the grinning squirrel downloading on my home screen. A few minutes later and I was good to go.</p>\n\n<p>I pressed on the app once it had finished and was prompted by my phone’s security stating that the app was from an untrusted outside source. Without hesitation I pressed the ‘trust’ button and the app opened.</p>\n\n<p>A page loaded with a brief introductory paragraph welcoming me to the app and explaining its features. That same cartoon squirrel was imprinted on the background of the image, smiling away with his signature thumbs up gesture. I chuckled to myself, sure that I was being played as a fool, but still nonetheless curious.</p>\n\n<p>I decided to perform a trial run before committing to anything long term. I set the alarm clock to ten minutes and put my headphones in while also noting the time to be 12:37 AM. The strange sounds began moments later. It started as a low single note hum, like the droning sound of an elevator as it passes through floors. It was kind of annoying at first actually. After a minute or two audible sounds of distortion began with a sort of rippling effect intermixed. It’s hard to describe, and honestly sounded like gibberish.</p>\n\n<p>It continued that way up until the ending getting more distorted and adding in random clangs of something at varied intervals. My mind kept trying to pick up on the beat of it and maintain the rhythm, but I found it impossible. I don’t have much experience with binaural beats, and don’t even know if they work like that, or at all, but still my mind attempted it. At the end of the trippy opera, a weird bubbling or almost gurgling sound played before it cut out. I’m not sure about this last tidbit, but at the very end before the sound faded, I thought I heard the distorted voice of someone speak.</p>\n\n<p>Next thing I know, the blaring of an alarm began to sound, breaking me from my trance and nearly making me piss myself. I look down at my phone, and realized the racket was coming from the timer I set on the app. I dismissed the alarm, and noticed the time to be 12:53 AM. Sixteen minutes had passed. Six of them for the audio hypnosis and then ten more of… well I don’t know. It was a blank spot in my memory. Did it work? Or was I just so zoned out that I hadn’t realized the time had passed? The experience was odd, but soon I was again distracted by random videos about strange creatures and shit.</p>\n\n<p>The next day arrived, and begrudgingly I set off for work and another dreadful week. I arrived early and proceeded to eat my subway sandwich in my car and contemplate the usual existential dread. I scrolled through various things on my phone, and again my eyes met with the Autopilot app.</p>\n\n<p>I thought about the experience with the night before and wondered again if it was genuine or not. Could it really be that this app was actually capable of what it claimed? I didn’t know, but in that moment, I decided to truly find out. I set the alarm for 2 hours to coincide with my first break, and put my headphones in.</p>\n\n<p>“Breeeeeak time.” The voice of Steven resonated over the intercom throughout the warehouse. I gasped in a moment of stupor, confused as to what had just happened. I checked my phone and silenced the irritating alarm and sure enough; 6:01 PM; two hours into my shift. I glanced around and found myself alone in the aisle towards the back of the warehouse standing on my pallet jack. </p>\n\n<p>My job basically involves picking items for our customers’ orders and assembling them into pallets. There’s about thirty of us or so on nights. We have these sort of rideable pallet jack scooter things that we all use to expedite the process. Most guys just grab their jack or forklift, toss in their earbuds and get to work with little interaction shared between us all. Not a very team orientated job for the most part. </p>\n\n<p>What the hell had I been doing for the past two hours? Behind me two large pallets sat on my jack’s forks stacked seven feet high with popcorn bags, soda bibs and various other snacks. I guess I’d been doing something. </p>\n\n<p>I dropped the two pallets, and sped off towards my car for break; almost giddy with excitement. It seemed as though this obscure app had actually delivered on its promise. I returned to my car, heart pounding and mind racing with possibilities. I sparked up a cigarette and tried to recall the events of the last two hours, but to no avail. I had no memory whatsoever.</p>\n\n<p>The management tracks our progress on our scan guns in order to determine how long it takes us to complete an order, so if I hadn’t done anything I’m sure I would’ve soon learned about it. But that thought was secondary when compared to the treasure trove I had just discovered. Imagine, an app that can actually alter your perception of time, and there it was right at my fingertips. </p>\n\n<p>Since I have very little regard for my employer, and even less for my own mental well-being, I decided to further test the app. I ran the hypnosis again and set the timer for another two hours. I stepped out of my car just as the audio tone was finishing up.</p>\n\n<p>Next thing I know, I spontaneously regained consciousness again in my car, sandwich in my hands and radio playing Tool’s Rosetta Stoned in the background. I checked my phone and realized it to be 8:16 PM, right in the middle of my lunchbreak. My heart jumped in my chest, as exhilaration took hold. Again, I had no memory of the hours passed, but again I didn’t care. I had successfully programmed my mind to work with the absence of consciousness. I could skip my shifts in an instant and get back to the things I truly wanted to do. The implications were limitless.</p>\n\n<p>I ended up running the hypnosis again, but this time, set the alarm to coincide with the projected end of my shift. Our shifts often vary from day to day depending on the amount of orders, so predicting the clock out time can be difficult. When I regained consciousness, I found myself speeding down an aisle with my jack. I almost crashed actually, as my mind literally jumped from listening to the strange tone to speeding down the aisle in the blink of an eye. My heart was racing again, and two small pallets were on the forks behind me. I finished up the order and soon heard the loveliest words blare through the loudspeakers.</p>\n\n<p>“All orders are out. Make sure to clean your assigned aisle before you leave.” Stephen’s voice called through the intercom. I hurried to finish my order and clean my aisle, but before I left I went to the computer in the office to check my numbers. I had to see whether I had been productive or not.</p>\n\n<p>Upon logging in to the system, I clicked on my order history for the night. I had pulled over 20 orders which amounted to just under 2,200 cases. I couldn’t even hide the smile from forming on my face. Not only had I completed my daily tasks, I had done so with flying colors. The system we use also registers the amount of time required to pull an order and compares it to how long it actually took us to do so. If we maintain a 95&#37; or higher efficiency, then we receive an incentive payment.</p>\n\n<p>Normally I hover between 85 and 90 percent on any given night, not enough for the incentive pay but enough to keep my job. On that night however, I had averaged 107&#37; on all orders. That meant I had pulled my orders faster with over perfect efficiency based on the systems parameters. So not only had I no memory of working, but I had also worked much more proficiently than normal.</p>\n\n<p>Just as I was about to walk out the door for the night though, our manager called a meeting. I sighed, annoyed that he had waited ‘til the last second to discuss whatever it was that was so important. </p>\n\n<p>We all gathered outside the main office as Chris; our manager stepped out. With one look I could tell he was incredibly pissed. I thought that initially strange because he is normally a pretty level-headed guy. Never seen him yell or even really raise his voice.</p>\n\n<p>“Who did it?” Chris asked, almost trembling with anger. Everyone was silent. Chris eyed each and every one of us slowly, clearly upset about something. Finally, someone spoke up and asked what he meant. Chris sighed and rubbed his eyes.</p>\n\n<p>“Someone vandalized the bathroom mirror.” He spoke, a little calmer now. We all just sort of gawked for a couple seconds, expecting Chris to clarify, but he didn’t. </p>\n\n<p>“Look guys, I know things have been stressful lately. We’ve all been working long hours, but this is unacceptable. Whoever did this needs to take care of it. Either cleaning it or paying for a new mirror. I won’t make you reveal yourself in front of everyone but come talk to me and we’ll get it taken care of. If no one does then we will all get heat because of it.” </p>\n\n<p>We all just sort of stood around silently after that as Chris dismissed the crew. Myself and a few others made our way into the bathroom out of curiosity. On the mirror, written in black marker was a single neatly scrawled phrase.</p>\n\n<p>“Evigilare Faciatis.” No idea what that was supposed to mean. A few of us joked about it for a few minutes, but eventually I made my way out and headed home.</p>\n\n<p>I pondered over the weird event on the way home as a subtle feeling of dread entered my stream of thought. Was it me that had done it? I suppose it could’ve been, as I was essentially blacked out for the entire night. However, that theory didn’t hold much water for one reason. My handwriting is terrible, like epileptic preschooler level of terrible. The handwriting of that phrase was pristine, way better than anything my uncoordinated ass could’ve ever produced.</p>\n\n<p>I returned back home, a mix of apprehension and excitement coursing my veins. I did a quick Google search for that phrase and found it to be in Latin. Evigilare Faciatis translates to awaken. That only seemed to raise more questions. </p>\n\n<p>There is one guy at work who is a bit, strange. His name is Clint. He’s kind of, emo I guess, Y’know dark eyeliner long straight black hair and stuff. Not trying to be mean, but he’s just a little different to most people out there, doesn’t exactly fit in either. He’s pretty quiet most of the time, and there’s no doubt he’s probably into some weird shit.</p>\n\n<p>I tried searching for the video again but had no luck. I typed “autopilot app” into Google to try and get more info, but I wasn’t able to find anything related. I found that sort of strange, but at least I already had it downloaded.</p>\n\n<p>I guess that’s also what brought here in the first place. Have any of you guys ever heard of this app or experienced something similar? I would love to know your thoughts. I wish I could give the link to download it for yourselves, but again I can’t find it. If I do through, rest assured I will share it.</p>\n\n<p>I of course plan on continuing to use this app, and figure this will be a good place to record my experiences. It’s Sunday morning now, and the sunlight has just begun creeping over the horizon. I guess I should get some sleep. Talk again soon.</p>\n</div>\n","author":"zachariusfrost"}