{"rank":"218","title":"Floaters","id":"8ku8o5","url":"/r/nosleep/comments/8ku8o5/floaters/","time":"1526838795000","body":"<div class=\"md\"><p>We sat in stony silence in the waiting room, two obstinate statues amidst a whirlpool of activity. Not all the children there were sick, after all. Sure, some clung to their parents like stubborn shellfish, moaning and groaning as fevers and other ailments rocked them. But there were others who were lively enough to make friends with each other, or explore the adjoining play area, complete with bright toys and cheerful wallpaper. A couple of the other parents tried to connect with me, such as by making eye contact or asking if we had waited long, but I rebuffed them all with a firm and icy smile. </p>\n\n<p>Eventually, I felt a tug from Ethan. I tightened my grip on his hands, though I could not tell if it was out of concern or frustration. He grimaced in pain, but I did not relent. </p>\n\n<p>&quot;Stop rubbing your eyes,&quot; I said. &quot;The doctor&#39;s not going to help you if you don&#39;t listen.&quot;</p>\n\n<p>&quot;I&#39;m not rubbing! And you&#39;re hurting me, mummy!&quot; </p>\n\n<p>&quot;If I let go, will you promise me that you&#39;ll keep your hands away from your eyes? I don&#39;t want to even see your fingers go near them, understand? You’re a big boy now, you’re almost seven years old already. Ethan? Do you understand me?”</p>\n\n<p>&quot;Yes, mum.&quot;</p>\n\n<p>Ethan did as he was told, and folded his hands under his thighs. I turned to look at him, but he was already facing away, his way of telling me that he was upset at me. The sheer absurdity of the situation struck me then - here I was, trying my best to keep him well, and yet instead of showing gratitude or appreciation, he had somehow turned it around and made it seem like I was the bad one? Was it too much for a parent to implement rules to keep their children safe?</p>\n\n<p>I held his chin and turned his face back to me. He looked away, refusing again to meet my eyes. My heart ached at what I saw – raw and broken skin, two circles of plush purple, starting just under the eyebrows and ending just above the cheekbones. The uneven texture of the bruised flesh brought to mind an image of coral reefs, with their sandy and hive-like consistency. But it seemed like Ethan had been keeping his promise to me, for I also spied the pinkness of new tissue peeking out from beneath the surface, suggesting that he was letting his injuries heal. The sclera of his eyes was also a pristine white, and not the veiny-red I was used to seeing the past days.</p>\n\n<p>“You know I’m asking you to do this for your own good right?”</p>\n\n<p>“Yes, mum.”</p>\n\n<p>“And you’re going to hear it straight from the doctor yourself, alright? That it’s completely normal, and there’s no reason why you should be hurting your eyes that way. It happens to everyone, not just you.”</p>\n\n<p>I heard an electronic bell tinkle overhead, followed by the nurse calling out our names. “Tania and Ethan Hawford? The doctor is ready for you.”</p>\n\n<p>I leaned in and planted a kiss on Ethan’s forehead. If Ethan wouldn’t listen to me, maybe he would come to his senses after the consultation.</p>\n\n<hr/>\n\n<p>Dr Keith Ober held up a hand and motioned for me to calm down. That was when I realized I had been speaking non-stop throughout Dr Ober’s inspection of Ethan, the dam within me torn down by his simple request for me to tell him what had happened. Weeks of frustration, compacted by Ethan’s helplessness with his perceived condition, had erupted in a towering geyser of woe. So much for self-control. I had expected Ethan to be the blubbering mess, not me. </p>\n\n<p>“Now, if you would like I can run some more tests,” said Dr Ober. “But from where I stand, you shouldn’t be worrying too much. His eyes seem fine to me. Sometimes, what we do not know scares us, and in your case I believe that Ethan was just reacting the only way he knew to. And don’t worry about the scabs, either. We’ve got a gel that will help it heal with minimal itching. Would you mind if I asked him a few more questions, try to understand where he’s coming from?”</p>\n\n<p>“Please do,” I said. “Ethan? The doctor’s going to help you understand that everything you’ve been seeing is normal, ok?”</p>\n\n<p>Dr Ober reached into his drawer to retrieve a lollipop, then pressed it into Ethan’s hands. That broke a little ice between the two, and Ethan hesitantly looked up at Dr Ober. I expected Ethan to flinch away again, break eye contact, but instead I noticed the tension seeping from his body. Ethan was relaxing, and I felt a pang of jealousy at that. Ethan had studiously been avoiding my gaze for the past few days, and it pricked me to know that the doctor had bridged that gap of trust so easily.</p>\n\n<p>“Ethan, your mother has helpfully told me what it is that you have been seeing. But I want to hear it from you. Would you describe them to me?”</p>\n\n<p>“I… don’t see anything, doctor. Nothing.”</p>\n\n<p>“Now, Ethan, there’s nothing to be worried about. I’m not here to scold you or tell you you’re wrong. I just want to know what is troubling you, and if I can help you, I will.”</p>\n\n<p>“I… ok, doctor. I just… see these shapes, floating. Floating over whatever I see.”</p>\n\n<p>“Do you see these shapes floating all the time?”</p>\n\n<p>“Not all the time, just… sometimes.”</p>\n\n<p>“Like when, Ethan? When do you see them? In the morning? At night? After you have run around a bit, maybe?”</p>\n\n<p>“No, just… whenever. I don’t know when. Sometimes they come, sometimes they don’t.”</p>\n\n<p>“And did you have any fall recently, Ethan? Maybe hurt your head in any way?”</p>\n\n<p>“No, doctor. I’ve only been rubbing my eyes, just as mummy said.”</p>\n\n<p>“And why do you rub your eyes?”</p>\n\n<p>“Because I want these floaters to go away. I want them to <em>go the hell away!</em>”</p>\n\n<p>It wasn’t the fact that Ethan had used a curse-word which shocked me. It was the way the anger had caught flame in his little body, the way his fist had tightened over the lollipop. He now sat with his back straight, his free hand clenched on the doctor’s table for emphasis. His lips were drawn in a tight line of annoyance I had not seen before.</p>\n\n<p>I had clearly misjudged how strongly this was affecting him.</p>\n\n<p>“Does rubbing make them go away?”</p>\n\n<p>“Sometimes,” he said. “I hate them and I wish I never saw them!”</p>\n\n<p>“Ethan, I want you to listen to me very carefully, do you understand?” asked Dr Ober, who had slipped on a mask of tranquility. “It is normal for all of us to see these… ‘floaters’, from time to time. You shouldn’t be seeing so many of them, especially since you’re still young and there are no injuries I can detect. But maybe you can see some. It’s normal, trust me.”</p>\n\n<p>“Everyone can see them?”</p>\n\n<p>“See what I told you?” I said. “Honey, mummy wasn’t lying to you. Everyone sees them from time to time, just as I said. The doctor’s not lying to you. Why would he?”</p>\n\n<p>Dr Ober smiled, then held up a diagram of the human eye on his iPad. “See here, Ethan? <em>This</em> area is full of a kind of liquid in the eye, to help it keep its shape. Sometimes, there are little protein fibers in this liquid, which may seem like floaters to you.”</p>\n\n<p>“And do the floaters stick to certain people only?”</p>\n\n<p>Dr Ober had prepared a reply, but the specificity of the question had evidently unsettled him, just as it did me. Dr Ober glanced my way, but I shook my head. This was new to me too. Ethan had never brought this up, not once in the many conversations we had had on this topic.</p>\n\n<p>“What do you mean by that, Ethan?” said Dr Ober. “Would you explain to me what you mean?”</p>\n\n<p>“I… I cannot. I will get in trouble.”</p>\n\n<p>“Why would you get in trouble? No, you’re safe here. You can tell me what’s on your mind. Right, Miss Hawford?”</p>\n\n<p>I nodded, then held out my hand, palm up. Ethan took a deep breath, then placed his hand in mine. “Papa told me that I was special, and that only the men in our family ever got to see these things. He said to tell only him if I saw them, and then he would help me deal with them. He said not to tell anyone else.”</p>\n\n<p>The instinct to slap Ethan there and then was overwhelming. There’s a pain which comes from knowing that your own child has lied or kept the whole truth from you. That pain is made even more exquisite when you know that a man you once loved and trusted had put that child up to it. A thousand gears shifted in my head as I rearranged my memories from the last few weeks – suddenly, it all seemed so clear. The answer had been staring at me all along.</p>\n\n<p>It was the visit in the first week of August, when the leaves had first shed their greens for the trendy yellows and oranges of the season. When his father had dropped by without notice, casually pressing the doorbell as if he were returning from a grocery run instead of his year-long hiatus from our lives. I would have refused him entry, but Ethan had spotted him, and against my better judgment I had let them briefly reunite. He must have whispered that poison in Ethan’s ears when I wasn’t looking, that snake.</p>\n\n<p>“What did he say to you? Tell me! Tell me everything!” </p>\n\n<p>“Miss Hawford, please, let the child speak at his own pace. You promised him that he could tell you without getting reprimanded for it. Please.”</p>\n\n<p>Dr Ober was right. I took a deep breath, then tried again. “I… Ethan, I’m sorry, ok? Mummy’s just… you know how daddy’s too busy with his work for us? That’s what got me angry, that’s all. I’m not angry at <em>you</em>. But I want you to know, daddy’s not always right, ok? So whatever he’s told you… just tell me know. Let it out. And we will help you, I promise.”</p>\n\n<p>Ethan had hunched over by now, sobbing over his lollipop, and he was such a pitiful sight I almost cried myself. “Daddy said… he said that we have special powers, just the men. He said we can see things that other people cannot see. He said not to tell anyone because no one else understands. He said if it happened, I should tell him, but… I didn’t want to tell him. I wanted to cure it myself.”</p>\n\n<p>“What special powers can there be, honey? This is… this is real life. It isn’t a TV show, or a comic, or a movie. People don’t get such powers.”</p>\n\n<p>“But I see them, mummy. I do. I try to forget I see them, but I cannot. They are there whether I like it or not. On the way to school, on the road, at the beach… I don’t want to at all…”</p>\n\n<p>“Ethan, remember that I’m a doctor,” said Dr Ober. “I have spent many years studying the human body. Tell me, what are these special powers your daddy told you about? Maybe I would know something about them?”</p>\n\n<p>A second wind came to Ethan as the logic worked out in his mind. “My daddy told me that… we have the ability to see which people are about to die. These things, the floaters you said… they… fly, fly around and then stick to these people, and only them. That’s what he said to me.”</p>\n\n<p>The recklessness of sharing such utter nonsense with a child was incredible, and I realized I was shaking with a potent mix of adrenaline and indignation. It was one thing to inadvertently expose a child to such baseless tripe, and it was another thing wholly to intentionally warp their minds this way. And to what end? To establish a connection with Ethan? Weren’t there better ways to do that, like say, be a responsible father and help raise Ethan with me?</p>\n\n<p>I gripped Ethan’s shoulders and wrenched him around so hard that his chair legs scraped on the floor. He was startled too, for he did not squirm away this time. I stared hard into his eyes, and I almost choked up with the pain of having to speak so harshly to my own flesh and blood. But I wanted this nonsense to end, once and for all.</p>\n\n<p>“Listen to me, Ethan! That is all nonsense! There’s no such thing as seeing these things which tell you who is going to die or not! No one can do that! Daddy’s wrong, you hear me? There’s no such… thing…”</p>\n\n<p>Ethan was crying then, and my anger bled away as he raised a hand to my cheek. The tenderness in his touch, the pain in his eyes, they completely disarmed me.</p>\n\n<p>“Mummy, there they are again. The floaters… all around you, just you. But I’ll stop them, I promise. I love you, mummy, and I will protect you.”</p>\n\n<p>He pulled away, faster than I ever thought he could move. I caught a flash of the lollipop as it twirled around in his hand, stem-side up. The plastic rammed hard into his open eyes, but instead of piercing the fragile membrane, I only heard loud <em>clacks</em>, the same sound you would get if you slammed an office stapler onto a table. Ethan screamed, a loud, furious release, then stabbed his eyes again, over and over and over. He was a tornado of fury, his arms a heavy-action piston pumping away. </p>\n\n<p>Eventually, his eyes shattered, the exact same way dropped porcelain does. But instead of blood, instead of vitreous fluid, instead of <em>anything else</em> which could possibly issue from a human body…</p>\n\n<p>… I only saw shadows, foot-long eels of cloudy darkness which spilled forth, a torrent of sewage from a forgotten drain. They fell the short distance onto the ground, then splashed around in pain, writhing as the light shriveled them. Like the morning mist, they evaporated before me, leaving me with only memories I would forever question.</p>\n\n<p>Ethan looked at me, with gaping, weeping holes where his eyes used to me. He lunged forwards, then hugged me as tightly as he could.</p>\n\n<p>“You’re safe now, mummy. They are not swarming around you anymore. You’re safe, safe…”</p>\n\n<hr/>\n\n<p><a href=\"/r/rarelyfunny\">/r/rarelyfunny</a> </p>\n</div>\n","author":"rarelyfunny"}