{"rank":"1311","title":"Beautiful Filth","id":"8kumnm","url":"/r/nosleep/comments/8kumnm/beautiful_filth/","time":"1526842228000","body":"<div class=\"md\"><p>Did you know that if you immerse yourself in any smell, you can eventually become inured to it? Even the rankest, most foetid garbage; over time you acclimate, your sensory inputs burn out on that stink, until you are completely desensitised to it. Workers in fish markets smell only fresh air, pig farmers smell only hay and churned mud.<br/>\nHumans do this all the time in our own personal spaces. A chain smoker can’t smell the bitter carbide stench clinging to the fabric of their curtains, sunk deep in the fibres of their yellowing carpet. An obsessive online gamer is completely unaware of the malevolent flatulence and body odour that surrounds him like a sentient fug; his nose is blind even to the acrid tang of stale piss from the bottles building up under his desk.<br/>\nBut <em>filth</em>, real, genuine filth, now that’s a different story. It’s no longer about the smell, it’s how it <em>feels</em>. No matter how long you immerse yourself in abject filth, you can still sense it on your skin, taste it on your fingers, feel it squelch between your toes. The largest organ you possess is your skin, and just under the surface of it are millions of tiny receptors. When you’re soaked in filth, every single one of them is in overdrive, eager to transmit every disgusting nuance to your whimpering brain in exquisite detail. To tell the sensory story of the inescapable crawl of vile desecration covering your body from head to toe.<br/>\n<em>Beautiful</em> filth.</p>\n\n<p>&nbsp;  </p>\n\n<hr/>\n\n<p>&nbsp;  </p>\n\n<p>My depression really started in earnest when the oestrogen surged; when puberty reared its ugly head. The transformation from seemingly cheerful waif to angst-ridden teen happened virtually overnight, distressing me as much as it did my parents. At first, it was written off as ‘normal’ teenage behaviour. But I hated myself. I despised everything I was. The few fleeting ‘good’ things I still glimpsed inside me I deemed to be things I didn’t deserve. They felt like inappropriate gifts stolen from other, better children. The innumerable bad things were the truth of me, the burdens I was forcing onto the world. I felt like a heavy boil, waiting to be lanced, ready to spray the bloody pus of my tainted, rotten self across everyone I loved.<br/>\nTherapy followed the discovery of my diary of self-loathing, not well enough hidden from my obsessively clean mother. I woodenly talked through my poisonous feelings with the therapist – an older woman who smelled of spearmint gum and shoe polish – digging up my shallow-rooted pain just enough that it wouldn’t bed itself any deeper. But some things can’t be cured by talking, and although I stopped writing down my thoughts on paper and learned to smile more, the depression never really left me – it just burrowed down inside me where the tools of my therapist couldn’t reach it, where we could all ignore it for a little while.<br/>\nBut it was still very much part of me when I left home for university.</p>\n\n<p>&nbsp;  </p>\n\n<p>Two semesters passed before the first black buds began to blossom from those buried roots, strangling, spreading vines springing up to choke my mind back into submission. When I failed my first assignment, the old pain flowered fully. I wrote my woe across my arms with razors until one pain eclipsed the other, and my consciousness faded as the pools of bright blood grew. More therapy and cups full of pills punctuated my stay as an inpatient in a private facility – all paid for by my confused parents – but once again, nothing could destroy the black taproot that seemed to be embedded in my soul. Not even tranquilisers and antipsychotics could kill that hardy weed.<br/>\nThey let me return to university in the end, so long as I followed a regimen of appointments and drugs. But as anyone who’s been on a heavy dose of antidepressants knows, there’s a curious fog that accompanies them, making the world greyer, stranger, more distant. It creeps up on you, and before I knew it, it was hard to concentrate, harder to solve simple problems. Scraping through on C-minus grades, I knew that I had to do something to change things, else I was doomed to this fuzzy half-life for the rest of my miserable existence.<br/>\nAnd then providence struck, right on cue.</p>\n\n<p>&nbsp;  </p>\n\n<p>The advertisement in the student hall promised a new kind of therapy. Experimental sensory therapy, with 100% guaranteed results. Looking up their Facebook business page, I was confronted with glowing reviews from dozens of customers, most claiming they’d been cured after as little as one session. Skeptical, I trawled their profiles, looking for indications of fakery. But all the reviewers appeared to be <em>real</em>, no day-old profiles; accounts up to seven years old, filled with all the normal inane fluff of social media.<br/>\nWith very little to lose, I messaged the page to organise a first session. Within seconds, I received a copy-pasted response and an email address to contact to arrange a visit to their ‘specialised therapy facility’. It was almost midnight, but I emailed the mystery therapist immediately, and slept better than I had in months.<br/>\nWhen I awoke I quickly checked my phone, feeling a wash of excitement and relief when I saw they’d replied. An attached document was to be read and signed before I had my first session, which was described as an overnight stay at their offices, under close supervision. There were no details at all about the actual method of the therapy, but I <em>trusted</em> those reviews on the page; there had been something strangely earnest about their praise. Each of them was suffused with a kind of <em>relief</em> that spoke to me on an almost spiritual level.<br/>\nI barely read the document before signing it and mailing it back.<br/>\nTwo hours later I had an appointment date, and instructions to cease all medication two weeks beforehand.</p>\n\n<p>&nbsp;  </p>\n\n<hr/>\n\n<p>&nbsp;  </p>\n\n<p>The building appeared to have been a hotel at some point in its lifetime, with art deco elements still sharp and bold on the repainted frontage. Along with the advice to stop my meds had come other instructions; to eat a full meal before my arrival, and to bring an overnight bag containing clean clothes. The word <em>clean</em> was curiously stressed in bold, and brought to mind the nearly obsessive cleanliness I’d suffered at home with my mother.<br/>\nThe receptionist was a well-coiffed, carefully-costumed study in customer service. Her professionalism set me at ease immediately, lulling away any lingering fears that I’d signed away my kidneys to a black-market surgeon. My therapist appeared quarter of an hour later, a tall, dark-haired gentleman, wearing a pristine navy suit that looked like it had been drycleaned just minutes before.<br/>\n“Ah, excellent. Lovely to meet you,” he gushed, pumping my hand enthusiastically. “Now, you brought a full change of clean clothes, yes?”<br/>\nI hefted my bag in answer. “I did, yes.”<br/>\n“And you’ve had plenty to eat and drink?”<br/>\n“I have.”<br/>\n“Good, good! All in order then. Come with me, and we’ll get started before the morning gets away on us.”<br/>\nHe ushered me down a well-lit corridor, up a flight of stairs, and down another corridor, empty, but lined with identical doors. At the seventh door, he paused, indicating that I should enter.<br/>\n“After you.”<br/>\nThe room was bright. Too bright. I squinted and shaded my eyes with my free hand, registering a single stark chair in an empty, white-walled cell, devoid of fittings or other furnishings. Strong, practised hands pinned my arms, then I was unceremoniously dragged towards the chair before I had the wherewithal to struggle. Howling protests, I felt plasticuffs tighten around my wrists and ankles, even as my eyesight began to adjust beneath the brilliant downlighting.<br/>\nThen, as abruptly as they had appeared, my attackers exited the room in a flash of white uniforms, leaving me alone and tied to the metal chair. I grimly noted the heavy industrial bolts that secured it to the gleaming steel floor.<br/>\nThis was <em>not</em> what I’d expected.</p>\n\n<p>&nbsp;  </p>\n\n<p>I’d been wrong in my original estimation of the room; it wasn’t <em>completely</em> empty. On the wall I was facing was a simple black and white analogue clock, the hands slowly ticking circles around the circumference. The first ten minutes passed with me yelling furiously, promising that I was going to call the cops on them once I got out of here. When that first panic and rage subsided, I realised fearfully that I was in no position to threaten. I went quiet for a while, trying to slow my racing thoughts down enough to fathom what kind of horrible mess I’d gotten myself into.<br/>\nAfter half an hour, I started pleading at the walls, promising to forget about all of this if they just let me go – they could have anything they wanted; I could give them enormous amounts of money, my parents would pay anything for my safe return.<br/>\nThe walls remained silent.<br/>\nI tried not to cry. I didn’t want to give them the satisfaction. But the tears won twice over the next few hours, then again after I chafed my wrists bloody and swollen trying to escape the unforgiving cuffs. The tears stung now, and I tried to wipe my face on my shoulder, failing miserably.<br/>\n“Please,” I crooned, for the umpteenth time. “Please. Please just let me go.”<br/>\nAs the hours ticked by, I tried to fill the time by counting the seconds passing on the clock. I sang, my voice broken to a breathy whisper, using the tick and tock as my metronome. It helped, just a little, to stop me from imagining the worst, to stop my mind from breaking completely. But there was one thing I couldn’t stop, no matter how hard I tried.<br/>\nBiology.<br/>\nAs the pressure in my bladder began to increase, I started to squirm, then to sweat. The beads on my brow became rivulets, tracking more salt through the tear-stains on my cheeks, then dripping off my chin to patter on my shirt. The tiny sound was loud in that room, and only exacerbated my need to pee. Heroically, I held off for as long as I could, clenching my thighs until they ached, before giving in to the inevitable and shamefully pissing my pants.<br/>\nThe instant wet warmth faded quickly, the puddle beneath me cooling on the steel chair, growing clammy and vile. Exhausted by my ordeal, relieved by the emptying of my bladder, I dozed on and off for an hour, until another need began to assert itself.<br/>\n“Please!” I begged again to the hateful walls, “Please let me go. I’ve had enough!”<br/>\nSix hours later, bone weary and sobbing fitfully, my bowels let go. The hot, slimy mess filled my half-dried jeans, and the weight of my own treacherous body mashed the faeces into the fabric.</p>\n\n<p>&nbsp;  </p>\n\n<p>I pissed again at some point in the night, the wetness rehydrating the humid mess in my pants, bringing a fresh waft of shit to my raw nostrils. I no longer wept, I no longer sobbed. My arms and legs burned from the confinement and my ass chafed horribly from the impacted shit drying in all my tender crevices. The white light burned my eyes even through closed lids, the relentless brilliance intensifying every sensation. To relieve my stressed limbs, I twisted this way and that in the chair, struggling to find the briefest stretch of tormented muscle and sinew. But with every movement, I felt the filth in my jeans press and scrape my red-raw flesh, felt it crack and split as the mess found a new direction to ooze.<br/>\nBy the time the door opened and the orderlies uncuffed me, I was near-delirious and weak as a newborn, flopping into their arms. They carried me out of the room, opening the door directly across the corridor and pushing me inside. I sprawled on pristine white tiles, gasping in the scents of citrus and rose, my ringing ears registering faint choral music.<br/>\nI noticed the shower first, then the incredible array of cleaning products, fluffy white towels and white bathrobes. Animal-like, I wriggled out of my crusted clothes, then crawled across the floor and pulled myself into the shower, wrenching the handle. Blessedly hot water gushed down over me, washing away the filth and the pain.<br/>\nI don’t know how long I just sat there, soaking, letting the water wash away most of the disgusting mess clinging to my nethers. Then as my equilibrium was slowly restored, I started washing myself with the scented bodywashes and lotions arrayed on the wide shelves. I scrubbed every inch of my body until I was weeping forcefully with abandoned relief.<br/>\nThe water stayed hot. It must have been a good two hours later when I finally shut off the tap, and pink and clean, dried off with the exquisite towels and donned one of the bathrobes. On cue, the dark-haired therapist opened the door and placed my overnight bag on the floor.<br/>\n“How do you feel?”<br/>\nEmotions fought inside me; remembered rage, desperate panic, hot shame and crawling revulsion. But over the top of it all, right at the top of my mind, lay the serene release granted by my escape from the filth; those two hours of heavenly basking in what felt like the cleanest place on earth.<br/>\n“I feel amazing,” I admitted, surprising myself.</p>\n\n<p>&nbsp;  </p>\n\n<p>As I was taken downstairs and the glass doors of the facility came into view, reality began to reassert itself. I’d been <em>tortured</em>, I reminded myself, through the haze of bliss clouding my mind. I’d been tied to a chair and forced to shit and piss myself like an animal.<br/>\n“The first session is free,” the therapist said, a gentle hand on my elbow, guiding me to the door, “but we can discuss the fees for future therapy later.”<br/>\nEven though I didn’t actually <em>feel</em> angry, I knew I <em>should</em> be angry, so I jerked my arm out of his grasp.<br/>\n“You’re lucky I don’t sue you for this,” I snarled, snatching my drycleaned clothes from the hands of the receptionist.<br/>\n“I’m sorry you feel that way,” the therapist replied, nothing but calm and measured, “but I’ll email you a follow up package, in case you change your mind.”<br/>\nI wept yet again on the drive home, huge, sobbing howls of exhaustion, released pain and suppressed emotion. But even as I cried, I realised how strange it was that I couldn’t really remember what it had felt like in that room. How those two hours of clean, heavenly bliss dominated the entire experience.<br/>\nBut whatever happened next, I knew that I sure as hell wasn’t going back.</p>\n\n<p>&nbsp;  </p>\n\n<hr/>\n\n<p>&nbsp;  </p>\n\n<p>Four weeks later, still off my antidepressants, I started to feel the black dog lurking, snapping and gnawing at the base of my skull once again. My work had improved since I’d come off the drugs, everything seemed clearer. <em>Cleaner</em>, even. But as the end of the semester approached and exams loomed, that familiar panicky anxiety wracked my nights, keeping me awake.<br/>\nIn my inbox sat an unopened email from the therapist, Doctor Muar – an email I’d promised myself I wouldn’t read. But I couldn’t deny that the traumatic therapy had somehow <em>worked</em>; for just over a month, it had given my mind a kind of blissful equilibrium, a quietness I hadn’t known since I was child. Tapping open the message, I skimmed the preamble and got to the meat of it, finding a warning not to try the therapy at home myself, that it only worked in controlled conditions.<br/>\nOf course, that meant I was going to try it myself – why would I pay several hundred dollars to be tied to a chair and shit myself in a converted hotel, when I could do the very same thing in my own bathroom?<br/>\nSurrounding myself with shower products and the promise of clean fluffy towels at the ready, I stripped, and sat in the shower. Reminding myself that this was therapy, I let go; let the warm shit squeeze between my buttocks and mash itself against my skin. Scraping up a reeking handful, I rubbed it on my thighs, even as I started urinating, stirring the mess beneath me together until I was far more filthy than I’d been in the room.<br/>\nFor a long time, I sat there, stinking, waiting, my lower half plastered in my own filth.<br/>\nBut it wasn’t the same. There was something <em>missing</em> from this experience.<br/>\nFrustrated, I turned on the water and washed myself thoroughly, trying to recapture that moment in the hotel.<br/>\nBut I felt <em>nothing</em>.<br/>\nWrapped in clean towels, sitting on the edge of the bath, I grabbed my phone, and hurriedly replied to Doctor Muar’s email, asking for a second appointment.</p>\n\n<p>&nbsp;  </p>\n\n<p>All perfect white smiles, the doctor and the receptionist greeted me warmly. Another client was just leaving – her scrubbed pink face a study in rapturous joy. I felt a stab of jealousy as she passed me, wafting citrus and rose.<br/>\n“So lovely to see you again!” Muar declared, genuine caring interlacing his words, “let Rochelle take your bag, then we’ll head up to your suite.”<br/>\nBy the time we reached the door of my room, I was shaking so hard I could barely grasp the handle.<br/>\n“It’s fine,” the doctor told me, “the second time can be difficult. What you’re feeling is completely normal.”<br/>\nReassured, I took a deep breath, then opened the door and walked into the room.<br/>\nHands grasped me and pinned me, while two other pairs began to tear off my clothes. I yelped in surprise and with a flash of embarrassment, but tried to calm myself – this was obviously just the next level up from what I’d originally experienced. Stage two of the therapy. It would be worth it.<br/>\nWhen I was naked, I was cuffed to the chair. The orderlies didn’t leave; I blinked as they also began to strip off everything they wore, except for the white hoods of their uniforms, which concealed their faces. Two men, one woman, they nodded to each other, then began their real work.<br/>\nThe first man grunted as he squatted and pushed out a sloppy turd, slightly green, and stinking like silage. Scooping it up, he began smearing his steaming shit all over my bare skin, painting my naked breasts, my thighs, my arms and legs. When his crusted fingers brushed my chin, I gagged, vomit rushing from my stomach and over his arms and into my lap. A second wave of frothy vomit followed the first as the other man began pissing forcefully into my hair. The briny, acrid urine dripped down my neck, cutting yellow trails through the faeces all over my chest.<br/>\nFinally, as I whimpered and gagged at the smells and sensations, the woman reached between her thighs and expertly extracted a brimming moon cup, from which she carefully painted my face with hot, pungent menstrual blood.<br/>\nThere was no vomit left, just bile, which burned as it came up.<br/>\nSatisfied, the trio left me there, shaking and retching. The ticking clock was my only diversion for the next 24 hours.</p>\n\n<p>&nbsp;  </p>\n\n<p>Twice the orderlies returned to refresh the excrement smeared all over me. The first time the door opened, I thought my ordeal was over, and I wailed with relief, the mask of stinking blood cracking into flakes on my skin. My disappointment when they disrobed was visceral, and I fought in the chair for freedom.<br/>\nThe second time, I just let them paint me with their filth, broken and resigned.<br/>\nOn their third entry they cut the plastic cuffs and carried me across the hall. I lay sprawled on the tiles of the heavenly bathroom, gaping like a landed fish.<br/>\nAs the soft strains of choral music began, I pulled myself into the shower with the desperation of an addict, grabbing bottles and loofahs to my chest. A weak, animalistic noise of pleasure ripped from my throat as the hot water began to pound down on my defiled skin, searing away the filth.<br/>\nI scrubbed myself nearly raw, every inch of my body, using every soap, lotion, oil and cream. My hair I washed thrice, until it squeaked between my fingers, glowing from all the sweet products I’d poured into it. Finally, I just stood under the ring of hot water, letting it prune my over-sensitised skin. My body shook with a pleasure that was nearly sexual as I washed away the memory of the room of filth.<br/>\nWhen I stepped out of the shower, I was greeted by the waiting doctor Muar. I hugged him, dripping and naked, whispering ‘thank you’ into his ear, over and over and over again.<br/>\n“Let’s get you into your clean clothes,” he said, gently prising me off him, “I think this session was a huge success.”</p>\n\n<p>&nbsp;  </p>\n\n<p>I’m sure that for some of the other patients, their story ended with that second session, that after two ordeals, they were cured for life. I think about that sometimes, wondering what that would have been like. But with depression as soul-deep as mine, there could only be one cure; and that could only come by escalating my therapy.<br/>\nI lasted six months before I called on my therapist again. Five of those months were bolstered by the precious, pervasive memory of being so incredibly <em>clean</em> after twenty-four hours of abject filth. I clung to the memory like a lover, fixing it in my mind whenever I felt the darkness within rising, using it as a bulwark against the black thing inside me.<br/>\nMuar sounded surprised when I contacted him, but readily agreed to another session.<br/>\n“We do have another level,” he explained, “for people like yourself, who find that the first two don’t quite do the trick.”<br/>\n“I’d like an appointment as soon as possible.”<br/>\n“We’ll make the arrangements, then get back to you,” Muar promised.<br/>\nThe two weeks I waited felt like an eternity, the anxiety and anticipation building inside me. Speculation thrived in my mind during that time, my imagination working overtime, conjuring visions of what they might be preparing for me. A bathtub of diarrhoea? A swimming pool full of cold, stale piss?<br/>\nNo, it wouldn’t be either of those, nothing like that. It would be far worse, I knew it.<br/>\nI stopped showering in anticipation, letting my own layers of filth build up, so that the final act of my therapy would be even more potent.<br/>\nWhen the day of my appointment finally came, I shat myself on the drive over. I couldn’t stop smiling as the reek filled the car; delicious filth, priming me for the ultimate experience in the hotel room.</p>\n\n<p>&nbsp;  </p>\n\n<p>If either Muar or Rochelle noticed my unkempt state or the smell of fresh shit on me, neither broke character, treating me with the same care and attention they showed the first two times. My bag of brand new clothes, still in plastic wrapping, was taken from me, and I was escorted through the first familiar corridor; but then <em>down</em> several flights of stairs.<br/>\n“This suite is unique. It has to be kept isolated from the rest of the facility,” Muar explained as we descended, and I felt an electric thrill as he led me into a short corridor, adding “you’ll see why, soon enough. Now, I’ll get you to remove your clothing before you enter this time. It’s easier that way.”<br/>\nWith trembling hands, I began to disrobe – but it wasn’t fear that made my hands tremble, it was <em>excitement</em>. As the last stinking sock came off, Muar gestured to the only door.<br/>\n“When you’re ready.”<br/>\nOpening the door revealed a short vestibule – like an airlock – with another door at the end. Muar closed the first door behind me as I reached the other portal. I yanked it open with abandon, shivering at the unanticipated and beautiful horrors that surely awaited me inside.<br/>\nThe smell hit me like a physical blow, so forcefully that I staggered, clutching at my nose. Ripe garbage, rotting in the heat on a sizzling summer’s day, but amplified immensely. I vomited eagerly, letting it flow freely down my chin as I surveyed the place I’d be staying in for the next 48 hours.<br/>\nThe room was large, and the garbage was waist high. Some areas were loosely packed, some so dense you could barely push through it. I waded into the kingdom of filth, clouds of fat flies buzzing up to welcome me, their mouthparts eagerly seeking out the fresh vomit on my skin. I felt decomposing vegetables burst underfoot, slipped on slimy nappies and rotting meat. Boils of maggots squirmed between my toes as I moved towards the centre. Used condoms and sanitary napkins stuck to my bare flesh like leeches, fetid brown bones poked my thighs.<br/>\nAs I stood in the midst of all that delicious filth, a gurgling came from the ceiling, followed by a rank belch of brown effluent from above. The trickle quickly turned into a splattering shower of raw sewerage – likely pumped directly from the sewers themselves – containing the combined filth of the city.<br/>\nSmearing it over myself like a balm, I lay back in the wriggling, humid filth and let it cover me completely, any revulsion chased away by the knowledge of the bliss awaiting me once my time in the room was done.</p>\n\n<p>&nbsp;  </p>\n\n<p>The holes in the roof sprayed the room fitfully with more sewerage, and occasionally a chute delivered a slippery rush of fresh garbage. I slept in the filth, I writhed in the filth, I <em>ingested</em> the filth. Hungry, I ate glistening strings of rotting meat, heedless of what it might do to my body. An hour later I vomited it up, dehydrating myself. As if on cue, a bottle of clean water clattered down the chute, and my greasy fingers ripped off the cap to drink. I knew that I wouldn’t endure my time here if I didn’t rehydrate.<br/>\nI alternated between dozing, wading and showering under the sewerage holes, lazily swatting glutted flies against my crusted flesh, smiling at the crunch of their bodies, at the little streaks of pus and blood they left behind. When my time finally came, when the gas-masked orderlies in biohazard suits grabbed me, I fought like a demon of corruption, ripping the mask off one man, howling with delight as he puked all over me.<br/>\nEventually they dragged me from my garbage nest, throwing me into another room down the subterranean corridor. The sweet music sounded alien at first, caressing ears grown so accustomed to the buzz of flies and the splatter of watery shit.<br/>\nI’m not ashamed to say that I orgasmed as the hot, clean water assaulted the cocoon of filth built up in layers on my skin. And as the layers dissolved, the pleasure continued; how many more times I orgasmed, I have no idea, I just rode the building waves. My knees shook, my feet twitched, I ended up lying on the pristine tiled floor until I recovered enough to start lathering myself with lavender scented soap, scrubbing the crusted filth out from under my nails.<br/>\nTime stretched into a meaningless concept as I went through the ritual of cleansing myself, the steady rain of never-ending hot water as heavenly as the warm wings of angels enfolding me.<br/>\nMuar and my clothes were waiting when I finished towelling off, a curious smile animating the man’s handsome features.<br/>\n“Congratulations on completing your therapy, Ms Jacobs! Please, take some time to relax in our clean lounge. Have something to eat and drink, then we can debrief and talk through your experiences.”<br/>\nMy empty stomach gurgled in response, and I followed him eagerly.</p>\n\n<p>&nbsp;  </p>\n\n<hr/>\n\n<p>&nbsp;  </p>\n\n<p>Nearly three years, that treatment held. Three <em>great</em> years.<br/>\nI graduated with honours, got a job in the industry, and moved into a spacious apartment. I never dated, being totally uninterested in romantic or sexual ties, but I partied, socialised and travelled, filling my Instagram with smiling selfies and enviable experiences.<br/>\nWhen the black weed began to emerge from hibernation, I tried to ignore it at first, explaining each blip in my mood away as something else. Anything else. But as anyone with chronic depression knows, that feeling is unmistakeable – depression has a <em>flavour</em> unlike anything else, unique and cloying. The grey ash of it is a suffocating numbness coating the tongue of your mind.<br/>\nWhen my email to Muar bounced, I swore, loudly and profanely. The Facebook page still existed, but it hadn’t been updated for over two years. Two visitor posts showed for the last 18 months, both asking if anyone knew what had happened to the clinic.<br/>\nWith sweaty palms, I drove over to the hotel. It was closed, a tattered health warning plastered across the glass doors.<br/>\nAngry and desperate, I squashed my face against the glass and peered into the empty reception, dark and dusty.<br/>\nIt appeared that I needed to take matters into my own hands.</p>\n\n<p>&nbsp;  </p>\n\n<p>I’m not going to tell you where the room is. Suffice to say, it’s secluded; nowhere that anyone can smell what I’ve created. The walls are thick concrete, and I’ve filled it with things that even Muar and his team couldn’t contemplate. Roadkill reclines in pools of abattoir runoff, piles of dead animals and dog turds fester under the heat lamps I installed in the ceiling. The medical waste from the hospital is bought dearly, through bribes curated with excruciating care. Luckily for me, healthcare assistants and orderlies are paid very poorly for their service.  I don’t know if you’ve ever smelled liquid shit bubbling with C. diff, straight from the hospital isolation wards, but it’s truly piquant. Acquiring sheets soaked in the stuff was difficult, but definitely worth it.<br/>\nParasites and worms of various species thrive in my altar of desecration, the worst nature can offer in the way of filth, all of them ravenous, devouring the stinking banquet and squirting out something even <em>worse</em> from their profane anuses. Sometimes an animal goes in alive, only to die slowly from infection. The ripe boils of pus and black blood riddle their flesh until the corpse bloats and finally explodes, showering the room with more glorious filth.<br/>\nI’ve only sourced one human body, so far. I can’t tell you how, but my piece de resistance is buried deep in the centre, gangrenous and swollen, waiting for my heavy feet to punch through its taut piñata skin and release the reeking sweetness of organ-slurry candy.<br/>\nNow that it’s ready, now that the defilement is as thorough as I can possibly create it, I will enter the room and spend some time letting it get to know me. The timer on the door is set for a random period, between two days and two weeks. Even <em>I</em> don’t know how long my confinement will be.<br/>\nBecause that was the secret of the therapy, the reason why it never worked in my own shower: you have to surrender control to an external force; you have to <em>not know</em> how or when your ordeal will end.<br/>\nI know that there is the very real possibility that I’ll die in that room, that my font of filth will take my life, corrupting me from the inside, until I’m truly and forever part of it.<br/>\nBut oh, if I <em>live</em>! If I manage to survive, if I claw myself into the gloriously clean bathroom on the other side, then I know, I just <em>know</em> I will be cured. No darkness, no madness, could survive this final therapy, not even the hardy roots of the terrible black weed hooked through the most intimate fabrics of my mind.<br/>\nWhen I emerge, I will be new, whole, pure, and sane.<br/>\nReborn in Beautiful Filth.</p>\n</div>\n","author":"Cymoril_Melnibone"}