{"rank":"10","title":"Yellow","id":"8kumux","url":"/r/nosleep/comments/8kumux/yellow/","time":"1526842278000","body":"<div class=\"md\"><p>Wind ripped through my hair whilst the last rays of the dying sun flashed bright on the horizon. Yellow canyons cut into the sky and the road we drove down was as straight as a bullet shot through the desert. My heart thumped hard in my chest. My hands trembled. Everything I owned was contained within a suitcase in the backseat of my boyfriend’s speeding car. My past was getting further from me by the second, like desert sand rushing through my fingers.</p>\n\n<p>Freedom.</p>\n\n<p>Devin glanced at me from the driver’s seat, a grin tearing across his lips. His grip on the steering wheel had his knuckles turned white. His reddish-brown hair was tied in a knot at the back of his skull, the exact same colour as his eyes. I was just noticing the way the muscles in his arms strained as he drove the car when he reached across and grabbed my shoulder.\n  “I got you, Daniella,” He said, his eyes briefly on me. “I got you.”</p>\n\n<p>It was close to midnight when we hit Las Vegas. Being his hometown, he drove as if the streets were veins and he was blood pumping through the circuit for the millionth time. I looked through the window at the city speeding by and felt a kind of muted astonishment at everything I saw – it was so completely different from everything I had ever known. It was also completely different from how I had imagined Las Vegas; in my mind this city was all bright lights, money and neon but all I saw were sordid back alleys half-lit by the feeble glow of flickering streetlights and empty windows staring at me through the darkness. </p>\n\n<p>We pulled up to a small apartment block situated next to a vacant industrial lot, in the part of the city they call Downtown East. I registered these facts only at surface level – I’d been running on pure adrenaline since slamming the door to my life-long home for the last time this morning, and I didn’t have much left in the tank. As soon as I stepped out of the car and felt the cold night-time air surge into my lungs the exhaustion hit me like a freight train. I collapsed straight into Devin’s arms. It’s hazily I remember him carrying me up to his tiny apartment on the second floor and laying me down on his bed. He left the room then for what could have been a minute or an hour. </p>\n\n<p>That night, against every instruction with which I had been raised, I let him hold my body to his whilst I nestled my face in hair that smelled like smoke. </p>\n\n<p>I was raised Mormon, in a small Nevada town that bears no name to me anymore. The third of seven children, I was neither as outstanding as my older siblings or as worthy of attention as the younger kids. Whilst the older ones were out doing missionary work I took care of my little brothers and sisters, seemingly forgotten by my parents. In school I was told to ignore any attention I got and focus on my studies, but I struggled to get the good grades that were expected of me and I felt as if there were a great distance between myself and my peers. At the same time, I felt pressure and judgement constantly not only from my parents but from the community and the church itself. I found my only escape in the form of the internet – there I could express myself without worry. My time spent on the web was my first taste of freedom.</p>\n\n<p>And it was there that I met Devin.</p>\n\n<p>So, after three months of daily messages and nights filled with longing, he made the drive out to see me for the first time. He liked what he saw. I became bolder. We were different in every way – his pale skin was untouched by the desert sun, but it was laced with ink. He knew about the world and I knew nothing. He was going to save me.</p>\n\n<p>Four months and two more meetings after that, I was close to breaking point. I had recently graduated high school, but my diploma meant nothing: I had not been accepted into any colleges and had no viable prospects for the future. The crushing disappointment of my parents was nothing compared to the condescension in their eyes when they spared a second to look at me. I was trapped in a world of restrictions and rules, day in, day out. With every fibre of my being I needed to get away from the toxicity of that small Nevada town. One teary, troubled midnight phone call later and Devin told me that I could go and live with him in Las Vegas, that he’d actually been wanting to ask me for a while. He lit a spark of hope in my heart that burned harder and harder with every passing hour. I was not scared to leave my family behind – no, that would be like breathing fresh air for the first time in 19 years – but I was afraid of the world and everything it had in store for me. Screaming my final words to the people who had made my life misery and stepping into Devin’s car was like jumping into an abyss, but I loved it, I loved the rush of it all and I loved the feeling that I was finally escaping everything that had held me back. It was my first rush, but it sure as hell would not be my last.</p>\n\n<p>My first week in Vegas flashed by me, as if my life was set on high-speed. Every experience there was new to me. On the first day Devin bought me clothes to replace the knee-length, shoulder-covering dresses that had filled my suitcase; a light turned on in his eyes when he sensed my discomfort with the form-fitting tank tops and skimpy denim shorts. He told me I needed to dress this way to fit in here. He told me he knew best. </p>\n\n<p>He was there when I drank my first ever coffee – it’s banned in the Mormon faith – and I watched him as he tried to hide his delight when the hot, acrid liquid burned my tongue. I liked the way; however, it made my body buzz.</p>\n\n<p>It was beside him, with gleeful thoughts running through my brain about how my parents would have reacted to seeing this, that I first inhaled smoke into my lungs. After that it was the sweet heat of alcohol blazing down my throat. With false audacity and chemical substances, I quieted all the voices in my head howling that I would never go to heaven. I tried to make a paradise of my own in that dirty little apartment we shared.</p>\n\n<p>It wasn’t often that he let me leave. Rarely was he home and when he was there was sweat on his skin and a jittery edge to his movements. Devin knew I was alone so much – he gave me certain things to help me pass the time. The lines of the apartment became blurred and unfocused: colours were brighter, and my limbs didn’t want to move. It felt like the walls were humming, a constant, static pitch. The days started to melt into one another. Most of the time I didn’t even know where I was. I told myself this was what life in the real world was like. I told myself that this was what I had wanted.</p>\n\n<p>It was about a month into my time in Vegas that Devin finally said we could go out together. There were deep, blooming purple marks on my arms, but I couldn’t remember sustaining them. I couldn’t get my eyes to stay in one place and the edges of my vision were tinged black. Before we headed out he handed me a small pink pill. He said it would make me feel alive, and when I looked in his eyes, the pupils so swollen as to completely hide the iris, I believed him. </p>\n\n<p>We went to the famous Vegas Strip that night. I felt energy like lightning coursing through my body. Sounds pulsed in my ears, colours flooded my brain. The bright lights and huge crowds and music pounding through the streets were at once beautiful and terrifying. At one point I think I saw an old Elvis impersonator, the lines in his face as deep as ravines, and I would have sworn his skin was tinted red. His hair was the same oily black shade as Devin’s eyes had become. Reality was bending and pulsing around me; the hard edges of the street were blending with the neon lights that streaked through the night. </p>\n\n<p>At some point Devin pulled me into the car, our breath shallow and our laughter frantic. My high was getting duller by this point, but I was too far past the point of no return to care about the way Devin’s hands on the steering wheel shook or the dim pain in the back of my mind. Soon we were speeding away from the meretricious lights of the Strip and heading out into the wide emptiness of the desert. The dunes around us rose like sulphur from the ground, a contrast with the clean clearness of the night sky. The first signs of dawn looked like a rim of blood on the horizon. Devin pulled over at some point and whilst my memory is hazy I do recall the way the sand all around us was the same colour as nicotine on a smoker’s fingers. I remember the manic fire in Devin’s eyes and the fear that began to churn in my gut when I realised where we were. The isolation.</p>\n\n<p>The fear that I hadn’t let my body feel since coming to this hellish place was beginning to rush back to me. I looked at the bruises on my arms, the same shade as the desert sky, and scenes from the last month came flooding back. I imagined or remembered blood running from my mouth, red as roses, and suddenly the endless yellow dunes surrounding us were crushing me, the very colour disturbing and foreign and nauseating. It was then, I think, that I blacked out. </p>\n\n<p>I awoke beside him, my hair tied into the sand and a pounding in my head. The sky was a sheet of colours slowly bleeding into each other. When I reached a trembling hand towards Devin, I found his pale skin cold to the touch. The chill spread through my fingers, and beneath suntanned skin, my blood ran cold.</p>\n</div>\n","author":"babsamazon"}