{"rank":"85","title":"The Tooth Fairy","id":"8kur4s","url":"/r/nosleep/comments/8kur4s/the_tooth_fairy/","time":"1526843317000","body":"<div class=\"md\"><p>I remember the day I lost my first tooth. I’ve always felt like that’s a big milestone for kids, since its one of the first signs that you&#39;re growing up. I was six when my first one fell out. It was one of my two front teeth, and it left me with one of those endearingly gap-toothed smiles that every child has at some point in their life. The tooth fell out during recess that day, and my classmates all made a big deal about it since I was one of the first kids in our class to lose a tooth. My best friend at the time, Tommy, was particularly ecstatic, demanding to see my freshly departed incisor. My teacher quickly put the tooth in a little envelope so I could take it home and show my parents. As I was basking in my new found 1st grade fame, Tommy pulled me aside with a serious look on his face.</p>\n\n<p>“Are you gonna put your tooth under your pillow for the tooth fairy?”</p>\n\n<p>“Yeah! I heard she leaves you a dollar!”</p>\n\n<p>Tommy’s face darkened, and his voice became a whisper.</p>\n\n<p>“I heard this girl in Ms. Romano’s class talking… and she said that there isn’t a tooth fairy! She said that your parents are the ones who give you the money instead!”</p>\n\n<p>This was disturbing and shocking news for a six year old. If the tooth fairy wasn’t real, what else wasn’t? Santa Claus? It was unfathomable to me. But was Tommy even right? He heard the story from another girl who hadn’t even lost a tooth! How would she know if the tooth fairy existed? Only I would be able to tell. That’s what I would do: I would see if the tooth fairy was real and prove to Tommy that she was.</p>\n\n<p>“Well, I’m gonna stay up tonight and see if my parents try to take the tooth! If the tooth fairy comes, you’re gonna feel like a real dummy for saying that she isn’t real!” </p>\n\n<p>I felt smug. I was so sure that I was going to prove my friend wrong that I couldn’t focus on anything else for the rest of the school day. I remember racing home as fast as I could, feeling the envelope in my pocket. I proudly told my parents of my newly missing tooth, and they bought me ice cream to celebrate. But for once, I couldn’t wait until bedtime.</p>\n\n<p>I said good-night to my parents, and slipped into bed. I took the little ivory piece of bone out of its manila sleeve and gently placed it underneath my pillow. I double checked to make sure that my flashlight sat on my nightstand. I said a silent prayer, begging the tooth fairy to be real so I could prove it to Tommy. With that, I closed my eyes and waited. </p>\n\n<p>I don’t know how long it took; it could have been minutes or it could have been hours. But I remember hearing this extremely soft rustling, akin to the sound a bird makes when it beats its wings. My heart started to beat faster. <em>She’s here!</em> I thought. I knew that someone was in the room with me, but it couldn’t have been my parents. Our house was old, and the wood of the door and floor creaked when moved or stepped on. Whatever was in the room made almost no sound. </p>\n\n<p>I steadied my breathing, and braced myself for the vision of fae loveliness that I had pictured. I imagined a girl with long black hair and butterfly wings to be sitting there, gingerly removing my lost tooth from underneath my pillow. In my mind’s eye, the tooth fairy sort of looked like Amy, the girl in my class who I had a crush on. </p>\n\n<p>I opened my eyes.</p>\n\n<p>In the darkness of my bedroom, I saw a figure slowly move its hand away from my pillow. I grabbed my flashlight and switched it on.</p>\n\n<p>There were no gossamer wings or long dark hair that reminded me of Amy. The thing in my bedroom was tall, with disproportionately long limbs that seemed to almost drag along the floor and impossibly long fingers. It was female, from what I could tell, its waist slender and its chest sporting the slopes of breasts. I could feel it staring at me, but I wasn’t sure how; it had no eyes. In fact, there was no face to speak of. The area where the face should have been was, like the rest of its body, completely covered in teeth. Molars, incisors, canines. Some white, some yellow, some decayed and rotted. But all were small teeth. Baby teeth. The teeth weren’t lazily stuck on; they were embedded in the faintly pink, gummy skin of the thing, like they were growing out of it. </p>\n\n<p>I couldn’t breathe, I couldn’t scream. The beam of light from the flashlight wavered as my hand shook. My brain could barely fathom what it was I was seeing. As if sensing my confusion and fear, the creature began to move, its movements fluid and methodical. It produced a small hammer from somewhere, a tiny thing with a wooden handle and a rounded, mallet-like head. In its other hand, it held my lost tooth. With the precision of a medical doctor, it gently aligned my lost tooth against its glistening skin. With the other hand, it took up the hammer. No sound was made as the creature hammered my tooth into its flesh. There was no blood, just a thick, pus-like fluid that dripped from the new hole. It stunk, like a combination of burnt sugar and rotting fruit. With the tooth now snugly affixed in its new socket, the creature turned back to me. It tilted its head slightly, the way a puppy does when it hears a new sound. But there was nothing endearing or cute about the way it moved. It crept up to me slowly, its feet not even touching the ground. </p>\n\n<p>I don’t remember much of what happened next. Perhaps I passed out. Perhaps my mind decided to block out whatever horrors happened to me. It’s not so bad, though. I’ve gotten used to the dentures at this point, since I’ve had them for so long. They’re very realistic too, so most people are none the wiser. I don’t even have to worry about cavities or root canals any more. In a way, it’s a kind of blessing, one that might be bestowed upon another very soon. </p>\n\n<p>My daughter came home from school today with a small manila envelope and a gaping smile. </p>\n</div>\n","author":"bloodandbutterscotch"}