{"rank":"3","title":"My Brother and His Bees","id":"8kuu7q","url":"/r/nosleep/comments/8kuu7q/my_brother_and_his_bees/","time":"1526844090000","body":"<div class=\"md\"><p>So this happened about four years ago, so some details might be a little messy but I think I remember it all pretty well, since it was such a bizarre situation. </p>\n\n<p>My brother is my hero. He’s strong, funny, smart, and a pretty popular guy. He’s a little scary to look at, tall, a bodybuilder, covered head to toe in tattoos along with flaming red hair and our family’s startling green eyes. </p>\n\n<p>Girls love him, but when it comes to relationships, he tends to gravitate towards the worst fucking women in the world, the abusive and demanding type. I don’t know why, but he just has no backbone when he has a girlfriend. </p>\n\n<p>During this time, he was dating a girl named Katie. I’ll use her real name because, fuck you, Katie. This girl was batshit insane. I had seen her hitting, kicking, and screaming at my brother on multiple occasions, and she usually didn’t care who was around to see it. However, she liked me, even though she knew I hated her guts but, he loved her.</p>\n\n<p>Usually she’d come over to our house, but occasionally her and my brother would go over to her grandmothers house and spend the night there. Around Christmas time they invited me to spend the weekend with them at her grandmothers house, and I agreed since she would usually be nicer to my brother if I was around. Not that much, but enough that I decided to tag along. </p>\n\n<p>Real quick, I forgot to mention that I lived in Alaska at the time, and there was a ton of snow on the ground, and pitch black dark for most hours of the day. Her grandma’s house was pretty far away from the small town we lived in, so it took about three hours to drive there. </p>\n\n<p>We arrived at her house at around 10:30 at night, and my brother had been working all day on top of driving in dangerous conditions, so we all sat down and watched Tropic Thunder on the couch. I noticed my brother had fallen asleep about halfway through the movie, and realized I’d have to be awake, alone with Katie. </p>\n\n<p>When the movie ended, she suggested her and I make cookies and chocolate covered fruits and stuff to bring to my mom. As much as I hated this girl, I love baking for my family, and figured I’d be able to help her not fuck up these cookies, or try to poison us or something. (She’d gotten my brother really sick on two different occasions, and didn’t want her to try to kill my mom or something. You never know, this girl was absolutely crazy.) So I agreed to help her. </p>\n\n<p>When we were walking through her house, I began to take in our surroundings. The house was really old, but very beautiful. The type of house I’d dream of owning for myself in the future. The floors had gorgeous carpets and glossy, hard wood. Beautiful lights were nailed into the walls and hallways, guiding you into whichever room you were walking into. </p>\n\n<p>I liked the house, I’m not really the type of person to get “vibes,” or whatever from houses or anything like that. When we got into the kitchen and began making the cookies, Katie began making conversation with me, much to my dismay. </p>\n\n<p>She was asking about boys in my life, hockey, high school, my girlfriends, and I tried not to give her the idea that she and I were friends while remaining somewhat polite. I mentioned that her house was beautiful, and she responded with “Man, I hate this house.” I asked her why, how could anyone hate a house as beautiful and cozy as this? </p>\n\n<p>She got kind of quiet, which was weird for her. “It’s weird... I don’t really like to talk about it, but... Did you feel that heaviness when you walked in?” I hadn’t. I knew what she was doing. She was going to try to freak me out by saying this old house was ‘haunted.’ </p>\n\n<p>At the time and even now, I was extremely skeptical of that kind of shit and knew that there were almost always explanations for most people’s paranormal experiences. You know, if someone tells you a place is haunted, you’ll go in there expecting to feel or see weird things, and you trick your mind into having them happen just to freak yourself out. </p>\n\n<p>I decided to entertain her delusion and asked her about any weird experiences that she’d experienced in the house. She told me a few stories, one where her friend had stayed the night and left extremely early, sobbing and shaking after she claims she saw an older, Alaska Native woman wearing traditional clothing walk down the hallway and stop, turn around and stare at her, revealing her face, or lack thereof. </p>\n\n<p>Katie went on to say that she would frequently hear footsteps around the house, despite being the only one there, and hearing people talk or whisper without being able to find the source. She said a decent amount of people she brought over had seen apparitions, most of which being those of Alaska Native people. </p>\n\n<p>Her house was in a village that had mostly Alaska Native people, but her nearest neighbors were maybe 15-20 minutes away, surrounded by lots of trees. She told me that most of her friends who come over or stay the night leave early, shaken, and refuse to come back. </p>\n\n<p>Then she told me about how her ex boyfriend had been sleeping in her bed one night, and had experienced sleep paralysis, and saw a native woman with her body covered in wasps, covering every inch of her except her face. She said though she didn’t see the bees, she could hear the loudest buzzing sound she had ever heard. </p>\n\n<p>I listened to her story, but I thought to myself that her friends left because of her general awfulness, not ghosts. I didn’t say much in response, and we changed the subject for a while, I don’t really remember what we started talking about. </p>\n\n<p>Maybe 20 minutes later I heard my brother groaning, and I left the kitchen to go see if he had woken up. As I walked down the hallway, I began hearing a really weird buzzing sound that I figured was the buzzing of the lights in the hallway, but as I got closer to the TV room, the buzzing got louder and louder. I opened the door and my knees turned to jelly, and I froze in place. </p>\n\n<p>My brother was coated in wasps. They were EVERYWHERE. I guess this is a good time to mention that I’m absolutely terrified of bees, and I usually run away screaming at the sight of a little bumblebee. </p>\n\n<p>Seeing hundreds of wasps or hornets or whatever, I wanted to scream, run, hide, never ever ever come back, but I couldn’t leave my brother there. I ran to the couch, grabbing his arm and pulling him onto the floor. The buzzing sound was deafening, but as I moved him they began to crawl off him and fly away from him so I shook him awake to try to get him to stand up. </p>\n\n<p>My voice returned to my throat as I screamed his name, and his eyes opened and he looked around in fear. He stood up and gasped and began brushing himself off violently and running from the couch into the hallway. Katie must have heard the commotion and stood in the doorway, her mouth wide open, and I slammed the door to the TV room closed behind me. </p>\n\n<p>I screamed at her, assuming this was her fault somehow. “I didn’t do this!” She yelled back at me. I screamed at her, telling her “it’s fucking December, all the bees are dead, you psycho! What did you do to him?” She just stared at my brother and I and asked if either of us had been stung. I hadn’t, and looked to my brother who, miraculously, hadn’t been stung either. </p>\n\n<p>I was furious, my heart was thumping loudly and I wanted to leave. It was around like, 2:30 or something at that time and she told me we’d need to wait until tomorrow to leave. </p>\n\n<p>“What about the bees?” I asked. Katie gave me a small smile. “What the fuck are you smiling about?” She pointed to the TV room, and my brother bravely walked over, put his ear to the door and said “I don’t hear anything.” He opened he door to reveal that the TV room was empty, there were no bees. </p>\n\n<p>Once the adrenaline faded away and I knew for sure Katie didn’t poison the cookies, she showed me to the room I’d be staying in for the night. I was still mad at her, convinced that the she had something to do with what happened, but I laid down on the bed and quickly fell asleep. </p>\n\n<p>Around maybe 5 or 6 am I woke up. I wasn’t really sure why. It wasn’t a startling kind of waking up, more like the kind of gentle waking up after you’ve slept for a really long time. I sat up in the bed, and looked around in the darkness. A little bit of light from the hallways was coming from underneath the door, and along with hearing someone walking around, I saw the shadows of feet blocking the light from pouring in. </p>\n\n<p>They weren’t standing in front of my door, just passing by. I figured it was my brother walking around as I started hearing a mans voice talking quietly outside. </p>\n\n<p>I got up and walked to the door, and opened it, expecting to see my brother walking down the hall, but no one was there. I looked down the hall to the direction the shadows had moved in, and saw a room with the door wide open, pitch black.</p>\n\n<p>You know how when a room is dark, but the hall is lit, a little bit of light illuminates the dark room? Well, this room was completely black, as if a black curtain was hanging in the doorway, blacking any light from entering. </p>\n\n<p>I walked down the hallway towards the room, calling for my brother. “Hello?” As I walked closer to the room, I heard footsteps pacing throughout that room. “Hello?” I asked again. \n“Hello.” I heard a man say. \nI called my brothers name, only to hear the response I was dreading. \n“No.” </p>\n\n<p>I just turned around and went back into my room, pissed off and tired, and I didn’t investigate any further. I didn’t go back to sleep, but I sat with a pillow over my head and waited till I knew for sure My brother and Katie were awake to come back out of the room. </p>\n\n<p>I didn’t mention it to them, but I did ask Katie who else was in the house. She told me no one was, as just her grandma and her lived there. I just let it go after that. A week or two later, my brother and I finally talked about what happened. </p>\n\n<p>He told me he’d experienced real evil at her house, that he even experienced tons of sleep paralysis, and only when he was at her house. He’d been scratched in his sleep, seen people walk around, and that he hated the room upstairs that had no light. </p>\n\n<p>Three times the next year at my own house, my brothers room was infested with wasps, and we had to get exterminators to get rid of them. After he and Katie broke up, nothing bad happened to him again. </p>\n\n<p>(Fuck you Katie.)</p>\n</div>\n","author":"perfectforspring"}