{"rank":"0","title":"The Elevator Game","id":"8kuyzd","url":"/r/nosleep/comments/8kuyzd/the_elevator_game/","time":"1526845228000","body":"<div class=\"md\"><p>I have had a terrible experience &amp; I shouldn&#39;t have done what I did. I will finally open up about my story here on Reddit.</p>\n\n<p>So basically I live near an 11 story hotel in a small town in Tennessee. My friend Casey told me about the elevator game a while back &amp; I thought it&#39;s just stupid. Then recently one of may favorite Youtubers did a conspiracy theory on someone named Elisa Lam. He claimed that she may have been playing the elevator game &amp; then I became intrigued about this game more &amp; more. I learned the rules &amp; memorized the numbers which I was supposed to press. (4,2,6,2,10,5,1) But I knew the other rules like not looking at the woman on the 5th floor or riding with other people on it. Then I thought where would I even find a building to play the game in? Then I looked over at the hotel.</p>\n\n<p>My parents had left me all alone at my house that day. I decided to get out while they were gone and sneak over to the hotel. I shortly started to feel a panic from all the people who told me not to do this. I hadn&#39;t been particularly scared, I mean I did an Ouija Board without any problems. So I told the owner of the building I had walked 7 miles to get there &amp; she let me ride the elevator. So I got on &amp; pressed all the buttons in order. I went to floor 4 &amp; nothing happened so I pressed the button for floor 2. I didn&#39;t hear any whispers so I pressed floor 6. I heard a clunking noise but I wasn&#39;t scared. I pressed floor 2 again and I heard the clunking noise again. The door closed really slowly &amp; I thought eh it&#39;s nothing. I then got to floor 10 &amp; I heard the constant clunking as the elevator slowly climbed up to it. The fan in the elevator stopped spinning then. I pressed floor 5 &amp; looked at only the buttons. This is where it started getting scarier.</p>\n\n<p>I top floor. Then the lights started flickering madly. I started feeling the urge to look at her but I just closed my eyes. I then smelt something horrible like someone had just died in there. I was pretty scared but I didn&#39;t want to look at her so I just looked at the floor. I noticed all the lights had turned off except the one right above the Elevator. The woman said where do you think you&#39;re going? I just got out &amp; waited tilswear I heard footsteps but all I saw was the buttons &amp; I was squinting so I wouldn&#39;t see her out the corner of my eye then I pressed the 1st floor button. I heard her talk about Minecraft &amp; I&#39;m thinking, does she know I like Minecraft? Then I felt the elevator going up &amp; I thought that someone probably just called it from the l the door closed &amp; I knew she was gone.</p>\n\n<p>I was excited to find this other dimension &amp; finally find that it was real but I was scared a little. I did remember that nothing can get me because the only living organism there would be me. But I thought what if dead things were there. The cross outside the sky was on fire. I saw a 2 dismembered arms on either side of it. I felt really sleepy but also became absolutely terrified. I had only taken a few steps away from the elevator so I knew which was which &amp; I got back in. I just repeated the steps &amp; the woman got back on at floor 5. I feel like she knew where I had been to &amp; she told me to press the first floor button. I knew that would take me back there &amp; that was probably what she wanted but I pressed it anyway. In that moment I quickly pressed the button for floor 8. The elevator stopped at floor 8 &amp; pretty much everything seemed normal. But I didn&#39;t dare get off until I had successfully reached floor 1. I pressed floor 1 &amp; I went back down to the floor 1 I started from.</p>\n\n<p>The owner of the building stood there waiting for me. She seemed shocked. I had a nosebleed somehow &amp; I thought she was shocked about that. She told me to turn around but I got away from the elevator. I heard a cackle from behind me &amp; I realized what just happened. The owner of the building had looked directly at the woman. I ran to the front desk &amp; the owner did too. The doors closed &amp; the woman was gone. I told the owner everything that happened. I told her the mistake she had made, but I could&#39;ve made a mistake for that matter. I knew something bad would happen to her &amp; I felt bad because it was my fault. She didn&#39;t know not to look at the woman, but I did. I went to sleep with so much guilt. I still felt sleepy from the event so I dozed off very quickly.</p>\n\n<p>I then looked around and I saw what looked like the 10th floor of the hotel. The thing is that everything looked normal. I heard people &amp; all the lights were on so I knew I wasn&#39;t in the Other-World, But I still had a nosebleed. That still really scared me, not waking up in my own house. I was thinking if i&#39;m in a hotel I could&#39;ve at least woken up in one of the beds right? But no I was there on the carpet. I just went down to floor 1 &amp; I met the woman. She said that she had looked up the rules for the game after what happened. She claimed to have woken up on the 10th floor but all the lights were off. She then pressed the buttons in order to get back. I told her that the woman would take her for her own. Then she turned very pale. I knew it was my fault &amp; I tried to look for a way to help her that night.</p>\n\n<p>I woke up in my bed &amp; walked across the road to see what happened to the owner. She claimed to have had woke up in the Other-World once again. That night there was only 1 thing I could find that might work. I handed her a Bible &amp; told her to trust in Jesus then everything would be ok. She was atheist but willing to try anything at that point. I walked out &amp; was scared to the bone that she might still get transported back.</p>\n\n<p>On the news I heard about a woman who died on the 10th floor that day. It turns out the owner of the building was found dead on the 10th floor. I felt really bad and really scared. After that I woke up once more on the 10th floor. I then found the bible that I gave her, It hadn&#39;t even been opened though. I picked it up &amp; prayed to God that I would never go back. I never have been back to the building since. But I have been baring the burden of her death ever since. And I had nightmares about it for 7 days. Although 10 days after the incident the bible went missing. But since the bible vanished without a trace, I have never dreamed about it again either. 2 months later I have been diagnosed with P.T.S.D. I still fear that one day the woman might come back for me though...</p>\n</div>\n","author":"JoeTheObjectPup"}