{"rank":"252","title":"Nightshift At The Plant - Malachai","id":"8kv0az","url":"/r/nosleep/comments/8kv0az/nightshift_at_the_plant_malachai/","time":"1526845561000","body":"<div class=\"md\"><p><a href=\"https://www.reddit.com/r/nosleep/comments/8k041i/nightshift_at_the_plant_thats_not_a_pony/\">That&#39;s not a pony ...</a></p>\n\n<p><a href=\"https://www.reddit.com/r/nosleep/comments/8kf49e/nightshift_at_the_plant_the_unwelcomed_visitor/\">Unwelcomed Visitor</a></p>\n\n<p>I was pretty shaken up by the thing standing over my daughter, so no, she didn’t leave my sight the next several weeks.</p>\n\n<p>Huey, John, and Rooster were the only ones besides me who knew what happened that night, and I really hoped I could keep it that way.</p>\n\n<p>On my long weekend off, I started thinking about the things I’d seen at the plant.  I wondered what I might find at the local library, so I loaded up Chloe and off we went.  I could have just put her in the stroller and walked, but the day was so hot and muggy I didn’t want to.</p>\n\n<p>I knew the library well – it had always been my favorite place to go, and I was an avid reader.  I enjoyed learning new things, including history.  Going through the doors, I headed back to the research section and began scanning through the dates.</p>\n\n<p>“Ma’am, is there something I can help you find?”</p>\n\n<p>I looked up at the smiling, elderly gentleman and thought for a moment.  “The steel plant down 70 – what do you know about it?” I asked.</p>\n\n<p>He grinned down at Chloe, who was waving her little arms and gurgling at him happily.  “She’s a doll,” he complimented.  “Why don’t we go sit down over there, and I’ll tell you what I know about it.”</p>\n\n<p>Agreeably, I picked Chloe’s carrier up and followed him over to the sofa and chairs in the corner by the big windows.  Setting her down on the sofa beside me, I offered the man a smile.  “I’m Selene, and this is Chloe.”</p>\n\n<p>“Nice to meet you ladies,” he returned, smiling as he settled into a chair.  “Just call me Jess.  Mind if I ask why the interest in that old plant?”</p>\n\n<p>“I’ve heard things,” I replied, neatly avoiding telling that I worked there and had seen things I couldn’t rationally explain and now I was terrified.</p>\n\n<p>Jess sighed.  “I imagine you have, honey,” he expressed.  “You familiar with the name Harry Thomas Woods?”</p>\n\n<p>My brow furrowed immediately.  “My late husband is his great nephew, why?”</p>\n\n<p>“He was the architect for that plant,” Jess replied, looking deep in thought.  “He wasn’t well-liked, I’m afraid.  Hotheaded and arrogant, Harry wanted things done exactly, and God help the man who deviated at all from his plans.”</p>\n\n<p>“What do you mean?” I asked, feeling chilled.</p>\n\n<p>“Men went missing from his crew.  Just up and disappeared, no trace.  Always the ones who argued with him, or tried to alter things.”  Jess shook his head.  “There were rumors Harry was in league with the devil himself, and that’s how he got the job designing that plant.”</p>\n\n<p>I thought about the creature I’d seen, and then the thing standing over Chloe, and shivered.</p>\n\n<p>“I don’t mean to scare you none, Selene,” Jess told me.</p>\n\n<p>“No, it’s … fine,” I murmured.  “I just … I guess I didn’t expect to hear that.”</p>\n\n<p>Jess gave me a scrutinizing look then.  “Mind if I ask you what you’ve heard, so I can see if I can help you some?”</p>\n\n<p>“I work there, Jess,” I admitted.  “I didn’t want to tell you that, because I was afraid you’d think I was crazy, or hysterical from leftover pregnancy hormones.”</p>\n\n<p>“Oh, honey,” he murmured, his face showing his concern.  “What happened?”</p>\n\n<p>I told him about the creature I’d seen before Chloe was born, and then I told him about the thing standing over her in the guard house.  I told him about Huey running it off for me, what all he’d yelled at it, and how terrified my baby seemed to be when I finally got her out of her bassinet.  “I need this job, Jess, but … I’m terrified to go back in now,” I finally confessed to him, eyes watering.</p>\n\n<p>Jess sat there for a while, mulling something over in his head.  “I may know someone who can help you,” he told me.  “My youngest nephew.  Tell me, Selene, are you religious?  What I mean is, do you go to church and consider yourself a Christian?”</p>\n\n<p>“I thought I did, until Micah shot himself,” I replied honestly.  “Now, I just don’t know.”</p>\n\n<p>“I’m sorry for your loss, Selene,” Jess murmured, his brow furrowed.  “This before Chloe was born?”</p>\n\n<p>I nodded.  “I was coming home to tell him he was going to be a father, and … found him in his office.  No note, no warning, no nothing, Jess.  I wish I knew why.  I wish I had the answer, why my husband killed himself.”  I met his eyes.  “Why did you ask about my religious beliefs?”</p>\n\n<p>Jess sighed.  “Malachai’s a bit … different, Selene,” he began.  “I’m the only one in the family that will have anything to do with him.  I’ve seen him do things that I can’t explain.  Now, don’t get me wrong – I trust that boy, and I’d trust him with my last dollar and my great-grandbaby both.  But he ain’t like normal folk.”</p>\n\n<p>“I go back to work Monday night,” I told him.  “My shift runs from six to six.  He’s welcome to come by and talk to me.”</p>\n\n<p>Jess nodded, getting to his feet as I got to mine.  Boldly, he put his hand on my shoulder.  “You hang in there,” he murmured.  “If I know Malachai, he won’t leave you there alone until he solves this riddle.  He’s a night owl himself, so the hours will be perfect for him.  Unless of course you aren’t allowed visitors.”</p>\n\n<p>“I can have visitors,” I confirmed.  “My company and the admin of the plant don’t care, as long as I do my job and I’m not doing anything illegal.”</p>\n\n<p>Jess assured me that Malachai would be there Monday evening, and we parted ways.  I stopped by the grocery store on the way home to do my shopping for the week, and went home to put Chloe down for a nap.  While she slept, I did some light cleaning and then settled on the couch with a book.</p>\n\n<p>My eyes involuntarily went down the hallway, to Micah’s office, and I found myself getting up to go inside.  All the blood and brain matter had been cleaned up, leaving no physical trace that he’d blown his brains out in the room, but my mind conjured the images up.  “Micah, why?” I asked softly, wandering around the room.  Going behind his desk, I sat down in the chair and stared at it for a time.</p>\n\n<p>Then I found myself opening drawers and rifling through the contents.  I had never gone through Micah’s things, but now that he was gone, I just couldn’t help myself.  Old bills, tax records, receipts … it seemed to be mainly household stuff.  But as I was closing the top left drawer, I realized the contents sat higher in it than the others.  Pulling it all the way out, I removed the contents and discovered it had a false bottom.</p>\n\n<p>Beneath that, I found something that made my blood run cold.</p>\n\n<p>A photo of Micah as a teen, with presumably his great uncle Harry.</p>\n\n<p>They were standing in a room that had black walls, in front of some sort of symbol that I’d never seen before.  Candles blazed on the table behind them, surrounding something that I couldn’t quite make out – and wasn’t sure I wanted to.</p>\n\n<p>I set the photo aside, and pulled the slim black book out next.  Taking a quiet breath I opened it.  It was a journal.  Micah’s journal.  For a moment I considered closing it and putting it back, and then closing the door to his office for good.  Then I remembered that I wanted answers, and started reading.</p>\n\n<p>By the time I was through, I wished I’d never found it.</p>\n\n<p>Jess’ words rang in my ears - “Harry was in league with the devil himself.”</p>\n\n<p>Those weren’t rumors.</p>\n\n<p>Harry was still alive, furthermore.</p>\n\n<p>My terror reached a whole new level, and I fled his office to go check on Chloe, needing to be sure she was okay.  She was still sound asleep in her crib, a little smile on her face.  Tears spilled over my cheeks, and I sank down beside her crib on the floor.</p>\n\n<p>If I could keep us both alive through the weekend, I prayed that this Malachai could help us.</p>\n\n<p>Monday saw me going in with circles under my eyes and a lot jumpier than I normally was.  Chloe was her usual happy self, thankfully, but my nerves were absolutely shot and I hadn’t gotten much sleep.  A few of the men remarked on it, but I waved them off with a forced smile.</p>\n\n<p>At eight, a black Dodge truck pulled into the employee’s lot by the guard house and parked.</p>\n\n<p>Before I could get a look at the driver, the phone rang and took my attention away from him.  Lost truck driver, needing directions for in the morning.  I heard the door open while I was walking him through which interstate, which exit, landmarks, and the like but I didn’t turn around.  I could hear Chloe babbling excitedly, so I didn’t think much of it.  I could hear a low voice murmuring back to her – well, she clearly liked whomever had come in, so I wasn’t worried.  When I finally got the driver straight on where he needed to go, I hung up and turned around.  “Sorry about that,” I said, and lost the ability to speak.</p>\n\n<p>The man in my guard house was wearing solid black from head to toe, had several black hoops in both ears, and tattoos up and down both muscular arms.  His eyes were as black as the hair he had pulled back in a long ponytail, and he was bronze-skinned.  He had been leaned over Chloe, a smile on his lips as he talked to her, but when I turned around he had straightened to look at me.</p>\n\n<p>“My great uncle Jess said you were having some problems out here,” he stated, his voice a low, rumbling purr.  “Now that I’m here, that’s the biggest understatement I’ve ever heard him make.”</p>\n\n<p>“You’re – Malachai?” I asked, wincing at my stammered question.  “I’m sorry.  Of course you are.  I’m Selene, and that’s Chloe.  And after what I found in my late husband’s office, I’d agree with that statement.”</p>\n\n<p>Those black eyes scanned me.  “Your late husband shot himself because he didn’t want to be part of the cult any longer,” Malachai said flatly.  “Because he knew his great uncle would want something from him that he didn’t want to give.”</p>\n\n<p>Tears welled and ran heedlessly.  “Our daughter,” I breathed.</p>\n\n<p>Malachai got me some tissue from the bathroom and sat me down before I fell over, pulling a chair up  beside me.  “Jess filled me in, so I would know a little before I showed up here,” he told me.  “I can see how afraid you are.  I won’t tell you that you shouldn’t be, because that would be a lie.  But I’ve danced with Harry Thomas Woods before, Selene.  If I have to set up camp in your yard, I won’t let him have your daughter.  My word, to you.”</p>\n\n<p>We were sitting in companionable silence at three am, me reading a book and Malachai playing with Chloe, when that thing showed back up.\nMalachai just looked at it, one black eyebrow raised and Chloe held tight against him.</p>\n\n<p><em>“Malachai,”</em> it hissed, making me swallow hard.  It sounded so angry …</p>\n\n<p>“Good to see you remember me,” Malachai expressed calmly.  “Take a message to your master for me, cull.  Tell him if he wants Chloe Woods, he’ll have to go through me to get her.”</p>\n\n<p>Uttering a piercing howl, the thing tried to snatch Chloe out of his arms and I found myself getting to my feet with the baseball bat I kept under the counter.</p>\n\n<p>“You touch my daughter and I’ll lay you flat,” I spat, bat held firmly.</p>\n\n<p>“I think she means that,” Malachai commented, not moving a muscle.</p>\n\n<p>It swiped at him again, claws extended, and I heard Malachai say something that I couldn’t understand.  Howling, it shuddered all over and melted into the floor in a pool of black liquid that vanished into the tiles.</p>\n\n<p>“What the hell was that?” I heard myself exclaim, adrenaline still coursing through me.</p>\n\n<p>“Put the bat away, Selene, and sit down before you faint,” Malachai instructed quietly, still holding Chloe who hadn’t uttered a sound during the entire exchange.</p>\n\n<p>I found myself doing as he told me, and once I was seated the adrenaline left abruptly and left me shaking on the chair.  It was then that I realized I had threatened the thing with the bat, and I didn’t like how that made me feel.</p>\n\n<p>“Harry made a pact with something ancient – not a demon, or at least not in the Christian sense of the word,” Malachai explained.  “That thing is what they call a servitor – it’s an entity created by emotion and energy, I guess you might say.  It’s real enough that it could hurt you or Chloe, so I want you to promise me you won’t do that again.”</p>\n\n<p>“I don’t know what came over me,” I mumbled, shivering.  “I just – when it snatched for Chloe”--</p>\n\n<p>“I know, but I gave you my word I wouldn’t let anything happen to either of you,” Malachai pointed out calmly.  “I keep my word, Selene.”</p>\n</div>\n","author":"RhapsodyinVelvet"}