{"rank":"200","title":"Daddy's Swing","id":"8kvcmg","url":"/r/nosleep/comments/8kvcmg/daddys_swing/","time":"1526848568000","body":"<div class=\"md\"><p>I sat on that swing-set each and every night. It was an old, decrepit thing put together by my Daddy sometime before the alcoholism put him in the ground. He didn&#39;t have building codes for it. Heck, he barely knew what he was doing at all. A couple of wood two-by-fours, some links of chain from the Sears catalog, and a can-do attitude were all a man ever needed. That was what he said anyway.</p>\n\n<p>It worked well enough. On nights when the wind was fierce and the sky was clear, I would fly high above the hill overlooking Pleasantville, and it felt like I was on top of it all. The Queen sitting in her Royal Chair, at least that&#39;s what Daddy used say.</p>\n\n<p>So when Daddy died, my Mommy thought it would be best to bury him beside our old swing. We never asked anybody if we could, we just did. Mama said the only time she ever saw him smile anymore was out beside that old wood swing. I liked the idea too.</p>\n\n<p>Daddy was heavy and soaked in blood that night, but Mommy and her new man were strong. They didn&#39;t need my help much if at all. We put him in some blankets, and we rolled him into the ground. We sang a few of his favorite songs in the night, all while we padded the dirt in tight. </p>\n\n<p>I missed Daddy after that, but I also knew never to talk about him. One time, at dinner, I asked my Mama if Daddy would ever come back home. It was a silly thing to say, but I was all alone. Her friend had been living there, then, and I did not know why. He slapped me so hard my busted lip bled until bedtime.</p>\n\n<p>One night when Mommy&#39;s new man was yelling his loudest, I went back to my old swing. It was a nice night. The wind was ferocious, and it rocked me back and force in my chair, while cool tiny drops of rain dotted my forehead.</p>\n\n<p>I thought about Daddy, then, and again wished how he could ever come back home. I wished that... I was on a game-show, like the ones we all watched around the television before bedtime. I would go through a series of quests, know all the right answers, and win the big prize at the end. When the lucky girl steps up to claim her only wish, anything she could ever dream of, she picks her Daddy to be alive again and come back home. A genie appears from beneath the stage, and grants the girl&#39;s wish. She goes home a happy customer, happily ever after.</p>\n\n<p>And how surprised was I, that very night, to see Daddy come strolling back up, dressed in sharp tight clothes and fresh new boots we hadn&#39;t seen in ages. </p>\n\n<p>I cried, calling out to him and carrying on like I had not done for a year. I grasped his jacket, which was smelly and unfamiliar, cold and unwelcome, but heard his voice and knew it be him. When I clenched my arms around his frame, it was thinner than I remembered. More worn. I stepped back and took in the shape of my Daddy.</p>\n\n<p>On top of his fancy clothes, he wore a funny old rabbit head mask that he had from when I was kid. I hated that old thing. It was ratty and tethered, dampened from years of animal urine and feces in the basement. </p>\n\n<p>On birthdays, Daddy would bring that map up out of his cave and scare me the living daylights out of me, from sunup till sundown. He thought he was so funny. I shrieked throughout the house, my Mama laughing behind me in a weird little mask of her own. </p>\n\n<p>I didn&#39;t how Daddy found the mask, and I didn&#39;t know how he got out of the dirt beside me. But when he held out his hand to me, I took it, and it was cold and white. His mask smiled a sad smile, with a tilt of his head to the right. And when he pulled on my hand, it was stubbornly tight. </p>\n\n<p>So I ran away. I did not go away with daddy yesterday. But I think I might today.</p>\n\n<p><em>-Janette, Miss Cosgrove&#39;s Second Grade English Class</em></p>\n</div>\n","author":"iWontBeFound"}