{"rank":"1845","title":"I Kept Getting the Previous Tenants Mail","id":"8kvetn","url":"/r/nosleep/comments/8kvetn/i_kept_getting_the_previous_tenants_mail/","time":"1526849108000","body":"<div class=\"md\"><p>At first, it didn’t bother me. Moving is tough and it’s easy to forget things when you’re in a rush to get everything packed in time for the move out date. According to my landlord, the previous tenants had left immediately after their lease was up. They barely cleaned and left nothing behind. When I say nothing, I mean nothing. They even took the microwave, which was built into the kitchen and not their property.</p>\n\n<p>The first few times I got their mail, I just stuck it into the outgoing slot and went on my way. No big deal. After a month, it started to get annoying, not to mention weird. These weren’t just newsletters or coupon books either. I was getting their bank statements, their insurance papers, credit card bills, the whole nine yards. I got fed up and called the post office. They told me the previous tenant never changed their address, but they promised to hold all their mail from now on.</p>\n\n<p>True to their word, every envelope I got the next day had my name on it. I only occasionally got the previous tenants’ stuff after that. Usually junk mail that slipped through the cracks: magazine subscription offers and requests for donations to random charities. I guess in addition to their bills, they weren’t interested in a free year’s enrollment in the cheese of the month club. Whatever. Into the trash it went.</p>\n\n<p>One day, I got something a little different. Mixed in with my electric bill and a letter from my grandma, there was a plain white envelope with no return address. It looked like the kind that came with greeting cards, but it didn’t feel like there was a card inside. The handwriting was also really bad, like whoever wrote used their non-dominant hand. It was sealed with a cartoonish sun sticker smiling up at me. I wasn’t creeped out yet, but looking back, I really should have been.</p>\n\n<p>Normally, I would have just dropped the letter into the mail slot or the dumpster, but something about this letter sparked my curiosity. I’m ashamed to say it, but I did peel the sticker off and take a look at what was inside.</p>\n\n<p>It was a single sheet of lined notebook paper. Two words written across the page in red sharpie: <strong>FOUND YOU.</strong></p>\n\n<p>That was all. I searched the envelope, and there was nothing else. A chill ran down my spine as I replaced the paper and resealed it. I wasn’t sure what to do with it, and I debated for a long time if I should throw it away or keep it. I chose the former in the end. I didn’t want to bring it into my house and have it on my kitchen table staring at me.</p>\n\n<p>By the time I went to bed that night, I’d mostly forgotten about it. Probably just a friend who hadn’t heard they moved pulling a prank. I curled up under the covers and was asleep in seconds. I woke up twice in the middle of the night. First because I had to pee really bad around 1 am. Shouldn’t have drank all that Mountain Dew. Nothing seemed off while I was doing my business. Just the usual creaks and groans of a forty year old building settling.  </p>\n\n<p>The second time, it was three in the morning. I don’t know what woke me up, but I had this awful foreboding feeling in the pit of my stomach. You know how sometimes, you just know there’s a problem even if you can’t see it? Yeah, that was me.</p>\n\n<p>I almost sat up, but then I saw it in the corner of my room. A black figure staring at me. He wasn’t too tall or big, and definitely a person, not a demon or a figment of my imagination. I could hear him breathing behind a mask. As my eyes adjusted, I realized it was an old man mask with wispy gray hair. It had a hooked nose and a pointed chin, and in the dim light shining through my windows, I could also mistake the dark brown color for red. Through the eye holes, I could just make out his eyes on me, full of rage and hatred. His chest heaved as he walked to my bedside. He had something in his hand, but I was too busy staring at his rubbery face to see what it was. My heart nearly exploded when he leaned over me,getting close enough that his fake nose brushed against my real one. He breathed hard, like a bull about to charge.</p>\n\n<p>I still hear that sound in my nightmares.</p>\n\n<p>Then, to my complete and utter amazement, he did… nothing. He straightened up, walked out of my room and then out my front door. I even heard the lock click into place. His footsteps disappeared down the hall, and that was it. </p>\n\n<p>Of course I called the police, but the man was long gone by the time they got there. I gave them the best description I could, which was basically nothing, and they gave me the whole ‘thank you ma’am we’ll do what we can call us if you have more trouble’ spiel. I was pretty sure I’d never hear from them again, so I put it aside and got to work changing all the locks and buying a stun gun.</p>\n\n<p>Two days later, another unmarked envelope appeared in my mailbox. I almost tore it up, until I realized the name on it wasn’t the previous tenants’. It was <em>mine.</em></p>\n\n<p>Inside was a key that looked suspiciously like the manager’s key (I remember him going door to door one day because he lost it) and another note in bright red sharpie.</p>\n\n<p><strong>SORRY. THOUGHT YOU WERE SOMEONE ELSE.</strong></p>\n</div>\n","author":"Miss_Michelina"}