{"rank":"5","title":"back scratches","id":"8kvl5b","url":"/r/nosleep/comments/8kvl5b/back_scratches/","time":"1526850657000","body":"<div class=\"md\"><p>I was a freshmen in high school and it was halfway through the year. Christmas break had just started and my friends and I knew the school faculty wouldn&#39;t be there. So, us being the rebelling teenagers we were, decided to sneak in at night. Saturday night rolls around and we were at one of our friends&#39; house. He [David] reminded us of our plan and told his parents we were going to go walk around outside for a bit. David lived across the street from the high school so he would break in pretty often with his guy friends and just mess around.</p>\n\n<p>It was about 5 of us. Nina, Alex, Jordan, David, and myself.. David was the only guy but him and Jordan were dating and she was my best friend so I was with her a lot. The walk to the school at 10 o&#39;clock at night was just as it sounds... Kinda fucking scary. I had just turned 15 at the time so I was in the phase of trying to do everything my friends wanted to do to fit in and look cool. Yes, I had always loved horror movies and always watched disturbing YouTube videos, but actually being in one made me have second thoughts.</p>\n\n<p>We walked up to the fence of the school parking lot and the gate was open, which was odd but we brushed it off as the janitor forgetting to close it. But my friends Jordan and Alex saw it as a red flag and wanted to wait outside for us. Alex was only 13 and obviously no 13 year old is going to break into a high school they don&#39;t go to at 10 pm. While Jordan was scared of getting caught and getting kicked off water polo, which is fair. I had offered to stay with them or to just turn back and go home, but David and Nina really wanted to go in.</p>\n\n<p>Finally, we were walking through the parking lot next to the school&#39;s pool and tennis courts when we realized there were no lights on whatsoever. Which was weird for our school considering they always leave the lights in the tennis courts on. No matter what, those lights are always on but for some reason they were off... During the summer they&#39;re on, breaks they&#39;re on, hell even during the day the lights are on. The school never turns them off. But us being the stupid teenagers we were, we continued and just laughed about it.</p>\n\n<p>When we finally reached the doors of the back of the school, we debated picking the lock or hoping the fence. Me being silly tried to open one of the doors as a joke, and surprisingly enough, they opened. The second we walked through the doors, my friend David decided to tell me and Nina why he would always break in. He was a skateboard fanatic so I always thought him and his skater friends would just skateboard around the open school, knock trashcans over and do the stereotypical douchebag teen shit. But turns out, him and his friends had a completely different reasoning. He started telling us this bullshit ghost story that I didn&#39;t believe for a second and when he finished telling it I looked over at Nina and knew she didn&#39;t believe him for a second either.</p>\n\n<p>Basically the story was that there was this freshmen around 10 years ago, that got bullied a lot. Bullied to the point where he hung himself in the guys locker rooms during school. Our high school is an IB league, high rated school so they didn&#39;t want suicide on their record and decided to burry his body underneath the school. And I&#39;ll admit, I thought he was telling the truth till I heard the burying under the school thing. But I wanted to fuck with him so I started asking him questions like,&quot;Why did they wanna cover it up,&quot; and he looked at me dead in the face and answered all my dumb questions dead serious like he was reading from an article he wrote himself on the topic. But I still didn&#39;t believe him so I asked where he heard this and he said he read about it online and I could search it up when we got back to his house. But hearing him sound so confident about this whole story made me eerie because if he was messing with us he wouldn&#39;t tell us straight to our faces to look it all up.</p>\n\n<p>A quick side note: The high school is outside. The only halls is just filled with classrooms on both sides and there&#39;s no lockers.</p>\n\n<p>Our high school was pretty big and had over 4,000 students at the time but when we had just finished talking about his story, we were in front of the 700 building. The hall was dark and longer than I remembered it looking in the daylight. It was pitch black because there was a roof over us but we could still make out something being in that hall. We didn&#39;t know what it was, but we knew if it were a person they would&#39;ve heard us by now, and if it was a teacher they would&#39;ve reported us for trespassing even though the gate was open and the door was unlocked. But we embraced our inner <em>white girl in a horror movie</em> and kept walking towards it. It didn&#39;t dawn on me until Nina leaned into my ear and whispered,&quot;Does it look like it&#39;s moving to you?&quot; so I took a second to really look at the object then I realized, it was moving. So I took out my phone, turned on the flashlight and shined the light towards the foreign object. It was a desk?</p>\n\n<p>I looked around and there weren&#39;t any other desks anywhere else, and for some reason this desk looked like it was moving earlier. &quot;Why the fuck is there just a random fucking desk in the middle of the hall?&quot; David spat out of nowhere. I was glad I wasn&#39;t the only person thinking that. Then Nina chimed in with,&quot;I don&#39;t know. Maybe a demon that hates school dragged it out here.&quot; We all started laughing and just continued brushing everything off. Once we finally reached the desk, David thought it&#39;d be funny to sit in the desk and act possessed so that&#39;s what he did. At first it was funny, then he started to actually scare us when he brought up &quot;Why&#39;d you guys scratch me?&quot; I thought maybe he was just being David and told him to smile before taking a picture with him in the desk.</p>\n\n<p>He got up and we continued to walk down the hall, now with some light on us because I refused to turn off my flashlight. David kept touching his back but I thought he was just trying to continue on with his bullshit. First the dead kid story, now someone scratched him. He did stuff like this a lot so me and Nina knew not to take anything he says to heart. David stopped in front of me and ran over right next to a classroom. He picked up a ball he found on the ground and bounced it down by the desk jokingly. We heard it bounce, but it sounded like it took longer than it should&#39;ve to hit the legs of the desk. I found it kind of suspicious but put it in the back of my mind because I didn&#39;t wanna look like a wimp.</p>\n\n<p>By now, we were outside and just walking around. But for some reason David stopped out of nowhere and started walking back towards the hall where we saw the desk, so me and Nina followed. We looked inside and our hearts dropped. There was no desk anywhere. I looked at the ground and the ball was by David&#39;s feet instead o fly the desk. &quot;Fuck this I&#39;m out.&quot; David said before storming off. &quot;Wait are you sure the janitor didn&#39;t come and move it?&quot; I asked, trying to rationalize things and overlook the ball. I blamed the wind and just wanted to reassure my friend. &quot;if it was the janitor... 1: Why would they be at school during a break? 2: The janitors don&#39;t stay this late. 3: There&#39;s no cars in any of the parking lots. 4: We would&#39;ve heard someone. And 5: We haven&#39;t been over here that long... 2 minutes tops.&quot;</p>\n\n<p>I looked at my phone, he was right. The time I took the photo was 10:32, and it was only 10:33. we went back outside and sat on the ground for a few minutes talking about what we should do. A few minutes went by and we decided to just sit and chill for awhile and if anything else happened we&#39;d head back. My senses finally kicked in when I thought I heard someone whispering. So I looked around, David and Nina were on their phones looking at memes on Instagram, they weren&#39;t talking. I stood up, and caught their attention. &quot;Did you guys hear that?&quot; They stood up after I said that. &quot;No...&quot; Nina replied quietly. I had finally had enough of being on edge and Nina could tell, she asked me if I wanted to go and I said yes. So we left.</p>\n\n<p>We walked back and told the story to the rest of the group while walking to David&#39;s house. The rest of the night we just hung out and we only brought up what had just happened when David came out of the bathroom and showed us his back. There was a huge scratch mark on his back and dried blood on the inside of his shirt. He said it didn&#39;t hurt anymore and he only showed us because the same thing happened to his friend the last time he went to the school at night.</p>\n\n<p>So when I got home I did my research and was trying to see if maybe his story had <em>some</em> truth to it. I couldn&#39;t really find anything. Yes there had been a few deaths near the school but I couldn&#39;t find anything about deaths in the high school itself. Until it hit me that school was right in front of the Indian Reservation. Needless to say, I felt like I was in Poltergiest when I came back to school.</p>\n</div>\n","author":"heradical"}