{"rank":"42","title":"Something appeared in a photo I took","id":"8kvxtv","url":"/r/nosleep/comments/8kvxtv/something_appeared_in_a_photo_i_took/","time":"1526853869000","body":"<div class=\"md\"><p>I&#39;ve always been interested in the supernatural so maybe I&#39;m overanalysing this, which is why I&#39;m posting here to see if anyone can help me to explain this.</p>\n\n<p>I was a little stressed today so I decided to go for a walk and listen to some music to get in a better head space. I made a decision to walk up to the sports centre - basically a huge open area with sports fields and tracks and such things - near my house, since I thought it would be nice on a warm day. I was wandering through the centre with my earphones in and I was feeling very nostalgic (since I have lived in this area and visited this place since I was a child) so I started taking some photos to capture it.</p>\n\n<p>Just as I was strolling up beside an athletics track I was familiar with from my school days, I looked over to my left and spotted a children&#39;s park. I vaguely remembered having gone there as a child in the summer, years and years ago when it was still popular. I felt a sense of unease but kept my eyes on it as I walked further up the path I was following. I should probably mention at this point that it tends not to be very busy, the people that go there generally consist of sports teams - who usually stick to the main fields - and dog walkers and runners. But even with all those groups, the space is so vast that you can often walk long stretches without really crossing paths with anyone else. As I was walking up this current path the only people I saw were two men walking their dogs but they soon passed me and walked off to where I had just come.</p>\n\n<p>I paused to take a video of a patch of dandelions I had just spotted but I couldn&#39;t help but look back at the park. Despite it being a bright day, something felt odd, and I suddenly was very conscious that I was alone. Perhaps it had something to do with all of the horror material I&#39;ve consumed over the years because, although it was obviously supposed to be fun and kid-friendly, the carnival theme was off putting in the quiet atmosphere.</p>\n\n<p>But regardless, I was feeling nostalgic so I decided to snap a photo.</p>\n\n<p>This was the photo I took: Park <a href=\"https://imgur.com/a/2hnfIoq\">https://imgur.com/a/2hnfIoq</a></p>\n\n<p>I didn&#39;t think much of it at the time and simply continued on my walk. However, when I got home I was looking over the photos and when I zoomed in to get a better look, this is what I saw: ??? <a href=\"https://imgur.com/a/cK6YGyf\">https://imgur.com/a/cK6YGyf</a></p>\n\n<p>I distinctly remember looking at the park for a good for minutes and thinking the distinct lack of children/people was unnerving. So, this doesn&#39;t make sense. There are a few issues I have with it: 1) why are the figures in black and white even though the rest of the photo is in colour? Is it a camera problem or...? 2) they simply don&#39;t look &quot;real&quot; in relation to the rest of the photo 3) I can&#39;t recall anyone being there, or even around in the first place...</p>\n\n<p>I messaged my friends about it later in the day and one of my friends told me this:</p>\n\n<p>&quot;I always used to go and as I grew older, we went less. But one day I went and I was a bit older and I realised how run down it was, bc half of the rides didn&#39;t work and I think it was always being vandalised. It was run by a family who&#39;d had it for years,and I think eventually they got sick and had to close it down. It&#39;s so weird because it&#39;s so abandoned now, I didn&#39;t realise it had closed until a few years ago. I definitely know that it was run by a really ancient family of gypsies though&quot;</p>\n\n<p>I was thinking about going back to check it out and see if there is any way someone could have accessed the park (though logically it&#39;s not far fetched to believe they could have hopped a fence). Something just feels weird about it, and I&#39;m eager to investigate.</p>\n\n<p>Until then though, if anyone has any explanations for this or has any information about strange things appearing in photos, I&#39;d greatly appreciate it.</p>\n</div>\n","author":"Isobeeeee"}