{"rank":"18","title":"The Ghost In My Hotel","id":"8kwaql","url":"/r/nosleep/comments/8kwaql/the_ghost_in_my_hotel/","time":"1526857203000","body":"<div class=\"md\"><p>Hey, nosleep! I&#39;m a long time lurker here, and honestly never thought I&#39;d be posting. But here I am, about to tell you my story.</p>\n\n<p>A little over two months ago, I got a job working front desk at a hotel full time. So far, it&#39;s been the best job I&#39;ve ever had. Of course, there are rude guests and I get blamed for a lot of things that housekeepers have done, but it&#39;s still a wonderful place.</p>\n\n<p>Well, until I noticed the ghost.</p>\n\n<p>I first noticed him while talking one day with my general manager. I was standing at my computer behind the front desk, and my GM was on the other side, as a guest would usually be. Directly behind my GM across the lobby were the closed doors to the breakfast room.</p>\n\n<p>The GM and I were talking when one of the doors swung open violently. It smacked against the wall, then slowly started to shut again. The GM and I were startled, but he laughed it off.</p>\n\n<p>&quot;Oh, that&#39;s just our ghost.&quot; He said, as if it were nothing. &quot;He likes to say hello sometimes.&quot;</p>\n\n<p>But he didn&#39;t know I&#39;d locked those doors a few hours prior.</p>\n\n<p>The next time I encountered the hotel ghost, I was alone. You see, reddit, I work alone there a lot. My shift is 3pm to 11pm, and I&#39;m usually alone after 5pm.</p>\n\n<p>I was on my knees to give myself a break from standing, scrolling through nosleep. It was around 9pm. I had the TV behind the front desk on and set to Animal Planet for background noise.</p>\n\n<p>When you walk into the hotel lobby, the front desk is on your left, breakfast room on your right. Right in front of you is a beautiful wooden staircase that leads to the second floor. That staircase is where I saw him.</p>\n\n<p>I heard the sound of footsteps coming down from the second floor and started to stand up, assuming it was a guest coming down for towels or an extra TV guide. I kept my eyes fixated on my computer screen, hoping to finish the paragraph.</p>\n\n<p>From the corner of my eye, I saw a figure descend the stairs. Quite obviously male, and at least 6 feet tall. But when I looked up to greet him, he was gone.</p>\n\n<p>There was no one on the stairs, no one in the lobby, and no one in the breakfast room. I shrugged it off for a while.</p>\n\n<p>Then, around 10pm, I heard footsteps on the stairs again. This time, it sounded like they were SPRINTING.</p>\n\n<p>I prepared myself for a very angry guest, but no one came. I clearly heard the footsteps come down the stairs and stop right at the gate to the front desk, which is less than 3 feet from me. But there was no one there.</p>\n\n<p>Well, I guess there was someone.</p>\n\n<p>Before I could even take a breath, the gate rattled furiously, as if someone were shaking it. It stopped after a few seconds, and the lobby went dead quiet. No Animal Planet. No A/C. Nothing.</p>\n\n<p>This ghost now periodically makes himself known to me. I see him walk down the stairs from the corner of my eye almost every night I work. He has also spoken to me twice.</p>\n\n<p>The first time, I was in the breakfast area, grabbing some creamer for our coffee display. I clearly heard a male voice behind me say &quot;Hello!&quot; but when I turned to greet a guest, there was no one there.</p>\n\n<p>The second time, I was up on the 4th floor delivering towels to a guest at nearly 10:30 in the evening. I was headed back to the elevator when I heard someone say &quot;Kaity! Come here!&quot;</p>\n\n<p>I don&#39;t typically give guests my name, but it is displayed on my chest for everyone to read. I whipped around in surprise, but there was no one there. I never heard a single door on the floor open or close either.</p>\n\n<p>Side note: the housekeeping closets. These rooms are on every floor and they house the maid carts when the housekeepers aren&#39;t using them. These rooms always give me an extremely uneasy feeling, like there are eyes in every corner of the room. They are also always unnaturally warm, but none of my other coworkers seem to think so when I bring it up to them.</p>\n\n<p>At this point, I don&#39;t know if this spirit is friendly or not, but he definitely seems to like me. What should I do, reddit? Should I try to talk to him?</p>\n</div>\n","author":"PlushChestFriend"}