{"rank":"1376","title":"things I saw/heard as a coast guard officer","id":"8kwb2s","url":"/r/nosleep/comments/8kwb2s/things_i_sawheard_as_a_coast_guard_officer/","time":"1526857286000","body":"<div class=\"md\"><p>So I&#39;ve heard so many god damn park ranger stories on here I wanna punch smoky the bear in the face and start a forest fire. My cousin is a park ranger and tells some fucking tall tales, bordering on whoppers. That being said they are inspiring and well written stories. After my nephew showed me those I thought I might contribute here, because I too had a very dangerous job in a scary and remote place(AKA the sea) for many years.</p>\n\n<p>It is true that the job can be dangerous, but as far as scary stories go, missing 411 is about as real as it gets, outside that, I would take the rangers for a grain of salt. But you wanna hear some stories? I got some pretty freaky shit for you. I experienced and heard about some pretty scary and hard to explain things while I was in the US coast guard. As you can tell by my username I have quite a sense of humor, but this is no joke. Theres stuff that happens in the ocean that will give you the fucking chills.</p>\n\n<p>There&#39;s lots of different job oppurtunities in the coast guard, some of the young bucks join right out of highschool. Most of the time we are nice to them. If they were particularly unsavory, then they might be subject to a bit of hazing.</p>\n\n<p>One day an AMT complained about having to clean the kitchen, so we painted his toenails while he was sleeping. It was all in good fun. Through my 8 year career, I tried to get along with everyone. When your well liked and trusted, you might hear some things. One particularly creepy story I heard was from a captain I served under in 2008.</p>\n\n<p>He told me they were off the coast of alaska, doing a 6 week patrol in a WMEC (270ft)cutter when it happened. There was this new kid who just joined up working on his ship. He did his job decently enough but he talked so little, he was nearly mute. Nobody really thought much of it, there a quite a few hard boiled stone faced dudes in this field, so it wasn&#39;t viewed as anything that wasn&#39;t normal.</p>\n\n<p>The captain just felt really weird about this kid for some reason. Ben, I think his name was. So they were nearing the end of their patrol, everyone was relieved to get off the damn boat and get some real sleep I&#39;d imagine. The captain was on watch when he looked over on the port side(left for landlubbers like you) and saw what he thought was hands grasping the side.</p>\n\n<p>He said it was dark out, and he didn&#39;t want to raise the alarm for man overboard until he could confirm there was actually someone hanging off the side. He didn&#39;t have to wait long.</p>\n\n<p>He said he saw the black shape of a person crawl onto the fucking ship. Obviously I don&#39;t need to tell you how utterly impossible it is for somebody to just climb onto a 270 foot ship in the open ocean. So he raises the alarm, and him and 5 guys go looking for this person. He said at this point everyone thought he was having a laugh.</p>\n\n<p>So they find nothing, and everyone goes back to what they were doing. The captain was thoroughly creeped out already, but this was about to get even weirder. when they disembarked, Ben was gone. All his stuff was still by his bunk, nothing out of place. nobody saw him leave, or fall over board. The ship was searched and there was a whole investigation, but nobody ever found out for curtain what happened.</p>\n\n<p>The captain then leaned in really close and told me,</p>\n\n<p>&quot;But I know. Whoever...whatever.... climbed on the ship that night, took Ben.&quot;</p>\n\n<p>That story gave me a bad vibe and I&#39;ll remember it for a long time just because of how seriously strange the whole thing was. </p>\n</div>\n","author":"wetblumpkinbilly"}