{"rank":"18","title":"Myspace is Myspace","id":"8kwdej","url":"/r/nosleep/comments/8kwdej/myspace_is_myspace/","time":"1526857909000","body":"<div class=\"md\"><p>So the story starts 2006 back when Myspace was very popular.  My little sister Baby was very active on the site remaking her profile, adding and chatting with random people daily. She started telling her friends she has a boyfriend named Marcus in Atlanta and when his family comes to visit other family members they would meet up....we lived in a small suburb outside of Chicago called Sauk Village. I scolded her about telling random people where we live and how dangerous it was. She stated she only told him what town its not like he could immediately find her.....</p>\n\n<p>They continued speaking via Myspace and eventually text into 2007 when Marcus informed her he and his family would be in Chicago and that they should definitely meet up to hang. She agreed but never spoke a word about it to anyone. The Friday spring break was set to start I made it in the house after school and started my chores, it was weird because Baby would usually get home at the same time as me as high school let out at 245 and she got out at 315. By 5pm I noticed she still had not come home, I went searching for her leaving the back door unlocked just in case she popped up while I was gone.</p>\n\n<p>I went to her friend&#39;s house who stayed 2 blocks away and they said &quot;The last time we saw Baby was when school let out and we were walking down the trail&quot; I checked with other friends and they all confirmed they had not seen her. while talking home I noticed a black Nissan Altima with Georgia tags driving very slowly around my block. I got that weird feeling like static running from my ears to my feet so I jumped the back gate and ran into my back door. I continued calling Baby&#39;s phone and family members then I heard the computer ping. I noticed Baby was still logged into myspace so I read her messages thinking maybe there would be a clue there...</p>\n\n<p>The first few messages were her friends telling her I was looking for her and she needed to get home before she got in trouble but the 4th down was Marcus. The message read &quot;Baby I&#39;m on your block I just saw you jump that fence why are you hiding from me?&quot; I was shook. what did he mean he saw her jump a fence so I read through their thread and to my horror I realized that she had sent him pictures with the both of us in it and never clarified which one she was. our mother didn&#39;t allow her to post pictures of herself on her profile so it was very easy to assume she was which ever one you wanted her to be.</p>\n\n<p>While I was reading through the thread I hear a car door slam 2 male voices approaching my front door and then I hear beating on my window. I go to my window since its light taps and I can hear Baby&#39;s voice urging me to open the window. I open the window she slides in and turns off the light. pulling my hand into the closet with her. She said Marcus is not 13 like he said he is old like 31. he saw me and asked where my sister was so I&#39;ve been avoiding the house. I scolded her and said she should&#39;ve come home 1st. the banging on the door grew more intense then I heard foot steps on the back patio I panicked because I couldn&#39;t remember if I locked the door or not.</p>\n\n<p>Just then my question was answered I head heavy foot steps coming down the stairs into the place that we were in I took out my phone and called 911 I whispered my address and police. I heard a voice say &quot;Baby where are you? with a sinister laugh to follow&quot; a crack of light shone through the closet which meant he was in my room. Tears started streaming down Baby&#39;s face....then the person in the car started beeping the horn crazy. he ran out of the house and I heard tires peel off. too scared to move I put the phone back to my ear and the operator said &quot;the police are outside&quot; I refused to move actually my legs refused to move.</p>\n\n<p>The police came downstairs and said ladies its okay to come out now the house is all clear. we ran out to jumped on the officer. We printed all of the messages and gave her log in info to the investigators. the person left finger prints on the door and wall so they had fingerprints. we didn&#39;t hear too much after....</p>\n\n<p>fast forward to 2018. I&#39;m on facebook and I posted a transformation picture of baby and I in a group. then I went to work. When I got off I had a message from someone named Marcus saying &quot;you got away once, but I will get you next time.&quot; I immediately put a request in to delete my profile...</p>\n\n<p>I am planning to arm myself and Baby. We will not be victims again.</p>\n</div>\n"}