{"rank":"0","title":"Nerve 1//12","id":"8kwd2d","url":"/r/nosleep/comments/8kwd2d/nerve_112/","time":"1526857820000","body":"<div class=\"md\"><p>I sat on my phone. I scrolled threw my instagram looking at photos. I sat there bored. I scrolled and scrolled. <em>Buzz,Buzz</em> my phone went. It was a call from Angie. I picked it up. </p>\n\n<p>“Hey Girl whats up?” I said. </p>\n\n<p>“Did you hear about the new app nerve?” Asked Angie.</p>\n\n<p>“No why?” I said back. </p>\n\n<p>“Go watch me i will send you a link.” She said and hanged up. </p>\n\n<p>On the top of my screen a text message from Angie was a link. I clicked on it and it sent me to a website called nerve. 2 words said Player or Watcher. I looked at it confused and like a dumb ass I clicked player. Then in a machine voice it said </p>\n\n<p>“Welcome player. From this point on you will complete dares for money. The player with most views will win the jackpot. But whatever you do don’t snitch at all. You must compete the dare of death will come your way.Dare or Dare?” Said the machine. </p>\n\n<p>Then on the screen popped up a dare. It said dare then read-</p>\n\n<p>“Dare-Go on your roof naked for 100$. Swipe right if your willing.” It read.</p>\n\n<p>I thought is it worth it for 100$ but without thinking I swiped right. I clock started ticking down from 10. I quickly took my clothes off. In the bottom left a number rised from 10. It said 58 viewers. I sighed and ran out my door. Luckily i was home alone. I ran up into the attic. Dust covered my feet as i got to the stairs to get upstairs. The clock said. </p>\n\n<p>“20,19,18...”</p>\n\n<p>I gasped and opened the rusty door. I climbed up the ladder and slowly climbed on the roof. I got on the roof and I pointed the camera around. The clock stopped and then the words </p>\n\n<p>“You did it!” </p>\n\n<p>Appeared. I smiled and slowly climbed back down. I slowly walked to my room. I sat on my bed putting my clothes on. Suddenly in big caps on my phone appeared-</p>\n\n<p>“Dare-Go in public and kiss a stranger. 300$” </p>\n\n<p>Without reading a swiped it and then i looked down it repeated it reminding. I read it and gasped. I got up. </p>\n\n<p>“Oh shit oh shit.” I said scared. </p>\n\n<p>i closed out the app and deleted it. I sighed in relief and fell on my bed. But the app popped up and read-</p>\n\n<p>“You agreed to the rules. You now must pay for not obeying them.” It said then a death skull emoji. I shaked my head and put my phone down. Suddenly my phone vibrated non stop. I picked up my phone and on it, a message popped up saying</p>\n\n<p>“YOU HAVE A DEADLY VIRUS.” </p>\n\n<p>I gasped. </p>\n\n<p>“Oh shit. My mom is going to be pissed.” I said.</p>\n\n<p>I stood and looked around frantic afraid her mother will find out. Then the message turned to new words stating-</p>\n\n<p>“YOU WILL DIE. YOU WILL DIE. YOU WILL DIE. YOU WILL DIE.”</p>\n\n<p>Over and over. In a quick panic I slammed my phone on the ground and it stopped.</p>\n</div>\n","author":"MrCreepypasta_"}