{"rank":"59","title":"Why I'm Doing This","id":"8kwhht","url":"/r/nosleep/comments/8kwhht/why_im_doing_this/","time":"1526859027000","body":"<div class=\"md\"><p>I have been contemplating for three days and three nights this decision, and I have come to the conclusion that I will be taking my own life.  There is nothing more for me in this world.  No, I do not care about the sunsets in the west, the flowers that will bloom, the food I’ve yet to taste.  I will not miss any of it.  There is no reason for you to feel pity over me.  Instead, simply think of this as my formal suicide note.</p>\n\n<p>I met her in the summer last year.  She was so beautiful, with golden curls that cascaded past rosy cheeks and fell at her breast.  It’s hard to believe she took an interest in stupid me first instead of the other way around, but that’s the way it happened.  She grinned and laughed at my smart ass remarks, and then proceeded to ask for my number.  I wasn’t really interested in other people at the time and debated giving her a fake number.  I’m so glad I didn’t.</p>\n\n<p>I think she was lonely.  That’s really the only reason I can think of for her to ask a gas station employee for their number.  As I found through our text conversations that night, she’d split from an abusive boyfriend only a week prior and was at a crossroads as to what to do.  She had no friends that weren’t off shooting up drugs, and her parents were cold as ice to her even though they were letting her stay with them.  She had disappointed them in her choice not to go to college, she said.  She must have felt so isolated and alone before she met me.  To be honest, I did too.</p>\n\n<p>I hadn’t really had any friends since high school, and I was just some snarky loser who was spinning her wheels.  I was in a total rut.  If she hadn’t come along when she had, I probably would have killed myself during that summer.  But she did, so I didn’t.  Just like that, she became my reason to live.</p>\n\n<p>We were only friends at first.  I didn’t think anything would escalate any further, really.  I didn’t even know I liked girls until she kissed me on Halloween.  Before then, it was just us, ruling the world of the losers.  I learned so much about her.  How she wanted to be a writer and write books from the comfort of her own home.  She wanted to run away to New York as soon as she had enough money to keep herself alive, and she wanted me to come, too.  I told her I would.  Anything had to be better than our dusty, conservative hometown.</p>\n\n<p>Then she kissed me,  and after that we were a little more than friends.  In winter we snuggled in each other’s arms and built gingerbread houses.  We watched the stars together before pelting each other with hundreds of snowballs.  In spring we shared hot chocolate and planted a garden together.  She was in charge of the flowers, I was in charge of the vegetables.  Everything was perfect.  She was perfect.  We talked about getting married once she got her first book published.</p>\n\n<p>Summer began in the same passion as the previous seasons.  We finally made love to each other, as well as finally had a plan to escape to New York.  But all good things must come to an end, I suppose.  For us, it came to a close in a screaming halt.</p>\n\n<p>I wanted to surprise her for her birthday.  It was early morning, both of her parents were gone for some sort of vacation to the Bahamas.  I knew right where the extra key was and let myself in, heading straight for the kitchen to quietly prepare her favorite breakfast, waffles and bacon.  I brought the plate to her room along with the gift I had prepared-- a small box containing the most beautiful diamond ring my budget could afford.</p>\n\n<p>How beautiful she looked in her sleep, even draped in the arms of a naked stranger.  She was so peaceful, with a sweet smile gracing her wonderful lips as she nuzzled her head into his chest.  He snored, she purred.  I screamed.</p>\n\n<p>A lot of people say they black out when it happens, or that they see nothing but red, or that they act simply on pure animal instinct.  That wasn’t the case for me.  I knew what I was doing.  I was aware of every breath, every action I took.  The only involuntary thing I did was drop the plate, shattering it and her birthday breakfast at my feet.</p>\n\n<p>They were confused when my scream startled them awake.  Their eyes were hazed with sleep and their movements were sluggish as they untangled their bodies from each other, their sweaty, naked bodies.  They didn’t even seem to realize what was happening as I slid open her top drawer in her dresser, my hand searching for and wrapping around the marble switchblade she keeps between her lace panties.  For self protection, she said.  My head turned to face the dazed couple, and I smiled at them when she finally got her bearings and recognized me.  The color drained from her face as she realized she’d been caught in someone else’s arms.  When she saw the knife, she opened her mouth and started to say something.  It was too late.</p>\n\n<p>Her apologies fell on deaf ears as I strode over to the bedside.  I was hurting, and I needed her to feel that pain too.  The first cut was the hardest.  The knife was somewhat dull, making the slice through his chest slow and jagged.  His screams were music to my ears, which turned into a hit soundtrack once her shouts joined in.  He was struggling against me.  Blood-coated hands took a hold of my arms and pinned them above my head, but I was not yet done with him.  I grinned ear to ear at him before I opened my mouth and took his throat between my teeth.</p>\n\n<p>The metallic taste of his insides made me wretch, but I managed to hold my bite down.  He was yelling again, screaming for her to get me off of him, screaming for her to help him.  She was in shock, though, and proved useless in his struggle of life and death.  Underneath my teeth, I felt his veins snap and crush.  His grip slackened on my hands.  I broke free and stabbed him again, right into the stomach. My jaws let go of him as I stabbed him a third time and a fourth time, again and again and again as his movements fell slow and then nonexistent beneath me.</p>\n\n<p>When I was sure he was dead I left the knife inside his body and stood up.  She was frozen in place still.  I marvelled at how pretty she was even with the small splatter of crimson on her cheek and the horrified expression on her face.  She was staring at him.</p>\n\n<p>I walked to her side of the bed and sat next to her.  My hands were red as I extracted the black box from my pocket, but that was no matter. It would clean off. With my thumb I turned her chin to me so her eyes met mine, and then I smiled and kissed her forehead so lovingly. I took her left hand and placed the ring on her finger with gentle touch.  She was crying, to my delight.</p>\n\n<p>“Happy birthday,” I told her with a warm smile.  She sobbed and sobbed and looked at his body.  My moment of happiness was robbed away once again.  Why did she look at him, even now?  Why wouldn’t she look at me?  Why wouldn’t she look at me?</p>\n\n<p>The fight she put up was considerably weaker than his.  My fingers were so tight around her throat as I shoved her back against the pillow.  I straddled her, my legs pinning her struggling arms to her sides as her life began to fade.  She was finally looking at me again.  I smiled as my happiness returned, and I gazed back into those beautiful ocean blues, losing myself in her visage all over again.</p>\n\n<p>It took several minutes before I realized she was dead.  She no longer struggled against me, no longer whimpered under my palms. The glitter in her eye was gone.  I’d killed her.  I’d done it.  I’d taken the love of my life away.</p>\n\n<p>I fled, managed to get back to my apartment without anyone noticing the blood. I have not moved from my bedroom since.  Her parents will be back tomorrow, and they will find the bodies.  I am not scared of being arrested, though.  Far from it, really.  I feel empty.  I’ve lost my other half, I’m incomplete.  There is no reason for me to remain here.</p>\n\n<p>I don’t know how many people will read this.  I don’t know if anyone will even care.  I don’t really know.  I live alone, my parents are long gone, I have no friends, no lover anymore…  I just want someone to know.  I need someone to know what I’ve done and why.  I don’t care if you hate me for it.  I hate me, too.</p>\n\n<p>Okay.  I’m ready now.  I’m using a kitchen knife, I’ve decided, to stab myself, but if that doesn’t work, I’ll also be cutting my wrists and arteries.  Cliche, right?  I don’t mind.  I’m a sucker for cliches anyway, and I deserve the pain otherwise.</p>\n\n<p>To you who read this.  Thank you.  We have never met, but now my final memory is with you forever, and that’s pretty intimate in a way.  It’s fine if you choose to forget me as well.  Just that small moment of knowing is all I want.</p>\n\n<p>To the girl I love.  I’m so sorry for what I’ve done, but I am coming.  We will be reunited once again.  After all, we’re soulmates, right?</p>\n</div>\n","author":"karrnelius"}