{"rank":"16","title":"Telekinesis","id":"8kwiiu","url":"/r/nosleep/comments/8kwiiu/telekinesis/","time":"1526859330000","body":"<div class=\"md\"><p>The first time it happened was back in middle school. I had stayed out late. Up until around midnight to be more exact. I took the usual route home. The ghetto isn&#39;t a nice place, especially not at night. Not like my parent gave a shit. Yes... just parent. There are no street lights in a ghetto, at night everything&#39;s just dark and rotten. Abandoned homes, crack houses, whores and gangsters - That&#39;s the recipe for your average ghetto. But that night was strange. Silence had flooded the neighbourhood. Not a soul, not a sound. The odd ambience I felt stopped me in my tracks. That&#39;s right, a middle schooler standing in the middle of the night, in the middle of the ghetto, in the middle of the street. Defenseless and unbothered by it, just staring into nothingness.</p>\n\n<p>And then a loud bark clapped against my eardrums, forcing me out of my delirium. I remember being so shocked that I cursed at the top of my lungs. I wanted to stay in the silence. I wanted the darkness to comfort for a little longer.  The dog, however, had other plans. It kept furiously barking at me. Biting and clawing at the fence, it refused to keep quiet. I&#39;ll admit I was scared at first, but the fear faded almost instantly. Instead I was angry. That stupid dog wouldn&#39;t shut up and bedroom lights were being turned on.</p>\n\n<p>It was in that moment that it happened for the first time. I learned a little bit about myself that night. Something I never knew. Something I thought only possible in fiction. But I&#39;m special. I always knew I never belonged in that shithole. I wasn&#39;t like those bum gangsters and those retarded whores, I was... no.... I am different. Imagine being able to kill someone from 20 yards away just by thinking about it. That&#39;s called power. Or in sci-fi, Telekinesis. </p>\n\n<p>I probably should have been overcome with guilt or disgust. That&#39;s what the normal human reaction would have been. Death isn&#39;t something most humans are able to stomach. Humans are emotional beings, plagued by empathy, cursed with guilt. However, as one who tends to defer to logic over emotions, I saw an opportunity rather than a problem. Besides, who would miss some stupid dog from the ghetto. </p>\n\n<p>I shut myself in for the following weeks. As soon as I got home from school, it was door shut and locked and headphones on to drown out the arguing in the background. At first, the things I was able to do were rather basic. My control was also dreadfully amateur. Rocks, lego, CDs, books and my school bag. Those were some of the things I could move at first. And of course, cats and dogs. Anything equal to the mass I could carry was moveable. The precision and speed at which I could move those objects was the same story. Lacking. </p>\n\n<p>Despite, many frustrations, failed experiments and multiple eye bleeds, I continued. Diligence and conviction write history, and I knew if it was change I wanted I&#39;d have to do it myself. I was different after all, like diamond in a pile coal. Eventually, the fruits of my labour were ripe for the picking. Moving my school bag around my room turned into lifting pickup trucks 20 feet off the ground. Manipulating objects as if using hands, turned into manipulating objects at free will. Levitating two basketballs at once turned into pulling chewing gum from the corner store, while standing outside on the other side of the street.</p>\n\n<p>The strength and dexterity of my abilities had increased. Before I knew it I was stacking abilities  like freakin&#39; Jedi. Or, I guess, in my case, like badass Sith. High school became my playground. Students and teachers alike shared the rank of lab rats. By junior year I was doing things I used to dream about. Pranking people by telekinetically pushing or tripping, pulling weaves off girls&#39; heads, all of this and more from a safe distance. I could do anything I wanted and I&#39;d be home free.</p>\n\n<p>Originally I had planned on killing everyone in my hometown, all at once. Making there heads combust simultaneously - that was the original plan. However, I had come up with that idea back in middle school. Not to mention, despite my growth in proficiency, controlling or inflicting damage on hundreds of people at once was something I was simply still too weak to pull off. </p>\n\n<p>My anger still lingered though. I felt the same hatred for those people as I always had. In a way, I think that hatred fueled my growth. It prompted me to push myself. To continue to get stronger.</p>\n\n<p>Nonetheless, I didn&#39;t let that anger take any fun away from being a real-life freakin&#39; Jedi. The world was my oyster as they say, and I had to start off somewhere. Starting quarterback of the football team, as well as starting point guard and captain of the basketball team seemed like a good starting point.</p>\n\n<p>Being able to control not only my own body telekinetically but also the trajectory, spin and power of the ball made me a god amongst men. Throwing perfectly accurate deep passes on the gridiron to mediocre receivers. Hitting college range threes like open layups. I was Mr.Perfect, and everyone wanted to get a piece of me. Though, I get that sleeping with girls from the ghetto isn&#39;t exactly much of an accomplished per se, I won&#39;t lie and say that it didn&#39;t make me feel like the man.</p>\n\n<p>On the other side of things, my after school hours were spent researching and experimenting. I get that animals and insects are living things too, but I had to test on the something. Dissection, mutilation and skinning were a few of the activities I indulged in. My skill even reached the point to where I was able to forcefully manipulate the motor-skills of animals and insects. I transferred this to the football field, making oncoming defenders miss. In a subtle way of course. Being obvious would have blown my cover. In fact, everything I did, I did with caution.</p>\n\n<p>At home, however, things only got worse. The  welfare checks and my mom&#39;s job at the supermarket weren&#39;t enough to feed three hungry kids and bum, that called himself &quot;dad&quot;. The constant arguments, the screaming and shouting.  It all carried along on schedule. Every. Single. Fucking. Day. N-word this, bitch that. N-word that, bitch this. Always the same. A never ending cycle of shit and piss. </p>\n\n<p>As you can imagine, there came a point where I couldn&#39;t just turn the other cheek anymore. Hurtful words and drinking, became hard hits to the face and more drinking. And so I snapped. He no longer looked as big as he used to. Granted by senior year I was already 6&#39;1 and he was only 5&#39;11. What I really mean is his presence was no longer as intimidating as it once was. I was through with seeing him hurt my mother and little sister. Bullying them and pushing me and my brother around. I don&#39;t even want to think about how awful it must have been for my mother to have to sleep in the same room as that monster.</p>\n\n<p>His time was up. And he wouldn&#39;t be missed.</p>\n\n<p>Still, I had to remain cautious. I had to be smart about the situation. Even if it&#39;s the ghetto, killing someone is a crime. Though, I guess having killed a ton of stray cats and dogs already made me a criminal anyways. </p>\n\n<p>The plan was simple. I observed his night time endeavours until I became accustomed to his habits. A trip to the strip, followed by a stop at one of his loser friends places, then a beer from the corner store, maybe two, and finally off to home to beat the wife and fall asleep. </p>\n\n<p>I wish I had filmed it. Such a missed opportunity, but then again, one can&#39;t be too careful. </p>\n\n<p>Did you know there&#39;s this thing called tension pneumothorax. Basically, if your chest gets punctured somehow, say by gunshot or knife... or telekinesis. The hole starts to suck up air like a vacuum, which proceeds to build up causing increasing pressure to squeeze against the lungs. Eventually, so much air builds up that the lungs collapse, stunting one&#39;s ability to breathe. The air also pushes against the heart and other body parts causing immense pain. And if the issue isn&#39;t treated as soon as possible the person in discussion dies a painful death.</p>\n\n<p>There&#39;s so many ways to kill a living being. I&#39;d seen a ton of them by then, but none as enjoyable as that one.</p>\n\n<p>Now I know what you&#39;re thinking. What about the body? Shouldn&#39;t the killer always get rid of the evidence? Well, that would be the case... if there had been any evidence in the first place. You see, as far as I&#39;m concerned, I wasn&#39;t even there. No weapons, no sign of human contact. He probably couldn&#39;t even see my face, considering he was piss drunk and I was standing in the darkness at the back of the alley.</p>\n\n<p>That night my mother and my siblings slept peacefully. It had been a while since my mother had got some replenishing sleep. As a matter of fact, it had been a while for all of us. Though, for me it would evidently still be a while. </p>\n\n<p>Killing humans and killing stray animals are two very different experiences. I learned this the hard way. I spend the night drowned in my own cold sweat. As hard as I tried, I couldn&#39;t stop my hand trembling. I wanted to vomit but for some reason my body refused to let me. Like I was being punished. Morning came and I hadn&#39;t blinked in hours. Being awake never felt so painful. </p>\n\n<p>Though, seeing my mom and liitle siblings smiling alleviated some of the pain. The news was soon broadcasted. Brushed off as just another gang-related crime. No one gives a shit about the ghetto, and why would they. There&#39;s no hope in the ghetto. The whole reason why the ghetto exists is because there are people so useless, so uncivil that there&#39;s no point in allowing them to be a part of civilised society. Those people are dumped into the ghetto.</p>\n\n<p>Of course, don&#39;t get me wrong there are some hidden gems. You&#39;ll find unique individuals wherever there are people. Even in the ghetto.</p>\n\n<p>Life was going well for us. I mean, we still lived a crime ridden, disease infested dump, but atleast he was gone. I had received multiple scholarships to play college ball, both football and basketball. My grades were up and I&#39;d never felt more confident. My entire being radiated with life and energy. I was ready to take on the world. Ready to save my people from their dead-end fate, or at least those who were worthy. It&#39;s fair to say I had alot planned.</p>\n\n<p>But things never go as planned, unfortunately. In the summer after graduation that change came in the form of bad news. A woman and her two children brutally murdered in their own house. The weapon used remains unidentified. The crime itself most likely gang-related.</p>\n\n<p>I couldn&#39;t hold the tears back. Who could? You&#39;d have to be an actual monster. I could have saved them. I should have been there for them, not at some stupid football camp. There are no funerals for the poor. Just painful goodbyes.</p>\n</div>\n","author":"ochyspaton"}