{"rank":"347","title":"The old rope swing","id":"8kwn9e","url":"/r/nosleep/comments/8kwn9e/the_old_rope_swing/","time":"1526860668000","body":"<div class=\"md\"><p>To tell you the truth, I guess we were relieved at first when the children started to spend more time in the forest. So glued were they to their screens beforehand that it was easy to think that they wouldn’t know how to just pick up a stick and play. More than once the first question my niece, Kaylee, would ask me when we saw each other was “what games are on your phone?” When my sister and I would go out and eat, she would hand my niece an iPad the moment we sat down. Don’t get me wrong, I get it, kids are a hassle and it meant that she would be docile while we ate our food, but the brighter the screen, the bleaker the future looked. I missed the days of hide and seek and rope swings.</p>\n\n<p>So, when the kids insisted on going into the woods every afternoon, I let them. Like I said, it was a relief. The Xbox hadn’t been turned on in days, the TV remained off, and my phone stayed in my purse, far away from grubby kid fingers. It wasn’t like I didn’t know where they were. I played in that forest too when I was young. I just assumed that they were out playing near the old rope swing. They were always home before dark, and unbruised. If there was a warning sign, I didn’t see it.</p>\n\n<p>Though now I think that maybe I should have.</p>\n\n<p>Once, during dinner, Kaylee asked me for some rope. “What do you need it for?” I asked her, “is the rope swing busted?”</p>\n\n<p>She just looked up at me with her innocent smile, “It’s for the Forget-Man,” she said.</p>\n\n<p>The dining room went silent. Why do all imaginary friends have to have such unsettling names? &quot;Who is the ‘Forget-Man&#39;?&quot; I asked trying not to seem startled.</p>\n\n<p>The little one? Well, she looked up at me with the same smile and giggled. “You forgot because he doesn’t want to play with you anymore,” she said. My sister was not having it. She told Kaylee that only an adult could fix the swing, then she put the child to bed early.</p>\n\n<p>Once Kaylee was fast asleep my sister poured us some wine, her expression was far away, her gait weighed with indecision. She opened the glass sliding door to the porch and went outside into the cool night. I followed.</p>\n\n<p>The darkness out here in the mountains is complete. We could only see about ten feet out from the house, after that there was nothing but blackness, like the light had suddenly hit a wall. The silence out here is comparable, we are always just a degree removed from the void. She looked out into the dominating night, a gesture that was merely for drama, as there was nothing out there to see but total darkness. The night air was cold, cold enough that I could see gooseflesh prickle across her arms. “I don’t remember a swing,” she said finally, avoiding my eye contact.</p>\n\n<p>This had to be a joke. We spent our childhood on that swing. Literally, all of my favorite memories growing up involved that swing and my sister. “What are you talking about?” I asked, “You are pulling my leg right?”</p>\n\n<p>She turned to me then, her face flush of blood and her eyes wide. “Why would anyone put a swing out there? That’s <em>garish</em>!”</p>\n\n<p>She had to be fucking with me.</p>\n\n<p>“Garish? It’s the <em>woods</em> why <em>wouldn’t</em> you put a rope swing out there?” I asked a little incredulous.</p>\n\n<p>“You don’t remember, do you?” My sister asked, as if I was the one with memory problems. “They used to hang heretics in these woods by their feet, let them die slowly in the sun by asphyxiation or hemorrhage. It was like the first thing you learn about our town’s history!” She looked away from me and drank all of her wine in a single go. “Putting a rope swing out there is just morbid!”</p>\n\n<p>This didn’t make any sense.</p>\n\n<p>My laugh was hollow, if only to mask my own anxiety. I protested, reminded my sister of the time that we found it, how we would play on it all day, how I nearly broke my ankle jumping off of it. She just kept shaking her head. “None of that ever happened,” she said. “And what bothers me the most, is that the Forget-Man was your imaginary friend too.” She found the courage to look me in the eyes then, “I don’t want you around Kaylee, you leave tomorrow!” She then pushed by me and reentered the house.</p>\n\n<p>This had to be a joke.</p>\n\n<p>I chased after her, told her that this wasn’t funny, pleaded her with. Almost cried. She kept her back to me. This joke was cruel. &quot;<em>Come on!</em>” I pleaded, “<em>of course</em> you remember the rope swing, stop messing with me.”</p>\n\n<p>“I remember you luring me out to the woods,” she said in a near whisper, “I remember you tying my feet up with rope.” I didn’t need to see her face to know that she was crying. “I remember you telling me that you had to wait for the Forget-Man to show up because you were not strong enough to pull me into the tree,” her fists began to clench. “I remember you being a little psychopath and I thought you had grown out of it. Stay away from Kaylee. Leave tomorrow.”</p>\n\n<p>Nothing more was said. My sister went straight to her room without saying a word. I heard her latch her lock behind her. I did not stay overnight.</p>\n\n<p>I was distraught, even a little shaken. None of what my sister said could be true, but I knew that she believed it. I did not want to be ejected out of my niece&#39;s life, did not want to suddenly be kicked out of the family because of my sister&#39;s over-active imagination. I knew that we had photos, actual Kodak instant photos of the rope swing in storage. I went straight there.</p>\n\n<p>Time to see <a href=\"https://revfitz.com/forget-man/\"><strong>what I could dig up.</strong></a></p>\n\n<p>[<a href=\"https://redd.it/8lxllx\">Part Two</a>].</p>\n</div>\n","author":"revfitz"}