{"rank":"108","title":"An Abandoned Mining Town in the Appalachian Mountains","id":"8kwn3t","url":"/r/nosleep/comments/8kwn3t/an_abandoned_mining_town_in_the_appalachian/","time":"1526860628000","body":"<div class=\"md\"><p><a href=\"https://www.reddit.com/r/nosleep/comments/8gi8x2/ancient_evil_in_the_new_river_valley/\">Previous</a> |\n<a href=\"https://www.reddit.com/r/nosleep/comments/8lmr4l/virginias_only_haunted_attraction_thats_actually/\">Next</a> </p>\n\n<p>18 days ago, after posting my last story and receiving words of encouragement from you guys, I started crawling through the pages and pages of notes I had left over from my interviews. One in particular stuck out more than the others, and while the story itself isn&#39;t the scariest, what&#39;s happened since has caused me to put my house on the market and move as far away from the New River Valley as I can.</p>\n\n<p>In one of my interviews with Clyde dated 06/21/2008, he told me about a time where he had stumbled upon a ghost town up in the mountains while out on a hunting trip as a kid. Again I&#39;ll try to do it justice and I should preface this by saying that Clyde told me this story before he told me about the Wampus Cat.</p>\n\n<p>&quot;Once when I was ... probably 14 or 15 I found a ghost town while I was huntin&#39;,&quot; Clyde said from behind his 6th cup of coffee. </p>\n\n<p>I leaned forward eagerly, &quot;Do you know what the name of it was? What happened? Why was it abandoned?&quot;</p>\n\n<p>&quot;Easy son, I can only answer one question at a time. I didn&#39;t know the name then and I still don&#39;t know it now, its pretty normal to find old abandoned cabins and such up on the ridge but this was a whole town. I&#39;m talkin&#39; 15 houses and a general store. I aint ever seen it on no map and I never heard anyone talk &#39;bout it.&quot;</p>\n\n<p>&quot;Ok, but why was it abandoned in the first place?&quot; I asked, my pencil hovering above my notebook.</p>\n\n<p>&quot;I&#39;ll get there when I get there, I aint done tellin&#39; you &#39;bout it yet.&quot; Clyde replied. &quot;Near as I could tell, it was an old coal town. Course I only say that because I seen the boarded up entry further up the ridge. Anyway, bein a dumb kid I decided to poke around.&quot; Clyde stopped and sipped his coffee before continuing, &quot;I went in the general store and I&#39;ll tell ya, it looked like a damn museum, just covered in dust, nothin&#39; was out of place. All the shelves were still stocked and there was even some Confederate notes in the till, I took them with me, aint never found a Civil War anything I didn&#39;t keep for myself.&quot;</p>\n\n<p>I hastily scribbled &quot;Civil War mine town&quot; in my notes. &quot;Ok so what else did you see?&quot;</p>\n\n<p>&quot;I went in to 3 or 4 of the houses and it was the same as the store, everything looked like it hadn&#39;t been touched in 100 years, everything had a thick layer a&#39; dust on it, and the real spooky part was that it looked like people had just up and left. Some of the houses had the tables set like folks was &#39;bout to sit down for supper.&quot;</p>\n\n<p>&quot;Abandoned. In. A. Hurry,&quot; I said slowly as I scribbled the words in my notebook. &quot;Did you see anything that could have explained why everyone left so quickly?&quot;</p>\n\n<p>Clyde nodded, &quot;It was startin&#39; to get dark and I needed to get home soon or mama woulda worried, but I had to check out one more house &#39;fore I left. I decided to check the house closest to the mine entry.&quot;</p>\n\n<p>I felt myself involuntarily shaking with excitement, from a historian&#39;s standpoint, this was going to be an amazing story. &quot;What did you see? If you&#39;re pausing for dramatic effect, its definitely working.&quot; </p>\n\n<p>Clyde chuckled and continued, &quot;This house was a wreck inside. Looks like it was completely ransacked. Tables was flipped, dishes was broken, everything was just destroyed. At the time I figured some of them blue bellies (Union soldiers) had probably found out about the mine and came to shut it down.&quot;</p>\n\n<p>&quot;What do you mean &#39;at the time&#39;?&quot; I asked, my mouth now incredibly dry. </p>\n\n<p>&quot;I asked my uncle Joe &#39;bout it when I got home that evening, he told me it wasn&#39;t no Union fellas. Said he&#39;d heard a story when he was a kid, &#39;bout a mining town that had been abandoned because of some curse or monster or some such, somethin&#39; came out of the mine and attacked &#39;em.&quot;</p>\n\n<p>I felt the wind immediately leave my sails, &quot;A monster Clyde? Really? That&#39;s all you have for me?&quot; </p>\n\n<p>&quot;Didn&#39;t say whether or not I believed it,&quot; Clyde shot back with a sly grin. &quot;Just tellin&#39; you what I was told.&quot;</p>\n\n<p>&quot;... do you at least remember where it is? I guess it wouldn&#39;t hurt to take some pictures of it, if its still there.&quot;</p>\n\n<p>&quot;Course I remember where its at. Aint no one in the whole valley that knows them hills like I do.&quot; Clyde sloppily drew a map in my notebook and put a large &#39;X&#39; where the town was supposed to be, &quot;X marks the spot son,&quot; and with that Clyde called the waitress over to get his check and asked me &quot;same time next week?&quot;</p>\n\n<p>I nodded and smiled but I felt defeated. </p>\n\n<p>Sadly, that was as far as my adventure went, that is until recently. After some of you told me I should revive my book to honor Clyde, I decided to find that ghost town. </p>\n\n<p>Two weeks ago I set out in search of the mine, following Clyde&#39;s sloppy map proved difficult but not impossible. I drove for what felt like an eternity and found myself on a back road somewhere between Pearisburg and Narrows, very close to the West Virginia border. Clyde&#39;s map had proven true up until this point. I saw that I should have been approaching my next and final turn and slowed down. </p>\n\n<p>I passed the same small opening in the tree line probably 5 times before I realized that, that was the road I was supposed to be on. I gently urged that old 1950&#39;s Chevy Clyde had left me up the hill. After about a quarter of a mile the road ran out and I was met with nothing but trees. &quot;Of course, why wouldn&#39;t I have to hack my way through the boondocks?&quot; I muttered to myself as I climbed down from the cab. I grabbed my camera, my Nalgene bottle, and a small mag-light and started picking my way through the trees. I must have climbed that hill for an hour, even though Clyde&#39;s map said the town was only 3-3.5 miles off the road, the vegetation was thick and the hill was muddy which definitely slowed me down. </p>\n\n<p>When I finally broke through the tree line I found myself in a large clearing, and just as Clyde had said, I saw the ghost town. I quickly grabbed my camera and started snapping pictures. Everything was more or less as he had described it, save for the now collapsed general store. As a made my way through the town, taking pictures the whole time, I found myself in awe of the fact that it really did look as if everyone had vanished. I made my way toward the entrance to the mine, and just like Clyde had said, it was still boarded up. I turned to look at the house closest to the mine and noticed what looked like large and jagged claw marks all around one of the windows. Knowing now about the Wampus Cat, I felt my throat tighten. &quot;It was probably just some kids messing around back here that did that,&quot; I said to myself, trying to remain calm.</p>\n\n<p>I turned back to the mine and snapped a picture of the worn sign near its entrance. Through all the grime and chipped paint I could faintly make out the words &quot;DANGER INSIDE! KEEP OUT!&quot; I knew then that I should have left it at that, maybe taken a few more pictures and then headed home to forget all about this place, but something felt like it was calling me to the mine. </p>\n\n<p>The rotted boards broke away with minimal effort. As absently reached for my flashlight and I stared into the dark mouth of the mine. I thought I heard a loud whisper &quot;come to meeeee&quot; I froze and looked around, sure I&#39;d find some bumpkin laughing at my fear, but I saw nothing. That&#39;s when I realized that I couldn&#39;t hear anything other than my own scared breathing, no birds, no crickets, no wind, absolutely nothing. I&#39;m still kicking myself for what I did next.</p>\n\n<p>I took a deep breath as I clicked on my flash light and then plunged myself into the darkness. 150 plus years of mustiness and animal droppings filled my nostrils and I involuntarily wretched. When I regained my composure I could have sworn I heard a horse and throaty laugh come from deeper in the mine. </p>\n\n<p>&quot;Nope, you&#39;re just scaring yourself. It&#39;s nothing,&quot; I repeated to myself over and over as I forced myself to continue, my feet feeling like they were 100 pounds each. </p>\n\n<p>I walked and walked and walked, according to my watch I&#39;d been following this tunnel for at least 20 minutes, &quot;Wow this mine runs dee....&quot; my voice trailed off as I entered into a large cavern deep inside the mountain. &quot;Whoa...&quot; was all I could muster.</p>\n\n<p>I heard that laugh again, this time coming from above me. I whipped around with my flashlight and pointed it at the ceiling of the cavern. I thought I saw something flash past the beam, but I definitely heard something moving. I spun around again, trying to get a bead on what was in there with me. I felt a huge rush of air from behind me and heard what sounded like massive wings flapping. I spun again and that&#39;s when I saw it standing on the cavern floor about 20 feet from me. </p>\n\n<p>IT, this abomination, this clear affront to God, stood easily 7 feet tall and was covered in a matted black fur. Where arms should have been, it had two large leathery wings. It&#39;s eyes glowed like a cat&#39;s as my shaking hands tried to hold the flashlight on it. It let out a snarl and then started to laugh again. &quot;I knew you&#39;d come to me, they always come to MEEEEE!&quot; it roared as it flapped its wings and rose into the air. </p>\n\n<p>I turned back to the tunnel and ran, the fastest I&#39;ve ever run in my life. I ran and ran, refusing to look back, I heard the creatures wings flapping and jaws snapping behind me. &quot;You should have never come here,&quot; it jeered, &quot;now you&#39;ll die like the people in that village!&quot;</p>\n\n<p>I kept running, and soon I saw the light at the end of the tunnel, with my last bit of strength I threw myself from the mine and into the grass outside. I quickly rolled onto my back and instinctively shielded my face. 3 agonizing seconds passed before I realized I wasn&#39;t dead. I scrambled to my feet and looked at the entrance to the mine. Just within the shadows I saw the creature standing with its chest heaving in clear rage. </p>\n\n<p>I backed all the way out of the town, never taking my eyes off the entrance to the mine. It wasn&#39;t until I reached the tree line that I felt safe enough to turn and run. The trip down the mountain was a lot faster than my journey up it, of course it helped that I ran/fell all the way to the bottom. </p>\n\n<p>When I got home, I locked all the windows and doors. I didn&#39;t sleep that night, I haven&#39;t really slept since, even now that some 700 miles and 3 states separate me from that mine. I don&#39;t know what I saw in that mine but I&#39;m never coming back to the NRV.</p>\n\n<p>My house in Blacksburg is for sale if anyone is interested. Just be careful, you never know what you&#39;ll find up here in the mountains.</p>\n</div>\n","author":"MakroYianni"}