{"rank":"33","title":"Stolen Faces","id":"8kwr2g","url":"/r/nosleep/comments/8kwr2g/stolen_faces/","time":"1526861715000","body":"<div class=\"md\"><p>If you&#39;re receiving this message, I&#39;m requesting assistance. I&#39;m currently trapped in a hospital. I managed to pick up a radio from one of their corpses. They&#39;re onto me. The minions of the Facestealer are currently hunting me down. As of this moment, I&#39;ve killed thirteen of them. I don&#39;t know how long I can fend them off. In case I don&#39;t make it, I&#39;d like you to kill the Facestealer on my behalf.</p>\n\n<p>I don&#39;t know why he did it. I don&#39;t know why all of your faces have been stolen. Every single one of you lack a face, yet you continue your daily lives blissfully ignorant of your loss. My life had been perfect before the accident. How did it all come to this?</p>\n\n<p>My most vivid memory of the accident was the sharp pain in my head. It took me a while before I pieced everything together. I looked at the crowd surrounding me and saw faces in distress. I remembered what happened. I was hit by a car. I was bleeding to death in the middle of the street. It was at this moment when the Facestealer approached me. It was so surreal, seeing a man without a face. He was disguised as a paramedic. This fiend has made a mockery of me by asking me about my well-being. I looked at the crowd again and saw that they no longer have faces. Their faces have been stolen.</p>\n\n<p>I woke up in a hospital. There was a doctor and a nurse attending to me. They have no faces. I tried to tell them, but they wouldn’t listen. It was as if the demon cast a spell on them that deprived them of self-awareness. I asked for a mirror and looked at myself. It was as I feared. My face has been stolen as well. I turned on the TV. I didn’t see a single face. The situation has spiraled out of control. There isn’t a single face left in the world.</p>\n\n<p>I don’t know how the doctor discerned my anguish when I no longer have a face to show emotions with, but he tried to comfort me. The doctor talked to me at length in an attempt to pacify me.</p>\n\n<p>Damaged occipital lobe? Visual agnosia? What nonsense! Such pathetic attempts to trick me with invented words to halt my pursuit of justice.</p>\n\n<p>Doctor, I bet he has his claws upon your throat. He is probably in this very hospital, whispering his demonic commands unto your ear. Doctor, you are being manipulated by the Facestealer. But I don&#39;t blame you. He has your face hostage.  I&#39;m sorry, Doctor. There are greater things at stake here.</p>\n\n<p>I snapped his neck. The nurse tried to get the attention of the Facestealer. She managed to let out a demonic wail before I could kill her. More minions arrived, but I killed them all as well. Despite being servants of a powerful demon, they sure seem powerless themselves. They even had to resort to using firearms.</p>\n\n<p>This the true story of my crusade. I hope you can carry out my mission if I don&#39;t make it out of here alive. I promise that as long as I&#39;m breathing, I will do everything I can to accomplish this singular purpose. I will return all of your faces.</p>\n\n<hr/>\n\n<p><a href=\"https://vankalos.blogspot.com\">Van</a></p>\n</div>\n","author":"VanKalos"}