{"rank":"204","title":"Grandma Gary's Weird Dreams","id":"8kwrcc","url":"/r/nosleep/comments/8kwrcc/grandma_garys_weird_dreams/","time":"1526861788000","body":"<div class=\"md\"><p>When my Uncle Mike talked about my grandma, there was no sympathy in him. No cover up, no political correctness. He knew what she was and he was not going to forget it. He had hinted at her story as long for as I could remember, but my mother always managed to shut him up before he got to the good part. She thought it was too delicate for me to hear. He argued with her relentlessly about it. <em>The boy needs to know!</em> he would say. <em>This could affect him too!</em>.</p>\n\n<p>One night when I was eighteen, a couple weeks before he died, I cornered Mike in the living room of our house when Mom was out at the grocery store in town for a couple hours. </p>\n\n<p>He was staying with us then, on account of his liver failure and advancing cancer. He was hooked up to all of these machines in the living room with the big screen TV. He spent most of the day staring aimlessly at it and smoking Marlboro Reds down to the filters. He was a stubborn man, unapologetic and set in his ways and opinions. Something about that was admirable in all the wrong ways.</p>\n\n<p>When I asked amount my grandma, he mumbled an &#39;are you sure&#39;. He was asking if I was sure I wanted to be burdened by the knowledge of it, I guess. I nodded meekly.</p>\n\n<p>He sighed, caught his breath for a moment, and began.</p>\n\n<p>&quot;Your grand-mom was the type of kid who was looking for six excuses to off herself before her seventh birthday. Rough childhood, ya know. Her dad fucked around a lot. Her own Mom was too weak to leave him, but strong enough to nag his ass nightly about it.&quot;</p>\n\n<p>&quot;You&#39;ll excuse my cussing when the story calls for it,&quot; he warned.</p>\n\n<p>He coughed aggressively at this point. Nonetheless, the Marlboro still dipped into the ash tray and he still took another gasping inhale. We all loved our Uncle, but his voice rattled like an old radio stuck before frequencies.</p>\n\n<p>&quot;It all started when she came home from school one day, when she was five, and found her dad fucking the house keeper. She didn&#39;t know what it meant, ya know? Five years old. So fuckin&#39; young, you&#39;ll excuse my language again with this.&quot;</p>\n\n<p>Mike coughed again, and when he did, phlegm launched like a projectile onto the floor and on my pants. He wiped his mouth and I paid it no mind.</p>\n\n<p>&quot;For a while, nobody suspected a thing. My mom was the only one who knew about her dad&#39;s indiscretions. She kept that secret every time she saw him plowing a neighbor, softball coach, receptionist, you name it. Your great-grandfather fashioned himself a <em>rico suave</em>, a real ladies man. He looked like you kids do, with the blonde hair and blue eyes, trimmed cheekbones and wastes. The girls fell for him in droves, one after the other he would bring them back to the house when he thought nobody was home.&quot;</p>\n\n<p>&quot;That&#39;s what caused the dreams to start.&quot;</p>\n\n<p>&quot;Now, I want to state for the record, these were only dreams at first. There was no hint of her knowing anything more or anything less, and I never fucking assumed anything more, okay?&quot;</p>\n\n<p>He pauses, eyeing the pieces of ash on the table, fluttering from the breeze of the fan.</p>\n\n<p>&quot;The first time she dreamed about the women her father saw, Grandma was eight years old. In this dream, she came home from school carrying her Pink lunch bag. She&#39;s crying.... her father, he... forgot to pick her up at school. She waited for hours and hours and he didn&#39;t come.&quot;</p>\n\n<p>He pauses, his eye starting to tear up, which he quickly and aggressively wipes away.</p>\n\n<p>&quot;In the dream, as she gets closer to the house... she hears a woman moaning. In her bag, she has a knife...&quot;</p>\n\n<p>&quot;She opens the door, and her father&#39;s there with the maid. Touching her, grabbing her. The maid&#39;s bare ass is exposed on the kitchen table where they all eat dinner every night. Neither of them even stop until they hear the shocked gasp from your grand-mom.&quot;</p>\n\n<p>&quot;So in the dream, she runs forward, screaming and crying before she plunges the knife into the maid&#39;s face. Like this.&quot;</p>\n\n<p>He gestures.</p>\n\n<p>&quot;Over and over and over again she cuts her face like she&#39;s carving out a pumpkin. Her father is sitting there with his dick out, just physically shook by what is happening.&quot;</p>\n\n<p>Mike taps his smoke, a little invigorated. </p>\n\n<p>&quot;That first time... she didn&#39;t know. She didn&#39;t know anything happened to the maid. The next night she said her parents were arguing... screaming, yelling. The maid never showed up again. She was happy, if anything.&quot;</p>\n\n<p>&quot;Was that the only dream?&quot; I ask, quietly anticipating the answer.</p>\n\n<p>&quot;No... no. Again, when she was ten. She heard her father talking to another woman on the phone... real dirty shit, you know, something a ten-year-old should never have to hear her father say. I think he said he wanted to fuck her in the ass or something. That was the impression I got from the story.&quot;</p>\n\n<p>He struck a match and lit another smoke, clotting the air and now filling our dingy little living room.</p>\n\n<p>&quot;She had a dream that she killed her at a tanning salon. Held the door down, turned up the juice and fried her like an egg.&quot;</p>\n\n<p>I was horrified. Mike saw this.</p>\n\n<p>&quot;Sure this was the second time, but it happened at some place she had never even been. They suspected a coworker, she had nothing to fucking do with the case whatsoever.&quot;</p>\n\n<p>He paused, considered me cautiously for a moment, then continued.</p>\n\n<p>&quot;Yeah, she knew something was up. People talked, and their description of the unusual crime scene matched her dream exactly. But what could she do? Turn herself in? Nobody suspected a kid whatsoever. <em>She</em> didn&#39;t even remember doing it, only the dream. The dream stuck with her. She just resolved herself to stay out of her father&#39;s business and keep as much distance as possible.&quot;</p>\n\n<p>&quot;Nevertheless, once Grandma hit puberty, the dreams started to speed up in rapid succession. There was one week she had five in a row, and five hussies ended up dead in mysterious circumstances. Grandma saw all of it, she was at the wheel of every execution in her dreams. House fires, exploding cars, poisoning. But she couldn&#39;t stop it, couldn&#39;t wake herself up from any of it.&quot;</p>\n\n<p>Like clockwork, he put out his Marlboro and lit up another one, wheezing throughout.</p>\n\n<p>&quot;As you can suspect, your great-granddad was the primary suspect. There was no evidence, nothing physical to tie him to the scenes whatsoever. But that didn&#39;t matter to the jury once they found out he had affairs with all eight of the missing women. The case was a slam dunk. He went to prison and when he hung himself in his cell it was considered a goodbye and good riddance.&quot;</p>\n\n<p>&quot;Yup, your grandmother saw that one too.&quot;</p>\n\n<p>&quot;And then, as quickly as the dreams came, they went. Once her father died, your grand-mom&#39;s entire depression seemed to lift from her like bad weather.&quot;</p>\n\n<p>&quot;That was around the time she married my dad and gave birth to your mom and me. Sunny days, she used to call them.&quot;</p>\n\n<p>Mike smiled and looked out the window at the dripping rain. He didn&#39;t look at me for the next part, just kept staring outside.</p>\n\n<p>&quot;When I was seven, your mom was two. Your grandma had one more dream. My sister and I were sleeping at a friend&#39;s house that night. Your grand-mom never told me about that dream, but I knew it had to have happened.&quot; </p>\n\n<p>&quot;After the case closed, finger prints had given a lot of information and we were able to piece together the story.&quot;</p>\n\n<p>He leaned over for this part. When he did, it was hard not to cough myself. He stank of menthol, and cough-drops, and mothballs, but I ignored it and listened intently, letting the smell of it all taint the memory of the women I had never met.</p>\n\n<p>&quot;In this dream, your grand-mom comes home late from work one night. The house looks empty, no kids and no Grandpa. But the dim of a candlelight and a couple of quiet chuckles dip in from the over-sized bathroom upstairs. There&#39;s a hot tub up there. Maybe she thinks my dad is in there with the radio, that he sent the kids away for the night and he was waiting for her to end her shift so he can surprise her. She would have thrilled at the idea, she always called him a romantic at heart. But she would have been half right.&quot; </p>\n\n<p>&quot;As she walks up the stairs, she is sure she can hear another woman&#39;s voice. The very premonition of the idea must have sent a shock wave through her aging, matronly body. She was living the horror of her childhood in that moment, transcended into her adulthood the very fear she had suffered with her own life. Her own inadequacy.&quot;</p>\n\n<p>&quot;She goes back down the stairs. She&#39;s careful not to step on the parts that creak. This is her house, after all. You know which cheap wood planks make that creek just as well as I do.&quot;</p>\n\n<p>He pauses.</p>\n\n<p>&quot;She gets a toaster oven.&quot;</p>\n\n<p>&quot;She brings the toaster oven back upstairs, and enters the bathroom. The story is the same as the eight before it. Dad is in the hot tub with a coworker, and must have near shit the hot tub when he saw my mom walk in like any other Tuesday.&quot;</p>\n\n<p>&quot;She plugs in the toaster oven to the outlet next to the mirror. She taken the oven and tosses it in the full tub. My dad and his mistress fried alive. I doubt anybody said a word for the entire transaction. There was no struggle. Everyone must have understood the implication of the action in that moment.</p>\n\n<p>&quot;Once they are dead, she sits there for an hour. The coroner could tell that by the time of death. Then she climbed into the hot tub with the two of them and fried herself.&quot;</p>\n\n<p>Uncle Mike leaned back, and lit up one final cigarette. He looked out the window again at the dreary rain and frowned.</p>\n\n<p>&quot;Neighbors smelled the bodies and called the police. I was always thankful for that. The alternative would have been that we were dropped off to find that horrible scene ourselves.&quot;</p>\n\n<p>He tears up again at the thought, transitioning between a choking cough and quiet sobs as he dabs his eyes with the same hankerchief.</p>\n\n<p>&quot;So Matthew,&quot; he asked, correcting himself as he did.</p>\n\n<p>&quot;The reason your mom did not want to tell you this is because we did not want to awaken anything in you. To alert you to something that&#39;s probably not even there at all.&quot;</p>\n\n<p>He sighed, a rattling sound that echoed through his chest.</p>\n\n<p>&quot;But I am a dying man, and I need to know. Have you ever had any strange dreams before?&quot;</p>\n\n<p>I shook my head, and that seemed to be enough for Mike. He turned his chin inward, pulled up a blanket, and waved me away with a hand. I thought about that conversation a lot after he died, though I never bothered to bring it up my mom. I knew she would be mad that I betrayed her, that Mike had disobeyed her wish. I didn&#39;t want to taint the memory of a man who did so much to protect the small broken pieces of his family. And there seemed to be no sense in doing that.</p>\n\n<p>But I am a grown man myself now, with a family of my own. And last night, I had a really strange dream about my wife. </p>\n</div>\n","author":"iAmMatt1"}