{"rank":"9","title":"Squeaksqueaksqueak","id":"8kwvg6","url":"/r/nosleep/comments/8kwvg6/squeaksqueaksqueak/","time":"1526862927000","body":"<div class=\"md\"><p>&quot;Are you sure this is going to work?&quot; I ask my husband, reading the back of the mouse trap directions, frowning as I wonder if I even want it to work or not. </p>\n\n<p>&quot;Well, we have to do something!&quot; He mutters, bending to push a mouse trap near one of the many fist sized holes hidden around the house. </p>\n\n<p>The house is a two story building that had been constructed back in the 1900&#39;s. Like every old house, it&#39;s hard to plug up all the holes that have appeared over time. I haven&#39;t seen any mice yet, but I am finding tiny turds in the strangest places, as I move around the furniture. Thanks to Ratatouille, we all know how many rodents can dwell within a building. </p>\n\n<p>We shut off the lights, and go into the bedroom, changing our clothes and quickly falling asleep. It isn&#39;t long before something makes me jerk awake. </p>\n\n<p>Squeaking. Loud squeaking coming from right outside the bedroom door. I swing my legs out of bed and tip toe across the kitchen and lift my shaking hand to the light. </p>\n\n<p>There&#39;s a freaking mouse in the trap! </p>\n\n<p>&quot;Honey!&quot; I scream, as I reach over for the broom. My husband comes running out to see what I&#39;m &#39;making a fuss about&#39;. </p>\n\n<p>He walks in while I bash the broom down, breaking the mouse trap, and releasing the paralyzed mouse. I shriek, as it scurries towards us, running past my feet. I hear the snap of another trap as the mouse manages to move remarkably quick for a thing with broken legs. </p>\n\n<p>Another mouse is caught next to the large four inch gap in between the kitchen counter and the window. I gag and clutch my broom, staggering over to my husband. </p>\n\n<p>The mouse in the trap squeaks furociously as it pulls itself towards us. It screams with every minuscule tug. </p>\n\n<p>A dark shadow darts by. Then another. And another. </p>\n\n<p>Mice start streaming out of the gap and screech uncontrollably, whacking every which way possible, as fast as I can gasp out my next breath. My vision was becoming spotted with white specks. I can hear my husband stomping beside me. </p>\n\n<p>He stops stomping and puts his arms around me as I shake and cry uncontrollably. &quot;What the hell was that?!&quot; I cry against his shoulder. </p>\n\n<p>My answer comes in the form of a thump behind the gap in the wall. I feel my eyes widen and I freeze in place. The mouse in the trap, still struggling to move, quickens the speed of it&#39;s disgusting twig like arms in panic. </p>\n\n<p>From the gap, a long dark shadow slithers out and curls around the rodent, pulling it from the trap and pulling the critter through the gap. The crunching snap of it&#39;s back as it&#39;s pulled through the crack makes me vomit on the floor. </p>\n\n<p>There&#39;s something in the walls, something that that mice have identified as a predator. We barely could afford the house a month ago, never mind traps. </p>\n\n<p>&quot;What are we going to do?&quot; </p>\n\n<p>My husband squeezes my arms. &quot;We have to get it out. We have to break down the walls.&quot;</p>\n</div>\n","author":"soverignkikikakes"}