{"rank":"65","title":"Stomachache","id":"8kwz83","url":"/r/nosleep/comments/8kwz83/stomachache/","time":"1526864001000","body":"<div class=\"md\"><p>I have been alone for a long time.  Vanessa left me almost three years ago and I never got into another relationship, afraid of being hurt again.  Instead, I now regularly employ the services of call girls to satisfy that need of physical companionship.  Hey, whatever works, right?</p>\n\n<p>My strange story began on a rather ordinary night in August.  I had made a call to a local brothel, asking for someone to spend a few hours with, which they happily obliged.  A few hours later, at the appointed time, Andy showed up, dressed in a short black dress and high heels.  Her long, brown hair was pulled back in a ponytail and her eyes glimmered in the moonlight as she stood on my front steps.  I invited her in and led her upstairs.</p>\n\n<p>The sex was pretty ordinary, nothing special, but it did give my mind a little break from the relentless monologue listing my personal failures as a person that led to my being alone.  Andy was cute and enthusiastic, to be sure, but she also seemed to sense something in me, a deep longing.  Afterward, as we lay quietly in my bed, she said, &quot;Have you ever wanted a child, James?&quot;  The question threw me for a moment, but I eventually answered that, yes, I did very much, which was one of the reasons I had been so upset over Vanessa leaving.  Andy smiled mysteriously at that.</p>\n\n<p>&quot;I can help you with that,&quot; she said.  I puzzled over her meaning as she lay there, her head on my chest.</p>\n\n<p>&quot;What do you mean?&quot; I asked.</p>\n\n<p>In answer, she reached for her clothes piled on the floor and rummaged through the pockets before emerging with a small box in her hands.  She opened it and showed me a collection of strange, silver capsule pills.  She took on out and held it up.   &quot;Take this.  With a bit of luck, you may be surprised at what you find.&quot;  She handed the pill to me.</p>\n\n<p>I stared at it, then at her.  &quot;What will this do to me?&quot;</p>\n\n<p>&quot;It will bless you with what you desire,&quot; was her simple response.</p>\n\n<p>After she left, I sat alone in my living room, staring at the silver capsule in my hand.  I felt as dismal as I had before Andy arrived, as I always did after these encounters.  Her words kept coming back to me.  Bless me with what I desire?  What, would it suddenly make me attractive to women again?  What a bizarre thing to hand to a total stranger.</p>\n\n<p>With a sudden sense of reckless purpose, I popped the pill into my mouth and chased it down with a glass of water.  With how badly my life was going right now, I honestly didn&#39;t care if it actually killed me.  Not like anyone was relying on me.  I went to bed a few hours later and fell asleep quickly.</p>\n\n<p>My dreams were strange that night.  I saw a little boy, who looked just like me, playing at the local park.  His eyes, nose, and the shape of his face, was just like mine.  How odd.  Then he looked up at me and smiled a wide, gap-toothed smile.  &quot;Daddy!&quot;</p>\n\n<p>. . . .</p>\n\n<p>Over the next few months, I began to feel strange.  I was hungry all the time, craving all sorts of weird things I&#39;d never liked before.  Once, I found myself chewing on a piece of chalk I&#39;d discovered under the sofa.  I also noticed that I&#39;d begun to put on weight; as I was suddenly eating so much, this seemed rather self-explanatory and I didn&#39;t question it much.  My coworkers noticed too, and jokingly asked if I was pregnant.  I just brushed them off, saying equally jokingly that I probably needed to start dieting.</p>\n\n<p>Sometimes, as I lay alone in bed at night, I swore I could feel odd movements in my stomach that were different from normal stomach rumblings.  Once or twice, I was convinced I felt something kick from inside.  My dreams of the strange boy were growing more frequent; I had no idea who he was or why I was dreaming of him so intensely.  For reasons I couldn&#39;t explain, I feel an intense connection to him, a bond as if he were my own child.</p>\n\n<p>I awoke, one night, a few months later, to terrible pain in my stomach, like I was about to have awful diarrhea.  I scrambled out of bed and hobbled into the bathroom.  The cramps in my abdomen were horrible and like a madman, I jerked my pajama pants down and sat on the toilet.  I could feel some huge mass moving inside me, descending steadily through my gut toward my anus.</p>\n\n<p>I was on the toilet for nearly four hours, pushing and straining without success although my stomach and intestines continued to writhe with horrible pain. I couldn&#39;t understand why nothing was coming out.   The huge mass continued to slide downward inside me; I could actually feel it moving through my intestines inch by inch.  It was the most awful, horrifying sensation I&#39;ve ever had in my life.  Nothing else even came close; the pain was indescribable.</p>\n\n<p>Gripping the toilet, I groaned and pushed, trying to relieve myself of this horrible monster shit, if indeed that&#39;s what it was--I was beginning to have my doubts.  As it finally reached my anus, I actually screamed in pain.  Whatever it was, it was so large, it wasn&#39;t going to come out easily at all.  Sweat pouring down my face, feeling violently sick, I staggered upright and then squatted on the floor, gripping my stomach in agony.  Straining as hard as I could, I felt my asshole stretch and stretch and stretch,  opening as wide as possible to accommodate this enormous monster.  I was crying audibly, shaking violently as my body heaved and heaved, now performing this motion on its own.</p>\n\n<p>After almost twenty more minutes of mind-numbing agony, I felt it finally slide out of my tortured asshole and hit the floor with a loud, wet thud.  My abdomen continued to spasms with phantom cramps, even though this thing, whatever it was, was finally out of me.</p>\n\n<p>Then I heard a small cry.  Numb with pain and shock, I turned to look underneath me, expecting to see a mile-long turd on the floor... and found myself staring at a baby.  It was a boy, wailing at the top of his lungs.  His pale skin was covered in a combination of mucus and shit.  I could still feel something pouring out of my ass, probably blood.</p>\n\n<p>With trembling arms, I picked him up.  His eyes opened and I found myself staring into eyes just like mine.  His face was shaped like mine, his nose mine... here he was, the boy from my dreams!  Stumbling upright, my stomach cramps slowly easing now that he was out of me, I carried him to the sink and gently washed him off.  His light brown eyes were locked on mine and I knew instantly that I was in love with this baby.  He was mine and, despite the bizarre and terrible way he had come into this world, he was indeed my own child.</p>\n\n<p>. . . .</p>\n\n<p>I decided to name him James II.  He&#39;s growing quickly, faster than I think is normal, but then again, he&#39;s not really a normal baby, is he?  I tried contacting the brothel that Andy worked at... and they informed me that Andy had never worked there, they didn&#39;t know anyone by that name.</p>\n\n<p>My son and I have a very close bond now.  When he&#39;s older, I know he&#39;s going to start asking questions, such as how he got here, since there&#39;s no mommy around.  Honestly, I still don&#39;t know how I&#39;m going to answer him.  But that really doesn&#39;t matter yet.  It&#39;s just the two of us, and that&#39;s perfectly fine by me.</p>\n</div>\n","author":"searchingformytruth"}