{"rank":"3","title":"I knew the breathing wasn't human.","id":"8kx35a","url":"/r/nosleep/comments/8kx35a/i_knew_the_breathing_wasnt_human/","time":"1526865095000","body":"<div class=\"md\"><p>{this is my first post on <a href=\"/r/nosleep\" rel=\"nofollow\">r/nosleep</a> and on Reddit ever, forgive capitalization} for some backstory I am a leader in a boy scout troop 7 strong, but when we go camping only about 4 to 5 people come. most of the members are in constant need of service hours. now this camp out was for an &#39;eagle project&#39; in which the boy that organizes and leads the project to show they are ready \nfor eagle rank. </p>\n\n<p>now to the story, it was Friday evening [January 18, 2018] and we had just unpacked and we where going to sleep. At this point I felt uneasy but for apparently no reason. it wasn&#39;t until around 3:00 in the morning that I found out the reason. i woke up and felt like i was being watched, even though i was in a tent with all the windows zipped shut and another adult. I was laying on my stomach covered in a cold sweat, right up against the tent wall. when I poked my head up out of the sleeping bag I could hear something... it was raspy, horrible, melodic breathing. I started to think to myself all of the skin-walker stories I had read online, but at the same time I thought &quot;those stories are just stories, right?&quot; but I still couldn&#39;t shake the thought... at this point I realized i was breathing very heavy, like I was being crushed. </p>\n\n<p>when I had just thought that it left, i felt something... something huge push against my foot and looked over to my tent mate, another leader, we held eye contact that silently screamed &quot;Oh my god..&quot; when the weight finally left my foot i heard the, thing, scurry very quickly around the tent and i saw a massive shadow appear behind my tent mate. it was pure black shadow, but it slowly opened its eyes, i could tell this because two bright white circles where at head height. i closed my eyes wishing it was a dream but i knew it was all real. when i did this I heard it move again, this time right next to my head. then it taunted me it started, snoring.. “it was Fucking snoring at me!” then what felt like an hour later, dogs started barking probably 500 yards away, i thought it is finally over, but then, in a flash a shotgun rang out and my tent was crushed by a mass weighing probably 500 lbs and a loud screech, followed by a man shouting &quot; GET THE FUCK OUT OF THERE BEFORE IT GETS BACK UP&quot; </p>\n\n<p>automatically i ripped through the tent and sprinted out foll,owed by my tent mate over to the mans truck, he said &quot;whats your name?&quot; i told him my name and my tent mates, he then introduced himself as &quot;the ranger&quot; he told us to get in the bed of his truck and stay low. We followed his commands, and as we climbed in two more shots rang out and the rest of our troop ran to the truck and got in when we told them to do so. after they where in we rushed to the ranger station, and they had us questioned. at dawn two police officers came to me and my tent mate, and handed us papers, they read: &quot;by signing this paper I agree to the following: 1: If these events are shared those involved will not be represented by name, 2: the location of the event will not be named or referenced by the presenter, &amp; 3: they will not be marked as completely factual to uphold the security of the national forest service&quot;.</p>\n\n<p>we where told to sign the papers and that we did not have a choice if we wanted to walk free. we signed the papers and where led out of the ranger station. since that day I haven&#39;t experience anything except an irrational fear of the woods. and refusal to go camping. </p>\n\n<p>The end</p>\n</div>\n","author":"fieldmarshal07"}