{"rank":"33","title":"There's an Ancient Monster in the Red Sea (Part 2)","id":"8kx6p1","url":"/r/nosleep/comments/8kx6p1/theres_an_ancient_monster_in_the_red_sea_part_2/","time":"1526866100000","body":"<div class=\"md\"><p><a href=\"https://www.reddit.com/r/nosleep/comments/8jg42f/theres_an_ancient_monster_in_the_red_sea/\">Part 1</a></p>\n\n<p>&nbsp;</p>\n\n<p>It&#39;s dangerous to be alone at night, so I woke up early on the following morning to determine the tent&#39;s owner. The first cracks of daylight gave me a glimpse of a figure sneaking out of the tent. There wasn&#39;t enough light to observe a face but I continued to watch. The figure quietly tucked the flap of the tent, while wearing a rugged leather knapsack, and silently snuck off towards the marshes.</p>\n\n<p>&nbsp;</p>\n\n<p>Several minutes passed before the culprit returned - without the knapsack - as her long brown hair swayed from her momentum. However, the dawn revealed her error as Jacqueline turned her head back and our gazes met. Her face flushed with red heat as she quickly pulled the flaps of her tent tightly over the entrance. </p>\n\n<p>&nbsp;</p>\n\n<p>I didn&#39;t see Jacqueline again until we gathered for the morning&#39;s assembly. Hakim stood on a crate as his voice carried over the masses. Hakim gave his initial speech in his native tongue to the workers before he began his address to the rest of us.</p>\n\n<p>&nbsp;</p>\n\n<p>&quot;I want to thank everyone for their hard work. We have made incredible progress and I think that we have definitive proof of an important archaeological break-through under our feet.&quot; Hakim triumphantly announced.</p>\n\n<p>&nbsp;</p>\n\n<p>&quot;However, due to recent events, I want to shift part of our focus towards the sunken ruins near Islets Gamma and Delta. The dive-team is already assembled. Jeremy, I want you to accompany them to study anything that they bring to the surface. I will also go with you, along with one of our archaeologists.&quot; Hakim dictated. </p>\n\n<p>&nbsp;</p>\n\n<p>Hakim licked his lips but Perez interrupted him.</p>\n\n<p>&nbsp;</p>\n\n<p>&quot;Sir, with all due respect, I think it&#39;s better for Jeremy to remain on site with us. We really could use his help with determining the origin of the eggs that we found yesterday. Once the dive-team has finished their job, then we will bring Jeremy over to you.&quot; Perez objected.</p>\n\n<p>&nbsp;</p>\n\n<p>Hakim stared at Perez before denying his request. I was given a radio head-set to keep in touch with Perez as a consolation.</p>\n\n<p>&nbsp;</p>\n\n<p>&quot;Have you figured out what laid those eggs?&quot; Perez nonchalantly asked as we packed up to our separate destinations.</p>\n\n<p>&nbsp;</p>\n\n<p>&quot;It&#39;s hard to tell. If I had to guess, then I&#39;m inclined to think that maybe it was from some sort of theropod.&quot; I answered honestly.</p>\n\n<p>&nbsp;</p>\n\n<p>A loud, blaring horn from the coast interrupted our conversation. Hakim placed his hand on my right shoulder and pointed to the gleaming, white ship at sea.</p>\n\n<p>&nbsp;</p>\n\n<p>&quot;Ah, the divers have arrived. That&#39;s where you&#39;ll be headed. I&#39;ll meet up with you after I take care of some business here.&quot; Hakim ordered.</p>\n\n<p>&nbsp;</p>\n\n<p>There was a small diesel boat near the shore that took us toward the main ship. A petite, red-haired woman sat in the small boat.</p>\n\n<p>&nbsp;</p>\n\n<p>&quot;Hey there, I&#39;m Rosie. You&#39;re the paleontologist, yes? Rosie asked.</p>\n\n<p>&nbsp;</p>\n\n<p>I nodded in acknowledgement and Rosie smiled in affirmation. She started up the cacophonous motor and we made our way through the crashing waves of the sea towards her ship.\nThe salty air aboard the diesel boat dried my skin as the waves made me nauseous. Finally, we made it on the deck of the ship. The main deck was immaculate - except for a large series of trays in the center.</p>\n\n<p>&nbsp;</p>\n\n<p>&quot;We were told that you should have a look at these samples. They were found near Islet Beta last evening. Take as much time as you need.&quot; Rosie instructed. </p>\n\n<p>&nbsp;</p>\n\n<p>&quot;If you need anything, then I&#39;ll be up in the tower.&quot; She offered as she pointed to the command center at the top of the deck.</p>\n\n<p>&nbsp;</p>\n\n<p>The ship began its course as I sat down and studied over the artifacts. There were plenty of large bones, but I knew that it would take awhile before I could determine how the pieces fit together. My first instinct was to find teeth or anything that related to the head of the creature. Suddenly, Perez&#39;s voice filled the ear piece of my radio set.</p>\n\n<p>&nbsp;</p>\n\n<p>&quot;How&#39;s it going?&quot; He asked.</p>\n\n<p>&nbsp;</p>\n\n<p>&quot;Just sorting through some bones. Apparently there&#39;s some big specimen that they found down there.&quot; I explained.</p>\n\n<p>&nbsp;</p>\n\n<p>&quot;Down where? You mean underwater?&quot; Perez guessed correctly.</p>\n\n<p>&nbsp;</p>\n\n<p>&quot;Yeah, near Islet Beta.&quot; I confirmed.</p>\n\n<p>&nbsp;</p>\n\n<p>The radio remained silent after that while I meticulously went through the bones for better clues. Finally, the ship stopped. A few divers in wet suits appeared on deck, along with Rosie. </p>\n\n<p>&nbsp;</p>\n\n<p>&quot;Alright, we&#39;ve arrived. We&#39;re at the dive site near Islet Delta. Just be careful down there.&quot; Rosie commanded. </p>\n\n<p>&nbsp;</p>\n\n<p>The divers went down into the sea individually at a time. Rosie took a seat near me and watched me as I worked.</p>\n\n<p>&nbsp;</p>\n\n<p>&quot;Pretty cool.&quot; Rosie muttered as she yawned.</p>\n\n<p>&nbsp;</p>\n\n<p>&quot;It actually is. I think that I finally found some of its teeth.&quot; I gloated as I pulled the jagged fragments from the pile.</p>\n\n<p>&nbsp;</p>\n\n<p>&quot;Huh, they look like crocodile teeth.&quot; Rosie replied indifferently.</p>\n\n<p>&nbsp;</p>\n\n<p>&quot;Yeah, but crocodile teeth are never this big.&quot; I answered.</p>\n\n<p>&nbsp;</p>\n\n<p>Rosie got up and walked back toward the command center as I continued searching through the samples. Another thirty minutes passed before I stood up and stretched my legs as well.</p>\n\n<p>&nbsp;</p>\n\n<p>&quot;Rosie! What&#39;s over there?&quot; I shouted.</p>\n\n<p>&nbsp;</p>\n\n<p>We were facing toward a natural lagoon at the shore of Islet Delta. However, there was a giant hole in the cliffside at the edge of the lagoon.</p>\n\n<p>&nbsp;</p>\n\n<p>&quot;You mean that cove???&quot; She shouted down to me as she walked toward me.</p>\n\n<p>&nbsp;</p>\n\n<p>The cove swallowed all light like a black hole into its gaping maw. The threshold of the cove was guarded by stalagmites which appeared like monstrous teeth. </p>\n\n<p>&nbsp;</p>\n\n<p>&quot;Hakim believed at one point that the cove was a part of some megalithic structure.&quot; Rosie stated.</p>\n\n<p>&nbsp;</p>\n\n<p>A red siren flashed from the top of the command center. Rosie hurried back inside as I went back to examining the bones. There was a pair of long, narrow bone fragments at the bottom of my current tray.The pair of fragments resembled a jaw but it was at least several meters long with a round, cracked snout. Rosie frantically rushed down from the command center.</p>\n\n<p>&nbsp;</p>\n\n<p>&quot;OK, I read you loud and clear. Just grab what you have and come back up!&quot; Rosie commanded before turning her head to me.</p>\n\n<p>&nbsp;</p>\n\n<p>&quot;They&#39;re bringing up some samples now, but the divers are telling me that something is down there with them.&quot; Rosie said to me while I had the jaw fragments in my hands. </p>\n\n<p>&nbsp;</p>\n\n<p>A bone-chilling scream came from Rosie&#39;s head-set. </p>\n\n<p>&nbsp;</p>\n\n<p>&quot;What&#39;s going on down there???&quot; Rosie barked into the head-set.</p>\n\n<p>&nbsp;</p>\n\n<p>All I heard were the screams and cries of Rosie&#39;s divers from her head-set. I quickly grabbed my radio-set.</p>\n\n<p>&nbsp;</p>\n\n<p>&quot;Perez, something is wrong over here. Have you ever been into the cove at Islet Delta?&quot; I asked as a series of bubbles reached the surface on both sides of the ship. </p>\n\n<p>&nbsp;</p>\n\n<p>&quot;A long time ago. That cove is very misleading. It&#39;s easy to get in there if you have a small craft.&quot; Perez replied carefully.</p>\n\n<p>&nbsp;</p>\n\n<p>Rosie kept trying to get a response from her divers but nobody replied. </p>\n\n<p>&nbsp;</p>\n\n<p>&quot;Rosie, we need to go now. How fast can your ship go?&quot; I demanded but Rosie stammered without replying. </p>\n\n<p>&nbsp;</p>\n\n<p>More bubbles continued to rise to the surface as the ship tilted back and forth. The furious thrashing sent the ship to the left side as a blaze of sparks appeared on the opposite side of the ship. A giant set of spines formed a sail of stretched, brown skin which circled around the ship like a dorsal fin of a great white shark. </p>\n\n<p>&nbsp;</p>\n\n<p>&quot;Perez, I need your help to guide us once we&#39;re in the cove.&quot; I pleaded as the ship shook violently.</p>\n\n<p>&nbsp;</p>\n\n<p>I grabbed Rosie by the hand as we quietly made our way to the small boat of the ship. The railing of the ship crumbled as curved claws punctured the deck and the screeching of metal followed us to the boat.</p>\n\n<p>&nbsp;</p>\n\n<p>Rosie started up the boat as the hull of the ship collapsed. A loud roar thundered over the sinking ship as we made a gamble to reach the cove before the creature pursued us. </p>\n\n<p>&nbsp;</p>\n\n<p>The darkness of the cove hid us as we slowly navigated through the rubble inside. We held our breathe as the dripping water from the stalactites echoed trough the cove. I jumped from my seat as my radio-set sparked to life.</p>\n\n<p>&nbsp;</p>\n\n<p>&quot;Jeremy, are you alright? If so, there should be an abandoned refuge camp in one of the tunnels of the cove.&quot; Perez guided us with a soft whisper.</p>\n\n<p>&nbsp;</p>\n\n<p>&quot;Yeah, it&#39;s just Rosie with me. Perez, there&#39;s something that I need to tell you.&quot; I began to confess but I was interrupted.</p>\n\n<p>&nbsp;</p>\n\n<p>&quot;Don&#39;t worry. I heard the news from Hakim. Just focus on finding shelter deeper inside. The cove has a series of tunnels that lead to the other side of Islet Delta. I&#39;m already on my way over to extract you.&quot; Perez assured us.</p>\n\n<p>&nbsp;</p>\n\n<p>Rosie and I left the small diesel boat at a ledge before wandering the cavernous system. The passage ways were small but we found an artificially carved chamber within a few hundred meters from the entrance of the cove.</p>\n\n<p>&nbsp;</p>\n\n<p>&quot;Perez, why was this place abandoned?&quot; I whispered into the head-set.</p>\n\n<p>&nbsp;</p>\n\n<p>&quot;It was the first site that our team excavated. There wasn&#39;t much to report inside except for a tablet.&quot; Perez told me.</p>\n\n<p>&nbsp;</p>\n\n<p>&quot;Was the tablet useful?&quot; I inquired as we marched through the darkness - only using the light of our phones to guide us.</p>\n\n<p>&nbsp;</p>\n\n<p>&quot;Yeah, at least Jacqueline thought so. But she never managed to completely translate it.&quot; Perez remembered.</p>\n\n<p>&nbsp;</p>\n\n<p>The chamber expanded until we saw the remains of a small campsite.</p>\n\n<p>&nbsp;</p>\n\n<p>&quot;OK, Perez, we&#39;re at the abandoned post. Should we stay here?&quot; I asked.</p>\n\n<p>&nbsp;</p>\n\n<p>&quot;Yeah, sit tight. We need to scout the rendezvous point.&quot; Perez answered.</p>\n\n<p>&nbsp;</p>\n\n<p>Rosie shivered in the cold cave as we huddled together for warmth. Ten minutes passed by before Perez&#39;s voice chirped through the head-set.</p>\n\n<p>&nbsp;</p>\n\n<p>&quot;The coast seems clear but I wouldn&#39;t count on it staying that way. You&#39;re not too far from the shore - just don&#39;t trip and you should be fine.&quot; Perez consulted.</p>\n\n<p>&nbsp;</p>\n\n<p>Rosie and I jogged through the tunnels as we searched for any signs of the shore. Finally, we reached a tunnel with a dwindling light at the end of it.</p>\n\n<p>&nbsp;</p>\n\n<p>&quot;We see the light! We&#39;re almost out!&quot; I yelled as we sprinted to the end. </p>\n\n<p>&nbsp;</p>\n\n<p>Rosie and I searched the horizon but there wasn&#39;t a ship ahead of us. A blaring horn caught our attention as Perez&#39;s ship sailed full speed toward us from the left-hand side. </p>\n\n<p>&nbsp;</p>\n\n<p>&quot;Jump from the cliff onto the ship as we pass by. There isn&#39;t another way!&quot; Perez demanded.</p>\n\n<p>&nbsp;</p>\n\n<p>&quot;Oh God!&quot; Rosie shrieked as she looked down at the depths below.</p>\n\n<p>&nbsp;</p>\n\n<p>The jump would be a true leap of faith; it was easily more than ten feet from the edge to the deck of the ship. However, it required a running start because the gap spanned at least several feet ahead of the edge. </p>\n\n<p>&nbsp;</p>\n\n<p>&quot;Get ready! Now!&quot; I shouted as we leapt from the edge and tumbled onto the deck below. </p>\n\n<p>&nbsp;</p>\n\n<p>Perez yelled triumphantly as applause erupted from the small crew of the ship. However, our relief was short-lived as a long, narrow snout surfaced from the water near the bend of the Islet.</p>\n\n<p>&nbsp;</p>\n\n<p>&quot;It looks like we have company. What&#39;s the plan?&quot; I asked Perez.</p>\n\n<p>&nbsp;</p>\n\n<p>&quot;Don&#39;t worry. I know exactly what the beast wants - and we&#39;re going to bring it to her.&quot; Perez confidently answered as the ship sailed <a href=\"https://www.reddit.com/r/Torpenta/\">forward.</a></p>\n</div>\n","author":"Torpenta"}