{"rank":"224","title":"Mermaids","id":"8kxjy1","url":"/r/nosleep/comments/8kxjy1/mermaids/","time":"1526869839000","body":"<div class=\"md\"><p>Mermaids are said to be only make-believe. But I know they are real or at least they were for a time. When I was little my grandfather would show me them. He was what most people would call a hermit, he didn&#39;t like what the world was changing into so he bought himself a piece of land next to a lake. My parents would allow me to spend my whole summer with my grandfather and the memories still seem like it was yesterday when I look back on them. But my greatest memories of all was with the mermaids that lived in his lake.</p>\n\n<p>He showed me their location when I was eight years old. Rowing ever so gracefully to the spot, at first it felt like an eternity and I didn&#39;t believe him at first as he would tell me about how they looked, how shy they were and that I shouldn&#39;t tell anyone about them for if I did they would be endangered. When we got to the spot he eagerly told me to jump into the water. I did as he said not thinking anything would happen since I was sure the old man was just trying to get me excited to go swimming, but to be honest that summer was so hot that it wouldn&#39;t have taken such a tall tale to convince me to go into the water.</p>\n\n<p>I swam down about three or four feet until I saw what appeared to be human figures at the bottom, but I would need scuba diving equipment to get a better look. I remember swimming back up and telling him I could see something at the bottom but I would need scuba gear. My grandfather oddly enough had a mini dive which is a mini scuba tank. he told me how to use and that I would only have five to ten minutes down there before I would need a new one. I never bothered to ask why he had the mini scuba tanks on him so readily but then again he did have some odd habits that I heard my mom and dad talk about.</p>\n\n<p>I swam back down again since this time I was able to get to the spot. As I got closer I could make out more of what I was seeing before there where women down at the bottom of the pond! Not women but you know mermaids! With long hair that flowed with the current, they gently stayed in place only moving a little bit, their skin was of different uses and their eyes had a glossy white film over them. I couldn&#39;t see their tails since the vegetation concealed them and they also were dresses that I figured grandfather so graciously gave them so that they would be proper. Grandfather was always pretty conservative.</p>\n\n<p>They were so gorgeous. Each summer after that I was even more anxious to visit grandpa&#39;s place after that. With each visit more and more mermaids would appear and grandfather would tell me that they are getting used to me. I remember asking him why they didn&#39;t swim around and grandpa told me that it was how they kept predators away. But then all good things come to an end and innocence broken.</p>\n\n<p>When I was thirteen my parents told me told me when I came home from school. That the police had arrested my grandfather. Someone saw him dumping something in the water and when the police came to investigate they look in the spot where the person saw whatever my grandfather dumped. It turned out that the mermaids where nothing more than local prostitutes who he would lure to his cabin promising them a better life. Once he got them to his place he would imprison them in a cellar that was in his room that he had crafted himself.</p>\n\n<p>He would keep them there for months before deciding if they lived or died and did horrible things to them. Thinking about it still makes my stomach turn After months of confinement he would poison them and put them in the water just days before I would visit him.</p>\n</div>\n","author":"macabrenocturnelle"}