{"rank":"12","title":"I recently moved.","id":"8kxlm4","url":"/r/nosleep/comments/8kxlm4/i_recently_moved/","time":"1526870317000","body":"<div class=\"md\"><p>It was a nice home. A duplex. Two bed, two and half bath. Nine hundred some-odd square foot, tile floor throughout, white walled, and smelled slightly of dampness. Outside was done up to look like, well, every other duplex on the block. A weird, L shaped home with a tripled wide parking space that really wanted to look like a normal house.</p>\n\n<p>Most people move because the rent hikes, or because of something with management, or sometimes it&#39;s just time for a change, or sometimes it&#39;s because of the neighbors. It seems everyone has a bad neighbor story. Some people had neighbors who were loud. Some people had to deal with a new couple who fucked every night. Sometimes it was the kids.</p>\n\n<p>I never saw my neighbor. I knew they owned a busted up, rust colored 79 El Camino. And I had a feeling they were a man, since the name on the mailbox read &quot;BUTCH&quot;. He was quiet, when I had first moved in. Two months went by of nothing. In fact, I liked Butch, for someone I had never met. He didn&#39;t make a sound, sans the once or twice I was up late enough to hear him start his car. At the time, I had assumed he worked nights. </p>\n\n<p>Then, after a few months, I would occasionally hear a thumping coming from his side of the wall. Almost like a hammer on wood. It wasn&#39;t at an unreasonable time. Perhaps Butch was putting together some IKEA. Maybe he had picked up some new hobby. It only lasted a month or two at a time. I guessed he occasionally did some wood work or something. </p>\n\n<p>Then, I was awoken by Butch&#39;s grunting. I tried to blush it off, the first time I heard the rhythmic, repetitive grunts. It felt like it was once in a blue moon. Then once a week. Then the sounds of the hammer on wood began to join those grunts deep into every night. I called management. They eventually stopped answering. I called the police. They said nothing could be done.</p>\n\n<p>A few months ago, I was awoken by the thuds and the grunts. I figured I would shower through it. As soon as the water started, the noises stopped, and would not continue till the next night. It became ritual. He wakes me up, I take a shower, it stops till the next evening. </p>\n\n<p>A week ago, it didn&#39;t stop with the start of my shower. It continued. The thuds louder, the grunts far more frantic, closer to almost a yell. And with one loud thud and a particularly savage grunt, a tile fell free from the wall in the bath. In the center of the plaster coated wall was a crack. In the middle of the crack a wide, metal barb. The barb wiggled and shifted and began to slide backwards through the wall. It fell free, and I gazed deep into the hole it left, I saw a shining blood shot eye. </p>\n\n<p>I moved about a week ago. I still have trouble getting to sleep without taking a shower. </p>\n</div>\n","author":"leadmuffin"}