{"rank":"6","title":"The Fine Line Between Genius and Madness","id":"8kxqu1","url":"/r/nosleep/comments/8kxqu1/the_fine_line_between_genius_and_madness/","time":"1526871807000","body":"<div class=\"md\"><p><em>I think it is coming,</em> carved the boy onto his arm, the blade a silver flash against paper pale skin. <em>No, no, no… I think it has always been here, and I am just beginning to realize.</em> </p>\n\n<p>The scarlet blood welled up, frothing, seething, a reminder of what he was trying so desperately to forget.</p>\n\n<p>⮍</p>\n\n<p>When he was young, just a toddler, the Madness was subdued. Singing and surging at the edges of his vision. A separate entity, eating away at his figure until he blurred. It was a vaguely ecstatic feeling, really, letting the insanity murmur lullabies, letting it build skeletal butterflies out of thin air.</p>\n\n<p>⮍</p>\n\n<p>When he got older, the Madness grew upon him, enveloped him, shrieking, screeching. It was the shadow that covered him like a mask, and the harder he fought, the more it bled into him, tainting his innocence with dark creeping tendrils. Alone he was just a boy, just a weak little boy, and with the Madness he was brilliant, blazing, incandescent with the radiance of everything he had never been. It was such a heady high, he didn’t realize: the brightest candles burn out the fastest. </p>\n\n<p>⮍</p>\n\n<p>When the Madness crept back behind the curtains -- as it always did --  the snake whispering ceased for a few dreaded hours, and for what felt like an eon he’d lie stiff like a corpse, needing to spit something out but the words refusing to assemble inside his head, the absolute <em>nothing</em> of humanity threatening to strangle him. He’d feel the weight of his uselessness like an anvil on his chest, ready to snap his ribs, unfinished thoughts whirling round like death sentenc<em>es. Come b</em>ack, he’d beseech the Madness, desperate, cracki<em>ng, please don’t leave</em> me.  He was nothing without the Madness, which was also nothing without him.</p>\n\n<p>It was… what had that book called it? …  a symbiotic relationship.</p>\n\n<p>⮍</p>\n\n<p>His mother suspected drugs. </p>\n\n<p>He knew she did -- he figured out during one of those periods when he was first getting onto his high and everything was technicolor, bursting with vivid shades, almost painful in its beauty. </p>\n\n<p><em>Ruffled bed sheet, she checked under my bed, closet left a sliver open, she rifled through there too, she thinks it’s heroin, she thinks it’s cocaine, ha! so stupid, so uninspired, someone should slice off their eyelids with a pen-knife just so they’ll be forced to open their eyes and</em> see… </p>\n\n<p>No, this wasn’t drugs, rather close but no cigar, and it was so <em>obvious</em> that it wasn’t,  simply because drugs were something to be hidden. Concealed.</p>\n\n<p>Small parcels you took from the shade-faced man in the alley, the frantic yet silent easing of a needle into bruise-blue veins. A high that was more from the delicious illegality of the act than the chemical part of it. </p>\n\n<p>But he was different. </p>\n\n<p>He could not hide what he had; the Madness did not like that.</p>\n\n<p>And what was he without his Madness?</p>\n\n<p>He lived off of what it gave him -- fantastical daydreams, balanced out by earth-shattering nightmares, food an unnecessary nuisance. He ran on gasoline. </p>\n\n<p>The first couple times the Madness hit him, it was <em>something</em> so razor sharp. He saw everything, catalogued it as a scientist would a dissected specimen, spoke like he’d die if the words didn’t spill past his lips. It was excruciatingly exquisite, agonizingly alluring. </p>\n\n<p>For a while.</p>\n\n<p>Nothing good can last long.</p>\n\n<p>He was a being of raw energy, drowning in his own light, bottled up inside this cage of bone and meat and wanting nothing more than to <em>explode</em> into something true and spectacular. The world would tremble underneath his feet, and he’d scratch at this disgusting body of his, this beautiful fragile oh-so-breakable thing, this frail little cage that he loathed.</p>\n\n<p>He would shudder back with a gasp, the glow in his brain receding, receding, until he was left cold and shivering on a comfortless bed, grasping for the last vestiges like the junkie he’d forbidden himself to be.</p>\n\n<p>⮍</p>\n\n<p>When he set his mind to something, he’d trek across universes to get it, and with the tinny little voice at the base of his skull he was invincible. </p>\n\n<p>So when the others got too inquisitive or too annoying or he just got <em>too damn bored</em> he’d find a way to get rid of them and that was that.</p>\n\n<p>It was always something indirect -- a carefully placed rock sending a childhood bully tumbling into the road, or a deer lumbering across the street, causing a car to skid off an incline. </p>\n\n<p>It would always work, it <em>had</em> to<em>.</em>  </p>\n\n<p>God, if you were into that sort of nonsense, supposedly never turned his back on his devoted followers.</p>\n\n<p>He had a different religion, a higher power that licked slowly at the edges of his conscience, wearing it down like a jawbreaker. </p>\n\n<p>The newspapers painted headlines in shades of fibs and drama, but the core of lies was always a tiny nugget of truth. </p>\n\n<p>A saying once preached that no-one would know of the perfect crime.</p>\n\n<p>No one did. </p>\n\n<p>⮍</p>\n\n<p><em>I am dead. They cannot kill me, because I was never alive. I decay inside this prison of gristle and rot.</em> </p>\n\n<p><em>They’re all liars, every one of the others -- pebbles believing themselves to be marble statues, something that could once have been great, slowly crumbling from the weight of their potential.</em>    </p>\n\n<p>⮍</p>\n\n<p>The last day, he holed himself up in his room with a machete.</p>\n\n<p><em>I think it is coming,</em> carved the boy onto his china-skinned arm, the blade a silver flash against paper pale. <em>No, no, no… I think it has always been here, and I am just beginning to realize.</em>  </p>\n</div>\n","author":"GlobalStrategy"}