{"rank":"20","title":"The Wanderer","id":"8kxzum","url":"/r/nosleep/comments/8kxzum/the_wanderer/","time":"1526874501000","body":"<div class=\"md\"><p>These little events have happened over the past 2 years in my current role.</p>\n\n<p>I work at a Hospital in the North of England (I&#39;m not going to name the hospital) and I work within the security team which involves speaking to rude and irate patients, trying to stop dementia patients leaving wards, making sure the hospital is locked at night time, maintaining the CCTV systems (over 400 cameras on site) and sometimes having to restrain aggressive patients. </p>\n\n<p>At around 10:30pm we conduct a patrol of the hospital grounds and lock up all the doors except the A+E department, (I forgot to add there is only 3x security staff on at one point). Visiting times finish around 8:30pm also so there should not be anybody wandering about. </p>\n\n<p>We get calls all the time from busy body staff nurses, Healthcare assistants regarding people lurking around the hospital which is normal as some patients are able to walk freely to have a cigarette in the gardens or to go the vending machines. </p>\n\n<p>The first occurrence of this happened about 18 months ago, we got a bleep which is normal procedure, we contact the number provided and then attend where we are needed. </p>\n\n<p>We got a bleep around 02:30am from a staff nurse stating that she had seen an old boy on the top corridor who she believed was smoking a cigarette so she attempted to get the mans attention but was not able to. Me and my colleague ( in situations like this 2x of us would go the the job and the 3rd member of the security would man the cctv systems, we would take turns who stays in the office) went to the area where the staff nurse reported seeing the male in question, but we were unable to see any signs of activity but we could smell smoke, the smoke didn&#39;t smell like cigarettes but more like a cigar, so we contacted the 3rd Security officer to rewind the cctv on that corridor to see if he could track the male and point us in the right direction to follow. We got a response about 5 minutes later that he could not see anything on the cctv system. In situations like this we would contact the wards and ask if they have a male that has gone missing and every single ward confirmed that all their patients were accounted for, so we literally knocked it on the head and returned to the office not thinking much of it.</p>\n\n<p>A few months later we got another bleep from a different staff nurse stating the same that she had seen a man on the top corridor walking slowly and asked if we could try and retrieve the said male. So as procedure we would ask for a description on the said person, and it was along the lines of:</p>\n\n<p>White male\nAround 70 years of age\nFlat cap\nWalking unsteady\nDark trousers\nBlack shoes \nGreen waistcoat</p>\n\n<p>So we conduct our normal procedure and go to the area and try to locate the male, nobody in sight at all, but the smell of smoke was lingering again, we contact the 3rd officers to replay the cctv but nothing,</p>\n\n<p>This has happened around 5-6 times before I actually seen the male I have had so many  calls about.</p>\n\n<p>I was on my own at this point, (during day shifts we all split up and patrol on our own, we patrol in doubles at night for safety reasons) I was doing my own patrol of the whole grounds, speaking to members of staff, saying hello to people. I remember walking up to the corridor where all of these sightings have been reported and would you believe it I seen the wanderer, now I must add at this point there must have been around 20-30 people on the corridor which is about 75ft long but the flat cap stood out to me. As I walked towards the male I greeted him by saying hello sir, there was people walking by and the volume was loud due to chatting etc. As I was about to ask the male some more questions by bleep went so I made my way to the nearest phone and then proceeded to make my way to the incident I was needed.</p>\n\n<p>I was at the job above for around 2 hours as a mental health patient was trying to abscond from a ward, which involved the MH patient threatening to take his own life which resulted in myself stuck on a job for a few hours. </p>\n\n<p>What freaked me out was when I returned back to the officer and wrote up the job..curiosity got the better of me and played back the cctv of myself on the camera at the time I seen the old boy...and du du duuuhhhh...the old boy I said hello sir to was no where to be seen!</p>\n\n<p>All of these reports have been logged and are on our system but to his day I have never told a soul at work I actually seen the old boy!</p>\n</div>\n","author":"Imthematron"}