{"rank":"103","title":"Der Teufelsstein Part One","id":"8ky05c","url":"/r/nosleep/comments/8ky05c/der_teufelsstein_part_one/","time":"1526874598000","body":"<div class=\"md\"><p>My parents emigrated to the United States from Germany back in 1981. My mom was 22 years old and my dad was 21 years old. My brother was almost 4 and I wasn&#39;t born yet. Most of my family left. My Oma and Opa had gotten a divorce and he left even before my parents did. My Oma stayed. She wouldn&#39;t leave her home. Germany was all she knew and all she ever wanted to know. My mom&#39;s parents came with my mom and dad and after my parents split up we lived with them. </p>\n\n<p>Everyone has heard at least one of Grimm&#39;s fairytales and I&#39;m no exception to that rule. My grandma told me one every night before bed and even with their oddity and being slightly macabre I still fell asleep. I know that most versions have been changed to have a &quot;happy ever after&quot; ending, but my grandma she didn&#39;t change them. God, she was the best story teller. I still tell myself stories on nights I cannot sleep. </p>\n\n<p>Even with my Oma a half a world away I was still close to her and thanks to the unlimited calling features modern technology had offered us with Skype and the like I was able to talk to her for hours on end in my late teens and early 20&#39;s. After I turned 13 I went and spent every birthday with her. I was born in the dead of winter and my birthday falls close to Christmas break. I would miss a week of school, but I never failed and the things I learned would prove to be much more valuable in life. Unfortunately my Oma passed away in September of 2015, but not before I left to be with her. </p>\n\n<p>My Oma lived in a tiny village called Hesseneck. It translates to Hesse Corners. It&#39;s where Hesse, Bavaria and another German state meet. In January of this year they abolished Hesseneck with our abundant population of roughly 700 into Oberzent along with a few other small towns. That means we are no longer a municipality of our own not that we dont exist, in my eyes at least. Hesseneck sits at the base of the mountains in a forest range called the Odenwald. Hesseneck is about an hour and a half from Frankfurt. </p>\n\n<p>There is a reason so much German folklore and supposed mythology warns of wandering in the woods. Stories I had been told since I was a small child. Ones I didn&#39;t believe, but knew parents warned children of wandering into the woods because getting lost in days with less inhabitants was dangerous and yeah there may have been wolves back in those days. 20 years ago they were said to be extinct in Germany and now they are back. Crept in from Poland they say, but hadn&#39;t made it this far south as far as I knew. </p>\n\n<p>I always knew I would return to Germany one day. I graduated both high school and college in the United States. I was 22 when my Oma had an accident. She fell on the ice and broke both wrists and her ankle. She had to have surgery and was not going to be mobile for awhile. She was lucky the mailman came by. As her oldest granddaughter and the only one old enough to do so I went to help her. She did help pay for the ticket. </p>\n\n<p>When I got there and we were able to get her home she told me about what had happened and said that a crazy lone wolf had his eye on her from the edge of the forest (at the back of her house). She told me she wanted to take off her shoe and throw it to scare him away, but couldn&#39;t because both wrists were useless. I asked her what scared him away? I figured the pain may have made her imagine this or that it was just a neighbor&#39;s dog. She said he never came towards her just watched. He heard the mail and ran back into the woods. &quot;Oh,&quot; I said, &quot;he must have been your guardian angel.&quot; She laughed. Wolves dont have the same reputation with an older German woman as they do with someone who was raised in the United States. She told me to be careful if I went out there. &quot;Your other Oma must have told you what a vile beast the wolf is and I dont want you eaten up!&quot; We both laughed. </p>\n\n<p>Her wrists healed, but she lost her ability to do a lot of the things she had before. She had been a seamstress and lost her livelihood. The pinning and sewing was too much pain. I took a job and stayed with her. I wasn&#39;t much missing the life I had had in the United States. I had my whole life, Oma didn&#39;t. The following summer she had a heart attack. Two years after that she had open heart surgery and I knew I could never leave. </p>\n\n<p>Odenwald doesn&#39;t often share the mystery surrounding the Black Forest, but it&#39;s a beautiful expanse of mountains and forest. And we do have Frankenstein&#39;s castle! With my Oma in the hospital I wandered the forest. I noted trees and animals. I studied ecology in the States and always felt it was my place to do what I could to preserve places like this. The red deer can sound pretty creepy when dusk comes, but I never saw anything even close to resembling a wolf until much later.</p>\n\n<p>One morning I was out getting wood for Oma&#39;s fireplace. She loved the smell of burning wood. I heard rustling coming from the woods. I glance over expecting to see a rabbit or deer possibly, if I was lucky enough, a lost wild sheep. I caught the end of a bushy tail running back into the spruce. Someone&#39;s dog I assumed. Nothing again until near my Oma&#39;s passing. She was in the hospital in intensive care. She was in a medically induced coma. I had returned home to shower and call relatives back home. They needed to come now if they were. I saw something shift as I walked towards the door. I turned my phone&#39;s flashlight on. There he sat at the edge of the woods. Eyes deep amber and fixed on me. I clapped my hands and told him to &quot;shoo!&quot;, but he carried on sitting there. Not a care in this word. I started to walk towards him. I knew he&#39;d run. </p>\n\n<p>Oma passed a week later and Woofy, as I called him, had only showed himself on nights I returned from the hospital alone. Only my dad and his wife, my younger brother and my cousin made the trip. He didn&#39;t like them. They didn&#39;t believe in him. My Oma&#39;s will had been read by her attorney and everyone was returning back to the states. Oma didn&#39;t believe in burial and insisted on cremation. I stayed with her. She left me the house and her possessions including a small box with carvings on the outside. It looked like a music or jewelry box. The attorney remarked on the wood. It must have been an old box, he told me, Germany didn&#39;t have a lot of walnut trees anymore. Mostly spruce and beech forests. He told me privately that my Oma instructed I open the box in private and I assumed she didn&#39;t want to cause any bad feelings in the family. Her monetary possession were split evenly between her children. </p>\n\n<p>Later that night when I returned home after seeing my dad, stepmom and brother off at the  airport in Frankfurt Woofy was waiting. He let out a solitary howl and turned into the woods. I started to really believe he was my Oma&#39;s guardian angel. Tears splashed down my cheeks as I watched him disappear into the forest. I was all alone. </p>\n\n<p>I went in the house and threw a couple logs into the fireplace. Once it was going I sat in front of it in Oma&#39;s chair with a cup of her favorite tea. Chamomile. I looked at the box. Turned it over in my hands, felt the carvings, looked for a makers mark. I unlatched the clasp on the front and opened the box. Inside I found something typical of my Oma; something wrapped in velvet and a purple crystal. In the top of the box was a little envelope, the kind that comes with flowers or thank you cards. On the out side of the envelope &quot;mein Liebchen&quot; was scrolled in Oma&#39;s pen. I held the envelope in my hands touching her words with my fingertips.I didn&#39;t want to rip the envelope it was the last thing I had from her, but I desperately wanted to read her words before even looking under that velvet. My Oma was a superstitious woman and held beliefs that dated back as far as Germany herself. There was obviously something she needed to say. I pried the little envelope open and read my Oma&#39;s final words to me:</p>\n\n<p>Liebe,\nIf you are reading this my time has run out and I am sorry to have left you alone here. I know you gave up these 10 plus years of your life for me and I will be grateful into eternity. All the money in the world could never pay you for what you gave me in return for your own life. Find love Liebe. You will need it. In the box is my most guarded possession. I must tell you the box is made of oak, very special and precious oak. I was never religious and you know this well, but I know you are. The same oak that fathered this box is said to have fathered the great church here in Hesse. Blessed by angels itself I was told and I believe it so. The object inside the cloth must be kept there. You are now its guardian. Make no mistake an object can need a sitting. The crystal inside draws the objects negative energy and keeps it from latching onto your heart. Please dont think this the rambling of an old lady. Mein Liebe, that box is home to great evil. der Teufel. der Teufelsstein. Find a way. Xs and Os Oma. </p>\n\n<p>What the hell Oma?? The devil and his rocks?! I admit we have a few superstitions; big bad wolves, witches, ghost and sirens, but this was reaching even for a woman who believed in fairies. I reached for the box. I pushed the crystal aside and pulled back the velvet. Inside the box was a rock the size of a quarter in diameter and maybe an inch or inch and a half thick. It was the brightest color red I have ever seen in a rock. Maybe it was glass. Was Oma being weird? Probably. No harm I guess I folded the velvet back over and snapped the lid shut. I put the box on the mantle. When I turned around eyes met me at the window. The wolf stood peering in. </p>\n\n<p>I was going nuts grief, isolation and exhaustion had drove me there I was sure of it. I should sell this house and move closer to Frankfurt. Or go home. I was alone here now. The wolf jumped up on the window sill and I could tell he was snarling only by show of teeth. Blinds, I was buying blinds until I decided what to do. I slept in Oma&#39;s bed that night. That crazy wolf walked around the house once, I watched him and then he took up his perch at the edge of the wood. In the morning he was gone. </p>\n\n<p>I started doing some internet searches on my Oma&#39;s rock. It was near me, but it was a landmark. Why did she think this small rock was related? The whole trail there was marked difficult and called the Devil&#39;s Path. Apparently there was also a witch in those woods. Crazy legends. </p>\n\n<p>A few days later I went to bring Oma home and spoke to the man at the funeral parlor. I asked him about if there wolves in Odenwald. He said they say there isn&#39;t, but there could be a few with the traveling they have done. He said just to be careful they are usually no threat. Later Oma&#39;s friend stopped by and brought me a dish. I asked her about the local legends and she told me the Teufelsstein had an odd story and people didn&#39;t agree on it&#39;s legend, the people as a whole. The people of the west of us believed it was the Black Forest and we believed the Odenwald. The devil, she said, had no boundary and the argument was useless. He probably appeared in every forest in Germany, she went on, especially in the dark days. She said our western neighbors believed the rock to be like a talisman and others believed it was a landmark said to be the place the devil sat when he came upon the mountains. She said to pay no attention to that garbage. People used good and evil to explain everything. I walked her down the drive and saw Woofy at the edge of the forest again. She turned back towards me and said my Oma was a wonderful woman and she&#39;d be dearly missed. I don&#39;t think she saw Woofy. Great hallucinations. I thanked her and waved. I ignored Woofy and slammed the door. </p>\n\n<p>That night the nightmares started. When I would wake I could only remember bits and pieces. I went back to work. I worked about 30 minutes away. My degree was in Science with a specialization in Ecology, but only at the bachelor&#39;s level. In the United States I could have a game warden or a something like that. In Germany I did office work. I needed the job to support Oma, so I did what I could. I worked in a doctor&#39;s office filing, medical records, book keeping, that kind of thing. I spoke to the doctor who employed me and he gave me antidepressants and told me to spend my free time enjoying what beauty I had right in my own backyard. For a few days I didn&#39;t see Woofy and I was convinced he had been some kind of psychotic feature. Then my Oma came in a dream and said to protect the box from the enemy. Things aren&#39;t always as they appear she told me before turning into smoke and disappearing. I woke with a start covered in cold sweat. And there he was looking at me. His eyes glittering from the light of the fire. I screamed and he sat down unphased. </p>\n\n<p>I went to see a psychiatrist in Frankfurt, but I didn&#39;t say anything about Woofy for two reasons; they&#39;d either believe me and think him rabid or they wouldn&#39;t believe me and I&#39;d be written down as having hallucinations and I could lose my job if I was considering mentally unfit. He suggested that the nightmares were manifestations of fear and I had to face the fears to be rid of them. Oma had only been gone 2 weeks and I was already falling apart without her. </p>\n\n<p>I turned off the engine and my eyes immediately darted to the place Woofy should be. He&#39;s not there, good. I&#39;m sane for the moment. When I get to the front door I realize something is wrong. I saw a shadow moving inside the house, in the living room. I creep to the window hunched over so I cannot be seen. I peek in the window. A figure so dark I can barely tell him apart from the shadows. I&#39;m panicking...he knows I&#39;m there. I put my back to the house ready to bolt back to my car. I close my eyes and take a deep breath. When I open them there&#39;s Woofy breathing right into my face. I open my mouth to scream but the world fades to black.</p>\n\n<p><strong>I am typing this on my phone so I apologize for any errors I tried to edit the best I could. Thanks for reading. Part 2 is done and waiting for the time requirement to be up!</strong></p>\n</div>\n","author":"cchaffee123"}