{"rank":"16","title":"Happy birthday Melanie","id":"8ky9yi","url":"/r/nosleep/comments/8ky9yi/happy_birthday_melanie/","time":"1526877687000","body":"<div class=\"md\"><p>March 8, 2008</p>\n\n<p>Happy birthday Melanie. I love you so much. I miss you everyday. I&#39;m sorry I did what I did. It&#39;s my fault. It&#39;s always my fault. Everything&#39;s always my fault.</p>\n\n<p>-Lexi</p>\n\n<p>March 8, 2009</p>\n\n<p>Happy Birthday Melanie! Not a day goes by where I don&#39;t think of you... LOVe yOU to bitS x</p>\n\n<p>-Lexi</p>\n\n<p>March 8, 2010</p>\n\n<p>Happy birthday Melanie. I hope the world really does end in 2012 so I can be with you finally. I miss you. I&#39;m sorry.</p>\n\n<p>-Lex</p>\n\n<p>March 8, 2011</p>\n\n<p>Happy birthday Melanie. Today would&#39;ve been your 10th birthday. 2 digits. I feel so guilty. I loved you so much. Why could&#39;ve show you loved me back?? Huh? I know you did. I fucking know you had to have loved me. I&#39;m your goddamn sister. You have to love me.</p>\n\n<p>-I don&#39;t miss you ... You already know who this is, cunt.</p>\n\n<p>March 8, 2012</p>\n\n<p>Happy birthday Melanie.</p>\n\n<p>March 8, 2013</p>\n\n<p>Happy birthday Melanie.</p>\n\n<p>March 8, 2014</p>\n\n<p>Happy birthday Mel</p>\n\n<p>March 8, 2015</p>\n\n<p>I can&#39;t take this pain anymore. Today&#39;s your birthday. Today&#39;s your birthday. Today&#39;s your birthday. Today&#39;s your birthday. Today&#39;s your birthday. Today&#39;s your birthday. Today&#39;s your birthday. Today&#39;s your birthday. Today&#39;s your birthday. Today&#39;s your birthday. Today&#39;s your birthday. Today&#39;s your birthday. Today&#39;s your birthday. Today&#39;s your birthday. Today&#39;s your birthday. Today&#39;s your birthday. Today&#39;s your birthday. Today&#39;s your birthday. Today&#39;s your birthday. Today&#39;s your birthday. Today&#39;s your birthday. Today&#39;s your birthday. Today&#39;s your birthday. Today&#39;s your birthday. Today&#39;s your birthday. Today&#39;s your birthday. Today&#39;s your birthday. Today&#39;s your birthday.</p>\n\n<p>-please help me. I&#39;m sorry.</p>\n\n<p>March 8, 2016</p>\n\n<p>Happy birthday Melanie. I tried to join you for your birthday. It would&#39;ve been great present. Not a day goes by where I don&#39;t think about how good it felt to finally watch the blood drain from your body. God, help me. I miss you. I miss watching your muscles relax all at once. I miss you. I miss your smell all around the backyard by the tree we use to swing on. I don&#39;t miss you. This is my last letter to you. You never get these anyways. Here in the ward they want us to be social and write letters to our friends, but your my only friend. But I&#39;m going to join you soon I promise. I already let you have mom and dad, you can wait a week for me. tehe.</p>\n\n<p>-Today&#39;s your birthday. Love lex x</p>\n\n<p>March 8, 2017</p>\n\n<p>Hey baby. If you&#39;re reading this then you know I&#39;m not with you. I couldn&#39;t. I tried I promise. I really did. I did what I did to mommy but before I could slice my neck open, the nurse came into my room. But I guess it all worked out because now instead of being surrounded by crazy people I&#39;m in the hospital being monitored so I don&#39;t hurt myself. But honestly they forgot about me hurting others. tehehe. I&#39;ve lost 7 police patrolling me in the last month alone. I couldn&#39;t help myself from just stopping at you, mom, and dad. I missed it too much and started helping people again. They think the hospital is dangerous and they&#39;re thinking about putting me back int he crazy house but I don&#39;t belong there. Right, Mel? I&#39;m not crazy. The cops watching me keep dying and they don&#39;t know why. The camera footage is gone so they can&#39;t look. </p>\n\n<p>Melanie. I&#39;M sORRY pleASE FORGIVE ME. Melanie. I&#39;M sORRY pleASE FORGIVE ME. Melanie. I&#39;M sORRY pleASE FORGIVE ME. Melanie. I&#39;M sORRY pleASE FORGIVE ME. Melanie. I&#39;M sORRY pleASE FORGIVE ME. Melanie. I&#39;M sORRY pleASE FORGIVE ME. Melanie. I&#39;M sORRY pleASE FORGIVE ME. Melanie. I&#39;M sORRY pleASE FORGIVE ME. Melanie. I&#39;M sORRY pleASE FORGIVE ME. Melanie. I&#39;M sORRY pleASE FORGIVE ME. Melanie. I&#39;M sORRY pleASE FORGIVE ME. Melanie. I&#39;M sORRY pleASE FORGIVE ME. Melanie. I&#39;M sORRY pleASE FORGIVE ME.Melanie. I&#39;M sORRY pleASE FORGIVE ME. Melanie. I&#39;M sORRY pleASE FORGIVE ME. Melanie. I&#39;M sORRY pleASE FORGIVE ME.vMelanie. I&#39;M sORRY pleASE FORGIVE ME.Melanie. I&#39;M sORRY pleASE FORGIVE ME.Melanie. I&#39;M sORRY pleASE FORGIVE ME.Melanie. I&#39;M sORRY pleASE FORGIVE ME.Melanie. I&#39;M sORRY pleASE FORGIVE ME.Melanie. I&#39;M sORRY pleASE FORGIVE ME.Melanie. I&#39;M sORRY pleASE FORGIVE ME.Melanie. I&#39;M sORRY pleASE FORGIVE ME.Melanie. I&#39;M sORRY pleASE FORGIVE ME.Melanie. I&#39;M sORRY pleASE FORGIVE ME.Melanie. I&#39;M sORRY pleASE FORGIVE ME.Melanie. I&#39;M sORRY pleASE FORGIVE ME.Melanie. I&#39;M sORRY pleASE FORGIVE ME.Melanie. I&#39;M sORRY pleASE FORGIVE ME.Melanie. I&#39;M sORRY pleASE FORGIVE ME.Melanie. I&#39;M sORRY pleASE FORGIVE ME.Melanie. I&#39;M sORRY pleASE FORGIVE ME.Melanie. I&#39;M sORRY pleASE FORGIVE ME.Melanie. I&#39;M sORRY pleASE FORGIVE ME.Melanie. I&#39;M sORRY pleASE FORGIVE ME.Melanie. I&#39;M sORRY pleASE FORGIVE ME.Melanie. I&#39;M sORRY pleASE FORGIVE ME.Melanie. I&#39;M sORRY pleASE FORGIVE ME.Melanie. I&#39;M sORRY pleASE FORGIVE ME.Melanie. I&#39;M sORRY pleASE FORGIVE ME.Melanie. I&#39;M sORRY pleASE FORGIVE ME.Melanie. I&#39;M sORRY pleASE FORGIVE ME.Melanie. I&#39;M sORRY pleASE FORGIVE ME.Melanie. I&#39;M sORRY pleASE FORGIVE ME.Melanie. I&#39;M sORRY pleASE FORGIVE ME.Melanie. I&#39;M sORRY pleASE FORGIVE ME.Melanie. I&#39;M sORRY pleASE FORGIVE ME.Melanie. I&#39;M sORRY pleASE FORGIVE ME.Melanie. I&#39;M sORRY pleASE FORGIVE ME.Melanie. I&#39;M sORRY pleASE FORGIVE ME.Melanie. I&#39;M sORRY pleASE FORGIVE ME.Melanie. I&#39;M sORRY pleASE FORGIVE ME.Melanie. I&#39;M sORRY pleASE FORGIVE ME.Melanie. I&#39;M sORRY pleASE FORGIVE ME.Melanie. I&#39;M sORRY pleASE FORGIVE ME.Melanie. I&#39;M sORRY pleASE FORGIVE ME.Melanie. I&#39;M sORRY pleASE FORGIVE ME.</p>\n\n<p>Please forgive me Melanie. I was just trying to help you go to. better place. Don&#39;t worry. I&#39;ll get there with you soon.</p>\n</div>\n","author":"heradical"}