{"rank":"10","title":"The Content Creators (Part 1)","id":"8kybny","url":"/r/nosleep/comments/8kybny/the_content_creators_part_1/","time":"1526878247000","body":"<div class=\"md\"><p>You&#39;ve heard them all.  Allegations against celebrities and outing predatory men in high places.  This isn&#39;t limited to just Hollywood, it goes into more of the online territory.</p>\n\n<p>YouTube.  Where we watch our favorite channels and reviewers until they slowly lose the energy they started with and slowly lower quality and sell themselves out to Audible.com or the like.  Then they beg for subscribers, link to their own YouTube Red series...</p>\n\n<p>Then the hate for the channels becomes a different beast altogether when you hear someone involved was a rapist.  When someone abused or ignored the people who worked with (for) them without pay.  Or someone groomed children or harassed women at conventions and the list goes on.  It shocks you.  It disgusts you.  It creates an implosion like no other.</p>\n\n<p>I wish this one channel would be the exception.</p>\n\n<p>It started with only 600± subscribers, so when you compare it to the larger and more familiar channels this channel was <strong>SMALL.</strong>  It didn&#39;t post weekly, or even monthly.  It was a very independent channel with a budget that wouldn&#39;t even allow for shoestrings.  The thing is:  I knew the guy who ran the channel and everything.  He is an old friend of mine.</p>\n\n<p>Kyle Robbins.  He was one of my best friends in high school.  We did all sorts of stupid shit together.  We&#39;d come over to his house and watch terrible movies while he and I would riff through the whole thing.  We entertained ourselves.  I noticed Kyle was very quick-witted.  He would think ahead of the conversation at least 3 sentences before he spoke the first word.</p>\n\n<p>He had this energy that can only be his.  Kyle was always the class clown.   I made some jokes, too.  I tried my hand.  But Kyle.... man he made us all laugh.  Kyle helped me through some tough times.</p>\n\n<p>There was a time where I was going through some heavy depression.  I went to the store and bought a knife set, along with some other groceries that meant nothing but to hide the scent of suspicion.  I wasn&#39;t even looking, just walking through aisles and pulling whatever into my cart to fill it.  I needed that knife set.</p>\n\n<p>I even had a plan.  At 6:00 PM my mom would go out to her job, leaving me alone with my little brother.  He was 5 years old at the time.  I would plan to send him off to bed early, read him his last story from his big brother.  Then I would go into the bathroom, turn on the shower to wash the body and blood that would be all over the place soon.  Only then I would get one of the knives out.</p>\n\n<p>No one would miss me.  I didn&#39;t care anymore.  I was a stupid teenager.   I said the wrongs things.  I was the wrong color.  I was awkward with girls.  I even got bad grades.  I wasn&#39;t worth it.  Kyle is popular enough at school to make new friends without me.  Everyone at school could go on without me.  My family can afford to miss me.  We already lost Dad, if I go too they are already ready for me to leave.  I wouldn&#39;t add any tears to their eyes.  </p>\n\n<p>At least after I go I thought....when I see him... Dad will tell me how much I matter to him.  I know he&#39;d hold me when he does.  Because he loves me.</p>\n\n<p>I have that to look forward to.  I wanted that.  I wanted that so badly.  All the heaven I ever needed was my Dad.  I miss him so much.  Sadly, I can&#39;t say the same for others about me.  It&#39;s time for me to go...</p>\n\n<p>As I was on my way out of the store, who should I run into but Kyle.   I can tell you everything about that day.  What he wore.  What he said.  What I said.  Every detail froze in place because of how much that day means to me now.</p>\n\n<p>All he did was look into my bag, pull out one of my grocery items, and look at me quizzically before bursting into laughter.  I know the following joke may come off as sexist, or in bad taste.  I know women who offend easily, and I&#39;ve cracked every eggshell I&#39;ve walked on.  But the following joke saved my life.</p>\n\n<p>He pulled out a small bag of Maxi pads and looked right at my face.  He saw my frown.  He gave me a smile as he handed back it to me and said the following words:  </p>\n\n<p><em>&quot;Looks like it&#39;s your time of the month, huh?&quot;</em></p>\n\n<p>There was a slight pause where we just stared at each other.  I looked at his face contort and then he broke first, roaring into spontaneous laughter.  I looked down at the bag for a second to confirm that I actually bought... those pads.</p>\n\n<p>Then I started to laugh.  </p>\n\n<p>A laugh that echoed down the block.  A laugh that went down from the grocery store parking lot and into my house.  A laugh I shared with a 5 year old boy who would now get to hear many more stories from his big brother.  </p>\n\n<p>I laughed myself to sleep.  I couldn&#39;t stop laughing.  I was thinking about how Kyle saved my life and what I planned to do before I laughed even harder that night.  Then I started crying.  I never cry.  Tears burned my eyes and flooded with my congestion as I snorted and literally ugly cried.</p>\n\n<p>The next morning things were different for me.  I felt like happiness can actually make life better.  Joy can make life matter.  Laughter is the best medicine money can buy...</p>\n\n<p>...I owe Dr. Kyle so much.</p>\n\n<p>The rest of high school was a walk in the park.  Sure, I worked hard to bring up my grades.  I still got the cold shoulder from girls or said the wrong things around them.  I was even still making bad jokes and getting scolded at every corner.  But I knew something:  *<em>Life is worth its problems.  And I am worth my mistakes. *</em> </p>\n\n<p>I had two people to thank for this new outlook.  Dad.  And Kyle Robbins.  I always tried to make others laugh because of what I knew it did for me.  </p>\n\n<p>At graduation, Kyle gave a normal valedictorian speech.  It surprised all of us.  He said things about how important homework was and how much help the faculty and staff are.  How he wished we had less days off and how he wanted to just stay in school all day and study textbooks.  </p>\n\n<p>At the end of the speech, he turned and farted into the microphone.  Class of 2002.  Just wow.</p>\n\n<p>With shocking yet riotous laughter, we all threw our caps in the air and said goodbye to that strange era called high school.  We were ready to enter the real world, and I have never been more relived.  Kyle had to stay after the ceremony and speak with the vice principal for awhile.  We ALL knew why.</p>\n\n<p>I got accepted into UCLA, got a Master&#39;s in Business, and tried to take computer programming classes but I couldn&#39;t hack it.  Eventually, I hired them.  Site builders.  I wanted to start an online business.  But fate had other plans.</p>\n\n<p>Eventually years went by before I crossed paths with Kyle again.  He met me off-campus and told me he wanted to start a show on YouTube and all I saw on that site was some annoying &quot;Numa Numa&quot; guy, so I was skeptical if this was a valid platform at all.</p>\n\n<p>It was a strange way to say it was the &quot;pioneering&quot; days of online media and content creators.  I didn&#39;t get that vibe.  To me, I didn&#39;t see this magic of YouTube that everyone misses now.  I just saw that this mess was the first video-hosting site I ever knew about.  I saw Kyle committed to it.  </p>\n\n<p>That was all I needed to know I had to help him.</p>\n\n<p>We started work immediately.  Putting our riffing skills to use, he became a reviewer.  He was not the first, he was <em>one</em> of the first to do this particular online show.  We had an endless supply of bad movies to review.  His DVD rack was enormous, and expanded from the living room all the way down the hall to his bedroom.</p>\n\n<p>I set up our camera, and he pulled out movies and reviewed them.  I know I could get into more detail with the technical aspects of the show, but I need to draw the focus back on why I&#39;m telling you this story.</p>\n\n<p>After exactly just 1 year of reviewing, I wanted to call it quits.  I knew Kyle. He would understand if I wanted to quit.  I needed someone to replace me.</p>\n\n<p>You know how Yoko Ono is a woman hated by Beatles fans for ruining John Lennon forever?  Or how people came to have so much hate for her in general?  I mean, this kind of fan hate spans literal decades.</p>\n\n<p>This is how I will introduce Caitlin Verruga.</p>\n\n<p>Her last name...  I mean, wow.  I seriously didn&#39;t know that could be anyone&#39;s last name.  I know if you&#39;re white it sounds nice and makes you picture some kind of Spaniard swordsman but.... if you speak Spanish you know what I&#39;m talking about here.  I don&#39;t know HOW many times I teased her in my high-school level speaking ability:  &quot;Caitlin te da verrugas&quot;</p>\n\n<p>I really cannot emphasis enough here how much I hate her.  Really.  It disgusts me.  She is to women what Trump is for Americans.  Someone who unfortunately represents you, and you need to apologize for that unless you find a way to get rid of them.</p>\n\n<p>I don&#39;t know how many times she ends her posts on her twitter feed with &quot;#MeToo&quot; until it loses all meaning.  There are women who needed courage to speak out against men in high places.  They are brave.  They are honest.  They have nothing to gain by accusing these men.  Sadly, I know some women can be cowards and liars and use this kind of thing as a vehicle to come off smelling like roses.  Because victim blaming is wrong, asking if she&#39;s lying is too.  She is the girl who cried rape.  I hope the wolf gets her.</p>\n\n<p>Really.  Fuck her.  FUCK HER!</p>\n\n<p>Anyway, at the time I didn&#39;t know any better and had Caitlin sign up to help with Kyle&#39;s YouTube Channel show.  They did sketches together and wore costumes sometimes.  They really brought out the kind of &quot;college play&quot; vibe where you know they are trying so you can&#39;t hate them for trying.  The jokes were lame and corny.  Because they had to appeal to a YouTube audience, a wide audience.  Couldn&#39;t do any of the edgy jokes I wrote for him anymore.  Nope.  Caitlin became co-writer.</p>\n\n<p>She&#39;s a funny girl.  Funny like the new 2016 Ghostbusters remake.  And if it wasn&#39;t funny to you then you&#39;re this sexist misogynistic MAN-thing.  That&#39;s it.  It&#39;s like all the hate you throw at it gets spattered all over you, like spitting in the wind to your face.</p>\n\n<p>That&#39;s our Caitlin.</p>\n\n<p>At first, I admit I liked her.  <em>Liked her.</em>  Like when after a small dog bites you but it looks cute to some old lady while closing its jaws.  Or when you get hit by someone else&#39;s favorite car and as it drives over your body they think, &quot;wow, I want one of those.&quot;  I&#39;m not always very funny when it comes to jokes.</p>\n\n<p>I knew the Kyle that stopped joking around.  I knew the serious Kyle.  It was pretty special for me to see.  I know how he cried when he told me he hated both of his parents for never being there for him.  I held him close as he sobbed.  He was once there for me, it&#39;s only fair to always be there for him.</p>\n\n<p>You see.  The thing is I know Kyle is lonely.</p>\n\n<p>Both of his parents were away on business all his life and he had to take care of himself.  Poured his own cereal each morning.  He had no siblings.  He needed all the friends.  I was lucky to be one for him.  He was lucky to have me.</p>\n\n<p>Everyone liked him at school.  They figured he had everything.  His parents were rich.  His house was big.  Everyone wished they could be Kyle.  Except for Kyle and me.  </p>\n\n<p>Because I knew he was a lonely guy it was actually sad to see him ask Caitlin out on dates.    Because I knew why he did it.  It wasn&#39;t that he liked Caitlin.  It was that he liked being with someone.  Anyone.</p>\n\n<p>Now I really don&#39;t care for you to like me or anything.  I really don&#39;t.  I had a brush with suicide because I&#39;m not a very likable guy.  But I know, somehow I have this way to tell.  It&#39;s a curse.  A real fucking curse.   I know she used him.</p>\n\n<p>Because after 7 months of dating, they broke up.  It was the worst way to do it, too.  It happened right after new years, 2009.  I remember because that was also the first time YouTube started running ads.</p>\n\n<p>I remember getting a call that morning when I hear Kyle crying and blaming himself for how he and Caitlin grew apart. I stayed on my old flip-phone and I remember how sweaty and wet the ear slide was, the tiny upper screen fogged by my moisture.  I was working late at a fast-food joint to make ends meet, and he caught me on break.  I was almost feeling good that day, too.</p>\n\n<p>I care for Kyle enough to stop the world.  Because at that point it did.  Both of us stop the world together because our friendship is that strong.  <em>My problems are Kyle&#39;s problems and Kyle&#39;s problems are my problems.</em>  That is how friendship works.</p>\n\n<p>No matter how much I hate and blame Caitlin, I knew he felt strongly about her.  And it was tough, hearing him crying and struggling to breathe on the other end.  Then he confided something in me.</p>\n\n<p>He asked me if he should commit suicide.</p>\n\n<p>I was shocked.  I asked him flat out why bring that up.  He told me something I will never forget.</p>\n\n<p>&quot;That day, when I made that Maxi pad joke.... I saw the knives.   I knew you&#39;d do something stupid.   What can I say?  I had to stop you.  I wanted to make you feel good about yourself.  I-&quot;</p>\n\n<p>He broke down probably when he realized he could apply the same thoughts at himself and even though I couldn&#39;t see him I felt every last thing tearing about inside him.  To say he was conflicted would be the ultimate understatement.</p>\n\n<p>I said, &quot;Kyle.  Don&#39;t you think for one second it will be easier for you than it was for me.  Please believe me when I say I know what you&#39;re feeling.  It&#39;s not a good place to be and it&#39;s not a good idea to go through any of it.  Kyle, I&#39;ll miss you...</p>\n\n<p>And besides, it&#39;s the wrong time of the month....&quot;</p>\n\n<p>I heard laughter on the other end.   I knew then that it was safe to hang up.  I made a mistake.</p>\n\n<p>Because two days later his parents called me to tell me that the police found his body.  He went thought with it after all.  The man who saved my life took his own.  Fuck life.  Fuck everything.</p>\n\n<p>There is a rush inside my head that goes beyond a headache.  There is a pain inside my heart that goes beyond a heartache.  What it was simply, was that I was breaking apart.  It wasn&#39;t mental.  It wasn&#39;t myocardial.  It was some proof of a soul, because I felt each piece of it fall away.</p>\n\n<p>Familiar thoughts of my own suicide and loneliness spread all over my body.  I didn&#39;t eat.  I didn&#39;t sleep.  I didn&#39;t want to watch TV.  Or go outside.  Or meet people.  Or act nice to them if I did.  Somehow, all the progress I made over those years siphoned away like sand in the hourglass.  All that happened was the time that went by.  The growth of this better person I was going to be was gone.</p>\n\n<p>I had the filmmakers and other students that helped with the reviews take over the channel.  I wanted no part in it&#39;s future, but I at least wanted a future for it.  It was Kyle&#39;s legacy.  But it shouldn&#39;t be thought of like that.  I wanted to give these new guys a chance.</p>\n\n<p>My faith was not misplaced.  In several years that channel would grow and grow a hundredfold to at least 60,000± subscribers.  People really liked it.  I even watched a few episodes.  I knew the guys were acting very similar.  They were making the same jokes, and tried to go for the same energy he had.  </p>\n\n<p>They were good, but no one could replace Kyle. </p>\n\n<p>At Kyle Robbins&#39; funeral, I spoke with words that weren&#39;t my own.  I felt like I was sitting in the audience, watching myself speak.  I could see how pathetic I look, standing there in front of the microphone with no emotion on my face, reading the words like I was a damn robot.  I wanted to be further away than that.  But I knew the words came from my own mouth.  I knew Kyle&#39;s family staring back at me, faces wet with tears.  I knew I was there.</p>\n\n<p>But I didn&#39;t want to be.  </p>\n\n<p>I wanted to be with Kyle.  I wanted to be with my Dad.</p>\n\n<p>Why am I still here, looking at all these creatures called human beings that I have no obligation to care about anymore?  Why am I still in this world I want to leave behind?  Why didn&#39;t I go <em>that</em> day?  Why couldn&#39;t Kyle not make me feel better that day?  And just let me die.</p>\n\n<p>To make matters worse, guess who spoke right after me?  Caitlin.  Yes, Caitlin.  She was crying crocodile tears and telling people how nice a guy Kyle was when they were dating.  Near the end of her speech, she waved and made a few shout outs to her new boyfriend in the audience.  Then she made some jokes and felt better (about herself.)  When she was done, I was the only one not applauding.  My hands were too cold, but not as cold as what made itself home inside me.</p>\n\n<p>Do I blame this girl?  Should I?  Kyle made his choice.  And I made mine.</p>\n\n<p>It takes so much of the burden if you let her carry it all.  Easy way out, sure.  But think of how simple it is to hate someone with the blame game, the game everyone knows how to play!</p>\n\n<p>When nothing makes you happy anymore, you have to find someone who took that happiness.  A scapegoat.  I felt that Caitlin took my happiness.  In a way, that is true.  If it weren&#39;t for her, Kyle would still be here.</p>\n\n<p>To make us laugh.  She took that from me.  From all of you.</p>\n\n<p>If you met Kyle, you&#39;d see him through the lens of my eyes.  A good person.  Funny.  Not always smiling, but always finding new ways to find yours.  Completely likable.  A bit rude and childish, but in general he will brighten your day.  Or at least, he would have.  It&#39;s funny, talking about him like this is almost like I can pretend to have the power to bring him back to me.  If only I can introduce you...</p>\n\n<p>He saved my life.  I&#39;m sure he&#39;d do the same for you.  If only he hadn&#39;t...</p>\n\n<p>This is hard for me.  Very hard.  Still, I owe it to Kyle to go on.  After his funeral, I stayed and stared at his grave.  It&#39;s amazing that after everything he did in life.  How important he was to me.  How much I&#39;m going on about him, it all gets summed up by cold, carved words in stone.  </p>\n\n<p><strong>Kyle Benjamin Robbins</strong>  </p>\n\n<p><em>1984-2009.</em>  <strong>&quot;Heaven sent us a little Kyle.  Kyle gave us a little heaven.&quot;</strong></p>\n\n<p>That&#39;s all there is to it.  You die.  Alone.  Every piece of dirt and every worm wiggling in it swallows up everything you ever care about, everyone you love, and all that you are.  Death rules this world.  Every ending is eternal.  The world doesn&#39;t need us to turn.  There are many days after your last.</p>\n\n<p>Something inside me, a deep dark place, lit a small white flame.  It&#39;s growing.  It feels so good.  Pure hate.  Hate will keep me going.</p>\n\n<p>If you hate me, then I need the embers for the flames.  Thank you, for hating me.  It keeps me alive.  Helps me FEEL alive.</p>\n\n<p>It was many years, almost 8 years since I ever dwelt on a single thought about what happened with Kyle.  My therapist said it wasn&#39;t good for me.  I also attended anger management.  I needed to get through life better.  But I still had this dark, twisted thing living inside me.  I just wasn&#39;t supposed to feed it.</p>\n\n<p>Unfortunately, yesterday a large dinner was served and fed this dark, twisted creature inside me.  And it only grew.</p>\n\n<p><a href=\"https://imgur.com/Tz0sKSF\">All it took was this message from Caitlin.</a></p>\n\n<p>Because of what Caitlin Verruga posted on her twitter feed, all my hate for her came flooding back.  Her twitter posts linked to Kyle&#39;s old channel and the guys currently running it, and it was a message to them.  It became the channel&#39;s first and last controversy.  Because after that, the channel was removed. </p>\n\n<p>Her channel meanwhile boomed in views.  All her channel is is her.  Being &quot;funny.&quot;  I guess people like that sort of thing.  However, her subscribers rose by 20,000.  I&#39;m no mathematician, but I&#39;d say all of those are from Kyle&#39;s channel.  It was in no way a coincidence.  It happened overnight.  Literally.  </p>\n\n<p>The white flame spread like wildfire.</p>\n\n<p>Oh yes, she got something out of this.  That Caitlin bitch will always bark and everyone will always come running.  Fuck my life.</p>\n\n<p>In case you didn&#39;t read the link, she said she was raped and she&#39;s <em>blaming a man who committed suicide, who cannot speak for himself, and that is more sick than it being true.</em>   If it is true, then the Kyle I knew was a monster.  How could he be?</p>\n\n<p>I am the monster.  And I am hungry for prey.</p>\n\n<p>This morning, I came into contact with Caitlin&#39;s current boyfriend.  He is actually my little brother.  (Don&#39;t worry, he&#39;s not 5 anymore) Thanks to him, and thanks to her for rocking the cradle, I found my way to invite her over for a cup of coffee at the local Starbucks.</p>\n\n<p>I have no clue why, but she relented.  Texted me right back saying she&#39;s be okay with it, but she needs to film a video for her channel this morning.  I told her not to worry, I know a place where she can film.</p>\n\n<p>Off campus, there was this old performing arts building that had fallen into disrepair since 2011.   I had the keys because I used to use it myself way back when I helped Kyle.  I&#39;m afraid I don&#39;t know the new guys who took over so well, so I just wish them the best of luck.  Back when we started out, Kyle wanted a nice soundproof room.  There was padded room with a piano.  I remember moving it out with him, so he can set things up.</p>\n\n<p>It locked from the outside, and I would stay out in the hallway and watch for when people came over.  I let him know, and instantly he would stop filming and act like he was studying sheet music or something.  Funny thing was, he was shy about his own YouTube show since things were awkward at the time anyway.</p>\n\n<p>I offered to take her there, use my camera, and I would set things up for her.  What&#39;s funny, is that we had a fight while I mentioned Kyle.</p>\n\n<p>I told her I didn&#39;t believe a word of it.  She told me I was in denial because of how close I was with him.  That led to me being stupid again.</p>\n\n<p>&quot;You know, I think the #MeToo movement wouldn&#39;t have happened if Hillary had been elected president.  It scares you so much that a predator like Trump is in the white house that you have to empower yourselves and fight back, however you can.  I personally believe that you women would be contented to stay quiet with the relief of a woman president.  That&#39;s my theory.  I don&#39;t hate women.   Just take my words for what they are.&quot;</p>\n\n<p>She looked at me, lowered her eyelids halfway in disgust and said, &quot;Well, aren&#39;t you a dark little theorist. They could use someone with an opinion like that for FOX and Friends and all the other fake news.  Or are you afraid of the government?  Actually, in your case, I&#39;d be more afraid of the local cops, ha ha.&quot;</p>\n\n<p>I&#39;m black.  So somehow she can use being an activist and a women to top one off so her racism can be overlooked by your white SJW communities.  I&#39;m far more comfortable with people who are just uncomfortable with us.  At least then they don&#39;t pretend to care with one audience and when it leaves they can take off the mask.</p>\n\n<p>&quot;Yep.  You caught me without my tinfoil hat. Must have left it at home with all my JFK and 9/11 conspiracy charts.  But if you want, I can-</p>\n\n<p>&quot;Shut up nigger.&quot;</p>\n\n<p>I didn&#39;t respond.  I didn&#39;t want this girl to have the satisfaction of how much that word hurt me.  Anyone, really.  Also, she is not just being hateful, but she was being sarcastic.  Sarcasm, It&#39;s the wrong perfume for a white woman.  But I let her have the last word.  Maybe Kyle is watching, making sure I keep my cool.  For now.</p>\n\n<p>So after a while, we both just sat there.  The two of us.  With the fire inside of me roaring to consume her.</p>\n\n<p>We both got up without a word, picked up our things and got in our respective cars.  I had to wait for her on an intersection with a red light and she followed behind my car.  I drove to that old building.</p>\n\n<p>I knew the staff at the university.  I made a few concessions.  I allowed myself to pick a room.  I made sure everything was right.  I went to my trunk and pulled out my camera, the stand and a portable lighting fixture.  It wasn&#39;t professional, but it was enough.</p>\n\n<p>Back then, it was enough for Kyle and for me.  </p>\n\n<p>So here I was, helping out the very women I hate set up for her channel I will never subscribe to.  Mostly because I&#39;m no rodent.  Her show is so superficial and so separated from reality or talent that it borders on the tween Disney sitcom with the failed delivery of the tired staging.  It is that bad.</p>\n\n<p>My brother sent me a text.  Asked me if she was with me.  I didn&#39;t reply.  I love my brother, but even I keep some things from him.</p>\n\n<p>&quot;All set.&quot;</p>\n\n<p>I stood behind the camera, turned it on, and made a motion with my arm that we are live.  She was doing a vlog and she was explaining #CaitlinStrong and <a href=\"https://imgur.com/Tz0sKSF\">her controversial post.</a>  She has a following.  It grew since that post of hers.  Ten years to the day she dated Kyle Robbins.  It didn&#39;t happen the way she said it did.  Kyle wasn&#39;t like that.</p>\n\n<p>As the camera was rolling, I tell her I need a bathroom break.  I leave the camera on the stand and open the door.  As I close it, I lock it behind me.</p>\n\n<p>Then I do something gruesome.  I ask myself, &quot;is it small enough?&quot;</p>\n\n<p>I swallow the key as I walk down the hall.</p>\n\n<p>I actually did go use the restroom.  After walking back down the hall, I heard thumping and something slamming on the metal door.  I love old buildings, they don&#39;t make them like they used to.</p>\n\n<p>She won&#39;t get out.  Not until I take another shit.  Then maybe, if I feel bad enough, I could call somebody or dig through my shit for the key.  I wouldn&#39;t prefer the latter, so I could wait things out for an hour or three before calling the groundskeeper who actually still cleans these empty halls.</p>\n\n<p>With Caitlin locked in a padded room with no other doors, no windows and no ventilation for a few hours, that should be plenty of time for her to reflect on her actions.  Her actions against Kyle.  Her words against me.</p>\n\n<p><a href=\"https://www.reddit.com/r/nosleep/comments/8kybny/the_content_creators_part_1/\">Let&#39;s see what kind of a show she puts on.</a></p>\n</div>\n","author":"Kaladad9893"}