{"rank":"204","title":"The Nosleep Challenge","id":"8kyf22","url":"/r/nosleep/comments/8kyf22/the_nosleep_challenge/","time":"1526879379000","body":"<div class=\"md\"><p>[Audio Version](<a href=\"https://youtu.be/ZVFo67pBtJQ\">https://youtu.be/ZVFo67pBtJQ</a>)</p>\n\n<p>Hello, recently my best friend was murdered.  I know how that sounds and, I assure you, I am not here to try to scare you. I’m here because I am the one who is scared, paranoid and looking for help.</p>\n\n<p>Before I get into what happened, I’ll let you know a little about my friend, Alex. We’ve been best friends since we were kids, we would stay up all night in homemade pills forts.; always at my house, though, never his.</p>\n\n<p>Alex… wasn’t the cleanest person, not from the time we met as kids, to when he was murdered. I could never stand being in his room for more then a few moments, I couldn’t even see the floor due to all the trash. His parents either didn’t care or were too busy to notice, although I can’t imagine how.</p>\n\n<p>Alex was always into horror movies, he loved the Goosebumps shows and every time we would have a sleep over he would beg me to watch scary movies. I couldn’t watch them, I was a big baby and I still have problems sleeping in the dark if I&#39;m completely alone.   But, what I&#39;m getting at is that me and him spent most of our childhood and early adult hood as friends. Which is why, when he started to isolate himself, I reached out and tried to figure out what was going on. It was a bit out of character for him. At first, I thought he was dealing with depression, but, I’ve never known him to struggle with it and he was always an outgoing person.</p>\n\n<p>I get at least 3 messages from him a week with something like, “hey man! Check out this story I found on Nosleep, you will love it.” I would roll my eyes and reply with something like “umm, remember when you said that about that one story “Feed the pig” which turned out to not have anything to do with farming? No thanks”   I just don’t like scary stories as much as he does. So, when I got a message from him saying, “Dude, have you heard of The Nosleep Challenge?” I replied“Bro, what do you think? Lol.” His reply was, “well, someone just messaged me about it and I’m going to try it out”.</p>\n\n<p>After that I didn’t hear from him for three days.</p>\n\n<p>This wasn’t like him, normally I would have received one spammy message abut some story he found. When I messaged him asking how he was doing, I didn’t get a reply. I tried calling him a few times, but it went to voice mail. Since I was at work at the time, I figured I would stop by his house after.I pulled up to his house and saw his car was there. Assuming he was home, I knocked on the door, after a few moments I knocked again, still no answer. I tried looking through the window but all the curtains were drawn and no lights were on.   I was worried, but I wasn’t sure what to do. Sure, I can rationalize that its only been a few days and I don’t need to worry, but this wasn’t common behavior. I don’t think we have gone more than two days without some form of communication in 10 years.</p>\n\n<p>I figured I was worrying too much and decided to head home, but that night I got a phone call from Alex. With a sigh of relief, I answered.  “Hey man! How are things, haven’t heard from you in a few days, I came by your house to make sure you hadn’t accidentally hired a hitman on yourself or something, ha! Get it!?.... “   All I heard on the other end of the line was static before the line cut off.  I looked at my phone for a moment in confusion. “Well, I thought it was funny,” I mumbled to myself.</p>\n\n<p>Two more days passed, and I still hadn’t heard from him. I decided to call the police. When the police came they found the door barricaded from the inside, they were able to get in through a window. What they found was something I can only describe as a mad scientist&#39;s attempt at a life-size version of the game Rattrap.</p>\n\n<p>There were poorly rigged contraptions all over the place, weird markings and symbols on the walls, old tvs and speakers were laying everywhere.   The house was a wreck  and, in the middle of it all, was his desk, covered in papers.</p>\n\n<p>The police found my friend in his bathroom with his eyes cut out of their sockets… After the investigation turned up nothing, I was able to see copies of the papers they found on his desk, as I was mentioned in them. The notes appear to be a journal, describing what was happening in the time I didn’t hear from him.</p>\n\n<p>I couldn’t get the originals, only photo copies, and the handwriting gets harder to read as it continues. But I am going to try to transcribe the notes here for you, to help you understand, so maybe you can help me.   I&#39;ll post the pages titled “Day 1” as soon as I finish transcribing them.  Talk to you soon.</p>\n</div>\n","author":"RonnieReads"}