{"rank":"385","title":"chastitytemperancecharitydiligencepatiencekindnessHUMILITY","id":"8kyrez","url":"/r/nosleep/comments/8kyrez/chastitytemperancecharitydiligencepatiencekindness/","time":"1526883884000","body":"<div class=\"md\"><p>Is it just me, or is it hard to find genuinely good people nowadays? </p>\n\n<p>I thought my father was a good man, until the day I saw him stuffing the body of a young hooker into a hole in our backyard. </p>\n\n<p>I was almost halfway to 13 at the time. I knew exactly what was happening when he turned on me. \nI&#39;m sure he thought I was dead. \nWhen I woke up I felt my younger sister on top of me and I tried to wake her. Then I realized her face was smashed in. </p>\n\n<p>The dirt was still soft where he had buried us and I used every last bit of energy I had to dig myself out. Dirt mixed with portions of my sisters scalp and blood dropped from the hooker&#39;s neck into my mouth as I gasped for breath. </p>\n\n<p>When I got out I saw that my father had burned down our house with my mom and Grandma inside. I could still see their scorched bodies writhing in the flickering flames. </p>\n\n<p>I ran and never looked back. But I never forgot. I followed dad for probably the next 19 years. I saw him get remarried and have three new children. </p>\n\n<p>I bought the house next to his and waited until I knew that the moment was right.</p>\n\n<p>The night I went to finish him off I only carried a modest set of tools. Everyone was asleep soundly after he celebrated some kind of cookoff with an exorbitant amount of brats and mustard. </p>\n\n<p>The dog barked as I climbed over the fence. It was quiet in less than a minute as I bent down and ruffled its fur. It wagged vigorously at me like I was an old friend. </p>\n\n<p>When I got inside the house I felt like I had memorized every angle, every corner. Even in the darkness I knew exactly which way to go. My father was snoring loudly the same way he always did. I was so quiet he didn&#39;t hear me come up behind him with the hammer. </p>\n\n<p>I thought of how he finished us off without a thought and the smug smile he wore now. I grabbed his pillow and shoved it down on his face. I didn&#39;t want this to be easy for him. </p>\n\n<p>I&#39;m stronger than I look. But I wasn&#39;t trying to make it quick. I wanted it to be slow. His new wife was so out of it she didn&#39;t even hear his muffled screams. I guess I&#39;m better at this than I thought I would be. Once he was unconscious I too him from the house with little effort. </p>\n\n<p>When all was said and done I left the house as quickly as I came. The police came the next morning, trying to determine what had happened. But I was meticulous. </p>\n\n<p>It was though I was never there. </p>\n\n<p>I&#39;ve moved since then but every once and a while I see my half-siblings at the mall. They seem sad that their dad was gone. \nI want so bad to tell them all that I have  done for them and all that I am still doing to their, to my father. </p>\n\n<p>But I don&#39;t like to <a href=\"https://m.facebook.com/Kyle-Harrison-2120650624830271/\">brag</a>.</p>\n\n<p><a href=\"https://www.reddit.com/r/nosleep/comments/8i5vzr/chastitytemperancecharitydiligencepatiencekindness/?st=JH6OZQBW&amp;sh=4e2a1457\">CHASTITY</a><a href=\"https://www.reddit.com/r/nosleep/comments/8in119/chastitytemperancecharitydiligencepatiencekindessh/?st=JH6P05DZ&amp;sh=eca1d006\">TEMPERANCE</a><a href=\"https://www.reddit.com/r/nosleep/comments/8jfn63/chastitytemperancecharitydiligencepatiencekindness/?st=JH7TIOAM&amp;sh=8065c7ce\">CHARITY</a><a href=\"https://www.reddit.com/r/nosleep/comments/8jupqg/chastitytemperancecharitydiligencepatiencekindness/?st=JHBA26ZZ&amp;sh=88de1336\">DILIGENCE</a><a href=\"https://www.reddit.com/r/nosleep/comments/8kcb7t/chastitytemperancecharitydiligencepatiencekindness/?st=JHDGYDBQ&amp;sh=34f82c64\">PATIENCE</a><a href=\"https://www.reddit.com/r/nosleep/comments/8kljm7/chastitytemperancecharitydiligencepatiencekindness/?st=JHFV3ZQF&amp;sh=49f35205\">KINDNESS</a>humility</p>\n</div>\n","author":"Colourblindness"}