{"rank":"9","title":"The Gas Station","id":"8kyvyk","url":"/r/nosleep/comments/8kyvyk/the_gas_station/","time":"1526885624000","body":"<div class=\"md\"><p>All of my high school years I was kind of jealous of the kids who got to work in retail jobs, inside a nice cool gas station, Walmart, or fast food restaurant, I wasn&#39;t jealous because i didn&#39;t have a job but because my job was labour specifically re-shingling roofs, out in the blindering sun all day and I remember about a month before I finished grade ten, I hadn&#39;t been pulled up onto a roof for a couple of weeks, just because of how steep (12:12 pitch) and tall the current roof was. me and my dad worked at the same company and I was on his roofing crew. This steep roof was out at a place called shaws point, my dad took me out there one evening to see it, and on the way there we drove by this gas station that had been shut down for years, because the owner had killed himself in it, he supposedly haunted the place afterwards, I didn&#39;t believe in ghosts or anything at the time but hearing this intrigued me</p>\n\n<p>It had been a few days since I found out about the gas station, I had talked my friends into go there with me and checking it out, a few of them were hesitant at first but I convinced them anyway.</p>\n\n<p>When we got to it, it was about 11:00 pm, pitch black, we all brought the necessary equipment for breaking into abandoned houses, flashlights, snacks, crowbars, etc, but I was the smartest I brought a knife, just in case we got attack by gang members or drunks.</p>\n\n<p>We broke opened the door and turned on our flashlights to reveal a dusty moldy convenience store. We walked around looking at the old candy and stuff still on the shelves, then the door closed with a loud bang, at first we just said it was the wind and moved on. There was a hot dog machine on the counter, it looked like it still worked, one of my friends carried it over to the door claiming it as his, we pressed on to the back of the store.</p>\n\n<p>We walked into the back of the store to find a living quarters, there were your typical house items, bed couch tv, fridge, etc, but what was in the middle of the room is what caught our eyes, a noose just hanging there, and from this point on all i remember is static, like white noise, and then I woke up in the morning, everyone but me was dead, i was covered in blood, my knife was missing. Now what do you expect me to do in this situation, I left and didn’t look back. My friends weren’t found for a week, the police wrote it off as the ghost did it. A few days later they burnt the gas station down. You know what&#39;s the strangest part, I only had four friends with me but there was five bodies when i left, one dangling from the ceiling… knife in hand...</p>\n</div>\n","author":"Tiergan3"}