{"rank":"14","title":"What did they leave behind?","id":"8kyxxa","url":"/r/nosleep/comments/8kyxxa/what_did_they_leave_behind/","time":"1526886336000","body":"<div class=\"md\"><p>It’s July 2017, my wife and I were about to have our second child when we bought our home. It’s a beautiful 3 bedroom 2 bath ranch house in an older subdivision right at the heart of our town. We never met the people that lived here before us. We ‘knew’ they had 2 kids, and that the husband was a pastor. The house was in pretty good shape, nothing major needed done before moving in. Life was pretty good. </p>\n\n<p>It all started a few weeks after we moved in. The noises in the middle of the night. We didn’t think much of it being a new to us house. We knew that it was going to make some noises that we weren’t used to. It was hard for me to hear all of these sounds being such a heavy sleeper. I mainly just listened to what to what my wife was telling me. She has always been a bit on the paranoid side about the paranormal.... </p>\n\n<p>For weeks my wife complained about an animal inside the wall, scratching at the wall on her side of the bed. I was either at work, or asleep and never heard it. I jokingly would tell her it’s a ghost. She got mad, and stopped bringing it up to me. </p>\n\n<p>A few weeks later we were sitting in the kitchen having a late diner when our son was in his bedroom (which lies on the other side of the kitchen wall) kicking the wall. I yell for him to stop and to go back to bed. The knocking continued, so I walk into the room telling him to stop while walking down the hall. When I get to his room I flick on the light and there he is fast asleep, legs under the blanket no where near the wall. Weird. At the time I knew it was weird but didn’t give it much thought. </p>\n\n<p>A few nights later my wife wakes me up almost panicking, telling me about the animal in the wall and to listen. I heard it. It didn’t sound like the little mouse she has once described it as. It sounded like someone was scraping a rake on the Brick siding of the house right on the other side of the wall where my wife’s head is. I banged on the wall, and it instantly stopped. My wife was terrified, and I was too. I tried to calm her down by saying it’s probably the tree on the edge of the house. We fall back asleep in silence, I wake up again to this same sound. This time, it’s directly above us. At this point my wife is in tears, so I jump up and turn the light on. As I walk back to the bed to comfort my wife it stops again. </p>\n\n<p>Awhile goes by with no sounds or noises. </p>\n\n<p>One weekend we were playing outside with our son. When the neighbors boy comes out with his mother and she introduced herself. She tells us it’s nice to he another couple move in. We asked if her son played with the old owners kids, and she shyly told us they used to play but she stopped letting them come over. I didn’t hesitate to ask why. She explained that 3 of the kids were around the same age as her 6 year old, but the oldest boy (the 4th) boy was quite a bit older and would scare her son by talking about the dad. I was surprised by the fact that they had 4 kids when they only had 2 beds. I asked what he would say? She said that the family seemed a bit off, that they were always nice to her kids, but they were members of the church of Satan. </p>\n\n<p>My jaw tightened when I heard that. </p>\n\n<p>Their older boy would tell her son about the devil, and how we lived with them. That under their house lives all sorts of demons, and monsters that would take the boy and his sister the first chance that they got. </p>\n\n<p>Weeks later my wife would text me at work telling me that our son was talking in his sleep about. Saying “wait” “no” “go” and other words in a very upset voice. When we woke up he would be crying and racing to our room. Then during the day he would often sit in his room and talk to himself. Which isn’t abnormal for a two year old to do. </p>\n\n<p>We didn’t really get freaked out until our son came into our room one night and told us that the ghosts “were gone”. That honestly made me a little worried. The next day I tried asking him about the ghosts, where he saw them, and he told me at his table. I asked who was it and he said my friend. </p>\n\n<p>I didn’t tell my wife, just like how I didn’t tell my wife that I thought I saw something standing by his bed before I woke him from his nightmare the night before. </p>\n\n<p>I’m hearing noises, and seeing figures.  </p>\n\n<p>Am I crazy? </p>\n\n<p>It’s 3am, I can hear my son whining in his sleep, and I have a clawing at my ceiling. It’s not loud, but there’s nothing up there. I’ve already checked. </p>\n</div>\n","author":"Thomas_Brummett"}