{"rank":"16","title":"Welcome to Flagstaff, AZ.","id":"8kzln6","url":"/r/nosleep/comments/8kzln6/welcome_to_flagstaff_az/","time":"1526895821000","body":"<div class=\"md\"><p>So my brother, my best friend and I visited Arizona during the winter to go hiking. On our route from the Grand Canyon to Phoenix we stopped at some random motel.</p>\n\n<p>Now usually I check out reviews for hotels before I book, but I was dead tired from driving for hours and my younger brother was under the weather, so my friend chose a cheap spot that was on the way to Phoenix.</p>\n\n<p>When we arrived there it was 1030Pm and I can’t say I was too thrilled at what I saw. An outdated motel , where each room is it’s own apartment set up.</p>\n\n<p>But, what the hell, it’s three guys and we’re only here for a few hours before the we hit the road first thing in the morning, so, whatever.</p>\n\n<p>We walked into our room and it was a pretty typical set up. A huge mirror next to the bathroom roughly 15 feet across the entrance with a large table next to the mirror. Two queen sized beds horizontal to the entrance, a tv on the left side of the room, and a drawer/small table directly across the TV with a phone/clock/bible/tv remote on top. </p>\n\n<p>One by one we started to get ready for bed, I was the first to get ready, so I turned on the TV and Remember The Titans was on. As I was watching, my brother had such a runny nose he kept throwing all of the extra used napkins on the ground. Disgusting, I know. So instead of risking getting sick I told my brother to sleep by himself on one of the beds while I shared with my best friend. When everyone got situated and ready to sleep, it was 11:30PM.</p>\n\n<p>As we started to doze off, exactly at 12AM the alarm clock began to shriek with a mixture of traditional alarm BEEPING and the radio. My brother and I woke up while my friend was in and out of sleep, I told my brother to unplug that damn alarm since trying to shut it off wasn’t working.</p>\n\n<p>“Stupid maid must’ve forgotten to restart the damn thing” is what I told my brother. I mean, makes sense, gotta think relationally here, right?</p>\n\n<p>Then we began to doze off once again. This time I was woken up to the TV on, a rerun of remember he titans. I yell at my brother, “why the fuck did you turn on the TV?!” He turned on the light between our beds, “I didn’t turn on the tv”  he said. At this point I see the fear in his face but I try calming him down.</p>\n\n<p>Even though the remote was on the table, and neither one of us could really rollover and “accidentally “ hit it on, I told my brother to think logically. Maybe the TV has an automatic timer, maybe someone in the room next to us turned on their tv and ours shares the same frequency?  Even though I was a little freaked out, i couldn’t let my younger brother be scared, big brothers don’t let that happen.</p>\n\n<p>As soon as I explained the plausible TV reasons to\nmy brother, I noticed my brother gazing at the ground for something,as if he had lost his wallet or\nSomething. He looked at my with a cold stare, “where are my napkins?” His napkins? “What napkins?” I asked.</p>\n\n<p>“The dirty napkins I kept throwing on the ground, they’re not their anymore...”</p>\n\n<p>The room was completely dark, my friend was still asleep, and it was freaking 12:45 in the morning! All of this creepy shit happening within such a small time period can NOT BE NORMAL!</p>\n\n<p>My brother and I frantically woke up my friend and got the hell out of that motel ASAP, if there’s one thing I learned from this experience it’s DON’T STAY IN SHADY MOTELS!</p>\n</div>\n","author":"Slamfan4life"}