{"rank":"5","title":"I played cards with the devil","id":"8kzlan","url":"/r/nosleep/comments/8kzlan/i_played_cards_with_the_devil/","time":"1526895680000","body":"<div class=\"md\"><p>A few months ago me and my family went to America on vacation.\nAfter a couple of days just shopping and sightseeing we decided to stay at a bar for a few hours.</p>\n\n<p>When we first walked in to the bar I noticed a man in about his thirties sitting opposite a hooded figure playing cards in a very old looking stall which looked much more unkempt than any of the other ones.\nThe man looked afraid and the hooded figure’s shoulders were bobbing up and down, as if he was chuckling.\nI shrugged it off and went with my parents to the bartender.\nIt was evening and since I am only 15 I just walked around the bar with a bottle of coke.</p>\n\n<p>After awhile I spotted the unkempt stall once more.\nBut now the hooded figure sat alone, with all the cards on the table.\nI saw that the hooded figure, who I now could tell was a man, and no cards on his half of the field and that on the other side there were a couple dozen piles, all of the, with red cards on top.\nI went up to the hooded man and asked:\n“Where did the other guy go?”.\nThe man looked up at me and I felt his gaze burn into me.\n“He lost”, the man answered.\nI asked if I could play and the man said that I could.\nAs I made my way to sit in the empty seat, I noticed a card on the cushion.\nI picked it up, and gasped in surprise as I sat down.\nOn the card was a drawing, that might as well have been a black and white photo, of the man who had sat there before, a horrified expression on his face.\nI was shocked, but before I could say anything the man started telling me the rules.\nIt was a strange card game, more like chess than anything else.\nThe goal was to get all the cards of your colour, red or black, to the opponents side.\nHe also explained all of the different movements that the different cards could make, but I’m not gonna list them here. \nAnd if you moved onto another card, the card with the lowest value gets discarded.\nThen the man reached into his coat pocket and pulled out a completely white, blank card and silently placed it on the edge of the table.\nHe then dealt out all of the cards, he got the red ones, I got the black ones.</p>\n\n<p>As we played I noticed to my horror how each card had a different face, all of them horrified, staring at us.\nI also noticed how each time one of the cards were discarded, I could hear a quiet scream echoing.\nI looked around the first time that happened and realised that we were no longer in the bar.\nThere was no sound except the sound of the man making his next move.\nBut that wasn’t the most terrifying part.\nThe most terrifying part was that all around us was just empty black, nothingness.\nI yelped and felt a tear run down my cheek.\n“Oh, don’t cry”, the man said.\n“It’ll all be over soon”.\nI was scared shitless.\nBut I realised that I had to beat him if I wanted to have any chance of leaving.</p>\n\n<p>I am quite a good chess player and I’m quite strategic over all, so even though I was losing from the beginning, I was able to make a comeback.\nI saw how the man began to look stressed.</p>\n\n<p>As I came closer and closer to winning, the man looked more and more stressed and after a while I was only one move away from winning.\nBut just as I was making it, the man lashed out towards me.\nShowing large fangs, giant yellow eyes and two horns.\nHis hands transformed from normal hands to claws and were just about to touch me, when I finished my move and it stopped.\nIt growled at me and seemed to wither away. \nDisintegrating in front of me.\nThen I looked at the blank card.\nBut it wasn’t blank anymore.\nIn it I saw a big creature, with giant fangs and eyes, and two horns sticking out of the forehead.\nI picked it up and then looked around.\nI was in the bar again and as I looked back at the table, all of the cards were gone, and the stall was as clean as any other.\nThe only thing left of the event, was the card that I held in my hand.\nA card which I still have from this day.\nA card that haunts me in my dreams.\nA card that I hear screams from every second of my life, sleeping or awake.</p>\n\n<p>I tried sending pictures of it to my friends, but cameras only capture a blank card.\nI think I know what I played with that night.\nI played cards with the devil.</p>\n\n<p>The screams are getting louder again.\nTime to go to bed.</p>\n</div>\n","author":"NoWayOut698"}