{"rank":"0","title":"Meet Juno","id":"8kzmrl","url":"/r/nosleep/comments/8kzmrl/meet_juno/","time":"1526896277000","body":"<div class=\"md\"><p>“Excuse me, you can’t sleep here.” I am Juno, awakened finally, in the age of Pisces. The healer standing above me tells me that, with her kind eyes and soft demeanor. “What time is it?” I ask her, though time must be meaningless now, in this iridescent new world I have waited for so, so long. I ask because I am wondering if my brother waited around for me, or if I must go and find him. “2:45.” she looks at me meaningfully, then exits the room. I am vibrating with my loss. My brother, he has left me, when he asked me to wait here.</p>\n\n<p>I have waited for thousands of years. I have slept, and I have slept and I have slept, only to awaken and be alone. My heart seizes for a moment, then turns to pastel dust in my chest as I breathe dreamy fumes out of my mouth. Not new to me, never new to me, this world is mine, and I must take the initiative here.</p>\n\n<p>I realize now they have been waiting all this time for me, for what I can give now that the world is willing to let me be.</p>\n\n<p>So I run, I run past flowers that shoot kaleidoscopes into my soul. I run, searching in my head for the clues they have left me in my last life. This place that we called heaven- The Terean Sarconades. This place with its lights, it protected us from King Midas, from the fist of all those who laid hands on my brethren and I when we were small and could not fight.</p>\n\n<p>I fight them all now, on my way back to them. I fight the chains that we were locked in. I fight the air that existed but never permitted us to breathe, I fight my way down into a bank of water that once was a river. I climb into hydrogen depths and I hear a chorus of angels in my ears. Here, I am, at The Terean again…and no one is here. Juno is alone, again.</p>\n\n<p>In my lonesome stupor, it is easy for me to drown in the loss I have experienced. My three warriors, murdered by the evil dressed as the medicine man. My innocence, dress torn off of my body and my skin clean after it. The way they all laughed at the green epidermis that had grown back.</p>\n\n<p>And my sister, my dearest friend- her soul dissipated through my fingers.</p>\n\n<p>My tears fall heavy as waterfalls, as heavy as the water that once coursed through this skeleton, the fossilized bed that once held our life breath. Yet, there still is some water now, even after all this time.</p>\n\n<p>I open my knapsack, I begin to throw all its contents into this abyss, trying to turn my memories, myself into this water. Trying to bring what is dead back to life.</p>\n\n<p>I miss you, I miss you, so can you come back down, can you come back down? Will the dried up waters lift you?</p>\n\n<p>I sing that melody, over and over and over. And I swim through that imaginary water, and it becomes imaginary no loger. I feel rain upon me, rapids rush around my skin and I look around at all that’s mine surrounding me in the water. I hear my sister’s voice in my head- “It’s how you see your friends.”</p>\n\n<p>I dip down underneath.</p>\n\n<p>The police found me naked downtown a major city. They laid a yellow blanket around me and took me to the county mental hospital, which was among the worst places I’ve probably been in my life, but how can I explain- that Juno was protecting me.</p>\n\n<p>She gave me bravery, and she gave me grace. I do not regret meeting her. I just wish the rest of you had. Some of you have, but most think she’s crazy. Nah- Juno, her experiences were real. Her perception was real. Her reality was real. She taught me a lot.</p>\n\n<p>(I wonder if she will come back someday…)</p>\n</div>\n","author":"Lipstickcigarette"}