{"rank":"23","title":"I don’t know what’s happening to me","id":"8kzysn","url":"/r/nosleep/comments/8kzysn/i_dont_know_whats_happening_to_me/","time":"1526900656000","body":"<div class=\"md\"><p>Right now, I’m a sweaty mess, I don’t know where I am, and I can only actually remember bits and pieces of the last month. I’m sitting at a bus stop and taking a minute to write this to y’all before I try to figure out where I am because I’m worried if I don’t figure this shit out soon, things aren’t going to end well for me. I need help. </p>\n\n<p>I guess I should start at the beginning, probably. A month ago, I moved into a new apartment and for nearly the full first week, everything was going great. Until I started hearing weird shit at night. The first night it was just gentle tapping on my window and I put it to bed in my mind as a tree branch, the second night it was the same noise but this time accompanied with a faint scratching. Like something trying to get through. Trying to get in. The night after that  I didn’t hear anything and I was able to put it out of my mind but the night after that the sound was inside my apartment. It sounded like it was coming from everywhere, closing in on me. Trying to get to me. And then blank. Like a whole, entire  three days are just gone after that. I woke up on my patio, covered in dirt. That day I checked my whole apartment top to bottom, got a new lock for the window and made sure I locked it. I locked every other window, too, and my door that night. </p>\n\n<p>For 9 days after that there was peace, except I still heard some strange things in the night. Some creaking, a drip every now and then. The only thing that couldn’t be explained as pipes, settling or something else banal was the squelching. Every night there was this terrifying squelch, crunch and squish. </p>\n\n<p>All I could ever think about when I heard it was something something being eaten alive. Walking through blood and breaking bones. . . I think I can still hear it. I tried to convince myself it wasn’t real but after everything, I couldn’t keep lying to myself. On the tenth day I go blank again, and I just came to in the middle of nowhere. At least nowhere I’ve ever been before. </p>\n\n<p>The only clue I have is a note I found that I don’t remember writing in my back pocket. I’m going to link a picture in the hopes that y’all can figure out something I didn’t, but I don’t have much hope. Reading the note, it isn’t that hard to decode. But I have no idea what I’m trying to warn myself about, or if there even is anything. I’m starting to think I might just be going nuts... please tell me you guys have some semblance of an idea of what’s going on, I need some kind of hope. I really don’t think I can keep going on like this. \nI’ll update you guys when I figure something out.\n<a href=\"https://imgur.com/gallery/JU3ZMuV\">the note</a></p>\n</div>\n","author":"dasphuckedup"}