{"rank":"2","title":"Demon Scars [Part 6]","id":"8l03vo","url":"/r/nosleep/comments/8l03vo/demon_scars_part_6/","time":"1526902275000","body":"<div class=\"md\"><p>Part 5 of 8: <a href=\"https://www.reddit.com/r/nosleep/comments/8kcave/demon_scars_part_5/\">https://www.reddit.com/r/nosleep/comments/8kcave/demon_scars_part_5/</a></p>\n\n<p>Mortal Kombat was released in arcades by Midway Games on October 8, 1992. </p>\n\n<p>It featured digitized graphics, blood, and unique finishing moves. </p>\n\n<p>While these &quot;fatalities&quot; were new to gaming, the arcade title, Pit Fighter, used digitized graphics which predated Mortal Kombat by two months. </p>\n\n<p>But unlike Mortal Kombat, Pit Fighter was a shit game which is probably why you&#39;ve never heard of it.</p>\n\n<p>When Midway was developing Mortal Kombat, they originally wanted to cast action star, Jean Claude Van Damme in a Bloodsport video game. </p>\n\n<p>Unable to get the Bloodsport license, Midway decided to create a new property that became Mortal Kombat. </p>\n\n<p>Early names such as Kumite and Dragon Attack, retained the martial arts tone of Bloodsport but were ultimately ditched for a horror/fantasy style. </p>\n\n<p>The Van Damme character was redesigned as Johnny Cage, whose moves include punching people in the testicles and uppercutting their heads clean off. </p>\n\n<p>Other ideas such as breaking blocks of wood during intermissions remained in the game. </p>\n\n<p>Shane told me that George Lucas originally wanted to make a Flash Gordon movie, but couldn&#39;t obtain the rights so he made Star Wars instead. </p>\n\n<p>Ironically, Jean Claude Van Damme starred in the Street Fighter (1994) movie a few years later which was pure garbage. </p>\n\n<p>I feel sorry for Raul Julia that this was his last movie. </p>\n\n<p>On a more bizarre note, they made an arcade game based on the Street Fighter movie called, Street Fighter: The Movie (1995). </p>\n\n<p>Many people will tell you that the 1993 Super Mario Bros. movie is the worst video game adaptation but I couldn&#39;t disagree more. </p>\n\n<p>The Mario games were so weird, abstract, and light on story that it would have been hard to make this into a live action movie in the 90s. </p>\n\n<p>The Mario games involved lots of turtle enemies such as Koopa Troopas and the Koopa kids. The idea to include turtles in the movie was scrapped in favor of dinosaurs. </p>\n\n<p>This was due to the decline of Ninja Turtles and the growing popularity of dinosaurs (Jurassic Park was released in theaters weeks later).</p>\n\n<p>Super Mario was the first game to be made into a movie so there was no standard at the time of what a game-based movie should be like. </p>\n\n<p>The casting, acting, and special effects were great in Super Mario, something that can&#39;t be said for the Van Damme Street Fighter movie. </p>\n\n<p>Also, there&#39;s a quick shot in Super Mario where you get to look down that woman&#39;s shirt which already makes it better than most other films. </p>\n\n<p>Nintendo apparently thought it was good too since they never made another movie, knowing they could never beat it.</p>\n\n<p>Speaking of game movies, Mortal Kombat released one in the summer of 1995. While it was definitely a hit in the box office, I was severely let down. </p>\n\n<p>The brutality and carnage that gamers loved was nowhere to be seen in this PG-13 debacle. \nEven if you simply wanted to play pocket pool to the Sonya Blade character, you&#39;d be disappointed there too. </p>\n\n<p>I strongly felt that that gay techno song used to promote the movie was an embarrassment to hard-core fans of the MK series. </p>\n\n<p>I was hoping that the Mortal Kombat movie would have been closer to the 1970&#39;s film, The Street Fighter (no relation to the video game or the 1994 movie) starring Sonny Chiba. But it was not.</p>\n\n<p>My favorite MK character was the yellow ninja Scorpion, since you could spam the spear move and pull your dazed opponent in for a devastating attack. </p>\n\n<p>His fatality move, while bloodless, was awesome nonetheless as Scorpion removed his hood to reveal his skull face and breath fire on his enemies, burning them to the bone. </p>\n\n<p>His counterparts, Sub-Zero and Reptile, were done as a color-swap so the game developers could save computer memory while adding characters.</p>\n\n<p>Mortal Kombat stood apart from its arcade rival, Street Fighter 2, with its abundance of extreme violence. </p>\n\n<p>The amount of controversy Mortal Kombat generated was immense. </p>\n\n<p>You have to remember that during the early 90s video games were targeted towards children and the Mario Bros. games were the standard for the time. </p>\n\n<p>Violent video games were quietly popping up in the 80s with titles such as Chiller (1986) and Splatterhouse (1988). </p>\n\n<p>However, games such as Mortal Kombat and Wolfenstein 3D (1992) carried a brash new attitude that showed the world that gamers were maturing and as a result, demanded relevant content. </p>\n\n<p>The US Congress held a hearing to address the amount of violence in video games. </p>\n\n<p>Game companies didn&#39;t want government involvement and responded with their own ratings board. </p>\n\n<p>Mortal Kombat was the first to receive a mature M-rating, which is similar to an R-rating at the theaters. </p>\n\n<p>Around this time it was also &quot;kool&quot; to spell everything with a &#39;k.&#39;</p>\n\n<p>Mortal Kombat was ported to Super Nintendo and Sega Genesis consoles and was released on September 13, 1993, a day known as &quot;Mortal Monday.&quot; </p>\n\n<p>These organized release dates were new to the industry as stores would sell their inventory whenever it arrived. </p>\n\n<p>In fact, it was Sega who created the concept of release dates with their flagship title, Sonic the Hedgehog 2. </p>\n\n<p>Sega of America, wanting to promote Sonic 2, employed a revolutionary marketing campaign.</p>\n\n<p>They ordered retailers to release Sonic 2 on &quot;Sonic Twosday&quot; Tuesday, November 24, 1992 (not to be confuse with &quot;Hedgehog Day&quot; February 2, 1994; the release date for Sonic the Hedgehog 3). </p>\n\n<p>Because of Sonic 2, it has been customary for video games to release on Tuesdays. \nAnother important thing to remember during this time is that Nintendo, Sega, and their respective fans locked horns in the legendary &quot;Console Wars.&quot; </p>\n\n<p>Shane, being a Nintendo fan-boy, said that the Genesis was a gaming system for white trash. But whatever. Fuck him.</p>\n\n<p>Mortal Kombat was at the center of this battle as the Sega Genesis version retained all the blood and gruesome fatalities. </p>\n\n<p>The Super Nintendo port was censored and had the blood completely removed as well as many of the finishing moves altered.   </p>\n\n<p>This was unfortunate since the Super Nintendo version featured superior graphics and sound compared to the Genesis. </p>\n\n<p>More evidence of this can be found in other Midway arcade ports such as NBA Jam and WWF WrestleMania: The Arcade Game. </p>\n\n<p>The Genesis&#39; sound chip wasn&#39;t much more advanced than Sega&#39;s last generation console, the Sega Master System. </p>\n\n<p>Hardware limitations aside, the gore-soaked Genesis port of Mortal Kombat was certainly a feather in the cap of Sega fans. </p>\n\n<p>Future Genesis titles such as Robocop Versus The Terminator (1994) and Eternal Champions (1993) continued to celebrate the tradition of extreme violence in gaming. </p>\n\n<p>However, when the Genesis version of Mortal Kombat outsold Nintendo&#39;s, the 1994 sequel, Mortal Kombat 2 was uncensored on both systems.</p>\n\n<p>Wolfenstein 3D on the Super Nintendo was also heavily censored. But I don’t feel like talking about that. </p>\n\n<p>Part 7 of 8: <a href=\"https://www.reddit.com/r/nosleep/comments/8m0wuw/demon_scars_part_7/\">https://www.reddit.com/r/nosleep/comments/8m0wuw/demon_scars_part_7/</a></p>\n</div>\n","author":"Rich_Brady"}