{"rank":"7","title":"I Don’t Know If They Could Help Me","id":"8l09o6","url":"/r/nosleep/comments/8l09o6/i_dont_know_if_they_could_help_me/","time":"1526904056000","body":"<div class=\"md\"><p>I am in grave danger right now, I might not be seeing signs of imminent danger surrounding me, but I know that it’s there. This is not nonsensical paranoia because I have been warned by those close to me, they swore that they would protect me, but I doubt it. </p>\n\n<p>I tried to make a series here in <a href=\"/r/nosleep\" rel=\"nofollow\">r/nosleep</a> entitled “This Guy Named Timmy”, but I didn’t have the time and the memory to recount almost every detail from the day we met to the time he began obsessing over me. </p>\n\n<p>This might be over exaggerating things, but it’s better to be safe than sorry. </p>\n\n<p>I am starting to regret as to why I didn’t take up martial arts or other sports to be fitter than I am right now because I wouldn’t have this trouble if I have had been active in the past few years. </p>\n\n<p>The guy named Timmy in my supposed series has known me all my life, he’s older than me, knows Taekwondo, and has all the possible connections to keep those around me away from me. </p>\n\n<p>Timmy, as though he may look like an anti-social scumbag, who is hostile to those who is against his religious beliefs, easily garners the trust of our parents. By our parents, I mean the parents of all the people in our circle. Almost all the parents of the people in our circle laid their trust on him because he is very articulate with his words when speaking to them, it’s as if he says EVERYTHING that they want to hear. </p>\n\n<p>“Oh don’t worry Ms. _<strong><em>, I will bring _</em></strong> home by nine.” And he will. </p>\n\n<p>“Mind if I help with the dishes?” And he’s great with it. </p>\n\n<p>“Mr. ____, not to boast, but I can mix some cocktails that you would surely like.” And he really is good at mixing up booze. </p>\n\n<p>He’s the perfect friend for a son and a perfect child in the eyes of every parent who would see him. </p>\n\n<p>He even gave me a kitten on my 13th birthday that disappeared the next day after he gave it to me. </p>\n\n<p>But we know what he really is. </p>\n\n<p>We know what goes on in that sick mind of his. </p>\n\n<p>He has street smarts, fit body, and great stamina. He’s stealthy, cunning, and sly. He’s good at hiding his emotions and manipulating those around him. He’s most certainly good at sabotaging each and everyone who would peak an interest on the person he loves. Who would peak interest...</p>\n\n<p>On me. </p>\n\n<p>There was one time when he told me stories, scary ones, because he knows it makes me uneasy and I tear up easily whenever I get too frightened. He would continue on telling stories until I break and he would hold me tightly and whisper, “I can make all of these scary things go away just for you.” And I would remember feeling more frightened than comfortable in his arms. </p>\n\n<p>He reeks ulterior motives. </p>\n\n<p>A lot of guys from my neighbourhood would confess to me in his presence (because it turns out that he would be the one to encourage them to do so) and the next day they would be seen either beaten up or confined in the hospital for mysterious reasons, often reduced to mistaken identity or gang fights. </p>\n\n<p>I didn’t know what he was truly capable of until now. </p>\n\n<p>This year marks the 16th year of his devotion to me. He has been in love with me ever since I was 2 and he was 5. He would often spread that he was the one who claimed my first kiss when I was 3, he would often hide on top of trees to spy on me and peek in my windows whenever I change or whenever I go to sleep. </p>\n\n<p>To this day he hasn’t given up. </p>\n\n<p>He is now a member of a gang that involves the local police in my neighbourhood and my friends would often tell me that there would be men surrounding my house in random periods of times, watching or recording. </p>\n\n<p>My friends swore that they would protect me. </p>\n\n<p>I once cried to them when they told me that Timmy has goons that once boasted to them how nice would it be to gang rape me. </p>\n\n<p>On my 14th birthday he left a box in my doorstep and when I opened it...</p>\n\n<p>When I opened it, it confirmed my faith. </p>\n\n<p>It confirmed what would happen if I get too close, if I let my guard down. </p>\n\n<p>I opened it and inside were letters, a pouch, printed pictures of me, pictures of anime characters, nail clippings...</p>\n\n<p>... five pieces of human teeth; his teeth. </p>\n\n<p>And the decaying foot of the missing kitten that I have been searching for a whole year until that day. </p>\n\n<p>And there was a note attached to the lid of the box. </p>\n\n<p>“Happy Birthday! I gave you these so that you could always bring with you a piece of me.”</p>\n</div>\n","author":"LotusLoves"}