{"rank":"1176","title":"This Is a Cry For Help","id":"8l0evk","url":"/r/nosleep/comments/8l0evk/this_is_a_cry_for_help/","time":"1526905518000","body":"<div class=\"md\"><p>So I’m not really sure what to do here. This isn’t even my account. We’re not allowed internet access.</p>\n\n<p>My name is Billy. I’m seventeen, and in high school. Well, it’s not really a high school. To be honest.</p>\n\n<p>My family and I live on a compound. My house, my friends, and my school are all on the property. Everything is owned by the company.</p>\n\n<p>I used to be one of the best students in my class. I memorized all the rules and dates. All my teachers liked me. I understood the importance of 1913. </p>\n\n<p>That changed for me about three months ago. I had to pee in the middle of the night, so I climbed off my bunk and walked down the hall with my eyes pointed to the ground. I never looked up, because I knew the rules better than anyone, and the rest of the kids were jealous.</p>\n\n<p>But I couldn’t help breaking the rules when I heard the scream.</p>\n\n<p>So I looked out the window and I saw Mr. Evnor, the science teacher, kneeling on the ground next to the police. I know that I’m supposed to avert my eyes when I see the police, but this time – I don’t know, I was just bad. And I didn’t.</p>\n\n<p>They were talking to him, and he was crying and begging. Eventually, he held out his left hand. It was shaking. </p>\n\n<p>I knew he chose the left one because he was right-handed. </p>\n\n<p>They tell us that the punishments are not cruel and unusual. But that’s the night I realized they’re lying. Because when they got out the hacksaw, it took <em>three</em> different policemen to hold Mr. Evnor in place before the Sawer could get to work. And Mr. Evnor <em>chose</em> his left hand, so why did he fight so hard against it?</p>\n\n<p>I really am glad that they gagged him. The screams would have been awful.</p>\n\n<p>I went to bed without peeing.</p>\n\n<p>The next day, Mr. Evnor had gray bags under his eyes and his arm in a sling. He didn’t talk about what happened. We were good students (I was the best student) so we knew not to ask. </p>\n\n<p>Since then, two things have been happening at once. </p>\n\n<p>The first is that I stopped believing in a lot of what they’re teaching us. The second is that I’ve realized I <em>have</em> to keep up the act. So I’ve kept being a really good student, following all the rules. Sometimes, I get frustrated, and it’s hard to follow the act. Especially when stupid Quentin tries to get people to like him, and it pisses me off. But it got a lot harder a few days ago. </p>\n\n<p>Mr. Toit is our Arrival teacher, which of course is our most important class. So I’m always the most enthusiastic to raise my hand. Like when he said, “What’s one of the best phrases to use when trying to infiltrate a home?” I was the first to say, “Excuse me sir, do you have a moment to talk about our lord and savior Jesus Christ?” He excitedly shouted “Yes, Billy!” and I remembered a time when that used to excite <em>me</em>, like I’d done a good job. </p>\n\n<p>That was the day Mr. Toit got a little too excited.</p>\n\n<p>You have to understand, the Captain is kind of a scary guy. He’s tall, thin, bald, and never smiles. He looks like the character from this painting we were told about called <em>American Gothic.</em> Anyway, I was called into the Chamber with the rest of my Arrival class, and the Captain was standing there with Mr. Toit all tied up. I got really scared at this, because the Captain wouldn’t be involved unless it was a really big deal.</p>\n\n<p>He looked around all stern at us before asking, “Class, what is the rule about the Internet?” And people were silent, because they were afraid, but then I realized that everyone would be expecting me talk. So I did. “The Internet is filled with pornography, politics and hate. Wise students only use books.” The Captain looked at me all serious, and said, “Very good, Billy.” Then he looked at Mr. Toit, and said, “Billy, your teacher has not been following the Rules. How then, can he teach? <a href=\"https://www.reddit.com/r/nosleep/comments/8in452/i_dare_you_to_believe_this/\">He advertised our Cause to the Internet</a> last week, despite the Rules. A man cannot teach if he cannot learn, Class. Am I right?” We shouted back immediately, because we knew the answer was “Always!” </p>\n\n<p>Then the Captain looked back at me, saying, “And a man cannot truly learn until he teaches! Come here, Billy!” And adrenaline started rushing through me, and I didn’t want him to touch me. More than anything in the world at that point, I did not want the Captain touch me. But I walked forward, and he reached out his hand. His finger was all long and trembly, with thin fingers and gross, long nails and these long, thin hairs dangling down from the knuckles. And he touched my elbow, and his fingers were like shaky clay, and I wanted to cry but I didn’t. </p>\n\n<p>The Captain looked over his round glasses, lifted his long, thin finger to the air, and quietly said, “There is a Better Way.” I didn’t have a choice. I lifted my index finger to the sky as well, and whispered, “The Time is Nigh.” He nodded.</p>\n\n<p>I’ve pretty much always been the best student, so I knew there was no point in trying to avoid the Method. Mr. Toit had transgressed. There was no other option. </p>\n\n<p>I got to my knees, and lowered my jaw. My teeth would have been chattering if my mouth had been closed. Mr. Toit’s eyes got real wide, but he was tied and gagged super tight. So he didn’t say anything or move anywhere. He couldn’t stop me.</p>\n\n<p><em>I</em> couldn’t stop me.</p>\n\n<p>Slowly, I lowered my mouth to his face. I could feel his whiskers trembling on my lips and tongue. He was panicking, and I didn’t blame him. I hated what I had to do. But it wasn’t my decision. What choice did I have?</p>\n\n<p>I bit. His moaning was loud, even through the gag. I had to bite <em>hard</em> before the skin finally broke. But when it did, blood filled up my mouth like I’d just burst a really juicy blueberry. I knew it would stain my shirt the same way, too. </p>\n\n<p>I closed down on the mouthful, making a crunching sound like lettuce when you snap it, then put my hands on the ground so that I would be strong enough to tear it away from his cheek. </p>\n\n<p>I pulled back. </p>\n\n<p>A string of torn-up skin flaps attached my mouth to Mr. Toit’s wrecked face. The poor guy was shaking like a lawnmower. He was still only making groaning noises, but I could read his eyes. I’d never seen that look before, but I understood immediately.</p>\n\n<p>He wanted to die.</p>\n\n<p>I understood, because in that moment, I wanted to die, too. His skin felt all rubbery and gross in my mouth, and I hated it.</p>\n\n<p>No one noticed me spit it to the ground when the rest of the Class suddenly rushed forward to finish the Method. </p>\n\n<p>I wanted to walk away – far away – once it was over. But before I could leave, I looked down in the pile of blood, teeth, and clothes, and I saw Mr. Toit’s cell phone.</p>\n\n<p>I don’t know why I did it. I had <em>just seen</em> what happens when an Internet violation is committed. But I snatched up the phone, and put it in my pocket. </p>\n\n<p>I was walking away when the Captain called out my name. Oh man, did I think I was going to die. </p>\n\n<p>I turned around, and he was standing right behind me. He stared at me for a second, then said, “You’ve got blood on your hands, Billy.” </p>\n\n<p>Now I’m seventeen, but I almost pooped my pants.</p>\n\n<p>Then the Captain grabbed my wrist, and looked down at my palm. It was covered in blood from where I’d picked up the cell phone. </p>\n\n<p>He slowly lifted my hand to his mouth, and very, very delicately, he sucked the fingertips of each one clean. I do not know why his tongue was so cold.</p>\n\n<p>He kept eye contact the whole time.</p>\n\n<p>I ran to the bathroom after that and threw up. </p>\n\n<p>I’m typing this right now in the stall. Since Mr. Toit thought this site was the best way to spread the message, I’m posting my story here. </p>\n\n<p>The Day of Reckoning will be in June. We’re preparing for it on the compound, but I don’t know where we are. The only thing I can say for sure is that it’s in the United States somewhere. Please, be ready for it.</p>\n\n<p>When I’m done with this message, I’m going to try and flush the phone. I hope it goes down the pipes. Because if they find out I stole it, the Captain will host another Feast. And if he does, I know that little bastard Quentin is going to try and get the First Bite. </p>\n\n<p>And I don’t think the body part he’ll choose will be <a href=\"https://www.facebook.com/P-F-McGrail-181784199029462/\">the face.</a></p>\n\n<p><a href=\"https://www.reddit.com/r/ByfelsDisciple/\">BD</a></p>\n</div>\n","author":"ByfelsDisciple"}