{"rank":"15","title":"My Bride to be","id":"8l0u1m","url":"/r/nosleep/comments/8l0u1m/my_bride_to_be/","time":"1526909558000","body":"<div class=\"md\"><p>You know when you find someone that takes your heart and makes it explode with jubilation and butterflies just from the first moment you see them? That was my bride to be. Her hair was the most amazing honey blonde, with skin as pure as a new fallen snow. Her smile radiates from every tooth, so white and immaculent, I can&#39;t help but just smile back like a weirdo. I almost couldn&#39;t contain myself when I mustered up the courage to get your name and almost melted hearing your sweet voice chime back: Amanda. </p>\n\n<p>I remember our first date. You ordered the chicken alfredo with a nice dark red wine. That&#39;s my favorite too. The way you laugh at every little joke, even the ones I know aren&#39;t all that funny. You have a special way of making me feel like the only person in the world. It&#39;s like everyone else in the restaurant disappeared and left us alone to talk about just us. Each second that passed assured me that you were the one I loved more than anything. Amanda, soon, I&#39;ll call you my bride to be.</p>\n\n<p>I remember our first time. After three successful dates, you showed me where you lived and most importantly where we were to sleep together. It was a momentous night. Our bodies syncing into a perfect rhythm, our breaths aligning to form one single cycle and your body, oh God your body, curved and arched in every seductive manner like a graceful ballet dancer surrounded by the orchestra of lust and love. It drives me crazy and I can&#39;t contain it anymore. Together we ended our coitus, your glistening body resting onto the bed with that pleased look on your face as you drift into dreamland. Even as I stand over you to drink in the scene one last time, I cant help but reiterate, soon you shall be my bride.</p>\n\n<p>The day has finally come, the day you become my bride! It was just this morning that I told you good morning with two sweet kisses as you laid amongst the scarlet sheets. All I could do was smile ear to ear as I retrieved your dress for you. White and pure, just like your skin. It took quite a bit but eventually it looked like the dress fit perfectly. I left to get myself dressed in the absolute best suit I could find, something perfect for my perfect bride. You must&#39;ve had too much wine as I left as when I returned you had gotten some of it&#39;s dark red color smeared onto the front of your dress. That&#39;s okay though, you&#39;re still just as lovely as ever. I took your hand in mine and walked you to the arch.</p>\n\n<p>I remember when the guests came. They came with plenty of lights and the cheering and excitement of the day. As I placed your new ring on your finger, the crowd erupted in praise and showered us in celebration of red and blue. As I looked down, I noticed even my heart had started celebrating right of my chest in an explosion of red confetti. A smile spread across my face as I turned to fall next to you. Your hand in mine, our eyes locked, everything being perfect as I peacefully drifted to sleep knowing no matter what, you were my bride to be forever...</p>\n</div>\n","author":"SavageGarp"}