{"rank":"24","title":"Time is Running Out","id":"8l174q","url":"/r/nosleep/comments/8l174q/time_is_running_out/","time":"1526912748000","body":"<div class=\"md\"><p>Ten minutes left.</p>\n\n<p>I scanned the desolate, hilly roads to my right and left anxiously in between glances at my phone. Springfield Mental Institution, though abandoned, was still lightly patrolled at night. None of us really knew why there was a gate outside the enormous property. Perhaps something had happened, or something was inside. Something the state didn&#39;t want people to unearth. The more likely explanation was the old, unsafe buildings, dead electric wires, and loads of tetnis. Regardless, the guards added to the place&#39;s mystique.</p>\n\n<p>In it&#39;s prime, the location was home to hundreds of patients. It was a live-in facility, and the doctors and nurses had lived right outside the hospital itself. Inside the gate. The place had been abandoned well over twenty years ago, but the houses were exactly the same. The floors were creaky, and some had caved in, but the garage still had kid&#39;s tricycles in it. There was still soap in the sinks, and clothing was still hanging in the closets. Untouched.</p>\n\n<p>Five of us had found a low lying tree branch that slipped over one of the side gates, and climbed our way over. We had heard scattered stories of paranormal activity coming from the Institution, and being the arrogant teenagers we were, we decided to check it out.</p>\n\n<p>The trip had, thus far, been fairly uneventful. We trekked through about a half mile of the surrounding forest to reach the main campus. Ben had nearly jumped out of his skin when a deer had run across our path, and we had all laughed like it hadn&#39;t frightened us either. To be honest, though nothing had happened, the entire area gave me the creeps. There was no light-- we had to use our cell phones to illuminate the path in front of us. Every five minutes or so, one of our phones would die, and I would hold my breath until the path was once again bathed in a bright blue aura. That light gave way to the shadows of the branches clipping our journey.</p>\n\n<p>Five minutes.</p>\n\n<p>I turned to James, who still had the same stupid grin plastered on his face. It had been his idea to dare Ben to stay in one of the doctor&#39;s houses for an hour. Ben was new to the group, anxious to fit in. After he lost his cool to the bushy tailed deer in the woods, James knew he would oblige the dare. None of us expected him to stay more than five minutes...</p>\n\n<p>Four minutes. 12:56.</p>\n\n<p>I flipped my phone shut. I&#39;d had enough, this was getting out of hand. Ben could have fallen somewhere, gotten seriously hurt, and he could be unable to reach us. I turned to my friends and told them I was going to get him. James laughed aloud, while the others backed up nervously.</p>\n\n<p>I pulled on the metallic door. It was thoroughly rusted, and took a little extra effort, but finally gave way. I stepped inside gingerly, careful not to put extra weight onto the old floorboards.</p>\n\n<p>I yelled loudly for Ben to come back outside. No response.</p>\n\n<p>The house had a musky smell to it, the type that comes from twenty years of rainwater seeping into wood. My options were simple; upstairs or downstairs. If the stairs caved going up, it&#39;d be a much steeper fall. I turned to the left, and descended carefully down the creaking staircase, holding my phone&#39;s light in front of me like a torch.</p>\n\n<p>When I reached the bottom, the musky smell intensified. It looked like the basement I was in had been a storage area of sorta. Old wooden chairs lined the walls, and cardboard boxes were stacked haphazardly around the center. I walked over to one and read the label.</p>\n\n<p>Patient Records - 1981</p>\n\n<p>I flipped open the unsealed top and glanced inside. There were piles of papers with names and dates, as well as some large words I didn&#39;t understand. What struck me as odd, however, was the red stain at the edge of the first paper.</p>\n\n<p>Blood.</p>\n\n<p>It wasn&#39;t dried, either. I ran my thumb across the mark and watched as the blood smeared across the page. Shit. Shit shit shit.</p>\n\n<p>I punched a number into my speed dial and tried to call the guys outside. I waited a few seconds.</p>\n\n<p>Nothing. I took my phone from my ear and looked at the screen, zero bars. I was underground.</p>\n\n<p>I looked around anxiously, and saw a door at the far corner of the room. I walked over to it, and nearly fell to the floor.</p>\n\n<p>Blood covered the handle.</p>\n\n<p>At this point, I feared for my friend. He had never wanted to come on this trip, never wanted to enter the house. He was pressured by James. None of this was his fault.</p>\n\n<p>I threw my shoulder into the door, unwilling to touch the bloody handle. It cracked and splintered open, revealing a long, dark hallway.</p>\n\n<p>I stepped inside, and screamed down the narrow corridor. My pace quickened.</p>\n\n<p>First a trot.</p>\n\n<p>Then a jog.</p>\n\n<p>Then a sprint. I couldn&#39;t help but notice the walls to my left and right as I sprinted down that corridor. Bloody handprints lined the cool, white cement walls.</p>\n\n<p>Cement, my addled brain relayed. That&#39;s odd.</p>\n\n<p>I ran for what seemed like an hour before I saw the end. As I got closer, I could make out a shape at the end of the corridor. I called out to it, screaming at the top of my lungs as I struggled to catch my breath.</p>\n\n<p>&quot;BEN. JESUS BEN GET THE FUCK OVER HERE.&quot;</p>\n\n<p>I fell to my knees about ten feet away from the figure at the end of the hallway. I lifted my head and allowed my eyes to focus as my ragged breath caught in my throat.</p>\n\n<p>Sitting in a wooden chair in a small, four by four alcove was Ben. He was covered in blood, his hair was matted to his face and his clothing was ripped and torn. I tried to choke out a few words as I desperately caught my breath.</p>\n\n<p>*&quot;What... are... you... doing?!&quot;</p>\n\n<p>His eyes remained locked on me. It was as if he had been watching me quietly the whole time I ran towards him. That gaze... it was as if nothing else existed in the room. His head remained perfectly still, and his eyes remained locked. His eyes never left mine as the smile locked into symmetry on his bloody face.</p>\n\n<p>And then the corners of his lips began to slowly creep upwards. He was smiling, but the process seemed unnatural. It was as if an unseen puppet master was pulling the strings of his marionette into place.</p>\n\n<p>Time to smile, puppet.</p>\n\n<p>He spoke, and his words sounded like teeth grinding against a chalkboard.</p>\n\n<p>&quot;It&#39;s 1 AM, Matt. We&#39;ve been waiting.&quot;</p>\n</div>\n","author":"iAmAware1"}