{"rank":"5","title":"How I Found Myself Myself","id":"8l1jy9","url":"/r/nosleep/comments/8l1jy9/how_i_found_myself_myself/","time":"1526915649000","body":"<div class=\"md\"><p>I think I live in a haunted dormitory. Actually, I&#39;d like to think I live in a haunted dormitory. Most of my dorm-mates would agree of this. You see, almost every place has its own paranormal issue: the dripping faucet, the wailing cabinet, the headdless roommate--we all like to think there&#39;s just some inexplicable tact to something we cannot find an explanation to.</p>\n\n<p>They say our dorm’s haunted by ghosts. Two of my nerdy dorm-mates claim to hear the gate opening and closing during 2am, although they couldn’t hear anyone coming in or out. The nurse would always complain of the lights flashing on and off. The landlady would always ask (harshly) which of us stole her spoons and forks. Most of the time, however, their fears were my work. The gate opening and closing was me being a ninja slipping a girl to my room, the stolen spoons and forks were also my arising need for camp utensils—while the lights, well, I believe the bulb’s just needed replacing.</p>\n\n<p>And then my things started to disappear. My books, shirts, shampoo, lotion, slippers—I know I’m an untidy person so initially I shrugged the problem off. Until my blue Vans went MIA. I ravaged the entire dormitory to search for the asshole who’s lame enough to steal my things and hide it under his bed. </p>\n\n<p>Of course I didn’t find him.</p>\n\n<p>I figured I could catch him if I pretended to go out, sneak back, and hide somewhere in my room. &quot;He’ll take something tonight,&quot; I told myself. So I did just that, and then hid myself in a juncture between the wall and my bed.</p>\n\n<p>Half an hour later (although it might have been ten years), the doorknob clucked and opened, and the eerie tell-tale sound of the hinges groaning began. I smiled—it was the landlady. Who else had the key to my room? The light was still off, but I figured the silhouette. It was that of a man. </p>\n\n<p>&quot;So, not my landlady. Who is this then?&quot;</p>\n\n<p>He never turned the light on, just moved around the room in silence, perhaps looking for another of my stuff to steal. I never gave him the chance: I stood up, shaky at first, then grabbed him by the hair. The man wrestled, but never turned around. I was screaming for help, cursing, and then I heard my other dorm-mates unsettling outside. The man I was grappling with made a choking sound—but I cannot explain how he got away from my grasp. I let go of him; in any case, my dorm-mates were just outside the door. They’d get him. The man ran out of my room, panting.</p>\n\n<p>I heard one of the nerds call out. “What happened, Reese?”</p>\n\n<p>More of my dorm-mates were coming out of their rooms and were joining the ones already outside the door. &quot;He must be panicking by now,&quot; I thought that time, savoring the battle in my room—he’s surrounded.</p>\n\n<p>Triumphant, I was about to cry out something but I felt my throat choke. I breathed deeply, trying to find my damnable vocal cords. No sound vibrated from my throat.</p>\n\n<p>Then I heard myself shout: “Help! Someone’s inside my room!”</p>\n\n<p>Funny. It sure was my voice. But it came from outside my room.</p>\n</div>\n","author":"AdvancedAccounting98"}