{"rank":"50","title":"Never Sail The Open Ocean Alone [Part Two]","id":"8l28bt","url":"/r/nosleep/comments/8l28bt/never_sail_the_open_ocean_alone_part_two/","time":"1526920948000","body":"<div class=\"md\"><p><a href=\"https://www.reddit.com/r/nosleep/comments/8ki470/never_sail_the_open_ocean_alone/\">Part One</a></p>\n\n<hr/>\n\n<p>Two days journey on the open ocean with zero water supplies. Two days implied that I would be able to navigate worth a damn. That I wouldn&#39;t hit any rough waters or bad storms. Two days was far from a fucking guarantee.</p>\n\n<p>Nonetheless, with <em>Pinnacle</em> in my wake at five A.M. that morning, I had exactly two days journey ahead of me, simply based on the distance and capabilities of my engine at full speed.</p>\n\n<p>I was guaranteed to get at least a little taste of true dehydration. That was if there weren&#39;t anymore hiccups. </p>\n\n<p>The first night and following morning were a combination of rapid driving and frantic searches of my inventory. The water was still calm, thankfully. While drifting through it I found a can of chicken noodle that had some broth inside, which was nothing more than a stubborn insistence from my mom on that last night. </p>\n\n<p>I was so sure I was going to die that I drank the entire can on the spot. </p>\n\n<p>For a long sad moment afterward, I stared at Sookie. She only had a few drops in her water bowl, but I was determined those final sips would be hers. </p>\n\n<p>And that was about it. A true testament to how stupidly unprepared I was for this journey. </p>\n\n<p>Everything else was dry, solid food. I don&#39;t know why it was that way, it was just the food I liked to eat. I never considered the possibility of losing my water bottles from the cuppoard on the floor of my cabin. On those hot hours at sea, I thought a lot about what could have been done to prevent that. Whether I should have listened to my mother only a couple nights before.</p>\n\n<p>At around five in the afternoon the following day, I had the bright idea to fish and catch a turtle, or something, and drink its blood. I had lures and fishing line and all of that equipment ready to go. I had read <em>Heart of the Sea</em>, and I knew the risks of catching a virus. Even on the first day without water, I was willing to accept that risk. Call that what you will.</p>\n\n<p>I did not bother to anchor. I was a day&#39;s trip closer to shore at that point, or so I thought. Sookie stayed on deck with me, and she seemed to be looking for the man in the water still. I was too. Every shape in the ocean seemed to be his hands, those nails, passing through the endless lazy waves to come for us next. </p>\n\n<p>But I knew Sookie was immune to those nightmares. She would growl and alert me if anything tried to approach our boat, simple as that. She did not have the brain power to compute whether he should be there or not. A man living on the open ocean. That was up to me. So I let her do her job, and I did mine. </p>\n\n<p>Within a half hour, I had a tug on my 18 pound fishing line. It was a lazy one - the fish had taken the bait and seemed to be swimming along like it were any other Sunday. I let the line run out out, and hopped into the fishing chair on top of <em>Devil</em> and buckled in. When the end of the line finally came, all of the ship lurched along with it.</p>\n\n<p><em>Fuck</em>.</p>\n\n<p>After the lurch, the weight of <em>Devil</em> must have been enough to jerk the mammoth fish in the opposite direction. My line suddenly became slack, and it appeared like the fish was moving to coming back in my direction. I reeled nervously to correct the imbalance. But in a couple of moments, there wasn&#39;t anymore inbalance.</p>\n\n<p>The fishing line stood very still, tight as rope. I tried to reel in more, but it was no use. It was like I hit a snag, somewhere a couple feet down, and there was absolutely no pulling it out at all. I tried all the tricks.</p>\n\n<p>After about five minutes of trying to free my line, I had another bright idea. Maybe if I reached down and tried to pull the line from the snag manually, it would break free. It was not until my face got closer to the water that I could see something slowly rising to the surface.</p>\n\n<p>As soon as the mouth was clear, I knew it was a White shark. I had never seen one as a kid, but I had read about them furiously.</p>\n\n<p>It&#39;s a common joke among fisherman that the fish was <em>THIS</em> big, but I still swear until I die that she was a twenty-footer. The size of each tooth was like a dinner plate, and I jumped back out of my skin, and cleared my hands just in time for the beast to actually breach the water and stare me down, with those cold dead eyes.</p>\n\n<p>My first reaction was to get Sookie in the cabin. A barking dog was no different than a barking seal to a White Shark.</p>\n\n<p>When I came back, the fish was circling the boat, with the hook still in its mouth. I cut the line immediately, freeing the shark from me at least but leaving it with two wounds that could clearly be deadly.</p>\n\n<p>Even free of the line, the massive beast continued to circle <em>Devil</em>. The massive hook, meant for tuna, dropped free when there was no more pressure from the line. But a pool of blood trailed the fish wherever it swam, lazily in circles around the boat.</p>\n\n<p>I felt bad for it. This shark belonged out here, not us. And yet here it was, with the remnants of mankind strapped to its back. The plastic cut a hole through it&#39;s fin, and the fish was sure to lose it if something wasn&#39;t done. Every time he surfaced, the bag echoed lazily in the wind.</p>\n\n<p>I grabbed a long wooden pole with a knife attached to the end, and dipped it near the water when the White swam by. The fish was interested in the pole, maybe thought it was food. But when it opened its jaws to take it in, I raised the pole over the fishes head. In one smooth motion, the end of the knife slipped into the plastic attached to the fin and pulled it free. The fish dipped into deeper waters and disappeared.</p>\n\n<p>When I went to sleep that night, it was raining.</p>\n\n<p>I was docked somewhere off the coast of Halifax, I was sure of that. One day&#39;s journey ahead of me. The morning after next I would be home, in my bed, ready to turn over the money to the sea mark people and say I was not ready for the job. Maybe there was a life in maintaining a charter boat.</p>\n\n<p>When it comes to rain at sea, you are the type of person who is either cut out for it or not. A lot of folks get sick because the tossing and turning of your boat is enough to actually toss and turn your stomach. Your entire equilibrium is unbalanced.</p>\n\n<p>Fortunately, I was used to it. Welcomed it even.  The soft raindrops of water and the steady rocking of ways was like a lullaby. Minutes after my head hit the pillow, I was out.</p>\n\n<p>When I woke up, it was to footsteps.</p>\n\n<p>They were heavy. Sookie stirred around the same time I did, and her low growl kicked in as she bared her teeth in anger. She was at the foot of my bed, ready to protect me from whatever was outside without even a consideration of her own life.</p>\n\n<p>I had my gun under my blanket. I kept it steady aimed at the door.</p>\n\n<p>It opened, slowly. The knob twisted this way and that, clumsily, before the hinges squeaked their ringing disapproval. The face of the man appeared, peaking around the corner like a goblin. He was soaking wet, waterlogged as always, but the seaweed had started to slip from his face. I saw features, cold dark hair and wrinkled cheeks and eyelids. Blue eyes, like mine. He considered me a moment, considered Sookie who yipped and howled from the foot of my bed. Then he stepped forward.</p>\n\n<p>In a flash, Sookie lept from the bed with her teeth bared. </p>\n\n<p>The man brushed her aside lazily. Like it wasn&#39;t even an effort to move an eighty pound German Shepherd. Sookie flew against the wall, yelping from the impact and limped away silently, eyeing the man before she dipped under the bed to hide.</p>\n\n<p>&quot;Now that that&#39;s out of the way,&quot; he said in a voice that croaked like a frog.</p>\n\n<p>In a moment he was on the bed. His hot breath was inches from my face. I squirmed recklessly, but he pinned my shoulders with the palms of his long nailed hands and spoke.</p>\n\n<p>&quot;Please take me home, I am lost. No one dies out here. Take me home. Take me home.&quot;</p>\n\n<p><strong>&quot;Take me home!&quot;</strong></p>\n\n<p>I remembered the gun under the blanket and pulled the trigger. The bullet soared through the blanket, into the Man&#39;s chest, and out into the sea.</p>\n\n<p>It was enough to loosen his grip. I pushed forward, leaning on my aching knees as I fired a second shot in his chest, and a third. By the fourth, I leaned up and aimed for the head, but I missed. The Man was terrified by this, and he yelped backwards in pain and went out the door of the deck. I followed him, putting two more bullets in his back before he fell into the open water and tried to swim away. I fired into the water after him.</p>\n\n<p>&quot;Please... just want to go home. Just want Chicken and Pasta. We never die, no we never die...&quot;</p>\n\n<p>His voice trailed off, and he let out a blood curdling scream before his head dipper under water. Something pulled him, and he resurfaced a moment later. </p>\n\n<p>&quot;Please take me home. Take my body. To my mom. Please. Take me hom-&quot;</p>\n\n<p>In a moment it was clear what was pulling him. A massive white shark with a nearly detached fin pulled the man&#39;s legs, dragging him deeper under as the man surfaced regularly for gasping screams. The scene was a horror - the shark had each of the man&#39;s legs detached in his mouth, and choked them before before he moved onto the hands, the nails, and the torso. In a moment, only the man&#39;s head lay in the water, with wide blue eyes of mold shock. Soon the shark took that too, popping it in his mouth like a jolly rancher before he dipped down in the deep, right from where he came.</p>\n\n<p>When it was over, I hit the gas. I drove all day and night, never stopping or stalling or looking behind me. My lips were like paper and Sookie cried the whole time but we both knew we had to keep moving. Early the following morning, I reached my port in Jersey. I called my mom, returned the money, and went to bed. </p>\n\n<p>I have never told a soul this story, and I never will <a href=\"https://www.reddit.com/r/MattRichardsen/\">again.</a></p>\n</div>\n","author":"FirstBreath1"}