{"rank":"6","title":"There is no such thing as luck.","id":"8l2crd","url":"/r/nosleep/comments/8l2crd/there_is_no_such_thing_as_luck/","time":"1526921866000","body":"<div class=\"md\"><p>When you were a kid and your grandparents told you that you have a guardian angel looking out for you, they weren’t lying. They may not have known exactly how true their statement was, but I can confirm that they were telling the truth. We do, in fact, all have a guardian angel looking over our shoulders. What no one ever told you, however, was that not all guardian angels are created equal. Some are strong and powerful; they will protect their charge with a fierce might that can rarely be bested. On the other hand, some are weak; they are constantly defeated and fail to protect their charge from the evils of the world. For the most part, though, our guardian angels fall somewhere in the middle; they win some battles and lose others. </p>\n\n<p>At this point you might be asking yourself why this would be important, and that would be a fair question. This is important because there is something else that your grandparents didn’t tell you. While each of us has a guardian angel, we each have a demon on our back as well. Just like the guardian angels come in various shapes and sizes, so do our demons. This battle between demons and angels is what we mere mortals typically refer to as luck. We think of high powered individuals, like Bill Gates, as lucky. In reality, Mr. Gates likely has a strong guardian angel with a weak demon to contend with. So, what I am telling you is important because there really is no such thing as luck. Your fate comes down to the guardian angel that has been assigned to protect you from your demon. </p>\n\n<p>I’m here to warn you. There are wars being waged all around us. Between the demons who whisper in our ears to steal that candy bar or to drive our car into the bumper of the one in front of us and the angels that hope to protect us. Don’t pretend you’ve never had that urge. The urge to just hit the accelerator and force your way through the rush hour traffic, or that urge to just drive away from the drive thru without paying. This urge exists within all of us because our demon wills it. That demon on your back is constantly whispering evil in our ears. The proof is all around us. It’s on the news when some average, normal guy loses his mind and goes on a shooting spree. His neighbors say he was always a quiet guy. “He always smiled and waved when he got his paper in the morning, but he mostly kept to himself”. It’s like a scripted response at this point. Then the criminal will say it was the voices. The man in his head told him to do it. The mistake we make is not believing him. We never believe that his actions are the result of the voices in his head. That’s because no one else knows that the man had a guardian angel who failed him. A guardian angel that was not strong enough to fight off the demon on his back. </p>\n\n<p>I’ve had my gift since I was a young boy. No one believed me when I would tell them that I could see these angels and demons fighting. At first, I tried to warn others around me about what I saw. I tried to encourage people to ignore their demons and listen to the angels on their shoulders. But no one would believe me. After years of therapy I finally gave up trying to share my gift with the world. After years of being beaten down I finally stopped trying to help others with my gift. If people don’t want to listen to me, then maybe they deserve to have their demon win. </p>\n\n<p>The voice in my head keeps telling me to stop sharing my secrets. It tells me to stop telling others when bad things are about to happen. That voice has become louder in the past few months. I worry that my guardian angel is growing tired of the fight, and I worry that someday soon my demon will win. </p>\n</div>\n","author":"thewatchers10"}