{"rank":"5","title":"The Medium - Part 4","id":"8l2mk6","url":"/r/nosleep/comments/8l2mk6/the_medium_part_4/","time":"1526923871000","body":"<div class=\"md\"><p>Part1: <a href=\"https://www.reddit.com/r/nosleep/comments/8jvyc1/the_medium_part_1/?utm_content=title&amp;utm_medium=user&amp;utm_source=reddit&amp;utm_name=frontpage\">https://www.reddit.com/r/nosleep/comments/8jvyc1/the_medium_part_1/?utm_content=title&amp;utm_medium=user&amp;utm_source=reddit&amp;utm_name=frontpage</a></p>\n\n<p>Part 2: <a href=\"https://new.reddit.com/r/nosleep/comments/8k5bcd/the_medium_part_2/\">https://new.reddit.com/r/nosleep/comments/8k5bcd/the_medium_part_2/</a></p>\n\n<p>Part 3: <a href=\"https://www.reddit.com/r/nosleep/comments/8kenmj/the_medium_part_3/\">https://www.reddit.com/r/nosleep/comments/8kenmj/the_medium_part_3/</a></p>\n\n<p>You don’t have to believe me, but most con-artists can spot another con-artist.</p>\n\n<p>Looking  up and down the train station tracks, this chick says, “Sit here. Keep  an eye out for Security. If anyone asks, tell them we’re with a local  non-profit—we’re just trying to keep our community clean, okay?” and  slipping on some shades she says, “By the way, the name’s Mila.”</p>\n\n<p>For  the past few hours, off and on, Mila has been dead. Then alive. Then  dead again. This is the longest amount of time I’ve spent with anyone  since these “visions” started. Actually, this is the longest I’ve spent  with anyone over the past few years. In one moment, she’s a glowing  twenty-something, only a few years younger than me. She’s one of those  girls you can see backpacking alone through a market square in some  third world country. Or reading a paper-back on the patio of some  hostile. Or smoking cigarettes behind the gym in her high school years.  In the next moment, she’s a tragedy. Sitting at my parlor table, she’ll  go to scratch her scalp and you can’t help but gag when her fingers come  away sprinkled with bloody skull fragments. The vision comes and goes,  but half the time I’ve known this girl, she’s been a gunshot victim.</p>\n\n<p>When  I ask her how she knows someone’s trying to kill her, she says, “I  guess you could say I’m a little psychic,” and looking around my  establishment, “But, you know. A real one. That’s how I knew I was  supposed to find you—for answers.”</p>\n\n<p>To which I say, “Bullshit.”</p>\n\n<p>When she asks me how <em>I</em> know someone’s trying to kill her, I say, “I can see how people are going to die.”</p>\n\n<p>She says, “Neat.” Never bothers asking what I see looking at <em>her</em>.</p>\n\n<p>Back  to the train station, Mila’s bending over to pick up used, discarded  phone-cards, the ones you need to pay for expensive international calls.  Bright greens and reds and yellows and oranges—all these square bits of  plastic, she’s getting them from beneath pay phones and benches. From a  purse she pulls out a small spray bottle and polishes each one on the  seat of her pants, making them look shiny and new.</p>\n\n<p>With  abilities like ours—her being psychic, and me being an  I-don’t-know-what—you’d understand how we’d both want empirical  evidence. Proof. For both of us, scams are bread and butter, so you’ll  forgive our cynicism. For Mila, proving my claims was easy enough.</p>\n\n<p>Shortly  after meeting me, this dead-but-not-yet chick leaves, runs into the pet  shop down the block and comes back. She puts something furry and  quivering down on my table.</p>\n\n<p>“What is that?”</p>\n\n<p>“It’s a mouse,” she says.</p>\n\n<p>“But why?”</p>\n\n<p>“Shut up and do your thing.” Digging around in her purse, she says, “Tell me how it dies.”</p>\n\n<p>“I really don’t think it works on—“</p>\n\n<p>“Just do it.”</p>\n\n<p>Half  of my adult career, people have spent money to hear me speak, hanging  on my every word. Thirty minutes with this chick, and she rarely lets me  finish a sentence.</p>\n\n<p>Focusing on that  little rodent, with it running around the surface of the table,  desperate to get away, I can feel the hair on my neck stand up. My teeth  are on edge. I say, “Crushed. It dies all crushed. Like it was stepped  on or--”</p>\n\n<p>And fucking—<em>wham!</em></p>\n\n<p>From  her purse, Mila swings a hammer down full force turning her new house  pet into paste. On the table I spent hours and hours laminating myself.  In the back of my mind I hear, <em>this is why we can’t have nice things.</em></p>\n\n<p>For  minutes, Mila and me, we’re just starting down at the mess in silence  trying to figure out the implications, whether this proves anything at  all.</p>\n\n<p>“I think,” she says, “we’re good here.”</p>\n\n<p>She’s gotten mouse blood and mouse shit all over my tarot cards.</p>\n\n<p>“But maybe I should get another one to make sure.”</p>\n\n<p>Much  later, as people are stepping off the train, Mila is fanning herself  with the used cards she’s found. In Spanish, she’s saying, “Mantente en  contacto con tus sere queridos.” In Spanish, she says, “Llamadas  internacionales baratas. Solo diez dolares americanos.” And believe it  or not, she’s selling those useless cards off like hot cakes.</p>\n\n<p>After,  with her smacking gum and stuffing folded wads of cash into her socks, I  ask, “So what happens when they go to call their families and figure  out they’ve been cheated?”</p>\n\n<p>“That’s why,” she says, “I only sell to illegal immigrants. They won’t go to the police and risk deportation over a ten dollar scam.”</p>\n\n<p>“How could you possibly know they’re all—“</p>\n\n<p>“Like I said. A little psychic.” And she winks.</p>\n\n<p>Again, like the mouse thing, I’m not entirely sure this proves anything.</p>\n\n<p>“But you won&#39;t start believing me until you&#39;re in love.”</p>\n\n<p>You don’t have to believe me, but a con-artist knows when they’re being conned.</p>\n\n<p>From  the train station, we walk our way back to my parlor. Most of this walk  is silent, me dressed in broad day light like Gandalf the Grey’s  college-dropout nephew. I’m sweating in my robes. The henna on my hands  is starting to fade. Next to me, Mila is leaving a trail of blood and  cranial fluid.</p>\n\n<p>She says, “So, what do we do now?”</p>\n\n<p>The real psychic asking the fake psychic what’s next.</p>\n\n<p>I  say, “Well, we should probably make efforts to keep you safe. Maybe  disrupt your usual routine, switch it up. Maybe if we change up the  situation enough, it’ll prevent…” <em>That gaping blood-faucet on the side of your skull.</em></p>\n\n<p>“But how do you know any actions we take won’t lead us right into future we’re trying to stop?”</p>\n\n<p>All I can do is shrug.</p>\n\n<p>“I’m not completely unprepared.” Again, her purse is out, that amazing bag of tricks. This time, she pulls out a handgun.</p>\n\n<p>I tell her that strong supernatural forces are warning me, we should avoid projectiles weapons.</p>\n\n<p>“Whoever  is destined to kill me will have to eat one before the job is done.  Believe me.” As she says this, she’s waving the gun around on a city  sidewalk around one in the afternoon. To anyone else, I’m sure it looks  like a sorority girl sticking up your average street-side shaman.  “Besides,” she says, “you’re a phony. What do you know?”</p>\n\n<p>All I can do is smile.</p>\n\n<p>Back  in the parlor, I’m scrubbing up the splatter of mouse remains. Mila is  digging dirt out of her nails with one of my ceremonial daggers. Without  looking up she says, “You know, the killer probably knows where I  live.” She says, “I should probably stay at your place.”</p>\n\n<p>Next  time you feel like you’re having a weird day, imagine getting an  erection while using scotch-brite to polish blood and fecal matter out  of a wooden chair.</p>\n\n<p>“I mean, it’s not as if you live with anyone. I won’t be <em>disrupting</em> anything.”</p>\n\n<p>The  trick is, you want to scrub hard enough to remove any dried-on elements  without being so abrasive that it chips away at the varnish.</p>\n\n<p>Holding  up a crisply folded pair of bills, some of her train station earnings,  she says, “I’ll pay for the condoms. I’m sensing that you’re out.”</p>\n\n<p>Coincidentally, the aroma in my parlor—the incense of the day, is called <em>Sex on the Beach</em>.</p>\n\n<p>“The good news is, with the whole death thing looming overhead, you’re not gonna have to worry about getting me pregnant.”</p>\n\n<p>That’s our Mila. Romantic to the bone.</p>\n\n<p>Smiling she says, “Unless your concern is venereal diseases. That shit would stick with you long after I&#39;m gone.”</p>\n\n<p>It’s  at this moment that I realize exactly how much trouble I’m in. Because  now, when she tells me she’s psychic, I’m starting to believe.</p>\n\n<p>And according to her, this is love.</p>\n\n<p>More to come.</p>\n</div>\n","author":"DRP22"}