{"rank":"491","title":"I work at a dead mall...","id":"8l2tjl","url":"/r/nosleep/comments/8l2tjl/i_work_at_a_dead_mall/","time":"1526925316000","body":"<div class=\"md\"><p>Okay, so last year my parents split-up right after I graduated high school. My dad left my mom for an old co-worker he’d fallen for, leaving just my mom, me, and our condo we’d lived in my whole life… which was a few too many memories for my mom. She wanted a fresh start, and right around the same time, she was up for (and got!) a promotion at her bank job… which called for a relocation to bumblefuck, Iowa (I won’t say the real name here for anonymity’s sake). </p>\n\n<p>I’ve been thinking about starting school in fashion merchandising for a while, but all the best schools are out in New York, but that’s a lot of money that I definitely don’t have… and I didn’t want to leave my mom all alone after my dad being a jagoff. I’m an only child, and my mom and I have always been a team. Plus, I hadn’t actually applied anywhere, so I didn’t really have anything to lose (besides a bedroom if I didn’t follow her).</p>\n\n<p>I grew up in one of the bigger cities in the US… and part of the reason I want to go to school in New York is because it’s the biggest city. This is definitely not the case in Iowa, I don’t think there’s a city (if you can even call it that) with more than 200,000 people in it. Bumblefuck itself is next to empty… nothing but a handful of houses, a church, and a tavern. My mom works at the bank headquarters a few miles away. Not being anywhere near a community college, I opted for the next best thing— getting a job at the local dead mall.</p>\n\n<p>My mom and I always joke that Bumblefuck is stuck in 2003— all the buildings look like they haven’t been updated in years, they still have “got milk?” ads lying around, people don’t even talk like I do. I try and say “gucci” or “yolo” or “mood” and I just get these blank stares… I always chalk it up to me being ahead of the trend in one of the major cities, and it just not getting around to smaller towns.  But there’s no better example of this than the local shopping mall. It’s got those old crane games with stuffed animals of Powerpuff Girls and Courage the Cowardly Dog, massage chairs that vibrate too hard, people wearing old Family Guy and My Chemical Romance shirts and lots of empty, long-abandoned stores with metal bars over them. </p>\n\n<p>Actually, this was why I was so excited when I found out that this mall had a Deb— a cheap plus-size clothing store. I’ve always been a little on the heavier side, and my mom would always stick me in these old lady clothes from JC Penney. She always thought Deb was trashy… and she wasn’t wrong, but they always had clothes that were super cute, cheap, and would fit me. I was so sad when they closed the ones back home a few years ago. Not in Iowa, apparently!</p>\n\n<p>Although, I’m apparently the only one who cares. This mall is literally dead. I don’t think I see more than 30 people walk by our store a day… and of those 30, only 2 actually come in. Also, it’s always the same people walking around. There’s usually a mom with her two kids, a few groups of teenagers, and usually several old people doing their daily “mall walk” (that’s how old people work out here— walking around the mall. It’s too cold outside for them, I guess.). It’s a little strange seeing the same people every day (or seeing the lack of people every day), but I just work weekdays, so I figure that most people are at work.</p>\n\n<p>I like the people I work with… my boss, Miranda, and my co-worker, Brittney. Every day, just the three of us. Miranda hasn’t asked me to work a closing shift yet, and I’ve been working here for a while, but I’m certainly not complaining. It’s nice to be able to make my mom dinner every night before she gets home from work. They’re really nice, but kind of boring. First of all, they wear the same outfits every day… which is weird, considering we don’t have a uniform. I guess they just don’t like to get their non-work clothes dirty? Also, literally every day, Miranda barks at us “those panties aren’t going to fold themselves, ladies!”. Then, Brittney and I roll our eyes and get to folding, and inevitably, she always says something along the lines of: “Ugh. Isn’t she so annoying? I HATE folding panties!” and then I laugh and agree with her. I mean, she’s not wrong… folding panties is a real pain in the ass. </p>\n\n<p>I like Brittney. She’s bubbly and sweet… and the only person I’ve met here who is close to my age, and isn’t a total hick. I feel bad for her though, she’s always there with Miranda every day after I leave, and whenever I ask her when she’s going to go home that day, she just kind of brushes it off? She never actually answers me. It’s kind of weird. I mean, if Miranda is going to keep her there so long every day (I work 11-5, and she’s always there both before and after I leave), she may as well promote her to an assistant manager? Brittney complains to me about it sometimes, actually. She’s been working at Deb since she was 16… she started in 2003. She’s 30 now. You’d think they’d at least promote her to an assistant manager or something by now. Don’t worry, I’m not working there for a career, this is just what I’m doing while I figure out what’s next. </p>\n\n<p>I usually pack my lunch every day. Our food court is never open… I think they must be renovating it or something. Every time I go over there, all I see is scattered chairs, and old, abandoned-looking White Tower Hamburgers, Chooks, and Bajio. Nobody’s ever around there, either… it’s kind of creepy. But I don’t mind, I don’t need to spend my money on junk food, any way. I usually just eat in the backroom of our store… being on your feet all day makes a gal tired! Plus, a lot of the other stores are usually empty, and I don’t like salespeople bothering me when I shop.</p>\n\n<p>Anyway, I was getting ready to go on my break earlier, when I realized I left my lunch at home. Lucky for me, my mom usually goes home for lunch on her break, so I called her and asked her to bring it to me. She’s never actually been to my work, or even the mall before, so I thought it’d be fun to show her… but then she called me.</p>\n\n<p>“Hey mom, aren’t you going to come inside?”</p>\n\n<p>“I was going to, honey, but I don’t think I’m in the right place. You told me [insert name here] mall?”</p>\n\n<p>“Yep, that’s the one! Come by the south entrance, by the Dahl’s Foods?”</p>\n\n<p>“Leah, where are you, exactly?”</p>\n\n<p>“I’m in the back of Deb, mom. I just got on break.”</p>\n\n<p>“Honey, I looked up [insert name here] mall on Google to get directions, and when I got here, I thought I must be mistaken, so I went back to Google… and then I found an article that Dahl’s Foods had a fire in 2003.”</p>\n\n<p>“What? Nobody here has ever told me about that…”</p>\n\n<p>“Apparently about 30 customers died, as well as all mall employees. I don’t get it, Leah, this is where you’ve been coming every day? There’s nothing here but abandoned buildings.”</p>\n\n<p>“That’s not… that’s not true, mom. I work here at Deb, with Brittney and Miranda.”</p>\n\n<p>“Leah, honey, come outside and get in the car. I think we need to have a talk.”</p>\n\n<p>I was sufficiently creeped out at this point, so I ran outside, without telling Miranda and Brittney I was leaving. There’s just so many things that don’t line up here, guys. I mean… the same customers, completely abandoned stores, my co-workers literally dress the same and say the same things every day… it’s like I’m stuck in a time warp or something… but I know that’s just silly. I’m from a big city, so everything here just seems boring and weird to me.</p>\n\n<p>My mom thinks I’m crazy. She keeps asking me why I go to an abandoned mall every day to “hang out”… she thinks it’s my way of reacting to my dad leaving her. But I don’t think that’s true either? Anyway, Thanks for listening, I didn’t really know who else to talk to about this... I don’t know guys, I’m just so confused. Advice? </p>\n</div>\n","author":"madametallulah"}