{"rank":"19","title":"Down By the Creek (Part 2)","id":"8l3047","url":"/r/nosleep/comments/8l3047/down_by_the_creek_part_2/","time":"1526926658000","body":"<div class=\"md\"><p>When I turned 26, my lifestyle changed completely. </p>\n\n<p>It all started on the night of March 5, 2021. I was lying in my bed and I noticed that the eye in my chest was blinking more than usual. </p>\n\n<p>The spot was shifting across my skin all the time and I wasn’t able to sleep. The spot had engulfed my body from the head down. Patients laughed at me whenever I came out to do therapy groups. My psychiatrist, Dr. Barns, questioned me about the spot, but I never answered him. In fact, I never talked to him. I was pissed off about the whole situation. </p>\n\n<p>I got up and started to pace around the room. Why was the monster acting up? </p>\n\n<p>I lifted up my shirt and looked at the eye. It blinked again. “Shut up.” I muttered to the eye. </p>\n\n<p>I turned on the light in my room. I knew the guards would be mad at me for turning it on, but I didn’t care, I needed to look at myself real quick. </p>\n\n<p>I looked at the mirror and saw a 26-year-old monster. Shoulder length black hair (the spot discolored my hair), freckle splattered face (with acne), and piercing black eyes (the spot discolored the eyes too). It looked like someone had painted me with pitch-black paint. The black hair didn’t really stand out, same with my eyes. Black goop covered my whole face. </p>\n\n<p>The black goop was sticky too. Every time I touched it, it stuck to me then came off. It was annoying as hell. </p>\n\n<p>The scratching noises in the night never stopped. </p>\n\n<p>It was almost as if I was going insane. </p>\n\n<p>Was I going insane? </p>\n\n<p>Before the guards could shout at me, I turned off the light, and went over to my bed. I knew it was going to be a sleepless night. </p>\n\n<p>There wasn’t a clock in my room, but I assumed it was midnight. </p>\n\n<p>I could faintly hear the crickets chirping outside. </p>\n\n<p>I missed Memphis, Tennessee. </p>\n\n<p>The mental institution I lived in was located near Roanoke, Virginia. </p>\n\n<p>I lied down in my bed again and tried to get some rest. </p>\n\n<p>Then, the weirdest thing ever happened. Something that had never happened to me before. The eye started to blink rapidly, and the spot started to shift all over me. I remember feeling sharp pains all over my body and my head started to jerk back and forth. My eyes rolled back into my head, and then I passed out. </p>\n\n<p>My first thought when I woke up was, &quot;What the hell just happened.&quot; </p>\n\n<p>Bright sunlight made my eyelids glow orange. I opened my eyes, and piercing sunlight blinded my vision. I put my hand in front of my face to block out the sun. I was lying on my side, and that’s when I realized something. #1: I didn’t have any clothes on. #2: I wasn’t in the mental institution anymore. </p>\n\n<p>A cold breeze made goosebumps form on my skin. I looked around me and realized that I was under a bridge. I was on the corner edge of the bridge, almost in broad daylight. </p>\n\n<p>I stood up and immediately covered my body. I needed to find clothing. That’s when I noticed something else. My skin wasn’t black anymore! The spot wasn’t on me anymore! </p>\n\n<p>&quot;Yes!&quot; I shouted, and it echoed through the bridge. I walked out from under the bridge and looked to the left. I could see the Roanoke Memorial Hospital. </p>\n\n<p>&quot;Damn.&quot; I muttered. How long had I traveled, and why don’t I remember traveling? </p>\n\n<p>That’s when a car pulled up right next to me. I wasn’t expecting it, so I jumped back a few paces and whacked my head pretty good on the stone bridge. </p>\n\n<p>The person in the car rolled down his window and said, &quot;I&#39;m not going to hurt you bud. I got you some clothes though.&quot; With that, the man held out a red, long sleeve shirt, black jeans, Hanes underwear, some Nike socks and shoes, and a watch. I walked over to him cautiously and took the clothing. </p>\n\n<p>&quot;Thanks.&quot; I muttered. </p>\n\n<p>&quot;No problem.&quot; He said, &quot;Oh, and here&#39;s a $100. Try to shape up if you can bud. Alright?&quot; </p>\n\n<p>&quot;Yeah. Thanks again.&quot; I said, graciously. </p>\n\n<p>&quot;Anytime.&quot; The man said, and then he drove off in his red, pickup truck. I think it was a Ford F-150. </p>\n\n<p>I went far under the bridge and started to change. </p>\n\n<p>&quot;This can&#39;t be happening.&quot; I thought. </p>\n\n<p>I put on everything the man gave me. I looked at my reflection in a parked car, and I can&#39;t lie, I looked pretty good. My red hair was back, so being my green eyes, and for the first time in years, I smiled. </p>\n\n<p>I walked about a mile before I found a good restaurant. Jack Brown&#39;s Beer and Burger Joint. I walked inside, and the smell of alcohol hit me like a freight train. The smell of burgers and fries polluted the air also. There were many people inside, so I assumed it was lunchtime. I looked at my watch and it read &quot;1:32 p.m.&quot; That sounded right to me. </p>\n\n<p>A server came over the front desk. </p>\n\n<p>&quot;How are you today?&quot; She asked. </p>\n\n<p>&quot;Doing well.&quot; I said. </p>\n\n<p>&quot;How many are there.&quot; She said, picking menus and silverware. </p>\n\n<p>&quot;Just me.&quot; I said. </p>\n\n<p>&quot;Okay,&quot; She said, &quot;right this way.&quot; With that, she turned around and led me to a booth right in front of a large, flat screen TV. </p>\n\n<p>&quot;Here you go,&quot; She said, &quot;we will be with you shortly.&quot; </p>\n\n<p>&quot;Okay, thank you.&quot; I said. </p>\n\n<p>&quot;My pleasure.&quot; She said, and with that, she walked off. </p>\n\n<p>I leaned back in my booth and smiled. I was free. No more mental institution. No black spot.  </p>\n\n<p>At least, it thought I was free, until I saw the TV/ </p>\n\n<p>Fox News was reporting an incident that happened in Roanoke, Virginia. </p>\n\n<p>It said that this mysterious, black monster broke out of a mental institution, killing man in its path. It showed a video of the monster slicing and cutting patients and guards. </p>\n\n<p>The blood drained from my face. </p>\n\n<p>&quot;That can&#39;t be me.&quot; I thought, but somehow, I knew it was I. </p>\n\n<p>Breaking out of a mental institution. Killing others. Wait, that happened March 5. What was today? </p>\n\n<p>One of the servers came over. </p>\n\n<p>&quot;Hello, my name is Amy and I will be-&quot; She began. </p>\n\n<p>&quot;What is today&#39;s date?&quot; I asked, quickly. </p>\n\n<p>&quot;Oh,&quot; She said, startled, &quot;today is March 7th.&quot; </p>\n\n<p>I didn’t say anything else. I shot up from the booth and ran outside. I wasn’t hungry anymore. </p>\n\n<p>I ran out into the street and almost got hit by a car. The car honked, but I ran on. I ran all the way back to the bridge and stayed under there. </p>\n\n<p>&quot;How did this happen?&quot; I thought. Then, all the puzzle pieces went together. The sharp pains all over my body. The eye blinking rapidly. Breaking out of a mental institution. It all fit together.  </p>\n\n<p>I had transformed into the monster. </p>\n\n<p>I started to pace around. I had transformed into the monster! I killed people! I started to hyperventilate.  </p>\n\n<p>What was I going to do? What if I transformed again? </p>\n\n<p>I didn’t know what to do. </p>\n\n<p>I went far under the bridge to cry. I wasn’t free. I was still the 26-year-old monster. </p>\n\n<p>Then, sharp pains were flooding my body again. </p>\n\n<p>&quot;No!&quot; I screamed. I knew what was happening. I was transforming again. </p>\n\n<p>I looked at my skin and it was turning black.  </p>\n\n<p>My knees collapsed, and I fell to the ground. My head was jerking back in forth. I was frothing at the mouth. </p>\n\n<p>I could feel my skin shifting and pulsating.  </p>\n\n<p>Then, I passed out again. </p>\n\n<p>I opened my eyes and bright sunlight filled my vision. I tried to sit up, but I was sore all over. My skin was back to normal. </p>\n\n<p>I had transformed again. </p>\n\n<p>I couldn’t help but think of The Incredible Hulk. Then, I laughed. </p>\n\n<p>Then I realized something. I was naked again. </p>\n\n<p>Then, a pickup truck drove over to me. I looked up, and I was under the bridge. I was far under the bridge again. </p>\n\n<p>&quot;I&#39;m not going to keep doing bud. This is your last chance.&quot; The man said from the window of his truck. It was the same guy from last time. He held out the same pair of clothes, this time, he gave me a $50. </p>\n\n<p>&quot;Thanks.&quot; I said.  </p>\n\n<p>&quot;Last time to straighten up bud.&quot; He said, pointing a finger at me, then, he drove off. </p>\n\n<p>I hesitated to put on the clothes again. What would happen if I transformed again? The man wouldn’t buy me anymore clothes if I destroyed these. </p>\n\n<p>I put the clothes aside and decided to save them.  </p>\n\n<p>On the ground next to me, I saw a watch. Was that my watch? </p>\n\n<p>I went over to it and picked it up. </p>\n\n<p>It read 12:04 p.m., March 9. </p>\n\n<p>I was a monster for 2 days.  </p>\n\n<p>&quot;Who have I killed now?&quot; I thought. I didn’t want to know. </p>\n\n<p>There had to be a way to control the monster. There had to be a way to harness this power, but I didn’t know how to harness it. Maybe there was a weakness.  </p>\n\n<p>I tried screaming, to see if loud noises would weaken it, but it didn’t work.  </p>\n\n<p>That only made it worse. </p>\n\n<p>The eye started to flutter rapidly in my chest and my skin was turning pitch black again.  </p>\n\n<p>I started to take in deep breaths, and that seemed to calm it down, but only for a little bit. </p>\n\n<p>Pain started to spread through my body and I was trying to hold the monster back. I gritted my teeth and started to shriek. </p>\n\n<p>It scratched my throat raw and the pain was excruciating.  </p>\n\n<p>Then, the situation got even worse. </p>\n\n<p>A group of hobos crept up behind me and tried to steal my clothing. A flash of anger went through me when I saw them, and I screamed louder. Then, something weird happened. </p>\n\n<p>It was if an explosion went off around me. I saw the hobo’s crash to the ground, and then I saw them running away. </p>\n\n<p>I looked down and I realized that I was floating. I looked at my hands, but instead of hands, they were tentacle like fingers. </p>\n\n<p>Then, slowly, I started to transform back into myself. </p>\n\n<p>I was back to normal. </p>\n\n<p>I closed my eyes and started to think of the pain, and when I came to, I was the monster again. </p>\n\n<p>Then I was back to normal. </p>\n\n<p>I could control the monster now. </p>\n\n<p>I leaped in the air and started to cheer. I didn’t care if I was naked.  </p>\n\n<p>I was now one with the monster. </p>\n\n<p>I dressed up far under the bridge and walked out looking like a new person. </p>\n\n<p>I parted my hair back, so I looked like one of the sexy, male models. </p>\n\n<p>And for the first time in years, I laughed. </p>\n\n<p>As soon as I walked out of Downtown Roanoke, I hitchhiked in a Hummer all the way to the border of Tennessee. </p>\n\n<p>I got out of the car, thanked the driver, and gave him the $50 I had. </p>\n\n<p>I smelled the fresh air and I knew immediately that I was here. </p>\n\n<p>But I wasn’t free yet. </p>\n\n<p>There was still one more battle left. </p>\n\n<p>And that battle was just… </p>\n\n<p>down by the creek.</p>\n</div>\n","author":"Dan100903"}