{"rank":"31","title":"The Voice","id":"8l31pr","url":"/r/nosleep/comments/8l31pr/the_voice/","time":"1526927001000","body":"<div class=\"md\"><p>This happened back in the 1980&#39;s. I was 15 years old and there was a big rock concert in town that night. All of my friends were going, but I couldn&#39;t go because I couldn&#39;t afford a ticket. I lived not far from where the concert was taking place, and from my front porch I could faintly hear the music and singing.</p>\n\n<p>I was sad that I couldn&#39;t be there, and I knew that everyone would be talking about it at school the next day. All I&#39;d be able to talk about was hearing the music from my front porch. </p>\n\n<p>Back during the 1980&#39;s I&#39;d collect old pop bottles because you could trade them in at the store for a nickle each, and I had saved a lot of bottles. I put them into a plastic bag and decided to go and cash them in and then use the money to play games at an arcade that wasn&#39;t far from where I lived.</p>\n\n<p>When I headed out to the store it was already dark outside, but that didn&#39;t concern me because I had walked to the store plenty of other times after dark.</p>\n\n<p>I took my usual route to the store. At the end of the block that I lived on there was an alley way that I always cut through and as I approached the alley and was ready to walk into it, I clearly heard stern a voice that said. &quot;Cross over to the sidewalk, do not go that way.&quot; I stopped in my tracks and looked around thinking that there was a person near me telling me not to go that way. However, as I looked around there was nobody there at all. The street was completely quiet and there was only one house about 50 feet away that had a porch light turned on. </p>\n\n<p>So, I thought I&#39;d do the smart thing and not take my usual shortcut. I crossed over to the other side of the sidewalk and just as i stepped onto the sidewalk I saw car lights go on in the alley. It shocked me because there was someone waiting in the alley for me, and the person must have known that I often walked that way. </p>\n\n<p>I continued walking and the car pulled out of the alley and slowly drove along the side of the road where I was walking. The man in the car asked me, &quot;do you want a ride.&quot; I replied with a simple, &quot;no.&quot; He continued. &quot;hop in the car and I&#39;ll take you anywhere you want to go.&quot; I looked at him and lied, &quot;No thanks, I&#39;m meeting a friend, I think I see him now,&quot; and I pointed ahead pretending like I could see someone down the road. At this point the man became very angry and started cussing at me. &quot;Get into this car right now. If I have to come out and get you it&#39;s going to be a lot worse for you.&quot;</p>\n\n<p>At this point I didn&#39;t look at him again, I just kept walking. Then I heard the voice again. This time the voice had a very serious tone to it, &quot;Run!,&quot; &quot;He&#39;s going to kill you.&quot; That&#39;s when I heard his car stop, and his car door open. He was suddenly running toward me saying, &quot;You should have listened to me, now you&#39;re dead girl.&quot;</p>\n\n<p>I dropped all of the bottles I was carrying and they shattered on the ground as I ran toward the only house that had a porch light on. I got up on the porch and the front door was open but there was a screen door. I could still hear the man behind me and I wasn&#39;t about to stop to knock. I opened the screen door and I ran inside the house. Once inside, there was an elderly woman sitting in a rocking chair. She didn&#39;t get up, she just pointed a walking cane at me and started cussing like a sailor. &quot;Get out of my house.&quot; I looked at her and told her that there was a man chasing me.&quot; She continued to protest that I had run right into her house without knocking, as I turned to look out of the screen door to see if he was there. I only saw the tail lights of his car speeding away. </p>\n\n<p>I turned and looked at the elderly woman and I told her that I was sorry for just running into her home. I asked her if she wanted me to lock the door on my way out. She nodded yes, and so I did.</p>\n\n<p>For whatever reason, I wasn&#39;t scared or worried that the man was going to return. I was mad because I&#39;d broken all of my bottles and so the only thing to do was head back home. </p>\n\n<p>That was the first time, and the last time I ever heard a voice warning me of impending danger. I have no idea what, or who it was. A guardian angel? A ghost? </p>\n\n<p>I guess it doesn&#39;t matter, I&#39;m thankful that i heard it that night.</p>\n</div>\n","author":"donefinishedover"}