{"rank":"6182","title":"My son would not stop crying","id":"8l33jk","url":"/r/nosleep/comments/8l33jk/my_son_would_not_stop_crying/","time":"1526927407000","body":"<div class=\"md\"><p>My son would not stop crying.</p>\n\n<p>I sat in the living room alone.  The house seemed to shift at every scream he would bellow from his room.  I tried to close my eyes and center myself.  Crying was normal.  I knew this might happen when I became a mother.  People warn you about the hard times, but you can never really know until it happens to you.  I managed two deep breaths before the wailing started again.</p>\n\n<p>The sound was a cheese grater against my eardrum.  It was something about the high-pitched nature of the crying.  So damn desperate.  So needy.  I was no longer an individual person.  I was the host for this fucking parasite.  This disgusting mess of cells that nearly tore me apart when I gave birth to him.</p>\n\n<p>I loved him once.  I really did.  I tried so hard to do right by him.  I let him sleep in my bed.  I rocked him back and forth, his heavy skull pressed against my neck like a noose.  He puked everywhere.  His insides were always on my clothes or on the floor.  Nothing felt clean.  </p>\n\n<p>The screaming continued and I turned the TV on as a distraction.  I didn’t watch the DVD again.  Instead I found some cartoons.  I turned the volume all the way up.  Maybe the squeaky voices of the animated animals would drown out his god damn bellowing.   But it only made the worse.  The lady mouse on TV smiled and did a little dance while the boy animals watched and clapped.  I turned it off.</p>\n\n<p>Suddenly there was a knock on the door.  I froze.  Even though I despised his crying, I didn’t want to go check on my son.  And I didn’t want anyone else to either.  I just wanted him to rot in his room and cry until his feeble vocal chords crumbled. </p>\n\n<p>But it might be the cops.  I couldn’t hide for long.  By neglecting his cries I might have made the situation worse.  That fucking bastard.  That useless waste of an egg and sperm.</p>\n\n<p>I got up slowly, smoothing my housedress as I rose.  I walked to the door.  With a deep breath I checked the peephole.  It wasn’t the cops!  It was Arianna, home from school!</p>\n\n<p>I must have lost track of the time.</p>\n\n<p>I enthusiastically opened the door and took her in my arms.  She felt so good.  So alive and healthy.  She stepped back and dropped her backpack off her shoulder.  “Why was the door locked?”</p>\n\n<p>“Just for safety, baby,” I told her sweetly.  “Now there’s something I need to tell you.”</p>\n\n<p>“What?”  She looked worried.  Poor girl.  </p>\n\n<p>“Let’s go upstairs.”  I took her hand in mine.  My son’s screams were quieter now but still very audible.  Arianna seemed scared.  Her little fingers held on so tight.  We climbed the stairs and walked towards my son’s room.  </p>\n\n<p>Arianna stopped.  “I don’t want to go in there,” she murmured.</p>\n\n<p>“Don’t worry baby,” I said softly, petting her black curls.  “You won’t ever have to after today.”</p>\n\n<p>“I guess okay,” she replied, squeezing my hand again.</p>\n\n<p>We entered the musty room.  Bottles of beer scattered the floor like cockroaches.  On the bed lay my son, covered in his own blood.  The shotgun blast to the stomach had revealed his intestines but hadn’t killed him.  He looked up at us with nearly dead eyes.  His arms held his organs inside his body.  His toes were cut off, lined up neat on the bedside table.  His voice was close to death.  “I’m sorry,” he whispered.</p>\n\n<p>A grin spread across my face.  Arianna did not seem scared anymore.  She looked at me and smiled.  “Did you do this, Nana?”</p>\n\n<p>I kissed her forehead.  “I saw the video your dad made.  What he did to you was not your fault.  I knew he had to pay for what he did.”  The crying had almost completely ended.  It was just small whimpers now.  “He will never hurt you again.”</p>\n\n<p>Motherhood is not always easy.  Sometimes you have to do things that hurt your child. </p>\n\n<p>On the flip side, being a grandmother is simple.  Arianna is the only good thing that that worthless, disgusting mass of flesh ever did for the world.  And I intend to keep her safe.</p>\n</div>\n","author":"EZmisery"}