{"rank":"14","title":"I Believe Someone is Stalking Me","id":"8l39eu","url":"/r/nosleep/comments/8l39eu/i_believe_someone_is_stalking_me/","time":"1526928675000","body":"<div class=\"md\"><p>Apologies in advance for my less than commendable writing skill. I&#39;m running on fumes at this point and haven&#39;t been able to catch any real sleep in days, so my mind is very jumbled. I&#39;m also not sure if this is the right place to post this, but I seriously need help with this. So, if it is the wrong place to post, please direct me to the proper place. </p>\n\n<p>First of all, <a href=\"https://imgur.com/mSv1eWQ\">here</a> and <a href=\"https://imgur.com/yjb8yld\">here</a> are all of the notes I&#39;ve taken so far on the subject. Feel free to refer back to these if you want to, but everything written in these notes is discussed on this page.</p>\n\n<p>Also for reference, I am a twenty year old college student off on summer break who is staying at his parent&#39;s house while they are in Italy. So it is just me here. The house itself is a very nice two-story house which backs up to a small road on one side and a minor highway on the other with a good bit of yard separating the house itself from each road. Ok, I think that is all I meant to tell you guys. Now, onto the story.</p>\n\n<p>Two weeks ago, on May 7th, I was eating ice cream and watching Game Night (a great movie btw) when I noticed that one of the lights in my backyard was out. I didn&#39;t think much of it, but when the movie was over, I walked over to a window so I could see the light. As my eyes adjusted to the darkness, I noticed that the light wasn&#39;t out at all. Instead, a man in all black clothing was standing in front of it. He seemed to be looking at me through the window but I couldn&#39;t make out a face. I opened up the nearest door and began to yell at the man to &quot;Get off my fucking property.&quot; He could probably hear the fear in my trembling voice. Regardless, he began to slowly walk away and off into the night. I called the neighborhood police and they came over to check it out but turned up nothing.</p>\n\n<p>Four days later, on the eleventh, I noticed a man standing near my driveway. He seemed to be staring at the house. Unfortunately, I was unable to see any of his features besides the fact that he was a 6&#39;1ish white male. I&#39;m still not sure if this incident is related to the others in any way, but it made an impression on me, probably due to my heightened paranoia.</p>\n\n<p>On the 13th, I was woken up by a loud noise coming from downstairs. When I walked downstairs, I noticed a man with his hands up to the glass of my small kitchen window. He was just looking around. (Think Steve Buscemi in Fargo.) I&#39;m ashamed to say it, but I froze. I actually did the one thing I never could fathom other people doing. Frozen in sheer terror, I saw as he just looked around, seemingly not noticing me, before leaving the window. I bolted upstairs and immediately called the police. By the time they arrived, he was long gone. </p>\n\n<p>Two days later, I left home at around 8:00 am and returned at approximately 3:00 pm. I noticed immediately that several objects were moved around in my room (such as pens, a hair comb, TV remote, etc.) I didn&#39;t think this was substantial enough to warrant a call to the police, so I didn&#39;t bother calling. Just a day later, I found a small flashlight which had seemingly rolled under the kitchen island. I guess it could be my dad&#39;s but I believe I would&#39;ve noticed it by now if it had been under there the whole time I&#39;ve been staying here.</p>\n\n<p>At 11:00pm on the same day I found the flashlight, I heard the keys on our electronic keypad being pressed as if someone were attempting to enter a code. The code wasn&#39;t correct, though, and the little keypad&#39;s alarm started going off. I once again phoned the police immediately.</p>\n\n<p>This is when things were kicked up a whole other notch. On the 19th, I found what looked to be a poor man&#39;s GoPro set up in my living room. It was small and a cube. Obviously, I asked my parents if they knew what it is, and they said no. I went to the police with this new evidence. It still sends a chill down my spine to think some sick fuck was watching me.</p>\n\n<p>This brings me to yesterday when I got whatever <a href=\"https://imgur.com/9BFiLNZ\">this</a> is. It was in my mailbox, but the mailman does not come on Sunday&#39;s, so the stalker himself must have put it in there. I have no idea what the words or date mean.</p>\n\n<p>I will be sure to update you guys with anything else to come. Please leave me your suggestions, I need some rest from this terror.</p>\n</div>\n","author":"PossessedBicycle"}