{"rank":"4","title":"Lifetime Membership","id":"8l3drn","url":"/r/nosleep/comments/8l3drn/lifetime_membership/","time":"1526929616000","body":"<div class=\"md\"><p>Hello nosleep. You don’t know it, but you’ve been one of my favorite friends for awhile, the lot of you.</p>\n\n<p>I’m treating today as a sort of coming-out. For the bizarre, the weird, those who live only half in the world that the unaware do.</p>\n\n<p>You could say that I, and many of you, have a Lifetime Membership to the Bizarre.</p>\n\n<p>This is my earliest memory of bizarre, my entry into the Membership.</p>\n\n<p>I was five years old. My little brother (eventually to be a middle brother, but not for a long while) had some very serious health concerns immediately after his birth and for awhile afterwards.</p>\n\n<p>My mom was his guardian angel, frequently waking up repeatedly through the night to ensure he was still breathing, eventually deciding to quite her killer job working in the management tiers of a high-end retailer to work from home, so as to better care for him.</p>\n\n<p>In the meantime, I became a daddy’s girl. When I was little, Dad and I got on thick as thieves. Mom loves to tell how, when my dad used to try to find some peace in the restroom, even then I would follow and stick my fingers under the bathroom door, calling “daaaada” as I waited for him to leave. Her other favorite is how, while she was at work and my brother was at daycare, my dad was busy unpacking the house, getting everything cleaned and organized for when mom came home from work.</p>\n\n<p>He kept me with him because I was his little sidekick. Our house was pretty simple, the standard late-50’s design that was repeated, with some mild rotations and variations, that you’d see through the block. No winding hallways, no lofty rooms. However, as my dad was unpacking their wedding china, he realized he couldn’t hear me anymore.</p>\n\n<p>No little footsteps, no gay laughter, nothing.</p>\n\n<p>At first the search was perfunctory. Open a door, poke your head in, see no toddler in the room, repeat as panic and dread grows.</p>\n\n<p>Finally, my dad called my mom.</p>\n\n<p>It should be noted here that both my parents are from tiny towns in different parts of Middle Of Nowhere Wisconsin. Having moved to a first-ring suburb where they didn’t know anyone, a missing or abducted child was their biggest fear and worst nightmare. So, by the time my dad called my mom, he was half-crazed with panic.</p>\n\n<p>My mom tried to be the voice of calm.</p>\n\n<p>“Double check all the boxes, and every nook and cranny,” she told him. If he didn’t find me then, she’d come home, but as a young couple with two kids and a new home, the need to stay at work was pressing.</p>\n\n<p>So my dad resumed his search, until finally, finally...</p>\n\n<p>Tiny sobs reached his ears.</p>\n\n<p>There I was, pressed into the very top shelf of one of the closets, terrified of being so high up.</p>\n\n<p>My parents assumed I had, somehow climbed up to the top shelves and simply fallen asleep, and, upon waking, was groggy and confused.</p>\n\n<p>But I lived in that house nearly my whole life. While I don’t remember that day, I do remember a few things, such as:</p>\n\n<p>The shelving in those old closets, while sturdy enough to support clothes (just barely) was not made to endure the tugging and swinging of a scrambling toddle (having seen my younger brothers attempt to re-create the same stunt, to poor results) and</p>\n\n<p>While I did love climbing, I hated spiders and cobwebs and, considering the advanced age of the previous owners, there were a myriad of those things still in the closets.</p>\n\n<p>While it’s entirely possible, I suppose, that I managed to get up into the top shelf of the closet, I can’t imagine I would have shimmied up to lounge amongst the arachnids, much less been there long enough to doze off.</p>\n\n<p>But this is about my first memory, not an oft-repeated and speculated upon anecdote.</p>\n\n<p>As I said, by then, I was five. We’d lived in the house for about a year and a half by then. </p>\n\n<p>My parents, young and consumed by concern for my brother, had attempted to compensate in other ways. </p>\n\n<p>I was given the largest bedroom, and it was done to the nines. At the time, both of my parents worked for large companies and, as the only girl on one side of the family in several generations, and the first granddaughter all around, I was spoiled rotten.</p>\n\n<p>My room was furnished with several pieces of heavy heirloom furniture, both from my mom’s British ancestors, who had arrived before this nation was even independent, and from my dad’s Sami family, who had fled their homelands barely two generations previously (so recently that, while my great-grandfather lay on his deathbed, he lapsed into delirium and only my grandmother could speak to him in the hybrid language cobbled together from Norwegian and Sami that was spoken in her childhood home).</p>\n\n<p>The dark, heavy pieces of furniture were offset by my bright and beautiful Little Mermaid bedset (complete with frilly pillows, my mom always being a sucker for that sort of think) and some lovely and light touch lamps that looked as though they had been made by fairies, and, at the time, were the height of technology, surpassed only by The Clapper.</p>\n\n<p>The windows were narrow and high, and also graced with matching Little Mermaid curtains. My heirloom trinkets lay, artfully arranges by my mother, on the heavy dresser that dominated the room, aside from the queen sized bed that I, at five years old, slept in every night.</p>\n\n<p>I played in there, laughed in there, made imaginary friends in there. I spied on my parents conversations in there, and ignored the strange voices that came from the air vent in there, as one does when one is a child.</p>\n\n<p>It was my own little universe, and I felt safe. Safe, with my little hedgehog Chia pet. Safe, with my great-grandmother’s last prized rose, preserved in some sort of oil and encased in a glass bubble. Safe, with my tiny jewel box, containing tiny pieces of rosemauled porcelain shaped to be a set of earrings and a necklace, a gift from my bestemor.</p>\n\n<p>Until...</p>\n\n<p>Well, the storyteller in me wishes to tell you it was a particularly inauspicious night. That something else was at play.</p>\n\n<p>I think the idea of knowing what factor triggered these events would bring me a great deal of comfort.</p>\n\n<p>But it was just like any other night.</p>\n\n<p>I had been freshly scrubbed and dressed in my pajamas. I’d like to think it was my old Princess Jasmine pajamas, just because those were my favorite and reminded me of fireworks, since I’d worn them to the Fourth of July firework bonanza along the river in LaCrosse, WI, but that particular detail is beyond me.</p>\n\n<p>I remember my damp hair, normally blonde but dark with moisture, tailing down my back, so long it nearly wrapped around my knees.</p>\n\n<p>I remember nestling into the familiar cocoon of fluffy (albeit scratchy) comforter and pillows.</p>\n\n<p>I remember the soft glow of the touch lamps.</p>\n\n<p>My mother’s brief, but loving, kiss and pat, before she went to attend to my sickly brother.</p>\n\n<p>I remember my dad reading my a story, a set of books I treasured for a long time but are lost to me now, a set of books that matched my bedding, with moveable stickers and lessons to be learned.</p>\n\n<p>I remember, as if in slow motion, my father’s strong hands, thick with muscle from softball and shotput and a lifetime of farm work, gently tapping my lamps off.</p>\n\n<p>I remember my Donald Duck nightlight. I remember the smell of my bubble bath. I remember a cooling warmth, the feel of a summer’s evening, when you are slightly damp and the window is open but you are gathered under a bundle of blankets.</p>\n\n<p>I remember the edge of sleep.</p>\n\n<p>I remember the moonlight, piercing my thin curtains.</p>\n\n<p>I remember the rustling.</p>\n\n<p>I had been laying on my side, facing the doorway, cozy, still enraptured with the bright colors of my storybooks, playing out a game of pretend where I could swim for hours without breathing.</p>\n\n<p>I heard the noise behind me, from the side of the bed that had a bare six inches between itself and the wall, a space only I could traverse comfortably.</p>\n\n<p>I rolled first onto my back, glancing warily in the direction of the noise.</p>\n\n<p>It sounded again.</p>\n\n<p>Fear gripped my small stomach. I couldn’t see anything, even as Donald and the moon lit the room.</p>\n\n<p>Silently, nearly in tears, I stared.</p>\n\n<p>I stared, as my comforter began to bunch.</p>\n\n<p>I stared as the rustling became more rhythmic.</p>\n\n<p>And finally, slowly, I stared as a set of fingers began to rise above my bed.</p>\n\n<p>Even then, I couldn’t scream. Young as I was, I knew that my parents were tired, and woke at the least noise (to the point of being aware if I got out of bed to retrieve a stuffed companion for the night).</p>\n\n<p>Terror filled every fiber of my being, but all I could do was shake and clutch the tiny pink stuffed zebra who had been my companion for as long as I could remember.</p>\n\n<p>The hand seemed clean. I remember that. It seems an odd thing, but I remember that the nails were clean and even, and the creases of the palm had no dirt. Maybe not so odd once one realizes that most of my family made their living with hard work and dirt.</p>\n\n<p>This was a hand I didn’t trust.</p>\n\n<p>The hand scrambled across my scratchy comforter, searching for purchase.</p>\n\n<p>I heard a gasp.</p>\n\n<p>I could also hear a low moaning. Now that I’m older, I’ve decided that particular sound may have been me. But at the time, I associated it with the thing grasping at my bed.</p>\n\n<p>But the series of gasps and grunts were entirely separate from me, emanating from that small space, a space I knew neither of my parents could comfortably navigate.</p>\n\n<p>Time ticked on slowly, until finally, finally, as the moon began to slide away from my window, the hand connected to an arm.</p>\n\n<p>The arm connected to a shoulder.</p>\n\n<p>And that shoulder lead to a scalp.</p>\n\n<p>That’s when I started to scream.</p>\n\n<p>At first, my screams were those of a child having a nightmare.</p>\n\n<p>However, the moment I started to scream, the scalp snapped backwards, revealing a stern, sharp-nosed face, clean but heavily decorated with paint, shining with a buttery tan in the moonlight, a phenomenon foreign to a girl raised by entirely white parents in a heavily white community.</p>\n\n<p>The face flared at me with pure hatred.</p>\n\n<p>And then my bedroom door flew open.</p>\n\n<p>I wish I could say there was more. But as I said, this is just my first memory. It’s entirely possible there were other things, but I’ve forgotten them or blocked them out. I know my parents cuddled me and hushed my and brought me into their room for the night. And I’d love to chalk it up to a nightmare.</p>\n\n<p>But that wasn’t the last I saw in my house. This one was just unique.</p>\n\n<p>I’ve done some research, and, luckily for me, the man who taught our Minnesota History class grew up just a block away from me, albeit about fifty years earlier. He taught us that the suburban area I grew up in had once been a swamp, pumped out and filled for development.  And he taught us about the ravine, all of four houses down from mine, where Native Americans had walked and lived and grew their crops. A very particular group of Native Americans.</p>\n\n<p>You see, my state has a terrible history, one ending in a nightmare in a city called Mankato, long before you or I were there. And our little ravine was home to a particular group of Dakota, called the Mdentewakan (I’m not sure I have the spelling right) who sided with the white settlers.</p>\n\n<p>I don’t remember well enough to say it was or wasn’t. Not that I could blame them. But, in spite of my Lifetime Membership, I’ve never seen anything like it. And...</p>\n\n<p>Well, let’s just say I’ll be leaving a note for anyone who buys the place once my parents leave it.</p>\n</div>\n","author":"GythwynA"}