{"rank":"207","title":"Things I saw as a coast guard officer","id":"8l3fwp","url":"/r/nosleep/comments/8l3fwp/things_i_saw_as_a_coast_guard_officer/","time":"1526930072000","body":"<div class=\"md\"><p>You asked for more, I&#39;ve got more. This one I was saving, its alot scarier and I think about it frequently even 12 years later. I&#39;d first like to address a few things people brought up in the comments of my last story. Although it IS true that 270 foot cutters don&#39;t usually run in the bering sea, I believe the captain in question was given command of that one for a very specific reason and then it was returned to regular service later.</p>\n\n<p>Jim pierce was his name if anyone wants to look it up, although for reasons I&#39;ll explain later, I doubt you&#39;ll find any record of the incident.</p>\n\n<p>And for those of you who say that random people coming out of the sea isn&#39;t original.... your right. It isn&#39;t. It&#39;s a less talked about nautical phenomena, and according to the research I&#39;ve done, its been recorded as happening for thousands of years. That is definately not the only first hand case I&#39;ve heard of in the service either. More on that later.</p>\n\n<p>I also decided not to use alot of nautical terminology because my nephew said nobody would get it. On ships, we call the kitchen a galley, the bathroom is the head, and left and right are port and starboard. Also, the different areas of a ship are called the bow (front) the stern (back) and the midships. Anyway on to the good shit.</p>\n\n<p>I&#39;m old. I had to admit it to myself at some point. I realized I was old when I told some kid in target he looked like Peewee Herman, and he had no idea what I was talking about. Nowadays the memories of my adventures are kind of all that keeps me going.</p>\n\n<p>So this is something I experienced while working on a cutter in the pacific. I&#39;m going to be purposefully vague about what ship I was on and where, as I&#39;m not sure if I&#39;m allowed to talk about this. This one still bothers me ALOT.</p>\n\n<p>A normal patrol cutter basically is a sea going customs enforcement entity. Until Woodrow wilson, the revenue cutter service was actually it&#39;s own agency. We board and inspect commercial vessels to make sure they are operating legally and above board. I always liked working cutters, because it&#39;s kind of as close as you can get to being a pirate. you literally get to board ships with guns, and yes, although rare, some ships will try to run. This makes it worse for them, but loads of fun for us.</p>\n\n<p>A common type of ship we inspect on a regular basis is factory trawlers. A factory trawler is a huge fishing boat that catches large amounts of fish, and packages and freezes them for sale right on the spot. They have a whole assembly line below decks that turns fresh caught fish into frozen fish dinners right after said fish are caught. It&#39;s actually pretty cool.</p>\n\n<p>It was about an hour after inspecting one of these boats, we got a distress call from them. Very unusual for alot of reasons. First of all, the water was basically glass, and the weather was perfect. Second, we had literally been in contact with them not 40 minutes before we got the signal.</p>\n\n<p>So after we motored back to them and got the boat in sight, we tried to hail them on the radio. Nothing. tried again. Nothing. Everyone was feeling rather uneasy at this point. Me, and 3 others got on a RIB and cruised up to the side on the trawler, which by the way, was anchored. It&#39;s not common for any ship to anchor in the open ocean unless for repairs or communication, and even rarer still for a factory trawler. Among fishermen, the phrase &quot;Time is money.&quot; rings very true.</p>\n\n<p>I knew something was very wrong before we even boarded her. My suspicions were quickly confirmed. First of all, there was blood everywhere. I mean EVERYWHERE. People died on this fucking boat, badly. Only thing was, no bodies. We searched nearly the entire trawler, but found nobody. It was very chilling. Blood was smeared on the walls, pooled on the deck, so much that I nearly slipped on it.</p>\n\n<p>We didn&#39;t find any crew until we got to the freezer. Factory trawlers have huge freezers that they store their product in, with the boxes stacked pallet style(usually hot dog rather than hamburger). when we opened it, We found a nearly dead crew woman shivering like Spooner from &quot;The fog&quot;, and babbling nonsense.</p>\n\n<p>We got her on board, got her basically thawed out and tried to ask her what had happened. The 30 something mexican woman rambled about naked people appearing on the trawler suddenly and dragging everyone over the side. Talking to her left more questions than answers. We did our job, made sure the incident was reported and investigated, but I never heard about it after the fact.</p>\n\n<p>Now the funny thing is, I know this has happened before because I&#39;ve heard about stuff like this from other USCG vets and a few squids too. One story from a guy I knew that worked in the gulf of Aden creeped me out alot, he claimed they were speeding toward suspected smugglers in a RIB, when some guy randomly popped out and grabbed a dude out the boat as they passed. Thats not the only one I&#39;ve heard but I&#39;m not gunna go into too much detail.</p>\n\n<p>What bothers me about this particular incident, is from what we could put together, whatever happened took no more than 20 minutes. These cases all have a specific MO and I&#39;ve yet to hear an explanation that makes sense. Interestingly enough this phenomena was featured in the found footage mockumentary &quot;Les documents interdits&quot;. Many people have come forward saying some of the footage in this film is real. If it isn&#39;t, It certainly is a chillingly accurate portrayal of what many USCG and navy people have experienced. you can watch it here <a href=\"https://www.youtube.com/watch?v=mHTV1PE6l8o\">https://www.youtube.com/watch?v=mHTV1PE6l8o</a>.</p>\n\n<p>I&#39;ll bet good money most people that have been in the USCG or navy know about this kind of stuff, but good luck getting them to talk about it. I&#39;ve got another one I&#39;d like to post and I&#39;ll write that one up tomorrow. It&#39;s our job to keep you guys safe out on the water, but there are some things out there even we don&#39;t understand. So be careful.......</p>\n</div>\n","author":"wetblumpkinbilly"}