{"rank":"2","title":"The Strange Beetle","id":"8l3phc","url":"/r/nosleep/comments/8l3phc/the_strange_beetle/","time":"1526932178000","body":"<div class=\"md\"><p>I remember crystal-clear the evening, 27th of last May, when the ancient, eye-melting curse first vegetated on my older sister. It was a string of very ignorant and idiotic actions of us that ultimately led to the petrifying scene I and Thomas, my dad, just witnessed last night through the glass door of the isolation room: Jane’s lichen-like face sloppily fell off in chunks and glued to a doctor’s gloves, revealing such slimy, sanguine and distorted parts underneath, from which trapped gas slowly bubbled up.</p>\n\n<p>“Let her sleep, Ryan”, dad held me back from calling mom as we were sitting in the waiting room an hour afterwards. “It’s enough. Let’s just go home...”, he pushed the car key in my hand, mumbled and walked off towards the parking area before I could speak. Silence took place during our drive until the doctors called both phones. I stopped and reached him, for it was out of what I could bare.</p>\n\n<p>…</p>\n\n<p>We all, even the doctors, still do not know exactly in what way it manifested, but the source of all this and when it first happened to my sister are very well-recorded. Another note  is that there are two other similar cases that happened shortly after my sister’s hospitalization.</p>\n\n<p>...</p>\n\n<p>On 27th of last May, long after I and Jane had headed homewards from groceries, I heard an excrutiating scream bursting out from her room. “Cockroach?”, I shouted back as I know too well how generous the tropical summer has always been to those little bastards. A few days prior some of them, plethoric in size, visited our living room and shocked my squeamish sibling. Needless to say, I a good younger brother toyed with her for a solid minute before deciding to stop, as she was showing physical (and mental) response to them and as the worst thing could ever happen to our newly bought apartment was to have a puddle of vomit on the carpet. That night, however, she did not answer (yell back) immediately like she normally would, but continued screaming up until my presence at her very room door.</p>\n\n<p>“What the hell, Jane?”, minutes after hearing her prolonged screaming, I marched at a slower pace and shouted indicatively towards her room, so she could hide whatever that could potentially serve as an awkward embarrassment. “What the heck?”, I repeated before officially showing up at the door. Right there I saw only her and herself in a white t-shirt, shaking quite violently near the bed, with eyes glued to the bathroom door and hair worse than a jungle witch’s. I peeked inside her room, to her toilet and looked back at her.</p>\n\n<p>“It’s huge, it’s like a pig, it went in there Ryan”, she uttered.</p>\n\n<p>I almost squealed like an actual pig to what she just said, thinking that it could not be anything other than a bug or spider.</p>\n\n<p>“No! Ryan, it’s not what you think, it is not a cockroach, it was in the air when I turned back”</p>\n\n<p>“It was in the air?”, I copied although could not fully comprehend what she just said. In my mind I was preparing to later make fun of her for not knowing that cockroaches could of course fly, but at that very instance I kept my face straight to conceal such scheme and appeared as her hero. I shrugged and approached the toilet with caution anyway, for I know tropical insects can sometimes be one hell of a monster. To get stunned by a venomous predator is simply not on my bucket list, so I grabbed what I believe was a small empty makeup container, reached the light switch and waited for a reaction from within.</p>\n\n<p>My sister sprang outside when the thing was first struck by sudden brightness. It, again, up until now doctors still have no clue what it is, as they have never successfully caught one for further research, let loose a skreeking squeal, surprisingly similar to what a wounded piglet would make, then switched to another wave of different noise, this time similar to a bug buzzing or flapping its wings but louder and much more malicious.</p>\n\n<p>“God! What is it?”, Jane, still outside of her room, peaked in with her shrilling pitch as if the alien buzz was not bothering enough. It was that instance and my next decision that affected my sister horribly. I put the small container onto her bed, emptied her dirty clothes basket and looked at her, signaling that she should come help, and to my surprise she followed. When we first came in I did not notice any unusual presence, it was Jane and her better vision and shaky hand that guided me to the thing which was dangling about a foot away from the ceiling, upside-down behind the shower curtain.</p>\n\n<p>Of course we would not see it immediately, as we were both looking down and expected the bug to be on the floor. When I finally saw it I in fact had my sigh of relief, for it, though strangely shiny, was way less sinister than my imagination. That thing compared to any other living bug was enormous, but it was simply a very fascinating, almost obsidian-like, black beetle. “And Black Beetles are not venomous”, I told myself. The thing, again, was of no significance smaller than a smartphone, and, for some reason, was connected to the bathroom ceiling by a thick white-yellowish thread, and so swinging breezily back and forth like a cartoon spider. Its six legs were spreading and twitching and from the lower end, which obviously was its head and mouth, lime-green gooey substance, like a snot of a recently sick person, was being spit out onto the bathtub in small chunks.</p>\n\n<p>My initial thought was to basket the thing horizontally so the abrupt movement would cut the thread and through the nearby open window the bug would be swung out, but later I decided to come close and cup it up vertically instead. Doing so, followed by a few strong shakes, would make the giant bug fall off from its own thread, and therefore I could have a closer look and maybe spook my timid sister for some seconds. With that plan in mind I slowly approached the thing, and with my both hands, did exactly just that.</p>\n\n<p>Upon being cupped it started to struggle vigorously, squealing and buzzing, but later calmed down and soon stayed quiet. “Come help me hold this up, my arms are getting tired, Jane”, my mischievous self decided to pull off a prank, I comforted her hesitant look with a smile of victory, “I need to find something as a lid, we can’t just cup it up like this”.</p>\n\n<p>“I’ll find something”, she seemed worried.</p>\n\n<p>“Then YOU will have to climb up here and block the entrance, since I’m using both hands holding it up. The bug&#39;s heavy!”, I said with pretentious anger and so naive Jane surrendered.</p>\n\n<p>She reached and assumed my position, just then I immediately ran out of the bathroom with biggest laughter, “Prank! Hahaha!”, and ignored her screaming as she was totally locked in that pose, with both hands cupping the basket to the ceiling to prevent the bug from flying out. I acted as if I was going back to my room, and I in fact did go out of sight for couples of seconds, during which Jane screamed louder and louder. Only when I heard a weird thud followed by a splash did I pop back in out of curiosity. Jane somehow managed to manoeuvre the basket towards the window all by herself, and she did shake the bug away, out of the window.</p>\n\n<p>“Nice sis!”, I said, looking at her raging eyes, “I was just joking, c&#39;mon, hey you did it!”</p>\n\n<p>“It fucking spat at me, look! Get the fuck out of my room!”, she turned the shower on, with the upper half of her shirt and hair and head covered in bits of thick, opaque slime. In my mind I thought it was simply mucus of some sort, and did not ask her any further afterwards. I went back to my room and spent my night safe and sound. The next day, which was weekday, she would not go outside her room, I got angry and later worried as I thought she got mad, but I was polite enough to knock her door and asked if everything was fine and ultimately apologized. On 29th, very early in the morning, roughly 30 hours after the encounter, Jane came out of her room and banged mine with cynical manner, wailing very aloud.</p>\n\n<p>Greeting my first sight was but thick, crimson goo leaking out of her bruised, almost distorted eye sockets. Later that  same day, while in a hospital bed, Jane&#39;s both eyes unexpectedly bulged out and burst.</p>\n\n<p>Days of silence went by, and a doctor finally came up to us and said Jane was, in fact, the first and the mildest reported case, as this unsolved disease somehow only attacked her facial tissues without migrating to other body parts, which happened to other two victims.</p>\n\n<p>THE END</p>\n\n<p>---</p>\n\n<p>Written by Dawn Savagi.</p>\n\n<p>This is my very first story posted on nosleep under this newly created account. I enjoy writing short horror stories (although they give me minor heart attacks sometimes) and would love to share my work to the world. Tell me what is your theory on this short.</p>\n\n<p>Thanks for reading.</p>\n</div>\n","author":"dawnsavagiwrites"}