{"rank":"7","title":"Some weird shit is happening at my school in Ireland","id":"8l3qxt","url":"/r/nosleep/comments/8l3qxt/some_weird_shit_is_happening_at_my_school_in/","time":"1526932516000","body":"<div class=\"md\"><p>I’m a junior in college from America, and for basically the first three years of school I was waiting for the semester when I would be able to study abroad. I am finally doing it and everything is not quite as I had expected. No complaints exactly, things are just a little bit… different. Everything has been going fine until a couple of months ago in February, when some slightly weird things started occurring, which I was totally fine with overlooking until a week ago when things got even weirder. It doesn’t really matter I guess, since I’m about to head back to the U.S., but make of it what you will</p>\n\n<p>Let me start with a little bit of background. I applied to go to school in Ireland because I had heard that Irish students are extremely welcoming, and I had actually already met a few friends from Ireland from my college and at work, mostly J1 students (which meant that they were visiting America on student visas, usually working low-paying summer jobs). Basically, I was assuming that once I got here I would have plenty of Irish friends and would fit right in. </p>\n\n<p>I go to school in Boston (no, not at Harvard, which is what everyone assumes I mean when I say “in Boston”). I won’t specify, but it’s one of the schools with “Boston” in the name. It’s a a pretty good school, not the absolute best, but pretty good. My grades there are decent, but I’m not exactly at the top of my class. This is relevant, because when I was applying to schools in Ireland, I was a bit nervous that I might get rejected from a school like Trinity. Applying from my home university, there is this rule that you can only apply for one abroad program at a time, so I needed to choose wisely in case I got rejected. In other words, I didn’t want to apply to the hardest school to get into, and I ended up just applying to one of the universities here that was outside of the city in a smallish town called Maynooth. The school has lots of students, I think around 10,000 in the whole undergrad program. I couldn’t really imagine how small the actual student population in the town was until I got here though. A small fraction of students live on or near campus, but most of the students commute from their family homes because it’s cheaper and there’s a housing shortage. An even tinier fraction live in the student dorms on South Campus (where I live). But the icing on the cake is that virtually all of the Irish students, even the ones who live on or near campus, go back to their family homes every single weekend to work at their part-time jobs and see their families. This phenomenon was very surprising to me, since most American students only visit home during the holiday.</p>\n\n<p>Needless to say, my expectations of the program were very different from my reality once I got here. I has assumed I would make friends with lots of Irish students and spend my weekends gallivanting around Dublin with them or planning roadtrips across the country. In reality, nothing could be farther from the truth. The study abroad program here, to put it simply, leaves something to be desired. The staff who organize it make lots of mistakes, but the most annoying one is that they put all of the international students together instead of integrating them with the Irish students. My housing assignment was particularly gloomy, because I got put in a dorm all the way on the very edge of campus. The walk is the longest to and from class (and into town) and my view consists of a few trees and a parking lot with two dumpsters. There are around twenty people in the entire building, and all of the apartments except one are filled with international students. Also, by some weird coincidence, even though American students only make up a small fraction of the international program, they chose to put us all together.</p>\n\n<p>Naturally, a bunch of us Americans in the building kind of gravitated together. During the first week, I hit it off with two of my roommates, both of whom were also girls from America. One of them, Leah, is from New Mexico and is kind of a pothead, so we got along great. The other girl, Lexi, is from Michigan. The three of us get along really well, and we also have a Norwegian girl and a girl from Portugal in our shared apartment who we barely know but get along with fine, most of the time. What is relevant is the layout of the apartments. You can imagine my entire dorm building to be a kind of “F” shaped building, with four apartments in total. My apartment is on the ground floor next to one other apartment, and then there is one other floor above us, also with two five or six person apartments. About half of the apartment juts out so that the widows in my wing are perpendicular to the windows in the other wing. This means that for a select few rooms, you can seen directly into the bedrooms and the common rooms of your neighbors. </p>\n\n<p>My room happens to be one of the lucky rooms that has a ton of visibility from the common rooms of the adjacent apartments, especially the one that is on the floor above that juts out like the top portion of the “F” shape. Luckily, this isn&#39;t really a big deal because this is the apartment with the other Americans who my roommates and myself know really well. Bear with me, because this is the most important information to remember. There are five guys who live there, four of whom are American and one of whom is from Armenia. Three of the four Americans are college freshmen who got put together because they all go to the same school in Florida. I don’t know whose idea it was to put freshmen in a study abroad program, but somebody seemed to think it was a great idea because there are a ton of first years from their school staying at Maynooth. During the first week, Leah and I met them and we started hanging out with them pretty much on a daily basis after that. I managed to buy some pot off of an Irish friend who lives in Dublin, and they smoke too and have a bong in their apartment so the friendship just kind of came naturally. </p>\n\n<p>When I say they smoke, what I really mean is that two of them, Jack and Aron, smoke. The third one doesn’t really smoke or hang out with us that much. This guy is named Will, and I know the least about him. At first, the five of us hung out all the time, but after a couple of weeks it became pretty obvious that Will just wasn’t really that comfortable hanging out with all of us as a group. The other guys seemed to really enjoy our company, but it was easy to see that Will wasn’t that comfortable hanging out with girls right from the beginning. I know that he went to an all boys school for high school, and I can’t say this with any certainty, but if I had to guess, I’d say he probably went to an all boys school for his entire life based on the way he acted. I remember the first time we were all hanging out where there was kind of a red flag that made me notice how awkward he was. Leah and I were drinking a few beers upstairs with the guys and we wanted to play beer pong but we didn’t have any cups or ping pong balls, so one of the guys suggested that they go out and buy some from the store. Jack and Aron were about to leave to buy some and Will started freaking out about how he didn’t want to wait at the apartment with us. He started kind of freaking out, saying things like “please don’t leave me alone here with the girls”, and Leah and I were laughing at first because we thought he was just joking around. It became clear that he wasn’t joking when he actually told Jack that he should stay behind with us while he went and got cups. We kind of brushed it off as him being shy around strangers, but things only got weirder after that.</p>\n\n<p>By the end of September Will was barely hanging out and pregaming with us. He was still going out at night, but he was usually drinking by himself and then we would run into him when he was out and he would say he went out with other people but he’d usually be alone, which he would explain by saying he got separated from them when he went to go pee or smoke a cigarette outside. We knew it was bullshit but we felt kind of bad for him so we always would invite him to hang out with us or to walk back together as a group. One time we all went out and got back really late, maybe around 4, and we found him drinking cans of beer in the living room by himself. This was kind of the turning point where I actually started to really dislike Will and feel genuinely alarmed by his behavior. This was around the second week in October, and Leah and Jack had started hooking up a few weeks before and usually ended up going home together. On this particular night they were really drunk and giggly and when we all got back to the apartment they wanted to smoke. </p>\n\n<p>We walked into the living room and saw Will there with at least eight empty beer cans and he barely acknowledged us, which was a bit odd. I noticed that he had been kind of crumpling up all of the cans and it kind of looked like just a pile of shrapnel on the table and the floor under the table. So anyway, Jack and Aron smoke and Leah and Jack start doing this kind of play-arguing thing that they always do where Jack just kind of says stupid shit about how “women belong in the kitchen” and “women need to evolve before they can be paid as much as men”, just kind of a Souther redneck bit that he always does to try to get a reaction out of us. Will is sitting there quietly scrolling through his phone and Jack says something about how with recent advances in technology, soon it will be possible to “eliminate women from the population” and we can finally have a world of only men. He was obviously joking around and Leah was kind of jokingly outraged at him, but Will just looks up from his phone and makes eye contact with me and he goes “yeah, fuck women, I’d get rid of them if I could”. Zero inflection to indicate that this was a joke. No “just kidding” or laughing. He just says this while he is looking into my eyes. </p>\n\n<p>By this point Aron had already gone to pass out and Leah and Jack were so crossfaded and were busy flirting so I was the only one who caught it, so nobody else acknowledged the general weirdness of Will’s comment. I kind of concluded that Will was just kind of socially awkward and an asshole, and this was his poorly thought out attempt at making a joke. But it still didn’t sit well with me, especially the way that he didn’t smile or anything when he said it, and the way that even though he was clearly drunk, he said it in this bizarrely sober tone. Anyways, after Leah said she was going back to Jack’s room for the night I made sure to get out of there as fast as I could and I went back down to my room. </p>\n\n<p>All of that was normal enough though. I kind of chalked Will’s comments up to his drunkenness and him being a bit of a misogynist, but as a girl from the East Coast that fit well enough with my stereotype about a lot of guys from the South. What really freaked me out happened a few nights later. It was a Thursday or Friday night if I had to guess, and it was really. Fucking. Weird. I had gone out to the local bars with Jack, Aran and Leah as usual and we had not run into Will on this particular evening. This wasn’t too uncommon because some of the bars are enormous and have kind of a nightclub layout with multiple floors and hundreds of students in them. Leah and Jack had, as usual, ended up going back to Jack’s room to fuck and Aran and I had walked back to campus with them. I parted ways with Aran at the door and he went upstairs to go pass out. I was just getting some water to chug before falling asleep and doing the whole washing my face, brushing my teeth, putting on sweatpants routine when I saw from my window that their common room light came on. My eyes aren’t great, but I saw somebody pass in front of the window and I was pretty sure it wasn’t Aron because he’s a big guy and pretty built. Whatever, I finished getting ready for bed and a few minutes later I was under the covers with a glass of water next to my bed. </p>\n\n<p>Just as I’m falling asleep though, the doorbell rings a few times and I hear this kind of knocking. My room is the closest to the apartment door, so I usually get up to answer it regardless of who the guest is and regardless of which one of my neighbors the person is trying to visit. It was past 3 on this night though, and I was about to pass out, so needless to say I was feeling hesitant to get up and figure this one out. I didn’t hear anyone else’s room door open though, so after about a minute I figured I would have to check it out. I grudgingly turned on my bedside lamp and got into my slippers and walked the fifteen feet out of my room and down the hall and I opened the door. Nobody was there. That isn&#39;t that weird, considering that towards the end of the week everyone goes out, so most of the residents are returning drunk and probably fucking around. </p>\n\n<p>I was mildly annoyed when I got back into bed and I was just about to hit the light when I looked up and saw that there was a person in the boys’ common room standing not near the window, but directly in front of it, with one of his hands cupped against the glass around his face like he was really straining to get a good view. I didn’t even need to think twice to realize that this was Will. He was the only guy who lived there with blond hair and was about 6’2 and lanky so he was immediately recognizable. Plus he was wearing the same striped sweater that he wears literally every day. It was like he was trying to look at me, but since it was fairly dark in my room he clearly couldn’t tell that I was seeing him watch me. But what really fucking shocked me was that his whole right hand was moving back and forth really fast. It took me a few seconds to realize that he was actually holding his dick in his hand. My jaw fucking dropped when I realized he was fucking masterbating and in that moment I was mostly just completely shocked. </p>\n\n<p>I was laying there paralyzed while this guy was looking right into my room furiously jerking off and I could make out this look on his face that I cannot even describe. It was some kind of mixture of anger and pain, like physical pain, and this lasted for about thirty seconds before something even fucking weirder happened. I heard somebody ringing the doorbell again and this time they were ringing it even faster. I was totally fucking frozen, not sure whether Will could actually see me and was aware that I was onto him, or if he was getting off knowing that I was aware of what he was doing. For some reason, it freaked me out to think that he would be able to see me if I went up and got the door, because there would end up being this kind of acknowledgment that I was awake and aware of what he was doing. The door stopped for about fifteen seconds and I was still frozen, and the look of anger on Will’s face was even more exaggerated. Out windows aren’t that close to each other, but I could see his face becoming bright red and his arm was moving back so quickly that it actually occurred to me that he might hurt himself.</p>\n\n<p>I didn’t hear any of my roommates’ doors open in my apartment and there were no footsteps indicating that anybody was walking down the hall to open the main apartment door for whoever was ringing the doorbell again. A few seconds passed and I still didn’t hear the apartment door open. There was just complete silence. Which is why it was completely fucking shocking when I heard this fast, loud banging on my room door. It lasted for only a few seconds but it was like the person outside didn’t care if they woke up all of my roommates. It was the kind of knock that I can imagine could only be produced by someone who was pretty strong and it made my door kind of shudder for a few seconds. Then just silence. I got up and began to cross the room but I couldn’t bring myself to make the last couple of steps to the door and I just kind of paused there, my entire body shaking.</p>\n\n<p>This feeling passed through me of just pure dread, and I kind of held by breath for a moment because the entire apartment was absolutely silent, and I didn’t want to hear whoever was standing outside of my door to hear me. I don’t know why this was what I was afraid of, I can’t explain it, but I put my hand over my mouth to quiet the involuntarily loud breaths that were coming out. I walked into my bathroom which is right next to the door and when I looked into the mirror I half expected to see something creepy standing behind me, but there was nothing. Just my own reflection. My skin was completely drained of color, even paler than my usual shade of manila envelope, and I had this kind of thin sheen of oily sweat over my face and neck that only happens when I’m really anxious. </p>\n\n<p>When people say that animals can smell fear, they make it seem like the smell of fear is some kind of subtle scent, but in that moment it was just this really strong musk that was coming from my skin. I could literally smell the sweat that my body had produced in that five minute period, and it completely drenched my lower back and the armpits. I had this horrible knot in the bottom of my stomach and the heavy drinking that I had been up to earlier wasn’t helping my situation. Before I knew it, I was bent over my toilet with vomit coming out of my mouth and nose, and those kind of involuntary throwing-up tears pouring out of my eyes. I was puking as quietly as possible, putting my face as close to the water in my toilet as I could so that it wouldn’t echo out of my bathroom. After a minute I turned on the tap of my sink to produce the tiniest, quietest possible stream of water so that I could rinse out my mouth. I didn’t even bother to brush my teeth. </p>\n\n<p>The feeling of terror had passed and given way to this insane feeling of exhaustion that I can only compare to the feeling when you’re a little kid and you want to stay awake a little bit longer to finish a movie or keep playing games at a sleepover, but all effort is completely and utterly futile. At this point, I just needed to get out of my bathroom and I had the inexplicable feeling that whatever was happening was completely over. I peeked my head out of the doorframe of my bathroom, and just as I had already known, the lights were off in the upstairs common room and the room was once again empty. I spent the last bit of energy that I had pulling down the rolley curtains in my room. </p>\n\n<p>Everything is pretty much okay now, but I haven’t really been able to talk to my roommates about what happened because I think they would probably assume that I’ve completely lost it. I just feel bad because Will is a freshmen in college and I might be the first girl to go through this stuff but there will be three more years with of girls who are going to be at college with him. I honestly don&#39;t even know how I would explain any of this if I were to report him, because I know how ridiculous it sounds. Help? </p>\n</div>\n","author":"kiddles96"}