{"rank":"10","title":"The Trip North","id":"8l3x9p","url":"/r/nosleep/comments/8l3x9p/the_trip_north/","time":"1526933861000","body":"<div class=\"md\"><p>I’m writing this from a rest area on my phone, so apologies for misspelling. I don’t know if I should call the cops or not, I don’t know if what just happened was real. All I know is I’m scared, and even if no one will believe me, I know that this community will. And shit, if I disappear, or if it’s happened to someone else, at least I’ll have written it down.  Maybe I’m not alone.</p>\n\n<p>Today, or I guess now, yesterday, I was driving up north from my city to my family’s cabin. Every year we do a Memorial Week celebration, and this year was my turn to set up the cabin and air it out. No one likes sleeping with spiders. </p>\n\n<p>I’d meant to leave the city right after work, but first I had to drop the dog off my boyfriend’s house, and then, you know, we got distracted… anyway, I left later than I meant to, traffic was awful, and next thing you know it’s dark out. </p>\n\n<p>It’s a long drive, and 10 pm I was still a good four hours from the cabin. An hour before I’d stopped in a small town for a bite at a small diner. It was the last place I’d have cell reception before reaching the very wayside I’m writing this from. </p>\n\n<p>Anyway, I ordered dinner and as I was polishing off my French fries, I called my mom and told her what my ETA would be to the cabin; as always, before hanging up, she told me to be safe and that if I got too tired, to pull over and sleep before continuing on. She just wanted me to be safe. As always, I told her thanks, but I’d be fine. </p>\n\n<p>I was on the road for another hour and all seemed fine. I’d long since lost cell reception, but it was okay since I knew that in an hour and a half I’d have it back and I was still on the rural highway headed North. </p>\n\n<p>At this point, my eyes were growing my heavy and my music wasn’t doing a good job of keeping me awake. It had been a long day, and I was exhausted. </p>\n\n<p>The road seemed to blur in front of me, and I was finding it harder and harder to pay attention. My mom’s advice to just pull over and sleep, if only for an hour, kept rattling around in my head. </p>\n\n<p>After a few more minutes of fighting to keep my eyes open, I decided to pull onto the shoulder. I locked the doors, unbuckled my seatbelt, pushed the driver’s seat back as far as it would go, and set my phone alarm for 11:30. All I needed was a thirty minute nap and I’d be good to push through for the next few hours. I took off my shoes, curled onto my side, and fell asleep.</p>\n\n<p>I woke up with a start what seemed like minutes later. Everything was totally silent—there wasn’t even the quiet sound of the engine cooling. Figuring I had at least another twenty minutes left, I checked my phone for the time. Even though it’d been charging as I drove, it had somehow died while I slept. </p>\n\n<p>Whatever, no big deal. Now was as good as time as any to resume driving. I was already feeling a small amount of fear from sitting in the pitch black wilderness of the Northwoods, with the only light coming from the stars above.</p>\n\n<p>I fished the keys out of the cupholder and jammed them in the ignition. As the engine turned over and my headlights came on, light flooded the road in front of me. I looked down to buckle my seatbelt when from the corner of my eye, a man erupts from the woods, screaming.</p>\n\n<p>He ran straight at my car, screaming for help. He was wearing a white t-shirt, khaki shorts, and was bare-footed, with dirt up to his shins.  As he ran at me I froze, all I could do was stare as he got closer. His shirt was soaked with sweat and what looked to be blood, and judging by the front of his shorts, it looked like he’d pissed himself. </p>\n\n<p>It wasn’t until he was feet from the car that I jerked back into motion. </p>\n\n<p>All I could do was say fuck over and over, as I frantically tried to kick my shoes out of the way to put the car into gear. My palms were slick with sweat and I could hear my heartbeat in my ears as I tried to move faster, but one of my shoes was caught on the brake. </p>\n\n<p>Now he was banging on the driver’s side window. His face was a mess of dirt, blood, and snot, and his hands left streaks on the glass. He was begging. God, I wanted to help but I knew I had to leave. What if whatever was coming after him got me?</p>\n\n<p>Bending down, I grabbed the shoe and gave it a sharp tug. Finally it came free. I jerked the car into drive only to see the man had now moved in front of the car, blocking my way. I didn’t want to hit him so I threw the car into reverse.</p>\n\n<p>I turned to look behind me when out of the woods melted more men. </p>\n\n<p>Fuck.</p>\n\n<p>Launching back into drive, the car jolted forward, narrowly missing the screaming man as I sped away. Coming out of the woods like a tide were men. It must’ve been hundreds.</p>\n\n<p>They were behind me on the road and pouring out from either side of me; as I flew down the side of the road they surrounded the screaming man. </p>\n\n<p>I don’t think the speedometer came down from 100 until now, reaching this wayside. It’s well-lit, it has internet and security cameras, and seems the only safe place to stop until I reach the cabin. My heart still hasn’t stopped racing. </p>\n\n<p>I’m turning to you guys because I don’t know what I should do—should I call the cops or ignore it? Because the strangest thing of all?</p>\n\n<p>The men who came pouring out of the woods all looked identical. Each and every one of them were wearing a spotless black suit, tinted glasses, and holding a thin, narrow briefcase.</p>\n\n<p>What cop is going to believe that?</p>\n\n<p>I need your help. I&#39;m posting this and continuing on to the cabin... I just hope I make it.</p>\n</div>\n","author":"nym4dora"}