{"rank":"76","title":"Cabin #7 (PART 1)","id":"8l3y4o","url":"/r/nosleep/comments/8l3y4o/cabin_7_part_1/","time":"1526934058000","body":"<div class=\"md\"><p>My family owns a cabin in the mountains of New Mexico. For as long as I can remember, my extended family has been splitting up the summer months so that each family gets a chance to spend a week or two at the cabin relaxing and enjoying nature and forgetting about the real world. </p>\n\n<p>Now, the family cabin probably isn’t what you’re imagining. It’s a small, two bedroom, one bathroom log cabin with a small kitchen, small fireplace, and a living room that is somewhat crowded by two very old large couches and a piano that hasn’t been played or tuned in <em>at least</em> 20 years. There is no wifi, and no cell phone reception for miles. It’s no luxury getaway, but my grandfather built it with the help of my dad and his 2 older brothers, so the Cabin has always held significant sentimental value. There are 7 cabins total in the valley, each is architecturally different from the last. None of the cabins have anything in common except the valley, and the hand carved numbers on the porches that were typically painted in blue so that the mailman could see them when he made his weekly visit. My family has always loved the seclusion that the valley offers. No cell phones? No wifi? I have always loved it. Cabin 6 was our little corner of heaven. </p>\n\n<p><em>Was…</em></p>\n\n<p>Cabin 6 sits about 40 feet from a crystal clear river that is almost narrow enough to jump across. You can hear the river flowing at all times inside the cabin. It’s always been so soothing to me. </p>\n\n<p>Flowers of every color are scattered through the fields that separate the cabins that occupy the valley. Small trees bordered either side of the river for miles. Every 50 yards or so there is a man-made clearing big enough to fish from. The valley is heavily stocked with Rainbow Trout and Brown Trout. Fishing is a major tourist attraction in the area.</p>\n\n<p>According to my dad, each of the 6 families who had cabins in the valley in the late 50’s to mid 60’s built these fishing holes so that their children would be able to fish successfully in the river without wandering too far from home. This made sense because we weren’t the only big extended family that visited the valley in the summers, though it was rare that more than 2 cabins were visited at the same time.</p>\n\n<p>I can’t remember how old I was when my dad first started taking me on his morning fishing trips, but I was young, barely old enough to bait my own hook. </p>\n\n<p>We would grab our gear and follow the river to the south end of the valley to the clearing near cabin 1, we would fish there for a bit, then head north to the spot by cabin 2 and then continue north to cabin 3 and so on, until we made it back to our cabin. Then we would clean our fish and start cooking breakfast before my mom and sister woke up.</p>\n\n<p>This tradition became a favorite of mine. </p>\n\n<p>When I was about 8 years old, my dad and I were out on our regularly scheduled morning fishing trip, and something unusual happened.</p>\n\n<p>I remember it being cloudy and cold. We were having especially tough luck that morning. By the time we made it back to our cabin to clean the few fish we caught, my father was frustrated. We didn’t have enough breakfast to feed the four of us.</p>\n\n<p>He stood in silence for moment and then looked at me and knelt down and said “I need you to stay here. I’m going to get more fish. You can come with me tomorrow morning, but I need you to stay here this time.”</p>\n\n<p>I was sad that he wanted to leave me behind. I had gotten used to being by his side and bonding with him in the silent mornings as we patiently fished for breakfast. That sadness was soon drowned out by curiosity when I noticed that he wasn’t following the river back the way we came. </p>\n\n<p>I had been fishing this river with my dad for years and he ALWAYS walked to the south end of the valley and worked his way back north to our cabin. My father is a man of routine. Something was off.</p>\n\n<p>I decided to follow the river south and see if I could find him.</p>\n\n<p>I followed the river’s bordering trees for roughly half of a mile, listening to the clear water washing over the smooth round stones that lined the riverbed.</p>\n\n<p>I had never been this far south in the valley and had never really gone out exploring by myself, so anxiety was building. </p>\n\n<p>I didn’t feel right. </p>\n\n<p>I wanted to call out to my father, but I had a strong feeling in my gut that I shouldn’t. I couldn’t shake the feeling that I needed to be very, very careful. </p>\n\n<p>Then suddenly the world changed. </p>\n\n<p>It hit me hard, like the first draft of cold air that floods the room when you get out of a hot shower in the winter.  I didn’t realize what was wrong at first, but it slowly started to sink in…</p>\n\n<p>I couldn’t hear the river anymore. </p>\n\n<p>Had I gotten lost? </p>\n\n<p>Panicked, I stepped quickly toward the trees and separated two branches with my hands.</p>\n\n<p>The river was there. Rushing over the large smooth rocks. </p>\n\n<p>My heart dropped as I realized that I hadn’t lost the river.  I had lost my hearing completely.  I could see the trees moving I the wind, but couldn’t hear the swishing of the leaves. I could see the river raging but couldn’t hear the familiar comforting rush.</p>\n\n<p>I was terrified.</p>\n\n<p>I continued walking through the silence hoping to find my father.</p>\n\n<p>I came upon a small stone pillar that was covered in moss. It looked like someone had written something on the stone. I used my pocketknife and scraped the moss away. The number 7 was etched into the pillar with some kind of chisel and painted black. </p>\n\n<p>I had always known there were 7 cabins in the valley, but my family never traveled any farther south than where we stayed.</p>\n\n<p>I just assumed the cabin was for sale I suppose.</p>\n\n<p>I looked up from the stone and saw a black cabin in the distance.</p>\n\n<p>The cabin was old. It seemed to have been about as old as the cabin my family owned, but there was something infinitely ominous about this place. </p>\n\n<p>As I drew closer to the cabin, I noticed that the cabin hadn’t been painted black. It hadn’t been painted at all.</p>\n\n<p>It had caught fire, but not recently. The grass around the cabin was just as green as the rest of the valley.</p>\n\n<p>The windows were covered by big wooden shutters that were chained and locked shut. A large brass lock dangled from each chain.</p>\n\n<p>I walked around the house and found the front door. </p>\n\n<p>It had been kicked in. </p>\n\n<p>From where I stood I could see inside the house.</p>\n\n<p>It took my eyes a moment to adjust to how dark the inside of the house was, but when I could finally focus, I saw two thick chrome chains attached to the ceiling. The chains really caught my attention because everything inside was charred to a crisp…everything except the two shiny chrome chains, and the snowy white bed that hung from it. </p>\n\n<p>I took a step towards the front porch of the cabin and suddenly became infinitely more aware of my inability to hear. I frantically scanned my surroundings to make sure I was still alone.</p>\n\n<p>When I turned back and looked into the house, I saw that I definitely was not. </p>\n\n<p>There was a girl in the house. She was slowly walking in a circle in the middle of the black room where the white bed hung. </p>\n\n<p>She was eerily pale, and had black hair. She was wearing a dark red dress. </p>\n\n<p>I crept closer to the house to get a better look. </p>\n\n<p>And I will forever wish I hadn’t.</p>\n\n<p>She was staring at the floor, emotionless, walking very slowly in a counterclockwise circle. </p>\n\n<p>Now, a lot of things were strange and scary about what I was seeing, but the way she was walking was very unnatural. </p>\n\n<p>I focused my attention to her feet and noticed that as she walked, she would place her heel on the floor and the slowly roll her foot until the tips of her toes met the surface of the floor. </p>\n\n<p>Suddenly she stops on her toes and slowly turns her head towards me, making eye contact. </p>\n\n<p>She tilted her head like a confused dog, and widened her eyes.</p>\n\n<p>Then she started walking towards me on the tips of her toes. </p>\n\n<p>I could hear her toes breaking and her toenails crunching on the floor. </p>\n\n<p>I turned and ran as fast as I could. I could hear rapid footsteps behind me as desperately made my way along the river’s border.</p>\n\n<p>My head began to pound and throb. </p>\n\n<p>I could hear again, and every sound was loud and disorienting.</p>\n\n<p>I knew I had to keep running. </p>\n\n<p>Out of the corner of my eye, I saw a brown flash, and something snatched me from the ground. </p>\n\n<p>It was my father. </p>\n\n<p>He threw me over his shoulder and ran. I could see her now as my dad ran with me in his arms. But she wasn’t chasing me anymore. </p>\n\n<p>She was just standing there. Grinning.</p>\n</div>\n","author":"anydarkdistance"}