{"rank":"1643","title":"Eviction","id":"8l41wm","url":"/r/nosleep/comments/8l41wm/eviction/","time":"1526934935000","body":"<div class=\"md\"><p>I’ve been told I have something of a bleeding heart. I never saw it as an issue, though. People got the help they needed, I felt good about it, it was a win win.</p>\n\n<p>Before Maxine, though, it had always been little stuff: just a few bucks to one friend here, fostering another friend’s dog after they moved and couldn’t take her with them. Nothing that really inconvenienced me greatly and certainly nothing that ever made me feel taken advantage of.</p>\n\n<p>I met Maxine through a friend of a friend of a friend at a birthday party. She was a down-on-her-luck twenty-something who’d just come out of an abusive relationship with both a boyfriend and heroine. When I was introduced to her while standing around the snack table, she struck me as the kind of person who’d never had a helping hand offered to her. A real kicked puppy type. She was open about her struggles with addiction and the mistakes she’d made and she laughed wryly about how much harder life seemed to be when she was sober.</p>\n\n<p>“Before, I didn’t care that I was homeless. Now, having a roof over my head is this huge priority. Kinda unfair, huh? You get clean, it’s supposed to be the start to a better life, but you just realize how fucked you really are,” she said.</p>\n\n<p>My fiancé saw The Look in my eyes before I even realized it was there. He was quick to excuse us.</p>\n\n<p>“No,” Blake said as soon as we were out of earshot.</p>\n\n<p>“What? I didn’t say anything.”</p>\n\n<p>“You were going to.”</p>\n\n<p>“I mean, I do still have my condo. It’s not on the market yet. She could just stay there until I sell…”</p>\n\n<p>“We agreed that we’d hold on to it after you moved in with me for when your parents come visit, Cecilia, not for some random drug addict.”</p>\n\n<p>“She’s recovered! And she’s not ‘some random drug addict’, she’s Jesse’s cousin. She just needs a little help, sweetie,” I smiled prettily up into his dark frown.</p>\n\n<p>“Then let Jesse deal with her.”</p>\n\n<p>We argued quietly in the corner for almost half an hour before I put my foot down. It was <em>my</em> condo and I could do with it as I pleased, including rent it out. If Blake hadn’t fought me so hard on it, maybe I wouldn’t have dug my heels in like I did, but by the time we left, I’d given Maxine my phone number and instructions to call me to talk about having her stay at my place.</p>\n\n<p>Blake was quiet the whole ride home.</p>\n\n<p>“If this goes wrong, you’re on your own,” he finally said when we pulled into the driveway. “Your condo, your tenant, <em>your</em> problem.”</p>\n\n<p>I knew he didn’t mean it, that he was just angry at me and he’d be the first to stand by me if things went south, but it still stung a bit to hear. It also made me more determined for things to go well. </p>\n\n<p>Now it felt like I had to prove Blake that I had good judgement in addition to a bleeding heart.</p>\n\n<p>Maxine was an ideal tenant for the first six months. We’d worked out a reasonable rent, she paid on time, and I wasn’t getting complaints from the neighbors or association. Even Blake had to admit that it might not have been such a bad move, even if it was an impulsive one. </p>\n\n<p>The trouble didn’t start until she lost her job at a big box store. She told me tearfully over the phone that her register had been short a couple times, but it wasn’t her doing. She was sure it was her manager getting back at her for turning down his advances.</p>\n\n<p>“Please give me a chance to find something else,” she begged. “I’m already looking!”</p>\n\n<p>Blake was immediately skeptical, but I gave Maxine a month of reduced rent during which she was supposed to be job hunting. She sobbed while thanking me until we hung up.</p>\n\n<p>A week later, I got an email from a nice, but nosey, neighbor at the condo letting me know a “sketchy junkie guy” was peeking in the windows after dark and she’d seen Maxine talking to him at the front door. It was Maxine’s first misstep since she’d started living at my place: we’d agreed she wouldn’t have contact with any bad influences from her drug using days, something she wasn’t supposed to be doing anyway as a rule of her support group.</p>\n\n<p>“It was just my ex,” she said when I confronted her. “I told him to leave me alone. We’re not hanging out or anything. You don’t need to worry.”</p>\n\n<p>I wanted to believe her. I wanted to give her the chance that I didn’t think she’d had before. My nosey neighbor’s next email, though, made it almost impossible. The sketchy junkie guy was back and, this time, Maxine had let him in. I shot Maxine a text to let her know we needed to talk. </p>\n\n<p>Over an hour later, I got a very simple, very direct response.</p>\n\n<p><em>Fuck off</em></p>\n\n<p>It was unexpected, to say the least, and I waited a bit to see if she’d follow up with an apology or an “Oops, wrong person”, but nothing. I showed it to Blake and he shrugged as if he’d been waiting for something like this to happen.</p>\n\n<p>“Call her,” he suggested.</p>\n\n<p>The line went to voicemail after a few rings.</p>\n\n<p>“Maxine, it’s Cece, we need to talk. Please call me back as soon as possible.”</p>\n\n<p>I kept my phone beside me for the rest of the evening, but I didn’t get a response until the next day in the form of a text.</p>\n\n<p><em>Fuck off done talking byyyyye</em></p>\n\n<p>My heart sank as I read it. The very thing Blake had told me would happen was happening: Maxine’s ex had come back into the picture and she was using again. I cried when I told him.</p>\n\n<p>“Sorry, babe,” he said. I was grateful he wasn’t the gloating type. “I think it’s time for her to go.”</p>\n\n<p>I couldn’t help but agree. Kicking her out was going to break my heart, but she’d already broken my trust and my rules. She had to find a new place to live. </p>\n\n<p>It didn’t feel right, trying to say all that over the phone, so the next day, I sucked it up and drove across town to the condominium complex. I parked beside her car in a guest spot and took a moment to compose myself before getting out. My palms felt slick and my heart thudded as I approached the door. I wasn’t good with confrontation, I never liked upsetting people, but I kept reminding myself that this was her <em>own</em> fault. I wiped my hand on my pant leg before knocking.</p>\n\n<p>There was no answer and it was quiet inside. </p>\n\n<p>I knocked again, harder this time.</p>\n\n<p>“Maxine? It’s Cece,” I called.</p>\n\n<p>There was a shuffling sound on the other side of the door and I thought I heard a couple of low voices. The living room curtain twitched.</p>\n\n<p>“Maxine,” I said again.</p>\n\n<p>“Fuck off!” She called back. Her voice was slurred and raspy, unlike her usual self. A predictable byproduct of someone on a bender.</p>\n\n<p>At least she was being consistent with her new narrative.</p>\n\n<p>“Maxine, if you don’t talk to me, you’re just going to have to leave. We had a deal —”</p>\n\n<p>“I’ve got rights!”</p>\n\n<p>“Please don’t make me call the cops.”</p>\n\n<p>“Do it, bitch!” It was a man’s voice that time. I assumed it was her supposedly ex-boyfriend.</p>\n\n<p>The curtain moved again and, for a short moment, I caught a glimpse of half of her pale face looking out at me. Her eye was glassy, unfocused, and her makeup was horribly smudged. It broke my heart to see her slip back into her old habits like that. She disappeared back behind it almost instantly.</p>\n\n<p>I didn’t want to cry on the front step of my own condo, especially not if she was going to be watching, and I stomped back to my car. The frustrated, betrayed lump in my throat made it so that I didn’t even get to have the last word. Even then, I wanted to try to work things out civilly. Maybe she’d be more reasonable once she sobered up.</p>\n\n<p>“No, this is unreasonable. It’s disrespectful!” Blake fumed when I told him what had happened that evening. “I’m going over there!”</p>\n\n<p>“No, please, let me handle it.”</p>\n\n<p>“You tried, now it’s my turn.”</p>\n\n<p>“Blake…”</p>\n\n<p>“You coming or not?”</p>\n\n<p>Reluctantly, I followed him out to his car. Blake wasn’t one given to emotional outbursts, but he vented the whole way over about how Maxine was taking advantage of me after all I’d done for her. I didn’t add much; he was saying enough for the both of us.</p>\n\n<p>Loud music greeted us from inside as soon as we’d stepped out of the car. Blake marched to the door and banged his fist on it, demanding that they pack up and get out.</p>\n\n<p>The music continued to thump, the door remained shut, and the only answer we got came in the form of a middle finger appearing briefly through the curtain. I knew it was Maxine’s from the gaudy blue-stoned ring she always wore.</p>\n\n<p>“Give me your key,” Blake said, holding out his hand.</p>\n\n<p>“No, we can’t,” I replied.</p>\n\n<p>“It’s your place!”</p>\n\n<p>“Yeah, but I can’t just waltz in whenever! We could get in big legal trouble if we did that!”</p>\n\n<p>“Then call the cops. We’re getting them out tonight.”</p>\n\n<p>Despite his conviction, we didn’t actually get them out that night, or the next, or even the one after that. </p>\n\n<p>When we called the non-emergency line, we were told that it was a civil matter, not criminal, and therefore their hands were tied. If we wanted Maxine out, we had to file for an eviction with the court. </p>\n\n<p>“Such bullshit!” Blake said.</p>\n\n<p>I agreed, but there wasn’t much we could do except call a lawyer. As a tenant with a lease, Maxine had rights, and we had to prove she was breaking the pre-established rules before we could get her out.</p>\n\n<p>“How do we do that?” I asked our attorney during our initial meeting.</p>\n\n<p>“Keep an eye on things as much as you can,” he advised. “Don’t interact, don’t follow anyone around, keep your distance, but monitor as best you can.”</p>\n\n<p>“Glad it’s something easy,” Blake said with a roll of his eyes.</p>\n\n<p>“Doesn’t have to be twenty-four, seven surveillance, but if you notice windows getting broken or trash piling up outside, make note of it, take pictures. Save any texts or voicemails she sends you. We just need some evidence to put before a judge. The hearing won’t be for at least a month, you’ve got time.”</p>\n\n<p>I hated that we had to go so far. It made me sick to my stomach to think we were being the bad guys. Blake kept me strong, reminding me that I’d done all I could for Maxine. Now it was time to look out for myself.</p>\n\n<p>As one last gesture of goodwill, I sent her another text.</p>\n\n<p><em>We’ve contacted a lawyer to start the eviction process. You’ll be served papers in a couple of days. It doesn’t have to go this far. If you just leave now, that can be the end of it.</em></p>\n\n<p>I didn’t hear back.</p>\n\n<p>Another week came and went with no word from Maxine. We drove by the condo a few times, but there was never really anything to document. Her car was always there, the curtains were always drawn, and the door always closed. She had stopped responding to all my calls and texts completely. I was being stonewalled and there was nothing I could do about it.</p>\n\n<p>My emotions were a roller coaster while we waited for the court date to be set. I was angry and then depressed and then simply exhausted. Blake remained my rock, but there was no denying that the stress of the situation was putting a strain on our relationship. I even had to put our wedding plans on hold while we waited to see how much money we’d have to sink into kicking Maxine out.</p>\n\n<p>We’d just had another heated discussion over the slow progress of the proceedings when my phone rang. The number on the screen belonged to my nosy neighbor, Rita.</p>\n\n<p>“Hi, Cece, it’s me,” she said. “You might want to come check out your unit. I was walking my dog past and, well, there’s a smell. It’s bad.”</p>\n\n<p>The air was thick and tense in our car as we drove over. I didn’t know what to expect, but Blake was convinced that this could be our ticket to getting rid of Maxine. </p>\n\n<p>The condo was quiet, its windows dark, and when Blake knocked loudly on the door, we were met with continued silence and an odor. Even outside, it was strong and sickly sweet. I had to put a hand over my mouth to keep from gagging. Blake knocked again.</p>\n\n<p>“We have to go in,” he said.</p>\n\n<p>“We can’t,”</p>\n\n<p>“Don’t you smell that?” He gestured towards the condo. “They’ve got trash and God knows what rotting away in there! Give me the key, you stay out here. That way, only I can get I trouble.”</p>\n\n<p>“Blake…”</p>\n\n<p>“Cece.”</p>\n\n<p>The longer we argued, the stronger the stench seemed to become, until our eyes watered and we were gagging on our words. Finally, when I couldn’t stand it anymore, I dropped my keys into Blake’s waiting hand. </p>\n\n<p>He shouldered open the door with a loud announcement that he was entering while I reeled back from the rush of air that came out to greet us. I could hear Blake swearing and coughing inside, the sound of flies buzzing, and then a light flicked on in the living room.</p>\n\n<p>Blake screamed and there was a thud. </p>\n\n<p>The odor was all but forgotten as I dashed through the door to find my fiancé with his back against the entryway wall, his face white and his eyes wide.</p>\n\n<p>“Get out!” He shouted at me. “Don’t look!”</p>\n\n<p>It was almost a reflex, to look when he’d told me not to. I wish I’d listened.</p>\n\n<p>A lanky man, no doubt Maxine’s sketchy, junkie ex, was sprawled out on the floor, his face resting in a puddle of vomit. There was an equally disheveled woman that I could only assume was his new girlfriend on the couch. They looked like they hadn’t bathed in days. Both were snoring. Empty cans and bottles and used needles littered the floor. It was no surprise they hadn’t heard us come in.</p>\n\n<p>In the middle of it all, propped up on a chair, was the source the foul smell: Maxine.</p>\n\n<p>Or rather, what remained of her.</p>\n\n<p>Her neck ended in a raw, red stump above her shoulders. Her entire naked front was stained with dark, long dried blood. She was missing her right arm.</p>\n\n<p>Flies droned lazily about the body, crawled across her torn flesh. In stunned disbelief, I followed the progress of one across the room, to a small side table beside the front window. Maxine’s head, now mottled and gray with milky, puffy eyes, was lying on its side. Next to it was her bloated forearm.</p>\n\n<p>The gaudy, blue-stoned ring was still on her swollen middle finger, raised in salute while all the others had been glued down.</p>\n\n<p>Maxine had never sent those crude texts. She’d never sworn at me or taken advantage of me. </p>\n\n<p>With a queasy drop of my stomach, I remembered how I’d been given a glimpse of Maxine’s face when I’d first come around; how pale and glassy eyed she’d been. I remembered thinking how different she’d sounded when she’d yelled at me through the door. I’d thought she’d  been high. </p>\n\n<p>Now, I realized, she had already been dead. </p>\n\n<p>I’d been show her decapitated head. I’d been flipped off by her detached arm. They had mutilated her in order to make me think she was still alive, to buy themselves more time in the condo. I doubted they’d meant to stay so long.</p>\n\n<p>I don’t know how long I might have stood there, frozen in horror, if Blake hadn’t grabbed my shoulders and pulled me back outside. </p>\n\n<p>While I threw up in the bushes, he called the cops, and then we clung to each other while the smell of death surrounded <a href=\"https://authorshcooper.com\">us</a>.</p>\n</div>\n","author":"Pippinacious"}