{"rank":"7","title":"BLACKOUT","id":"8l41ju","url":"/r/nosleep/comments/8l41ju/blackout/","time":"1526934856000","body":"<div class=\"md\"><p>The lights went out during the raid. The whole city was in trouble because of it. No one was safe. The night owl gangs were running amok. The police were off dabbling in whatever mischief could pay more: i.e. turning their heads away from the true crime which plagued this god-forsaken village of a town. But if the drugs or violence didn&#39;t pay the right price, the police were all back on the side of justice. Hell. Sometimes &quot;the side of justice&quot; was only the left up to the criminals. What a way to live, huh?</p>\n\n<p>I pulled my family away from the doors and windows, in case some crazed gang affiliate or cop decided to bust into my house. We went into the cellar via a trap door in the hall. It wouldn&#39;t be noticed by anyone in the dark unless they knew it was there. The serrations matched the lines in the floor perfectly. The only difference was the finger hole drilled into opening side to lift the plank. My wife and I shuffled the kids down as quickly as their tiny feet could flee. </p>\n\n<p>My wife followed. Before I descended, myself, I gave a quick glance at the window in my youngest son&#39;s room. A mooncast shadow whisked by. I hurried down to rejoin my family, pad-locking the door behind me. Once below, I signaled for everyone to huddle together, and to stay as silent as possible until the raid was over. We held each other for about 3 minutes before we heard some rustling on the concrete behind us. A paint can twanged and skidded away from the corner as two distinct footsteps adjusted themselves into an upright standing position. The basement window caught some rays from the low-hanging moon, outside. And I caught a peripheral view of the silhouette of an intruder in my home!</p>\n\n<p>I side-stepped in front of my family, pushing them back toward the stairs trying to maintain their silence. I reached onto one of the shelves that contained all of my work tools, keepsakes, etc. in attempt grab a flashlight. I didn&#39;t look at the shelf; my vision was fixed on the fiend in the corner...he didn&#39;t move. Whether he was malevolent or just a bum who wandered into our basement window when everything went down, I didn&#39;t know. I didn&#39;t care. All I wanted was for my family to be safe. And it was up to me to assure them that I would be their savior.</p>\n\n<p>After some knocking and tinkering for a flashlight, I finally grasped a cylindrical object; I picked it up and started fumbling around, searching for the &quot;on&quot; switch. When I couldn&#39;t find one, I broke the line of sight between me and the invader to hold the object up to the window&#39;s light. I was holding my oldest son&#39;s model airplane we had gotten him for his ninth birthday. He was excited about it when he opened it; he just never got around to gluing the wings on. I&#39;m never getting him a model ANYTHING ever again.</p>\n\n<p>I turned to my family and told them to crouch within the shadow next to the staircase. I grabbed the crowbar, that I knew was on its own rack at the bottom of the stairs. I quietly approached the motionless man, whose eyes gleamed with his own personal fears. The closer I got to him, the stronger the scent of grime and trash grew. I knew at this point, he was definitely a vagrant.</p>\n\n<p>&quot;What are you doing down here?!&quot; I asked in a violent whisper. He said nothing. I raised the crowbar to scare the man. It worked. He shuttered inward. </p>\n\n<p>Still, he said nothing.</p>\n\n<p>&quot;I&#39;ll give you till the count of three to get out of here. Then I&#39;m going to kill you myself!&quot; I threatened with only a quarter intention of following through. I began counting.</p>\n\n<p>&quot;One...&quot; he stood, only whimpering. &quot;Two...&quot; he pushed his arm up toward the window. &quot;Two-and-a-half...&quot; he had to know I was bluffing by now. But by the time I reached three, just his feet were left inside. The smell of fish and garbage remained. As he crawled out, voices surrounded him, as did the shadows of God-knows how many figures. I backed out of the light and listened.</p>\n\n<p>&quot;Over here, boys!&quot; a voice chortled. &quot;Looky. Looky. What have we got here?&quot;</p>\n\n<p>The voices ceased. Followed by the sound of pounding and crunching. Pinging of metal bats. Thumping of tire irons. Spelunking of knives all entering and leaving the man&#39;s body. He kicked violently, suffering! Until...he stopped struggling. I pulled back even more.</p>\n\n<p>The last thing I heard from the voice was: &quot;Hey, man. Gimme that saw.&quot; Then there was that sickening sound of a rubber band being cut through by a dull knife, into a block of wood.</p>\n\n<p>Blood drained from the grass into the window. I ran over to my wife and kids. Fortunately, they had only heard the muffled voices. The feet were dragged through the window, and the light was blanketed by something oblong and bushy. I cuddled my family closely.</p>\n\n<p>After the ruckus settled down. My family and I stayed huddled. My wife started humming lullabies in her frozen, shaky throat. My kids, wet-cheeked from fear, nodded off. I kissed my wife&#39;s forehead and leaned her against my chest. She fell asleep soon after. I tried to keep myself awake for the duration of the night. It was to no avail. I slept until dawn. Final gunshots and squealing of tires woke me. </p>\n\n<p>The sun breached the obstructed window, and I got up to watch that which I had dreaded might never come: daybreak. I pulled myself away from my family to remove the rock or whatever it was stuffed in front of the window. The nearer I got to the window, I saw that it was open. The thing wasn&#39;t sat in front of the window, it was pushed into the window. Now, I smelled rotting fish. I tiptoed closer. I now realized: that thing blocking my view, last night, was no rock or brush or anything of nature. It was...the hobo&#39;s head!</p>\n</div>\n","author":"JGWillikers"}