{"rank":"59","title":"A Wailing Within the Walls","id":"8l4325","url":"/r/nosleep/comments/8l4325/a_wailing_within_the_walls/","time":"1526935216000","body":"<div class=\"md\"><p>I lived in a small flat on the south side of town. Being a young and lonely bachelor, I spent most of my time writing and drinking a many variety of ales and alcohols. The flat, one that could be better, was large enough to fit my needs at the time. I lived alone. I didn’t have many friends, or those that wanted to come and visit. So, I spent most of my nights alone, drinking my beverages by the fire and whistling soft tunes to myself until I fell asleep.</p>\n\n<p>I had to say, I loved the isolation at first. I did not work at the time, which also led to me living in such a small flat. I loved waking up and doing whatever I wanted to do when I wanted to do it. I loved staying in during the cold winter, bundled by the fire with a cocktail to keep me company. It became my favorite pastime, and the more that I thought about it, the less I liked having friends and the less I liked having people around. I just wanted myself, no matter how terrible and insufferable I was.</p>\n\n<p>I lived in the flat for two weeks before I heard the first of the sounds. I sat in my dining room, eating stale bread and cold soup when the scratching began. It caught me off guard and I stopped chewing to take a listen. I sat quietly, hearing the continuous scratching. I at first thought it was above me, so I stood, pacing around the room trying to isolate the strange noise. Then, after so many laps around my dining area, did I realize that the scratches came from inside the wall. On the other side of the wall sat my bedroom and I knew there to be nothing in there. I still investigated. As I thought, nothing. It then began to sink in that the scratching belonged to a critter of some kind. It must’ve been nesting within the attic, must’ve fallen somehow and become trapped within the wall.</p>\n\n<p>A number of ideas ran through my mind as to what it could be. At first, I thought it to be a simple mouse, possibly a rat. I hoped for the former. I tapped against the wall, hoping to startle the creature, and I did. It moved along the baseboards, stirring up dust and whatever else sat within such a tight space. It’s claws, unseen, clacked against the hard surfaces, scratching to get out. As pathetic as it sounds, I believed it to be a good omen for I was a lonely man, living in a very isolated flat. I had no friends, and while I enjoyed my time alone, I found this creature within my walls to be a welcome visitor.</p>\n\n<p>I had a great fear though, a fear that whatever it was, would die within my walls and rot. I’d smelt the stench of death and decay before and it is not one that I wished to defile my nostrils again. Yet, I did not want to report the creature to the landlord. I knew what they would do, kill it, murder it, and leave me alone within the flat once more. So, I did the only thing I could find rational. I grabbed a small bottle opener. It was the only tool that I really kept handy in my home. I began to claw away at the drywall, peeling away the horrible yellow flowered wallpaper, and made a small hole, that of the size of a dime. I put a piece of my stale bread in there and I dripped what little water I could manage into the opening. The scurrying and clawing picked up when I did so, and whatever was stuck in there raced over to the opening and began to feed on my gracious gift. I leaned against the wall, listening to the clawing and the feeding and thinking to myself that I made a new friend and I would keep whatever lived within my walls alive, for I needed the company and wished for it to not perish.</p>\n\n<p>At night, I would plug my small hole because I feared that whatever lived within the walls would break free, possibly chewing around my incision or wiggling its body through. I feared that it would leave or whatever disease-ridden creature lurked in the darkness of my walls would poison me with a horrid virus of some kind. If I wanted to keep it around, it would have to stay in my walls and it would have to abide by my rules. I would look after it though, for it was my friend and I desperately needed the company.</p>\n\n<p>I fed it three times a day. Whatever scraps I had leftover from my breakfast, lunch, and dinner, went right into my small opening. I drank my alcohol, leaning against that wall most of the time, listening to my friend eat and chew. I listened as it scurried around, still trying to find a way out. It didn’t do that for long though, for I believe it gave up on trying to escape and learned that it would live in such a place for as long as it could. I was its caretaker and it understood that I would be all it needed for survival.</p>\n\n<p>This went on for months and I grew to believe that the creature was no mere mouse. I started to wonder if it was a rat, but even then, the clawing sounds grew louder and sounded much larger than I originally thought. I wasn’t sure if the critter was growing or if it was just a trick of my imagination, but I knew that its appetite grew. With that, I increased the size of my incision in the wall by a quarter inch and began to feed my friend much larger portions. He no longer desired bread or vegetables, something that I found strange. So, as any good friend would do, I began to slip meat into the walls. I feared at first that the rodent would not feast on the meat, and that he would choose to let it rot. Yet, as I drank an ale, I listened to the soft munching sounds as the critter fed upon what little beef and turkey I could give him.</p>\n\n<p>Soon though, that was not enough. The creature, something that I knew fairly quickly was not a rodent, began to wail in the late watches of the night. The wailing, so deep and dreadful, carried with it a sadness and a hatred. I felt it within my very soul as it continuously moaned. I lost sleep because of it. I lost my will to love whatever it was that lingered inside my walls. I realized then that I was the insufferable one, and even the beast that lingered in my walls did not want to be around me. It wanted free. I wanted to be free of it, too, but I dared not be alone.</p>\n\n<p>Selfishly, I chose to feed it the same diet that I had been. My friend refused to eat though. One cold night, when the winds roared with a dusty snow, and the fires within my home glowed under a lack of tinder, did I finally have enough of it all. The stench of the meat and drying diary began to fill the air of my home with a horrid stench. It became so wretched. It filled me with a dread that weighed on me, for I never left my flat and became consumed by my friend’s refusal to eat. I tried though. That night, I tried to shove more food into the wall. I tried to drip more water. But alas, it refused it all. Only the deep wailing from within the walls filled the air.</p>\n\n<p>The wailing, so cold as winter’s breath, ripped apart my eardrums. It tore into my mind and seared at my brain. I tried to cover my ears as it grew louder. I began to kick and pound onto the wall, screaming wildly, “Eat damn you! Why won’t you eat?”</p>\n\n<p>Then, the wailing stopped. Everything went all quiet except for the small peppering of ice against my windows. It was then, from deep within my walls, that I heard a voice call in a deep raspy tone, <em>Come to me and see…</em></p>\n\n<p>I stepped back, nervous and petrified that my friend could speak. I asked, being dumbfound, “What did you say?”</p>\n\n<p><em>You heard me, friend. Come hither. For I am hungry and thou hast fed me well thus far…</em></p>\n\n<p>“What…what are you?”</p>\n\n<p><em>Come to me…and see…</em></p>\n\n<p>It was then, as I backed away from the wall and the small incision that I made did I see the glow of a pale blue from within the wall. An orb it was, staring back at me with an iris as cold as the darkest of nights. My breath went still, and my heart pounded within my chest. I broke free of my fear and tried, in that moment, in a haze of rage and confinement, to peel away at the wall. I felt myself confused. I felt myself an idiot. I felt myself lost within my mind and my loneliness. I felt that I had done this to myself and that I had been feeding Mephistopheles himself out of sheer stupidity.</p>\n\n<p>As I tore away at the incision with my bare hands, I shouted with such a rage, “Out, damn you! Out, I say! You are not a friend of mine!”</p>\n\n<p>The wailing began again. It sent goosebumps all over my body and a cold chill down my spine. I did not care. I continued to tear away in such anger and frustration. “Out!” I continued to shout, “Away with you! I dare not feed you again!”</p>\n\n<p><em>You’ve been feeding me…I thank you, friend…How hungry I’ve grown…yet so lonely you’ve become…</em></p>\n\n<p>“Dare not mock me, beast!” I said, tearing away a chunk of the drywall. “Dare not lessen me in my own home!”</p>\n\n<p>Soon, I stood before a great gaping hole. I’d gone wild in my frustration, tearing away at the wall. The hole was four feet wide and four feet tall. Yet, inside a swirling mass of darkness resided. I could not see a thing, for the glowing orb had faded and all that met me within the walls was nothing but shadow. I called out to it, “Leave my home!”</p>\n\n<p>Then, from the darkness, a great wailing came. My flat shuddered and shook with such a force that I thought my world ending. I fell onto my knees, trying to crawl away from the violent noise that roared within my home. The very marrow within the depths of my warm bones cooled, freezing me in place as the wailing continued to grow. Then, just as suddenly as it began, it stopped. I turned, seeing within the great darkness of my wall seven glowing orbs staring right back at me. Their pale blue hue radiated with that of winter. A grey mist flowed from the opening that I had clawed. Tendrils of shadow and arachnid appendages of gloom stretch out from the dark, grasping into what drywall remained, burying themselves deeply into the foundation of my flat. The creature said to me, it’s voice deeper, darker, more sinister, <em>Come to me and see, child…come to me for one last feeding, and I will leave you…I will leave this place and let you wallow alone…</em></p>\n\n<p>“What is that you want?”</p>\n\n<p><em>Come hither…come closer, dear friend.</em></p>\n\n<p>It was as if I were in a trance, for I slid across my aging hardwood, moving closer to my friend. It’s cold stare pierced my heart, causing a cold that I’d never imagine feeling. As I grew closer, I could see that the shadows of the wall were that of the beast, for it was its form. It was a part of the darkness itself. It lived it, breathed it, became it. And in that moment, as I realized what I stared at, did I see a gaping maw open. It glowed within the darkness with the light of hellfire and shadow, and I could see into it. I could see the ends of time and beyond. I could see myself, alone, and in it, I fainted unable to bear such a witness.</p>\n\n<p>As I came to, dawn was breaking. My bottle of ale laid shattered on the floor. My food sat stale and cold atop my dining room table. The hole that I’d dug into the wall stood mighty and proud, but in it, stirred nothing. I could see the wall of my bedroom on the other side completely intact. But yet, as I stood, peering in and clearing my head, did I see a great rot and decay that overtook the innards of my flat. Inside the gaping hole did I see a small withered mouse, and next to it, decaying wood and rotten food, old and dried. I stood dumbfounded. For in that moment, even staring upon the dead rodent, I could still hear the wailing…</p>\n</div>\n","author":"J_M_Novels"}