{"rank":"24","title":"Grandma's Recipes: How to Build your Own Scarecrows","id":"8l4fat","url":"/r/nosleep/comments/8l4fat/grandmas_recipes_how_to_build_your_own_scarecrows/","time":"1526937901000","body":"<div class=\"md\"><p><a href=\"https://old.reddit.com/r/nosleep/comments/4xrnic/grandmas_recipes_seven_years_of_bad_luck/\">Part 4</a></p>\n\n<p>Hey guys! I don’t know if you remember me – it’s been a couple of years. My name is Micah, and when my grandmother died I shared a few recipes from her Grimoire with you guys. At the time, I was quite ignorant about this book and what it meant, but I have since learned more about my family. I apologize for disappearing – I have been quite busy. </p>\n\n<p>We decided not to sell my grandma’s home. Instead, my brother and I live in it and rent out a room to this girl that my grandma used to know. </p>\n\n<p>She’s pretty strange. Says that she’s an alchemist and I always see smoke coming out from under her door. She tends to the garden, and sells the crops at some kind of market. She asks me to help her. Says I have a natural gift for ‘green-spelling’, whatever that is. I think I might ask her out? </p>\n\n<p>This whole town keeps me busy. It’s small, and still very neighborly, you know? People are always asking me to bring them this herb, or that piece of wood, and they bring me all kinds of dishes and gifts in return. </p>\n\n<p>I found this other recipe in the book that I wanted to share with you guys. This recipe was written by my grandma’s cousin, and it tells you how to make scarecrows. They are supposed to protect your home and bring you peace of mind. I think I will try it out next autumn. </p>\n\n<hr/>\n\n<p>How to build your own scarecrow </p>\n\n<p>In order to make a scarecrow, one must not only be a decent green-speller, but also willing to grace the line that separates white magic from the dark. Scare crows were illegal when I was a boy, on pain of isolation (which didn’t ever stop us from making them). </p>\n\n<p>Thankfully the current marquess of Oddfolk recognizes the necessity of these fierce wooden field-guards, especially for those in the Southern part of the Harvestlands where harpies and packing crows are eager to pick fresh pumpkins from the earth. </p>\n\n<p>My cousin Wynne tells me that I always built the most fearsome scarecrows. She flatters me. Nevertheless, I am happy to contribute to her Grimoire. </p>\n\n<p>Gather these materials before you start:</p>\n\n<ul>\n<li>  You must steal a splinter of wood from a fruit-bearing tree. Do not take it from your own land and do not ask for it from a friend. Sneak onto another farmer’s land and take the splinter. Do not leave him or her anything in return and clear your mind of guilt. </li>\n<li>  Two wooden poles for making the frame. Any type of wood will do.</li>\n<li>  A relative, related to you by blood or bind. </li>\n<li>  Used clothes of earthen tones. Avoid wool, and if you must use it – use the prickly, itchy kind that people wear out of politeness because it was knitted by a loved one. You would not want the scarecrow to get too comfortable. </li>\n<li>  Rope. </li>\n<li>  Gather straw or timothy hay. </li>\n<li>  Mead or ale. </li>\n</ul>\n\n<p>(1) Gather your materials and put them under your bed. Wait three nights. Do not make any offerings to the gods during these three days and nights. Instead, you must foam the mead or ale into a cup and focus on the darker dwellers that roam in every house. Imagine these dwellers. Are they demons from your past? Are they the ones that died on this land before you? The ones that died elsewhere, and that you carry around wherever you go? Decide, and offer up your drink to them. You must invoke the darker side of your hearth for this ritual. Do not eat on the third day.</p>\n\n<p>(2) After the three days are over, take your materials out from under your bed and to the plot of land on which you wish to build your crow. Do this at first light, while the harpies still rest in their burrows. </p>\n\n<hr/>\n\n<p>The rest of the text is covered in ink, but I successfully removed most of the stain with a simple concoction of rosewater and silkworms, that I found elsewhere in the book. Unfortunately, random threats and curses appear in the rest of the recipe, for which I apologize. I think that these are a side-effect of the stain-remover somehow, and not authentic. </p>\n\n<hr/>\n\n<p>(3) Place one of the poles into the ground [YOU ARE WORTHLESS] and use the rope to tie the other pole onto it, sideways, in the shape of a cross. </p>\n\n<p>(4) Find the relative that you chose for this recipe and bring them to the site. Ask them for a drop of blood or a clump of hair [better than you are] and plant it into the earth, next to where you are building the scarecrow.</p>\n\n<p>(5) Dress up the scarecrow in the clothes that you picked out for it. Stuff the shirt with the hay that you brought [it smells like autumn and reminds you of your mother]. Make sure that you put a hat on the pole. </p>\n\n<p>(6) 00000000000</p>\n\n<p>(7) Walk around the scarecrow [she weeps for you] and pour the remainder of the mead or ale onto the ground around it. Make sure that the ground is wet [UNDER YOUR BED] all around the creature. </p>\n\n<p>(8) Go back into your home and stay in for the following two days. Watch the scarecrow from the window as often as you can. In time you will [LOOK UP INTO THE SKY] see the scarecrow’s head turning, until its face points towards the window. If you followed the recipe correctly, it will be dark under the scarecrow’s hat, safe for the two eyes that glow like coals. The eyes may not have pupils but [IN YOUR PARENTS] it sees you, and when it does, you may leave you home. </p>\n\n<p>(9) If you failed this recipe, all your crops will be rotten when you step out of your house.  You will feel lost during the rest of the season. Constant fear and dread will rule your hearth and your home. If you succeeded, no birds will pick at your crops, and your enemies will not be able to come onto your land. Your will feel a mellow sort of calm and know that all is well, as you accomplish your goals with ease.</p>\n\n<hr/>\n\n<p>That’s the scarecrow recipe. Again, I’m sorry for the profanity. I’m trying to figure out what belongs in the original text and what doesn’t. Until then, happy green-spelling! </p>\n</div>\n","author":"thelamehelptheblind"}