{"rank":"8","title":"Sharps Container","id":"8l4jlx","url":"/r/nosleep/comments/8l4jlx/sharps_container/","time":"1526938910000","body":"<div class=\"md\"><p>I&#39;ve never been the type of person to do right by others. Even when I do, there&#39;s a selfish reason to it. I give money to my Church, I give blood, I don&#39;t actively shit on others if I don&#39;t need to. I&#39;m not some corrupt politician kissing babies to look good, but I still pretend because I know I&#39;ll never be willing go above that. The reason I give money is so no one said I didn&#39;t. The reason I give blood is purely because it feels good. The only reason I don&#39;t shit on people is because their grief would just annoy me later on. I&#39;m leading with this because I want you to understand that I might not be a great person, but I am not a terrible person. </p>\n\n<p>It&#39;d been a year since I last gave blood. The first time I gave blood was in high school. I was underage so I had to forge my mother&#39;s signature in order to get registered. Even then, I didn&#39;t do it because I wanted to <em>give</em>. I did it because I wanted to <em>take</em>. I loved seizing the feeling of a needle piercing my skin. The alluring pain which spikes during insertion followed by a consistent hum on my arm which relaxes me. I gave more frequently back then, about every half a year. It&#39;s been about 10 years since I&#39;ve started and now I only give if I ever see those big red vans and feel like getting movie tickets or a free shirt. Of course, last week I wanted to go to the movies for free.</p>\n\n<p>The experience was extremely normal when I went in. The nurse lady wasn&#39;t too cute, but I never go in expecting a show with my dinner. She wasn&#39;t ugly in any sense. I guess I&#39;d call her plain. Her hair and eyes were both dead autumn leaves. She had her short hair pinned together. I&#39;d gotten used to seeing the classic scrubs by now. The pen in her mouth collected severe bite marks as she input my info into the computer. Everything about her was clearly boring. As a result, when I sat in the chair and rolled up my sleeves, she surprised me by telling me that I was the first person she was going to prick since training. </p>\n\n<p>I know about the procedures and schooling in handling syringes. I didn&#39;t look it up as a form of torture porn, I just happen to be in the medical field as well. I&#39;ve gone through that education myself, so I understand that even though it&#39;s her first time she&#39;s just as capable as the next person who&#39;s done it thousands of times. All things considering, I was ready. </p>\n\n<p>I&#39;ve a known issue with my left arm having thinner veins than my right arm. Unfortunately, someone was already in the left seat being bled by the second phlebotomist. I never saw her face. Or maybe I did and I just don&#39;t remember it. It hadn&#39;t mattered to me, I just wanted to get my cheap thrills. I sat down and received the hand ball to squeeze. She strapped my arm down and gave me the most flimsy smile. Classic shitty bedside manner. Then the feast began. She started by seasoning my beef with a little booze swab. As soon as I was nice and moist, she brought out the hypodermic spatula. I didn&#39;t let it show, but I felt giddy. She didn&#39;t let it show, but she felt anxious.</p>\n\n<p>The first time she drilled under my flesh is a memory I will never forget. The sweet, familial burning sensation that emanated from the injection zone. I craved this gentle, yet violent mix of pain and pleasure granted to me by this holy item. And I remember the way she muttered &quot;Oh,&quot; to herself before slowly extracting the needle. It seared unnaturally more coming out. She had missed, yet I didn&#39;t mind. I lied and told her I barely felt it. She lined up the syringe at the same spot before piercing me again. Throbbing aches soared through my elbow this time, however the routine joy I once knew in it dissipated. I looked from my arm to her, noticing her furrowed brow and annoyed demeanor. Without removing the syringe this time, she started <em>digging</em> under my skin for a vein.</p>\n\n<p>Another few seconds and I could feel my whole arm screeching in distress. Her vision was hyper focused on getting my blood, so I doubt she noticed me crushing the ball in my hand or the panic on my face. Each time she moved the spike, agony erupted through me. She was stirring my insides straight out of a vulgar hentai; the penetrating instrument gouging a new hole in me. It was unbearable. My vision became oppressed and I refused to move at all for fear of invoking further retaliation.</p>\n\n<p>I can&#39;t recall how long it took, but she finally found a vein. I had endured it. Once it was over, I finally looked at my arm. I was disgusted with the warpath she had left behind. My elbow was purple and the injection site reserved a crater that could probably fit a pencil. The tissue was getting ready to swell and I knew I was going to have to watch over it so it wouldn&#39;t get infected. With a regained sense of boredom, she did her best to clean my wound and bandage it. I was in such a daze that I just got up went home, ignoring my rewards. She didn&#39;t stop me. Probably didn&#39;t care enough to try. </p>\n\n<p>Once I got home, I took a long shower. I didn&#39;t want to deal with my arm so I kept the wraps on. The water threatened to bulldoze the adhesive away, but I made sure to keep it out of range. I slept. I slept for a good three years, only slightly exaggerating. Compared to the rest of the week, it was serene bliss. When I opened my eyes, the first thing I wanted to know was how my arm was. It certainly felt sore and the area around the elbow still looked bruised. I just hoped it wasn&#39;t going to get infected.</p>\n\n<p>I wanted to examine my arm before taking another shower. While rolling out the fabric, I could feel my bruised humanity whimpering underneath. The whole situation pissed me off. Why couldn&#39;t I have gotten a more competent person? Fuck, I could have done it better myself. I may have enjoyed it more too. I couldn&#39;t mull it over too much; once I finished unwrapping my mind went blank. </p>\n\n<p>The carnage under my wrap made me unconciously look away and cower. I fell to the floor and tried to hold back vomit. There was no success. I had to control myself, I had to get the strength to look again. What I found was a lack of flesh where my upper arm and forearm met. I could see my own anatomy, everything surrounded by pus growths. The bandage had stuck to itself and was clumped up inside me. The worst part was the <em>smell</em>. After I noticed it, I started suffocating. I couldn&#39;t breathe; I didn&#39;t want to. My body resisted until I finally gasped for air, but the stench emanating from my limb disgusted me. I&#39;ve been in the presence of cadavers and I&#39;ve done animal dissections, but nothing could&#39;ve prepared me for the sheer strength of rotting skin.</p>\n\n<p>Part of the bandage&#39;s adhesive had stuck to an arterial passage. I could see several vessels on the surface pulsating. Each throb rubbed against the bandage sending prickles through me. Seeing the bandage connected to my subcutis sickened me: it felt repugnant having it inside me to begin with. I had to get it out. Some blood had congealed to the bandage making it specially viscous. I don&#39;t know why I thought it&#39;d be like pulling off a bandage. I tried to tug it gradually at first. There was no pain, maybe because it was moist with blood. When it got stuck, I did what any intelligent primate would do and just ripped it off, muscle fibers included.</p>\n\n<p>Trickling blood spewed from the tear in my muscle. The pain was inconsequential at this point. I threw the bandage away and tried to hold the blood back with my fingers. A bulbous sac of pustule that had taken cover under the bandage threatened to discharge on me. I stopped holding my blood back when I noticed it. I refused to have that foul piece of shit pop. The blood trickled down and pooled in the crater of my arm. The stream became sluggish until only a rivulet of blood flowed out. </p>\n\n<p>How did it get to this? I was expecting a rash, not a festering amalgamation of blood and pus, only half covered by my epidermis. I prayed to a God I&#39;ve never met to fix my arm, begging for something - anything - that could change it. I wanted to panic and make believe none of this was real, yet I knew that it was. After throwing up to the point of dry heaving a little more, I finally got to the point where I could make a call. The ambulance arrived quickly. I may have been in shock because I couldn&#39;t answer any of their questions adequately. I faintly remember the changing scenery as I was processed and given a room. </p>\n\n<p>They cleaned me up here. I don&#39;t remember the specifics, but I know someone lanced and drained all the pus. My arm was disinfected and bound so it wouldn&#39;t deteriorate and I was supplied with fresh blood. That was a couple days ago. They kept me here for examination and to make sure I wouldn&#39;t develop a fever. I was tied down at first so I wouldn&#39;t scratch at my arm. Irritation was largely what I felt for these last couple of days. Mostly annoyed at how everything transpired. They tell me I&#39;ll never be able to become an Olympic weightlifter, but I&#39;m content with that. They can also implant some stuff on my arm to let it not look like a hobo&#39;s butthole so that&#39;s cool. </p>\n\n<p>The worst part since then has been all the paperwork and calls I&#39;ve needed to make. I ought to be grateful I didn&#39;t lose my arm, but I almost wish I had. People may have felt sorry and given me some extra space. I used time in between menial tasks to write this. With all the bullshit I&#39;ve been through this past week, I just want to unwind. Nevertheless, there&#39;s still matters I need to attend to. I&#39;ve been blessed with so much that I need to give back. Or at least I want to pretend to give back. </p>\n\n<p>Once I&#39;m fit, I plan to get rid of this excess blood. Realize that I am not doing it to contribute to society. I&#39;ve used this phrase jokingly before, but I finally mean it this time: I&#39;m not mad, I&#39;m just bit disappointed. Anyone could have a bad experience giving blood. This time, it just happened to be me. I will reclaim the gratification in giving blood. And you should too.</p>\n</div>\n","author":"roild"}