{"rank":"3","title":"0504","id":"8l50qk","url":"/r/nosleep/comments/8l50qk/0504/","time":"1526942931000","body":"<div class=\"md\"><p>‘We’re all in this together now, 0504. Now, there’s no turning back.’</p>\n\n<p>I don’t know where, who, or what I am. I woke up this morning in some dingy cell far removed from the very comfortable bed that I remember falling asleep in last night. The walls are nothing more than bricks painted white and stained with what looks suspiciously like splotches of rusted red blood. The door is nothing more than a slab of metal with two ports; one at eye level, the other at waist level, both closed and locked from the other side of the door. The floor is just dull concrete, stained just like the walls. I don’t have a toilet or a sink or anything necessary to basic human survival. Only an old, crack mahogany desk, a shitty, too-small chair, the uncomfortable cot I woke up on, and the laptop that I’m currently writing this on. That’s it, that’s all. Unfortunate, but having a place to take a dump isn’t one of my top priorities at the moment. Number one would be figuring out where the hell I am. I’m not tech savvy and this computer doesn’t seem to be connected to the outside world anyway so I guess that’ll remain a mystery for now. Number two would be figuring out WHO the hell I am. I try to remember something, anything, but it’s like any memories from before I woke up are either a fragmented, undecipherable mess, or locked away. The only thing that I can remember clearly is a number.</p>\n\n<p>0504.</p>\n\n<p>What it means, I got no fucking clue. It’s tattooed on my wrist though, so obviously important.</p>\n\n<p>Oh yeah, the tattoo. Or tattoos, rather. There’s three of them; the number, some strange symbol that I’ve never seen, and some word that I can’t read. Bréagadóir. No idea what it means. If anybody is reading and can read whatever language that is please, let me know. There’s too many mysteries happening at once. A solution to at least one of em would be nice. </p>\n\n<p>That aside though, my current situation as I understand is this:</p>\n\n<p>· I’m locked in a cell somewhere</p>\n\n<p>· I have no idea how I got here</p>\n\n<p>· The door is locked from the other side</p>\n\n<p>· I’m not alone. Every now I can catch the faint sound footsteps from the other side of the door and quiet grumbling. The first time I heard them I beat on the door and called for help but that proved to be a mistake. Something struck the door with enough force to leave a visible dent on my side. Whatever’s put there I sure as hell don’t want any part of it.</p>\n\n<p>· I can’t remember anything about myself. When I try to remember the only thing that comes to mind is that damned number, 0504, whatever the fuck that means.</p>\n\n<p>Whatever is going on, if this is some joke, I don’t think it’s funny. It’s kinda fucking creepy in all honesty. If that’s what they were going for then they did a good fucking job, Jesus. Not much is happening but I’m on edge. This place doesn’t feel right. The second that door opens I’m getting the fuck out of here and booking it to the nearest town or city and catching the first flight to somewhere far, far from here. Until that happens, I’ll keep updating this. If anyone is out there and reading this, maybe they can help me out. Would be mad appreciated.</p>\n\n<p>Signing off for now. Hopefully someone sees this.</p>\n\n<p>- 0504</p>\n\n<p>P.S. – Just gonna go with 0504 as my name for now. I don’t know what bréagadóir means and I’d hate to start calling myself it and find out that it means fucknugget or something stupid like that.</p>\n\n<p>14132108002024190008 122120081306</p>\n\n<p>YTHGIMESURZALNKXWVQPOJFDCB</p>\n</div>\n","author":"patient0504"}