{"rank":"179","title":"Hi, my name is Kyle and I'm a blood addict.","id":"8l51h1","url":"/r/nosleep/comments/8l51h1/hi_my_name_is_kyle_and_im_a_blood_addict/","time":"1526943121000","body":"<div class=\"md\"><p>This may take awhile.  I can barely think in all this light.</p>\n\n<p>I’m a junkie.</p>\n\n<p>I’ve been this way my entire life.</p>\n\n<p>I accept this.</p>\n\n<p>Mom was a drunk.  She raised me up to be one.  I had colic when I was a baby; mom would put Jim Beam in my bottle to get me quiet.  Just a little, my sweet pea, just so you’ll sleep awhile…</p>\n\n<p>Obvious next step was pot.  I was twelve.  My friend DJ stole one of his brother’s joints and we smoked it together.  I’m not sure if I actually inhaled that first time, but pretty soon I got the hang of it.</p>\n\n<p>High school was where the real troubles began.  I was pretty much able to keep the drinking and smoking under control while still living a stable life.  I got average grades, held a job at a grocery store collecting shopping carts, and even played baseball on the JV team.</p>\n\n<p>The trouble came when I took a hard slide into home plate trying to score a hero run.  Meniscus tear.  Now, you have to understand, this was south Florida, home of the infamous PMCs: Pain Management Centers.  Or as most of us junkies have come to know them as – the pill mills.</p>\n\n<p>I’ll admit, my pain needed some management.  Rehabilitation was twelve long weeks and it was agony.  When you can’t walk, all you think about is the pain.  And I needed something now.</p>\n\n<p>Enter the exciting world of oxycodone.</p>\n\n<p>Percocet was the first brand they tossed in my lap.  It was heaven. I went from unbearable pain to ecstasy.  The doctor gave me a prescription for 60 10mg/325mg tablets.  Once daily with a meal, he told me.  He barely looked up from his computer.</p>\n\n<p>The unbearable pain tapered off after about two weeks, but the Percs stayed.  I liked how it made me feel.  Went I ran out, I went back to the mill and asked for more – easy peasy.</p>\n\n<p>The rest goes the way you’ve heard it a million times before.  Grades went to shit, dropped out the following semester.  Insurance finally cut me off and that’s always a bad move when someone’s in full blown addiction.  Started using heroin pretty soon after.</p>\n\n<p>After the insurance cut me off AGAIN, this time for the Subutex (to help with the dope sickness), not even my alchy mom could take it anymore.  She caught me looking through her dresser for hidden cash, a practice I uncovered pretty early on, and finally she put me out.</p>\n\n<p>Then it was panhandling, turning tricks, strong arm robbery of little old ladies, you name it.  When you gotta get your fix, people aren’t people to you anymore.</p>\n\n<p>If I could give you only one reason to never get into drugs it would be the dope houses.  Mostly abandoned, but sometimes someone is actually paying for these pieces of shit.  They are spots where junkies like me can shoot up and not have to worry about getting rousted by the cops.  They are place you never want to be.</p>\n\n<p>You see the truly ugliest side of humanity inside them; the beatings, the stabbings, the rapes, all right before your eyes.  Why would I ever venture into these houses of horror – that’s dope for ya.</p>\n\n<p>I’ve had my fair share of experiences inside.  But there’s only one I’m here to talk to you about today.  Like your neighborhood bar or coffee shop, dope houses have their regulars.  If I stayed in a place long enough, you started to see some familiar faces.  Sometimes you’d talk to them, sometimes you find they hadn’t moved in a day or two, got a hold of some bad shit, and you’d drag them out to the sidewalk to get picked up eventually.  You knew these people.</p>\n\n<p>But a lot of times you’d get the nomads.  The drifters.  The one and done’s.  These were the people you typically had to watch out for.  They came into your place to run off with someone else’s shit.  When you saw somebody die inside, most likely it was by a nomad’s hand.</p>\n\n<p>One day, while I’m looking for a vein, I hear footsteps coming up the stairs.  Creeping is a better way to put it.  I could tell by the way this person was walking they weren’t there for anything good.  I was sitting on a mattress in a bedroom with about four other people when I see this guy through the crack in the door.  He pushes it open.</p>\n\n<p>He was a junkie alright, but something was different.  Fucker was wrapped from head to toe in a long black trench coat, something that would’ve stood out anywhere in Florida.  He wore gloves on his hands and a floppy hat that obscured most of his face.</p>\n\n<p>I played dead at first, just watched while the creep knelt down beside one of my roommates, lost in his heroin induced stupor.  I knew something was really wrong when he didn’t make a move for the near-unconscious man’s pockets.  If he isn’t robbing than what the fuck is he doing?</p>\n\n<p>He went around the room scattered with bodies, doing some kind of check on each of them.  None seemed had what he was looking for, until he got to me.  I’m still playing dead this entire time, hoping against hope I’ll pass his smell test and he’ll let me be.</p>\n\n<p>While he looks me over I do a pretty good job of keeping my eyes nice and glazed.  He peers into my eyes, and this is where I start getting really scared.  He doesn’t seem like a dope fiend desperate for a fix, no, this guy had a look of agonized hunger I’ve never seen before in my life.  The look of a man that’d cut his own mother’s eyes out for a drink of water.</p>\n\n<p>My heart starts beating faster.  He feels it.  He looks down at the small leather pad I have my syringe resting on and looks back at me.</p>\n\n<p>“You shoot yet,” he asks me.</p>\n\n<p>There’s no point in lying now.  A junkie knows what a used needle looks like.</p>\n\n<p>I gulp.</p>\n\n<p>“Just take it,” my voice no louder than a hushed whisper.</p>\n\n<p>I take the syringe and push it closer, gesturing to it with my hand.  This guy was weird, and as much as I wanted to get high, at that moment it wasn’t worth losing my life over.</p>\n\n<p>The creep didn’t even look at the needle.  He wasn’t looking at my eyes either.  At the time I didn’t know what he was looking at on me, but now I do.</p>\n\n<p>He was looking at my neck.  My veins were bulging.  Probably from the mix of dehydration, lack of meat on my bones, and the adrenaline pulsing through me.  He noticed.</p>\n\n<p>All he said to me was two words – I’m sorry.</p>\n\n<p>I didn’t have time to speculate what he was apologizing about before he lunged at me and took a bite out of my neck.  It didn’t hurt at first.  Truthfully, I was so damn surprised I didn’t even know what was happening.  But when something warm started gushing down my neck, that’s when it all slammed home.</p>\n\n<p>I started to scream.  The man fell on me and in his frenzied hunger I didn’t have the strength to fight him off.  I screamed again, louder and full of agonized terror.</p>\n\n<p>This fucker is drinking my blood – the last thought I had before it all went black.</p>\n\n<p>I woke up a day later in a hospital.  Bandaged all around my neck with blood bags depleted beside my bed.  Apparently, the only reason I was still alive was because I was screaming so loud somebody heard me from the street and called the police.</p>\n\n<p>They didn’t catch the guy who did it.  They usually don’t unless the crime takes place in one of the ritzier neighborhoods of south Florida.</p>\n\n<p>After awhile they released me and put me in a shelter.  I’d been through the process before, but it never lasted long.  Gotta stay sober in the shelters and before I even got out of the hospital I was thinking about where my next fix was coming from.  Anything I had back at the dope house was gone for good so I was going to have to start from scratch.</p>\n\n<p>A day of panhandling would probably get it done, so I wandered over to the outdoor shopping mall nearby and began my spiel.  It was going well enough, I was on track to hit my number, but it must’ve been so damn hot that day.  It was only May, but I swear it must’ve been a hundred degrees at least.  It felt more like a hundred and fifty honestly.</p>\n\n<p>And the sun was so bright.  As a south Florida boy, I’ve been out in the sun most of my life, but something was different.  It was filling my entire line of sight.  Even when I closed my eyes, I could feel the rays burning into my retinas.</p>\n\n<p>I couldn’t stand it after awhile, I didn’t know what was happening, I just knew I had to find some darkness.  I took shelter in a shaded alleyway behind a line of dumpsters and dozed off for awhile.  Sleep was a relief.  No dreams.  Just soothing blackness.</p>\n\n<p>I woke up sometime after dark and felt like a million bucks – by a junkie’s standards anyway.  I counted the money I made earlier in the day and found I had just enough to pull a favor with a guy I usually bought my shit from.</p>\n\n<p>I got my bag and snuck into a park to shoot up and stay for the night.  My dealer was nice enough to front me some clean syringes and a lighter so I got right to work.</p>\n\n<p>After I cooked up the dope and got my needle ready, I squeezed my belt around my arm and watched the veins poke into view.  I suddenly had this image of all the red, salty blood coursing through them.  It was as if the blood was what I needed, not the dope.</p>\n\n<p>I brushed the thought off and shot up.  It was almost like the first time…</p>\n\n<p>I drifted back to sleep.</p>\n\n<p>Any junkie can tell you about dope sickness.  It’s something like the worst stomach flu you’ve ever had multiplied by a hundred.  Well, that next morning, it was that times a million.</p>\n\n<p>It didn’t come on slowly either, more like a gut shot that pulled me back into reality.  I immediately threw up.  It felt like I was on fire.  Like the sun was roasting me alive.  I looked at my skin, it was tomato red.  How could this be?  It couldn’t even be the afternoon yet, how did I get sunburned so badly?</p>\n\n<p>I mustered enough strength to crawl under a bench, anything to get out from directly under the sun.  You cry a lot when you are an addict, I don’t care how tough you are, and that day I sobbed under that bench like a little girl.  I just wanted to die.  Never in my life had I felt so sick, so hot.</p>\n\n<p>I was on the verge of a total breakdown when it came to me:  blood.  I just needed some blood and everything would feel better.  Why was I thinking this?  It didn’t make much sense, but I knew it was what I had to do.</p>\n\n<p>On a computer at the public library, I found a blood bank was only three and a half miles away.  it took everything I had to walk in that bright, hot sunlight.  It felt like my insides were roasting under my skin, but I just kept reminding myself that the blood would make it all better.  Along the way I stopped at a supermarket and stole a package of knives.  I was going to need them.</p>\n\n<p>When I finally made it to the blood bank, I meandered outside for awhile, figuring out what I was going to do.  I’d done my fair share of robberies, but never a holdup before.  I was scared but my need for the blood squelched any inklings of walking away.  I decided to just improvise.</p>\n\n<p>Clearly the blood bank is not a common target for stickups.  The young twenty something nearly pissed herself when this manic addict came barreling through the door.  She didn’t get it at first.  I held the knife to her and said I needed blood and even then she tried to give me her money.  I threw it on the floor and repeated that I just needed the blood.</p>\n\n<p>I can’t imagine what was going through her mind when she led me to this narrow freezer lined with bags and bags of blood.  My heart fluttered in my chest.  I almost forgot there was a robbery going down.</p>\n\n<p>I took all the bags I could carry in my hand.  I dumped the contents into a plastic bag on my way out and made a run for it.  The sun was melting away my skin, it felt like, but I didn’t care.  I had my blood.  I had it.</p>\n\n<p>Once I got far enough away to not attract any attention, I hid behind a stairwell of an office park with an overhang, protecting me from the sun.  I reached into the plastic and pulled out a bag.  I looked at the label.  One part stuck out:  BLOOD TYPE: O</p>\n\n<p>Before, I thought blood was blood was blood.  Now, I remembered the different types.  Like different flavors.  The hunger inside me raged.  I couldn’t take it any longer.  I bit off the cap and put the clear tubing to my mouth.  It was like a straw.  And just like that, I began sucking.\nIt reminded me of a thick milkshake, it has to fight its way to the top of the straw.  But I persisted, and finally, I tasted it.</p>\n\n<p>It was better than heroin.  I hadn’t even thought about heroin all that day.  As the cool, salty, delicious blood ran down my throat, it was like getting hugged by an angel.  I felt fuzzy all over, my soul filling with the sweet sweet nectar.  I drained the bag without stopping for a breath.  I needed more.</p>\n\n<p>I drained two more bags before I finally started to feel like myself again.  It was the best meal I’d ever had.  I didn’t think I need another thing for the rest of my miserable life.  I laid down on the concrete ground and smiled for the first time in I don’t know how long.</p>\n\n<p>But remember, I’m an junkie, and junkies are always thinking about the future.  My thoughts soon turned to where I was going to get more blood once I ran out.  I figured I got real lucky holding up the blood bank earlier and making it a common occurrence wasn’t going to end well for me.</p>\n\n<p>The remaining bags lasted three more days.  But unlike heroin, the need for more blood came on like getting hit by a truck.  It wasn’t sickness; it was the feeling of dying.  Of being burned alive.</p>\n\n<p>I tried a dope house first.  I found a young girl, maybe twenty, lying on her side with chunky vomit pooling at her mouth.  I made a small slice and began sucking on the wound.</p>\n\n<p>Sour, contaminated, disgusting…</p>\n\n<p>It made sense then, why the nomad picked me.  Something about the dope made the blood go bad.  I knew it wasn’t going to work.  I needed clean blood and nobody in any of these places was going to cut the mustard.</p>\n\n<p>I almost got busted when I the stole the stuff from the medical supply store.  The manager had his fist clenched around my shirt but it tore right off as I ran out the door.</p>\n\n<p>I wanted to kill the first kid I got to.  Grabbed him right off his bike and suffocated him with a bag until his lips were blue.  When he was unconscious I wrapped a tourniquet around his arm and found a vein.  I poked a needle through that connected straight to one of my bags and began to draw.</p>\n\n<p>Two bags worth I took.  That’s when I thought of the possibility of opening his throat and taking it all.  I knew it wasn’t going to be enough.  I’d have to do it again and again.  But I couldn’t bring myself to kill the kid.  Addiction had never had such a strong grip on me but I still couldn’t do it.</p>\n\n<p>I couldn’t do it the next time either.  Or the next time or the next time or the time after that.  I wanted to.  Fuck, how I wanted to.  I thought of all the blood inside them and salivated.</p>\n\n<p>The problem with stealing people’s blood is though, word gets around.  They are looking for me now.  People stopped walking the streets at night.  And that’s the only time I can hunt.  It’s not possible to go out during the day anymore.  I can’t take the pain.</p>\n\n<p>I’m getting weak now.  Not even the darkness is a relief.</p>\n\n<p>It was a last resort, but I decided I’m going to go visit mom tonight.  I know she couldn’t handle me anymore, but I’m still her son and I know she’ll take me back.  She’ll be able to help me.</p>\n\n<p>I can only hope she has enough, but I’m a junkie, and for us junkies it’ll never be enough.</p>\n</div>\n","author":"bigrig42788"}