{"rank":"0","title":"Waking dreams","id":"8l586b","url":"/r/nosleep/comments/8l586b/waking_dreams/","time":"1526944812000","body":"<div class=\"md\"><p>This dream pattern is very common for me but I find it very odd and quite terrifying. Reality or not, I still can not tell. I transcend into a deep sleep as usual my room is dark and peaceful. I wake up from my sleep in my bed everything looks the same but am I awake or am I sleeping? </p>\n\n<p>As I walk into my sisters bedroom somethings not right she’s not there. I look to see if my parents are in bed they are not there either. I hear movement in the house though I get scared and run to the door I am locked in. I am unable to get out the doors or windows. I wander to the basement to see if I can get out that way. There is a trail of blood leading down the basement steps but it looks as if this is my only way out.</p>\n\n<p>As I transcend into the basement I hear languages being spoken I can not understand. The smell is awful but I continue towards the exit. As I get closer to where the bulkhead is located it is blocked by what looks like a black plastic entry. I enter and what is before my eyes in indescribable there are various machines, sharp objects, the Wall is lined with clocks and scientific data. What odd is my family is on these machines one of them being my dad on an in place cycle pedaling at ridiculous speeds but something peculiar is that my family does not seem to be harmed but just won’t communicate. I try to communicate but words won’t come out of my mouth and I can no longer move a muscle. A man in a lab coat appears out of the corner with a syringe then shoots it into me I nod off and then am placed on one of these machines. I got multiple cords attached to me, an IV, and a tv screen displaying all my memories in front of me. I experience different effects as he puts different chemicals into the IV I feel bugs under my skin, I see demons and the darkest things imaginable. I lose sense of who I am and all memories with the last chemical he puts into the IV..... then I reawaken in my bed.</p>\n\n<p>I believe I am awake now in the real world so I walk down stairs and get a glass of water. But someone knocks on the door as I am getting water and I get scared. The knocking gets harder and harder until I grab the car keys take the back door and sprint into the driveway. I am running to my car as this man is yelling to me for help but something feels wrong I have a belief he doesn’t actually need help. I drive out of my driveway and he follows in his car. I brake down about two miles down the road and he stops near me continuing to beg for help so I run on foot. He continues to chase me down until he gets me, he ties a rope around my neck until I pass out saying “I told you to help me!” I wake up in the trunk tied up unable to move or speak as he beats the shit out of me with a mask on. After this he pours gasoline all over me shuts the trunk and burns the car with me in it I am able to physically feel the heat and pain as this occurs. Shortly after I am surrounded in flames and in pain I wake up in my bed. </p>\n\n<p>This time I wake up and it’s the morning my family’s home I eat breakfast and life is normal. Is this another dream, or am I really awake now?</p>\n</div>\n","author":"Steezking1"}