{"rank":"2","title":"Stadler House: Book One: Chapter Eight","id":"8l5bks","url":"/r/nosleep/comments/8l5bks/stadler_house_book_one_chapter_eight/","time":"1526945647000","body":"<div class=\"md\"><p>The open refrigerator door illuminates the darkened kitchen as Rodney searches for a midnight snack with a look of disappointment, “Come on.” Rodney pushes item after item aside in a desperate attempt to end his quest for the perfect snack.</p>\n\n<p>Anna quietly enters the kitchen through the door to the Game room. She stops to study Rodney from the opposite side of the center island. She places the glass of milk on the countertop. </p>\n\n<p>Rodney smiles and withdraws a gallon of Ice Cream from the freezer. In a single motion, he grabs a spoon from the dish strainer and digs into the Ice Cream. He inhales a huge spoonful of creamy delight. A look of euphoria crosses his face and he breaks into an enthusiastic dance.</p>\n\n<p>“You’ve always liked the cold. Haven’t you, Rodney?” Anna words startle Rodney. He spins and stumbles into the counter, “Damn it, Anna. That’s why no one likes you. You’re so damn creepy.”</p>\n\n<p>Anna smirks at his response, “Does the cold remind you of the day you died skating on the lake?” Rodney’s expression turns to anger. Anna circles the center island as Rodney stomps after her, “Your friends should have been more careful.”</p>\n\n<p>Anna pauses and feigns an expression of deep contemplation, “You were the only one to survive, weren’t you?” Rodney drops the Ice Cream and lunges for Anna, but stops to collect himself, “How do you know about that?”</p>\n\n<p>“We know, you fell in, and died,” Anna Begins, “but those fucking paramedics stole you from us.” Rodney shakes his head in defiance of her cold-blooded words, “They couldn’t revive any of the others.” Rodney notices his breath in the air as he speaks, “What’s going on? Anna?”</p>\n\n<p>Rodney steps away from Anna and rounds the center island of the kitchen to keep his distance from the peculiar girl. Anna stops and lowers her head in front of the open refrigerator door. He notices his hands beginning to tremble as the temperature of the room continues to drop. </p>\n\n<p>Rodney closes his eye, but when he opens them he finds himself on the ice side by side with his friends. Linda, his sister, slides ahead of him laughing. A smile curls the corner of his lips as he recalls her grace on the ice. A tear falls from his face as she leaps into the air, “She would have been a star. She was so gifted.” </p>\n\n<p>Anna watches on the bank of the lake, “Exactly what made you so special. Surely she should have survived instead of you.” He continues to watch the memories flashing before his eyes, “She was so beautiful.” “We know and agree,” Anna shrugs.</p>\n\n<p>Rodney lowers his head only to look up to his left as his childhood friend, Larry, rushed past him across the ice, “Catch me if you can, Rodney?” He smiles until the worst part of the memory strikes, HARD. Rodney rushes to his friend’s side, as the three children collide and crash down hard enough on the surface of the ice that it shatters.</p>\n\n<p>Rodney’s ears fill with the memory of the screaming parents rushing across the ice to try and save the three before the darkness of the frozen depths can claim them. He feels himself once again sinking quickly into the depths of the lake. </p>\n\n<p>Rodney remembers reaching out to the others as he was pulled from the frigid waters. He watched helplessly as the blackness of the frozen lake sucked Linda and Larry down into its abyss. “Yet, you were the one they saved. Why? Your sister would have had a great future and Larry would have gone on to greatness, but you…” Anna growls.</p>\n\n<p>“You stole their future. They died. You lived and what have you done with that gift?” Anna glares at Rodney from across the counter.  “Shut your mouth! I loved them both,” Rodney yells defiantly against the accusations of the girl. </p>\n\n<p>Anna looks in the refrigerator and pulls out a juice pack, “You don’t deserve to live. You killed them.” “Stop it,” Rodney yells as he slams the spoon down on the central island. “You killed her,” Anna chuckles. “Anna, stop,” Rodney demands as he storms towards her. “You’re a killer… A fucking child killer, Rodney,” Anna shrugs. \nRodney dives across the counter at Anna, “You Little Bitch! I’ll kill you.” </p>\n\n<p>Anna ghoulishly grins as she slurps at the contents of the juice pouch, “Stupid Boy.” Rodney’s expression turns to shock as he passes through the smoke-like form of Anna and slams into the open refrigerator sending its contents flying in all directions across the kitchen.</p>\n\n<p>Rodney shakes his head and looks to Anna from inside the\nnearly empty refrigerator. Anna looks disappointed with Rodney and kicks the refrigerator door closed on him. The refrigerator door clicks and locks closed. Anna turns the light off as she exits the kitchen, “Now that was cold.”</p>\n\n<p>Rodney screams in the darkness of the inside of the refrigerator, “Someone please open the door!” He makes a fist and punches the interior of the door repeatedly, “Please let me out!” Terror fills his thoughts as he hears the compressor and interior light go out, Please, someone… help me.” </p>\n\n<p>Time slowly passes for Rodney as the cold silence slowly exhausts the young man. “I deserve this,” he whispers thinking of Linda and Larry. The sensation of suddenly plummeting into the darkest abyss fills his last thoughts as the cold coupled with the lack of air finally claims him. </p>\n\n<p>Across the group home and two stories above the kitchen. Dr. Stadler steps out of the master bedroom and raises his flashlight. He becomes upset as the light does not work. In frustration, he shakes it resulting in it finally turning on. </p>\n\n<p>“You know this is bull, right?” Dr. Stadler yells at the master bedroom door. “You got it, honey, I have faith in you,” Maggie calls out from the other side of the door and beneath the protection of her thick comforter. “Bitch,” He whispers as he returns his attention to the long corridor before him. </p>\n\n<p>Dr. Stadler walks down the darkened landing onto the second floor. He turns to face the first of the children’s rooms. He aims the illumination of the flashlight down the hallway to see if any of the children are out of their rooms, “Hmm all in bed.” </p>\n\n<p>Lighting STRIKES and Thunder BOOMS nearby outside startling the doctor, “Shit!” He realizes quickly that he has pissed all over himself. He looks down as disappointment fills his face seeing the pool spreading out below him. </p>\n\n<p>Dr. Stadler continues his inspection of the children’s rooms. He reaches Emily and Anna&#39;s room first, “Emily? Anna?” He slowly opens the door, “Are you two awake?”</p>\n\n<p>Dr. Stadler sees Emily sound asleep in her bed, but Anna’s bed looks empty, “EMILY, wake up?” Emily awakens startled by the doctor’s words, “what’s going on?” Dr. Stadler gestures to the empty bed, “Where’s Anna?”</p>\n\n<p>Emily rubs her eyes, studies the empty bed, and shrugs, “I guess I fell asleep after she went to go get us a drink. Is everything okay?” Dr. Stadler assumes the confusion comes from him waking her, “Yeah, no worries just checking in on everyone.” Dr. Stadler walks to her bed and gently tucks Emily into her bed. </p>\n\n<p>Emily sits upright in her bed as he reaches the open door, “She’s kind of strange, isn’t she?” Dr. Stadler chuckles, “We all have our quirks.” Emily smiles before flopping back onto her bed, “Anna maybe weird, but we&#39;re family.” Dr. Stadler smiles and looks back to Emily, “That’s right family first.”</p>\n\n<p>Dr. Stadler closes the door. He next stops outside of Julie&#39;s room and knocks. He waits a long moment before knocking again, “Julie, you okay?” He becomes concerned as more time passes and opens the door. </p>\n\n<p>Dr. Stadler opens the door and peers inside to see if Julie may be asleep. Her bed remains empty which puzzles him, as he looks to his watch realizing it was well past eleven o’clock. “Where the?” He puzzles to himself. He closes the door and looks down the hall to the next room.</p>\n\n<p>Dr. Stadler makes his way quickly to the next room and throws open the door, “John? You boys in …” He stops cold seeing none of the boys are in their room asleep as they should be by this time. He pauses to think aloud, “Game room.”</p>\n\n<p>Dr. Stadler closes the door and rushes down the hallway. He moves down the staircase to the first floor, “They are all gonna be grounded if they&#39;re still awake.” He crosses the house and enters the kitchen. He stops in his tracks seeing the mess in the kitchen.</p>\n\n<p>He sees melted ice cream on the counter and can smell the caramel sweetness in the air. He becomes aware of the contents of the refrigerator scattered across the floor with juice pooled and sticking to the floor. Finally, he notices the refrigerator has been unplugged and his face contorts with rage as he stomps to the door to the game room.</p>\n</div>\n","author":"roger75lee"}