{"rank":"16","title":"Great Cherokee Spirits Linger: The Sole Shell Lake Survivor","id":"8l5by8","url":"/r/nosleep/comments/8l5by8/great_cherokee_spirits_linger_the_sole_shell_lake/","time":"1526945750000","body":"<div class=\"md\"><p><a href=\"https://www.reddit.com/r/nosleep/comments/8hoyfh/great_cherokee_spirits_linger_the_screaming_storm/\">1</a>\n<a href=\"https://www.reddit.com/r/nosleep/comments/8j4nkv/great_cherokee_spirits_linger_they_shouldnt_have/\">2</a></p>\n\n<p>Shell Lake is a forty minute drive from my house. It’s located just on the outskirts of Tulsa County in Sand Springs, Oklahoma. The lake is a small part of the Osage Reservation, one of about twenty-six in Oklahoma. The lake is home to a dam and a cave with prehistoric paintings on the walls. Back in the days when western outlaws were a reality, the Dalton brothers used one of these caves as a hideout.</p>\n\n<p>I’ve been to the lake before as a young teen when I had friends, a dream to travel the world, and a father. It was always fun, a nice way to refresh ourselves after long days of hot humidity. The kind of humidity that I’ve had literally break cameras. Personally, I’d never noticed anything off about the lake, and never felt threatened. But if I were to go back now, I would stay a few feet back from the water, just to be safe.</p>\n\n<p>Just an hour away from the lake is Blackburn, where Dusty and his family went hunting. Every fourth of July they’d traditionally celebrate at the lake, the last fourth before Dusty passed was the last time Kasey and Tom saw Dusty alive. Hank saw him on Easter Sunday one last time a few weeks before.</p>\n\n<p>This 4th of July, we continued the tradition, Hank and Tom brought their wives, Kasey brought his new dog, an old border collie who’s cute, brown eyes popped out against its black and white fur. Things were finally getting normal between Kasey and me after our trip to Will Rogers Turnpike. He would look through Dusty’s stuff, show the rest of us, and we’d sometimes talk about it. It made Hank uncomfortable though, so I tried to keep it to a minimum.</p>\n\n<p>We all sat by the lake in lawn chairs, some people grilled hot dogs and soon we were watching fireworks.</p>\n\n<p>“Y’know he loved this. He was a homebody but he still liked to get out here by the lake.” Hank told me. He was talking about Dusty.</p>\n\n<p>“Yeah, he told me a lot about it. He was excited about this one.” I sipped on a coke, even though it left a funny texture in my mouth, and didn’t really quench my thirst. Hank and I really connected for the first time then. He might’ve resented me, subconsciously or consciously, I’ve heard I had a similar relationship to Dusty as he did. Before they all split up, Hank was who Dusty went to for any conversation he felt was “intellectual”.  But under the colorful explosions in the night sky, I guess we realized how alike we were, and it only made sense that we’d become friends. Kasey was like a big brother trying to be a father, but Hank was going to be a best friend soon enough.</p>\n\n<p>I didn’t often think about why I always made friends with people much older than me. It’s just always been a fact. Maybe I just was a suck up to teachers, and that’s stuck around. Maybe I’m an old soul or I look for my dad everywhere. I admit, I always felt like I wasn’t on the same level as a lot of them. At least at first, then I started to get to know them.</p>\n\n<p>It was nine-thirty when we smelt the smoke. This was during one of Oklahoma’s more exceptional droughts, the last time it rained was probably Dusty’s funeral, and there was a concern for grass fires. That concern turned out to be entirely valid, as across the lake we saw a patch of grass up in flames. Quickly we rushed around the perimeter of the lake, water bottles in hand. No police were called, this was the fourth of July in Oklahoma. We mutually agree we’ll handle it ourselves until we can’t.</p>\n\n<p>We all knew the damage a small grass fire could make, small towns around here have been decimated by these dry, windy conditions. Hank, Kasey, Tom and I all ran around the fire, emptying dozens of water bottles to control it.</p>\n\n<p>As it started to die we were shocked to see what at first we thought was a trick of the smoke. An average sized man curled up on the ground in the nucleus of the fire. His skin was red and as hot as the land around him, but nothing, not even the grass, were burned. But we did later learn his clothes burned off without burning his skin.</p>\n\n<p>Baffled, and concerned, we helped him to the rest of the group that stayed behind. Someone had a pair of swim trunks we gave him after he cooled off enough to touch. His rounded face was dominated by his large, brown eyes that solely expressed fear.  He was unresponsive, near catatonic and just… Preoccupied, looking around, assessing the situation. After ten minutes of getting him to sit down and drink water, I finally thought to call an ambulance.</p>\n\n<p>The first thing he did was try to stop me, he insisted he didn’t have the money for an ambulance. I couldn’t help it though, his heart rate was entirely irregular and he was literally just sitting in a fire. I didn’t know what else to do.</p>\n\n<p>His name was Jorge; he told us while eating all of our uncooked hot dogs. He came to the lake two days ago with his friends Randye and Diego.</p>\n\n<p>“A big storm took them. We got in the middle of something.” He said, continuing to act strangely and sporadically. Struggling to process what he’d been through.</p>\n\n<p>“What storm?” Hank asked and we all wondered.</p>\n\n<p>“We’ve been in drought forever,” Kasey added, feeding his dog a hot dog.</p>\n\n<p>Before he could tell us the rest of his story, though, the ambulance arrived, followed very closely by a black dodge challenger. As they took Jorge away, I saw something I missed before. A perfect symbol, one circle with two perpendicular triangles protruding from the side. I could tell it was recently scarred on to his back. It was still red and slightly protruded from the surrounding skin. It was just like Dusty’s, according to Tom. </p>\n\n<p>I was sure of only one thing; I had to hear the rest of what happened.</p>\n\n<p>Finding Jorge wasn’t as easy as I first thought, I knew nothing about him except his name and that he was around my age, not to mention I felt dirty snooping around. Narrowing and broadening my searches on the internet I found nothing. Except a single, now defunct, facebook page calling for help finding Diego Ramirez and Randye Lurie. Through this, I contacted their families, corroborated what I knew of Jorge’s story, which I learned they didn’t believe when he told them.  And through them, I was able to schedule a meet up with Jorge.</p>\n\n<p>He was right under my nose the whole time, he lived in an apartment just five minutes away from where I live. Hank, Tom and I met him at El Guapo&#39;s. Kasey was spending his time looking into Dusty’s notes still, but I’ll get into that later.</p>\n\n<p>Jorge was significantly more clothed than the first time we met him thankfully. He thanked us for helping him.</p>\n\n<p>“I wouldn’t have made it if it wasn’t for you guys. I saw some…” He hesitated on his words, like he was stopping himself from swearing, or letting out information too fast. “I’m losing myself, you guys are the only ones that want to hear me out… Why?” He looked like what he said was true, he was tired, on edge. Like how I was after my journey into tunnels, but much worse. We wanted his story, so we gave him Dusty’s. He listened intently, soaking up every word. His eyes narrowed when we finished by mentioning Dusty’s scar, the symbol I hadn’t seen until Tom drew what he remembered on a napkin right there. Jorge wasted no time getting to his, filled with an energy from the much-needed confirmation.</p>\n\n<p>He told us everything over chips and salsa, about the green sky, the screeching thunder, the wind, and the water in the lake shook.</p>\n\n<p>“Like a big drop of water kept hitting the middle and rippling across the whole lake. Except there was nothing hitting the water. It just… Moved.”</p>\n\n<p>Even worse, he was entirely alone in the middle of a lake. He struggled to get to the closest shore. The air around him vibrated, lightning struck closer and closer with each minute, screeching hid in the thunder. All of it was familiar. Except he didn’t feel like something was after him, he felt like he was trespassing on a private fight.</p>\n\n<p>“Like when you see a couple fighting in public. Like… The lake fought the storm.”</p>\n\n<p>Fish came closer to the surface, swimming in strange cyclon shapes. The storm absolutely drenched him, and he could feel the lightning getting closer.</p>\n\n<p>“Then my oar gets caught on something. I try to pull it out and something pulls back. I look in the water and there’s some metal looking tentacle things are tearing into it. Like knives. And it these knives just keep going down the whole thing, I can’t even see the bottom.”</p>\n\n<p>This was something entirely new to us, we hadn’t seen anything like this.</p>\n\n<p>“Damn thing took my oar and I can’t get into the water because…” He stuttered, “well you know!”</p>\n\n<p>He curled into a ball in the kayak, covering his ears as the water growled and the sky screamed like a hundred ravens. The lightning struck, he suddenly smelt wet rot- fish. His boat shook as something pushed it. </p>\n\n<p>Again, but water splashed. </p>\n\n<p>Again, but an eight-foot wave threw itself at his boat, flipping him over.</p>\n\n<p>“I heard something big talking in the water, clear as day. ‘This is no place for you, tsalagi’, and like, ‘uc-tina’. Weird thing is, I knew what it meant, but I didn’t know what I was hearing. Some other language I suddenly, just, understood.”</p>\n\n<p>Later we realized it was the word Uktena.</p>\n\n<p>“I just felt scared, I just felt the fish tickling me. Then heard a screech, looked back up, and next thing I know, I was on fire two days later.”</p>\n\n<p>It was a lot to absorb, I’m already awkward, but I barely managed to order a quesadilla, totally flustered in front of the waitress. A damned thing too, I used to have a crush on her in high school. Haven’t had a crush since then, actually. </p>\n\n<p>“So…” We didn’t know where to start. It was a lot to take in, how much could we trust him? Did he trust us? Did trust matter?</p>\n\n<p>“It spared me.” He said, letting go like he was holding his breath.</p>\n\n<p>“I… Yeah. It did. But that storm, I’m worried about the mark on your back.” I tried to explain that he might be marked for death, but who was I to confront a man with his own mortality.</p>\n\n<p>“What? You think ‘cause your friend died and had one I’ll die from it? I mean if you’re right I’ll die when I’m old anyway.” Jorge got defensive, entirely fair. We were making a pretty big assumption.</p>\n\n<p>We spent the rest of the time off of the topic, I’d crossed a line. We agreed to call each other if anything came up, and went our separate ways.</p>\n\n<p>Kasey called me late that night, I was struck with anxiety as soon as I woke up, it had to be something big. It was then he told me about Uktena, and what Dusty had to say about it. Over the phone, Kasey read:</p>\n\n<p>“In my investigations, I’ve found that Shell Lake has become the current home of a spirit the Cherokee held up as a protector, and colonizers feared. I now question if this spirit will save me from my curse. Permanently, so I don’t have to keep running, I’ve been running for decades. I’m tired, and I’m scared that the wind will howl on my grave forever.”</p>\n\n<p>This was the first reference we found to Dusty’s death really being a curse, and the first thought we had of him trying to escape his fate. So while we had hoped Jorge would live long, we had reason to believe he wouldn’t if he didn’t do whatever Dusty did to extend his life.</p>\n\n<p>It was a race against the clock, a race against the Wind, we had to save Jorge. </p>\n</div>\n","author":"That_Guy_Of_Place"}