{"rank":"150","title":"The Caldera Paradox","id":"8l5dhz","url":"/r/nosleep/comments/8l5dhz/the_caldera_paradox/","time":"1526946137000","body":"<div class=\"md\"><p><strong>STARDUST INDUSTRIES PERSONNEL REPORT</strong>:<br/>\n“Exploration of Anomaly CS01”<br/>\n<em>Submitted by Vanessa Koeppel, Lead Researcher, Quantum Studies Division</em></p>\n\n<p><strong>OVERVIEW</strong>: Anomaly CS01 is an opening approximately 152 centimeters tall in the wall of an office belonging to Stardust employee C----- Sarkin, biologist. The opening appears to be a small tunnel made of black glass. The tunnel extends approximately 12 meters into darkness, after which nothing is visible, even with manufactured lighting. Samples taken from the site have defied categorization and do not appear to be made of minerals found on Earth. </p>\n\n<p>Sarkin reported the existence of the anomaly on --/--/---- and requested a change of office. The biology division has since been relocated to a temporary location. Security guards have been stationed outside the door of Sarkin’s office in the event of a breach and the anomaly is under 24/7 camera surveillance. </p>\n\n<p>Investigations into the properties of Anomaly CS01 are now under the jurisdiction of Ted Caldera, Senior Researcher, Quantum Studies Division.</p>\n\n<p><strong>EXPLORATION 1</strong>: performed by M------ VECKMAN</p>\n\n<p>The first authorized exploration of Anomaly CS01 was conducted at --:-- on --/--/---- by M------ Veckman, engineer. Veckman was equipped with a full body biohazard suit, a night vision visor, a two-way communications link in her helmet, and a Stardust-issued nanorifle. A 300-meter steel cable was attached to Veckman’s belt and connected to a cylindrical post bolted in the mouth of the anomaly. Ted Caldera, P------ Khatri, and S------ Wu, all from the Quantum Studies Division, supervised the entrance of the tunnel and served as Veckman’s radio contacts.</p>\n\n<p>Veckman entered the anomaly and walked the 12 visible meters until she could no longer be seen in the darkness. She immediately turned on her comm link and began broadcasting to Caldera, Khatri, and Wu back at base.</p>\n\n<p><strong>MV</strong>: I’ve entered the zero visibility zone of the anomaly. Night vision reveals another several meters of tunnel, maybe ten or so, before opening up to another light source. It’s pretty bright, can’t you see it from where you’re standing?</p>\n\n<p><strong>TC</strong>: Negative. Keep going, M------. But stay cautious.</p>\n\n<p><strong>MV</strong>: I’m moving into the light source now. It’s… huh. It’s a computer screen. Team, the tunnel opens up into an office, almost identical to Sarkin’s. There’s no one else here. Everything’s covered in a layer of dust and the overhead lights are burnt out. Some of them are loaded with fly corpses, or shattered entirely.</p>\n\n<p><strong>SW</strong>: What does it say on the screen?</p>\n\n<p><strong>MV</strong>: Nothing. It’s just a blue screen of death. Should I go any further?</p>\n\n<p><strong>TC</strong>: For now, yes. Keep going until the cord runs out, or until it looks too unsafe to continue.</p>\n\n<p><strong>MV</strong>: Roger that. I’m leaving the office now and moving into the hallway.</p>\n\n<p><strong>PK</strong>: Do you see any signs of life?</p>\n\n<p><strong>MV</strong>: Negative. The hallway is lined with office doors, but all their lights are out and I can’t detect any movement. Not even so much as a rat or insect. The walls out here are blanketed with the same dust as the first office, although… hang on. On closer inspection, the surface isn’t covered with dust, but rather some kind of gray mold or fungus.</p>\n\n<p><strong>TC</strong>: Keep your distance, Veckman. I’m sure that goes without saying.</p>\n\n<p><strong>MV</strong>: Of course, sir. I’m continuing down the hallway. There’s a pair of double doors at the far end, but they’ve been torn off their hinges. Beyond them appears to be some kind of atrium. I’m entering the atrium now.</p>\n\n<p><strong>PK</strong>: It would be best to keep your weapon ready.</p>\n\n<p><strong>MV</strong>: Way ahead of you.</p>\n\n<p><strong>SW</strong>: Can you describe what you see in the atrium?</p>\n\n<p><strong>MV</strong>: It’s a big space, probably about half the size of a football field. There’s what looks like a reception desk near the wall, and a semi-circle of couches, but everything is half rotted and covered in that same gray substance. There’s also some flaky pieces on the ground that could have been potted plants at one point. On the wall there’s several indents where letters might have hung. The first one appears to be an S… oh.</p>\n\n<p><strong>PK</strong>: What?</p>\n\n<p><strong>MV</strong>: It says “STARDUST.”</p>\n\n<p><strong>TC</strong>: Fucking hell.</p>\n\n<p><strong>SW</strong>: What is it?</p>\n\n<p><strong>TC</strong>: That’s our facility. There’s a fucking parallel universe in there.</p>\n\n<p><strong>PK</strong>: But… that violates the parameters of the Caldera Paradox.<sup>1</sup></p>\n\n<p><strong>TC</strong>: I know what the Paradox says, I wrote the goddamn thing. Clearly I was wrong.</p>\n\n<p><strong>SW</strong>: Or somehow we made first contact without realizing it.</p>\n\n<p><strong>MV</strong>: I’m not sure who we could have made contact with in this place. There isn’t a person here. Maybe there was, at one point, but this building hasn’t seen use in a long time. I’d estimate a few decades, maybe more.</p>\n\n<p>[<em>The comm picks up a distant clatter.</em>]</p>\n\n<p><strong>TC</strong>: What the hell was that?</p>\n\n<p><strong>MV</strong>: First sign of movement since entering the anomaly. It’s coming from somewhere beyond the atrium. Should I keep going?</p>\n\n<p><strong>TC</strong>: Yes. Investigate the source of that sound.</p>\n\n<p><strong>SW</strong>: Ted…</p>\n\n<p><strong>TC</strong>: Just be hyper vigilant, you hear me? Book it the second you feel it’s unsafe.</p>\n\n<p><strong>MV</strong>: Understood. I’m crossing the atrium toward a second set of double doors, where the sound appears to have originated. These ones used to have a lock mechanism of some sort but it’s now defunct. I’m pushing through and entering the next room.</p>\n\n<p><strong>PK</strong>: Jesus…</p>\n\n<p><strong>TC</strong>: What?</p>\n\n<p><strong>PK</strong>: If this place is a mirror of our own facility, she’s just entered the Applied Research labs.</p>\n\n<p><strong>TC</strong>: And?</p>\n\n<p><strong>PK</strong>: In our reality, at least, there’s a ton of unstable experimental samples in those labs. And if this other reality has experienced some kind of cataclysmic event…</p>\n\n<p><strong>SW</strong>: Who knows what’s been unleashed in there.</p>\n\n<p><strong>TC</strong>: Veckman? I’m giving you five minutes in there, tops. Then get back to base stat.</p>\n\n<p><strong>MV</strong>: Roger that. It does look like this space used to be a series of labs, but everything’s blackened and warped. There’s a ton of glass and debris on the floor. It’s like a bomb went off in here. Everything’s accrued the same substance as the previous rooms, so presumably whatever happened in here took place awhile ago. </p>\n\n<p>[<em>The same clatter occurs, louder this time.</em>]</p>\n\n<p><strong>TC</strong>: Did you -?</p>\n\n<p><strong>MV</strong>: I heard it. It’s coming from one of the damaged labs. I’m going to investigate.</p>\n\n<p><strong>PK</strong>: Dear God, I’m nervous.</p>\n\n<p><strong>SW</strong>: You’re not alone.</p>\n\n<p><strong>MV</strong>: [<em>hushed</em>] Entering the lab now. The place is utterly destroyed - there was probably a lot of research material in here, but it’s been blasted. The walls are seared with blackened patches of that unknown substance. There’s… hang on. There’s a shape in the corner. Human, from the looks of it. Curled up in the fetal position. They’re wearing one of our biohazard suits. They… look familiar. It’s….</p>\n\n<p><strong>TC</strong>: What is it? Who did you find?</p>\n\n<p><strong>MV</strong>: …Ted Caldera.</p>\n\n<p><strong>TC</strong>: Yes, I’m fucking listening, Veckman. Don’t keep me waiting.</p>\n\n<p><strong>MV</strong>: No, sir, I mean that’s who I’ve found. It’s… you. He’s a little older, and it looks like he’s got some kind of skin condition, but it’s unmistakably you. He has that scar on his eyebrow and the missing bit of his ear where you got shot -</p>\n\n<p><strong>TC</strong>: That’s enough, Veckman. Get the hell out of there.</p>\n\n<p><strong>MV</strong>: But sir -</p>\n\n<p><strong>TC</strong>: <em>Now</em>, dammit. Report back to base immediately. Don’t touch anything and whatever you do, don’t talk to him. You hear me?</p>\n\n<p><strong>MV</strong>: Roger that. Heading back to base now.</p>\n\n<p>Veckman returned to base without incident. She was immediately escorted to Medical to scan for any conditions she may have acquired during Exploration 1. Her biohazard suit had experienced unexplainable levels of decay, although Veckman herself displayed no signs of unusual illness. She was cleared with a clean bill of health and returned to duty.</p>\n\n<p>Exploration 2 is currently in the planning stages, with the goal of extracting the Caldera duplicate from the alternate facility.</p>\n\n<p><strong>END OF PERSONNEL REPORT</strong></p>\n\n<p><sup>1</sup> According to the Caldera Paradox, any dimensional travel requires a form of contact with the dimension in question, but such contact cannot first be made without dimensional travel.</p>\n\n<hr/>\n\n<p><strong>STARDUST INDUSTRIES PERSONNEL REPORT</strong>:<br/>\n“Interrogation of Anomaly TC02”<br/>\n<em>Submitted by Vanessa Koeppel, Lead Researcher, Quantum Studies Division</em></p>\n\n<p><strong>OVERVIEW</strong>: Anomaly TC02 is a human male, age unknown, with DNA composition identical to Ted Caldera, Senior Researcher, Quantum Studies Division. The anomaly appears to be afflicted with an unknown condition in which the skin on its face and neck has begun to decompose and turn various shades of gray. Due to concerns of contamination, it has not been removed from the biohazard suit it was wearing when extracted from Anomaly CS01 during Exploration 2. Anomaly TC02 is currently contained in a high security vault in Sector --- and monitored by camera surveillance 24/7. </p>\n\n<p>Anomaly TC02 is capable of human speech and has repeatedly asked to see Senior Researcher Caldera since its extraction. After taking numerous safety precautions, including inoculations and a reinforced biohazard suit, Caldera agreed to an interrogation with Anomaly TC02 at --:-- on --/--/----, attended via radio by the members of the Quantum Studies Division. </p>\n\n<p>The transcript is as follows.</p>\n\n<p><strong>TC</strong>: You know, I’ve imagined this conversation for years now. First contact. Bridging the gap between our dimension and another. But here I am, <em>finally</em>, and I’m at a goddamn loss for words.</p>\n\n<p><strong>TC02</strong>: You could start by telling me… who you are.</p>\n\n<p><strong>TC</strong>: I’m Ted Caldera. But I assume you already know that.</p>\n\n<p><strong>TC02</strong>: Oh… sorry. I thought it was you. Me, I mean. It’s just so hard to focus.</p>\n\n<p><strong>TC</strong>: Why is that?</p>\n\n<p><strong>TC02</strong>: It’s the spore… it makes everything… fuzzy. Haven’t felt like myself. Not in a long time.</p>\n\n<p><strong>TC</strong>: The spore, huh? I assume that’s the shit you’ve got all over your skin. </p>\n\n<p><strong>TC02</strong>: Our skin.</p>\n\n<p><strong>TC</strong>: You may look like me, buddy, but whatever you’ve got growing all over you is one hundred percent your own. What happened to you? Hell, what happened to that entire facility? Our operative said you were the only sign of life she could find.</p>\n\n<p><strong>TC02</strong>: We were stupid. We thought… we’d cracked the paradox. The way to open the door. What a fucking joke.</p>\n\n<p><strong>TC</strong>: You can’t crack the Caldera Paradox. That’s what makes it a paradox. There’s no workaround. Believe me, we’ve tried.</p>\n\n<p><strong>TC02</strong>: Then you didn’t try hard enough. </p>\n\n<p><strong>TC</strong>: Listen, you arrogant piece of -</p>\n\n<p><strong>TC02</strong>: Oh, shut up. This is like… the pot calling its reflection black. </p>\n\n<p><strong>TC</strong>: Tell me, then. Tell me the great secret that unlocks our precious little paradox.</p>\n\n<p><strong>TC02</strong>: Energy.</p>\n\n<p><strong>TC</strong>: Humor me. Be more specific.</p>\n\n<p><strong>TC02</strong>: All of our postulates depended on some sort of… sentience. Someone on the other side to receive our signal and bridge the multiversal gap. But energy… has no need for sentience. You can’t use it to create a bridge. But enough of it, focused and harnessed and directed, could… create a hole. Like dynamite blowing up a cave wall.</p>\n\n<p><strong>TC</strong>: You’re fucking insane. Obviously we’ve entertained the energy theory. Who hasn’t? But it’s impossible to put into practice. The sheer amount of power needed to rip even a tiny hole would level a small country. It’s not on the table. We would never consider that a viable option. I wouldn’t allow it.</p>\n\n<p><strong>TC02</strong>: Obviously I’m the version of you that did.</p>\n\n<p><strong>TC</strong>: You’re full of shit. You wouldn’t -</p>\n\n<p><strong>TC02</strong>: June --, ----. The Stardust Initiative. We used our personal… hadron collider installed ten years ago in the deserts of New Mexico. Approval came from the higher ups… the government had no idea. The idea was to keep the project as contained as possible. But it didn’t work. There was a rupture. We got our hole, all right… just took out most of the western hemisphere in the process.</p>\n\n<p><strong>TC</strong>: Stop. </p>\n\n<p><strong>TC02</strong>: Don’t try to tell me you didn’t at least entertain the notion.</p>\n\n<p><strong>TC</strong>: Shut your FUCKING MOUTH!</p>\n\n<p><strong>TC02</strong>: You’d think the nuclear apocalypse would have been the worst part… but what came through the hole was even worse. It was like one of the plagues of Egypt. Darkness that covered everything, that you could feel. It left its spores everywhere… it aged us, decaying us alive. Decomposition in a matter of days. It ate and it ate until we were spores too, then there was nothing… an empty world.</p>\n\n<p><strong>TC</strong>: I call bullshit. You’re still alive, aren’t you?</p>\n\n<p><strong>TC02</strong>: Barely… it’s in me too. I might be the last of my kind. The difference between endangered and extinct.</p>\n\n<p><strong>TC</strong>: You may have fucked up your world, pal, but ours is still alive and kicking. So you can do your decomposing here. Holler if you think of anything important we ought to know. Otherwise I think we’re done.</p>\n\n<p><strong>TC02</strong>: You’d… leave yourself to die here, Ted?</p>\n\n<p><strong>TC</strong>: For the last time, motherfucker. <em>You’re not me</em>. You made your choices and now you’re rotting for ‘em. So forgive me for not being sentimental. [<em>To radio team</em>] This session is over. I’m coming out.</p>\n\n<p>Senior Researcher Caldera reported to Medical immediately following these events and received a clean bill of health. Anomaly TC02 has not spoken since the interrogation. Its skin ailment appears to be worsening, and its vital readings indicate a dramatic lowering of body temperature. The anomaly will continue to be monitored for any deteriorating health conditions.</p>\n\n<p><strong>END OF PERSONNEL REPORT</strong></p>\n\n<hr/>\n\n<p><em>The following is a transcript from an audio file titled “evacuation.wav.”</em></p>\n\n<p>“This is Vanessa Koeppel, Lead Researcher, Quantum Studies Division, Stardust Industries. I’m making this recording instead of filing an official report because an emergency has occurred at the facility and there’s no time for the usual formalities. </p>\n\n<p>Approximately twenty minutes ago, there was a breach in the containment unit of Anomaly TC02. Its unknown skin condition, referred to as ‘the spore’ by the anomaly, ate through the material of its biohazard suit and began to grow exponentially, covering the containment unit and decomposing the vault door. Anomaly TC02 is presumed dead. The cameras picked up its collapsed suit, filled with shapeless gray material, before they were covered by the spreading unknown substance and visibility was lost.</p>\n\n<p>The facility has gone into automatic quarantine mode. The emergency shutters have come down over every door and window leading outside, effectively trapping myself and the other employees still in the building. I had the foresight to put on a reinforced biohazard suit, but given the state of Anomaly TC02, I’m not optimistic at its structural integrity. </p>\n\n<p>I’m entering the offices of the Quantum Studies Division to find my fellow employees. The spore doesn’t seem to have reached this part of the facility yet, but I can’t find any trace of my coworkers… hang on. There’s some noise coming from down the hall. I’m going to investigate.</p>\n\n<p>Update: I have found Senior Researcher Ted Caldera and Assistant Researcher P------ Khatri. Both have barricaded themselves in Caldera’s office. I can see them through the glass in his office window. I… oh God. Khatri is covered with the spore. It’s traveled up both arms and spreading on his face. Caldera seems to be clean, for the moment, but neither man is wearing a biohazard suit and that spore spreads <em>fast</em>. </p>\n\n<p>Hang on. Caldera’s seen me. He’s shouting something to me.”</p>\n\n<p>“[<em>distantly</em>] For the love of God, get out of here! Get to that fucking tunnel! Those bastards blew a hole in our universe but it can’t be the only one. Get to the other facility and find a way out.”</p>\n\n<p>“Sir, I… I can’t leave you here.”</p>\n\n<p>“[<em>distantly</em>] Fucking hell, Koeppel, just go!”</p>\n\n<p>“Researcher Khatri is… God help me, he’s disintegrating. His hands and lower arms are turning into shapeless masses and falling to the floor in clumps. He’s screaming. I… I can’t be here anymore. I’m going. I’m going.</p>\n\n<p>I’m on my way to the Biology Division. They were removed from the facility after Anomaly CS01 appeared, they should be safe… I can’t say the same for us. I hope Caldera is right about there being another hole. I’m dead if he’s wrong. We all are.</p>\n\n<p>The Biology offices are empty. I don’t know where the security guards have gone but they’re no longer stationed in front of Sarkin’s office. I’m looking inside now. It doesn’t look like the spore has reached this area yet… I should be safe to access the anomaly. It’s a tight fit, but I can make it through. </p>\n\n<p>I’m cutting off this recording until I reach the other side.”</p>\n\n<p><strong>END OF RECORDING</strong></p>\n\n<p><em>The following is a transcript from an audio file titled “exodus.wav.”</em></p>\n\n<p>“This is Lead Researcher Vanessa Koeppel, Quantum Studies Division, resuming recording. I’ve reached the facility on the far side of Anomaly CS01. The room I’m in now is exactly as operative Veckman described it during Exploration 1: devoid of life, lights out, computer with blue error screen. The spore has densely covered every surface, but it seems inert, unlike the spreading substance back at the other facility. I’m going to retrace Veckman’s footsteps and see if there is a hole to a third facility. One that hasn’t been infested by the spore.</p>\n\n<p>I’m valuing speed over caution right now. As of this moment, I can confirm Veckman’s observation that there appears to be no sign of life in this facility. I’m now entering the atrium and heading for the labs. Given the nature of the materials contained in those labs in our own facility, it seems likely that a hypothetical second anomaly could have formed there.</p>\n\n<p>It’s so quiet in this place. No central air, no conversation. Even my footsteps are barely audible on the spore-covered floors.</p>\n\n<p>Update: I’ve arrived at the labs. Everything here has been destroyed, almost beyond recognition. I can make out a few doors still standing but most have been blasted off their hinges or turned to twisted hunks of metal. I’m going room by room and checking for any further anomalies. So far I haven’t found anything except rubble and the moldy remains of a few larger machines. This division is fairly large so it’ll take awhile to investigate them all.</p>\n\n<p>I’ve reached a large office that would have belonged to the Director of Applied Research back at our own facility. The office has a sizable glass window that looks out on the city below. I’m going inside to see what’s happened to the rest of this world. I… oh God. Oh sweet mother of God.”</p>\n\n<p>[<em>The sound of retching.</em>]</p>\n\n<p>“It’s <em>everywhere</em>. Every building, every street, every tree and car. What’s left of them. The spore’s eaten away at everything. It’s like this huge blanket of darkness over the entire city, like… the entire world’s turned into a silhouette, no features at all, just gray. It’s in the sky too. The clouds are black. Like storm clouds, but they’re not big and swollen. Just a flat black surface with streaks of gray. I can’t see a single person out there. Chicago is gone. Oh God, there’s no one left.</p>\n\n<p>I… I have to stop. I can’t record anymore. I need to find that second anomaly.”</p>\n\n<p><strong>END OF RECORDING</strong></p>\n\n<p><em>The following is a transcript from an audio file titled “evaporation.wav.”</em></p>\n\n<p>“[<em>shaky</em>] This is Vanessa Koeppel, former Lead Researcher, Quantum Studies Division. I don’t think that division exists anymore. I don’t think the facility does either. I’m the only one left. And probably not for much longer.</p>\n\n<p>It’s in me. I can feel it. My biohazard suit has already started to decay, and somehow the spore has gotten in. I can feel my skin crumbling from the inside out. And I can sense the thing growing. It’s alive. It’s hungry, it has intentions. It’s a sentient organism and it wants to consume me, like it’s consumed everything else. I don’t know where it came from, but we brought it here, and now it’s all that’s left.</p>\n\n<p>It’s been three days. I’ve searched this facility from top to bottom looking for that anomaly. It doesn’t exist. Or if it does, it’s hiding itself too well. I haven’t eaten in all that time and I’m getting weak with hunger, on top of whatever this spore is doing to my body. One way or another, I don’t think I’m going to last the day.</p>\n\n<p>There’s so much I wanted to do. So much we could have accomplished. I wish I’d been able to complete my research. I wish I hadn’t given up my faith. I wish I’d proposed to you when I had the chance. I wish I’d kept in touch with my mother. I wish it didn’t take dying to realize how important those things were to me.</p>\n\n<p>Oh God… the gloves on my biohazard suit just disintegrated. Turned into gray sludge right in front of me. I can see my bare hands and they’re covered in the spores. Now my fingers - sweet Jesus, they’re crumbling, they’re breaking off and dropping to the ground, they’re turning into dust and mold - I can feel it spreading up my arms now - it’s so cold - oh God, oh God, it’s on my throat, it’s in my mouth - I - I -”</p>\n\n<p>[<em>A dry, rasping choke.</em>]</p>\n\n<p><strong>END OF RECORDING</strong></p>\n\n<hr/>\n\n<p><em>The preceding pieces of evidence were provided through a series of cryptic directions, sent to me in a private message through a dummy account. Following the directions brought me to a safe deposit box at a small bank in coastal Massachusetts. Inside the box was a flash drive containing the above files and a single text document reading: “FROM A FRIEND. MORE TO COME IF I’M SUCCESSFUL.”</em></p>\n\n<p><em>I did some digging into Stardust Industries and discovered that it was a fairly new science facility in Chicago dedicated to theoretical and applied physics research, with branches focusing on biology and anthropology. Two years ago the entire facility was deemed an “ecological threat” and put under quarantine by an organization named Rosen Corp, although oddly, this event did not make many headlines; the only recorded instance of the quarantine can be found on an online newspaper in an article by local journalist Renee Farmer. In it, Ted Caldera and Vanessa Koeppel are among the names of those speculated to have perished in the incident. The article was expunged from the internet shortly after I discovered it. The spore itself appears to have been neutralized, as despite its exponential nature of growth, there have been no further signs of contamination in the last twenty months.</em></p>\n\n<p><em>I don’t know who this mysterious “friend” is, or how they acquired these files, or where they may be now. I don’t know who is behind this enigmatic Rosen Corp or why it keeps cropping up in these investigations. All I do know is that I can’t give up the search. I’ve already unearthed signs of unusual activity here in town and will follow up as new developments arise.</em></p>\n\n<p><em>To my “friend,” if you’re reading this - thank you. I hope to hear from you again.</em></p>\n\n<p><a href=\"https://www.facebook.com/davidfarrow5734\">DF</a></p>\n</div>\n","author":"-TheInspector-"}