{"rank":"2","title":"Sleepless Grace","id":"8l5vxn","url":"/r/nosleep/comments/8l5vxn/sleepless_grace/","time":"1526950765000","body":"<div class=\"md\"><p>The following is a story my cousin Mika told me about why he was gone for almost a year. I don&#39;t know if I can believe him, but he&#39;s never given me a reason not to trust him. Either way, he&#39;s seemed so...distant since he got back, almost like half of him is somewhere else. Something happened to him this past year. Something.</p>\n\n<p>Even with his earbuds in, every soft text message tone sounded like someone trying to steal cash out of the register. It never felt unlikely, gas stations off the highway in invisible towns seemed to attract the oddest strangers. Mika’d only worked in two, one down in his hometown as a high school kid with too much energy and too little to do, and again here outside college. Working hours took some schedule shifts, classes were unpredictable. Nobody lived in the town save for students and dealers who tended to keep to the shadows. The traffic was from road travelers. Big pickup trucks driven by men in love with the open road. Sometimes minivans smelling of poorly planned family road trips and spilled coffee. It was always a boy and a girl and a dad and a mom, white skin with sun bleached hair and names like Sharon or Cody. It was a societal stop zone, either going to the ferry station or up to the mountains and through to Canada.</p>\n\n<p>Mika unwrapped a chocolate bar and watched the night rain illuminate a beat-up red BMW pull into the station, its engine puffing smoky exhaust into the dark sky. He started up the popcorn machine if only to hear its gentle whirring. Without warning, the bell on the door handle clashed together in a piercing cry. It was as though the imminent entrance of another person were painful against the metal beads, as though the approaching footsteps dragged along a straggling soul. A man with an olive-green backpack and the spotted chin of someone who had never learned how to use a razor shuffled into the store. The flickering fluorescence illuminated tired eyes and messy blonde hair, pulled back into a hasty ponytail. Mika leaned against the store counter, tapping the glass rhythmically as he watched the traveler peruse the refrigerated beverages. “Long travels?” he drawled, his words sounding slurred against the fist pressed into his cheek. The traveler remained silent, opening the refrigerator cabinet and selecting a large jug of water. Mika could have sworn that green jacket was lined with light at the edges. He squinted at it, the static lines seemed to pulse like a heartbeat halo around the man’s figure.</p>\n\n<p>The traveler snatched a pack of cigarettes from the back isle before stepping over and placing his things on the counter in front of Mika. He guessed they’d be around the same height if he stopped leaning against the cold glass. The scanner beeped as he swiped the water jug and the cigarettes into the system. “You going up rock climbing? You look like a rock climber,” he mentioned. The traveler knelt to read the headline on the newspaper stand, tracing his finger along the words and making an unreadable expression as he stared at the photo on the front page. “Angels, am I right? The paper’s running out of stories to print,” Mika laughed.</p>\n\n<p>“What?” the traveler looked up from the newspaper in alarm. His voice was rough. Mika smirked.</p>\n\n<p>“That guy from the newspaper. Said an angel killed his mama and papa. Crazy what people’ll make up to get away with shit.” The traveler bristled. Mika pursed his lips and continued. “You want your receipt printed?” The traveler stuttered for a second before nodding. His hands fumbled with the cigarettes, his dirt-stained fingernails ripping through cardboard. “Want me to light that for you?” The traveler held out his hand and Mika lit the end. “You’re not technically supposed to smoke in here, but I’m pretty sure the management’s up and forgotten about this place entirely. Probably threw it off the map.”</p>\n\n<p>A crash of thunder outside interrupted their conversation. Light flashed past the window as though the lightning were only a whisper away. “Sheesh,” Mika muttered under his breath, watching the rain on the doorstep slide across stone. “Somebody’s angry.” The traveler glanced back and forth, a panicked look on his face.</p>\n\n<p>The sky rumbled, and the traveler stepped backward, eyes fixed on the shaking door. A deep shadow engulfed the building, the lights flickering wildly above them. The haloed air around the traveler’s coat glowed brighter as he watched the door intently. A blurred black mist seeped under the doorframe, filling the cracks in the floor tiles and running like rivers along the crevasses. It was a nightmare scene, a demonic ocean flooding the building with no land to run to. Mika jumped out of the way just in time for the door to shatter, the fluorescent lights above them cutting and cracking in time with the traveler’s shaking figure. “Shit,” he hissed, his wide eyes fixed to the ground. The streaming shadow collected itself into a dark figure. Tall and eerie as if light itself could not penetrate it.</p>\n\n<p>“No, please, it was not my fault!” the traveler whimpered at the towering figure. Mika ducked down and watched through the glass. The counter was an imaginary shield, easily broken but still impossibly strong against fear. The traveler cowered. “The family had been harboring the Nephilim; the unholy offspring of angelic grace and human soul! They were impure! They had to be cleansed!” The broken lights on the ceiling bubbled and rained embers, bright electrical wires sparking like fireworks in the hazy air. The newspapers burned, edges bright with flame as the headlines were engulfed. Fire slithered along the walls, smoke obscuring Mika’s view. Grey dust swirled around the building, embedding itself into his memory and lungs. The smell of campfires and failed wiring assaulted his thoughts, creeping into every corner. He coughed and crawled like a child towards the door. The extinguisher sat undisturbed behind the licking flames.</p>\n\n<p>“I will not return, please, fateful, you must tell them I have died! I will not mistake myself again!” the traveler pleaded from behind the embers. Flames seemed to gather around him like a phoenix, spreading against his back like wings, illuminating his face. Mika kicked against the door handle, scraping his hands on broken glass and turning the handle slick with blood. He had to get out. The light behind him was blinding, flamed gathering and churning around the two glowing figures. Pain shot through Mika’s eyes as he slipped onto the doorstep, scrambling away from the burning building. The glass windows exploded, sending glass shooting onto the pavement. Stone cracked, and neon signs dripped, all vision filled with light. There was nowhere to run from the despairing flames, nowhere to hide from the light piercing his temples. His head hit the ground with a thud, all semblance of consciousness falling out of place. Red and blue lights flashed behind his eyes as car horns sounded. Metal braces pinched his wrists, and the lights above him burned rings into his retinas. Ambulances screamed in his ears and told him to keep his eyes open.</p>\n\n<p>“It was the angel!” he cried, but no one believed him.</p>\n</div>\n","author":"saturnjelly"}