{"rank":"1427","title":"Taking Notes","id":"8l5zzj","url":"/r/nosleep/comments/8l5zzj/taking_notes/","time":"1526951750000","body":"<div class=\"md\"><p>I was homeless for about a year when I was a kid.</p>\n\n<p>Mom kicked me out of the house when I was fifteen. She told me it was because I wouldn’t stop mouthing off to her new boyfriend. In reality, she kicked me out because he wanted me more than he wanted her. Neither she nor I was happy with that situation, I can tell you that much. So she decided to stay with the scumbag and put me out on the street.</p>\n\n<p>I could tell you a lot of stories about that part of my life, but I won’t. We’ll pick up when I was sixteen, where the fun begins. After all, you aren’t here to hear about all my woes, are you? You’re here to read something short, to the point. Scary.</p>\n\n<p>You like scary stories? I’ll give you a scary story.</p>\n\n<p>It started with a girl and her notebook.</p>\n\n<p>I noticed her standing there, watching me, clutching a plain blue notebook to her chest. I was sitting against a building on Fourth Street, watching people pass by. I had my little plastic cup sitting beside me, and once in a while someone would drop a coin in. But they didn’t look at me me. People didn’t really see me anymore. Sometimes being homeless was like being invisible… unless the cops were around. Then I WISHED I was invisible.</p>\n\n<p>Anyway, she was standing there staring at me and I was ignoring her. When people stare at you like that, more often than not it means trouble, and I didn’t want any trouble that day. I was sick, I remember, a little feverish and dehydrated. All I really wanted to do was lay there in the blistering sun and sleep until everything went away.</p>\n\n<p>After about half an hour of watching me, she stepped forward. She was chewing her lip as she held out the notebook toward me.</p>\n\n<p>“Here. Take it,” she said.</p>\n\n<p>I looked at her suspiciously. I thought about refusing, telling her, <em>lady, I don’t want your stupid fucking notebook,</em> but sometimes it’s better to just go with the flow. Take the notebook and hope that she’ll walk away and leave you alone. So I reached out and took the notebook from her grasp. It almost looked like it physically hurt her to hand it to me.</p>\n\n<p>“Good luck… and I’m sorry,” she said, her voice a raspy whisper. Then she turned around and ran down the street like someone was chasing her.</p>\n\n<p>“Fucking freak,” I muttered to myself, looking down at the notebook.</p>\n\n<p>I hesitated for a moment before opening it. I paged through it.</p>\n\n<p>Blank. Every single page.</p>\n\n<p>“Not sure what I expected,” I sighed, then laid back against the wall. I was beginning to feel dizzy and wanted to close my eyes for just a few seconds. My body slowly relaxed and, eventually, I fell asleep.</p>\n\n<p>I woke up several hours later once the sun was setting. At first, I wasn’t sure what exactly had woken me up – I just knew that I was in pain. Eventually, I realized it was coming from my hand.</p>\n\n<p>“Ow, what the fuck!”</p>\n\n<p>I yanked my hand off the notebook and stared down at it in disbelief. It wasn’t possible, I knew that, but it felt like touching a stovetop. Curiously, I poked at it with my finger. It was boring, normal, cold – except where I’d placed my hand, which had left a small warmer patch.</p>\n\n<p>“Weird,” I mumbled, picking the notebook up once more.</p>\n\n<p>I didn’t have a pencil on me, but I opened it again anyway. I thought maybe I’d get lucky and could swipe a pen from someone somewhere. I didn’t really have anything important to write, but it seemed like a good enough way to pass the day.</p>\n\n<p>To my surprise, there was something written on the first page… and I was sure there’d been nothing before.</p>\n\n<p><em>Stand up. Walk to Kennedy Avenue. Follow the shouting.</em></p>\n\n<p>I struggled through the words – reading never was my strong suit – before standing and gathering my few possessions. I didn’t have much back then – I had some ratty clothes, a bar of soap, and some snacks stashed away. Maybe four dollars in change. All stuffed inside a worn-out old backpack. I hoisted it onto my back, grabbed my change and plastic cup, and starting walking towards Kennedy.</p>\n\n<p>It’s strange – I didn’t really think about what I was doing. There was no conscious decision: <em>should I go or shouldn’t I?</em> I just… went. On instinct. I suppose it’s because I had nothing better to do. Or maybe I was just crazy. Who knows.</p>\n\n<p>I followed the instructions in the notebook and hit Kennedy Avenue about forty-five minutes later. As soon as I turned the corner, I heard the shouting, just like the notebook said.</p>\n\n<p>“You’re fired! Do you hear me? I can’t leave you alone in the kitchen for two fucking seconds without you lighting up a joint, for fuck’s sake, this is a <em>family</em> restaurant…”</p>\n\n<p>I walked towards the noise. Some boss was really wailing on an employee, the kid couldn’t have been much older than I was. Eventually, the teenager stormed off, swearing up a storm as I stood there, watching.</p>\n\n<p>Something possessed me to speak.</p>\n\n<p>“Um… are you… hiring?”</p>\n\n<p>The man standing in the doorway – Big Al, I’d soon learn – was a large man with a perpetually red face and a bushy moustache. He was still seething as I spoke, and when his glare turned my way I almost scurried off.</p>\n\n<p>I thought he’d yell at me, too, but he didn’t. Instead, he took in a deep breath, then let it out slowly. And he said, “Can you wash dishes?”</p>\n\n<p>I thought it was a trick question. “Um… yes?”</p>\n\n<p>He nodded. “Do you do drugs?”</p>\n\n<p>I shook my head.</p>\n\n<p>“Are you an idiot?”</p>\n\n<p>I paused before shaking my head again.</p>\n\n<p>“Alright. Get inside and get to work. We’ll call today your probationary period. If you impress me, you can stay.”</p>\n\n<p>I stood there, stunned, unable to believe my luck. Big Al looked at my awestruck face with impatience.</p>\n\n<p>“Well? What are you waiting for?”</p>\n\n<p>I worked harder than night than any other night in my entire life. Somehow, I knew I’d found my ticket to salvation. I scrubbed dish after dish in scalding water until my arms were red and painful. I finished my work in half the time Big Al expected. By the end of that night, I had a regular job.</p>\n\n<p>That was the first time I saw what the notebook could do.</p>\n\n<p>Big Al’s Diner wasn’t a bad gig. In fact, it was perfect for me. Big Al was old-school. He paid me in cash and didn’t ask for any I.D. when he hired me. Back then, you could get away with that kind of stuff. And once he realized I didn’t have anywhere else to stay, he let me stay in a little room above the shop.</p>\n\n<p>“Usually, I rent it out,” he told me when he made the offer, “but you look like you could use it. You can stay here s’long as you keep working hard.”</p>\n\n<p>And I did. I worked harder than anyone else in that place. I was always on time, I never complained, never talked back. I knew that I didn’t want to be back on the street. I knew that this job was the only thing preventing that outcome.</p>\n\n<p>It was a few weeks before the notebook made contact again.</p>\n\n<p>It happened on one of my rare days off. I was tidying up my room when, without warning, the pages of the notebook flipped open.</p>\n\n<p>Written on the second page, it said: <em>Go down to Riverbrook.</em></p>\n\n<p>Nothing else.</p>\n\n<p>Riverbrook was a classy, upscale neighborhood on the east side of town. I avoided it like the plague. It’s the kind of place where you can’t go if you’re homeless – not unless you want the snot beat out of you. I hesitated and thought about ignoring the instructions, but then I remembered my good fortune the last time the notebook had spoken to me.</p>\n\n<p>I had to take the chance.</p>\n\n<p>I changed into my cleanest, nicest pair of clothes – a t-shirt with minimal holes and some faded jeans – and brushed my hair. I started the long walk down to Riverbrook, wondering what I might find.</p>\n\n<p>I was nervous, walking down those streets, my hands in my pockets, my shoulders hunched. I knew I stuck out like a sore thumb – these people had money. I had next-to-nothing. My eyes darted about nervously, waiting for someone to approach me and tell me that I didn’t belong.</p>\n\n<p>But then my gaze fell upon a cardboard box next to the sidewalk. I approached it and read the large blocky handwriting on the side: FREE TO A GOOD HOME.</p>\n\n<p>Immediately, I fell to my knees and started looking through the box. Inside it I found clothes – all nice, gently-worn clothes in my size. Just looking at them, I knew they’d fit perfectly. A few books had found their way into the box, too. And, last but not least, the Holy Grail – a Betty Crocker Cookbook.</p>\n\n<p>My mind started to race with the possibilities.</p>\n\n<p>I grabbed the box and lugged it home. From that day on, I started practicing new recipes. I was determined to cook my way through the book. I had to be smart about it, save up my money to buy the things I needed. Big Al helped me out a bit once he learned about my newest project. He also became my number one taste tester. He tried just about everything I made.</p>\n\n<p>Soon, I was no longer the dish-washer. Big Al promoted me to chef and started teaching me the tricks of the trade.</p>\n\n<p>And so, my life really and truly began. I earned more and more money, until Big Al practically dragged me to the bank to open up an account. I earned a tidy sum, enough that I finally had a little breathing room. Big Al and his wife, Sarah Ann, became like family to me. My life was pretty good during those years, especially with the help of that notebook – once in a while, it would send me on a little mission, and I would always turn out the better for it.</p>\n\n<p>Eventually, Big Al retired and gave me the opportunity to take over the diner. He taught me how to run the business, how to do taxes, how to place orders. He taught me everything. I was twenty-six, then, and had no idea what I was getting into. Those first few years were rocky, but they got better. By the time I was thirty, the restaurant was booming and I wasn’t a scrappy little kid living on the streets anymore. I had a nice spacious apartment just a few blocks from work. I could afford any clothes I wanted, any food. I had a TV and a little black cat named Sophie. I was finally happy.</p>\n\n<p>And then it all came crashing down.</p>\n\n<p>One morning, I woke up to another note in my notebook. For the first time, I had no idea what it meant.</p>\n\n<p>Forgive her.</p>\n\n<p>I tried to puzzle it out all morning before giving up – I figured that the mystery would unravel in its own time. I resolved not to worry about it as I headed to work that morning.</p>\n\n<p>By the time evening rolled around, I’d just about forgotten the mysterious note. It didn’t come back to me until I saw her sitting at a table on the far end of the restaurant, next to the window.</p>\n\n<p>I hadn’t seen her in over a decade. She looked nothing like she once had. But I knew her anyway, the moment I laid eyes on her. Mom.</p>\n\n<p>So many emotions surged up to choke me at that moment – rage, anger, pain, anguish, loneliness. I didn’t know which one to give vent to first. I opted for none of the above and approached her table with a carefully blank face.</p>\n\n<p>“What are you doing here?”</p>\n\n<p>Those were the first words I spoke to her.</p>\n\n<p>She was looking at me with this strange look on her face – if I hadn’t been so blinded by my own angst, I might have seen that it was pride. “Emily. You… look at you!”</p>\n\n<p>She smiled at me and I felt a little sick. “Cut it out. Why are you here?”</p>\n\n<p>Her smile fell a bit, then turned sad. “I know that you have no reason to listen to me, or to care about what I say. But… well. I need help. I didn’t know where else to go.” She paused for a moment, looking lost, and then gathered herself once more. “And I wanted to say that I’m… I’m sorry. What I did to you was inexcusable. Do you think you can ever find it in yourself to forgive me?”</p>\n\n<p>That’s when I understood the note from that morning. I stared at the woman who had abandoned me for her pedophile of a boyfriend, the woman who hadn’t given me the time of day when I was her daughter, her only living family.</p>\n\n<p>My choice was easy and instantaneous.</p>\n\n<p>“Go to hell,” I said.</p>\n\n<p>And then I simply turned and walked out of the door.</p>\n\n<p>I went back to my apartment for the night, feeling unsettled and upset. Seeing your neglectful mother after years of no-contact will do that to a person. As soon as I walked in the door, I saw the notebook.</p>\n\n<p>The entire page was full of writing.</p>\n\n<p><em>Help her. Help her. Help her. Help her. Help her. Help her…</em></p>\n\n<p>I shook my head in disbelief. Then I slammed the notebook shut. I glared at the offending object until tears blinded my vision and I began to sob. Why now? Why had she come back? And the one thing that I’d trusted all these years, the one thing that I had known wouldn’t steer me wrong… why would it tell <em>me</em> to forgive <em>her?</em> I felt a terrible sense of betrayal deep in the pit of my stomach.</p>\n\n<p>I barely slept that night. I called my top manager the next morning to let her know I’d be taking a few days off. She didn’t question me – I almost never took days off, so she knew whatever had happened was serious. I trusted her with my life, so leaving the restaurant in her hands for a few days wasn’t a big deal for me.</p>\n\n<p>It was three days later when I walked into the restaurant again, somewhat more composed, but still shaken. Still hurt.</p>\n\n<p>There was a letter waiting for me.</p>\n\n<p>“This came while you were out. Thought about bringing it up to you but I thought I’d give you your space.”</p>\n\n<p>“Thanks, Chrissy,” I said. My manager smiled at me and walked away as I looked down at the envelope.</p>\n\n<p>My heart dropped. My hands were shaking as I opened it.</p>\n\n<p><em>Dear Emily,</em></p>\n\n<p><em>I’m sorry. I can’t say it enough. I know it won’t change anything, I know it’s too late. But I need you to know that I’m sorry and I thought I was doing what was best for you.</em></p>\n\n<p><em>I know how Tom was looking at you. I could see it. The night before I made you leave, I tried to warn him to stay away from you. But he told me that if I interfered, he’d kill me in front of you, and then he’d murder you, too, once he was finished with you. I was terrified. I didn’t know how to protect you from him… other than by sending you away. I prayed to God that if you ran, he wouldn’t find you. That you’d be okay. That I could distract him long enough for you to get away.</em></p>\n\n<p><em>I regretted it for so many years. He got more violent, especially after you left. He’s done horrible things to me, Emily. But I deserved every single one for failing you.</em></p>\n\n<p><em>Now I know he wants to kill me. My time’s running out. I shouldn’t have come looking for you – but I wanted at least the chance to say goodbye. And to tell you to be careful. He’s never forgotten about you, even after all these years. He bought a gun last Thursday. I know he plans to use it on me – my punishment for leaving him.</em></p>\n\n<p><em>I’m sorry that this doesn’t make much sense. I want you to know that I am so proud of you. I love you so, so much. I just wish I could have done more, could have done it differently.</em></p>\n\n<p><em>I’m sorry. I love you.</em></p>\n\n<p><em>Mom</em></p>\n\n<p>This time, I knew very well what emotion was choking me: regret. Bitter pain rose up in my throat as I stumbled to my office at the back of the restaurant, ignoring the curious gazes of my employees. I went right for my computer and opened the Internet. That was back when we still had dial-up and the wait was agonizing. As soon as it was up, I searched my mother’s name, dreading what I knew I would find.</p>\n\n<p>It had happened the day before. She’d been found on a street downtown, bullet holes riddled in her body. The news report mentioned no suspects.</p>\n\n<p>She was gone… it was too late. All the words I’d wanted to say to her – the hateful ones and the hurtful ones and the loving ones and the desperate ones – they were useless now. None of them could reach her, not where she’d gone.</p>\n\n<p>Now I was truly all alone.</p>\n\n<p>I sobbed there in my office, knowing that I’d made an unforgivable mistake. If I hadn’t been so <em>stupid,</em> if I’d just listened… suddenly, a mad thought seized me. I could go back to my apartment, I could look at my notebook, and it would fix everything. It had fixed my life before, it could fix it again.</p>\n\n<p>I ran out of the restaurant like lightning. I was at my apartment in five minutes flat. I raced to my room and tore open the notebook, only to cry out in anguish.</p>\n\n<p>All of the writing was gone.</p>\n\n<p>It was as blank as the day I’d first gotten it. </p>\n\n<p>The walls of my apartment, though… they had changed.</p>\n\n<p>Written on the walls in red ink, over and over again, was the phrase: <em>You should have helped her.</em></p>\n\n<p>Those words hurt the most, because I knew they were true.</p>\n\n<p>That was twenty-five years ago, and I’d like to say that my life went on, but it never did. I’ve been stuck in that moment perpetually, and I know I’ll never leave it.</p>\n\n<p>The words have covered my apartment walls – they’re a smear of red ink, now, as though the walls were painted red to begin with.</p>\n\n<p>Sometimes the words appear in new places. Once, they were written in the bathroom sink at the restaurant. Another time, I woke up with the words ‘your fault’ scrawled all over my skin a hundred times over.</p>\n\n<p>I don’t know who writes it. I don’t know if it’s my mother, or if it’s whatever was inside that notebook. I know now that it will never stop. I don’t want it to. I deserve the constant reminder of what I’ve done.</p>\n\n<p>The notebook still sits on my bedside table - a tiny part of me has never given up hope that it will open once more and tell me how to go back in time before my world was broken.</p>\n\n<p>Some things can never be fixed.</p>\n\n<p>Yesterday, I saw him on the street. Tom. He was standing there across from the restaurant, watching me. He was only there for a split second – when I turned back, my heart thumping hard in my chest, he’d disappeared.</p>\n\n<p>He’s come for me at last.</p>\n\n<p>I’ve waited for the past few years, watching. Wondering. Knowing that he would be coming for me sooner or later.</p>\n\n<p>When I went home that night, the notebook was open. It had one word scrawled on the last page.</p>\n\n<p><em>Die.</em></p>\n\n<p>Yes… I think I will.</p>\n\n<hr/>\n\n<p><a href=\"https://www.facebook.com/ronavaselaar/?ref=bookmarks\">+</a></p>\n</div>\n","author":"sleepyhollow_101"}