{"rank":"17","title":"Something was in my mirror pretending to be me, and I noticed it.","id":"8l6btj","url":"/r/nosleep/comments/8l6btj/something_was_in_my_mirror_pretending_to_be_me/","time":"1526954652000","body":"<div class=\"md\"><p>Ok a quick story for everyone who knows I’m into creepy stuff. Well I’m not really into it that much now since something weird happened to me.  I read the story about the whole staring into a mirror in the dark thing and I even tried it a couple years ago but nothing happened or at least I thought. </p>\n\n<p>In last December my best friend had a graduation  party and I didn’t so I figured I’d crash her’s.  So I got ready like always for the party. I took a quick shower and I got out. It started out so small no one would notice. My face looks much slimmer in mirrors than in pictures so I turned on my camera to see if my face looked puffy in a selfie since I knew there would be lots of pictures taken. I took a quick selfie and kinda liked it so I didn’t delete it but my hands were still slippery from the shower water and I accidentally snapped a screenshot without realizing it. Which I paid no attention to. </p>\n\n<p>I go to the party and have a great time. She was really as happy as I was to be done with college. We took a lot of pictures but I wanted more and I ran out of storage so I decided to delete old photos that were already backed up. I’m going down the line deleting stuff when I see the screenshot I accidentally snapped while closing Snapchat.  And I was just about to delete it when I noticed. The time in the reflection on my mirror read 8:23 but the time on my screenshotted phone screen said it was 8:19. That beyond weirded me out so I called Ana over and told her. </p>\n\n<p>Ana is a super Christian girl and even though we were best friends she didn’t like my creepy hobbies. She asked to see it and she deleted it completely. She said phones glitch all of the time. I didn’t believe her though. For the past few months I make it a point to avoid looking directly in mirrors. I’m even afraid of texting in front of one because I feel like I’m being watched. I’m kinda scared of reflective surfaces at this point but part of me still thought I was tripping until February 20th. I remember the day because I had just started my first job out of college at an engineering firm. </p>\n\n<p>I will admit I wasn’t sleeping well and since there were no mirrors in my cubicle I was sneaking catnaps when no one was looking. One day I woke up to realize I was at work and not in bed and I went to the bathroom to go catch some sleep in a stall. I guess I felt safer at work because at least one other person was always in the bathroom on the 24th floor. I go in to catch my mini nap and on my way out my boss catches me at the sink washing his hands. I wash mine still not looking at the mirror probably out of habit. Then he calls me. </p>\n\n<p>“Hey Buddy you Ok?” He asked.</p>\n\n<p>I looked up without thinking to his reflection in the mirror and... I completely choked. </p>\n\n<p>I answered casually saying I was fine and walked back to another coworker’s desk to tell him I had to leave early. I packed my things and I walked out of the building calmly but on the inside I was completely destroyed. Because what I saw in that reflection was a lie.</p>\n\n<p>The hot and cold faucets were... switched around on the wrong sides. I have to make a note I know how mirrors work but the ones on his side of the sink where wrong. There’s no way a blue marked handle should cast a reflection of a red marked handle. </p>\n\n<p>I was horrified. I took off work. Called my pastor and I’m moving back in with My mom. Usually I’m really bold but I’m telling you guys this ritual is one I wish I never tried. I feel watched all the time and it’s killing me having to pretend like I don’t notice. </p>\n\n<p>I can’t wait to go back home. Stay safe guys. </p>\n</div>\n","author":"tomthedemonslayer"}