{"rank":"2","title":"stranded.","id":"8l6byp","url":"/r/nosleep/comments/8l6byp/stranded/","time":"1526954686000","body":"<div class=\"md\"><p>My name is Olivia Howes. I am a 22 year old marine biologist. My dissertation is on the jumping sharks of South Africa. My crew and I left 10 days ago off the coast of Gansbaai. 2 days ago our ship capsized and 3 of my crew members along with my boyfriend of 5 years were thrown overboard. I don’t know where they are. Rodney, Lisa, James, and I are the only ones left. There have been massive waves from a local tropical storm near the coast. Our radio is down, sharks are everywhere. </p>\n\n<p>Henry... my boyfriend, I can still hear his screams. I don’t know if he is dead or alive. All i know is I can no longer see him. The pitch black depth in front of me almost seems to engulf whatever falls into it. I’m recording my log here, Ive always been one to do that. Writing memories, achievements, goals, anything. Now I am writing as me and my friends slowly die. </p>\n\n<p>We ran out of water about 3-6 hours ago. James is starting to see things that aren’t there. Lisa keeps trying to calm him down, to bring him to his senses somehow. Nothing seems to work. Rodney’s brother was one of the fallen. David. When the boat capsized David was at the front trying to pull the sails down. He fell forward hit his head on the hull of the boat and disappeared. Rodney hasn’t moved from the front of the boat since. </p>\n\n<p>Henry convinced me that jumping in to get David was the best thing. Henry, David, and Rodney all grew up together. They’ve been best friends since before they could talk. I begging Henry not to go in but I couldn’t change his mind. We dropped the small side ladder and Rodney and Henry jumped in. </p>\n\n<p>At first they didn’t see anything no signs of David at all, then they saw a piece of the life vest David had been wearing. They both began to swim as fast as they could and that is when it happened... from below a great white shark jumped into the air and formed a void between David and the others. </p>\n\n<p>I started screaming for them to get back to the boat, but the shark soon proved that to be impossible. David was yanked under the water within minutes. Henry dove under the water without even thinking as I screamed for him to swim away. Rodney turned around and began to swim back to the boat. </p>\n\n<p>“DON’T LEAVE THEM JAMES PLEASE!” I begged for him to stop but he knew there was nothing he could do. He made his way to the ladder just as the shark banged the side of the boat breaking off the ladder from the side. </p>\n\n<p>As I pulled Rodney onto the boat he looked me in the eyes his now filled with tears and fright, “Liv, I’m sorry, there was nothing I could do...” </p>\n\n<p>Rodney hasn’t moved from that spot since. Every so often we will hear faint screams but then we realize it’s just our imagination making us think David and Henry are alive... I’m recording all of this until we die or get found. I want the others to have a story. I want you to know what happened to the stranded students. </p>\n</div>\n","author":"heyitsbethxo"}