{"rank":"1","title":"I'm only young, but I've seen some shit.","id":"8l6esd","url":"/r/nosleep/comments/8l6esd/im_only_young_but_ive_seen_some_shit/","time":"1526955378000","body":"<div class=\"md\"><p>Okay so before I start there&#39;s a few intro things I need to cover. I&#39;m 20 years old and live in New Zealand, if you don&#39;t know where that is I&#39;m not surprised haha so just think of Australia and then some more south and boom here we are. I&#39;ve moved a few times in my life, attended 5 different school growing up and have seen a good portion of our small country. </p>\n\n<p>As you&#39;d expect, due to this traveling I have a few stories to tell. My first real experience was sadly the passing of my birth father, the worst part being I watched him die. I was only 6 at the time but was a huge fan of comedy and had sneaked into the living room to listen to a Billy Connolly show from my hiding spot behind the couch. I peaked around, unseen to try and get a view of a skit he was doing, and as I did so my father clutched at his chest. As I watched he moaned and began gasping for air, he fell to the floor as the room became a whir of movement.</p>\n\n<p>My mum began to try to resuscitate him as my Aunt, over for drinks at the time, called an ambulance. I watched him grow unnaturally pale, his mouth gaping like a fish out of water as the light drained from his eyes. At this point I bolted upright bawling my eyes out and took off to my bedroom. Mum had to send my older brother to console me as I was screaming in my room, unable to process what I witnessed. The closest ambulance was an hour away and my dad sadly didn&#39;t even make it 15 minutes, full cardiac arrest. It&#39;s taken me years to fully move on but now I have come to terms with it I can remember the happy days we had when I was growing up. The biggest set back I had was a few years later when in a different city I swear I saw my dad in a supermarket, he glanced at me, smiled and walked around the isle, disappearing entirely.</p>\n\n<p>Funnily enough, my fathers death is not the only thing I&#39;ve experienced, nor is it the worst. A few years on now and I&#39;m living in Picton, a small town at the head of New Zealand&#39;s south island. I was attending a rural school of less than 300 students, ranging from 6 years old to 13. I had been attending the school for a only a handful of months when we heard that our school was supposedly haunted. The story went that one day a young boy hopped the school fence to fetch a ball that had bounced out onto the road, and when I say road I mean highway.</p>\n\n<p>As you&#39;d expect the kid was allegedly taken out by a truck and his spirit had become trapped in his favorite place, the school sport equipment storage shed, also the older kids hangout. Once hearing this, being a developing horror enthusiast due to my brothers influence, my dumb ass convinced my friends that next time we go to hang out in there, that we kill the lights and I conduct a seance, something I saw in some movie and stupidly tried to replicate. So come lunch time we all gather in the shed, shut up all light sources and flicked off the light. &quot;If there are any spirits with us right now, could you please give us a sign&quot; I had announced in the most authoritative voice I could muster. Nothing happened so I persisted, &quot;Again if there are any spirits here with us now give us a sign,&quot; it was at this point that tennis balls began rolling around the floor. I assumed it was my friends messing with me, surely the rumor can&#39;t be true I thought. I told everyone to cut it out and take this seriously.</p>\n\n<p>I began taunting the spirit because I was both desperate to prove I could do it, and because my curiosity at that age was beyond the point of reason. As I continued invoking the spirit, using the boy from the stories name, my friends and I began joking about how dumb the story was. I took a step further towards a shelving unit at the back of the shed, and a plastic baton for one of our games flew across the room suddenly flashing centimeters from my head. &quot;Jesus Christ guys settle down, you could have actually hurt me with that,&quot; I said to my friends. Not a single one of them was near where it had come from, nor did they even realize that it had nearly hit me in the face, they assumed I threw it to fuck with them. </p>\n\n<p>Rattled but determined I spoke to the spirit once more, and regret it to this day. &quot;Look, obviously you&#39;re to pathetic a spirit to show us anything so my friends are going to leave unless you give me a definitive sign,&quot; as I finished my sentence I glance over to a shelf about 1.5 meters to my left and there was a fully formed male face sneering with a look full of malice at my friends. I begged my friends to switch on the lights and told them what I had seen. </p>\n\n<p>We noped the fuck out of there and later ended up banned from hanging out in that shed because we had scared the younger kids too much. I know it doesn&#39;t seem like much but that look of unrestrained hate on the spectral face is burned into my memory, I&#39;ve never felt so threatened in my life as I did that day.</p>\n</div>\n","author":"CdizzleNZ"}