{"rank":"7","title":"The tasty sandwich.","id":"8l6id0","url":"/r/nosleep/comments/8l6id0/the_tasty_sandwich/","time":"1526956249000","body":"<div class=\"md\"><p>It was just another day at school as I walked to my classroom and my teacher stood in front smiling. She was unusually happy and as soon as we all sat down, she prepared herself as she was about to inform us. </p>\n\n<p>“Welcome, class. Today we have a new boy in class. His name is Larry, and will be staying with us.” She said smiling and this short kid came in. He was skinny as he didn’t have much to eat, and he was blonde with light blue eyes. Kinda shy. The teacher welcomed him and said he could sit next to me. I smiled and he smiled back and sat down, but didn’t say much. But he seemed nice.</p>\n\n<p>The day went by and me and the Larry got to know each other. He lived not too far away from me so I asked him to walk together home, which he gladly wanted to.\nWe became friends over the days and he seemed normal, nothing off with him.\nIt was lunch time and as I was reaching for my lunch box, and it hit me that I forgot it at the breakfast table when I hurried to school this morning. I mumbled upset to myself and Larry asked if I was ok. I told him how clumsy I was forgetting my lunch and he smiled. \n“No problem.” He reached for his lunch box and opened it. Two tasty looking sandwiches appeared and I got hungry only looking at them. “Here. Have one. I think I only can eat one anyway” he handed it to me and it smelled delicious. Nice layer of sliced meat, ranch and a layer of lettuce. I took a big bite and it tasted so good. Probably the best sandwich I have ever had. Even better than mom’s. I asked him how he made them so good, and he only smiled wide. “My dad have the best meat in the state.” He took another greedy bite and I ate mine with a monster speed. I had to forget my lunch more often I thought and took a last sip of water.</p>\n\n<p>The days went by and we became best friends. We always hang together at school and he always joined me home for homework and play video games. I never joined him home but he said his dad was sick so he didn’t want to bring anyone home when he slept. I didn’t think more about it. We even made it a deal, that he joined me home for homework and he brought me one of those tasty sandwiches. I almost felt bad for my mom because she took an extra job to make everything go around, but I did eat her dinner and I loved her very much so I didn’t tell her about the lunch.</p>\n\n<p>Next day I was exited to go to school. I met my school desk but no Larry to see. I was worried as he was always on time and since I didn’t saw him on my way to school I thought he got his dad to drive him. But he didn’t show up the entire day so I decided to stop by his house on the way home to see if he was ok.\nHis house was old and the paint was falling off the walls. The lawn haven’t been mowed for what seemed forever. Trash bags laying everywhere and the smell was making me a little uneasy. But I decided to knock on the door anyway because he’s my friend and I wanted to make sure if he was ok.</p>\n\n<p>I knocked again and I could hear someone on the other side. I heard him talk and then the door opened. He peaked out from the gap and smiled when he saw me.\n“Sorry I don’t come today. I didn’t feel so well, so I stayed home” he didn’t seem so sick. “Wanna come in?” He smiled and opened the door and I noticed the smell become stronger. But as nice as I was, I stepped in and his father sat in the chair watching tv. He didn’t seem very sick either. But me on the other hand, felt sick just by the smell. He asked me if I wanted a sandwich because he owe me for not showing up at school. The smell didn’t make it easy to think about food, but the taste of the sandwich entered my tastebuds and I thanked him yes and joined him to the kitchen.</p>\n\n<p>“I was surprised when you liked the meat so much. People don’t seem to like it” I was confused when he told me, but brushed it off as babbling. That’s when he opened the door and I felt sick. Not fever sick, but I wanted to throw up. The smell was unbearable. As he opened the fridge a leg fell out. I ran outside and I couldn’t stop it. I threw up on the doorstep. It was not a leg of an animal but of a human. </p>\n</div>\n","author":"liveravelove"}