{"rank":"0","title":"My World","id":"8l6pb6","url":"/r/nosleep/comments/8l6pb6/my_world/","time":"1526957987000","body":"<div class=\"md\"><p>Where are we in humanity, I know I haven&#39;t been around here in a while but it seems like we have fallen as a people instead of grown. Everywhere I look I see war, death, suffering, pain and destruction. It&#39;s like light doesn&#39;t exist on this planet any more.</p>\n\n<p>The last time I was here I was a powerful leader, a king that led an army of blind followers to do what ever I said. I had the whole world in my hand I was sending it into the abyss and across a world of destruction and death. I though I had won, I thought that I had conquered all with a couple of inspiring words and an enemy to hate. Oh and hate they did.</p>\n\n<p>Of course they killed me and called me a monster. I mean, the gas wasn&#39;t even my idea but I wish it was, the pain and suffering that I tasted as those men, women, children all treated equally all dirt under the boot of my power!</p>\n\n<p>Equality, don&#39;t you want that? I can give it to you. You fight in the streets for it, beat each other to earn it and yet all I have to do is snap my fingers and all will be equal under me. Black, white, rich, poor; you will all be servants to my cause. Sacrifices to my new world order!</p>\n\n<p>Aren&#39;t you excited, you should be. I&#39;m about to change the world, I&#39;ve done it every time I&#39;ve entered your world. I take a form and go to work thinning out the population. I was the man who killed thousands with the Mongols, I was the disease that slaughtered Europe with a black death. I was the terrible painter with a god complex and love for the smell of dead Jew in the morning.</p>\n\n<p>And now. Now I&#39;m a little boy sitting in East Texas. I&#39;m planning something big. Been making deals, chatting with friends. Soon I&#39;ll have the power to rise up and start another war, another culling, another disease, another game.</p>\n\n<p>Yeah, a game.</p>\n\n<p>It&#39;s all just one big game, you people with your selfish lives and pathetic dreams could never understand the fun a being like me has when they&#39;re tearing your world apart at the seams. You&#39;ve stopped me before but not this time, now you&#39;re all weak. If I didn&#39;t come you&#39;d have killed each other given the time.</p>\n\n<p>But I am here and I&#39;m ready to have some fun.</p>\n\n<p>You see, I believe that there is no good and evil. These are just thoughts and ideas used to keep people like you content and calm. But me, I know better. There&#39;s no good and evil. No heroes and villains. Only strong and weak, power and meekness. And I&#39;m powerful. So very powerful.</p>\n\n<p>When the time comes this world will be mine, anyone who doesn&#39;t want to play by my rules need to off themselves now because I&#39;m going rule. I&#39;m going to fight and I&#39;m going to kill but this time I won&#39;t lose.</p>\n\n<p>Don&#39;t fight it. Don&#39;t run from it. Because you can stop the future. Just know that I&#39;ll be seeing you all very soon. Welcome to my world.</p>\n\n<p>Angel&#39;s World.</p>\n</div>\n","author":"Seth-Sanders"}