{"rank":"82","title":"The Dead Town","id":"8l6q96","url":"/r/nosleep/comments/8l6q96/the_dead_town/","time":"1526958208000","body":"<div class=\"md\"><p>I&#39;ve always been what I call an enginerd. I&#39;m not an educated engineer, but I am a metal fabricator and a mechanic. I know engines, electrical and pneumatic/hydraulic systems. So, when a friends drunken slur of &quot;<em>You can&#39;t build a ultralight.</em>&quot; landed in the back of my mind, I absolutely <strong>had</strong> to prove him wrong. So I did. I bought a couple hundred linear feet of inch and half DOM tubing, an old twin cylinder Rotax engine and maple prop. </p>\n\n<p>I poured through abstracts and I formation for about a week before I bent the first tube. I wanted to have a basic knowledge of what I was trying to do, and I wanted to know that when I took my maiden flight, I wouldn&#39;t drop like a stone.  So I studied everything I could find. Eventually I decided on a front prop twin passenger fixed wing pane type ultralight. </p>\n\n<p>It took me six days of near constant work to bend and weld the frame. Then another three days to strip, inspect and rebuild the Rotax.  With it finally ready, and built, I mounted it and ran through the check list one final time before taking off. The mechanicals and flight steering checked out, the landing gear steering did as well.</p>\n\n<p>I pushed my new creation into the parking lit if my shop, and started its two stroke fuel injected heart. The prop spun up near instantly, and as the engine hit it&#39;s power band the small air plane started to crawl forward. Full throttle spin up and off I went. It took a little longer to lift off than I expected. I had to follow the main road in front of my shop for about a hundred feet before the vehicle picked its wheels up. </p>\n\n<p>I admit, I was scared to go too high, so I tried to stay about twenty feet above the trees. I was having the time of my life. My gauges told me the engine was running cool, and that I had close to three hours of fuel left. I really should have checked that gas gauge over before take off. I lost my only engine due to fuel being gone, and without the foresight to pack nor install a secondary tank, I was royally fucked. </p>\n\n<p>I knew that I was going down, before the engine died all the way, so I went down to be buzzing just above the trees, that&#39;s when I saw it. A small town in the center if the forest. A single lane road running the length of two foot ball fields with two or three sprout offs running into the forest. I knew I was probably going to go to jail, but I figured steel bars were better than being scraped and scooped into a pine box. </p>\n\n<p>I adjusted my course, and started to descend onto the main road. I wasn&#39;t paying much attention to anything other than my altitude and speed, so the lack of people on a Friday night never crossed my mind. I landed the plane, with thoughts of some local sheriff Barney Fife wannabe trying shoot at me, after fishing his bullet from his shirt pocket.</p>\n\n<p>However, what greeted me when the lights were shut off was total darkness. Not like people didn&#39;t have the porch lights on, but like nothing at all had any type of light. The place was devoid of human life. The immediate silence slammed my ear drums like cotton covered hammers. Soft, but brutal. Not even critters were making any noise. </p>\n\n<p>I crawled from my contraption and looked around me. My phone showed no signal, which in the mountains is no surprise, so I used it for a flashlight. The town was small, five or six brick buildings, a jail, a courthouse, a couple churches, and two stores. The houses were tucked off of the main behind the main town. </p>\n\n<p>I made my way to the jail, hoping to find someone, because at this point, I was thoroughly freaked the fuck out. Have you ever experienced pure silence? As in the lack of any life other than yourself? Its not natural. Its not fun, and it&#39;s not safe. As in, if the critters aren&#39;t even around, something has chased them off. </p>\n\n<p>I made my way to the jail, and opened the glass door as I walked in. There were papers scattered across the singular desk, and Mayberry -esque cells surrounding the desk. A thick layer of white dust covered everything in sight. I decided to make my way to the stores to see if there was a phone or even some gasoline somewhere. Oh, and a quart of oil, two strokes need oil in the gas. ( told you I was an enginerd...)</p>\n\n<p>The closest store had a sign boasting &quot;<em>The states coldest Ale-8<sup>1^</sup></em>&quot; I walked over, and pulled on the door. Locked. I tried again and managed to pop the lock enough to enter. The store was much the same as the jail, everything inside covered in dust. The displays looked to from the late eighties early nineties, and what few products remained seemed to echo that fact. As I walked by a rack of Jiffy Pop with Block Buster coupons glued to the frame, I noticed there was a sign above the register that read &quot; Ask for fuel, we usually have it.&quot; So that told me there should be a tank around somewhere, I just hoped the fuel would burn, and not be fucking tarnish by now.</p>\n\n<p>I made my way through the store to the back room, when the smell of ancient decay assaulted my nose. My eyes watered as the acrid stench permeated my very being. I shone my light around seeking the source, was not having any luck finding it. I found a door that looked like it would lead to a back room or stock room of sorts, so I walked through it into the large empty room behind the store. The floor was covered in blood, with bits of rotten and dedicated flesh speckling the walls and floor. A stainless steel butchers table stand in the center of the room, with a large cleaver laying on top, covered in dried black blood.</p>\n\n<p>I hurried my fat ass out of there just as fast as I fucking could. I tripped over something, and shined my light around on the floor I now fully occupied, as the lift swept I saw something I wish I hadn&#39;t. A shoe, with part of a leg and foot still attached to it. I scrambled to my feet and booked it out of that place like a rat from a sinking ship.</p>\n\n<p>Once again, I was standing in the middle of a so called Main street, hands on my knees, desperately trying to catch my breath. I scanned my surroundings, before hearing a loud crash from the inside of the empty store I had just fled from. I made a mad dash to he next store front, and shined my way through the doors, before killing my light and peering out the dirty window, trying to see if anything or anyone came out of he first store.</p>\n\n<p>After maybe five minutes of nervous staring I reconciled my thoughts to believing I had simply knocked something off balance, and it finally fell. I slowly stood up, and surveyed my new surroundings. This must have been a hardware store at one time, as there was implements and tools on the racks still. I caught myself staring at a large corn knife ( like a machete ). I grabbed it from the hook, and decided to carry it with me. It leant some form of comfort to my increasingly numb brain .</p>\n\n<p>I explored the old hardware store for a while, noticing that same white dust on everything. It wasn&#39;t just dirt dust, it was something else entirely, I just didn&#39;t know what exactly. Yet. I found six cans of Stihl two stroke gas mix behind the counter and a can of Coleman gasoline. Carrying my finds along with a small bottle of Castor oil I made my way back to my plane, to fill the tank. I couldn&#39;t get out of there fast enough to suit me. </p>\n\n<p>It didn&#39;t take me long to pour the bottles into my tank, and once I did, I primed the system and tried to start the engine. No go. The batteries were too low. That&#39;s what I get for using the original stator. I decided that I had no choice but to go back to the hardware store to see if I could find a battery with some juice.  News flash, I did not find a good battery...</p>\n\n<p>It took me much longer than I want to admit to realize that I <em>Had</em> in fact installed a second battery in the plane. Just for the lights, that should have the ass to start the small motor, once. I went back outside, and pushed my little air plane to the far end of the town, to the dead end of its main street. I climbed into the supposed cock pit ( flight deck to y&#39;all service members ), and switched the terminals over to the deep cycle battery, before trying the starter one more time. </p>\n\n<p>As the engine roared to life, so did the light. I caught a blur of motion off to my right, I can not say for sure what it was. I did realize what the white powder was as the motor spun the heavy prop to speed. It was dead skim that fell from this thing like snow in the Rockies. Every move the creature made resulted in a fresh down pour of white dust. It was moving toward me in sharp jerky movements. I could hear its joints creak over the sharp <em>Braaaappp!</em> of the Rotax. By the time the plane was even moving, thus thing was about fifteen feet from me, reaching for me with deformed hands that sprouted raised black claws. It almost looked human, but it had no eyes, just gaping holes in it&#39;s face where they would have been. Its mouth was dull of sharp yellow <em>moving</em> teeth. I knew if it caught up to me it would eat me.</p>\n\n<p>The plane rattled and bumped down the unkempt road, and before the wheels left the ground that thing had managed to grab the rear corner of the right wing. I knew I couldn&#39;t lift all the way with this thing hanging from the wing, but I tried anyway. The engine strained, the frame twisted and the wheels left the ground, I glanced over and the things feet were all the way off the ground. </p>\n\n<p>I lifted up, and tilted over, trying to shake this thing off the wing, which wasn&#39;t working. I noticed the steeple of the wooden church, and steered towards it. The engine wasn&#39;t liking its new food, it was sputtering and coughing like an asthmatic chain smoker. I felt  the plane start to descend as the creatures made full body contact with the rood of the steeple. A sickening crunch combined with  gurgling growls told me my plan had worked, even before the plane ascended once again. </p>\n\n<p>I made it back to my town, but wasn&#39;t exactly sure where I was when I tan out of fuel. <em>Again.</em> Unfortunately, I landed in the parking lot of the court house, and did in fact go to jail for the weekend, and lost my plane. They confiscated it, and fined me five grand. </p>\n\n<p>See, thing is, I want to go back. So, I&#39;ve built another ultra light, this one with a bigger engine, a ten gallon fuel tank, and room for three adult men. I&#39;m going back, and I&#39;m going to kill that thing. If its not already dead. I figure we fly out about five in the morning on Saturday, and do our thing, leaving the town at night, under cover of darkness. </p>\n\n<p>My questions to you: what the hell was that thing? Will regular bullets kill it? Or will they simply piss it off? Will there be more of those things? What should I do? I&#39;ve checked the Map&#39;s and there&#39;s no mention of that town, there&#39;s no roads leading to it, and Google Earth doesn&#39;t show it, just a black square. So what the fuck could have happened there??</p>\n</div>\n","author":"KyBluEyz"}