{"rank":"8","title":"My twin named Parker","id":"8l6svz","url":"/r/nosleep/comments/8l6svz/my_twin_named_parker/","time":"1526958879000","body":"<div class=\"md\"><p>My mama told me from a young age to be a good girl, and I have been a good girl but the same can&#39;t be said for Parker. Parker is my twin brother and he hasn&#39;t been a good boy. He’s always getting himself and me in trouble, especially in school. We now have to be homeschooled because he caused so much trouble. </p>\n\n<p>Mama doesn&#39;t mind teaching me, she calls me her perfect child.  However, I&#39;m no good at math, which frustrates mama.  But when mama gets frustrated with me Parker yells and hits mama. I try to stop him but Parker is too strong. I can&#39;t pull him off so I have to watch my mama being beaten, watch her lie on the floor helplessly crying for him to stop.</p>\n\n<p>Once he’s done beating her Parker leaves. While I&#39;m left to care for mama. As I get ice for mama I notice the fear hasn&#39;t left her eyes yet. She looks at me the same way she looks at Parker, she looks at me like I&#39;m the one who beat her. </p>\n\n<p>The cycle of frustration and beating goes on for several years with seemingly no end. Parker is becoming increasingly more violent every day. Now mama just has to look at him wrong and he&#39;ll attack. Mama can no longer leave the house, she can barely move without wincing due to the constant pain from improperly healed injuries. Parker is controlling our lives, he won&#39;t even let mama take over the counter pain meds.  He says they&#39;re a sign of weakness. </p>\n\n<p>So I would sneak medicine to mama every night once Parker had fallen asleep. The only time mama and I are free from Parker.</p>\n\n<p>Everything was going well until I dropped the cup waking Parker up. We were caught. Parker lunged at mama grabbing her by the neck pinning her to the wall while he shouted, ”You&#39;re weak! A disgrace to this family! I can&#39;t relive you forced Margo to get you medicine!” Parker then turned to me his eyes filled with pure hate and evil and spoke to me in an eerily calm voice, ”Sorry Margo but you have to go.” he turned back to mama with a devilish grin on his face. I blacked out but not before I heard a blood-curdling scream and a thud. </p>\n\n<p>I never did like mama she was too soft, and that was rubbing off on Margo. So mama had to go. Margo was just a …innocent casualty. I buried mama in the crawlspace under the house. As for Margo, she was always the weakest of us so I&#39;ve decided to take over.  </p>\n\n<p>So now I could cut off our long brown hair, and I no longer had to wear Margo’s clothes. I could wear jeans and t-shirt instead of leggings and floral tops. </p>\n\n<p>I love being in control. Why hadn&#39;t I done this sooner? My life is so much easier without mama and Margo. I feel free. Like I&#39;m able to finally live my life the way I want to, instead of through the eyes of Margo. I can feel that Margo is upset with me for killing mama, but there is nothing she can do no I&#39;ve completely overpowered her. </p>\n</div>\n","author":"Storytellerxx"}