{"rank":"140","title":"My apartment has a roach problem","id":"8l71h9","url":"/r/nosleep/comments/8l71h9/my_apartment_has_a_roach_problem/","time":"1526961141000","body":"<div class=\"md\"><p>&nbsp;</p>\n\n<p>I grew up on a farm.  Aside from the occasional field trip or family vacation, I rarely went to a big city as a child, so like many the idea of living in a metropolis held a special mystique for me.  From early high school I made plans to go to college somewhere big, and I wound up going to Tulane in New Orleans.  I managed to get a partial scholarship, and between that, student loans, and working most of the time, I managed to make ends meet.  And I loved my time there.  While New Orleans has its problems, I still think it’s one of the most beautiful and interesting places I’ve ever seen, and my apartment was cramped and dingy, but I still loved it.</p>\n\n<p>&nbsp;</p>\n\n<p>I graduated last May and things have been going downhill.  I’ve had a hard time transitioning from college jobs to some kind of better-paying career, and the lack of money and looming shadow of deferred student loan payments has caused me to realize I couldn&#39;t afford to stay in N.O. any longer.  So I started applying for jobs all over, eventually snagging one outside of Houston with a big company that manages websites.  The pay wasn’t great, but more than I had ever made before, and the cost of living in the area I work is actually a bit less than New Orleans.  </p>\n\n<p>&nbsp;</p>\n\n<p>To save money and because I didn’t know the city at all, the day I arrived I started looking for a place to rent near my work.  The company set me up in an extended stay room for a week while I got settled, but I didn’t know how long it would take for me to find a place I could afford, particularly when I had very little for a deposit.  </p>\n\n<p>&nbsp;</p>\n\n<p>My first few days of looking was depressing.  Every day at lunch and after work I would hit several different places, spiraling out further and further from work as my desperation grew.  The company building was in an older office park, and the apartments in the area weren’t especially new or nice.  Honestly a lot of them were fairly rundown, not that I minded.  I wasn’t used to fancy, and all I cared about was cheap and available.</p>\n\n<p>&nbsp;</p>\n\n<p>But having just moved to town with no local references and little money, I was not a prime choice most places.  The couple of apartments I had found that seemed willing to consider me were so far out of my price range that I would starve before my lease ran out.</p>\n\n<p>&nbsp;</p>\n\n<p>That Friday I sat in my car, eating a pack of crackers and anxiously scanning the classifieds for any new listings.  My supervisor was already starting to ask how I was settling in and did I think I’d be out of the extended stay in the next couple of days, his wet, fishy lips smacking discontentedly when I said I sure hoped so.  </p>\n\n<p>&nbsp;</p>\n\n<p>Suddenly my heart leapt as I saw a new apartment listed.  It was on a street that sounded familiar, even close by.  I pulled it up on my phone and saw it was less than three miles away.  Throwing the newspaper in the passenger seat, I put the car in drive and headed over right away.</p>\n\n<p>&nbsp;</p>\n\n<p>I remember having the irrational fear that there would be a line of people already there to claim it before I got there.  I turned onto the street and felt my stomach sink slightly.  The buildings here were in worse shape than most in the area, but more concerning was that all the parking spaces were full.  I circled the block and finally parked half-ass in a nearby alley before walk-running up to the front door.  I hit the buzzer labeled “Mgmt” and an older female voice answered, buzzing me in.</p>\n\n<p>&nbsp;</p>\n\n<p>When I walked into the front foyer, my first impression was of how dimly lit it was.  To the left and right there were small mail boxes for the tenants, and beyond that there were three doors that appeared to lead to apartments and one door in the back that was labeled “Maintainence”.  I noticed it was misspelled, but decided it was better to find it charming than concerning.  Looking up the stairs that ran along the right wall, I saw it curved back on itself as it continued up to the second floor and beyond.  The carpet runner on the stairs looked old and stained, but not in terrible condition, and aside from a faint mustiness, the building didn’t seem to have any weird smells.</p>\n\n<p>&nbsp;</p>\n\n<p>The door to “Mgmt” opened and a gaunt woman in her fifties stepped out in a pink housecoat, giving me a shrewd look before nodding and beckoning me inside.  Her apartment was neat but cluttered, smelling of stale coffee and old perfume.  She took me over to a small kitchen table and gestured for me to sit.  Then she began, her tone stiff and her words clipped as she spoke them.</p>\n\n<p>&nbsp;</p>\n\n<p>“The rent is $700.00 a month.  Can you afford that?”</p>\n\n<p>&nbsp;</p>\n\n<p>I swallowed.  “Yes.  I think so.”</p>\n\n<p>&nbsp;</p>\n\n<p>Her eyes narrowed but she went on.  “The deposit is also $700.00 a month.  Can you afford that?”</p>\n\n<p>&nbsp;</p>\n\n<p>I felt my stomach clench.  “I don’t have that much right now.  Not to pay the rent and the deposit.”</p>\n\n<p>&nbsp;</p>\n\n<p>Her lips pursed and she nodded.  “Then your rent is $800.00, no deposit.  Agreeable?”</p>\n\n<p>&nbsp;</p>\n\n<p>I nodded.  “Yes, thank you.  I won’t cause any problems.”</p>\n\n<p>&nbsp;</p>\n\n<p>She raised a bony finger.  “I’m not done yet, hun.”  I nodded silently and she looked mollified.  “No pets, no roommates, you got a boyfriend?”</p>\n\n<p>&nbsp;</p>\n\n<p>I shook my head.  “I just moved to town.  I don’t know anybody.”</p>\n\n<p>&nbsp;</p>\n\n<p>She raised an eyebrow and nodded.  “No boyfriends staying over.  If you get behind on rent, you have to go.  This place isn’t fancy, but it’s what I’ve got, and I aim to keep it.  Understand?”</p>\n\n<p>&nbsp;</p>\n\n<p>“Sure, I understand.  I’m just happy to have a place to stay.”</p>\n\n<p>&nbsp;</p>\n\n<p>She smiled, her teeth long and yellow behind her thin and cracked lips.  “Good.  Glad to have you.”  She reached forward and patted my hand.  “I think you’ll like it here.  Quiet street, quiet neighbors.  We have some bugs around here, but absolutely no mice or rats, don’t you worry.  And I find if you don’t mess with the bugs, they won’t mess with you.”  She gripped my hand tighter.  “But no pesticides in here, hun.  Absolutely none.  We have a couple of tenants that have conditions that are severely aggravated by them.”</p>\n\n<p>&nbsp;</p>\n\n<p>I found this last part of the conversation more than a little odd, but I didn’t want to make her angry or offend her, so I let it go.  Later that same night I was already unloading my car and toting it up to my new apartment on the third floor.</p>\n\n<p>&nbsp;</p>\n\n<p>The apartment was actually larger than the one I had left in Louisiana, and in some ways it was nicer too.  I did hear what seemed like a stealthy scuttle of legs when I opened the door and turned on the light, but I tried to ignore it.  I would just keep things clean and washed down.  The odd roach or spider wasn’t going to keep me from enjoying my new place.</p>\n\n<p>&nbsp;</p>\n\n<p>And that held true for the first few days.  I cleaned the apartment from top to bottom and while I was tempted to get some bug spray, I held off out of fear that a stray whiff might hurt another tenant or bring the ire of the landlady.  In writing this, I realize I’ve never even learned her name, but that is the least of my worries at this point.</p>\n\n<p>&nbsp;</p>\n\n<p>I had been in the apartment for just over a week when I decided to go out on Sunday afternoon to explore more of the neighborhood.  Between work and apartment hunting, followed by getting settled in the new place, I’d had precious little time to get to know the place I was living.  I was heading downstairs to the front door when I saw one of the first floor tenants heading back into his apartment.  Even though it was May and very humid outside, the large man had on long pants, an overcoat, and a hat.  As I drew closer, I saw he even had a scarf on.  He turned at my approach, and I saw most of his face was obscured, but his eyes looked terrified and frantic.</p>\n\n<p>&nbsp;</p>\n\n<p>I had been about to say hello, but seeing those eyes I asked if everything was all right instead.  He didn’t answer, but instead wrenched the door to his apartment open and lurched inside.  I considered walking closer and asking again, but the door was already slamming shut.  Figuring it was none of my business, I tried to put the thought out of my head and went on out.</p>\n\n<p>&nbsp;</p>\n\n<p>When I came back later that night, I noticed something strange in my apartment.  Several items were in different spots than where I had left them.  Most of them were small things.  My toothbrush.  My watch.  A pair of socks I had thrown on the floor.  Nothing was missing, just moved somehow.  What’s more, it made me realize that it had happened before during the week.  Nothing as obvious, and I had be exhausted and distracted, but hadn’t there been a few times when things weren’t where they should be?</p>\n\n<p>&nbsp;</p>\n\n<p>I tried to make excuses and convince myself I was wrong, but as the days went on I noticed it continued happening.  A ponytail clip here, a pencil there.  Never taken, just moved around.  I also was beginning to wake up at night, perhaps out of growing nervousness, and I would hear scuttling in the dark of the apartment.  I never saw anything, but I could tell something or many somethings were in the darkness with me.</p>\n\n<p>&nbsp;</p>\n\n<p>I finally went to the landlady and asked her if anyone had been in my apartment.  She acted shocked and said absolutely not.  She had the only other key and she hadn’t been in there since before I moved in.  I then asked about the possibility of getting some roach traps or something to cut down on the bug situation, and her expression soured further.  No kind of pest control could be risked because of tenant sensitivities, but as long as I kept my space clean it shouldn’t be a problem.  And if I decided this wasn’t the place for me, I was welcome to go.</p>\n\n<p>&nbsp;</p>\n\n<p>I quickly apologized, assuring her I meant no offense and that yes, I was keeping my apartment spotless.  She gave a thin smile and nodded, shutting the door without another word.</p>\n\n<p>&nbsp;</p>\n\n<p>When I turned around, I saw the door across the hall belonging to the overcoat man was open a crack.  I almost ignored it, but I could see a flicker of movement through the small opening and I found myself approaching the door before I realized it.  Looking in through the crack, I could see the man inside.  He was still wearing the same outfit—overcoat, hat and all—and I watched as he stumbled around scratching at himself erratically, soft mumbles that resembled some kind of plaintive cry seeming to issue from him as he moved unevenly around a filthy living room.  I almost pushed the door further in and asked if I could help again, but that’s when I saw his coat move.  In two different spots on his back and one on his arm, I saw the fabric rise and fall, not from any movement of the man, but seemingly from something else inside the coat with him.  I felt my scalp begin to itch as a buzzing filled my ears, fear climbing up my spine as I stepped back quietly.  When I got back into my apartment I turned on all the lights and stayed awake the rest of the night.</p>\n\n<p>&nbsp;</p>\n\n<p>Over the next few days I avoided the apartment building as much as possible.  I was starting to get more duties at work, and I took the opportunity to dive into my job and try to get my mind off what I had seen in the man’s apartment.  I would get there early and stay late, but even then there was only so much time I could kill.  I found myself slipping into the habit of going to the local shopping mall and public library, and when they closed, I’d go to a late-night dinner, nursing a glass of water and some chicken noodle soup until close to midnight, when I would finally force myself back to the apartment.  </p>\n\n<p>&nbsp;</p>\n\n<p>I was keeping my lights on all the time now, so when I opened the door I didn’t hear little rustlings of movement too frequently.  Still, I could feel them there, hidden in shadows and tucked into unseen cracks.  Tiny eyes watching me, weighing me.  I would practically run to my bed, checking all the sheets and pillows before climbing in for the night.  To say my sleep wasn’t restful would be an understatement, and by the third week in the apartment I could barely stay awake at work.</p>\n\n<p>&nbsp;</p>\n\n<p>Last night, I woke up in my car.  When I looked at the clock, I saw it was after 9, and I vaguely remembered going to my car at 6 when I left the office.  Looking around, I saw I had never actually left the parking lot.  I must have fallen asleep—thankfully before I could drive off and have a wreck.  But it was a wake-up call.  I needed sleep and I needed to get out of that place, cheap or not.</p>\n\n<p>&nbsp;</p>\n\n<p>Trying to wake up enough to think and drive, I formulated a very basic plan.  First, I was going to go to the apartment, try to get a good night’s sleep if I could manage, and get up early to start packing.  Second, I was going to ask my boss about using the extended stay room again for a few days until I found a new place.  Third, I was going to find a new place and hopefully never have to think about that awful apartment building again.</p>\n\n<p>&nbsp;</p>\n\n<p>The first part was the hardest.  I went back to the building, and as I went inside it struck me again how quiet the place was.  I never heard any televisions or doors slamming, and I had only heard muffled voices a few times.  I knew there had to be other tenants because there were different voices and they came from different apartments, but I had never actually seen anyone other than the landlady and Mr. Overcoat.  The thought of him gave me a shiver and pushed away any thoughts other than getting to my apartment and shutting the door.  Running up the stairs, I unlocked the door quickly and stepped in, turning to lock it behind me.</p>\n\n<p>&nbsp;</p>\n\n<p>It was only when I turned back around that I noticed how dark the room was.  A single lamp next to my bed was the only light that shone, and in the dim light that trickled into the living room, everything was cast in shadowy gloom.  In a mild panic, I reached for the light switch near the door, which was still in the up position from days ago.  I flipped it down and back up with no response.  I started to make my way to the kitchen to try the light there or at least open the refrigerator for its illumination until I could find a light that worked, but then I noticed the low, sneaky noises in the dark around me.</p>\n\n<p>&nbsp;</p>\n\n<p>Individually, the tiny scrapings and scuttlings would probably have gone unnoticed.  But not so many, not all at once.  What was worse was the idea that struck me next.  They weren’t trying to be quiet or hide any more.  And the noise was coming from all around me, headed in my direction.  I had to decide quickly whether to make a dash back into the dark for the door or head for the island of light in the bedroom.  It only took a moment for me to run towards the lamp.</p>\n\n<p>&nbsp;</p>\n\n<p>I had a moment of relief when I reached the bedroom, my eyes scanning around for possible sources of light or new threat.  When my eyes landed on my bed, I was momentarily confused.  Laid out neatly across my bed were some of my clothes.  There was the long raincoat my grandmother had given me two years earlier—a nice coat but two sizes too big for me.  There was a knit cap and scarf from an old boyfriend that I did still use some times, but not in May.  A pair of gray sweatpants and some old wool gloves.  And then on the floor at the bed’s edge, were my red rain galoshes.  </p>\n\n<p>&nbsp;</p>\n\n<p>None of this stuff had even been unpacked yet, much less seen use.  Yet here it all was, and something about it was setting my scalp to itching again.  My first thought was that it was another example of someone messing with my belongings, but then I realized there was more to it then that.  Someone or something was making me an outfit.  An outfit like Mr. Over…</p>\n\n<p>&nbsp;</p>\n\n<p>That’s when the lamp went out and I started to scream.  I turned and ran blindly towards the door, but in the dark I hit the bedroom doorframe and went down.  I awkwardly tried to scramble to my feet as I remembered my phone and pulled it out to use the flashlight app.  What I saw set me to screaming again.</p>\n\n<p>&nbsp;</p>\n\n<p>There were millions of roaches over every surface in the dark.  The ceiling, the walls, the floors—nearly every surface was awash with such a mass of crawling reddish brown bodies that it looked more like some kind of obscene tide as they shifted and flowed towards me.  I heard myself screaming “Oh God!” over and over at this point, hysterical to the point of insanity as I flung myself at the door and fumbled with the lock.</p>\n\n<p>&nbsp;</p>\n\n<p>I felt the first of them reaching my feet and crawling up my legs as I got the door open and stepped out into the hallway.  Looking down, I saw hundreds were already on me, but they began to jump off and fly away back into the dark as I stepped into the sullen light outside my apartment.  </p>\n\n<p>&nbsp;</p>\n\n<p>I was still screaming my frantic refrain as I danced and shook my legs, and I realized after a moment that I was hearing it echo.  From behind the closed doors of two of the apartments on my floor I could hear my screams of “Oh God!” being mimicked, one by what sounded like an old woman and one by what seemed to be the voice of a young man.  On the floors below I could hear more of the same drifting up, following my words and terror exactly.</p>\n\n<p>&nbsp;</p>\n\n<p>I considered other people could be getting attacked at the same time, but I realized that when the last of the roaches was off and I stopped screaming, all of the screaming stopped.  And while I had slammed my apartment door shut when the last of the bugs were gone, after a moment I saw they had regrouped and began pouring under the door towards me again, light or no light. </p>\n\n<p>&nbsp;</p>\n\n<p>“Fuck no!  Fuck, fuck, fuck!”  I started running for the stairs, the cacophony of mimicking screams of “Fuck, fuck, fuck!” rising on all sides as I took the steps two at a time.  It was more than I could take, and my screams and curses devolved into a terrified, inarticulate wail as I ran, the sound doubled and redoubled by voices around me and growing louder as I started hearing doors opening simultaneously on every floor.</p>\n\n<p>&nbsp;</p>\n\n<p>As I reached the bottom, I saw Mr. Overcoat was standing before the front door, massive arms outstretched as he let out a rough, wet version of my own screaming cry.  His eyes were duller now than before, but they still held the terrible insanity of some kind of trapped or wounded animal.  There was no other way out of the building, so I would just have to be faster than him.</p>\n\n<p>&nbsp;</p>\n\n<p>I acted like I was going to his right and then cut back to the left at the last moment, my need for concentration silencing my voice and thankfully his own.  I felt the knob in my hand as I ducked past him, and then one of his massive hands gripped my shoulder and spun me around.  I tried to back away, but it was too late.  Staring at me without sound, he began dragging me towards the open doorway of his apartment.  He wore ragged cloth gloves, and I could see the fabric moving and bulging as he pulled me along.  At this close proximity I could actually see movement all over him, even under the skin of the narrow swath of face that was exposed.</p>\n\n<p>&nbsp;</p>\n\n<p>I started screaming and he screamed right along with me, his grip and strength never faltering.</p>\n\n<p>&nbsp;</p>\n\n<p>A moment later and we were in his apartment.  He took the time to issue a shambling kick that closed the door before dragging me onward.  Stacks of moldy clothes and newspapers lay in every corner, and there was a rancid almost dusty smell permeating the air that made me choke.  How I had never smelled it from the outside was beyond me.  He continued dragging me across the living room towards some back hallway, and I knew I had no chance of escape unless I surprised him.</p>\n\n<p>&nbsp;</p>\n\n<p>Without warning, still coughing and screaming, I shifted direction suddenly and launched myself at him.  The change in momentum worked, freeing his grip long enough for me to grab the lapels of his overcoat and tug it down past his shoulders.  My idea was to partially trap his arms for a moment and use the second it gave me to run out of the apartment.  It somewhat worked, but the problem was he was still stumbling backwards, beginning to fall, and as he went he grabbed hold of my arm again, taking me with him.</p>\n\n<p>&nbsp;</p>\n\n<p>He landed with a wet, squelching thud with me on top of him, my face buried in a decaying sweatshirt that writhed against my cheek.  I pushed away immediately and his grip was weaker this time—just enough that I could yank my arm free.  I started to stand up, and as I did he started screaming again, his own scream this time—a strange, almost musical sound that sounded angry and painful.  As I made it to my feet, he began rolling around on the floor, yanking and tearing at the clothes he was wearing.  Walking backward so I could keep my eyes on him, I would glance back to make sure the door wasn’t blocked or that I wasn’t about to trip on one of the mounds of trash that littered the room.  </p>\n\n<p>&nbsp;</p>\n\n<p>Reaching the door, I found it had somehow automatically locked when he closed it and there was no latch or button on this side to unlock it.  Yelling in frustration and fear, I cast my gaze about for a blunt object of some kind to batter the knob itself with.  I found an old umbrella stand that seemed caked with what I assumed was roach droppings, but I was past caring.  I just wanted to escape and live, whatever it took.</p>\n\n<p>&nbsp;</p>\n\n<p>I began striking the knob, and after the fifth blow I felt it beginning to give way.  I looked back over my shoulder to see if he was up and heading back to attack me again.  It was a mistake.</p>\n\n<p>&nbsp;</p>\n\n<p>He was standing again and still making that strange, rage-filled wailing sound, but he had completed his task of stripping away his clothes.  He stood, staring at me as he screamed, his body a ruin and a horror.  Small dark bodies swarmed over him and under his skin, nestling in his hair, mounded up like a clutch of bees at his groin.  His lips and ears were gone, long eaten away, and as he bellowed I watched several of the roaches traverse between his mouth and one of several holes in his cheek and gullet.  Under his armpits were large brown growths that pulsated slightly before beginning to rupture, spilling forth new hordes of baby roaches from the deflating egg sacs to replace those crushed by his fall.</p>\n\n<p>&nbsp;</p>\n\n<p>As I continued to stare and take it all in, I saw that not all of the roaches were crawling.  At various points of his body, half in and half out of his flesh, there were roaches that barely moved at all.  They kept to stations at his knees and elbows, hands and feet, neck and shoulders and jaw.  Suddenly they started moving more vigorously, their heads and front legs undulating underneath his skin, and the man began to lurch forward once again in his ungainly way, his tendons and ligaments, or perhaps his nerves and pain receptors, being plucked and controlled by this orchestral horror.</p>\n\n<p>&nbsp;</p>\n\n<p>I let out a fresh scream and slammed down on the knob again, popping it off.  Yanking the door open, I bolted out into the front hall and almost ran into the first of the tenants coming from upstairs.  In the brief glimpses I got, I saw robes and nightgowns, parkas and hoods, all with gloved hands reaching out for me.  I ducked past the closest and flung the front door open.  Running to my car, I leapt in and peeled off.  I didn’t start crying until I was twenty minutes away.</p>\n\n<p>&nbsp;</p>\n\n<p>I drove on for another hour, finally stopping in the parking lot of a 24-hour grocery store.  I wrote most of this in the parking lot there.  I couldn’t sleep, and after I calmed down I wanted to write up an account of everything while it was fresh and before the morning light could make me doubt myself.  </p>\n\n<p>&nbsp;</p>\n\n<p>But then I started hearing rustling in my car.  It was after four in the morning by this point, and the shadows felt very dark and deep.  I shined my phone’s light around and saw nothing, but I couldn’t quite convince myself it was just my imagination.  So I went into the store and managed to find a bug bomb to buy.  I’ve set it off now, and after killing time wandering around the store until the sun came up, I’ve now set up camp on the bleachers of a small softball field next door until my car can finish airing out.</p>\n\n<p>&nbsp;</p>\n\n<p>I don’t know if I’ll find dead things in the car when I go back or not.  I don’t know if it would be more of a relief to find them or not.  But I know sitting here, even in the sunlight, I keep hearing small rustling noises.  I wanted to tell myself it was the wind, but it’s not windy today, and its still early enough that the world is still quietly waking up.  No one is around that I can see, and I don’t know where the noises would be coming from.</p>\n\n<p>&nbsp;</p>\n\n<p>Well, except from the shadows, of course.  Even in the middle of the day there are so many shadows.  And I know its impossible that those things followed me here.  Impossible that they are pooling in the dark corners of this ballfield and inching silently up these bleachers, waiting until their strength and numbers are such that they can pull me off into a forgotten corner and make me into…</p>\n\n<p>&nbsp;</p>\n\n<p>But I’ve seen impossible things already.  And I don’t know where is safe.  I have this document periodically saving automatically to a cloud account.  And without going into specifics with her, I told one of my friends from college to check the cloud account if she doesn’t keep hearing from me and post whatever I’ve written in this document on the internet wherever she thinks it might be seen and understood.  </p>\n\n<p>&nbsp;</p>\n\n<p>I think I just saw something move near the closest dugout, and I don’t think I can stay here any more.  I hope my car is okay to drive now and I hope they can’t really follow me.  Fuck, it just moved again.  I have to </p>\n\n<p>&nbsp;</p>\n</div>\n","author":"Verastahl"}