{"rank":"59","title":"Case #7- The Village of Lost Souls- Part 4","id":"8l721u","url":"/r/nosleep/comments/8l721u/case_7_the_village_of_lost_souls_part_4/","time":"1526961305000","body":"<div class=\"md\"><p>(Part 3 can be read <a href=\"https://www.reddit.com/r/nosleep/comments/8kgtiv/case_7_the_village_of_lost_souls_part_3/\">here.</a> )</p>\n\n<p>I took Mark to the cemetery the morning of our third day of investigation. Our attempts to contact the spirit of his father had failed, despite Mark’s supposed sensitivity to spirits. I was hoping being in close proximity to William Neil’s body would amplify Mark’s connection to his spirit. If not that, then perhaps we could make contact with Tony Gillespie.</p>\n\n<p>I could tell how scared Mark was. He’d always known there was a chance something supernatural was harming his mother but he couldn’t accept it until the previous night’s revelations. There was no way of knowing if the precautions we took with the salt barrier and sage had worked. Jane Neil was the same as she’d been since we arrived. She slept most of the day, only leaving her bed for bathroom breaks and to eat. We’d decided that someone should be with her at all times, so Moxxy stayed behind while Mark and I drove to the cemetery.</p>\n\n<p>We parked outside the gates and went in. I studied Kingston Mortuary while we made our way to William’s grave. Its dark aura hadn’t changed.</p>\n\n<p>“Something’s wrong,” Mark said while we walked. “The last time I was here, this place was noisy. It was like dozens of ghosts were all talking over each other at once. It’s quiet now. There’s only whispers.”</p>\n\n<p>We reached William’s grave. “Do you hear anything now?”</p>\n\n<p>Mark shook his head. “There’s nothing at all.”</p>\n\n<p>We moved to Tony’s grave, which was also silent. It seemed that what little spiritual chatter there was in the cemetery stopped close to the dark auras. On a hunch I brought Mark as close to the mortuary as we could get and there were no voices of the dead there either. We repeated our walkthrough of the cemetery, this time hand in hand, using my own psychic powers to boost Mark’s. He still couldn’t hear anything at the graves of his father or the boy, but he confirmed what I suspected about the other spirits: they were afraid.</p>\n\n<p>“Thank you for everything you’re doing.” Mark’s gratitude came out of the blue while we were walking back to the car. His eyes looked wet and his breathing became heavier. “I don’t know what my mom and I would do without you.”</p>\n\n<p>“Oh, you’re welcome. You shouldn’t thank me yet though. We haven’t been able to actually do anything yet.”</p>\n\n<p>“Yes, you have!” Mark startled me by spinning me around to face him. The intensity of his stare made me uncomfortable. “If it weren’t for you, I’d still be sitting around with my thumb up my ass trying to talk to Dad. But because you’re here, I know someone or something is trying to hurt my mom. Without you, there’s nothing I can do to protect her. There’s no way I can pay back what I owe you.”</p>\n\n<p>I wished I felt as good about the case as Mark but we weren’t making as much progress as I wanted to. We had no leads on who might want to hurt Mark’s family, no idea how to stop the curse from progressing. Hell, we weren’t even positive it was a curse. I was in over my head, grasping at straws and hoping one of them was gold. What was worse, Donnie and Jacob hadn’t gotten back to me yet. It was unusual. Jacob could be flaky at times but he usually responded to emails and texts within twelve hours. Donnie practically lived on his computer so it was unlikely he hadn’t seen my email. I could only imagine he was upset at my attempt to drag him into yet another supernatural mystery.</p>\n\n<p>Someone’s car was parked outside the house when we returned. “Oh, that’s Dr. Larson’s car,” Mark said. “He’s our family doctor. He stops by every few days to check on Mom.”</p>\n\n<p>When we entered the room, I could tell from who Dr. Larson was from his aura. It gave me the time I needed to cover up my shock before he turned to face us.</p>\n\n<p>“Hello, Mark. Who’s your friend?”</p>\n\n<p>“This is my cousin, Emily. She came out to help take care of Mom.” Mark’s lie came as naturally as breathing. I hoped it was enough to convince Larson.</p>\n\n<p>“That’s very nice of you, young lady. I’m Dr. Larson.”</p>\n\n<p>I shook the hand of the man from my vision, the one casting the curse. “Pleased to meet you.”</p>\n\n<p>Larson asked Jane a series of questions, all of which seemed standard for a doctor to ask a patient. He wanted to know how she was feeling, how active she was, how much she was eating. He took her blood pressure and listened to her heartbeat. When he finished, he gave her a butterscotch candy. “Well, your condition appears to be the same, which is good. Stability is important to the recovery process.”</p>\n\n<p>“Do you know what’s wrong with her yet?” I focused my psychic vision on Larson when he answered. As I thought, he lied.</p>\n\n<p>“Not yet. We’re still running tests. Whatever it is though, it doesn’t appear to be life-threatening.”</p>\n\n<p>Moxxy raised her hand. “Um, it doesn’t? What about Mark’s dad?”</p>\n\n<p>“Mr. Neil passed away from an underlying heart condition which was exasperated by his illness. As far as I know, Ms. Neil has no such condition. Now if you’ll all excuse me, I have to get back to the clinic.”</p>\n\n<p>As soon as he was out the door I pulled Moxxy and Mark aside and told them Dr. Larson was the man from my vision. The color drained from Mark’s face. “But Dr. Larson has been our doctor since I was a little kid! Why would he want to hurt us? And what about the kid, Tony? Why would a doctor hurt a child?”</p>\n\n<p>“I don’t know, but I promise you we’re going to find out. Until then you have to keep him away from Jane. You can refuse treatment.”</p>\n\n<p>Mark looked like he wanted to protest but instead he nodded and left the room. Moxxy hadn’t reacted during the reveal but she was frowning now. “Well, I guess now we know.”</p>\n\n<p>“Yeah. I don’t know how we’re going to stop him though. How do you prove to police that someone is murdering people with magic?”</p>\n\n<p>“You don’t. We’re going to have to kill him.”</p>\n\n<p>“What?” I took a step back from her. “Get serious, we don’t do that.”</p>\n\n<p>“We bombed a nightclub not long ago.”</p>\n\n<p>“That was different!” I hissed. “We were trying to get rid of monsters, not people.”</p>\n\n<p>“Max was a person, remember? Look, someone with magic at their disposal isn’t going to stop. Look at all the troubles we have with Hannah. And once Larson finds out we’re fighting him, he’ll use magic to kill us too. It’s him or us and you know it.”</p>\n\n<p>Moxxy’s words upset me, not only because she brought up the possibility of murdering someone but also because I knew she was right. How do you stop a murderer if the law can’t touch them? I obsessed over it after Moxxy and Mark went to bed until I nearly had a panic attack. I was hopelessly in over my head and neither Donnie nor Jacob had gotten back to me yet. In my desperation, I crept out of bed, taking care not to wake Moxxy, and into Mark’s room. I took his hand as lightly as I could. God, it would be awkward if he woke up.</p>\n\n<p>I closed my eyes and visualized Jacob’s face. But the more I concentrated on it, the more it faded, until there was nothing in my mind’s eye.</p>\n\n<p>“Enough.” The voice came from behind me (or at least, whatever the sensation of behind me was in my mind) and I turned (you know what I mean) to look at the source. A young woman I’d never seen before had invaded my astral state. Her skin and hair were both white as milk and her eyes glowed red. She was wrapped in a cloak that was made of living, moving shadows. “Stop trying to contact Jacob. Let him enjoy his vacation and handle your own problems.”</p>\n\n<p>“Who the fuck are you?”</p>\n\n<p>“I’m the devil sitting on your shoulder, giving you advice. And my advice now is leave Jacob alone. This case is the first one that is yours to lead. If you get Jacob involved, he’ll take over and you’ll have ruined your best shot at proving yourself.”</p>\n\n<p>“I don’t care about that. Mark’s mother needs help. I can’t save her alone.”</p>\n\n<p>“Yes, you can!” The pale woman was suddenly inches from me. “You have all the information you need to see this to the end. The only thing left is the will to act. Now, I’m curious to see if you can do it and I’m not going to let you tap out. Don’t waste time trying to contact Jacob. I won’t let you reach him.”</p>\n\n<p>I stamped my foot, which wasn’t very effective in an astral state. “Well, what about Donnie? Am I not even allowed to ask him for help? Jacob does it all the time!”</p>\n\n<p>“No, you can contact him. He’s just busy right now but he’ll get your message soon. Oh, and by the way, you should wake up now. You and Mark aren’t the only ones in that bedroom.”</p>\n\n<p>I snapped back to my body and let go of Mark’s hand. Someone was standing over the bed and it took me a moment to recognize his face. “William? William Neil?”</p>\n\n<p>He didn’t answer me. I read his aura and saw it was swimming with dark energy. There was nothing else under it either. Whatever the thing was, it wasn’t the spirit of Mark’s father. There was no humanity in its aura. I watched as is turned and walked out. Its footsteps made no sound and when it reached the door its body passed through it like a hologram. I stood and followed the phantom out but when I opened the door, it was already gone.</p>\n\n<p>(Case #7 will <a href=\"https://www.reddit.com/r/JacobMielke/\">continue in an update.</a> Updates are posted every Monday, Wednesday, and Friday. Mielke Investigations is an <a href=\"https://www.facebook.com/jacobmielkeswriterprofile/\">ongoing account.</a> )</p>\n\n<p>Update: Part 5 <a href=\"https://www.reddit.com/r/nosleep/comments/8loaqi/case_7_the_village_of_lost_souls_part_5/\">can be read here.</a></p>\n</div>\n","author":"JacobMielke"}