{"rank":"8","title":"Halloween is for the Children","id":"8l78wc","url":"/r/nosleep/comments/8l78wc/halloween_is_for_the_children/","time":"1526963201000","body":"<div class=\"md\"><p>For the life of me, I can never understand those that would approach Halloween with anything less than unbridled cheerfullness. Assuming I were to hate ghost stories, haunted houses, and scary movies, would I then be apt to despise costume parties? What about candy? What kind of monster hates candy? Or what kind of contemptuous non-monster... but I forget myself. In this house, we celebrate Halloween. In this house, we cherish Halloween.</p>\n\n<p>A lot of work goes into properly preparing for October 31st. To begin with, the house itself requires something of a makeover. If it can be said that I pity those who deride Halloween (it can; I do), I can&#39;t help but exalt those who decorate appropriately. Spiderwebs in the bushes are the very least that one might consider. Something of a miniature graveyard complete with cheeky headstones goes a long way, too. Any similar such anodyne approaches to spooky trope caricature are welcome, to be sure, but then there are those that would go the extra mile. Witches crashed into trees, hands reaching from under the flowerbed, skeletons dancing, lights flashing. Maybe not lights flashing. Motorists rarely appreciate such things. But then again, Halloween is for the children.</p>\n\n<p>Next, of course, comes the candy. What to buy, how much to get, where to fit into the big candy picture. And &quot;big candy&quot; really is the picture, isn&#39;t it? Ask twenty people whether they remember anything in particular about their time spent trick-or-treating and you&#39;re bound to hear twenty stories about the house that gave out full-size candybars. Ever since I was a child, I wanted to be that house. To be a reason, to be uniquely responsible for one of the finest memories in a child&#39;s life. Life isn&#39;t fair. Some children get all the big candy bars. In this house, we give out big candy bars.</p>\n\n<p>Appreciating excitement in others is a perfectly noble goal, but it should hardly stand in the way of enjoying myself! To that end, one must be selective about their in-house entertainment. Monster anthologies and zombie apocalypses abound on television, but movies edited for television are no movies at all. Who but the worst of us can forget the excitement of sleepover parties? The anticipation, the danger even, of building a couch fort among friends and watching movies that could be counted on to provide nightmares. The girls are in the living room, right now, celebrating their Halloween hauls and laughing loudly with their friends. I miss those days, to be tied up with treats instead of with responsibility. What luck, for Halloween to fall on a Saturday. Many secrets are spoken among friends in these fertile evenings. Others remain unsaid. Tonight, a potpourri of terror shall adorn the big screen. In order: Black Christmas to set the mood and begin the chills, Trick or Treat to lighten things up, if only a bit, The Strangers (a personal favorite!), and, obviously, Halloween. 1978. Rob Zombie and his redneck brand of smut horror trash is not welcome. In this house, we have taste.</p>\n\n<p>There was a time when something about Halloween drove me right up a wall. Teenagers. Pranks. The cruelty of it, the misdirected energy. What wasted effort. On the one hand, you&#39;ve got people who are just trying to have a good time, and on the other, you&#39;ve got people whose idea of a good time is ruining other peoples&#39; idea of a good time. But at the end of the day, it&#39;s more important that nobobdy gets hurt. Most teenagers stop acting like teenagers as soon as they stop being teenagers. Funny how that works. I can almost see the joy in throwing a bit of toilet paper. A not-so-private act of rebellion. In the modern world, Halloween has always been a sort of rebellious holiday.</p>\n\n<p>And for my own act of rebellion? Show of hands: who among us has ever enjoyed hiding behind the corner to scare a sibling, or jumping out from a closet to frighten a friend? Perhaps just the only-children remain silent. In any case, I have decided to play a Halloween prank on the kids! How simple! They are absolutely primed for a spook, surely they&#39;re halfway through their movies by now. I&#39;ve snuck down into the basement, undetected, and located the main electrical panel. Main breakers? Off. Darkness now. Straining my ears, I can just barely make out the soft sounds of concern coming through the floorboards. Sneaking back up the staircase, I can&#39;t help but be reminded of Night of the Living Dead. A classic! &quot;They&#39;re coming to get you, Barbara.&quot; Haha, I wonder if any of them are named Barbara.</p>\n\n<p>You might think that all of the rope was unnecessary, but you would be surprised how hard it can be to get kids to sit still. They said stupid things like &quot;we don&#39;t want to watch these movies&quot; and &quot;where are my parents?&quot;. In this house, we appreciate Halloween. In this house, we cherish Halloween. Halloween is for the children.</p>\n\n<p>Next year? Another house.</p>\n</div>\n","author":"hackettlp"}