{"rank":"7","title":"Nightmares and Realities","id":"8l78en","url":"/r/nosleep/comments/8l78en/nightmares_and_realities/","time":"1526963060000","body":"<div class=\"md\"><p>Investigator Eric Maldan flashed his badge and was allowed into the prison. He had one goal in mind—he wanted to get to the bottom of a case he worked when he started his career twenty years ago.</p>\n\n<p>Jake Marek was one of Maldan’s first cases. According to the evidence, he killed his mother and then burned the house down. The case attracted wide-spread media coverage because Marek, at the time, had been accepted into all eight Ivy League Schools. The kid was going places. He had his whole life in front of him and a stacking pile of opportunity at his feet. Why would he throw it all away and kill his mother? The state of Texas wanted the case over as soon as possible. They pulled out all the stops they could to convict him and move on. Jake Marek certainly didn’t have any friends in high places helping him out—it would be a death warrant for their careers. </p>\n\n<p>Maldan was working the case, along with a few other fellow investigators and, of course, the FBI. Maldan and the rest of his team knew there was more they could unearth, but the FBI sped along the investigation just to get him in prison and make a statement to the rest of the country proving the system works. </p>\n\n<p>Why should Maldan care? The kid got the death penalty. Regardless of the information he could have found, Jake Marek was getting what he deserved. Jake Marek went through countless appeals, and his lawyer made sure to enforce enough litigation that his life would go on as long as possible. However, there is no force that can halt time. You can extend time until you’re on your last breath, but in the end, time always wins. Time was up for Jake Marek. He was on death row, and waiting his execution which would come in two more days. </p>\n\n<p>Marek was sitting in his dry, hot and musty cell. The guards always got disgruntled when they saw him. The now thirty-nine-year-old always had a grin on his face. They couldn’t stand it. Even though he had been sitting in a cell for almost half his life, he still outsmarted anyone in the prison, including the admins. The guards knew, even though they would never admit it, that Marek was brilliant. He carved long math equations on his cell wall with his fingers. Other than being academically smart, he was also superbly observant. He could look at a guard and generally tell the whole life story of the officer. By making these observations, he would know when he could really rile them up based if they were having a bad day or not. Sure, he would get a beating, but he enjoyed flustering them very much.</p>\n\n<p>One of the biggest selling points to the jury is that Marek never took the stand. The prosecution expected him to, but he never did. It was like he wanted to go to prison. The jury took all but an hour to determine his guilt. In one fell swoop he went from being the mascot of the American education system to being an example in text books of how the justice system is supposed to work. </p>\n\n<p>Eric Maldan knew there was more. And he needed to know the answers before they would be thrown away forever. </p>\n\n<p>A guard arrived at Marek’s cell. This was odd to Marek, he knew it was out of routine for any guard to see him at this time of day. Even though he didn’t have access to time, his brain was like a constant clock, he could tell you the precise hour and minute of any day. </p>\n\n<p>“Marek, put your hands through the door. You have a visitor.”</p>\n\n<p>Marek shuffled in his bed. “Aren’t you going to tell me to put my back against the door so I’m not facing you? It’s against protocol to have a prisoner facing a guard, you know.”</p>\n\n<p>“I would love if you tried something. I could beat you within an inch of your life and finally take that stupid grin off your face. Try something, you’d make my day.” The guard had a fire in his eyes, hoping his wish would come true. </p>\n\n<p>Marek slid his hands through the door to his cell, the guard cuffed him and proceeded to open the door. </p>\n\n<p>For the first time since he could remember, Marek was confused by the situation. It couldn’t be a long-lost family member wanting to see him before his death.  Most of the phone calls he received in prison were from family members saying they hated him and that they wished he would just die sooner. </p>\n\n<p>The guard escorted Marek into a small interrogation room. They passed by many prisoners trying to harass Marek.</p>\n\n<p>“You’re gonna get the stick boy!”</p>\n\n<p>“You finally goin’ to gen pop? Get ready to spread em’!”</p>\n\n<p>“White meat is walkin’! Everybody, white meat is walkin’! I’d like to cook you just like you did your old lady!”</p>\n\n<p>Marek arrived at the room the guard brought him to, he glanced at the man awaiting him. “Ah, Eric Maldan. What a pleasure.”</p>\n\n<p>Since Marek last saw Maldan, he was skinnier. Now, Maldan was balding, his gut protruded from his waist and he had visible nose hair. He looked haggard and tired. Worn from the scumbags he had to deal with on a daily basis. Marek thought that even though he had lived in a prison, Maldan was probably living in a prison of his own. Marek noticed a potato crumb on Maldan’s shirt and also noticed a small twitch in his eye. He likely woke up late this morning, didn’t have time to eat a real breakfast and hurriedly ate whatever was in a bag. The eye twitch came from little sleep. He probably only got a couple hours, but that wasn’t rocket science, everyone knows detectives get very little sleep.</p>\n\n<p>Maldan was the first to speak. “Thank you for joining me. It’s been awhile.”</p>\n\n<p>“You say that like I had a choice.” Marek looked down at the table, seemingly bored.</p>\n\n<p>Maldan pulled out a pen and a notepad from his briefcase. “Listen, I’m going to get right to it. I know you and I both hate small talk. I think there was more to your case than the FBI found. In fact, I know there is.”</p>\n\n<p>Marek squinted his eyes. “Do you have innocuous goals here, Maldan?”</p>\n\n<p>“I want the truth, nothing more, nothing less. So yes, I do.” </p>\n\n<p>Marek let out a huff. “Why do you care? I did it, I got prosecuted and now I’m on death’s door. What more is there to do or say? Seems pretty clear cut to me.”</p>\n\n<p>Maldan pounded the table with an open hand in frustration. He’d been hearing this same song and dance from the people in the department. “I want the truth! I want real closure! I want to reveal what kind of monster you really are.”</p>\n\n<p>Marek laughed. “Closure is not a right and is definitely not guaranteed. What’s done is done.” Marek waved his hand at Maldan. “Off with you now.”</p>\n\n<p>Maldan laid it all on the table. “Your sister was in that house. She escaped when you burned the house down. You thought she died in the fire. The government even went along with it. They gave her a new life under a new name. I tracked her down and spoke to her. She told me what you did to your mother that night. I can tell you what she said, or you can fess up to what you really did.”</p>\n\n<p>Marek looked surprised at this fact. He knew Maldan wasn’t bluffing about his sister being alive. This was because Maldan had been right, there was more. “Ah, Shelly. Where is she hiding these days? I wonder if she ever thinks about me?”</p>\n\n<p>An annoyed look ran across Maldan’s face. “She hates you, despises you. She unfortunately probably does think about you every day. You ruined her life. Tell me the real story.”</p>\n\n<p>“Why do you care so much, Maldan? The justice system got me. What is it to you?”</p>\n\n<p>“Justice isn’t served unless your sister gets the pleasure of everyone knowing what really happened. Not only her.”</p>\n\n<p>“Was my sister…pretty?”</p>\n\n<p>Maldan looked disgusted by this question. He wanted nothing more than to take Marek’s head and slam it against the table. “Tell me the story!”</p>\n\n<p>Marek let out a belly laugh. “Do you always get this riled up at simple questions? I’m sure your wife enjoys spending time with you.”</p>\n\n<p>Maldan gritted his teeth. “Keep my wife out of this. Tell me what really happened.”</p>\n\n<p>Maldan started the voice recorder.</p>\n\n<p>Marek let out a toothy grin. “Ok, we’ll get back to you wife. What really happened that night you ask? I’ll give you the short story. I was sitting in my room and was frustrated with the world in general. Sexually frustrated. Angry. Loathing. I crept up to my mom’s room and made…advances on her. She declined me. Just like all the other women of this world. She was just like the rest, she had it out against me. That is when I beat her senseless. I used my strength and power to overwhelm her. I was the one in control now. But please, don’t view me as a monster. I would never have sexual intercourse with anyone if they weren’t willing. That would be a bad thing. When she was laying on the bed gasping for air I went over to her dresser. She had a small steel hammer she had used to punch in nails to the wall for pictures. I grabbed it and caved her head in. The absolute power I felt surging through my veins still gets me going to this day. My mother, of course, died from the fatal blows. After I concluded she was not amongst the living, I slipped myself into her vagina and made love to her. It was fantastic, enchanting, enthralling. I began to drool at how good it felt. But don’t worry, detective, I asked for her permission first. She just didn’t answer me back.”</p>\n\n<p>Maldan looked horrified at Marek recounting the story in front of him. He thought he might be getting off right then and there. “And then what?”</p>\n\n<p>“After I finished up, I washed myself off. I had my way with her several more times that night. Each time more enjoyable than the other. I needed to clear my head a bit, after all, I wasn’t a virgin anymore. That’s a big accomplishment for anyone to claim. I took a nice bike ride outside and watched the colors in the sky change as the sun went down. It was like watching a painting transform. Do you enjoy bike rides, detective?”</p>\n\n<p>“No.”</p>\n\n<p>“You’re telling me you and your wife, Cassandra, don’t go on bike rides with your seven-year-old son, Finn??</p>\n\n<p>Maldan’s heart sank, wondering how this creature knew about his family. “How do you know all that?”</p>\n\n<p>Marek touched his chin to his chest and looked at the table. “I thought you wanted to hear about my story, not theirs? Anyway, I got back home and it was quite cold out. One piece of information the newspapers got wrong was that I wasn’t trying to burn any evidence away. DNA is still easily pulled from burned corpses. Dental records, skin grafts, hair strands, you know, you’re a detective. No, no. I simply just wanted to warm up. So, I doused the foundation with lighter fluid and set it aflame. Whoosh, I was suddenly warm! I enjoyed campfires as a boy. This brought back warm memories. Memories of a simpler time.”</p>\n\n<p>Maldan, still perturbed about this madman knowing about his family, went on with his main mission. “Ok, your mother was never checked for foul play, so it was never found out. They were getting pressure from the FBI to wrap it up as quick as possible. Everyone in the case overlooked a lot of stuff just to speed up the process. Your accounts that night match up with your sisters. She saw you having your way with your deceased mom through the crack of the door. She was too young to know what to do. She said when you were on your bike ride she went up to your mother’s room and laid across her body, sobbing. She saw the can of lighter fluid in your hand through the bedroom window and she ran out of the house. That is how she got away.</p>\n\n<p>Marek looked bored. “Are we done now?”</p>\n\n<p>“One more thing. Why? You had a Rockstar life ahead of you. All those Ivy league schools groveling at your feet praying you’d sign on with them. You had the brains to accomplish just about anything. You knew exactly where you would end up. Why throw your life away?”</p>\n\n<p>“Oh, detective. That’s where you’re very wrong. I haven’t thrown anything away. You’ll likely see me again. Only I won’t be in this simulation.”</p>\n\n<p>Maldan’s brow scrunched. “Simulation?”</p>\n\n<p>Marek licked his lips and tried not to smile. “None of this is real, detective. It’s amazing how far virtual reality technology has come. You’re not even a detective in the real world! You just always wanted to be one, that’s why the institute you went to programed the headset to tailor to your wants. Cassandra and your boy, Finn, are indeed real. I killed your wife and absolutely defiled her. Your son watched through the crack of the bedroom door like I hoped he would. I still went on the bike ride after. I had to adjust Cassandra’s seat, though. I’m sure she won’t mind, she has no need for it anymore. The time we have is at an end. Simulation over.”</p>\n\n<p>Eric Maldan opened his eyes, his vision blurry. He was disoriented. It was like he woke up from a lifelong nightmare. He couldn’t believe what had just experienced. It felt so real. He looked around the room. He was laying on a cold, steel table. The walls were completely white, but there was nothing else in the room. He felt for his head and realized there was a headset on it. He detached it and held the contraption in his palm. It was coming back to him now.</p>\n\n<p>He remembered signing up for this “test run” of the latest gaming virtual reality device. He worked a dead-end job as a car salesman. He was on the verge of being fired if his numbers didn’t rise. This test run didn’t offer any money, but offered a well-paying job after initial tests were completed. He jumped at the chance. He remembered a bunch of people in suits and lab coats surrounding him. It was all foggy, he could remember bits of pieces, but couldn’t put the whole thing together. Now, there was nobody around. The place had been deserted. </p>\n\n<p>He did remember his virtual reality experience however.</p>\n\n<p>Cassandra. Finn.</p>\n\n<p>He jumped off the table and took the exit door outside. He felt for his keys in his pocket and got into his car. Maldan was doing one hundred miles per hour on a sixty mile per hour road. He was lucky to not be pulled over. </p>\n\n<p>As he approached his neighborhood he heard faint sounds of sirens and firetrucks honking their horns. He entered the private community and realized everyone was standing outside of their house watching. His eyes trailed off down the street where he saw smoke. It was coming from his house. Eric was in disbelief, shock and awe. It was like waking up from a nightmare only to realize you’re still in that nightmare. His chest hitched and his heart thudded. Sweat started rolling down his head as he realized what was happening. </p>\n\n<p>He pulled up to the police barricade and got out of the car. All the police had their backs facing him as they watched the firefighters try to put out the fire. He went up to one of the police officers and tapped him on the shoulder, trying to get his attention. The officer turned around.</p>\n\n<p>It was Jake Marek. Grinning ear to ear, eyes like a kid coming down the stairs for Christmas. </p>\n\n<p>“I told you you’d see me again. How nice of you to join your family one last time.”</p>\n\n<p>Maldan backed away and fell to the ground, still starring at Malek in absolute disbelief. He was speechless.</p>\n\n<p>Marek cleared his throat and puffed out his chest. “Eric Maldan, you have the right to remain silent. Anything you say can and will be used against you in a court of law. You have the right to an attorney. If you cannot afford an attorney, one will be provided for you. Do you understand the rights I have just read to you? With these rights in mind, do you wish to speak to me?”</p>\n\n<p>Marek knelt beside Maldan. His eyes looking off to the distance. His tone hushed. “You’re going to go away for a long time, Maldan. I made sure of it.” </p>\n\n<p>Marek patted Maldan on the head and winked at him. He stood up, adjusting his utility belt. </p>\n\n<p>“Boys, take him away. I think we’re done here for now.” Marek barked out this order, the other officers hustling to follow them.</p>\n\n<p><a href=\"https://www.facebook.com/Manobutler/\">FB</a></p>\n</div>\n","author":"Mano369"}