{"rank":"30","title":"I'm the \"Administrator\" of the Numbers Station UVB-76 a.k.a \"The Buzzer\" Pt.4","id":"8l797y","url":"/r/nosleep/comments/8l797y/im_the_administrator_of_the_numbers_station_uvb76/","time":"1526963304000","body":"<div class=\"md\"><p><a href=\"https://www.reddit.com/r/nosleep/comments/8865sn/im_the_administrator_of_the_numbers_station_uvb76/\">Part 1</a></p>\n\n<p><a href=\"https://www.reddit.com/r/nosleep/comments/896g2f/im_the_administrator_of_the_numbers_station_uvb76/\">Part 2</a></p>\n\n<p><a href=\"https://www.reddit.com/r/nosleep/comments/8bd62k/im_the_administrator_of_the_numbers_station_uvb76/\">Part 3</a></p>\n\n<p>Nope!</p>\n\n<p>Without a second thought, I pull the speaker from behind my shoulder forward and slam my palm onto the button marked “Play”. The cassette labeled N-59 begins to spool out of the speaker and the acidic odor further envelopes me.</p>\n\n<p>“What is love?? </p>\n\n<p>Baby don&#39;t hurt me! </p>\n\n<p>Don&#39;t hurt me!</p>\n\n<p>No more!”</p>\n\n<p>What the fuck? Without having the luxury of time to judge the lead researcher&#39;s choice of music, I heave my body from the chair, wrap my hand around the back of it, and launch it at where I remember the Swan Lake whistling to be coming from before the cassette had interrupted. </p>\n\n<p>My plan didn&#39;t quite work out as a second after the chair leaves my fingertips, it freezes mid-air. My eyes quickly dart to my outstretched wrist and notice the Crimson, not-quite-wristwatch has begun to strobe on and off. Had it been in time to the awful music, I would have thought it was all a sick joke. But instead of hope for a good night, dread near the same level of when the stains began to wrap themselves around began to invade my body. </p>\n\n<p>I pull my gaze from the spastic display on my wrist and beyond the physics-defying furniture and scan the space all the way to the wall.</p>\n\n<p>Nothing. The acidic stench has become unbearable. The suspended chair begins spin in front of me. Faster. And faster.</p>\n\n<p>Gaudy, synthesized beats begin to pound from the speaker across my back and reverberate against the mess hall walls. The harsh smell continues to grow to suffocating levels. I begin to back away from the table I had just been resting at (maybe for a little too long) when the chair that had begun to blur from its unnatural speed stopped instantaneously.</p>\n\n<p>There was a split second before it launched itself at my face. The speed it had only allowed a quarter turn response from myself, but that was enough to prevent it from caving my nose out the backside of my skull.</p>\n\n<p>Not enough to avoid blinding pain and keep my right arm in working order, unfortunately.</p>\n\n<p>The supersonic chair blazed into the right side of my body, knocking me into and over the cafeteria table behind me. The music suffered a few stutters, but continued to play as the momentum carried me across the tabletop and rolling onto the floor. Boris&#39;s gun, now empty, remained in its holster, and I came sliding to stop a few feet from my rucksack with the now unblocked doors leading deeper into the facility about 30&#39; on the other side of the pack.</p>\n\n<p>That&#39;s when things got bad.</p>\n\n<p>Propping myself up with my left arm and feeling blood trickle down from freshly reopened wounds obtained earlier, the floor cracked. Like a far-too-dry desert floor, thousands of hairline fractures spidered away from my body and the speaker to each end of the walls. My blood began to collect and fall from my face, collecting in the cracks beneath. It started as a slow drip as one would expect, but instead of coagulating, it soon became a small stream. As I sat there, propped on my left arm, I began to realize it was no longer even flowing down my face, but instead was being pulled into the cracks from the wounds themselves.</p>\n\n<p>And the trickle from my face was quickly getting thicker.</p>\n\n<p>Not needing any more motivation, I pull myself up from the floor and lumber my way towards the rucksack. My body feels unnaturally heavy as I cradle my right arm (which I&#39;m now fairly certain is dislocated) close to my body and loop my left hand through my supplies, careful not let the speaker blasting Haddaway slip off my shoulder.</p>\n\n<p>My vision continues to be obstructed as the open cuts on my face seem to be most affected by the unnatural gravity pulling my vitality into floor. What was a trickle mere seconds ago had now become a stream, nourishing the cracks at my feet as I made my way across overturned cafeteria tables and to the large doors across the room.</p>\n\n<p>The amber lights began to blink out of existence as I crossed the floor markings. A different, more natural, kind of void compared to the one from earlier began to collect at the edge of my vision and caused my head to swim, making it difficult to recall what floor marking I was supposed to be following. The music only existed as thuds from the speaker on my back as all sound started to become more and more muffled.</p>\n\n<p>My vision tunneled as I reached the far doors. My breath was shallow and the sound of music was absent. The weight of my head pulled my chin to rest against my chest as I forced my eyes upward, squinting through a thin curtain of blood. All senses were gone or going.</p>\n\n<p>Except for my sense of smell. If I had thought the acidic smell had invaded my core before, it now gripped my soul. It was always building, my other senses seemingly sacrificing themselves to make this one sense reign supreme.</p>\n\n<p>I look up at doors, I apparently had fallen down against them without realizing. The handle was there, two or so feet above me, but might as well have been in the Observation room gazing over the mess hall. My head is pulled back down as I see the cracks beneath me begin to overflow.</p>\n\n<p>As I lay there against the wall, surrounded by toppled grade school lunch tables, a truth came over me that gave some peace of mind in what I didn&#39;t doubt would be my final moments. Something I could know for sure.</p>\n\n<p>I would always fail.</p>\n\n<p>I attempted a chuckle at myself as the thumps from the speaker faded. Because the cassette was over or all feeling was gone, I don&#39;t know. I began to close my eyes, tired of not seeing anything but red at this point and begin to fall backwards.</p>\n\n<p>And smack my head against the un-cracked floor behind me. I blearily open my eyes and find myself  lying on the other side of the door that had opened inward from resting against it and wipe the blood that was no longer being pulled from the source from my eyes. I was lying half in and half out of the mess hall, I roll on my right side, wincing from the pain of my dislocated shoulder, and begin to worm my way onto the other side of the doorway. As soon as the last part of my body crosses the threshold of the doorway, the unnatural gravity leaves my body and I&#39;m able to grab my breath. I take deep, gasping lung-fills, acidic odors be damned, and my vision begins to return.</p>\n\n<p>I crawl up the side of the door to close away the mess hall for as long as I can and hear the cassette click off as true silence fills the facility once again. My already haggard breathing gets louder and I look through the doorway, ready to use every last bit of strength to slam it shut.</p>\n\n<p>When where there was once impenetrable shadow, now hosted a set of pinprick, glowing eyes. No other features, no body to see, no face. Just fiercely cold, un-moving, unforgiving points of light looking back at me. Through me. Into me.</p>\n\n<p>A voice from nowhere and absolute flashed across my brain.</p>\n\n<p>“She&#39;ll be so happy to see you.”</p>\n\n<p>When the door slammed shut on its own accord and out of my grip, causing me to fall backwards and drift into an unconscious stupor.</p>\n</div>\n","author":"ForYouMargo"}