{"rank":"7","title":"One Hell of a Bunch","id":"8l7cz3","url":"/r/nosleep/comments/8l7cz3/one_hell_of_a_bunch/","time":"1526964404000","body":"<div class=\"md\"><p>My brothers and I have been on the road for about a week and a bit now. It’s been pretty cool, going from town to town swallowing up anything we can.  I’ve kind of missed these binge weeks where nobody can tell us what to do. My dad is a bit of a prude about us leaving the house because he thinks we cause too much trouble. I can’t really disagree, we were one Hell of a bunch. </p>\n\n<p>My name is Dean, I’m the oldest of the four of us, and definitely the favourite. I had this thing with dad where he let me do a lot of things by myself, gives me the biggest jobs and stuff to do, that sort of thing, he even bought me my first car, mind you it was pretty run down and pale in colour, but well worth it when it kicks into drive. \nMy brother after me is Wade. He’s a dick, not much more to be said. He loves causing trouble everywhere he goes, starting fights in bars and general goods stores. Usually gets us into arguments around the dinner table which always ends in a fist fight among us, usually over his brand new bright red custom Tesla he had made last week. I wont lie, it’s a gorgeous car. \nThen comes Freddy, and he’s uh.. going through some shit. He regularly starves himself, I have no idea why. And he hates going to lunches with anyone so he just makes them not eat while he’s around. Pretty selfish in my opinion but dad says I’ll get over it at some point. He has this motorcycle in the garage he hasn’t touched for years too, a lovely and stunning black Harley Davidson. I want to drive both it and Wade’s cars but they never let me, even though Freddy doesn’t even use his bike.\nThen it’s my final brother, Percy. He’s always sick and just doesn’t get better properly. He always gets people around him sick and it’s disgusting, he does it to us too. Last week, dad gave him a new crisp white quad bike in hopes that it’ll make him go outside and get better. He’s not using it much, I was expecting that more than anything. </p>\n\n<p>We left our home two weeks ago and we’ve been wreaking havoc absolutely everywhere, bringing towns to their knees. It’s getting uh, pretty brutal I might say. \nYesterday, Percy and Wade walked through a small town in Detroit and forced an entire bank to go hostile on itself. It was a shit show but God it was good to see it. I remember watching the security guards walk through and slam each hostage into the ground before plastering their brains across the walls. Some of them got creative and didn’t even use guns. </p>\n\n<p>Because Percy got involved you can imagine any services got horribly sick, I’m not even sure what he had this time when we left but he looked like shit the whole time we were there. He got a family sick who ended up passing it onto an entire public school and corporate work place. Half of them are dead because of that illness now, guess their immune systems just couldn’t take it as well as he goes. </p>\n\n<p>Freddy and I hung back for a while and decided to take ourselves over to Canada. When we were there we went to so many restaurants and ordered almost everything on all he menus over a course of two days. Didn’t leave anything else for anybody to eat and just pigged out. \nAlthough I got into a few fights with a few groups. I did end up killing about four people as well, but that’s okay, I’m not worried at all. I have no need to be.  </p>\n\n<p>I guess being apart of the Four Horsemen of the Apocalypse, when the apocalypse finally comes around, isn’t too bad after all.</p>\n</div>\n","author":"espxdaa"}