{"rank":"17","title":"New Neighbor | Part 1","id":"8l7jjs","url":"/r/nosleep/comments/8l7jjs/new_neighbor_part_1/","time":"1526966437000","body":"<div class=\"md\"><p>My old neighbor was a religious man, I’d only gone inside his house once to cat sit for him while he was away on holiday, but the entire house was strewn with crosses and those weird porcelain figures of angels and stuff. You know the ones, you see them at old peoples houses all the time, usually every knick-knack store has a shelf of them. Anyways this story isn’t about how religious he was, but rather how he just disappeared one day with no trace.</p>\n\n<p>To give you a sort of background, let me describe my neighborhood. I live in a suburban cul-de-sac in western Michigan, I live right smack dab in the middle, so I have a perfect view of when anyone comes and goes from the neighborhood. Which is why I find it so strange that my neighbor could just vanish overnight like he did, sure I work during the day however I feel like it’s just.. Implausible that one man could just clear out in one day with no sign of a moving truck or anything. No garbage, no for sale sign, no real estate agent, absolutely no clue that he would have been planning to move.Weird right?</p>\n\n<p>Now, my relationship with him was very casual. I wouldn’t say we were friends, but trusted acquaintances I suppose? I’m 32 years old, and he’s probably in his mid 60’s I’d guess (I’ve never asked, think it would be kinda rude), and I only ever really waved to him in the morning or returned mail to him when the damn mailman gave me his. But compared to all my other neighbors, I think I knew him the most, I mean he trusted me to watch his cat that one time so I’m pretty sure it was mutual. </p>\n\n<p>Okay okay I think I’m getting off track here. Let me go back to the day I realized he had moved away, which was literally last Wednesday, like two whole days ago. I usually get home about 6pm, pulled into the cul-de-sac, and was kinda surprised to see an unfamiliar car parked on the curb between my house and said neighbors. Of course rationality told me it was simply a visiter, I parked, got outta my car, grabbed my shit, and was in the house in five seconds flat. My wife Clarice was on her laptop in the living room, she helps manage a handful of social media accounts for local businesses so she doesn’t actually leave very often, another reason I think we would’ve noticed if the neighbor moved away.</p>\n\n<p>Before even saying hello I immediately questioned about the car, honestly our neighbor was kind of a shut-in, so it did make me a tad suspicious that I’d never seen this particular car before. </p>\n\n<p>“Oh I hadn’t even noticed.” She glanced up from behind her laptop screen “I heard it pull in but assumed it was just Harvy.” (Should’ve mentioned this, Harvy is the neighbor, or was. No, that&#39;s not a misspelling, as much as my internet browser is trying to tell me it is. His name is Harvy. No E.)</p>\n\n<p>I shrugged “Nope not his car.” Sitting down my coat and walking over to the window to peer out the curtains, Clarice chuckled.</p>\n\n<p>“Calm down” Her gaze resumed to whatever she was doing on the computer. “Maybe it’s his kid? Does Harvy have children?”</p>\n\n<p>“No.” I replied flat-out, if he had kids I’m sure they would’ve visited in the past. We’ve been neighbors for nearly 5 years now, surely I’d have seen some sort of indication that he was married or had children. As far as I was aware, he was alone. </p>\n\n<p>“New car?” She suggested. I scoffed a bit, Harvy drove a black pickup, pretty sure he was living on social security checks or a pension because he never spoke of a job and I rarely saw him leave the house. I stepped away from the window, noticing a stack of mail on the coffee table. Well, guess I could investigate the situation by returning his mail right? Clarice didn’t even notice me slip the mail off the table, too absorbed in what to post on twitter I guess. </p>\n\n<p>“Be right back.” I chimed before leaving, closing the door before Clarice could even look up from her screen.</p>\n\n<p>Since it’s the middle of May in Michigan, rain is a given. And that Wednesday afternoon was no exception, in fact it’s been raining pretty heavily since. I walked briskly from our driveway to his, peering over at the car briefly. I actually felt kinda guilty looking at the tags, like I was too suspicious y’know? In all honestly I am not a super defensive man, so I’m not quite sure what overcame me and made me just so convinced something was wrong. And I was right to think this way, so maybe it was just instincts. </p>\n\n<p>I made it up the slick driveway, brushing raindrops that had fallen from the trees overtop outta my hair. Up the porch, and to the front door. Nothing out of the ordinary besides the car, house seemed the same. Hell, even the wooden lawn chair was still on the front porch. Trying to shrug off my lingering wariness, I knocked on the door like I would any other day.</p>\n\n<p>No answer.</p>\n\n<p>I waited a few seconds, in case maybe Harvy was laying down or watching television, although the house was eerily silent. I knocked again, a bit louder but as non-threatening as a middle eastern man in a mostly white suburban neighborhood could. </p>\n\n<p>The door opened moments later, and that’s when I knew something wasn’t right. A rather skinny black haired women opened the door. She was maybe in her mid-40’s, hard to tell but I had definitely never seen her before and was very confused to be greeted by this absolute stranger. She was pale, and her hair was incredibly long, kind of matted on the side. I’m sure twenty years ago she was a very attractive women, but the years hadn’t been kind. Her eyes were a dull blue, black eye-shadow smudged her eyelashes and her face was gaunt almost like a skeleton.</p>\n\n<p>“Uhh, is Harvy home..?” I managed to spit out, waving the letters of mail in my hand to catch her attention. She had a cold stare, and her voice had no hint of emotion, even the way she held herself made her seem like some sort of mannequin. Creepy.</p>\n\n<p>“I’m sorry?” She glimpsed at the mail before immediately fixing her stare back on me. The coldness from her gaze faded with a spark of familiarity, like an actor who had forgotten her lines but had just remembered. She relaxed her stiffened pose, returning to a slight hunch “Oh!” She smiled, showing no teeth at all. “The old man who lived here?”</p>\n\n<p><em>Lived.</em> Not the old man who <em>lives</em> here, the only man who <em>lived</em> here. Something wasn’t right. </p>\n\n<p>“Yeah yeah, he’s not here anymore.” She continued, I interrupted her as politely as possible. </p>\n\n<p>“What do you mean?” I put on my best fake smile, worry was washing over me. “He couldn’t have moved. I saw him a couple days ago, and he never said he was moving. Nothing happened I hope?”</p>\n\n<p>The women leaned on the door frame, allowing me a quick view of the houses entrance. And to my surprise, the crosses where gone. You know, the fifteen-or-so crosses Harvy had hung around his house? Yeah, I was positive that at least five of them decorated the interior wall next to the entrance to the house. Nothing. In fact, the house appeared absolutely empty aside from one box in front of the door behind the women. Weird that there wasn&#39;t more than one box right? </p>\n\n<p>“I’m not sure where he is.” She was lying, I could tell. The way her voice was, like she was pretending to be as confused as I was, like she was rehearsing a line that had been fed to her. “This house.. It was listed on a real estate website..” The story she was trying to weave was just completely unbelievable. And I can promise you, these are her words, exactly as she said them. Which is why I’m just so frustrated that I’m the only one who finds this whole situation fabricated. Seriously, this story she telling me sounds like the beginning of a Stephanie Meyer book. “It was cheap and said we could move in immediately.” She finished, tilting her head to the side, closing the gap between her and the door frame, obstructing my view of the box and most the inside of the house.</p>\n\n<p>I had no words, did she think I was an idiot or something? </p>\n\n<p>“Uhm” I had so many questions. “Do you.. Do you have the link to the website?” It’s all I could think to ask that wasn’t super accusatory. And if she had proof, I’d be more inclined to believe the shit that was pouring out of her mouth. Writing this out right now, I know I could’ve probably come up with better question, but at the time I guess my mind was so flustered this was all I could come up with on the spot.\nShe smiled again, making a click noise with her tongue.</p>\n\n<p>“I don’t sorry.”\nOf course you don’t. </p>\n\n<p>“But I can find it and print it out if you’d like?”\nOf course I would. </p>\n\n<p>“If you can.” I looked down at the mail I had in my hands still. I desperately wanted to investigate the rest of the house, but god damn how could I possibly do that? I might as well accuse her of kidnapping him…</p>\n\n<p>That’s when the idea of maybe contacting the police sparked in my mind. I smiled, dipped my head a little bit, and said goodbye. Turning, I promptly walked back down the wet cement driveway back toward my own house. I could feel her eyes burn a hole in the back of my head the entire walk. Maybe I shouldn’t have left so abruptly? I don’t know, the whole situation was a mess and I wish I could say social interaction was my strong spot. </p>\n\n<p>When I opened the door Clarice was standing at the kitchen counter, waiting for me to return. </p>\n\n<p>“Hey” She walked over, looking at the mail I had still in my hands. “Harvy alright?”</p>\n\n<p>I shook my head, maybe she could see the confusion and bewilderment in my eyes because she looked concerned. That made two of us.</p>\n\n<p>“I have no idea what’s going on.”</p>\n\n<p>It took me a good five minutes to explain my encounter with the strange black haired women, Clarice listened intently while sipping on a steaming mug of hot coffee. She never interrupted me, never paused to ask a question, just listened. </p>\n\n<p>“Maybe we should call the police? I don’t know, something feels very wrong here.” I finally finished, flicking the mail out of my hand and across the counter.</p>\n\n<p>“Did the house look like it was broken into?” She asked.</p>\n\n<p>I sighed, cupping my hands over my eyes in irritation. </p>\n\n<p>“No, in fact the place was just empty. Only thing I recognized was the chair on the porch which I guess he left for some reason? And like, one box.&quot;\nWe both stared at each other, until finally she broke the uncomfortable silence. </p>\n\n<p>“We can call in an anonymous tip? A noise disturbance?” The neighborhood was deathly silent that day, so if we had called in a noise disturbance I’m almost positive the women would know who it was. Man comes to your house, asks where the previous resident is, leaves, then suddenly the police show up? Wonder who it could&#39;ve been!</p>\n\n<p>“No..” I muttered. “Call in a missing persons? I haven’t seen Harvy in a couple days, he could be missing.”</p>\n\n<p>Clarice gave me a reassuring smile, but shook her head. </p>\n\n<p>“Pretty sure you can’t do that anonymously.”</p>\n\n<p>Damn, she was probably right. I took my glasses off from their usual place on my face, rubbing my temples trying to think of a solution. Clarice rubbed my shoulder before dropping her mug in the sink and walking back to her spot on the living room couch, the rain continued to pound the roof of the house as day turned into dusk.</p>\n\n<p>It’s been a couple days since I went over to the house, Clarice seems to have forgotten everything pretty quickly. But I haven’t, and it’s been weighing on me. So now, I come here to this website to ask advice. Kind of pathetic isn’t it, to ask a website full of strangers on advice what to do? I mentioned this situation to my sister, she directed me here, so here goes nothing. Since Wednesday, the car hasn’t left. I haven’t seen the women leave the house either, which just builds up my suspicions. And I know you’re probably asking why I’ve waited two whole days to say anything, but I’m just not sure what to do and at this point and I’m afraid of confrontation. Should I contact the police? Drive to the station and file a missing persons? Maybe go and try to talk to the women again? Whatever website she said she found the house on is bullshit, I’ve looked up the address and it isn’t listed anywhere online. Help is appreciated, I’ll try to post an update if I ever actually decide to do something about this, or try and find Harvy. If anyone has any questions, I’ll answer when I get the chance. </p>\n</div>\n","author":"killsu"}