{"rank":"381","title":"I woke up in a different version of reality, and I don't know how to go back","id":"8l7od5","url":"/r/nosleep/comments/8l7od5/i_woke_up_in_a_different_version_of_reality_and_i/","time":"1526967971000","body":"<div class=\"md\"><p>Everything was normal last night. I set my alarm on my phone, put it on my nightstand, got under the covers, and went to bed.</p>\n\n<p>I woke up. But things were... different, which is perhaps an understatement. </p>\n\n<p>My phone alarm was set to an hour after I had remembered setting it. Whatever, right? Things like that happen all the time. Memory is far from perfect.</p>\n\n<p>I rubbed the sleep out of my eyes and got up to use the restroom. Fine so far. </p>\n\n<p>The first sign was when I turned on my TV to watch the news. As I flipped on the TV, the default Anderson Cooper was on. </p>\n\n<p>Great, I thought. He&#39;s one of my favorite journalists, but it always bothered me that he was a Fox News pundit. I hated giving Fox News another viewer. It made it hard to watch him sometimes, so I often didn’t.</p>\n\n<p>That was the first sign. </p>\n\n<p>I looked on the bottom left corner and saw the distinctly crimson &quot;CNN&quot; logo brandished on the screen. I was at a loss, at least momentarily. I knew he was a Fox News pundit… I had discussed it in length with my friends. </p>\n\n<p>But there he was. </p>\n\n<p>I rationalized it. Wouldn’t you? Perhaps, I thought, he had switched stations and I hadn’t heard about it. Somewhat satisfied with that rationalization, and happy with the upgrade in a job description for Anderson Cooper, and now I wouldn’t have to feel bad watching him. I decided to listen to him as I turned around to prepare a bowl of cereal.</p>\n\n<p>“The Mueller investigation into whether President Trump colluded with the Russians has just hit the one-year mark, and appears to have no signs of stopping. With us now…”</p>\n\n<p>I froze. </p>\n\n<p>What the <em>fuck</em> did he just say?</p>\n\n<p>The words reverberated in my ears. </p>\n\n<p><em>President Trump.</em></p>\n\n<p>A million possibilities ran through my mind. And none of them made any sense. </p>\n\n<p>I had to check. I had to be sure. </p>\n\n<p>I pulled out my iPhone (it seems slightly larger than I remember… did I always have the 6s?) and unlock it. I open Safari and type in “President of the United States.”</p>\n\n<p>My heart skipped several beats. I could feel sweat pool down my arms.</p>\n\n<p>Today, Donald Trump – the former reality TV star – is President. </p>\n\n<p>Yesterday, Jeb Hensarling – a Republican Congressman from Texas – was President. </p>\n\n<p>This doesn’t make any sense. I am freaking the fuck out. Had I lost my mind? Was I hallucinating? </p>\n\n<p>At this point, I decided the best course of action was to text my girlfriend Katie. She doesn’t really joke around when she can tell that I’m serious, so I figured she might be able to tell me something – anything – that could help me figure out what the hell is going on.</p>\n\n<p>I couldn’t find our conversation saved on my phone. </p>\n\n<p>Weird, okay, but maybe I deleted it. I looked through all my contacts.</p>\n\n<p>She’s not there. </p>\n\n<p>I don’t have time to react, as my phone buzzes. An incoming text.</p>\n\n<p>“Hey baby.” </p>\n\n<p>A text from an Ali. Who the fuck is Ali?</p>\n\n<p>“Hi… who is this?” I reply back. </p>\n\n<p>I waited what felt like hours.</p>\n\n<p>“Very funny. How did you sleep babe?”</p>\n\n<p>Another text.</p>\n\n<p>“I’m a little nervous about you meeting my parents today. You’re the first boyfriend I’ve ever had them meet. But since we’ve been dating for so long, I know they’ll think you’re just as special as I think you are &lt;3” </p>\n\n<p>I have never seen this woman in my life. I don’t know her. I have been dating Katie for a few months now. I have no idea what she’s talking about.</p>\n\n<p>What else was different? </p>\n\n<p>Apparently, a lot. </p>\n\n<p>I started with Wikipedia. Thank god. Wikipedia still exists. </p>\n\n<p>I clicked the “random article” button. Nothing stood out to me (I got very obscure articles about things I had no foreknowledge of) until I got to the page for “Diana, Princess of Wales.” It listed her death date. </p>\n\n<p>Princess Diana never died. But according to this article, her death was a shocking accident that happened over two decades ago. </p>\n\n<p>But yesterday, she had attended the royal wedding. </p>\n\n<p>I delved deeper into the history of people and events that I thought I knew.  </p>\n\n<p>Hitler was never tried and executed by the Allied tribunals. John F. Kennedy wasn’t reelected to a second term – in fact, he was assassinated. </p>\n\n<p>I shut my laptop. I couldn’t take it anymore. I walked outside, trying to breathe in some fresh air.</p>\n\n<p>I was swallowed by blackness. The sky was black. I could see no shapes. It looked as though someone had spilled ink all over the sky and blotted out the sun. </p>\n\n<p>There was no sun.</p>\n\n<p>There were no stars. </p>\n\n<p>There was no moon.</p>\n\n<p><em>There was nothing.</em></p>\n\n<p>I could see only a few steps in front of me before my walkway became a shadow. </p>\n\n<p>I pulled out the flashlight on my phone, only for it to be engulfed by the darkness.</p>\n\n<p><em>Buzz.</em></p>\n\n<p>As I went to turn off the flashlight and go back inside, Ali – whoever that was – sent me another text.</p>\n\n<p>“Why did you go outside?”</p>\n\n<p>What the fuck? </p>\n\n<p><em>Buzz.</em></p>\n\n<p>“Why did you go outside?”</p>\n\n<p>A text from my mother who had passed away when I was a child.</p>\n\n<p><em>Buzz. Buzz. Buzz.</em></p>\n\n<p>Three texts. Three unknown numbers.</p>\n\n<p>“Why did you go outside?”</p>\n\n<p>“Why did you go outside?”</p>\n\n<p>“Why did you go outside?”</p>\n\n<p>I ran back into my house. I ran into my room. I locked the door and started sobbing. </p>\n\n<p>Someone is knocking on my door. The person says it’s Ali, and that she’s worried about me. She wont stop knocking. </p>\n\n<p>What the fuck do I do?</p>\n\n<p>Update: <a href=\"https://www.reddit.com/r/nosleep/comments/8lgv17/i_woke_up_in_a_different_version_of_reality_and_i/\">https://www.reddit.com/r/nosleep/comments/8lgv17/i_woke_up_in_a_different_version_of_reality_and_i/</a></p>\n</div>\n","author":"CGRampage"}