{"rank":"26","title":"My Property Isn’t Normal (Part 4)","id":"8l7viu","url":"/r/nosleep/comments/8l7viu/my_property_isnt_normal_part_4/","time":"1526970304000","body":"<div class=\"md\"><p>Well, I’m back guys. Welcome to part four of this... documentary? Catalogue? Umm, diary? I honestly don’t know what this is anymore because i thought i would only be using this platform to tell stories of stuff that has happened in the past on this property. But now I’m being forced to bring this, journal? to the present. You see those people from that organization did come to see about the Keelut, and now there is a guy named Mark living in my house and sleeping on my couch. Well not really sleeping, more of unconscious, but we will get to that part later. </p>\n\n<p>After a few days of this “organization” ,that wouldn’t tell me their name, not showing up, i figured it was just a troll who managed to figure out my email account and hack into my personal info. But alas, on the third day HE ROSE.</p>\n\n<p>Nah not really. But four guys did end up knocking on my front door. They were all dressed pretty normally except for the matching grey combat boots that told me that these were men of ACTION. Which also means that they are gonna try their hardest to push me around and play badass. My suspicions were confirmed when the guy in the lead identified himself as Mark and immediately asked me where i “claimed” to have actually killed a Keelut. What a prick.</p>\n\n<p>“Look i still don’t know what the fuck a Keelut is and i don’t claim to have killed one, the lady in the tree said i killed one. I only assume she’s talking about the hairless coyote i killed down near the creek.” At the mention of the lady in the tree the all looked at each other with an expression of “this dude is a waste of time.” The feeling was mutual.</p>\n\n<p>I was getting a little impatient by now so i chimed in with a “if you guys are done being superior to me, i can take you to where i killed the coyote.” The one behind Mark, whose name i don’t remember, say sure let’s get this over with.</p>\n\n<p>30 mins later we are standing in front of where i killed the thing, that i now know wasn’t a coyote. Look i know i may not have clarified it yet, but i killed this thing well over a year ago, shit maybe two years. And the only reason that the “Organization” knew that i had killed it was because of the post i made earlier this week. A lot of decomposing and feeding can happen to a body in the woods over that long of a time. On top of that, i hadn’t been to this part of the property in a very long time because there aren’t any trails or interesting locations here. But i was taken aback when i saw what had happened to this body over the course of the two years it had been out here. Absolutely nothing.</p>\n\n<p>The body looked like i had shot it yesterday. Only evidence that it was older was the fact that all the blood had all seeped out of the head wound and long since dried up. But the skin and face and the fur on its paws were completely preserved. It only had fur on its paws which was odd. When we got to the body, the snickering crew of four went dead silent. “You said this was killed around two years ago didn’t you?” said Mark. “Yea but i haven’t been down here since. Why is the thing still preserved like that? What the hell is happening” I questioned.</p>\n\n<p>One of the guys who hadn’t hadn’t said a word up until this point chimed in “Keeluts are so unnatural and dark that nothing that occurs in nature will have anything to do with an authentic one, this includes bacteria, fungi, and scavenger animals.” Then he muttered something about a level 107 beast. Mark looked at me with a serious face and said, “so if this Keelut story is true, does that mean all shit you said in those posts about this place were true?” Before i could answer with a “what do you think asshole”, a low raspy laughter started to surround us and began closing in. It was coming from all directions! We looked up from the body to see at least 50 hooded figures surrounding us laughing menacingly. </p>\n\n<p>All four of the military men pulled their concealed pistols and took aim, but before they could fire a shot i called out over the laughing. “HECTOR I TOLD YOU NEXT TIME YOU AND YOUR LITTLE CHOSEN CREW SNEAK UP ON ME IM KICKING YOUR ASSES AGAIN.” Everyone paused, the chosen, the four organization men, and the the pale that had just crested a hill thirty yards behind one of the cult members.</p>\n\n<p>A few seconds later one of the hooded figures took off his hood to reveal a chubby, jolly looking face with rosy cheeks and wire rimmed prescription glasses. “Aww man, we didn’t know they were with you Cole, we thought they we trespassers. We’re sorry.” Hector said with a downcast gaze. “Why do you even need them to begin with?” I retorted. Hector hesitated for a moment and said, “our god wants a real sacrifice and those white crawly humanoid thingies just aren’t doing it for him anymore”. At this moment the pale that i could see frozen on top of the hill turned and bolted back into the woods. </p>\n\n<p>Hector then proceeded to call to the other hooded figures, “they’re with Cole, we can’t have ‘em.” There was a collective sigh as all the chosen looked at the ground and walked away into the woods. I didn’t notice until they were all gone that the four organization men hadn’t lowered their weapons the entire time. “You pussies ready to head back to the house, it gets dark in 45 minutes and if those guys got you on edge then you won’t last long at night.” Mark shot me a look that explained in detail how much he hated me, without the need for words while his three partners put on thick rubber gloves and but the Keelut into a sort of body bag. </p>\n\n<p>As we are walking back towards my house with the three stooges carrying the corpse of the dog demon, Mark starts questioning me. “What was that group back there?” “Some cult i guess, they told me they worship Cunt Hulu or something”. He seems kind of taken aback for a second and then asked “Why did they seem wary of you, but not flinch when we had guns trained on them?” “Simple, they don’t fear death, but they do crack when exposed to severe pain for long enough.” Again, Mark seems surprised by my answer. He’s starting to strike me as simple minded. “So how did you inflict this pain on them?” </p>\n\n<p>“I don’t want to answer any more of these questions”. I really didn’t. This was the kind of shit that i don’t like to dwell on. That’s was a different life, and i don’t like when it seeps back into the present. Sure, it’s nice to have the local murder cult leave you alone, but i used methods that i regret to get that luxury.</p>\n\n<p>The last thing Mark said to me on our hike back to the house was “look dude, my mind is telling me you are bat shit crazy, but my instincts are telling me that you’re a threat. Which one are you.” I looked him dead in the eyes and mumbled, “that’s up to you.” Let me tell ya, the look on his face was priceless! I love mind games!</p>\n\n<p>A few minutes later we reach the house and all four of the goons walked up to the big, black van they had arrived in. They start loading up the body and as i reach my doorknob to go inside, i hear Mark start raising his voice while talking on his phone. “WHAT? This guy isn’t even right in the head!... i know there is stuff here but why with... look let me get a team down... OK yes, he does have experience but... wait what did you just say?” He then stares at me with mixture of confusion and disbelief. They told him where i came from, i could tell by the way he looked at me. He hung up the phone without anymore arguing and began to walk over to me. </p>\n\n<p>As he reaches me he says, “my higher ups have told me that i need to stay with you for a while and keep an eye on the activity around here.” I responded with “you can’t be serious.” “Wish i wasn’t.” He said back then added, “they also wanted me to remind you that you didn’t pay for this house or this property.” With that i opened the door with my best Butler impression and gestured for him to enter MY home.”</p>\n\n<p>As he walked through the door and dropped what i assumed to be his emergency \nbug-out bag on the floor he froze.</p>\n\n<p>Can i just say one thing real quick? Fuck Skinny.</p>\n\n<p>I didn’t hear how heavily he was breathing at first because of the van was making noise as it was driving away. But as those sounds faded, i realized that Mark was breathing like he had just sprinted a marathon, his eyes were trained on the window with his body completely rigid  with his hand on his hip ready to draw his gun. </p>\n\n<p>I followed his gaze to the window where i had confronted skinny many times before. And sure enough, there he was. Only this time he wasn’t someone i recognized. This time he was a fairly attractive, tall, and athletically blond woman. She was smiling and holding a heart shaped balloon. Upon closer inspection i could tell that the ballon read, “ITS A GIRL!”.</p>\n\n<p>I rushed in front of Mark to try to snap him out of whatever trance he was in but i soon realized that tears were welling up in his eyes. By this i gathered that this woman was no longer with us, and the “girl” most likely wasn’t either.</p>\n\n<p>Fuck you skinny.</p>\n\n<p>I calmly started explaining what skinny was to Mark but soon after i started he stopped me. “I read the stories Cole. I know that you’ve talked about this thing before. But i’m trained to handle these kinds of things so don’t worry about me. Because I’m gonna FUCKING KILL IT!” With that he made a mad dash to the back door in an effort to get outside and confront skinny! I managed to block him and push him to the ground saying that “HE WONT COME INSIDE SO JUST KEEP YOUR SHIT TOGETHER AND WE LIVE!” Mark wasn’t in a listening mood though. He jumped back to his feet straight into a fighting stance! Oh great.</p>\n\n<p>After a second he threw a fast left hook straight for my face, but he wasn’t fast enough. I ducked under the swing and connected my elbow to the underside of his chin. He went out like a light, and by the time the scuffle was over, skinny was gone. </p>\n\n<p>I put Mark on the couch and now I’m typing this. Thinking about going through his computer before he wakes up. Anyways, that’s it for today. Please if anyone knows what a Keelut is let me know, what did i kill? And what did Mark mean by he was trained to deal with this kinda stuff. What is he, a monster hunter or something? I’ll try to get some answers before my next post. See y’all soon!</p>\n\n<p><a href=\"https://www.reddit.com/r/nosleep/comments/8j9y4o/my_property_isnt_normal/\">part one</a> </p>\n\n<p><a href=\"https://www.reddit.com/r/nosleep/comments/8khkip/my_property_isnt_normal_part_3/\">part three</a> </p>\n\n<p><a href=\"https://www.reddit.com/r/nosleep/comments/8merd0/my_property_isnt_normal_part_5/\">Part 5</a> </p>\n</div>\n","author":"Murderbird17"}