{"rank":"221","title":"Weird Story From Backpacking Australia","id":"8l86cr","url":"/r/nosleep/comments/8l86cr/weird_story_from_backpacking_australia/","time":"1526973940000","body":"<div class=\"md\"><p>I started backpacking around Australia about a year ago, and it’s been one of the best experiences of my life. I’ve done some really cool things, and have met some extraordinary people, but I’ve also seen a few things I can’t explain. After spending time in backpackers around Sydney and then working my way up the East coast, I’ve come to realize that backpackers have a tendency to witness weird shit all the time, especially here is Oz.</p>\n\n<p>There’s a sort of backpacking culture, it takes a certain type of person to enjoy spending the majority of your time traveling to out of the way places, living in hostels or in vans, and hitching rides long distances with complete strangers. Because of that, those people get along pretty well with each other. So, I spend a lot of my time trading stories over drinks at the beach, or during road trips, and some of them are fantastic, weird, or just plain scary.</p>\n\n<p>I always take these stories with a grain of salt, because a lot of these people like to exaggerate or are straight up full of it, but every once in a while you get someone who you can just tell has really seen something. A good example of this is a story I heard from a guy named Ethan I met up in Cairns, which is on the North Eastern corner of the country, wedged between the Daintree rainforest and the Great Barrier Reef. The city itself is beautiful, and combined with everything there is to see and do around it, Cairns is one of the best  places I’ve visited. However there apparently was a bit of a dark side.</p>\n\n<p>Ethan is from Whales, in his mid twenties, and came to Australia to see the sites and have some fun. When he got to Cairns he had already been in the country for about ten months and was reaching the end of his trip. He planed to work in the city for about a month, see and do all he could, and then fly home. One of the first things he wanted to do when he got here was see the rainforest, which is renowned for its waterfalls and swimming holes, as well as the wildlife that you’d be see anywhere else in the world. I’m talking pythons, cassowaries, koalas, gorgeous butterflies, even tree kangaroos. </p>\n\n<p>But as I was opening up another couple of a beers when Ethan was telling me this, his eyes darkened and he began to tell me about one of the rainforests more sinister denizens. A friend of his had recommended a tour  that was essentially just a guy who took a couple of people around the tablelands in a Jeep, showing them some of the cool popular spots as well as some lesser known areas. At first, everything went well. The group Ethan was with were all pretty nice and consisted of another backpacker from Denmark, an older couple from the US who were on vacation, and the tour guide, a big, very Australian dude named Riley. They went and swam at some of the popular creeks and saw a few spectacular waterfalls, his favorite being the mildly famous Milla Milla, and then they went and settled back in the Jeep as Riley asked the group what they wanted to do for the last thing of the day. Ethan immediately spoke up and asked if he knew any good places to see some of the rainforest’s massive curtain fog trees. Apparently, Ethan has always had a thing for trees and had heard that the curtain figs in northern Queensland were a sight to see. </p>\n\n<p>Riley nodded and said that they could go to one of the tourist spots and see one of the trees where the government had set up viewing platforms and everything, or if the group was ok with a bit of a hike, he could bring them deeper into the forest and show them a fantastic grove he knew of pretty far off the beaten path. \nEveryone seemed amiable to hiking to see the better trees, so they set off and drove for a while until the guide suddenly pulled off the side of the road and began to lead them up what looked like an old game trail. The trail took them uphill through dense jungle and was a lot tougher than anyone expected. After a while, the older couple fell behind and then so did the Danish guy, until it was just Riley and Ethan, who was just very committed to seeing these trees.\nAt this point, Ethan grew more hesitant, and I had to egg him on a little to continue the story. </p>\n\n<p>So they left the others at a nice little creek and continued on for another good twenty minutes of rough terrain until they finally reached the grove of curtain fig trees. \nI’ve seen trees of the same type, specifically the one all the tour busses stop off to look at, and they really are something special, but Ethan insists that this grove far off the beaten path, made the ones I’ve seen look like knee-high weeds. At first he was really glad that he made the hike because it truly was a spectacle, but after a few minutes, he noticed that the jungle was completely silent, except for Riley’s explanation of how the curtain fig trees formed. Eventually, Riley noticed it too and commented on the eerie feeling it gave him. Ethan agreed, saying that it felt like they were being watched. The guide told him to stay put while he took a quick look around the other side of the tree grove, and Ethan agreed, although not happy to be left alone. </p>\n\n<p>Riley was gone for about a minute before Ethan began to smell something vile, like musk mixed with rotting fish, which added to his unease. \nRight when Ethan was about to go looking for Riley, he heard a loud crash, almost deafening in the silence, like something fell out of the canopy from a great height. He ran towards the noise and as he rounded the corner, he was tackled hard to the ground. Surprised, Ethan went to yell out but felt someone put their hands over his mouth and recognized it to be Riley, who whispered in an insistent but panicked tone,</p>\n\n<p>“Play dead, play dead, play dead!”</p>\n\n<p>Not knowing what was going on, Ethan obeyed and lay still in the mud as rustling marked the approach of something large. He didn’t have a very good angle to see exactly what it was, and was to afraid to move, but assured me it was unlike anything he’d ever seen before. The smell alone was enough to make his eyes water, but he was able to glimpse the vague shape of a squat creature, about five feet tall, covered in red skin or fur. It crept its way towards the two men, and as it grew closer, Ethan could make out its short limbs as it crawled on all fours. When the beast was within a few feet of him, he saw that each leg ended in impossibly long, spindly fingers. Ethan grinned ruefully at me and said that he almost pissed himself when the monster bent down to sniff him, giving him a view of its mouth, which was almost three feet long in of itself, and didn’t seem to close all the way, showing off a row off toothless, rotting gums.</p>\n\n<p>The creature then stood still, seemingly watching them as they laid there still for several minutes, what seemed to be hours. Then suddenly, it got up and Ethan said that he thinks he heard it jump up and climb onto one of the nearby trees. They continued to lay there for a while longer until it was full on dusk and Riley began to get up, saying that they were probably safe now. </p>\n\n<p>On the hike back to the rest of the group, Ethan tried to talk about the monster to Riley and asked how he knew to play dead, but he was reluctant to talk about it and only answered that it was a guess based on a old story his grandpa told him. When they rejoined the group and road back the city, Ethan was too freaked out to really talk about it, and Riley didn’t mention anything either. In fact, Ethan hadn’t told anyone about it until me when I arrived in Cairns a few weeks later.</p>\n\n<p>I’m not sure what he really saw, but I was very careful to stay on the main trails when I did my tour of the rainforest. I didn’t see anything myself, but I don’t think I’ll ever forget the story. I’ve heard a handful of weird stories like this and even have a couple myself, and might post some more here soon. </p>\n\n<p><a href=\"https://www.reddit.com/r/nosleep/comments/8lqb8y/another_weird_story_from_backpacking_australia/?st=JHK43B0Y&amp;sh=1f59d8bf\">Part Two</a> </p>\n</div>\n","author":"PotatoTruth"}