{"rank":"13","title":"My haunted restaurant","id":"8l8f47","url":"/r/nosleep/comments/8l8f47/my_haunted_restaurant/","time":"1526977495000","body":"<div class=\"md\"><p>Reposting since i fucked up the title </p>\n\n<p>I&#39;m crossposting this from talesfromyourserver and adding a few more things that&#39;ve happened to me recently</p>\n\n<p>I work at a 24 hour diner as the graveyard server and things go bump in the night. I&#39;ve worked at this location for two years now and have had plenty of experiences. </p>\n\n<p>My first experience here actually happened on the morning shift during my first couple months there when a jar of peanut butter flew off its place on top of our microwave. No one was near it and me and two other servers witnessed it. That&#39;s when I learned the building was haunted. </p>\n\n<p>I didn&#39;t start experiencing a lot for myself until I switched to the graveyard shift, but I did hear plenty of stories from the GM at the time. She told me binders had been thrown at her in the office and dishes would fall out of the dish pit when she worked graveyards. She also told a story that was backed up by another worker of seeing a white mist figure leaving the restaurant on the security cameras, followed by the doorbell going off. I was skeptical at first until I switched shifts. Anyways, now for my stories.</p>\n\n<p>One of my first night shifts was the creepiest thing I&#39;ve ever experienced. Me and the night manager at the time were sitting in one of the booths resting after our huge rush. The restaurant was completely empty besides the two of us. We then heard a blood-curdling woman&#39;s scream from the bathroom. We both completely froze and he asked me if I heard that. He went to go check out the bathrooms and found no one in there. Our doorbell is really loud, so we would&#39;ve heard it go off if someone had been fucking with us. We reviewed the cameras and found absolutely nothing on them. </p>\n\n<p>I&#39;m surprised I didn&#39;t switch back to morning shifts immediately, but graveyard shifts work best with my schedule so I decided to stay. Since then I&#39;ve experienced a lot of weird shit including:</p>\n\n<p>-Footsteps running up and down the server galley when I&#39;m out on the floor. This happens pretty frequently and has been witnessed by both my manager and the night cook as well. </p>\n\n<p>-A sugar caddy flying off the table</p>\n\n<p>-The doorbell ringing by itself when no customers are in the restaurant. This happens pretty often, and it&#39;s motion activated. We replaced the doorbell about five months ago and it still goes off on its own, so it wasn&#39;t the old doorbell just being old and dysfunctional. </p>\n\n<p>-This only happens when I don&#39;t put dirty glasses in the glass rack, which only happens on busy weekends when I don&#39;t have the time to put up a new rack. I set the glasses on the counter of the dish pit and sometimes they&#39;ll flat out explode. We&#39;ve watched the cameras and seen them just go boom.</p>\n\n<p>-Speaking of going boom, I&#39;ve witnessed two light bulbs explode in our party room within 5 minutes of each other. I don&#39;t think the ghost(s?) like us sitting in the party room during the night, but we had been sitting back there because the heater in the main room was broken and the back room was much warmer. </p>\n\n<p>-I&#39;ve had a few accounts from customers who were sat in the back room during parties about chairs falling over on their own and another glass exploding. Again, apparently this only happens during the night. We have a few clubs that have their meetings during the morning once a week and to my knowledge, nothing paranormal has happened during their meetings.</p>\n\n<p>-We secure our mops on a mop rack in the back and they&#39;re actually very tough to pull out, I usually need both hands to get them unstuck. Me and my manager both heard one of the mops fall down while we were in the front room and no one else was in the restaurant.</p>\n\n<p>-I turn the music off during the night because I have hearing issues and find it difficult to hear the customers with it on. Sometimes it turns back on by itself and when I go into the office, the cabinet the radio is in is wide open. </p>\n\n<p>-The night cook has seen the cabinet open and slam shut on its own. </p>\n\n<p>-The cook has also told me about our stove turning on on its own and the timer for the deep fryer starting on its own. </p>\n\n<p>-The phone was ringing once and I went to go answer it to find it said &quot;line in use.&quot; My manager was outside smoking and couldn&#39;t have answered it, so I checked the office phone to find it hanging off the side of the desk. When I picked up the phone it was just ringing. I asked my manager if he had come back inside and picked up the phone, but he denied it. This was backed up when we reviewed the cameras and saw the phone fly off its place on the office desk. </p>\n\n<p>-I was sitting in a booth with my manager, the cook, and the afternoon server. The restaurant was empty. The salt and pepper shakers on our table fell over on their own. We all jumped out of the booth and then the shakers on the booth next to us tipped over as well. I remember the afternoon server freaking the fuck out and she quit about a week later.</p>\n\n<p>-The walk in fridge opened up right in front of me and held itself there for a good three seconds before closing. Me and my manager have also heard the fridge in the foh open and close itself despite the restaurant being empty</p>\n\n<p>-I was alone in the restaurant and heard a child say hello. I did a walk around and found nothing.</p>\n\n<p>I&#39;m pretty much desensitized to this haunting over the 10 months I&#39;ve worked this shift so far. Maybe I&#39;ll invite the local paranormal investigation team to come investigate my restaurant. </p>\n</div>\n","author":"gemmynid"}