{"rank":"4","title":"Help.","id":"8l8jhb","url":"/r/nosleep/comments/8l8jhb/help/","time":"1526979293000","body":"<div class=\"md\"><p>I don&#39;t know where I am. I&#39;m losing signal and battery, and I don&#39;t know where anyone is.</p>\n\n<p>Just some context for everyone reading,</p>\n\n<p>I was riding on a no-name long-haul bus somewhere in China with my friends, X and Y. We were visiting X&#39;s relatives on spring break, and X said we could save more money taking a coach, so we took an intercity coach from Tianjin to Shenzhen.  X is the type of serious guy who always focuses, so he&#39;s not a joker. Y is a NEET. It was painful trying to get him to come, but he did and actually kind of enjoyed himself on the trip. However, he was kind of silent. </p>\n\n<p>It was kind of late, and I remember asking X if I could borrow his charger for my phone. Then I slept. We woke up later that night, and the clock said 2:14 AM, but so much has happened since then that I&#39;m beginning to doubt simple things. There were 9 people on the bus, including me, X, Y and the driver. Everyone else besides the driver and my friends were asleep. We continued on like this for about an hour, but something seemed a little off. The road became increasingly shitty, and the streetlights became scarce. I didn&#39;t think that anything was wrong at the time. The bus then pulled over, and the driver kicked us out. Not any of the other 5 passengers off, just us. He said “巴士的散熱器壞掉了“， which roughly translates to &quot;The radiator is broken&quot;. He then ushers us into a small bus stand, and tells us to wait there. Then the bus continues moving, notably with some black smoke coming out the exhaust that none of us have seen before. X decides to use a GPS service to find the nearest place to stay, and finds a nearby village called &quot;Fuk Yip Tsuen&quot; (福葉村). Yet, I couldn&#39;t find it online, or on Google maps. (I was receiving signal from a Hong Kong SIM card, and I could have a choppy connection to Google through a HK carrier) </p>\n\n<p>Things start to get weird after this. We end up walking to the village, which turns out to be fairly sizeable. There are a couple houses, some more modern than others, and a few cars in the main road. A Chang&#39;an City Baby, a Hyundai Sonata and what looked to be a well-maintained Nissan Fengshen Bluebird SSS.  I&#39;m a huge car nerd, so out of habit I note down the cars. We end up finding a &quot;Hotel&quot;, and pay around 15RMB for the night, each person in a different room. I wake up the next day. Notably, the room didn&#39;t have any clocks, and the TV couldn&#39;t pick up any of the stations, even CCTV 4. My phone was having a crappy signal, and I couldn&#39;t check anything online.  I knock on X&#39;s door. No response. I knock on Y&#39;s door. No response. There&#39;s no-one in the village. The receptionist had a note on the table saying that he was out for tea. The same 3 cars are on the main road, but the Hyundai looks to have been crashed into and abandoned since I was in the hotel. The further I get from the hotel, the better signal I end up getting, but it still fluctuates heavily. I end up milling around the village until I get a call. It&#39;s X. Apparently, X is in a similar situation. </p>\n\n<p>The phone call goes like this:</p>\n\n<p>X- Hey OP, are you there?</p>\n\n<p>X- OP, answer me! </p>\n\n<p>X- Hey, where are you? Are you listening to me or what?</p>\n\n<p>OP- Yeah?</p>\n\n<p>X- Thank God, you&#39;re here. You notice anything strange on that train last night?</p>\n\n<p>OP- What train? You said that the bus was cheaper! We took that crappy bus, and now I can&#39;t find you. Where are you?</p>\n\n<p>X- Fuk Yip Tsuen.</p>\n\n<p>OP- I&#39;m there. Where are you?</p>\n\n<p>X- In front of-</p>\n\n<p>The call cuts out for a few minutes, but I can hear X. It sounds like he&#39;s running. </p>\n\n<p>X- There&#39;s- </p>\n\n<p>More static.</p>\n\n<p>X- chasing me, and I can&#39;t keep running. They&#39;re tall, and dressed weird. They are asking me if I&#39;m lost. Y&#39;s dead, or I think he is. I haven&#39;t heard from him. I can&#39;t see you, OP. I can&#39;t see anything. It&#39;s all black.</p>\n\n<p>The line cuts out there. </p>\n\n<p>Since the phone call, I haven&#39;t been able to get a signal until around an hour ago. </p>\n\n<p>I ended up checking some messageboards for information. There were a couple interesting articles, but nothing really. Except for 1. There were people there, and it was in english, but the grammar was all wrong and some pictures refused to load. They were family photos, and they all had people in them, people who were bleeding. Haemorrhaging black ink, from their eyes, mouth, ears. Later, the posts devolved into a  mess of ASCII text and random characters, not forming any of those images that people post. </p>\n\n<p>It&#39;s really scaring me now.  I think I should stay here, and wait.  It&#39;s only been around 5 hours since I came here. Based off of the shadows. I don&#39;t think there&#39;s anyone here.</p>\n\n<p>Signal is crappy now, I have to go. I don&#39;t think this first one went through. </p>\n\n<p><strong>Update</strong></p>\n\n<p>Those things are following me. They can see me. </p>\n\n<p>X called again, but it was just some stupid song. </p>\n\n<p>I still don&#39;t know where I am. </p>\n\n<p>The things are huge. One of them is built like a house, and another one is fat, with an engrish t shirt saying &quot;We cannot today live for nwo&quot; They all have that ink from the photos on the messageboard on them.  They are following me. I can feel their presence. They are like hunters. Have you ever felt them?</p>\n\n<p>Several things have changed since my last check-in. </p>\n\n<p>There are no cars in the town anymore. The food and drink is all covered with a thick layer of dust, and liquids in particular look like ink. There are no clocks or calendars. Several decorations were scattered around, like firecrackers. </p>\n\n<p>Funeral paper and Hell Bank Notes are everywhere. In the tellers, and on the floor around the ATM. </p>\n\n<p>The signs around the village look like someone spilled a bucket of black paint on them. </p>\n\n<p>There&#39;s a guy who looks like a train conductor. I think I&#39;m going to follow him.  He looks pretty normal. He says to get into the mountains with him, then I&#39;ll be safe. X is probably dead.Y is probably dead.</p>\n\n<p>I&#39;m still scared and lost.</p>\n\n<p>Goodnight.</p>\n\n<p>ftqeq ftuzse mdq zaf tgymz. Bdanmnxk vumzsetu. efmk mimk.</p>\n</div>\n","author":"Centuriesenix"}