{"rank":"6","title":"Plz calm me down - my brain's creating a pattern where there is none","id":"8l8ljy","url":"/r/nosleep/comments/8l8ljy/plz_calm_me_down_my_brains_creating_a_pattern/","time":"1526980106000","body":"<div class=\"md\"><p>I don&#39;t know why I&#39;m writing this, it&#39;s going to sound too weird. You&#39;ll think I&#39;m going crazy. Or having a psychosis, or some sort of paranoid break from reality. Hell, <em>I</em> think I&#39;m going crazy.</p>\n\n<p>The problem is that the most logical conclusion is bad luck. Just plain old bad luck. And I&#39;m trying to believe that, and even Job got a break in the end, so my luck has to turn soon, right? My brain is just trying to create a pattern out of random events because that&#39;s what brains do. That&#39;s why people see Jesus on toast.</p>\n\n<p>Sorry, I&#39;m not even telling this story in the right order. </p>\n\n<p>I feel like every word I say jinx me. Like, when someone tells you they&#39;re about to close on a big deal, and you say that you&#39;re gonna start planning the celebration, and they say &quot;don&#39;t jinx&quot; it? \nOnly, it&#39;s happening to me kinda in reverse.</p>\n\n<p>Gallows humor and hyperbole has been a staple of my life for as long as I can remember. My mom, my grandparents, they&#39;re all like me: we deal with tough situations by joking about them. </p>\n\n<ul>\n<li>&quot;Maybe I should kill the neighbor, I could use a few months rent-free in prison&quot;</li>\n<li>&quot;Could&#39;ve been worse, you could&#39;ve needed an amputation!&quot;</li>\n<li>&quot;Lucky me, stuck with the people I hate the most.&quot;</li>\n<li>&quot;At least I didn&#39;t break more than one leg&quot;</li>\n<li>&quot;Wonder if there&#39;s any room on the Mediterranean refugee rafts, even those have to be better than dealing with a boss like this&quot;</li>\n</ul>\n\n<p>I&#39;ll admit, it&#39;s not always been in the best of tastes, but on the whole, we&#39;ve always thought it was harmless! It&#39;s just a joke to let off some steam. \nI think of myself as a fairly optimistic person though, the gallows humor is just a way to vent.</p>\n\n<p>To put it simply, I&#39;ve had a rotten time of it lately. It started with getting pulled over for speeding. No biggie, happens to us all, right? The very next day, I slipped on the stairs and sprained my wrist. Bad luck, huh? \nAnd then my cat got sick out of the blue and had to be put down. \nMy roof caved in, taking every single cent of my emergency fund to fix.\nThen a strange and unseasonal storm hit my hometown. I live in Michigan, we don&#39;t see extreme weather THAT often. My roof wasn&#39;t fixed yet, and a large part of my house and possessions got destroyed…</p>\n\n<p>As I was cursing the world yesterday over this flood of miseries dropped over my head, I had this strange feeling. I don&#39;t know why I haven&#39;t realized it before, except that it&#39;s just way too weird of a thing. But there is something about these things that have been bothering me, and I finally figured out what it was yesterday.</p>\n\n<p>I joked about all these things happening…</p>\n\n<p>When I got pulled over, I told my mom the only thing worse than speeding tickets are sprained ankles. \nI said to my nana that the one thing that would make my week complete would be my cat getting sick.\nAnd that alll that was needed was for the roof to fall down.\nAfter it did, I stood there and joked that at least the weather was good, imagine what a drag it would be if there was a hurricane…</p>\n\n<p>You hear how ridiculous this sounds? \nThere can&#39;t be anything to it. It&#39;s just bad luck.</p>\n\n<p>Bad luck, nothing more.\nA bloody rotten time.\nThere&#39;s not anything more to it, my brain is just latching on to any pattern it can see. This is my toast, and there&#39;s a whole nativity story on it. </p>\n\n<p><strong>But yesterday, I bitterly told my mom all that we needed now was the black plague…</strong>\nI woke up early this morning but I’m fine, </p>\n\n<p><strong>Please, please tell me everything&#39;s gonna be fine and that I&#39;m worried over nothing!!???</strong></p>\n</div>\n","author":"Azlazuli"}