{"rank":"2","title":"Dave the Wrench","id":"8l8piv","url":"/r/nosleep/comments/8l8piv/dave_the_wrench/","time":"1526981572000","body":"<div class=\"md\"><p>(My name is Dave, I work at a office in the US. I am 22 years old and still live with my mother.)</p>\n\n<p>Okay, so It was a friday night. I had just come home from a long day of work, so me and my friends decided to head out for the night and just have a good time. There we were, just some casual drinking, just getting a little bit of tipsy.. We had a really great time, we danced and had a lot of fun to maybe around 1 am.  At this time we were kinda tipsy so we decided to get one more drink and then head home for the night. And this is where it all gets black.</p>\n\n<p>I remember someone walking me out of the club and then I passed out.</p>\n\n<p>When I woke up I realized I was in the trunk of a car, what caused me to wake up was because of the road being so bumpy that my head was banging against the wall simultaneously.</p>\n\n<p>After what felt like an eternity we stopped. I could hear that the guys from inside opened the doors and went outside. I heard their voices coming closer and closer towards me and then they stopped just outside the trunk. They opened the trunk just enough so a slight beam of light comes in, and left it there. I could see a car coming towards us in a high speed, but then it slams on the brakes and stops, you could even hear the brakes screeching. I heard what I think was a series of shots from really close, and since it was such a chaotic moment I used it to my favor. I looked around me and saw a wrench, I swiftly grabbed it and opened the trunk just a little bit, so I could see better and wait for the perfect moment to jump out. A couple of second later I saw what seemed like two east-european men standing to the right of the trunk. They began talking to each other in a language I couldn’t understand, after a while one of them nodded and went to the guy who was laying down. Dead.</p>\n\n<p>I knew this was my moment. This was the only chance I had, if I wanted to survive I had to get out of the trunk, NOW!</p>\n\n<p>I quickly opened the trunk, jumped out and swang the wrench in the man&#39;s head so hard that he fell to the ground. I took up his 9mm weapon and at the same time I could see his friend turning around towards me. I aimed at his chest and shot twice.</p>\n\n<p>I crouched and started searching one of them, I found his cellphone and started looking at his contacts. Nothing. Then I checked his recent calls and saw alot of calls all coming from the same number. But I still didn’t know who it was, so I decided to call the number. The person finally picked up after 3 tries of calling and answered with a russian dialect. The only thing I heard clearly was a name that was something similar to Semon Molevish. After this I looked at the other guys phone and this guy actually had several contacts saved in his phone and one of them had the name “Semion Mogilevish”. I realized they both worked for the same person.  But I had noooo idea who this guy even is.</p>\n\n<p>I took the gun with me and drove home to my apartment and tried to get some rest.</p>\n\n<p>But I just couldn’t. There was this one thing haunting my mind.</p>\n\n<p>I HAD to google it. And it turns out he is one of FBI&#39;s most wanted.</p>\n\n<p>For 2 days in a row I couldn’t sleep almost anything at all, I was so scared that the russians would find me and strangle me in my sleep.</p>\n\n<p>When it was Monday again, I went to my job. I did my regular schedule and was working on as usual.</p>\n\n<p>Suddenly, in the middle of the day, my mother calls and starts yelling. I couldn&#39;t really understand why until I actually started to listen to her.</p>\n\n<p>She said that someone had given her an anonymous letter at the mall today, and that if she didn’t get out of the country within 8 hours, they were going to kill both her and me.</p>\n\n<p>She continued to scream and said that I needed to give her a weapon, 10,000 dollar and my car. I was shocked and told her everything was going to be just fine, and that I was on my way to my apartment.</p>\n\n<p>I hang up at her, jumped up from my chair, and started running towards the elevator.</p>\n\n<p>Right when the elevator opens up at the main entrance, I heard a big explosion. I ran to the parking lot and realized that is was my car who was exploded, and I didn’t notice it first but there was a pack of midgets who stood a couple of feet away from my car with melee weapons, and as soon as they spotted me, they started to run towards me.</p>\n\n<p>I ran back inside the building and called my mother, yelling that she needed to pick me up at the back entrance at my office as quick as she could with her father’s chevrolet, because mine is blown up by some crazy people.</p>\n\n<p>When she came, I sprinted to the car and opened the door to get in.</p>\n\n<p>We drove as fast as we could towards the borders. And as soon as we crossed the borders to Canada. We stopped to get some food, and that’s when my mother and I got a text at the same time from the same number, saying “4d65206b696c6c2068696d2e0d0a333030363436”</p>\n\n<p>Still got no idea what the fuck this means.</p>\n</div>\n","author":"UpsetStudy"}