{"rank":"101","title":"The Population Bracelet","id":"8l8vre","url":"/r/nosleep/comments/8l8vre/the_population_bracelet/","time":"1526983961000","body":"<div class=\"md\"><p>Hey everyone. I&#39;m here to warned you about the horrifying event that just happened in my country. Sorry for being messy and for being not so clear, as it happened really fast.</p>\n\n<p>If this incident haven&#39;t reach your country, it most likely will. So, I warn you to look for a way to save yourselves while you&#39;re reading this.</p>\n\n<hr/>\n\n<p>The Population Bracelet has been a mandatory equipment for every citizen for about a decade. I can&#39;t remember for exactly how long. The bracelet looks like a wristwatch, but instead of showing a time, it shows a number. A rank. The wearer&#39;s rank in the population. The oldest person on earth has number 1 displayed on their bracelet&#39;s screen, and so on. </p>\n\n<p>Mine? It displays 5 billion something. I&#39;m only 30 years old right now.</p>\n\n<p>Yesterday I woke up in my apartment&#39;s room, staring at the scenery outside my window, then I stared at my wrist. My bracelet still displays the number of 5 billion something on its screen. Another twenty-something is added to my number. It means that a number of people, somewhere around the world, died in the last few hours.</p>\n\n<p>Of course, a number of new babies were also born during that time.</p>\n\n<p>I still don&#39;t understand why the usage of the bracelet are made mandatory by the government around the world, up to the point where someone goes out of their house without it, it considered a crime. And they will be charged with 24 hours in prison. Doesn&#39;t makes sense.</p>\n\n<p>I do realize that for the past few decades, the world has been in an overpopulation, and a solution to it should be provided before it&#39;s too late. But still, the monitoring method doesn&#39;t make sense to me. Maybe the government needs to monitor the population, but why do every citizen need to see their ranks in the population, and also the increasing and decreasing number of it every day?</p>\n\n<p>The government didn&#39;t give a specific explanation about the &#39;why&#39;. My best guess is that, if we know the increasing number each day, maybe we will think thousand times before deciding to make more babies.</p>\n\n<p>Maybe.</p>\n\n<p>The only thing I heard about it is a rumor saying that it&#39;s dealing with the human&#39;s population control project that the government around the world has been working on.</p>\n\n<p>The government said that they can&#39;t reveal everything about it yet, but they promise they will. Soon enough, they said, when the project is ready.</p>\n\n<p>I skipped the thought that filled my mind almost every morning and got to the bathroom. I would spend the next few days of my holidays in my parents&#39; house, out of town. I haven&#39;t seen them in months due to work.</p>\n\n<p>Once I was done with the preparation, I grabbed my car&#39;s key and take off. </p>\n\n<p>My mom greeted me with so much love and passion when I arrived at my parents&#39; front door. She hugged me so tight as if I was a 7-years-old boy who had been missing for 3 years. Like she always does.</p>\n\n<p>The first day in my parents&#39; house went like how it always be. We spent the night talking in the dining room, sharing stories we didn&#39;t know about each other during the time we were apart. When the clock ticking at 10 pm, I asked to go to my room upstairs. I was tired from the trip and quickly fell asleep.</p>\n\n<p>When I wake up today in the morning, I feel strange. I can&#39;t describe why.</p>\n\n<p>I do the first thing I do every morning, I pull up my right arm to check on the bracelet that I never put off, even when I sleep. I don&#39;t want to stay in a prison for 24 hours, just because I left it at home.</p>\n\n<p>I check the number displayed on its screen. I thought my eyes play a trick on me because the number displayed on my bracelet doesn&#39;t make sense. I look at it over and over, I opened my eyes wider every time. I shake my bracelet several times, just in case there is a malfunction on the machine.</p>\n\n<p>The number still not change.</p>\n\n<p>The number displayed on the screen is 2.</p>\n\n<p>Number 2? I wake up in the morning, and all of a sudden I am number 2 in population rank? Which means, when I wake up today, I am the second oldest person in the world.</p>\n\n<p>What the hell. That doesn&#39;t make sense. I&#39;m only 30 years old. How could I shift from 5 billion something to 2 in just one night?</p>\n\n<p>I immediately run into my parents&#39; room. I just want to ask them if their bracelet is having a malfunction too. I mean, if I shifted to number 2, then what about them?</p>\n\n<p>I knock on my parents&#39; door before opening it, only to witness a horrifying scene in the room.</p>\n\n<p>On the bed inside that room where there should be my mom and dad, lay something else. 2 babies, laying side by side on my parents&#39; bed.</p>\n\n<p>&quot;What the hell? Where are my parents? Whose babies are those?&quot; I thought.</p>\n\n<p>I quickly run towards the babies on the bed, and I stare at their faces alternately. My parents showed me their photos when they were kids and babies last night, and those babies on the bed look just like them.</p>\n\n<p>If someone sees me, they may think I&#39;m crazy, because I stared at the female baby, and ask, &quot;mom?&quot;</p>\n\n<p>The female baby silently stares back at me, with shock, horror, and confusion in her eyes. The same shock, horror, and confusion I also see on the male baby&#39;s eyes. From the look in their eyes, I can tell that they really are my parents, somehow reverted to babies.</p>\n\n<p>&quot;Wa... Wait...&quot;, I stutter. &quot;Wait here, okay?&quot; I tell them in frantic before running outside the house.</p>\n\n<p>The neighborhood is so silence. It&#39;s completely unusual, as my neighborhood is in the city with the highest population in the country. I run to Mr. and Mrs. Stevenson&#39;s house next door. The door isn&#39;t locked, so I walk in. &quot;Mr. Stevenson? Mrs. Stevenson? So sorry, I really need help&quot;, I shout in panic. But when I reach the living room, I see 2 other babies laying in there.</p>\n\n<p>One baby laying on the couch, next to today&#39;s newspaper. The other one laying on the carpet on the floor, next to a vacuum cleaner that is still on.</p>\n\n<p>Mr. and Mrs. Stevenson are African-American, and both babies in the living room are also African-American. Seeing what had happened to my parents, I immediately think that the Stevensons are also somehow reverted to babies. And it looks like Mr. Stevenson was reading the newspaper, and Mrs. Stevenson was cleaning the house when it happened.</p>\n\n<p>Something horrible is happening, and I don&#39;t know why.</p>\n\n<p>When I&#39;m about to run outside, looking for another people in the neighborhood, I see the news in the Stevenson&#39;s television. It&#39;s a flash news where the news anchor frantically informing an incident that explains what just happened.</p>\n\n<p>A few hours ago, according to the news anchor, a government research facility had exploded. </p>\n\n<p>The government has been working on a research called &quot;Age Inversion Drugs&quot;. According to the news, the drugs are primarily to be used on death sentence convicts. The drugs, when consumed, will reverse the aging process of the users, at a super speed. </p>\n\n<p>The users who consumed the drugs will grow younger, and younger, in minutes. The end process should make the users&#39; ages and bodies revert to teenagers, to babies, and eventually to sperms before they turned back into what they were before they were born: nothing. They will vanish. Gone. For good.</p>\n\n<p>The drugs also work very well even when it&#39;s put into the stomach of a user who already died. The drugs will chemically react and reverse the aging process of the dead bodies, shrink them into nothing.</p>\n\n<p>That is one way to solve the population problem: the government will no longer have to provide burial sites. The land can be used to produce foods instead.</p>\n\n<p>The main problem with the explosion in the research facility is that the drugs aren&#39;t perfect just yet. It&#39;s not yet reverting the users&#39; bodies into nothingness. Right now, it just reverses the aging process, and stop at the age of 6 months. It shrinks the users and reverts them to babies.</p>\n\n<p>Now, because of the explosion, the drugs, which formerly stored in a tank, changed its form into gas and quickly spread all over the country.</p>\n\n<p>By the time the news anchor says the last information, she suddenly stops and twitches. And for the next five minutes, her body shakes while shrinking fast. When the process is over, she sits on the floor, now in a form of a baby, looks horrified and confused.</p>\n\n<p>Now I realize what had happened, my brain thinks fast. Maybe everyone had already exposed, and it looks like the reaction started from the oldest to the youngest. My parents and the Stevenson who are 60 years old already reverted to babies a few hours ago.</p>\n\n<p>The news anchor, whom I know is just a few months older than me, just reverted to a baby a moment ago. Right before my eyes, live on TV.</p>\n\n<p>In panic and horror, I stared at my population bracelet on my wrist.</p>\n\n<p>It shows number 1 on its screen.</p>\n\n<p>If my assumption is right, then it means, I only have minutes left before I too, revert to a ba...</p>\n</div>\n","author":"ParanoidLetters"}