{"rank":"23","title":"The Dead House","id":"8l8v8g","url":"/r/nosleep/comments/8l8v8g/the_dead_house/","time":"1526983795000","body":"<div class=\"md\"><p>On the edge of a backwater town in Florida, standing on the remnants of a beach that’s all-but washed away, there is a building from a bygone time. Once, it was no doubt a grand structure. Four tall turrets, a beautiful door made of heavy, hand carved wood depicting scenes of ships and the sailors that piloted them to new and strange lands. But in Brandon Bay, we just call it the Dead House.</p>\n\n<p>Legends surround it as thickly as the fog that settles in on cold nights. The story I heard, and the one I told a thousand times, was that it belonged to a Spanish sea captain who retired with his true love. When he died from a disease long dormant during his long journeys, his lady love threw herself into the sea hoping that there they might be together forever. </p>\n\n<p>The ghosts said to walk the Dead House drew kids to it a few times every year. Though he tried, not even the sheriff’s regular patrols could keep the curious mind of a half-scared, half-stupid teenager from exploring the ancient manor. The walls crumbled, beaten down by sea-spray, and the floors tilted precariously on their foundation of sand and porous stone. I passed it a hundred times, crossing the bridge that led out of our small fishing village to the private school in Tampa where my mother insisted I would find a place I belonged.</p>\n\n<p>It was inevitable that I would end up standing in front of that door and, like so many before me, I would not stand alone.</p>\n\n<p>“Open it!” Dee squealed, her voice echoing back at us from the pitted ruin. </p>\n\n<p>“I’m going, I’m going.” I lied. The door was not at all what I expected; the stories said it was covered in ocean scenes but they failed to mention the detailed depictions of men being ripped apart by tentacles, their faces contorted with pain. Monsters covered the door in all shapes and sizes. In one corner, mermaids held men down, presumably drowning them while another etching depicted a giant crocodile-like creature with a sailor trapped between its teeth. </p>\n\n<p>“I got it babe,” Dee’s boyfriend, Max said. He stumbled up the steps, already drunk from the flask in his pocket, and shoved the door with his shoulder. “S’locked.” </p>\n\n<p>“I’ll do it.” Abby sighed, her ponytail bouncing as she moved past me. She was, I thought, something special. Bold, pretty, brave, with an easy smile and a way of making everyone feel important even when they weren’t. I might have loved her if I ever got up the courage to hold a full conversation with her. With a click and a creak the brass handle on the door turned beneath Abby’s touch. “It’s not locked, you’re just wasted.” </p>\n\n<p>Max and Dee walked in, clutching each other like two drunk sailors lurching on a stormy sea. Abby looked back at me with one of those smiles that makes the world stop for a second before turning to walk through the door herself. I stood on the porch, the images of sailors and monsters seemed like a warning. A bell rang in my head that I, young fool that I was, dismissed with a shake of my head and a forced smile. I followed Abby through the door, her brown ponytail reflecting light like a bouncing wisp guiding me deeper into the dark house.</p>\n\n<p>“Woah,” Abby whispered ahead of me, stopping dead in her tracks. “Who was this guy?”</p>\n\n<p>I angled my flashlight up, following Abby’s gaze with the beam. Directly above us, just to the right of the open door, hung a painting showing a stern man in some sort of naval uniform staring down. His jaw was strong, eyes bright and sharp, but there were lines and creases around his mouth and forehead that suggested age. For a moment it almost looked like the eyes moved, surveying the trespassers who dared disturb his family home. I looked at Abby, wondering if I should ask if she saw it too, but then a scream from inside the house sent us running toward our friends.</p>\n\n<p>Racing through the dark, the floor creaked and heaved beneath us with each step. Abby stayed in the lead, guiding us to the back of the house where we found Max in tears, Dee grasping on to him like her life depended on it. </p>\n\n<p>“What happened?” I screamed, looking around at the large, shelf-lined room I was now standing in. </p>\n\n<p>Max gasped and for the first time I noticed that he was a smiling. “Just,” he breathed deeply, trying to contain a bout of laughter, “Just a dead bird. Was trying to get a fire started and a bird fell out of the chimney.”</p>\n\n<p>I looked over at the fireplace, my heart still racing from the adrenaline that flooded my veins the second we heard the scream. It was an old brick thing recently filled with smooth pine logs that, I guessed, Max pulled from the neat pile of logs sitting next to it. On top of the pine logs was a black splotch that, even with a bright LED flashlight, was barely more than a mass of broken and crumpled feathers. </p>\n\n<p>“I got this,” Max said, prying Dee off of him and grabbing the bird by one broken wing and tossing it out of a shattered window. “We’re gonna take the couch here. Get a nice cozy fire going, drink some booze. Why don’t you guys head upstairs?” </p>\n\n<p>Abby wasn’t paying attention, she was busy looking at a shelf filled with rows of rotting books, but I could take a hint. “Sure. Abby, what do you say?”</p>\n\n<p>“Uh-huh,” she grabbed a thick, leather-bound book and turned around. She smirked at Max, her eyes twinkling.  “Yeah, sure. Just be careful down here, Dee. Never know what you might catch.”</p>\n\n<p>The roar of a fire, how he started it I have no idea, followed us out of the old library. </p>\n\n<p>Wide, hand-carved banisters not unlike the door outside guided us up the creaking stairs. There were no horrible scenes of despair and death carved into them, thankfully. Instead, girls in flower-print dresses chased rabbits and picked flowers. They were scenes of a good, happy life. “A woman’s touch.” Abby mused, tracing the images with her fingertips. </p>\n\n<p>“That book. What is it?” </p>\n\n<p>She handed it to me as we reached the top of the stairs. Chipped gold leaf glinted in the light, barely legible after years in the dank house. “Diary of Marigold Velez.” I read out loud. “You think she lived here?”</p>\n\n<p>“Let’s find out.” Abby snatched the book and disappeared down the dark hallway at the top of the stairs, shining her flashlight into each room she passed. The door at the bottom of the stairwell drew my eyes. Though it was smooth from that side, I knew what horrors waited behind it. I imagined, or I like to think it was imagined, that I could hear tiny screams of the terrified sailors being pulled into the depths. By the time I pulled my eyes away and looked up, Abby was gone.</p>\n\n<p>“Abby!” I ran down the dark hallway, my light flashing into rooms, barely taking in the nursery with its abandoned crib or the guest rooms filled with rotten furniture and crawling insects. “Where are you?”</p>\n\n<p>Something moved in one of the rooms as I passed and my feet stopped moving. A soft scratching came from behind the door of a small study, its space mostly taken up by an ancient writing desk covered in handwritten notes. My flashlight swept across the room, but I resisted the urge to poke my head in and look around corners for the source of the noise. Standing on the precipice of discovery, with the unknown waiting for me to take one small step, I froze.</p>\n\n<p>A hand touched my shoulder and I let out a sound somewhere between a scream and a gasp, jumping and turning on my unknown assailant, flashlight raised over my head. The first thing I saw were white teeth flashing in the light and my animal brain took over. I pressed back against the doorway, my feet sliding on the rotting boards beneath them. </p>\n\n<p>“Breathe,” Abby said. Her mouth pulled up at the corners, bright eyes pinched with the effort of holding back a laugh. “It’s just me.”</p>\n\n<p>“Abby,” I sputtered, “What the hell?”</p>\n\n<p>“Sorry, I couldn’t resist. Come on, there’s something you should see.” She grabbed me by the hand. Her fingers were long and delicate, but strong as she pulled me toward a room at the very end of the hall. Through a window placed there, I could see the bridge leading home in the distance. Perhaps if I’d run then and there, Abby would have followed and the nightmares wouldn’t be so vivid, so haunting. But then, if she didn’t follow how might it all have ended?</p>\n\n<p>A canopy bed stood against one wall of what I took to be the master bedroom. Opposite the bed, two massive paintings stood above a grandiose fireplace. One portrait I knew, it was the man whose painting hung above the doorway in the foyer. The other depicted a blonde woman, her slender fingers gripping white lilies against a satin blue dress. She was beautiful; the artist captured that beauty with exceptional talent, but there was something else. Something behind rich, green eyes that spoke of sadness and loss. </p>\n\n<p>“Get a grip, I’m pretty sure she’s dust by now,” Abby teased. I realized I’d been staring and turned my gaze to the little gold plaques beneath each portrait.</p>\n\n<p>“Captain Ernesto Velez,” I read the name of the man whose eyes seemed to watch us from his painting, “And Marigold Velez.”</p>\n\n<p>“Exactly,” Abby said, holding up the book. “She had to be his wife, right?”</p>\n\n<p>“I guess,” I looked at the paintings. The man on the right might have been twenty or thirty years older than Marigold. </p>\n\n<p>“Different times,” Abby said. “Come on, sit down.”</p>\n\n<p>Abby sat on the edge of the bed, the book open in her lap. “Should we really read that?”</p>\n\n<p>“Why did you drag us all out here, Alex?” </p>\n\n<p>What was I supposed to say? Tell Abby that Dee set this up because she knew I was pining over her?  That a spooky house filled with ghost stories seemed like the right place to let her know how I felt? The words caught in my throat and I panicked. “To see if the old legends were just bullshit.” </p>\n\n<p>“Well, then. Let’s find out.” Abby rifled through the pages and, filled with misgivings, I sat next to her as she read the diary of Marigold Velez, the wife of the man who built the Dead House. the hand-writing was old-fashioned and, perhaps unsurprisingly, in Spanish. “Damn.”</p>\n\n<p>“Hand it here,” I said, looking at the neatly penned letters.</p>\n\n<p>“You can read it?” </p>\n\n<p>“My abuela would be disappointed if I couldn’t,” I said, sitting next to here and looking at the pages. “March 15th, 1883. Ernesto returned from his trip two days ago, but something happened on the water. He will not talk about it, but he’s been working on the door since he returned. He does not eat, does not sleep. He says when it is finished, I’ll be safe.”</p>\n\n<p>“He carved all those freaky images?” </p>\n\n<p>“Looks like. Let’s see. This one’s dated April 2nd,” I read, “There is a light in the attic. Ernesto tells me not to worry about it. He says that he is working, but I hear him screaming late into the night. Whatever happened at sea, he has brought the devil back with him. I have reached out to Father Perez. He says he will call on us tomorrow. I pray it is not too late.”</p>\n\n<p>I stopped, afraid to flip to the next page and discover the truth. Like most kids growing up near the old house, I always figured it was just an abandoned house. The ghost stories were just a way to make something mundane interesting. Coming here, I was nervous about my time with Abby. About her response to my confession, I wondered if we’d kiss and if that kiss would mean anything. But the truth of the house’s bloody past was something I never expected to find. The words crawled on the page and my fingers shook, curling the edges but not able to turn them. Hairs on the back of my neck stood up and I turned toward the paintings, staring at beautiful Marigold and her stern, and insane, husband. If the paintings were watching us, they showed no sign.</p>\n\n<p>“Go on!” Abby pushed my shoulder.</p>\n\n<p>“Sure, sure.” I turned to the next page. The words were scrawled quickly, imprecisely as if written in a great rush. “Huh, it jumps a bit. May 3rd. The light never goes away now. Its tendrils reach down from the doorway, crawling further each passing night. I pray, but god no longer listens. Father Perez has not been found. The sea has taken him into its black embrace. Words echo through my dreams. Return to me. Come home. Ernesto no longer leaves the attic. I’ve sent away the help. this too shall pass. Please let it pass.”</p>\n\n<p>“There’s one more, read it” Abby thumbed through the journal. </p>\n\n<p>“Are you sure?” </p>\n\n<p>“Don’t you want to know how it ended?”</p>\n\n<p>I didn’t, but Abby smiled at me and the stone in my chest lifted just long enough to read the final entry of Marigold Velez. “May 30th. The sea has called my husband home one last time. He will not return from this trip, and for that I feel much relief. Still, my dreams are not quiet. Something calls to me as well, but it comes not from the sea, but from above. When the sun falls behind the waves, light will creep down the attic stairs once more. Tonight, I will follow it.”</p>\n\n<p>Shutting the book, I breathed in the night air. Salt hit my tongue, a taste of the waters just behind the boarded-up windows of the room. A taste of tears.</p>\n\n<p>“Well?”</p>\n\n<p>“Well what? That’s all she wrote,” I said, hoping that was all she meant.</p>\n\n<p>“The attic!” She said.</p>\n\n<p>“It’s an old house. Sitting by the water, abandoned. I don’t think it’s safe.”</p>\n\n<p>“C’mon. We’ll get Max and Dee to go too.” She pouted at me. “I’ll be careful. Promise.”</p>\n\n<p>I shrugged, put the book down, and held my breath as Abby hugged me and shouted for our friends to come upstairs. The decision to look in the attic, a place of dread for a woman 100 years in her grave, made my heart thump more than even the feel of Abby’s arms around me ever could.  Footsteps rushed up the stairs and Abby and I walked out of the room just in time to see Max rushing out, a piece of rotting wood held in his hand.</p>\n\n<p>“What’s wrong?” Max barked. “We heard screaming.”</p>\n\n<p>Abby laughed and filled in Max and Dee about the journal. “So, what do you think?”</p>\n\n<p>“Digging around some dead guy’s attic wasn’t exactly what I had in mind tonight.” Max said, glancing at Dee who was still buttoning her blouse behind him. “Babe?”</p>\n\n<p>Dee glanced at us and shook her head. The smirk she wore said it wasn’t what she thought we’d be up to either. “Why not? The sooner we check it out the sooner these two can get back to bed.”</p>\n\n<p>“Dee!” Abby laughed and led the way, stopping dead center between the bedroom and the grand stairway leading down, facing a white door whose only remarkable feature was a single symbol carved into it. A ship sitting atop gentle waves. “I’m pretty sure this is it, guys.”</p>\n\n<p>“How can you tell?” Dee stepped close, peering at the carving.</p>\n\n<p>Abby pointed down and my stomach dropped. Seeping in to the dark hallway from beneath the door was a sickly, yellow light that danced at the edges of her toes. Dee gasped and clapped her hands together, thrilled at the mystery waiting behind the door. Marigold’s final words bounced through my skull. Was she still up there, the captain’s sad wife? Waiting for intruders to find her? To release her? Insane fantasies ran through my mind, but for all my wild imaginings I couldn’t come close to guessing the horrible truth that awaited four young fools in that haunted place. </p>\n\n<p>“Somebody’s already here?” Max grunted. “Hope they brought some beer, we’re almost out.”</p>\n\n<p>“Don’t be stupid,” Dee said, “We’re miles from anything and your car’s the only one around.”</p>\n\n<p>Abby grinned at Dee. “Ready?”</p>\n\n<p>I stood back, still stuck in place by the door to the master of the house’s bedroom. I felt his eyes on me, staring down from the painting much like I did when we first entered his house. The faint sound of water dripping onto wooden floors hit my ears and I jerked my head around sure I’d find the captain behind me. His face pale, dead skin crawling with crabs and covered in coral like some ghost pirate from a horror movie. </p>\n\n<p>“You coming?” I jumped at Max’s voice. The room behind me was empty, but still I heard water dripping from somewhere inside. “Don’t want to stand here all night.”</p>\n\n<p>“Yeah.” My voice was just above a whisper. “Yeah, I’m coming.”</p>\n\n<p>Max disappeared into the long, narrow hallway, his flashlight bouncing with each step until it vanished at the top. There was a shimmer coming from somewhere inside, a light that danced like motes of dust in the air. I looked back, the sound of water dripping in the nearby bedroom was loud with no other sounds in the house. I expected to hear Abby and Dee rummaging through whatever mysteries awaited us upstairs, but even the creaks of feet on ancient salt-eaten boards was strangely absent.</p>\n\n<p>“Guys?” I called up, hearing nothing but my voice echo back. “Abby? Dee?”</p>\n\n<p>The first hesitant step was the hardest; after that I raced up the remaining steps ignoring the groaning beneath my feet. I rushed through the doorway at the top and blinked in the sudden glow of a bright, pale yellow light. Something crunched beneath my feet and I looked down to find hard stone littered with tiny shells from long-dead sea creatures. “What?”</p>\n\n<p>“Look!” Abby yelled from a distance. I followed her finger toward what, to my surprise, was open sky. A lazy yellow sun hung low over a deep gray sea. Behind me, a hole in the world seemed to lead back down the stairs and into the old house. All around, though, was the rocky shore of a deserted world that belonged only to us. </p>\n\n<p>“How?” I yelled over the sounds of crashing waves. Abby squatted a hundred yards away, digging through the shells. Dee and Max were further along, running toward the endless stretch of gray water at the edge of the pitted stone. </p>\n\n<p>“Come here,” she yelled back at me. “Look at these!”</p>\n\n<p>I hesitated. Behind me, the shimmering hole offered the safety of the known. There was a choice to be made. Return home and forget about the strange sea that stretched out eternally before me, or go forward and explore that new place with Abby. She smiled at me, holding something up into the light, beckoning me to join her. I chose without thinking, my feet carrying me away from the gateway back to the abandoned home and toward an ocean I could only describe as alien. </p>\n\n<p>“It’s almost like a conch, but listen.” Abby held the shell up to my ear the moment I was in range. The familiar sound of waves was notably absent, instead I heard a high, keen whistling like a too-long note played on a child’s flute. “Weird, right?” </p>\n\n<p>“Where are we?” I asked, not sure how I expected her to know any better than I did.</p>\n\n<p>“Not sure. What took you so long, anyway?”</p>\n\n<p>“Huh?”</p>\n\n<p>“Well, watch stopped working when we walked through that hole, but it took Max about ten minutes to get here, and you were twenty minutes behind him.” Abby cocked her head to the side, ponytail bouncing.</p>\n\n<p>“No way?” I shrugged and looked around. “Guess I lost track of time.” </p>\n\n<p>“Or maybe time moves different here? Wherever here is.” </p>\n\n<p>In the distance, Dee and Max splashed in the gray sea, their clothes abandoned on the shore. I stopped to take in the sight, memories of the journal replaced with wonder at the place I found myself. Jagged mountains stretched out on three sides, surrounding the bowl where we stood. Tall, thin trees stood along the edges of those mountains, greenish-purple leaves stretching like tendrils toward the strange sun overhead. “Maybe.” </p>\n\n<p>A scream pulled me away from my examination of the alien landscape and sent Abby darting toward the gray water. I rushed after her, questions forgotten in our mad rush into the unknown.</p>\n\n<p>“Dee! Max!” Abby yelled, her gaze sweeping over the waves. “Where are you?”</p>\n\n<p>Standing next to her, I bent over trying to catch my breath. There was no sign of Dee and Max in the water and no response to the calls. Beneath the rolling sounds of the sea I caught a hint of something, but before I identified it Abby shouted again, calling for our missing friends. “Shhh.” I hushed her, “Listen.”</p>\n\n<p>There it was, soft sobbing drowned out by each soft crash of water against stone. “It’s coming from there,” Abby said, pointing toward a large pile of boulders against the edge of the mountains. </p>\n\n<p>“Why would Dee be there?” </p>\n\n<p>“I don’t know.” Abby pulled her flashlight out of her back pocket and started toward the boulders. “She could be hurt.”</p>\n\n<p>I followed behind, my long-handled flashlight held in white knuckles hung at my side. I remember well the self-admonishment, the self-loathing that filled me then. <em>Coward.</em> A voice spoke inside my hea<em>d. Yellow. Going to let her go in first? If she screams are you going to run aw</em>ay?</p>\n\n<p>Thankfully, I never had to answer that. Dee came crawling out from between the rocks as we drew close. Long scratches ran down one side of her face, razor-thin and oozing blood. She was naked and without thinking I averted my eyes, but not before I saw the purple bruises circling her waist.  Large, circular bruises that pulsed with every breath she took.</p>\n\n<p>“It got him.”  Dee said. “Something. In the water. Max!” She ran, screaming toward the water. Abby went after her, grabbing at her friend’s arm, pulling her back away from the foamy, rocky edge where water met land. Abby almost had her hands around Dee’s shoulders when the water bubbled and churned; bubbles as big as a man rose to the surface then popped with enough force that even a hundred feet away from the shore I could feel the breeze on my face. </p>\n\n<p>I froze. Panicked, all I could do was scream. “Watch out!” before a great mass of yellow-black flesh lashed out of the water toward the two. Dee screamed Max’s name, holding the last syllable even as a tentacle wrapped around her ankles. I couldn’t see what it belonged to, the main mass of the creature stayed beneath the opaque waters. The tip was almost snake thin where it wrapped around Dee’s thighs, but the point where hideous flesh met unforgiving ocean seemed fifty feet around. With one last cry of her boyfriend’s name, Dee was pulled violently beneath the waves.</p>\n\n<p>Abby sat on the ground, knocked back by the sudden violence. The sight of her so close to that creature’s hunting grounds spurred me to action, my legs moving seemingly without command. “We have to go.”</p>\n\n<p>“Dee!” She screamed, not looking back at me, maybe not even noticing I was there until I laid a hand on her shoulder. Then, her voice dropped to a whisper. “Max. Dee.” </p>\n\n<p>“We have to go. Now!” I screamed, pulling her arm and ignoring the twinge of guilt when she let out a pained yelp. “We can’t stay here.”</p>\n\n<p>Abby let me lead her along the rocky beach toward the mysterious hole in the world. She didn’t struggle, but she didn’t help either as I pulled her toward our escape. Shells cracked beneath my feet and somewhere in the distance a creature squealed, caught by some unseen predators in the forests of that strange world. </p>\n\n<p>Fear overtook sense and I rushed us headlong through the opening and toward the steep, ancient stairs below. We tumbled end over end, our bodies entwined in a way that, once, I would have killed for a chance to feel. Each step hit a rib, elbow, or shoulder with a sickening thud. A loud crunch made my heart jump, and I wondered if in my rush to escape one death, I’d led us into another. </p>\n\n<p>“Get off of me,” Abby wheezed beneath me, her arms pushing me away. She pushed me aside, struggling against the wall to get up. Her breathing was labored and a bright red gash in her forehead gleamed in the beam of her maglite. “I have to go.”</p>\n\n<p>I propped myself up against the wall watching Abby run down the old hallway and disappear around the corner. I don’t know how long I stood there, or how long we were on the beach, but when I looked at my phone, the clock showed midnight. I called the police and waited, my breathing labored and a sharp white pain spreading from my chest until the paramedics arrived.</p>\n\n<p>Things changed after that night. The light at the top of the stairs, that pale, sickly light from another world, faded to black long before the police showed up. Upstairs they found nothing but the remains of an ancient study, its papers too weather-worn to read.  Once I got out of the hospital, two broken ribs my reward for my part in that terrible night, Abby and I avoided each other at school. Perhaps we were both afraid that if we spoke, we would have to speak of that night on an alien world where we discovered just how small and fragile humanity made us. Perhaps we were just ashamed that we lacked the courage to return and look for those we left behind.</p>\n\n<p>When I turned eighteen, I left the seaside town where I was born and never looked back. I heard the old house collapsed during a storm some years back and now there’s nothing left but barren rock and two weathered crosses left in remembrance of the two teens who went to the Dead House and never came home.</p>\n</div>\n","author":"JackBixby"}