{"rank":"11","title":"My New Home Feels Wrong Somehow","id":"8l8xng","url":"/r/nosleep/comments/8l8xng/my_new_home_feels_wrong_somehow/","time":"1526984616000","body":"<div class=\"md\"><p>11th of October, 2014. Entry 1:</p>\n\n<p>I don&#39;t really know how to start this off, so I&#39;m just going to try my best.</p>\n\n<p>My name is Will Nordstrom and I&#39;m eleven years old. I&#39;m writing this because I&#39;ve been really stressed lately and so my mum sent me to a therapist back in Sydney. The guy used a bunch of words I didn&#39;t really understand, but one thing I did get was that he wanted me to keep a kind of diary of my feelings, and that it would be helpful to write down what I was worried about. </p>\n\n<p>I wasn&#39;t super keen on the idea because my sister, Zoe, told me that diaries are for girls, and she laughed at me, but my mum told me to think of it like a log book, and that even explorers like Captain Cook would have a book where they wrote down all their thoughts every day. </p>\n\n<p>So that&#39;s what this is, it&#39;s my explorer&#39;s log. I&#39;m in a new place, and I&#39;m going to be discovering strange and amazing things every single day.</p>\n\n<p>That&#39;s what my mum told me, anyway, and I wish I really could get excited about it like that, but the truth is I&#39;m really sad most of the time now. I remember as a little kid I was usually really happy. I would go to the zoo or the movies or the beach with my mummy and my daddy and Zoe back when she was just a baby. I don&#39;t really call them mummy and daddy anymore out loud. I still want to, but the kids back at my old school used to laugh at me when I did, so I don&#39;t anymore. </p>\n\n<p>Anyway I didn&#39;t really realise it when I was little, but after I started school I noticed that Mummy and Daddy didn&#39;t really seem that happy anymore. They&#39;d smile for me and for Zoe but sometimes I&#39;d hear them yelling at each other at home when I wasn&#39;t in the room, and Mummy didn&#39;t really seem all that happy to see Daddy anymore when he got home from work. </p>\n\n<p>I could see that something was wrong, and I really wanted to help, and so I asked what the problem was and what I could do, but I got the same answer from them both. They told me nothing was wrong and it was fine, and then when I kept asking they told me there was nothing I could do. </p>\n\n<p>Then one day Daddy never came home from work </p>\n\n<p>I felt really sad, like he didn&#39;t want me anymore. I remember I cried all night, and in the toilets at school the next day, but I didn&#39;t let mummy see it. I really love my mummy, even though I&#39;m too embarrassed to say it out loud, and I thought that if she saw me crying it&#39;d just make her feel worse that Daddy left. I didn&#39;t want her to feel bad, and I had to be strong so that Zoe would think it was okay, so I&#39;d just cry in the toilets at school. I went to the toilets so much that the teacher thought there was something wrong with me. I had to see a doctor with Mummy and he made her leave the room and asked me what was wrong. He&#39;s a doctor so I told him, and then he gave me some pills, he told mummy that they&#39;re medicine but really they&#39;re just made of sugar. He showed me. </p>\n\n<p>Anyway, after that my teacher didn&#39;t bother me. I cried in the toilets as much as I needed to, but I stopped needing it after a while. Now I just have this sunken feeling inside me, like my whole stomach fell down and it won&#39;t come up, and I don&#39;t think it&#39;s ever going to go away. </p>\n\n<p>After he left I started playing with Zoe every day after school. She asked me where Daddy was and I told her he went to work in a big ice-cream factory in Melbourne, and one day he&#39;s going to come back with lots of money and ice cream. </p>\n\n<p>I feel a bit bad about lying, but it made her really happy, and now that daddy&#39;s gone that&#39;s all I really want. I guess I just never want Zoe to have to go cry in the toilets at school like I did. </p>\n\n<p>Every day I&#39;ll come straight back from school with Zoe and we&#39;ll play. Even if Marcus or Aaron asked me to come play soccer at the park I&#39;d say no and that my mum wouldn&#39;t let me, but really I&#39;d just say it because I wanted to go play with Zoe instead. We&#39;d draw little pictures together and play with her barbie dolls. Even though she&#39;s only seven, she&#39;s a way better drawer than me, and I love looking at all her pictures. One time she drew me in a superman shirt with big muscles and said she didn&#39;t miss Daddy as much with her big brother around. That one was my favourite. She doesn&#39;t know but I still keep it in my undie draw in my room, just to look at when I&#39;m feeling a bit sad. </p>\n\n<p>Anyway, it&#39;s almost a year since Daddy left now, and a few weeks ago Mummy told us we were leaving Sydney. She said that the house made her feel sad, and she didn&#39;t like being near all her and Daddy&#39;s old friends and his family. She said we needed a &quot;fresh start&quot;, whatever that means, and so she said we were all moving to the country together, to a little town called Swinford. </p>\n\n<p>I remember I really wanted to cry the day she told us that, but Zoe was already bawling, so I pretended like I was okay. I remember Mummy called me her &quot;brave boy&quot;, and she said she was so proud of how &quot;mature&quot; I was being. It felt nice that Mummy was proud, but I just keep thinking about when it&#39;ll be my turn to be sad. </p>\n\n<p>So yeah Mummy sent me and Zoe to a therapist. We had to see him separately instead of together, which we both didn&#39;t like, but I guess he helped a little bit. </p>\n\n<p>Then a few days ago we packed up our bags and today we left. We just finished unpacking and I&#39;m writing this from my new room. Marcus sent me a message on the computer but I don&#39;t really want to say anything back. Even though we&#39;re friends, he can be mean sometimes and whenever I get a cool toy or game he always tries to trade me for it even if I don&#39;t want to.</p>\n\n<p>Sometimes it feels like I&#39;m just his friend because we&#39;ve known each other a long time, but now I won&#39;t even get to see him anyway, so I don&#39;t see why I should reply to his message. </p>\n\n<p>Before I wrote this I just had a little walk around the garden to think, and this old man yelled at me from across the street, saying I needed to get back inside my house. I didn&#39;t really understand why he was yelling, it&#39;s still light outside my windows and there was nobody else around, but he sounded really scared so I did what he said. I asked Mummy why he did it and she said she didn&#39;t know, so I guess I&#39;ll ask him if I see him again tomorrow. </p>\n\n<p>I really want to sleep but Zoe hasn&#39;t talked all day, and she was just in the middle of her room staring at the floor last time I saw her, so I want to go talk to her and see if she&#39;s ok. This log thing isn&#39;t too bad, so I guess I&#39;ll keep writing new ones, but I think I&#39;m finished for today. </p>\n</div>\n","author":"WPToss"}