{"rank":"107","title":"Canadian Paranormal Encounters: Last Ride of the Night","id":"8l9pt5","url":"/r/nosleep/comments/8l9pt5/canadian_paranormal_encounters_last_ride_of_the/","time":"1526993279000","body":"<div class=\"md\"><p><em>This is the fourth instalment of a series where I investigate real paranormal encounters in my home and native land. You can read the first three instalments here: <a href=\"https://redd.it/8jblkr\">Panic at Manic-5</a>, <a href=\"https://redd.it/8jkzyz\">Vision in the Rare Books Collection</a>, and <a href=\"https://redd.it/8jwfma\">The Spectres of Sparks Street</a> . These encounters are all stand alone, so you can also jump in any time without needing to read the rest.</em></p>\n\n<hr/>\n\n<p>This story comes from a friend of a friend of mine, which are words that normally sway one’s legit-o-meter straight into the big red ‘bullshit’ section, but I ask that you pull that arrow back. I did my homework, and suffice to say, there’s a reason I split this story into two parts (both shared in this post). This tale <em>started</em> with a friend of a friend, but there was another witness to the events, and I tracked that person down to corroborate what happened. In doing so, I got more than I bargained for.</p>\n\n<p>We’re headed West for this one, all the way to Alberta, to hear about the last ride of the night.</p>\n\n<hr/>\n\n<p>According to ‘The Internets’, West Edmonton Mall is the largest mall in all of North America. It’s <em>so</em> large, in fact, that it has a whole goddamn amusement park in it. That amusement park is known for three things: being awesome, being awesome <em>for being inside a mall</em>, and an accident in 1986 that led to a bunch of people biting the bullet after a roller coaster car derailed and smashed into a concrete post. Ha ha ha, yuuup. That went dark quick.</p>\n\n<p>My friend’s friend, Alex, was at the mall earlier this year when he heard the amusement park figuratively calling to him. It was getting late and most stores were prepping for closing, but since there were pretty much no line-ups at the amusement park, he figured he had enough time to go on a few rides. He bought tickets and got on every single attraction without delay, except for the time it took for the current ride to end and their few passengers to disembark.</p>\n\n<p>There came a call on the speakers announcing it was time for the final rides of the night. A few of the smaller attractions were already blacked out and their operators busy sweeping. Alex checked his tickets and saw he had just enough to get on the Mindbender, a medium-sized roller coaster that took up an entire section near the back of the park. He hurried there and arrived just as one of the employees was about to chain the entrance to the waiting line.</p>\n\n<p>“Wait!” he yelled.</p>\n\n<p>The employee looked sour. He figured it was kind of like getting to a store a minute before closing. <em>Technically</em>, she couldn’t turn him away, but she was justified in feeling a bit bitter about letting him through. He handed her the tickets, and she closed the gate behind him before moving on to her cleaning duties.</p>\n\n<p>Alex ran through the line to join up with the group getting on the last ride of the night, but as he arrived, he found he was alone. The ride operator looked at him nervously, and mumbled something about the ride being closed. Alex replied he’d been let through, and what the operator said in response threw him for a loop.</p>\n\n<p>“You don’t want to get on the last ride of the night, not alone.”</p>\n\n<p>He didn’t want to be rude, but he’d already spent his tickets, and god damn it, he was getting on that roller coaster. He insisted. The operator insisted right back. Alex was getting a little heated by that point. What was the operator trying to achieve? If he wanted to go home, it’d be quicker to let him on. Finally, the operator relented, and opened the metal gates to let him on.</p>\n\n<p>Alex sat at the very front, despite the operator warning him it was “safer at the back”. He rolled his eyes and thought to himself, <em>Man, what’s this guy’s PROBLEM?</em></p>\n\n<p>Alex sensed something was wrong almost as soon as the coaster began to inch its way up the steep incline. With every click of the gears, he felt his scarf tightening around his neck, and came to the horrifying conclusion it had somehow been dragging as he got on and must have gotten caught in the rails. He saw visions of himself getting beheaded, Final-Destination-style, but as he shot his hand up to try and remove his scarf, he remembered he’d put it in his bag earlier. There was nothing around his neck, yet he could feel an ever-tightening pressure around it. The cart stopped abruptly at the very top of the incline, and then sped down so fast, it knocked the wind out of him. He tried hard to catch his breath as the coaster spun around the bend, but it was like trying to suck air through a straw. His head was aching, his throat burning, and the cart was fast approaching a loop-de-loop. As it ascended, the corners of his vision started to blacken.</p>\n\n<p>Alex can’t remember what happened after that.</p>\n\n<p>The next thing he knew, he was taking in a deep intake of air like the first gasp after a dive, and could feel firm hands clasped on his shoulders. He opened his eyes and found the ride operator standing over him while he was slouched in his seat like a drunken grandpa in his armchair. He was dizzy, confused, and his head felt like it was about to split open.</p>\n\n<p>The operator was very kind and patient with him, helping him to his feet and asking if he was alright. Words felt like cotton balls lodged in his throat. They melded together and came out in incomprehensive mumbles. The operator escorted him towards the ride exit, passing by the booth with the ride photos.</p>\n\n<p>“What the hell is that?” was all Alex could muster when he saw his photo. Any other words came out jumbled. “What the HELL is that?”</p>\n\n<p>The operator leapt over the counter, shut the monitors, and then ushered Alex out without another word on either of their parts.</p>\n\n<p>Alex stood at the entrance of the dim mall as storefront after storefront pulled down their metal grates and locked up for the night. The words ‘What the hell is that?’ played out in his head as he tried to make sense of what he’d seen on those monitors. The after-imagine of his photo felt like a blow to the head. He was on the ride, unconscious, but not alone. <em>Something</em> – some sort of pale form with pure white eyes – was standing in the seat behind him, hands tight around his neck.</p>\n\n<p>When he got home that night and looked in the mirror, he found the distinct marks of fingerprints around his throat.</p>\n\n<hr/>\n\n<p>That was Alex’s side of the story, and on the phone, he sounded convinced that’s how it really went down. I, however, felt the need to do a bit of extra digging. It’s not that I didn’t believe <em>he</em> believed what he was saying, it’s that his account came following a sudden loss of consciousness, which slightly dampers the reliability of his statements. I’ve passed out twice in my life, and both times, it was immediately preceded and followed by this weird, dream-like state, so while I don’t discount his account, I wanted to do my due diligence and see if anyone else could back it up. Did he imagine the phantom in his photo and the tightening around his throat? I wanted to hear from the other witness, the operator who’d warned him not to get on the ride.</p>\n\n<p>He had to know <em>something</em>.</p>\n\n<p>Turns out the guy’s name is Tyler, and he was a <em>lot</em> harder to track down than I initially thought. Even though this happened only a few months ago, most of the evening employees at the amusement park are students, which means there’s a pretty high turnover rate…not to mention the operators rotate rides, so I was looking for a needle in a haystack that might not even be in that haystack anymore. Thankfully, one of the employees I emailed (Shout-out to Emilee!) was SUPER helpful and offered to ask around for me. It took about a week, but she got me in touch with Tyler, and this is his side of the story.</p>\n\n<hr/>\n\n<p>According to Tyler, who’d been working at the amusement park for a couple of years, what Alex saw on his photo that evening was true, and it wasn’t the first time something similar had happened. It was always the last ride of the night, and only when only a single rider was on. Thankfully, those conditions were met very infrequently, but the times they <em>were</em> met, he was told to keep quiet, escort the customer out, and delete the evidence. The first time it happened, Tyler honestly thought it was a joke. You know, some sort of hazing ritual, or maybe a weird mystery customer test thing, but then he saw the very real marks on that victim’s throat and immediately called the manager. After the victim had been escorted out, he was told <em>never</em> to mention it again.</p>\n\n<p>It kept happening on his watch, to the point he got pretty good at handling the situation, and started requesting that ride. Why scar some 16-year-old kid working their first job when he could handle the pressure? He eventually became close with one of the managers, and one night, they went out for drinks. One thing lead to another, and he found the guts to ask her about the ride.</p>\n\n<p>From the get-go, she made it clear he was <em>never</em> to tell anyone else about it, and that she’d deny it if he did. He agreed, but I guess he’s gone back on that promise now, heh. Anyways, she explained that only two years after the 1986 accidents, late in 1988, some teenage punk thought it’d be a fun idea to mess with the safety harness by putting his bag under his shirt so when they snapped the harness in, he could remove the bag and have some slack. For the record, this was <em>not</em> on the same ride Alex had ridden on. It was one that <em>didn’t</em> have loop-de-loops, so while doing this was in no way a smart idea, it wasn’t, y’know, clearly suicidal or anything.</p>\n\n<p>Security cameras showed that, when the ride took off, the kid pulled the backpack out and stood up in his car. You know those signs that say keep your legs and arms inside the vehicle at all times? They’re there <em>for a reason</em>. There are all manners of gears, pillars, and support beams all over roller coasters, and if you stretch out too much, you could hit them. Now imagine someone <em>standing</em> on the kind of ride designed to be <em>sat</em> in. The teen was fine at first, but somewhere in the middle of the ride, his head struck an overhead beam, and he fell unconscious in the car.</p>\n\n<p>This is where the incident from 1986 I mentioned at the very start comes into play. See, apparently one of the night managers saw what happened and immediately ran to the coaster’s unloading platform. You’d <em>think</em> he would have wanted to help --- that he would have called for an ambulance…but instead, he told the ride operator to shut the gate and keep a lookout. Another incident at the amusement park so soon after the first could have shut it down, and they would have lost their jobs. They brought the unconscious kid out back into the break room and kind of just waited for a bit. Thankfully, the kid regained consciousness not too long after, and they sent him packing with a big ‘ol bump to the noggin.</p>\n\n<p>They didn’t think about it, until they saw on the news a few days later that that very same kid died of a blood clot in the brain.</p>\n\n<p>They knew, if they’d just called an ambulance, he would have been okay.</p>\n\n<p>Tyler says the ghostly figure is that kid’s vengeful spirit, trying to get back at the manager and ride operator who let him die.</p>\n\n<p>So guys, if you’re ever in the West Edmonton Mall at night and you want to go on the roller coaster, just make sure you’re not alone on the last ride of the night.</p>\n\n<hr/>\n\n<p><em>If you&#39;re interested in more Canadian paranormal encounters, check out the other instalments:</em></p>\n\n<ul>\n<li><p><a href=\"https://redd.it/8jblkr\">Panic at Manic-5</a></p></li>\n<li><p><a href=\"https://redd.it/8jkzyz\">Vision in the Rare Books Collection</a></p></li>\n<li><p><a href=\"https://redd.it/8jwfma\">The Spectres of Sparks Street</a></p></li>\n</ul>\n</div>\n","author":"manen_lyset"}