{"rank":"290","title":"Why can't I remember being a killer?","id":"8l9y2a","url":"/r/nosleep/comments/8l9y2a/why_cant_i_remember_being_a_killer/","time":"1526995423000","body":"<div class=\"md\"><p><strong>The names and locations in this story have been altered to assure my anonymity.</strong></p>\n\n<p><em>My name is Justin, and I’m a killer.</em></p>\n\n<p>I don’t remember much about my time before I was committed, the earliest memory I have is waking up in a strange place, in a strange room, in strange clothes. I looked around the room as I began to panic, I can’t have been more than nine years old at the time. I tried to struggle, but quickly learned that I had been restrained. I began screaming, calling for anyone that would listen to help me. How did I get here? Why was I here? What did these people want from me?   </p>\n\n<p>A few hours later, as I began to settle down and became more aware of my surroundings, the door at the front of the room clicked open and a woman stepped in wearing what looked to be a surgeon’s outfit. She was holding a clipboard, and smiled at me intently as she sat down on the bed on which I had been restrained.   </p>\n\n<p>“Hello Justin, my name is Dr. Valerie Wilson and you are at an institution called The Meadows here in Pennsylvania. I have been assigned to evaluate your condition after the unfortunate events that have occurred over the past few weeks. Can you tell me what you can remember?” </p>\n\n<p>I didn’t have the slightest idea what she was talking about. I racked my brain and took a few deep breaths while I tried to recall my life over the past few days, few months, even as far back as I can remember. I quickly became concerned because I couldn’t remember anything. I tried to picture my mother and father, but their faces were fuzzy. I wanted to answer her as she was staring down at me, patiently waiting, but I had none to give. I told her that I couldn’t remember anything before I woke up in this strange place, and she looked at me perplexed, like it was the most atrocious thing she had ever heard. She quietly whispered “I see…” and jotted down a few notes on her clipboard.     </p>\n\n<p>“You are going to be staying with us for a little while. I am sorry about these restraints, but they are for your own safety. I will be back shortly. Please try to remember what has happened, and what you did.”    </p>\n\n<p>It seemed like such a foreign thing to me. I had always tried to be a good kid, or at least I thought I had. The thought of me doing something that would have caused my parents to be mad at me and send me here didn’t seem like something I had been capable of. Did I even have parents? Did I even have a family? Why does my neck hurt so much? Why can’t I remember anything?  </p>\n\n<p>I had later learned that there were multiple missing children in the town that I had been living in. It seemed as if it was every few days a new missing poster was being hung up all over town, right next to the other ones that had kept piling up. The police had searched for weeks until one day they had caught a break. Apparently, I had been found wandering along a street on the edge of town, surrounded by woods with a four-inch-long sharp splinter of a tree jammed into the side of my neck. A passerby had seen me and called the police, who had quickly responded and found me covered in blood that wasn’t mine. I was in shock and stammering incoherently. I must have passed out sometime before the ambulance had arrived. They searched the surrounding area and found a boy, savagely beaten and broken with multiple stab wounds to his torso and face. He was dead when they found him. His name was Stephen Newman, and he was six years old. I was taken to a hospital where I had surgery to have the splinter removed, after that is when I woke up in the institution that would become my home for the next twelve years.    </p>\n\n<p>Every day for as long as I can remember, the doctors had asked me to try to remember the events of that day, and any day before it. They wanted to know where the other children had gone, and why I did it in the first place. I had no answers for them, and they were convinced that I had repressed the memories of what I had done in order to refrain from feeling any guilt. Because of my age at the time of the incident, they were unable to determine what the cause of my psychosis was. Had I been a schizophrenic? Bipolar? Or was I simply insane?    </p>\n\n<p>I had dedicated my time at The Meadows to telling the doctors everything they wanted to hear as far as my recovery was concerned. That I had accepted the things that I had done and felt guilty about it every day and I wanted to get better. Finally, I had done and said enough to convince them that I was capable of being a productive and functioning member of society, and I was released at the age of twenty-one.     </p>\n\n<p><em>They probably shouldn’t have done that.</em></p>\n\n<p>They didn’t know this at the time, but I was cleverer than they ever knew and was able to escape from my room on nights when I knew there wouldn’t be many security guards in the building such as holidays and severe weather days. I had found my case file and knew everything, which only filled me with rage and resentment towards my family. As far as I could see it, they had abandoned me and I was hell-bent on getting my revenge. Monster or not, I was still their blood. How could they just forget about me and leave me here on my own? The names of my wretched “parents” were in my case file and they had told the authorities that they didn’t want to have anything to do with me, that I was no longer their son for the things that I had done and I had been removed from their care. Searching through my file, I found a letter of recommendation for release attached, stating “patient has exhibited no signs of violence or mistrust in his entire time here, and I am entirely confident that he is capable of being reintroduced to society and able to live a life without confinement. I also believe the patient has no lasting mental illness disease and I believe his inability to remember the events of his past has changed his character for the better, and his adult mind is fully capable of feeling empathy and emotion. It is my recommendation that the patient be released from this institution as it is a waste of the state’s money to further hold him here.” The document was signed at the bottom, Dr. Valerie Wilson.    </p>\n\n<p><em>Thanks Doc, you have always been so kind.</em></p>\n\n<p>It took me a while to track down my parents, their last known address listed in my case file turned out to be just an abandoned house. I asked the residents of the town if anybody remembered anything about the missing children. Nobody seemed to want to discuss it or simply didn’t know what I was talking about. I got the feeling they were just trying to forget that their town had a dark history. Eventually, I found an elderly resident that had remembered who my parents were. I didn’t tell her who I was, but she told me that my parents had moved away shortly after the police arrested their son who was believed to be responsible for the disappearances, and that they had been socially crucified by the townspeople who blamed them just as much as their son for their missing children. They never found the bodies of the other kids, and the string of disappearances stopped when I was institutionalized. My parents could no longer take the resentment that they felt and couldn’t leave town fast enough. She told me that they have moved to a small town called Summit Hill, where nobody knew them or the violent past they left behind.    </p>\n\n<p>They weren’t hard to find after that, and when I finally stepped through their threshold in the middle of the night, my heart filled with adrenaline and my mind was in ecstasy. In a small, quiet town such as this, no one had thought to install a security system. They hadn’t even locked their doors. What could possibly happen in such a small town where everybody knew everybody? They felt safe and secure in their quiet new life where they no longer had to be haunted by the child that they had tried their hardest to forget. Little did they know, their past was at the foot of their bed that night, enraged and seeking revenge.  </p>\n\n<p>No matter how much I wanted to confront them and hear their pathetic excuses for abandoning me, I couldn’t risk being discovered. I smiled as I quickly slashed both of their throats, watching as they choked to death on their own blood. It was the greatest feeling I ever had. All of those years I had to endure being in that place alone and the anger that I had toward these two less-than-nothing people in front of me had drained out of me as the blood drained from their bodies. I placed the knife in the hand of my so called father, and covered any trace that anyone else had been in the house. Nobody would figure out the connection between me and them. As far as anyone knew, I didn’t know who my parents were. There’s no way I could have been responsible. To the authorities, this would look like a simple case of murder-suicide. I found myself laughing hysterically at the glorious sight of it all.    </p>\n\n<p><em>Rest in peace Mom and Dad, your son has come home. I hope you rot.</em></p>\n\n<p>Despite me getting my long awaited revenge, it didn’t take long for me to start feeling empty inside once again. I took odd jobs where I could get them, and eventually moved into a dingy apartment in a town called Tamaqua not far from the town in which I had killed my parents. I quickly realized that I had no real goals or ambitions, all I knew is that this hole in my chest was slowly growing with every month that passed and I didn’t know why. I had killed my parents, but I felt that they had deserved it and wasn’t really keen to kill again. I needed to find some other way to fill this hole inside me, and find it I did.  </p>\n\n<p>While surfing the internet one day out of complete boredom, I stumbled upon NoSleep here on Reddit. I came across stories of monsters, the supernatural, and stories of the bizarre. I was fascinated, but found myself drawn to the ones that had involved serial killers. I wanted to understand the mind of a serial killer, but I just found that most of them were insane or had twisted motives to justify their demented character. To my knowledge, I wasn’t insane. I had no problems making clear decisions and I felt that the dispatching of my parents was justified. I had no explanation for the things that I had done as a kid, however. I couldn’t even remember having done it. I would casually read through the comments of my favorite stories, and was surprised to find that the stories that garnered most of my attention and admiration had comments on them from the same Redditor whose username I will withhold for obvious reasons.</p>\n\n<p>The majority of her comments read “I am new to NoSleep and all of these stories have me creeped out and paranoid about strange noises that I hear in the night, or the crack of a stick that I hear in the woods. Sometimes, my husband has to wake me up in the middle of the night because I’m screaming for no reason. NoSleep seems to be doing something to me. I’m a grown woman and I think I’m going insane lol.” What did this woman know about being declared insane? She has no idea what it feels like to be labeled as such and disowned by your family. That’s when it clicked:    </p>\n\n<p><strong>Well, I’ll just have to show her.</strong> </p>\n\n<p>I had found my new purpose, I was going to find out who this woman was and literally drive her to insanity. Reading NoSleep had caused her to be so psychologically out of whack that it would be easy for me to stage disturbances around her house, making her believe that ghosts really did exist or monsters really were watching her from the trees. After all, NoSleep is all about being scared isn’t it? This was going to be the achievement of my life, to make a person feel what I felt. I would finally have somebody I could relate to. I struck up a casual conversation with her on Reddit, and after many days of trust building she told me her name and the town that she lived in, which coincidentally turned out to be a town in the mountains of Pennsylvania not far from where I currently lived. It was fate. This also gave me an open door to her psyche should I need to push her even harder if my scare tactics weren’t cutting it. Obviously, I am posting this under a different username than the one I used to contact her.    </p>\n\n<p>The town wasn’t very big, and although it was surrounded in dense woods and ran through a valley, I found her house easily enough just based on her description of it. I made sure I had the right person by scouting the place first, the lifted trucks and jeeps littering her land just as she said they had. Her husband was always out late working on the vehicles or on the house. I was further reassured by the two small boys that lived with them, the youngest of which had long blonde hair down to his shoulders. The town had been a hot spot for coal mining, and the area was absolutely littered in long forgotten mines and mine shafts. With all of these NoSleep stories involving monsters, mines, or woods it wasn’t hard to understand her fear nor would it be hard to send it spiraling out of control.    </p>\n\n<p>It had been early fall, and the trees were still thick enough to provide me with adequate cover when the sun went down to quietly sneak up to the house when I was sure everyone was inside for the night. I waited until the last of the lights in the first floor of the home were out, and I went up to the window on the side of the house and looked in. There, sitting on the couch with her face illuminated by the phone she held in her hand, was my target. My new obsession. I could easily guess at what she was doing. That’s when I noticed what looked to be the fluffiest blanket I’d ever seen resting on her lap. After watching it for a while, I thought I saw it move. It turns out she had a dog, which is something she failed to mention.   </p>\n\n<p>“Damn it” I quietly whispered to myself. This was going to make my task a little more difficult. I had to be even more careful to conceal my presence in the area for fear of the dog discovering me and sounding the alarm. After thinking it over, I realized that I could use this to my advantage by setting the dog off and quickly disappearing leading her to believe that the dog had gone crazy or heard something that she hadn’t. </p>\n\n<p>I executed my plan to near perfection. Over the course of two weeks I camped out in the woods away from the area and waited for the sun to go down before I would sneak up to the house at random. Every night it would be something different. The purposeful snapping of a branch when she stepped out on the porch for a cigarette, a quiet knock on a window, passing by just out of view so all she saw was a shadow. I got an adrenaline rush every time, and it was like winning the lottery when I would hear her talk to her husband about strange things happening around the house and having the feeling of being watched. No matter how diligent and aware she would be, I always avoided being discovered. It was the ultimate game of cat and mouse.    </p>\n\n<p>I could tell I was driving her completely insane. She blamed everything from ghosts to wendigos and went so far as to suggest aliens were watching her. She spoke about her son telling her about the man in the attic, what she didn’t know is that when the children went up to their rooms to play I would wave at them from the window, just a silhouette of shadow in the dead of night. They didn’t know any better. One night I entered the home when I was sure everyone was asleep to move things around and get a better idea of who she was. Imagine the terror she would feel when she woke up to furniture having moved on its own. The dog was no trouble; I had thrown a piece of food through a window that contained a sedative to take care of that problem. He was fast asleep. As I made my way towards the stairs and glanced towards the fridge, my blood ran cold at the sight of what was hanging on it:   </p>\n\n<p><strong>A picture of my parents.</strong></p>\n\n<p><em>What the hell is this doing here?</em></p>\n\n<p>I couldn’t believe what I was seeing. My head started to spin and my breathing grew more rapid. Hanging next to the photo was a clipping of an obituary page for my parents. As I read through it, one part in particular caught my eye: “Survived by daughter Mara and two grandchildren.” Daughter? I have a fucking sister?   </p>\n\n<p>I had, and it was like the flood gates had opened. Suddenly, things that I thought were long forgotten of my time before the institution began to surface. The revelation that I had a sister triggered something in my head that brought the memories flooding back. It was like watching a film reel unravel itself right before my eyes.   </p>\n\n<p>I remember having a sister, but her name was different. I knew her as Talia. She was three years older than me, so she would have been twelve the last time I had seen her, which was the day I was found wandering the side of the road barely conscious. She had coaxed a six-year-old boy who was playing outside of his home into following us into the woods. She told him that we had a really cool tree house and that it wasn’t far from where we were. He anxiously followed us deep into the trees when my sister turned to me and gave me what looked to be a broken piece of a branch that had been sharpened to a point. She looked at me with a stern face and said “Justin, I’m going to need you to listen to me very carefully. We are family and you are my little brother, and I think it’s time I let you in on my little secret.” She had been systematically luring small children from my neighborhood into the woods and killing them over the course of several weeks. My sister never told me what she did with the bodies, or why she was doing it, but it can’t have been for anything good. She then said that in order for us to truly be family, I would have to participate starting with Stephen Newman, the boy that had followed us. Upon hearing this, he suddenly burst into tears and tried to run away. Talia was far too quick for him, and had him face down on the ground and was sitting on his back before I had time to register what was happening.    </p>\n\n<p>She began screaming at me over the desperate cries of the boy; “You have to do this Justin! We won’t truly be family until we can share this together! You don’t have a choice!” I was paralyzed where I stood. I couldn’t believe this monster in front of me was my sister, and that she wanted me to do something unspeakable. I couldn’t bring myself to move no matter how hard I tried. Talia quickly became frustrated with me and thought it best to silence the boy as quickly as possible. She pulled another piece of branch not unlike the one she gave me out of her back pocket, rolled the child over onto his back and began plunging it into his body everywhere. She was screaming louder and louder as his screams grew quieter and quieter. I rushed over to my sister and desperately tried to pull her off of him, but it was no use. She was far bigger than I was and the rage that she had in her at that moment had made her unmovable. In the struggle, she quickly turned around and shoved the branch into the side of my neck. I saw the rage fade from her eyes as she realized what she had done. I stumbled backwards, the adrenaline coursing through my body had numbed me to the pain.   </p>\n\n<p>“Oh my god Justin, I didn’t mean it. I swear I didn’t mean it. I’m sorry, I’m so sorry.” I could barely hear her, my body started going into shock. She faded from my view as my vision grew blurry, I could only guess that she had left the scene quickly, afraid that I was going to die right along with the boy she just viciously murdered. I don’t even remember making it to the roadway, and I must have blacked out shortly afterwards.   </p>\n\n<p>All of those years I was lead to believe that I had been responsible for a string of murders I couldn’t remember. I was institutionalized, and my family abandoned me. It was all for nothing.  </p>\n\n<p><em>I was fucking innocent.</em></p>\n\n<p>My sister was the reason that all of that happened to me, and she let me take the fall. Talia threw her little brother to the wolves to save her own skin. I became so enraged that I wanted nothing more in that moment than to march up those stairs and watch her bleed out just as I bled out our parents. The more I thought about it, I came to the realization that doing so would be far too quick and merciful for her. She didn’t deserve to have the family that she had, a husband and children. Talia was so quick to bury the fact that she was actually the one who was insane, and I needed to bring that back out of her. It was who she was. Only then could she face the demon that was her little brother, only then would she ever admit it to herself. She could try to repress it all she wanted, but I vowed to make her family abandon her just as my family had abandoned me, and send her to the place she really belonged.   </p>\n\n<p><strong>I was going to send Talia to the institution for the insane, or die trying.</strong></p>\n\n<p>I proceeded to move random pieces of furniture and other odds and ends quietly throughout the house, and made my way back to where I was camping in the woods. I began to start piecing together what was left of the fractured puzzle of my past.  As near as I could figure it, the reason that I had lost my memory had been a combination of the emotional trauma left on me from the event, and the anesthesia that was given to me when I had surgery to remove the branch lodged in my neck. It is rare, but memory loss from anesthesia isn’t unheard of. This would explain why I was never able to tell the police my story and clear my name, I simply didn’t remember any of it. In the struggle of trying to pull my sister off of the boy, I got his blood all over me and the police came to the conclusion that I was the one that did it. They never found a murder weapon because it was lodged in my neck, they hadn’t even thought to look at it as being so. I was simply a victim of circumstance.   </p>\n\n<p>When my parents moved away, they must have allowed Talia to change her name. God forbid anybody found out she had been related to a killer responsible for so many missing children. Her husband had no idea the things she had done or what she was capable of, but I could see that being subjected to NoSleep was slowly causing her to crack, and I was going to exploit it until there was nothing left of her sanity. Her family would see her for what she truly was.   </p>\n\n<p>It took a long time and persistence on my part, but she began to outwardly show her paranoia in ways I never expected. It started out with her yelling into the woods “I know you’re watching me! Just leave me alone!” Yes, sister I am watching. You are going to suffer for everything you put me through, and all of those children you took from their parents are going to finally be able to rest in peace. She didn’t even try to hide it from her family anymore, and would frequently erupt into random outbursts about how nobody was listening to her. Her husband grew increasingly frustrated with his wife’s state of paranoia, and he started coming home so late at night that I knew he was trying to avoid her. Talia was right where I wanted her, and it would only take one more little nudge to cause her life to come crashing down.    </p>\n\n<p>It was an unusually bitter cold night for late fall, it wasn’t quite winter but the temperature drop was nearly twenty degrees from the day prior. I waited for the sun to go down as I normally did, and made my way through the woods. I knew the path quite well at this point, and could navigate it in near total darkness. My heart began to beat a little faster, this would be the night where it was all going to come together. I had heard Talia screaming at her children and husband earlier in the day, and her husband stormed out of the house in a rage and took off in the family car. She was having a breakdown, and he couldn’t stand it any longer. I knew this was the perfect opportunity to send her over the edge, and I knew exactly how I was going to do it.   </p>\n\n<p>As I crested the top of the hill, I saw that most of the lights in the house were off and the family car was not in the driveway. “Perfect.” I made my way down the hill and approached the house from the South side with the least amount of windows. I needed to know exactly where she was in the house. I crept around to where the front porch meets the driveway and looked through the window that peered into the living room. She was in her usual spot, on the couch looking at her phone with all of the lights off. The children must have been sleeping upstairs, it was nearly midnight. I gently slid the window open so that there was barely a crack, and whispered through it. “I know what you did.” As she looked up from her phone to where she thought the noise came from, I quickly ducked down and out of sight.    </p>\n\n<p>“Hello?” She said. I let the cool breeze speak for me, and I crept over to the other side of the house towards the front door. I lightly tapped on the glass, and the dog instantly started barking as loud as he could. He could sense my presence, but she had no idea what was going on. I heard her yelling at him to quiet down through the front door, and I snickered. It was working.   </p>\n\n<p>I then made my way over to the storm doors that was covered with a piece of wood that led straight into the basement, and had access to the fuse box. I clicked the main fuse off, and the entire house inside and out went dark. I could hear her through the floor boards starting to panic, her breathing becoming increasingly louder. I made my way to the edge of the tree line under the cover of almost complete darkness, and waited. I knew she would have to turn the power back on, and to do that she would have to come outside. There was no way to get to the basement from the inside of the house. I waited as the front door clicked open and she took a nervous step out and looked around. As she made her way towards the storm doors, I stepped out from behind a tree and purposefully broke a branch as I did so. Her head snapped over to where I had been standing, and she let out a shrill scream. I knew she couldn’t get a clear view of me in the dark, but she saw my silhouette and that was enough to send her reeling. She nearly stumbled over herself as she ran back to the front door, flung it open and ran inside. I heard the sound of the deadbolt locking, and made my way through the trees to the back out of the house, and under the window that lead to her youngest child’s bedroom.</p>\n\n<p>I knew her next move would be to check on the children, so I quickly climbed the low hanging roof that lead to the window and looked in. The child was sound asleep in his bed, and the cool night air had caused the slightest amount of frost to accumulate on the outside of the window. I wrote her name, “Talia” backwards on the window with my finger so that it could be read clearly from the inside and leapt back off of the roof. I pressed my ear up against the side of the house and waited for the tell-tale sign of her running up the stairs to check on the children. I actually jolted when I heard the scream.    </p>\n\n<p>“No! No! This can’t be happening! This is impossible! Just leave me alone, whatever you are!” She was hysterical. I heard what sounded like something heavy being thrown down the stairs, followed by other sounds that told me she was destroying the house. All of the weeks that I have spent slowly torturing my sister had finally payed off. She couldn’t take it any longer.   </p>\n\n<p><em>How does it feel to know that you’re insane, sweet sister?</em> </p>\n\n<p>I could hear her rambling about things that I couldn’t quite make out through the walls of the house. I caught a few words here and there; “Why—believe me---not crazy---something’s here---come home.” It sounded like she was on the phone with her husband but she was so incoherent she became frustrated and it only worsened her state of mind. I disappeared back into the forest and watched. After about half an hour, her husband came tearing into the driveway and ran into the house. I could hear them arguing back and forth for what felt like eternity. Shortly thereafter, the police and a van with strange markings on it showed up. I couldn’t make out what it said in the dark.  </p>\n\n<p>Two men wearing uniforms that weren’t police had my sister by each arm, and were escorting her out of the house. She was screaming at them to release her, that she wasn’t crazy and she hadn’t been imagining things. Her husband just stood by the front door, watching them take his wife to who knows where. Apparently he hadn’t believed anything she said, and had been preparing for this intervention for a long time but the events of this night forced him to act quicker than anticipated. He held the youngest child in his arms while the older child stood next to him in the doorway, clinging to his father. At this point, he probably believed that she did these things herself in order to convince him that she wasn’t crazy. That she had staged the entire thing and had scared their children half to death just to save their marriage. He wasn’t buying it. He’d had enough.   </p>\n\n<p>As I watched the tail lights of the van disappear down the road after Talia was put into the back of it, I felt a smile slowly come across my face. I had done it. it was over. She had finally gotten what she deserved, and I knew in my heart that I had done the right thing. I got revenge not just for myself, but for all of those missing children whose disappearances I thought were my own fault for all of these years. I’ve carried that every day with me until this moment, until I could finally relieve myself of all guilt. I stepped back into the cover of the trees and away from that forsaken house, leaving it all behind me.   </p>\n\n<p>I’m in the wind now. I did a little research and found out my sister was coincidentally taken to the same institution in which I spent so much of my time, The Meadows in Pennsylvania. It was poetic justice. Maybe if I ever feel another hole growing inside of me again, I will pick another redditor that catches my attention. After all, this was so enlightening and exhilarating. Thank you NoSleep for helping me find my sister and giving me a peace I never knew. Maybe I will even go visit my sister someday and have a real heart to heart. After all, you should never abandon your family…should you?   </p>\n\n<p><strong>Should you?</strong></p>\n</div>\n","author":"revergence"}