{"rank":"3","title":"There is something weird with my house","id":"8la1z2","url":"/r/nosleep/comments/8la1z2/there_is_something_weird_with_my_house/","time":"1526996420000","body":"<div class=\"md\"><p>I live with two of my friends Greg and Ben, who are brothers in a rented apartment. They both own a bakery and I am a chartered accountant. There was something strange in our house. Every morning we woke up, there both the kitchen and the bathrooms light would be on. We thought there might be a technical fault and didn’t bother to repair it. There was a maid who worked in our house. Sometimes she would bring her son. Her son was very mischievous and would fidget with the things. We didn’t pay much attention and continued with our work. One day when I woke up, I saw that there was no one in the house except me. I went into the living room and found the maid’s son sitting on the sofa. I asked him about his mother, but he didn’t reply. I went to Mrs.Miller living next door.</p>\n\n<p>I asked her about the maid hoping for an affirmative reply, but she said that the maid had also not come to her house. I was very confused at the moment and went home. The maid’s son wasn’t there anymore. I didn’t remember closing the door and ignored the thought. I called Greg from whom I was informed that he and Ben were at the bakery, and he doesn’t know anything about the maid. I glanced at my house and it looked perfectly clean. Therefore I left for work. It was a tiresome day and I took a cab to home. Greg and Ben were at their uncle’s house and had informed me about their late coming. I looked around the house and saw that the bathroom’s light was on.</p>\n\n<p>I thought that they might have been forgotten to switch off the light. I went in and was scared and couldn’t believe my eyes. There were stains of blood all over the bathroom. I was stunned and felon the ground in astonishment. I heard someone’s laugh and followed the source of the noise. It was coming from my bedroom, whose light was too on. I went to my bedroom and on the bed was; the maid’s son laughing and giggling. I wanted to scold him but as soon as he looked at me, I ran out of the house and called the owner of the house and also Greg and Ben. They arrived and I told them everything. We all were scared and knew that there was something unusual and odd.</p>\n\n<p>We went in the house and searched for the boy. There was no one in the house and Ben was crying. We tried to calm Ben and sat on the sofa. Mr.Thomson, the owner of the house, looked very tense. I asked him the reason for his anxiety and he revealed it. He told us that before us, there lived a family here. They were bankrupt and therefore the head of the house killed his wife and son. After killing them, he committed suicide. We scolded Mr.Thomson for not informing us about this. He requested us to stay in the house for only one night and would show him a new house the next morning.</p>\n\n<p>We had to agree and no one knows how we passed the night. First time in life I realized that we sleep for so long. I don’t remember when I slept, but when I opened my eyes, I saw Greg and Ben sitting beside me. The clock had just stuck eight. It was time for the maid to come. There was a knock on the door and I opened it. There was the maid standing in front of me. I stopped her in front of the door and waked Greg and Ben. We showered questions on the maid, who only listened and didn’t speak a word. After we had finished, she broke the silence by only speaking “How would I know Sir, as I don’t have a son.”</p>\n\n<p>We were unable to speak for a minute and then we told her that we were going to shift and therefore she wasn’t needed anymore. We paid her the salary and she left. We immediately went to stay in Greg’s house and regretted about not getting this thought earlier. We are still looking for a new house. Do you have any in mind?   </p>\n</div>\n","author":"SnappyWisecracker"}