{"rank":"18","title":"I'm a bartender in the Limbo - Karma - Part 6","id":"8la2u2","url":"/r/nosleep/comments/8la2u2/im_a_bartender_in_the_limbo_karma_part_6/","time":"1526996626000","body":"<div class=\"md\"><p>Insanity exists in two forms.</p>\n\n<p>Malicious insanity and pure insanity.</p>\n\n<p>A man who wants to take off his clothes during a festival and start beating the crowd with an inflated dildo would be an insane person.</p>\n\n<p>Those who mutter to themselves, mumbling incoherent shit about gods and demons are also called insane.</p>\n\n<p>Those who repeat the same actions over and over, waiting for a different result is also defined as insane.</p>\n\n<p>In other words, insanity, in itself, is a form of “non-sensibility”. When someone speaks about aliens coming over and killing kittens with toothbrushes, what they’re saying would be nonsensical.</p>\n\n<p>Then there&#39;s the wrong side of insanity.</p>\n\n<p>When someone goes insane it doesn&#39;t make any sound. You won&#39;t hear them laughing to themselves or hear something snapping. It&#39;s like a mental switch. From a normal to fucked up. Off to on.</p>\n\n<p>Well, today, a man walked into our bar.</p>\n\n<p>He was a fit guy in his thirties. White T-shirt and dark gray jeans, all of a high-quality brand.</p>\n\n<p>After taking three steps towards the counter, where I stood, he stopped. Then he looked at me. I looked at him too.</p>\n\n<p>“Is this a staring contest?”</p>\n\n<p>“Are you by any chance…the bartender?”</p>\n\n<p>“Yes. As you can see, I’m the one standing behind the counter. Would you like to order something?”</p>\n\n<p>He continued staring at me.</p>\n\n<p>Now, I think some people here know that I don’t get “spooked” too easily but there was something wrong with his stare.</p>\n\n<p>No, I mean, his eyes were completely normal. Ice blue with a gleam. Nothing sort of “soulless” or “dark”. Just a bit…too normal, I would say.</p>\n\n<p>He asked to order a martini. I noticed that he had about...620 souls...this was not normal. This was wrong.</p>\n\n<p>Either he was extremely famous and attractive or he was a sadistic serial killer.</p>\n\n<p>“Good choice.”</p>\n\n<p>After serving him the drink, I stood there, trying to discern whether he wanted to talk or not.</p>\n\n<p>As a bartender, the profession required the ability to feel around someone’s mind and pull their emotional plug or mental blockage so that they can feel a bit more at home in the bar, and I become a sort of friend to them.</p>\n\n<p>But I wasn’t really a chatty person.</p>\n\n<p>Suddenly the guy, after taking a sip, turned his gaze back to me.</p>\n\n<p>“How old are you, Emily?”</p>\n\n<p>“I would rather not share my personal information with the clients. The bar also prohibits it. Sorry.”</p>\n\n<p>“Eh. Too bad.”</p>\n\n<p>How did he know my na—</p>\n\n<p>He stood up and I realized he had one of his hands in his pockets. Then out of nowhere, he lunged at me in half a second, something shiny in his left hand which was in his pocket. I could barely process what was going on but my survival instincts kicked in so I tried to back away from the counter, trying to put distance between the assaulter and myself. I wasn’t so lucky.</p>\n\n<p>He managed to graze the tip of my nose, split the skin open completely then he jumped from his seat to get in range and squeezed my neck with his right hand. This guy’s hand were like a pair of pliers, immediately cutting off any air from passing through. I tried to reach for the small black button under the counter but I was too far away to even hope to touch the counter itself.</p>\n\n<p>The man looked at me with his sky blue eyes, a hollow smile, no, it wasn’t a smile, he just pulled the two corners of his mouth with his cheek muscles to the shape of a grin.</p>\n\n<p>“Come on now, Emilia, who do you think you’re fucking with?”</p>\n\n<p>“W-w-whut thh fhkk ahrr yh----”</p>\n\n<p>I couldn’t speak, my lungs felt like it was going to burst. It felt like I was drowning but in a more fucked up way.</p>\n\n<p>“Ah I see, so you have indeed forgotten me. That’s rude, you know.”</p>\n\n<p>His grasp tightened and I felt as though my neck was getting snapped.</p>\n\n<p>Nothing made sense. Who was this man?</p>\n\n<p>“Well, I’m sure you will remember this”</p>\n\n<p>He took out a ragged piece of cloth. It was dark but gleamed purple in the sunlight coming from the bar’s windows.</p>\n\n<p>My vision was blurring so I couldn’t clearly make out the writing on it.</p>\n\n<p>I could only make out:</p>\n\n<p>Emilia (blurred) (xxxquelin). Kxxxx is my finixxxxx (blurred) .</p>\n\n<p>The first half was my name for sure. The second half gave me a vague sense of deja vu.</p>\n\n<p>“Agh donht knuv whhat tchis is, whu thh fahk ahr—”</p>\n\n<p>I felt a chill inside my body. The bloody knife slowly drove into my abdomen as I stared at it. Then I turned my gaze up and saw his faces inches from my own. His expression showed a sadistic curiosity.</p>\n\n<p>“Well, you will know soon. This is what happens when you play with someone else’s toys, Emily. And I’m a very, very mean person. Little girls like you shouldn’t poke around my yard, you know.”</p>\n\n<p>I was in a panic as I tried to look for any way out of this predicament. Hundreds of questions flooded my brain but I ignored them. What good was having answers if you’re fucking dead?</p>\n\n<p>He had me in a choke hold with his right hand. He swung first with his left. Assuming he’s a lefty, if only I could put his dominant hand out of commission, I would have the upper hand. But I had maybe fifteen seconds before he squeezed the literal life out of me. Think. Think fast.</p>\n\n<p>I stopped shaking. I held my already low oxygen inside as I stopped breathing. His grip seemed to loosen for the slightest second and before I could even raise my arms, he slammed down to the floor, my head cracking unto the hard wood.</p>\n\n<p>“Trying to play dead? Come on, Mily, you really think I’m such an asshole that I won’t realize this amateur shit? Don&#39;t you know when people pass out slowly, their eyes roll back and they get limp.Better luck next time. Ohhh, wait…heh heh.”</p>\n\n<p>He chuckled to himself, genuinely amused.</p>\n\n<p>To be continued.</p>\n</div>\n","author":"rantleystalk"}