{"rank":"290","title":"[Part 5] The Office I Worked In for a Year Never Existed","id":"8la614","url":"/r/nosleep/comments/8la614/part_5_the_office_i_worked_in_for_a_year_never/","time":"1526997410000","body":"<div class=\"md\"><p>I don’t know if any of you will even know what I’m talking about in this one, but hopefully you all remember. If not, I don’t know what to tell you. I can’t even link the other parts of the story. It’s like I never wrote them. They’re not in my post history or anything.</p>\n\n<p>Anyway, here goes..</p>\n\n<p>***</p>\n\n<p>I could hear voices before I was able to open my eyes.</p>\n\n<p>“I don’t know, Jack. This has never happened before.” I recognized Jim’s voice.</p>\n\n<p>Jack spoke next. “I just want my girl back..”</p>\n\n<p>“I know. Please be patient while we try and figure this out.”</p>\n\n<p>Jack let out an exhausted sigh. “I’m trying.”</p>\n\n<p>The voices fell silent. My eyes were still refusing to open. I focused on what I could do. I tried wiggling my toes, but they wouldn’t budge. I tried flexing my fingers, but nothing-- Wait! I felt my ring finger jump! I heard a chair get pushed back forcefully.</p>\n\n<p>“Jim! I saw her finger move!” Jack was suddenly near me; I felt his hand on my arm. “Missy? Missy, can you hear me? Please wake up, love.”</p>\n\n<p>Jack’s hand suddenly left my arm, and I felt new hands open my eyelids and flicker a light into my eyes. Jim.</p>\n\n<p>“Missy, can you talk?”</p>\n\n<p>I let out a faint wheeze, but apparently that was enough to get Jim excited. “We have her back! She’s still there.”</p>\n\n<p>I heard one of them fall into a chair. “I really hope she’s okay.” Jack sounded even more concerned.</p>\n\n<p>Jim reassured him. “She’ll be okay. She just needs a little more rest.”</p>\n\n<p>Everything went silent again for a while.</p>\n\n<p>***</p>\n\n<p>My eyes fluttered open. I was lying on my side on a soft white surface. A hospital bed? I tried to prop myself up on my elbow, but I only got half an inch up before my strength gave out and I fell back to the bed.</p>\n\n<p>“Missy!” Jack flew around the bed and into my vision. He grabbed my hand with a squeeze. </p>\n\n<p>My voice was barely a whisper. “Help me..”</p>\n\n<p>He understood immediately, and hit the button on the side of my bed to lift up my torso so I could see the room I was in. It looked like any other hospital I’d ever been in; single room, no curtain, a couch, some untouched food on a rolling table, a door that led to a bathroom and another I assume led out into the hospital. There was an IV secured to the inside of my forearm that led up to a bag of yellow-tinted liquid, and I could feel a catheter to empty my bladder. I’d been here a little while.</p>\n\n<p>“How long..?”</p>\n\n<p>Jack put a hand on my cheek. “Almost ten days.” I just blinked at him. <em>Ten days?!</em> He leaned over me and pushed the Call button on the wall behind my bed.</p>\n\n<p>Jim burst into the room not five seconds later. “Is she awake?!” Jack gestured to my obviously awake state as Jim bustled over to the other side of my bed. He hit some buttons on the monitor beside my bed and muttered to himself, “Vitals all seem normal.”</p>\n\n<p>I cleared my throat in an attempt to speak properly, but my voice was hoarse. “What’s happening? How are you both here? I was in R2 with Kev and Johnny.. You can’t be in R2.”</p>\n\n<p>Jack sat down heavily in the chair beside my bed, but didn’t let go of my hand.</p>\n\n<p>Jim straightened himself. “You’re back in R1 where you belong.” </p>\n\n<p>“What?!” I started to panic. “What about Kev, and all those other people that were in R2?! What about all of my pets?!” I could feel tears falling down my cheeks.</p>\n\n<p>Jim held up his hands defensively. “Whoa! Whoa. Missy. I thought you understood this. R2 only existed for nine days. Everyone and everything that existed in R2 no longer is. That entire reality is gone.” </p>\n\n<p>I stammered, “G--gone?” I turned to look at Jack. “Johnny? Talo and Lucy and Billy?”</p>\n\n<p>He smiled at me with another squeeze of my hand. “They’re all at home, safe and sound.”</p>\n\n<p>I turned back to Jim. “And Kev?”</p>\n\n<p>Jim gave me an apologetic shrug. “I don’t know who that is.”</p>\n\n<p>My voice raised involuntarily. “Kev! He works at the warehouse next to the Company! He was so nice and helpful while I was in R2! He’s probably the reason I’m even here right now!” Frustrated tears threatened to pour out of my eyes.</p>\n\n<p>“We found you unconscious in a storage room at the Company. There was no one else with you. I assumed you found your way to the rift and got through.”</p>\n\n<p>“But--”</p>\n\n<p>Jim smiled at me reassuringly. “Missy, this Kev is probably working at that warehouse with no idea who you are, beyond possibly seeing you walk from your car to the Company. As far as he’s concerned he never helped you. You just work next door.” </p>\n\n<p>I sagged into the bed and stared at my lap. “So everything is back to normal now?”</p>\n\n<p>Jack was the one that spoke up. “As normal as it can be.”</p>\n\n<p>Jim sat down in the chair on his side of my bed. “We’ll give you all the time you need before you come back to the Company.”</p>\n\n<p>I scowled at him. “You think I’m coming back after this mess?”</p>\n\n<p>He just frowned. “I figured you’d say that, but if you don’t work at the Company I’m not legally able to tell you how or why all of this happened; what the Company does, and of its properties.”</p>\n\n<p>I let out an indignant laugh. “You know what? I don’t care. I don’t want to know. I just want to go home and hug my pets and forget all of this ever happened.” </p>\n\n<p>Jim stood up from his chair, placed a brief hand on my shoulder, and started to walk from the room. He stopped halfway and said over his shoulder, “You’ll always be welcome back anytime. You know where to find us.” He left the room without another word. </p>\n\n<p>I turned to Jack. “Can we go home?”</p>\n\n<p>Jack gave me tight hug. “Let’s go home.”</p>\n</div>\n","author":"Mymissymoo"}