{"rank":"5","title":"Creepy Girl...","id":"8la9qd","url":"/r/nosleep/comments/8la9qd/creepy_girl/","time":"1526998257000","body":"<div class=\"md\"><p>So I was heading out for 21st birthday party and my girlfriend was coming to get me. My dad owns a blind business that he works from in a workshop next to the house. I was told someone would be coming up to pay him and that I was to take the money for a job he had done. \nMy girlfriend arrived to lift me but i met her at the bottom of a long lane as she didn&#39;t like to drive up as it was full of pot holes and I couldn&#39;t wait any longer. The next day my dad phones me and asks why didnt Maureen  (my girlfriend) answer the door to the man. I asked my dad what he was talking about and told him That Maureen wasn&#39;t in the house that night. \nMy dad told me that when the man arrived he seen a girl standing in what was my old bedroom and went to ring the door bell. He waited and no one answered. His wife told him while he was at the door the girl had left the room, so he tried again. Nothing. No one answered. \nWhen the man got back into the car he seen the girl at the window again. He assumed she was shy and drove off. \nBack to my dad, he phoned me in a bad mood and I was a bit freaked out as i told him no one was in the house at the time. This story might be as scary to someone reading it but because it&#39;s a personal experience it makes me feel uneasy. I even shared this story on my twitch stream when Playing Fatal Frame and it creeped me out just talking about it. Although I did not witness the little girl, I always lol at the window and can picture her standing there in her white dress and kind of makes me sad too. </p>\n\n<p>The thing that gets me about this is that the man and his wife that called with the money had no reason to believe that it was a ghost. They just thought it was a random little girl that lived in the house. </p>\n\n<p>I must add that I&#39;m new to reddit. I posted a few things last year but only getting into this kind of thing and would love to share some more experiences with you all. \nThis is only one of the creepy stories that comes from my home house. My girlfriend would never stay in the house on her own. I feel a presence in the house at all times but its never bad or negative, so it is creepy but never would be there to harm, if that makes sense. </p>\n\n<p>Also, I have enjoyed reading other people&#39;s stories and I wouldn&#39;t believe things like this only it has happend to me before. I also must add that at the time I was still living at home and this all happend in this room that I used to stay In. The master bedroom of the house is one that I never feel comfortable in. </p>\n\n<p>Thanks for reading. </p>\n</div>\n","author":"ChunzBunz"}