{"rank":"0","title":"Things that every girl should know","id":"8la92k","url":"/r/nosleep/comments/8la92k/things_that_every_girl_should_know/","time":"1526998100000","body":"<div class=\"md\"><p>You were only 6 when you came into my life. When I married your mother 3 years later I was so happy to call you my daughter. Yes we have had our hardships baby girl, but we have always loved each other. </p>\n\n<p>I have tried to teach you things that girl should know. I have always wanted the best for you in life, and everything you do makes me proud. Of course you have had your own opinions at times, but you are my little princess.</p>\n\n<p>Remember when you were 10, and I taught you how to change a tire? Oh how you fussed and pouted! “Why should I have to do this? I am a girl!”, you said with your arms crossed and your foot tapping. It took some convincing, but there was no way I was going to let you be stranded on the side of the road at the mercy of whoever comes along.</p>\n\n<p>Or when you were 14 and I taught you how to shoot a gun. Yes, you were a bit more excited to learn this one since you had promised yourself you would never let a man treat you like your old father treated your mother. I was so proud to hear those words from you. You learned so quickly; Just like everything else you do, you excelled almost immediately. </p>\n\n<p>Or when you were 16 and we surprised you with your own new car! Oh the look of happiness on your face as you squealed out, “I love you, I love you, I love you!” Though to be honest you may have been speaking to the car. How you protested and pleaded when I told you I was gonna teach you how to change the oil. Oh those teenage hormones of yours had you screaming and throwing a fit. You learned though, and now even if you never have to change the oil yourself you will always know how.</p>\n\n<p>There were, of course, things I as a father could not teach you about becoming the beautiful young woman you are. Your mother had to teach you about such things as makeup and... well, you know the rest. Together I feel like we have done a great job of teaching you the things you need to know about succeeding in life. I do, however, still have a few things I need to teach you...</p>\n\n<p>And that brings me to today... I was so happy when you vowed to save yourself for marriage. It, of course, meant I wasn’t worried about you dating. You got engaged a few weeks ago, and there are some things you have to learn about being a wife. Now now baby girl, please stop thrashing. Your face is so beautiful I hate to see it like that... Sex doesn’t have to hurt, I am trying to teach you that men lie about that, I will show you how to enjoy it. After all, these are all things that every girl should know.</p>\n</div>\n","author":"unknownyoyo"}