{"rank":"43","title":"I saw a kidnapping","id":"8ladgj","url":"/r/nosleep/comments/8ladgj/i_saw_a_kidnapping/","time":"1526999124000","body":"<div class=\"md\"><p>Hey, so yeah I&#39;m kinda new to this sub but I saw something a few nights ago on my job that defies explanation and I need to get it off my chest.</p>\n\n<p>I work as a tour guide here in Boise Idaho for the local train depot, it&#39;s kind of a landmark for the area and people love to come look at check out the locomotives and stuff. \nTypically though my day is pretty boring stuff, nothing worth writing home about anyway. </p>\n\n<p>But a few nights ago I agreed to work night shift for a buddy of mine and well... let me just explain what happened. </p>\n\n<p>Night shift is for security detail, even though this area is pretty quiet. For the most part it&#39;s easy money, as long as you can stay awake. Jake (the last security guard) got fired cause he was always snoring and a few things got stolen. </p>\n\n<p>But of all the nights for shit to go down it happened to me. I caught sight of this girl walking near one of the old platforms on one of my monitors and instantly jumped from my seat. No lie, she looked pale as a sheet. </p>\n\n<p>Tall and slender too, with her hair pulled back in a ponytail. I grabbed my baton and ran down to the platform to figure out how she had even managed to sneak in. When I got there she was just standing there, staring down the old tracks like she was expecting the train. </p>\n\n<p>&quot;Miss you really can&#39;t be here,&quot; I told her. She turned to me and she smiled. She looked absolutely beautiful, an angel really. </p>\n\n<p>Then something moved behind her. I don&#39;t know how to explain it but these two, large imposing men just seemed to come out of nowhere. Her expression suddenly went to shrieks of terror and I found myself frozen in place. </p>\n\n<p>She struggled with the men as they held her down. Then the darkness of the tunnel seemed to overtake them as I ran toward her. </p>\n\n<p>The ribbon in her hair fluttered off and landed on the rails below as it seemed that the trio vanished from sight. I felt my heart beating so fast I thought I was going to die. </p>\n\n<p>I went back to check security footage, trying to get a glimpse of what happened. But the angle was all wrong. </p>\n\n<p>I kept in the security room the rest of the night watching the monitors. Almost felt like I was in a Five Night&#39;s at Freddys game, just surreal like anything could happen. I was certain that I might be their next target. </p>\n\n<p>I called Jake the next morning to complain about it and to report the issue to our boss. I didn&#39;t know how to explain it, but I did know I needed to let them know about it. </p>\n\n<p>That&#39;s when things got super weird for me. See, the video footage looked completely different when they checked it. Like it just looked like I was standing there alone shouting to nothing. </p>\n\n<p>The boss thought I needed to have a psych evaluation and I told him he could stick it where the sun don&#39;t shine. \nSo yeah, now a few days later I&#39;m unemployed Ha. </p>\n\n<p>The main reason I&#39;m posting this is because of what Jake told me when I told him about the girl. He got very quiet. Then he mentioned that she sounded familiar, like someone that he used to know. \nI mentioned the bow in her hair and then he knew. There was a girl that had disappeared ages ago, everyone thought she had simply run from home. \nBut Jake seemed convinced it was the same girl. \nHe said that he was going to go back to check the train depot. \nBut I haven&#39;t heard from him since then. It&#39;s been almost a whole day and even his girl is a little freaked out about it. \nI wish they hadn&#39;t fired me or I would have gone there to help out my friend. \nBut as it is it looks like he&#39;s gone. \nI drove over to his apartment this morning to check and see if maybe he just hadn&#39;t come home yet. \nInstead I found a weird note on his door. </p>\n\n<p>Remember Sarah. </p>\n\n<p>Don&#39;t know what that means but his roomie mentioned he hadn&#39;t been home for days. \nI called the police this afternoon, they are looking into it. But it seems like this girl (Sarah?) and Jake have both simply vanished off the face of the earth. </p>\n\n<p>One more thing, before I try and get a little sleep today; I did get a call from my boss a few hours ago about something that he found near the rails. </p>\n\n<p>A white ribbon. He said it seemed out of place but he didn&#39;t want to bother it if the police returned to collect evidence. \nI may need to take a few extra pills tonight to calm my nerves.</p>\n</div>\n","author":"inmemoryofsarah"}