{"rank":"29","title":"Mind your toes.","id":"8lag16","url":"/r/nosleep/comments/8lag16/mind_your_toes/","time":"1526999718000","body":"<div class=\"md\"><p>I’m not a stomach sleeper. I generally prefer to sleep on my back. But sometimes (especially when I first climb into bed) I like to just lie on my stomach and cozily bury my face into my pillow - honestly, I live for that shit (It sounds dumb, but it feels great). And  because my feet get warm pretty fast, my favorite thing to do when I do lie on my stomach is to put my toes between my foam mattress topper and foot board and wiggle them around a little bit. </p>\n\n<p>Well, two weeks ago I brushed my teeth, got undressed, fluffed up my pillow, and laid on my stomach and nestled in. I buried my face in my pillow, I pulled the blanket off of my feet, and I put my toes in between my mattress topper and footboard and started wiggling them around like I always do. But this time, I screamed in shock as I felt the sharpest, most horrible pain I’ve ever felt in my life. I immediately sprang up so that I was sitting on the edge of the mattress and saw that my foot was pouring blood, so I took the case off of my pillow and wrapped it around my foot as tight as I could - I could feel my blood soaking through the pillow case and thought “how could I be bleeding this much from a cut? Did I hit an artery on a loose nail or screw or something?” . I grabbed my phone, called 911 and explained the situation, and about fifteen minutes later I was in the back of an ambulence heading for the emergency room. After a long couple of hours, the doctor told me it looked as if two of my toes had been bit clean off. </p>\n\n<p>For the last couple of weeks, I’ve been on pain killers pretty often. My stitches were removed earlier this week, and I have to wear special shoes for awhile until my foot heals. I’m just counting myself lucky that there were no complications from surgery and I should be able to return to normal life pretty soon. But the entire time I’ve been recovering, I’ve been left to wonder - what the hell happened? I live alone in a no-pets apartment complex, and the owner enforces that policy strictly. There are no hidden sharp edges in the bed frame, and even if by some bizarre accident it had, the paramedics would have found my toes somewhere in the bed frame or on the floor. There’s no logical explanation for what happened that night.</p>\n\n<p>While I was recovering, my friends and family turned my bedroom upside down looking for whatever could have caused my injury. They even looked through the rest of the apartment, pulling to the side every piece of furniture that an animal could hide under. They found nothing, aside from my very bloody bedsheets.</p>\n\n<p>PSA: the next time you go to bed, watch where you put your toes and fingers.</p>\n</div>\n","author":"CrisisActor911"}