{"rank":"4","title":"The Sims Nightmare","id":"8lanpa","url":"/r/nosleep/comments/8lanpa/the_sims_nightmare/","time":"1527001445000","body":"<div class=\"md\"><p>Man the nostalgia back then, it was great. When I was about ten, I received a pc and the game called “The Sims.” The game was great although there were a bit of issues. Great game.</p>\n\n<p>Um, okay let’s get to the main part. I was making the characters when their faces were demented, distorted… Of course I thought it was a graphical error due to it being released back in 2000. I apparently started the game, went through the intro, etc. I went into the character creation screen made a character. I could’ve just left the game right there, but no I didn’t. I just entered the game. All the characters of course loaded with those distorted faces.</p>\n\n<p>I started off with a few things I thought were hilarious. The characters started a fight with other AI in the game. Then things went dark. The characters grabbed a random sharp weapon out of nowhere. I don’t want to describe the horrifying things that happened. Then they proceeded to look up at the screen. Those distorted faces were worse.</p>\n\n<p>A speech bubble popped up out of nowhere. I read “This is what will happen to you, Mark.” I freaked out. Of course that’s my name. How did they know? I don’t know.</p>\n\n<p>I went downstairs to my parents. They looked EXACTLY like the characters in the game. They had the distorted faces, everything. They brought out something sharp. They said “We’re here, Mark.” They tried to chase me. I ran upstairs for my room. I closed the door. Still freaking out. </p>\n\n<p>I proceeded to destroy the disk. I heard the bangs from the other side of my bedroom door. I saw the glass window to my left. I grabbed my chair instinctively. I proceeded to throw it at the window. Finally, the third hit shattered the window. I grabbed my emergency ladder. Ran out the window onto the roof. I threw the ladder over the side, climbed down it, and then ran to the neighbors’ house. </p>\n\n<p>They were always there. They were very nice people. They comforted me. Later on I went back and tried to see if my computer was affected. Of course I looked through the files. I found out wallpaper has been changed. Oh god, the wallpaper depicted a horrifying photo. One that I will never forget. The photo contained a mutilated corpse. </p>\n\n<p>I was horrified beyond belief. But I had to keep searching. Next I found a notepad file. Of course this was Windows I run on. There was Nothing there at all. I saw a video file that said “Look at what you done.”</p>\n\n<p>I watched that video. It showed those characters going around town a killing everyone. There was blood everywhere. I exited out of that very quickly after seeing that. I looked online for this problem. I looked for the store it came from. It doesn’t exist at all. </p>\n\n<p>I did find one interesting article. It depicted about the characters I had were real people. The mom was shot in the head. The dad was found with a knife in his chest. They were both dead on the spot. Now I thought I had parents until I found the photo of the son. It was me. </p>\n</div>\n","author":"Isuckatbattlefield4"}