{"rank":"9","title":"If You Snore Please See Your Doctor","id":"8laxao","url":"/r/nosleep/comments/8laxao/if_you_snore_please_see_your_doctor/","time":"1527003525000","body":"<div class=\"md\"><p>My husband and I were married for 17 years, it would have been 18 years this November, but my husband passed in his sleep last night. It still feels like I&#39;m sleep walking through an unending hellscape. Let me give you some background so that you can prevent what happened to us from happening to you and your loved one. </p>\n\n<p> We married each other in our very early twenties after a casual sexual encounter led to a pregnancy. Although I was raised by a religious single mom, I was definitely not a saint. When this tryst occurred, I had a one year old daughter whose father, I&#39;d recently left, with the goal of  &quot;trying to get my life together&quot;. I moved back home, returned to my religion, started a technical school and found a part time job. The job was menial and low paying, but there was one perk they didn&#39;t explain in the training video. A co-worker soon to become lover and husband.</p>\n\n<p> My heart literally did the cliched &#39;skipped a beat&#39; when I saw him. He was 6&#39; even, lean and athletically muscular. His dark skin was as smooth and shimmery as a calm lake that catches the moon’s reflection at midnight, his hair was an even darker black satin. It was cut close and had sleek waves. His brown cinnamon bedroom eyes had me imagining only the naughtiest of secrets and I wanted to feel his full beautiful lips everywhere. I suppose I wasn&#39;t too bad on the eyes either, even after having a baby. I wasn&#39;t back to my high school weight, but I ended up thick in all the right places. </p>\n\n<p> Our attraction was instant and intense. The sex was unbelievable. It was so rauchy, and at the same time intimate and intensely satisfying. It felt like we were still &#39;fornicating&#39; even though we were married, if that makes sense. As I write this, I know I will yearn for his body to be inside mine forever.... God! Why didn&#39;t I take him, drag him to a doctor?! I feel terrible, but I guess its too late for woulda, shoulda, couldas now. Fast forward 17 years later, our babies are now 20 and 18. Our oldest has moved several states south and our youngest is graduating this June. How am I ever going to tell her what happened? We were supposed to be getting ready to enjoy an empty nest, but now our home will forever be hollow.</p>\n\n<p> Again its 17+ comfortable married years later and we&#39;ve both gained weight from too much food, too much drinking and not enough calorie burning. This caused the unfortunate side effect of my husband snoring at night and snoring LOUDLY. It&#39;s so loud that I try to fall asleep first to get as much rest as I can before the rattling lawnmower starts. Most of the time, this works and I wake up relatively rested and sane enough to work. Last night, however, was different.</p>\n\n<p> I fell asleep first like I planned and my husband stayed awake to watch a west coast NBA conference final game. I&#39;ve been asleep for about three hours when a door slamming outside our apartment wakes me up. I see that my husband is still awake and I hope he plans on staying that way until I fall back asleep. This is not what happens however. He lies down next to me and almost immediately begins to get that crackle in the back of his throat that lets me know the motor is about to start. I groan and try my best to ignore the mild snore that I know is beginning to build into the roar of a space launch.</p>\n\n<p> The worry that builds as I hear the decibels increase keeps me awake and I miss my chance to sleep through the mild rumble, the snore has now reached jack hammer level and I resign myself to reading some nosleep to at least entertain my bleary eyes through the blaring snoring. Miraculously, while I’m now wide awake, my husband quiets and I finally feel the welcomed heaviness of sleep coming over me. I drop my phone during a longer nosleep story and know that sleep has finally won. I close my eyes glad to get at least three hours of shut eye before my alarm sounds... I feel it first before I hear anything. My husband shifts and the bed moves greatly under his weight, I open my eyes lazily, I am in between wakefulness and the blessed oblivion of rapid eye movement and desperately want the inside of my eyelids to soothe my burning eyeballs.  That’s when I hear it. The snores my husband makes can only be described as what I would imagine: a small furry kitten, covered in snot, twirling around in the back of someone’s throat causing them to choke and rattle breathe at the same time.would sound like.</p>\n\n<p> I am almost in tears. To be jarred awake like that after being so close to dream filled oblivion and after touching the pleasant edges of unconsciousness, I can’t describe the desperate fury I felt at that moment. I don’t even fully understand myself what happened next. The next moments were nightmarish. Maybe it was a mix of too much nosleep reading during the witching hours of the night and the tortuous back and forth wrenching between vile wakefulness and highly desired, but unattainable sleep. Whatever it was, when I heard my husband’s breath catch again, instead of the usual irritated nudge to wake him up to catch a much needed gasp of oxygen, I gently laid a pillow over his face and laid down on top of it. He must have woke up, because he begain to buck, but I had the advantage. He was still foggy from broken sleep and was still trying to catch a breath that would never come. I don’t think he fully understood why he couldn’t breathe or why the pillow had become unmovable with unforeseen weight. He just stopped moving. I removed the pillow and saw his mouth agape, his eyes wide and his breathing finally quiet.</p>\n\n<p> I sleep or rather pass out until the alarm rouses a confused me from the shortest amount of REM I’ve ever had and still been sane. My husband had the day off, so I don’t disturb him, instead I shower and dress groggily, nagging my youngest into preparing for school also. I take her to school, go to work and wonder why I haven’t received any, “how is your day going” calls from my loving husband. I returned home many hours later to find my youngest in her room obliviously streaming videos and movies and am surprised to find my husband still in the same position in our bedroom. I teasingly pushed his arm to wake him up from his extended rest and am shocked by how cold his skin is. I tried to find his pulse and felt nothing. I finally look at his face and I know he is gone. I call 911 and strengthen myself to break my daughters’ hearts. I  know that we will never be whole again.</p>\n\n<p> Dear readers, sleep apnea is a killer. If you or your loved one snores please, please, please see your doctor.</p>\n</div>\n","author":"Hellaintsobad"}