{"rank":"2","title":"Definitely Not a Hallucination","id":"8lb0m1","url":"/r/nosleep/comments/8lb0m1/definitely_not_a_hallucination/","time":"1527004262000","body":"<div class=\"md\"><p>I&#39;ve come back from the dead. </p>\n\n<p>No, really. I was involved in a major car accident and had to be resuscitated multiple times. Thank goodness for EMTs! My accident was pretty gnarly. I don&#39;t want to get into it too much, because that&#39;s not the point of this. However, long story short, some assface decided that a red light means GO. Myself, being the sane person I am, thought that my green light meant that I, in face, could proceed through the intersection. </p>\n\n<p>SCREECH. </p>\n\n<p>Next I know, I&#39;m laying in a twisted pile of metal and glass. Agony ensues.  </p>\n\n<p>Passerby quickly called 911 and help was on the way. I had lost consciousness almost immediately after the accident, but from what I was told, an ambulance arrived within 2-3 minutes. As usual with such situations, the assface didn&#39;t suffer any severe injuries. A few cuts and bruises. While me, the law-abiding citizen, was laying in the street grasping at Death&#39;s veil. </p>\n\n<p>The responding EMTs went to work on me immediately. This is where things get a little funky. </p>\n\n<p>Now, a lot of you will think that this was a hallucination; that this was just my neurons firing erratically causing all sorts of freaky shit to enter my mind. But please, suspend your disbelief for a few moments and listen to my tale. </p>\n\n<p>Like I said before, I found myself laying in agony on the street. Next thing I know, I feel myself lifted upward into the air and my pain gone. I nervously open my eyes and see the sky above me. I tip my gaze below and see my body. Oh gosh it was horrible. I was a bloody mess. </p>\n\n<p>I&#39;ve never been a religious type and I immediately recognized what was happening for what it was: a hallucination. I knew that the accident probably caused all sorts of ruckus in my brain, and this was my brain dealing with that. The scene around me looks ordinary, aside from my broken body below. </p>\n\n<p>However, I take a closer look around and see someone. About 20-30 feet away from the wreckage stands a man. He is wearing white hooded robes, has a very loving face--almost like a father watching his son walk for the first time, and is surrounded by an etheric glow. He is smiling radiantly at me. At the me floating in the air, not the me in the street.  </p>\n\n<p>Don&#39;t worry, I didn&#39;t immediately throw my beliefs out the window and confess my sins. I knew that this was all a part of the hallucination. Most people report seeing some angelic being during a near-death experience. Out of the corner of my eye, I see the EMT performing CPR on me. </p>\n\n<p>The agony returns. </p>\n\n<p>I gasp for air as the feeling of having just been in an accident returns to me. Oh the pain was excruciating. My entire body felt like it was on a fire. I gather my thoughts a little bit, but the world turns black. The pain goes away and I again find myself looking down at my body. </p>\n\n<p>I hear the EMT shout, &quot;We lost him again!&quot; </p>\n\n<p>I start to wonder about my hallucination. It feels so real. But again, all of what I&#39;m seeing is completely able to be fabricated by my brain. My curiosity sets in and I look around for a detail that, if this were indeed a real life out of body experience, I can check up on later. I find it.</p>\n\n<p>The roof of the responding ambulance, number 112, has very distinctive wear on it. The white paint is worn off and the shape of it looks like a water bottle. Yes, I know that sounds ridiculous, but that&#39;s really what it looked like. I suppose it doesn&#39;t have to be a water bottle; it could be any bottle really. Either way, I seared that image into my brain. I was still 90% convinced I was hallucinating, but it would be interesting to check up on this later. If I survived.</p>\n\n<p>I look over to see if the man I saw earlier was there. He was. He looked a little different though. He was still smiling and wearing white robes, but this time his smile appeared forced. The glow surrounding him seemed to fade and his robes went from gleaming white to almost an eggshell white and looked as though they had been washed one too many times. The look on his face was no longer loving. I couldn&#39;t quite place it. I studied it and realized that the look I was seeing was impatience. </p>\n\n<p>Before I could react, my body burns again. I&#39;m laying on the street with the EMT looking over me with exhaustion and delight.</p>\n\n<p>&quot;Alright you&#39;re doing great buddy! Now stay with me this time!&quot; He bellows out at me. </p>\n\n<p>I want to. At this point, I don&#39;t care what kind of pain I am in, but I want to live. Then, in what was a bad decision, I try to move my head. Immediately, the already-damning pain shoots directly into my neck and the world turns black. </p>\n\n<p>With what felt like a whoosh, I was airborne again and gazing at the horror below. The EMT screams out, &quot;No! No man, come on buddy. We lost him again!&quot;</p>\n\n<p>At this point, my logical side is faltering. What is this is really happening? What if humans really do have some sort of soul and I am literally in my spirit body, watching my fleshly body die on the pavement below? I take a look at the ambulance again. </p>\n\n<p>Same as before, number 112, and the roof has a bottle-shaped imprint on it from weathered paint. I then look over to where the man has been standing. He is there again, and this time he is definitely not smiling.</p>\n\n<p>He has a sneer on his face now. The white robes are now yellowed and dirty. The etheric glow was completely gone; replaced with a glimmering and smoky air behind him. It was like looking at the top of a fire on a hot day. The air was being warped and twisted behind him. </p>\n\n<p>His eyes held anger. Deep anger. Fear overtook me. I tried to rationalize my thoughts and tell myself this was nothing but a hallucination, but I couldn&#39;t. It&#39;s hard to put into words, but I knew this was real. I knew I was looking at someone, or something, who wanted to take me somewhere terrible. </p>\n\n<p>The scene below has the EMT pumping at my chest furiously. A small crowd of onlookers has arrived, along with a few police officers. <em>Come on buddy, you got this!</em> I think to myself. I don&#39;t care how much pain I will be in, but I cannot be under that man&#39;s eye anymore. I refuse to go wherever he is trying to take me. I don&#39;t even truly know if those are his intentions, but I surely don&#39;t want to find out. </p>\n\n<p>&quot;Got him!&quot; The EMT shouts out as I find myself back in my body. I start to smile, even though and I in tremendous pain, and the EMT is puzzled. &quot;You&#39;re definitely an odd one sir. Who dies 3 times and comes back smiling?&quot; </p>\n\n<p>Before I can even attempt to respond, my eyes roll in the back of my head as the familiar blackness creeps in.</p>\n\n<p><em>Fuck!</em> Oddly enough, I think that the same time as the EMT below says it. He goes right back to work on me and I lay above, staring at the sky. I don&#39;t want to look anywhere else. </p>\n\n<p>Call it stupidity or human curiosity, but I had to. </p>\n\n<p>I looked.</p>\n\n<p>Ambulance number 112 and rooftop water bottle. Check.</p>\n\n<p>Creepy man/demon/ghost? Unfortunate check.</p>\n\n<p>Gone was any semblance of goodness from him. He was wearing tattered, stained robes. Dark, black stains crisscrossed against the yellowed fabric. Underneath the remnants of his hood, I could see a scalp that looked scarred and burned. </p>\n\n<p>His face was pure hate. The eyes bloodshot and narrowed into a snakelike gaze. Behind him was a trail of smoke with the same heated look as before. Do you know what&#39;s worse than someone looking at you with pure hate?</p>\n\n<p>Someone looking at you with pure hate while smiling. Rows of sharp, crooked teeth tore across his long, slivery smile. Suddenly, he broke tradition and moved towards me. </p>\n\n<p>I scream, but of course no one can hear me. Below, the EMT pounds on my chest. Another is putting an oxygen mask on me and tubes down my throat.</p>\n\n<p>The demon comes closer to me and reaches his hand towards me. I can&#39;t move. I try to run, but it&#39;s no use. You ever to try run while floating in the air? Maybe I can fly! Unfortunately, flying lessons are never given to humans so I end up flailing my arms and legs around in the air, looking like a pathetic mess. </p>\n\n<p>The EMT continues his CPR and I come back!</p>\n\n<p>Relief washes over me.</p>\n\n<p>&quot;Okay buddy, you have got to stay with me this time. Do not move! Do not smile! Do not talk! Just relax and blink at me twice if you understand me.&quot;</p>\n\n<p>I blink twice at him and follow his orders. There&#39;s no way I&#39;m dying again. My memory goes hazy at this point. </p>\n\n<p>From what I&#39;m told, I go in and out of consciousness. I don&#39;t lose my pulse again, and am taken to a hospital. </p>\n\n<p>A few weeks of recovery and I&#39;m laughing with some friends. I never told anyone of what I saw. Frankly, the more time passes, the more I chalk it up to a hallucination. A very intense and scary one, but a hallucination nonetheless. </p>\n\n<p>Weeks go by and I get a call. </p>\n\n<p>It&#39;s the EMT who saved me, multiple times. He wanted see how I was doing. We have a small conversation, during which I thank him multiple times. He extends an invitation to his station if I ever want a tour. A small gesture of welcome that I gladly accept. After all, I won&#39;t be back to work for a couple more weeks, so I have nothing better to do.</p>\n\n<p>A couple days later, he&#39;s giving me the tour. We are standing in a room that overlooks the garage. I never realized how many ambulances one station could hold. Nor that I&#39;d be coming during potluck Wednesday-gosh that chili was amazing. </p>\n\n<p>The EMT is talking to me, but his words soon fade into the distance. I am casually looking over the ambulances and see it.</p>\n\n<p>Number 112.</p>\n\n<p>It&#39;s roof bore the unmistakable emblem of a water bottle. Drenched into it amidst a swirl of worn paint. There&#39;s no way I could have hallucinated that. </p>\n\n<p>Which makes everything else I saw true.  </p>\n\n<p>Someday, I don&#39;t know when or how, but someday, that man is coming back for me. </p>\n\n<p>Someday I will look back on his evil face and he will take me with him.</p>\n\n<p>I&#39;ve died and lived to tell about it. I don&#39;t care if you believe me or not. I only know one thing.</p>\n\n<p>I don&#39;t want to die again. </p>\n</div>\n","author":"therudyshow"}