{"rank":"0","title":"Apple juice","id":"8lb3s7","url":"/r/nosleep/comments/8lb3s7/apple_juice/","time":"1527004910000","body":"<div class=\"md\"><p>Dear diary,</p>\n\n<p>I&#39;ve been watching so many teen movies with diaries in them lately that I decided to buy one for myself. Now that may be weird for a 27 year old guy like me but who&#39;s there to judge me anyway. However since I&#39;ve already lived so many years of my life, I decided to write weird stories from my past in here instead.</p>\n\n<p>I&#39;ve always been a lovable and helpful person. I&#39;ve been helping people with stuff my entire life, for example the first memory I have of being alive was of me, a 5 year old sweetheart and my little sister hanging out drinking apple juice, I heard the loud beeping noise of a car behind my sister, so I pushed her so she doesnt get hit by it. But something doesn&#39;t make sense at all, because after pushing her she didn&#39;t get back up. <em>She was lying there on the ceramic floor with her apple juice spilled over the ground</em>. I sat there calling her name over and over again, but she didn&#39;t respond, not even after the babysitters in white came into the room. They told me that everything will be ok and that it&#39;s not my fault</p>\n\n<p>That doesn&#39;t make sense, why would it be my fault?... I helped her...how could that possibly be?</p>\n\n<p>Another thing that happened was when I was 9, alone with my teacher in the classroom because I got detention. She was biting on a red apple. I guess she was eating too fast so she started choking on it. Like the hero that I am, I rushed to her aid and got her to spit the apple out. I guess the apple had a lot of juice in it because after helping her from choking, my hands and pencil were drenched in <em>the same red apple juice my sister was drinking</em><strong>.</strong></p>\n\n<p>Some other strange thing happened when I was 13 and was hanging out with my best friend Marcus. <em>He was a bit younger than me but he could understand me perfectly well.</em> We were young and loved adrenaline so we took some apple juice and went on some abandoned railways to do cool skateboard tricks. I told my friend he should go first since I really liked watching the tricks he used to do. I watched him go from the side we were to the other but 5 seconds after he got there he vanished. Before vanishing he told me something, but I couldn&#39;t really understand him well <em>due to the loud noises.</em> I know he made it to the other side with his skateboard, I mean I even tired helping him by <em>tying it to him so he doesn&#39;t fall off. But after he vanished, t</em>he only thing left of him was the apple juice spilled over the tracks. </p>\n\n<p>Another weird story was when I got my first girlfriend, I was 18 and she was 16. She didn&#39;t like me as much first, but I gave her so many gifts, surprised her on her birthdays and helped her out when she couldn&#39;t sleep at night so many times, that she grew to like me. She looked to sweet sleeping, much like an angel sleeping after a long day of giving advice to all the good people like myself. But the night she finally decided to let me have sex with her was really strange. I took a box of apple juice and got on top of her. At first she fell asleep so I thought I was too boring for her, I decided to bite her neck gently a couple of times so she woke up. She stared at me whilst red apple juice was flowing off of her pretty breasts. <em>She got so happy after seeing me that she started crying</em>, so I told her that I would do my best since she loved me so much. You should have seen how happy she was. S<em>he was flailing around and crying out of joy</em>. But long before I finished, she stopped doing that and went back to sleep. That night I had a dream where she told me that she doesn&#39;t want to be around me anymore. She said I was too boring, and to my fear, she left me the next day, I parted with her after dropping her off at the forest her hotel was stationed at. I never saw her again. <em>Only thing I have of her now is her apple juice spilled all over my car.</em></p>\n\n<p>Those are most of the weird things that happened to me in my 27 years of life. But in order to keep this diary filled, I will continue to write any interesting thing that happens to me going forward. I hope my future children can read this diary and be proud of their helpful father</p>\n</div>\n","author":"MagiKarrf"}