{"rank":"4","title":"Demon House","id":"8lb3dc","url":"/r/nosleep/comments/8lb3dc/demon_house/","time":"1527004838000","body":"<div class=\"md\"><p>Here’s a little background about myself. I’m 21 years young and my name is Logan. I’m a southern belle who lives in southwest Georgia. This event happened to be when I was just 12 years old. I had never had any paranormal experiences before that. This particular year, I had just started middle school and going through an awkward phase (don’t we all?). I remember this day so well. I had just arrived at school. I got my breakfast as usual and went to my homeroom to eat before school started. I was only there for 15 minutes when my cousin and I were called to the front. When I got there, I saw my stepmom in tears. I knew this had something to do with my grandfather. He became sick over the summer. His kidneys were failing and he had cancer that spread throughout his body. The ride to my grandparents house was quiet. It was cold that October morning, but as soon as I got out of the car, the air seemed colder. I walked into the house. This house was usually filled with happiness and good vibes, but today it was filled with grief. I walked into the room where my grandfather had been staying. When I saw him, he was stiff and all of the color from his body was gone. His skin was cold. I fell to my knees. I had never felt that kind of hurt before. On October 19, 2009 i lost my best friend. </p>\n\n<p>A month or so after his death, my grandmother could no longer stay in that house because she couldn’t continue living with his memory. It didn’t feel normal with him not being there. She wanted to sell the house, but we didn’t want her to. The house was where our family felt at home. This was home for everyone. My father told her that he would take the house and he would pay her rent every month. I was excited to move in because that is where I spent my days after school with my cousins until our parents came to pick us up after work. It was my childhood home.</p>\n\n<p>Everything seemed normal when we first moved in. I felt like I was at home. Every morning when I woke up, my rug that I had beside my bed looking like someone tripped over it. When my grandfather was alive, one of his legs was paralyzed. He was a Vietnam soldier so it happened as a result of the war. He would drag his foot when he walked and sometimes tripped over things like rugs. So I figured it was just him watching over me when I was sleeping. I felt his presence in the house often, so it didn’t really bother me that much. We would be sitting in the living room watching tv when suddenly the door to the room he died in would open on its own. My brother slept in that room and said he could feel his presence at times. It started off with little things like that.</p>\n\n<p>Months went by. I started to notice somethings that weren’t normal. I would be home alone, and feel an overwhelming sense of fear. I didn’t feel comfortable at all. One night while everyone was sleeping, my dad randomly woke up. We always left the bathroom light on so the house wouldn’t be completely dark. He could faintly see something that looked like my grandfather but was completely evil. It’s eyes were completely black. It choked my dad until he was almost unconscious. He somehow managed to escape. He ran to the bathroom trying to catch his breath. My step mom didn’t wake up until she heard him gasping for air in the bathroom. </p>\n\n<p>This particular experience didn’t happen in the house, but it happened to one of my cousins. He was home alone one day watching tv. He kept hearing this noise like someone behind him, but nobody was there. His dog was growling at someone in the kitchen but he didn’t see anyone. He went back to the living room to watch tv when he heard glass breaking in the kitchen. He went back in there, and he saw the same thing my dad saw. It looked like our grandfather, but it wasn’t him. It’s eyes were completely black and just plain evil. He ran outside to call our aunt to come pick him up. He didn’t stay at his house alone for a while after that.</p>\n\n<p>Now I’m going to take some time to explain this better. My grandfather was a kind man. He would never hurt his family. He loved us deeply, especially his grandchildren. There was nothing evil about him. So this thing could not possibly be him. My cousins and I have explored the idea of maybe this was a family curse since this started happening after he died. I don’t know what it is, but there’s definitely something going on that we don’t know about. </p>\n\n<p>Back to my story, things in the house seemed to get worse. I never saw the thing myself, but I definitely felt it. One summer afternoon while my parents were at work and I was home alone, I was in the living room watching High School Musical (I know I’m a dork lol) and I hear something in my parents bedroom. Their bed was old so it would squeak every time someone get on there. Our only dog at the time was in the living room with my so there’s no way it could have been her. It sounded like someone was on the bed. I called my grandmother to tell her what’s happening. She told me she moved out because she was experiencing in the house as well but she thought it was her husband. She didn’t think it would harm anyone. I called my aunt to come get me because I couldn’t stay there alone anymore. Whatever this thing was, it was affecting me mentally. I was struggling with my sexual orientation at the time. I grew up extremely religious, so I was so ashamed of myself for having these feelings for women. I honestly feel like I was on the verge of being possessed. I was suicidal. All I wanted to do was kill myself so I wouldn’t have to be tortured anymore. Every time I tried overdosing, no matter how hard I tried to keep the pills down, they would always come back up. This thing was not going to let me die. I know it wanted my torture to be slow. My family was being torn apart. We were always arguing with each other. My dad and stepmom almost got a divorce. My dad and I had always been close but we were always arguing over something. The smallest things. </p>\n\n<p>Every time I came home, I didn’t feel like I was at home anymore. It didn’t feel like this was the house I spend most of my childhood playing with my cousins. It didn’t feel like the house I made so many good memories with my family. It felt like I was walking into hell every time I came home. I’m not a religious person at all, but that’s what it felt like. Every time we experienced something in the house, we didn’t react much to it anymore. It became the new normal. We were literally sharing a home with an evil, vile, demonic thing. </p>\n\n<p>It was spring time of my 8th grade year when we finally decided to move out of the house so my grandmother could sell it. We were so tired of dealing with this thing. We hoped that moving away would solve everything. We moved into a new house. It felt good to have a fresh start. I was finally coming to terms with who I am as a person and embracing it. The house we moved into was haunted as well, but nothing like what we were dealing with. </p>\n\n<p>I was 12 when those things started happening. I’m 21 now and I still have nightmares about what I went through and that house. I still feel like it’s never left. I occasionally can feel its presence. My cousins still see it occasionally. I don’t know what it is or why it’s with us, but it’s still here. No matter what we do, it will always be with us. It’s one of those things that you have to accept and deal with. </p>\n</div>\n","author":"Lesbihonest_16"}