{"rank":"0","title":"The Little Girl in the White Dress","id":"8lb7ix","url":"/r/nosleep/comments/8lb7ix/the_little_girl_in_the_white_dress/","time":"1527005679000","body":"<div class=\"md\"><p>I work as a nurse in a hospital in New York City. I&#39;m constantly busy with patients that I hardly have a moment to myself. However, I love my job. The pay is nice and I love interacting with the patients, especially the sweet elderly ones. </p>\n\n<p>I was on my shift a few months ago, a newbie at the hospital at the time. I still had a lot to learn, but at the time I had been here for a mere three months. </p>\n\n<p>Anyways, I was making my beginning shift rounds, which I do at the beginning of every shift, just to make sure the patients are OK. I do this every day before I clock in. It isn&#39;t tedious and it&#39;s nice to meet the new patients. I open the door to a patient room and notice the IV bag running low. As I begin to place a new one onto the stand, I see a young girl run past.</p>\n\n<p>As I follow her silently, she goes to the supply closet and closes the door behind her. When Iopen it, there is no one there, just IV stands and other typical equipment. I didn&#39;t;t think much of it...I am a nurse, I get tired and see imaginary things sometimes/ That&#39;s just how it is.</p>\n\n<p>Weeks go by and I see her everywhere...in the Staff Only bathroom, in the Break Room, and in other patient&#39;s rooms. She never spoke, only ever giggled once, and she loved hiding and not being seen. </p>\n\n<p>I get to a point, on this particular day where I want to know more about her...so I ask my coworker, Janet. She&#39;s on the older side, with graying hair, a sluggish look, and  big brown eyes.</p>\n\n<p>&quot;oh, yeah...that&#39;s Kimmy.&quot; she says. &quot;You&#39;ll see her a lot in your time here. She just does what she wants to.&quot; she finishes.</p>\n\n<p>&quot;She doesn&#39;t...hurt anyone does she?&quot; </p>\n\n<p>&quot;Oh, no. Kimmy is a sweetheart. SHe&#39;s actually saved patient&#39;s lives before.&quot; </p>\n\n<p>&quot;How?&quot;</p>\n\n<p>&quot;She appears next to their door whenever their IV is running low, and she only giggles if the patient is dying. She&#39;d not giggling to be rude, she can&#39;t speak, so she giggles.&quot;Janet finishes. </p>\n\n<p>I look at her puzzled...</p>\n\n<p>&quot;long story short...you don&#39;r have to worry about her...she&#39;s the crowning jewel of the Intensive Care Unit.&quot;</p>\n\n<p>&quot;Ok...good to know.&quot; right as I say this my phone goes off, alerting me the it was time for my next round. </p>\n\n<p>I make that round with no trouble until I get to Rhonda&#39;s room, a young woman who was in a shootout with police over her abusive husband. </p>\n\n<p>&quot;Hello, Rhonda...how are you today?&quot; I ask politely.</p>\n\n<p>&quot;I&#39;ve been better, thanks.&quot; she says bitterly.</p>\n\n<p>&quot;Do you need more morphine?&quot; I ask.</p>\n\n<p>&quot;No! What I need is to be left at peace! I don&#39;t care what little games kids play around here, I don&#39;t want a singing youth group coming into my room!&quot; she yells.</p>\n\n<p>&quot;Ok, Rhonda, please calm down...your blood pressure is going up.&quot; I reply.</p>\n\n<p>&quot;Ask me if I care! Ask me! Ask me!&quot; she keeps shouting this as I leave the room. </p>\n\n<p>Janet looks at me stunned as I plop in my chair.</p>\n\n<p>&quot;Rhonda again?&quot; she asks.</p>\n\n<p>&quot;Yep...she&#39;s on another tangent.,&quot; I reply, grabbing my Salad bowl from my desk and poking around in it a little. </p>\n\n<p>&quot;This is always going to happen with patients.&quot; Janet says. </p>\n\n<p>&quot;Yes it will, especially ones like Rhonda.&quot; I say, not looking up from my salad. </p>\n\n<p>The next night was even worse, with Rhonda on a tangent and another patient, Sam, looking worse than ever. So, I gave Rhonda some sleeping meds and went to Sam&#39;s room.</p>\n\n<p>&quot;Good morning, Sam.&quot; I say.</p>\n\n<p>&quot;Good morning, beautiful.&quot; he replies.</p>\n\n<p>&quot;Sam, we&#39;ve been over this...I may look familiar but I am not your girlfriend.&quot; I say.</p>\n\n<p>&quot;Oh...right.&quot; he replies, rubbing his eyes.</p>\n\n<p>&quot;So, how&#39;s the pain level today?&quot; I ask, pulling on some gloves.</p>\n\n<p>&quot;It&#39;s bad today. Maddie.&quot; he replies.</p>\n\n<p>&quot;Ok, I&#39;ll give you an extra dose of morphine and some sleeping meds to help you get through the pain.&quot; I say, adjusting the IV bag. </p>\n\n<p>&quot;Ok. thank you.&quot; he replies.</p>\n\n<p>UPDATE:</p>\n\n<p>I decided to post this after long thoughts about if. wanted to or not. As it turns out, the girl was right, Sam was on death&#39;s bed, but I was able to save his life before it was too late. He will be fine, thanks to that girl&#39;s giggling. She really does save lives!!</p>\n</div>\n","author":"KKAndrews15"}