{"rank":"1525","title":"I don't think my father in law likes me very much","id":"8lb9vj","url":"/r/nosleep/comments/8lb9vj/i_dont_think_my_father_in_law_likes_me_very_much/","time":"1527006159000","body":"<div class=\"md\"><p>I met my wife’s father for the first time only the day before the wedding. Other than our mutual love for his daughter, we had almost nothing in common. He was a hard-assed former Federali who grew up in Los Cabos, and I was a twenty-two year old English major from the burbs. He’d been shot twice taking down members of the cartel, and I was a backup vocalist in an acapella cover band. Needless to say, we didn’t exactly hit it off.</p>\n\n<p>I had, of course, wanted to meet him earlier and on different terms, but a certain beautiful accident accelerated my and Maria’s relationship timeline, and it seemed like a good idea to have the wedding before she started to show. From the moment I first saw him and tried to shake his hand to the moment he and Maria’s mother drove away, I didn’t see a single crack in his steely reserve. The man was not the smiling type, and I considered myself lucky to have gotten through without him taking a swing at me.</p>\n\n<p>I was a scrawny little guy, pale from a life lived almost exclusively indoors during the daylight hours. He was from an era where the signs of a good provider were the calluses on your hands and the grit in your soul. At the rehearsal dinner, Maria insisted I try to connect with her father. “My two favorite guys in the whole world.” How could I say no?</p>\n\n<p>Hector and I sat outside the manor, the two story plantation style bed and breakfast we’d rented for the weekend for the service and reception. As night fell, Maria and her mom made excuses and left us alone. I tried for small talk, but nothing was going to get through to this guy. Until, “You feel like a drink?”</p>\n\n<p>Hector turned away from the vineyard where he’d been casting a dead stare for the last half hour and raised his eyebrows at me, the closest I’d come so far to a smile and I was grateful. He asked, “You got any tequila?”</p>\n\n<p>This made me hopeful. If there was one thing my liberal arts degree had taught me how, it was how to drink. I found a bottle and a couple double shot glasses and poured the first round. Hector gave me a disapproving look when I pulled out the limes and salt, so I put them away and pretended I had never brought them out in the first place.</p>\n\n<p>We took our drinks and Hector loosened up. Or maybe it was just me, becoming less aware of his unbearable scrutiny. He let a few things slip. Not exactly secrets at first, more unspoken realities that we had yet to acknowledge.</p>\n\n<p>“You know, I don’t see how an English degree is going to provide for Maria.”</p>\n\n<p>He poured the next shots.</p>\n\n<p>“This place is too fancy for me. Those fields look like they’re just here for show.”</p>\n\n<p>He poured the next shots.</p>\n\n<p>“It’s really not your fault you’re the way you are. But this country is weak. It makes weak people. And I want more for my Maria and our grandkids.”</p>\n\n<p>He poured the next shots. This guy wasn’t slowing down or showing any signs of needing a break. And before I knew it, it was two in the morning and I was hammered worse than at my bachelor party.</p>\n\n<p>“Kid, let me tell you something. I’ve been shot, stabbed, everything but killed. And I’m better for all of it. But you ain’t worked a day in your damned life.” He pulled down his shirt to show an old faded scar on his collar bone. “I got this from a shithead in Los Cabos. He took a knife to me. When I got the upper hand, he begged for his life. I can still see that pathetic little worm begging. But I put that same knife into his gut and twisted. That’s what it means to be a man. I made the world a better place. But look at you. You can’t even handle your booze like a man.”</p>\n\n<p>I considered for a split second lecturing the old fossil on the effects of toxic masculinity, but instead I threw up in the rose bushes.</p>\n\n<p>We didn’t speak of it again. We didn’t speak of anything again until after the wedding. Maria asked how it went, and I lied and said “Good. I think we’re really starting to bond.” I was a little hung over for the wedding, but other than that, the ceremony was beautiful.</p>\n\n<p>Half a year later, little Brianna came into this world, which meant that Maria’s parents would once again be coming to visit. I surprised my wife by insisting this time around that Hector and I spend at least one night together, bonding time for the guys. I splurged for the whole thing, surprising her with a couple of weekend passes to a fancy spa / daycare for new mothers that I found on Groupon. (Say what you will about Los Angeles, but I love how capitalism caters to the specific.)</p>\n\n<p>I dropped Maria, her mom, and Brianna off at the front doors of the spa and told them to have fun and relax. Maria told me not to let her dad get too far into my head. “He knows how to hit you where it hurts. Remember that I love you both, and all I want is for the two of you to get along.”</p>\n\n<p>Those were the words floating around in my head as I drove back to our house, where Hector would be waiting for me. The final words of my adoring love, asking me to do whatever necessary to make peace with the man who raised her.</p>\n\n<p>Hector was waiting in our den with a bottle of tequila. He was sitting in the recliner (my seat), with an actual honest-to-goodness smirk on his face.</p>\n\n<p>“Ready for round two?” he asked, waving the bottle of bottom-shelf liquor at me.</p>\n\n<p>I laughed and said, “Actually, I thought we could start the night off a little differently.”</p>\n\n<p>“Don’t be a pussy. Let’s take a shot first. Then we’ll do whatever mamsy pamsy kumbaya bullshit you got planned for this weekend. But I ain’t talking about feelings. I ain’t gonna hug it out or call you son.”</p>\n\n<p>“Whoa, whoa, whoa,” I said, holding out my hands for him to stop. “I think you’ve got the wrong idea about why I asked to spend the weekend with you.”</p>\n\n<p>“I don’t care why you did it. Nothing you can say will make me change my mind. You’re not good enough for my daughter. So why don’t I go to the bar for the weekend, and you can go to your room and draw, or whatever it is you do.”</p>\n\n<p>I relaxed and let out a laugh.</p>\n\n<p>“Can I be real with you for a second?”</p>\n\n<p>He made no reaction, which I took to mean yes.</p>\n\n<p>“I’m not stupid. I know you don’t really like me. And that’s okay. But for Maria’s sake, I want us to at least be on speaking terms. This constant negging is fine when she’s not around, but when she’s here can you at least pretend you don’t hate me?”</p>\n\n<p>He opened the bottle and poured a shot for himself, threw it back, and said, “I don’t hate you and more than I’d hate a stray dog pissing on my car. You aren’t worth hating. You annoy me.”</p>\n\n<p>Wow. Maria was right. He certainly had a way with words.</p>\n\n<p>“I want to propose something,” I said. “Let me show you what it is I do. If you still don’t think I can provide for Maria after that, we don’t ever need to speak again. Hell, I’ll even open you a tab at any L.A. bar you want. Sound like a deal?”</p>\n\n<p>He shrugged.</p>\n\n<p>“I want you to see my studio.”</p>\n\n<p>I walked towards the door leading downstairs into the basement. A second later, I heard him stand up and follow.</p>\n\n<p>Good, I thought. He’s going to at least give it a shot.</p>\n\n<p>He followed me downstairs to a place where I rarely let other people see. This was my studio. Half-completed canvases adorned the walls. Some of the work was commissioned pieces for local companies. Logos and commercial work. It paid the bills. Some of the paintings were passion projects. Images of dreams or scenes from my own imagination. An eight by-three canvas was propped against one wall. A piece I’d been working on for two years now, an otherworldly landscape dominated by mushrooms and trees in the moonlight called “Mysterium.” I won’t bore you with the details, but I will tell you this: Hector was not impressed.</p>\n\n<p>“You’re saying people actually pay you for this shit?”</p>\n\n<p>“Some of it.”</p>\n\n<p>He looked all around, nodded, then said, “Okay. I think I’ve seen enough. Let’s find that bar, huh?”</p>\n\n<p>But I ignored him, walking over to Mysterium. The purple had dried too bold. I’d need to add another coat to make the other colors pop right.</p>\n\n<p>“Do you know who Lucas Cadiz was?”</p>\n\n<p>I turned to see that Hector was furrowing his brow. The question had taken him off guard. He recognized the name, and I knew he would.</p>\n\n<p>“Yeah, Cadiz was a drug runner for the cartel in the eighties, before you were born. A real asshole, went down in a firefight in Mexico. They filled him so full of lead his corpse was more metal than meat. What do you know about him?”</p>\n\n<p>“Well,” I said, “Here’s a fun fact. This home you’re standing in right now used to belong to Lucas Cadiz.”</p>\n\n<p>“What?”</p>\n\n<p>“Yeah, it wasn’t a matter of public knowledge. I really had to do my research to find out. But Cadiz made frequent stops here. Used this place as a sort of hideout. Really, it was more of his warehouse. He hid drugs down here, in a secret room behind his false wall. That’s why I picked this home to buy.”</p>\n\n<p>“Alright, man. You’re starting to freak me out. Let’s just go upstairs already.”</p>\n\n<p>“But you haven’t even seen my artwork yet.”</p>\n\n<p>I pulled back the canvas and place it gently against another wall. Even if the painting hadn’t been there, I doubt anyone would have seen the switch on the wall if they weren’t looking for it. It even took me almost a week to find Cadiz’s secret room. Hidden down here. Not on the official floorplan. A secret space. One that I could keep all to myself. One where I could do my work in privacy.</p>\n\n<p>I pressed the latch to open the door, then I took a step inside, confident that Hector would follow. I heard him gasp and felt a slight sense of accomplishment when he saw what was on the other side.</p>\n\n<p>Today’s piece was a scumbag named Vincent Garcia, suspended by the shackles around his wrists about two inches above the drain in the center of the concrete room. I could raise or lower the chain as much as I needed to, depending on my piece’s height. And I alway liked to keep them right about this far from the floor. Close enough that they could almost reach the ground if they stretched.</p>\n\n<p>His mouth was taped shut and his eyes were wide open, and I knew that there would be fear when he saw me again, but when he saw Hector there was suddenly something else. An understanding. Like all hope was lost.</p>\n\n<p>He was a special piece. Took me a long time to track him down, but I knew that this needed to be perfect for Hector. And this was the only one that would do. Vincent was a low life. A monster. He’d killed the children of his enemies and made their parents watch. He’d gone decades without getting caught. And fifteen years ago, he shot a Federali named Hector in the stomach and left him for dead. Vincent was the one that got away. And when Hector saw him, I could suddenly feel the energy in the room transform.</p>\n\n<p>After a few long, glorious, painfully powerful seconds, Hector found the words.</p>\n\n<p>“What the fuck is this?”</p>\n\n<p>“Do you like it?” I asked. “I made this all for you. You’ll find a series of tools in the box at your feet. You can use anything you want. Or I can go and get you something else.”</p>\n\n<p>He looked at me with horror, or amazement, or something else entirely. “What are you?”</p>\n\n<p>I laughed. “I’m a killer, Hector. And I’m an artist with a very special talent. I can track down the worst of the worst. And when your Maria sleeps peacefully upstairs, I give the bad men of this world what they deserve. I prefer pieces like this one.” I tapped Vincent on the head, prompting him to shake and fight, but he was far too weak to really do much. “The child murderers. Not a whole lot of people more deserving of what I do than this lot. But every now and then I get to mix it up. Like right after I bought this house, when some of Cadiz’s men came around looking for the smuggler’s secret stash. It took four days for the last one to die. Sometimes I’ll cull the rapists. The mass murderers. The politicians.” I gave him a wink.</p>\n\n<p>“You… you’re… you’re crazy,” he stammered.</p>\n\n<p>“Aw come on now, Hector. You know that this is the way the real world works. I didn’t expect you of all people to turn out to be a big softy. I know you’re probably thinking of pulling out the gun in your ankle holster and putting two in my ticker right now. And if that’s what you want to do, I won’t stop you. But I bet I could if I wanted. You see, I may look soft, but that’s the same thing every one of these men thought before I choked them out and brought them down here. I may not be the strongest guy ever, but I’m faster than I look.”</p>\n\n<p>Hector pulled the piece, just like I was afraid he might, but he didn’t point it at me right away. He hesitated, aiming the gun at the ground.</p>\n\n<p>“You kill people?” he said, breathing heavily.</p>\n\n<p>“Only bad people. And trust me, your girl has never been safer than she is with me. I considered keeping this all secret. Never telling a soul. But she wants so desperately for you and me to get along. I’ll admit, I considered arranging for you to have an accident that left you at the bottom of a cliff with no arms or legs.”</p>\n\n<p>I took a step forward, and he took one back.</p>\n\n<p>“I thought you said you only kill bad people.”</p>\n\n<p>“Are you saying you don’t think you’re bad people?” I asked with a smile.</p>\n\n<p>He pointed the gun at me and I snatched it away.</p>\n\n<p>He went pale, and I said, “Sorry. Natural reaction. Here.” Then I extended the weapon by the barrel, offering it back to him.</p>\n\n<p>I could see the gears turning. Then, finally, he did what I wanted him to do. He knelt down to the box of tools and picked out a saw blade. An excellent choice.</p>\n\n<p>I put the gun onto the ground and started for the door. “Once this thing is closed, you can be as loud as you want. Nobody can hear anything through these walls.”</p>\n\n<p>“Wait a second,” he said, prompting me to stop. “Aren’t you going to stay and help?”</p>\n\n<p>I looked at him, and he extended a long, sharp knife. As I reached to take it, Hector gave me the biggest smile.</p>\n\n<p>Now we’re getting somewhere, I thought. As we began our first real night of father and son bonding, I couldn’t help but suspect that it wouldn’t be the last.</p>\n</div>\n","author":"SavageCardigan"}