{"rank":"1062","title":"I found out why my laundry always took a little longer than the machine said it would","id":"8lb97k","url":"/r/nosleep/comments/8lb97k/i_found_out_why_my_laundry_always_took_a_little/","time":"1527006023000","body":"<div class=\"md\"><p>I was living alone in a small apartment in a big city. When I moved in, my next door neighbour – a handsome man about my age – offered to show me how the laundry room worked. I didn’t think the washer could possibly be that complicated, but I didn’t mind spending a few minutes alone with this guy. That, it turned out, was a mistake. </p>\n\n<p>“I like your hair,” he said, winking at me as we crammed into the small elevator. </p>\n\n<p>“Oh, uh, thanks,” I said, tugging at the tips of my long, blonde hair. </p>\n\n<p>“Is it your natural hair colour?” he asked. This was not how I expected the conversation to go.</p>\n\n<p>“Uhm, yeah, I guess.”</p>\n\n<p>“You have to guess?” he said, after a slightly too long pause.</p>\n\n<p>“No, I guess I don’t…”  </p>\n\n<p>“Sorry if that came across as weird,” he continued after another slightly too long pause. “It’s just, mother is a hairdresser, and she instilled me with a strong sense of aesthetics when it comes to women’s hair.”</p>\n\n<p>I was definitely regretting taking him up on his offer when the elevator came to a halt two floors below, and he pushed open the door to show a dark basement. I couldn’t help but think that nobody would be able to hear me scream down there. I briefly considered slamming the elevator door closed and getting the hell out of there, but I couldn’t bring myself to being that rude to my new neighbour. I was probably just being paranoid, anyway.</p>\n\n<p>“Oh, uh, cool,” I responded, following him around the corner into the little room that contained the washer and dryer.  </p>\n\n<p>“So, these are the buttons for the program,” he said, his eyes not quite meeting mine. As he continued the explanation, he kept looking just over my shoulders and my head, but never actually making eye contact. I figured he was embarrassed at how forward he had been before, and calmed down a little as time passed and he still hadn’t assaulted me. “And that’s it!”</p>\n\n<p>I walked out of the little room, him following behind. I could hear him breathing, and felt deeply uncomfortable as we crammed back into the tiny elevator. </p>\n\n<p>“Just let me know if you have any problems, okay?” </p>\n\n<p>As we exited the elevator, he still didn’t meet my eyes. I turned away from him, and it clicked. My hair. He had been staring at my hair the whole time. I repressed a shudder, hurried into my apartment, slammed the door shut, and locked it. Of course I got a creepy neighbour, just my luck. As it turned out, I hardly ever saw him, so it wasn’t really a problem for the most part. </p>\n\n<p>The laundry room, on the other hand, I got to see again many more times, way more than I wanted to. You see, the machine had this annoying habit of finishing a bit later than what it said it would on the display. At first I just blamed myself; I had this bad habit of only setting a timer once I was back in my apartment, and so I just assumed I kept getting it wrong. Slowly it started to dawn on me that it was, in fact, the washer that was late, not me that was early. I tried the obvious solution - simply adding five minutes to my timer – but all that did was show me that the washer wasn’t always late, and it wasn’t always five minutes either. I’m not gonna pretend like this was a mystery that I lost sleep over, but I did grumble about it weekly, as I hated spending time in the creepy basement. </p>\n\n<p>I didn’t lose sleep over it, that is, until I found out why it happened. </p>\n\n<p>I had tossed my dirty underwear into the washer, turned it on, and taken the elevator back up like always. I groaned loudly as I realized my mistake; I had left my keys in the basement. Back down into the basement I went.  </p>\n\n<p>As the elevator slid down into what I by now thought of as a dark abyss, I saw through the little window that the light was on out there. I was sure I had turned them off; I always did, even though I hated the moment of darkness in that basement. </p>\n\n<p>I pushed the door slowly open, and stepped outside, carefully closing the door behind me. A sound? I paused. Is there a dog down here, sniffing around? I peeked around the corner into the little room that housed the washer and dryer, and froze, heart so far up my throat I almost gagged. </p>\n\n<p>The neighbour was standing there, holding a pair of my wet panties to his face, inhaling deeply. I jerked my head back. Get out without alerting him was the thought that shot through my mind. I backed away, blindly groping behind me for the door. I got a hold of the handle, taking another quick step backwards just as I realized the door didn’t actually open. I looked in horror as the elevator ascended, leaving me trapped in the basement with that man. </p>\n\n<p>“Hey neighbour!”</p>\n\n<p>My insides froze. I slowly turned to face him, certain I was about to die. </p>\n\n<p>“I guess these are your keys, then?” He held the keys out to me as he walked towards me. I frantically searched for something to say, something that would defuse the situation. </p>\n\n<p>“Yeah, thanks,” I managed.</p>\n\n<p>“No problem!”</p>\n\n<p>After a painful eternity, the elevator came back down. We both shuffled in, and stood there without talking. My heart was beating so hard I thought he must be able to hear it; I could see my shirt move with each heartbeat. But what actually broke the silence were the deep, loud breaths he was taking. We passed the first floor, and I braved a glance in his direction. He was staring at my hair, nostrils wide, a look of pure ecstasy on his face. The second floor drew closer as I prayed to whoever was listening to get me the hell out of there. I practically jumped out of the elevator when it finally came to a halt. </p>\n\n<p>“See you around then!” he said, and entered his apartment. </p>\n\n<p>I slammed my own door shut, locked it, and put a chair in front of it for good measure. Then I sat down on the couch and started crying. </p>\n\n<p>When I finally calmed down, I called the landlord. He told me he couldn’t really do anything, he only had the word of one tenant, he had never had any complaints about the guy; I needed to contact the police if I was scared.  </p>\n\n<p>“Anyway, he’s moving out at the end of the month, sweety. So don’t worry too much. You’ll never see him again.”</p>\n\n<p>I didn’t contact the police. I didn’t, but I wish to god I had. Because I did see him again. A few years later, on the news, when he was arrested for the murder of three prostitutes.</p>\n\n<p>All of them with <a href=\"https://www.facebook.com/pocketoxfordwrites/\">long, blonde hair.</a></p>\n</div>\n","author":"PocketOxford"}