{"rank":"133","title":"Sickness","id":"8lbb3g","url":"/r/nosleep/comments/8lbb3g/sickness/","time":"1527006422000","body":"<div class=\"md\"><p>I’m a psychiatrist by profession, which isn’t much different to a psychologist. A psychologist can refer a patient to me since I can prescribe drugs to them, as well as being qualified to diagnose a psychosis. </p>\n\n<p>I’ve seen my fair share of awful stuff. I’ve had a few patients that have tried to harm themselves in my office. I’ve had patients call my home number, frantic and telling me about their bad day. I don’t judge them, they’re unwell. I just talk to them for a short while and then inform them that I am not in the office, adding that I have a child that I have to get to bed so I have pencilled them in for a session over my lunch the next day. They tend to take some comfort in that and up to now they’ve all shown up, very grateful.</p>\n\n<p>They’re all people, even when they don’t seem it. What I mean by this is I have had countless patients with multiple personality disorder and similar disorders. Some can change so dramatically that their bodies and faces physically change, depending on who I’m talking to at that moment. That has its moments where you have a slight sense of fear for your safety. But I trust them, as they trust me. </p>\n\n<p>Like I said, I have seen my fair share of really bad things. But never in my 6 years of practising psychiatry have I ever witnessed anything like this. </p>\n\n<p>I’d been seeing the same patient for around a year, let’s call him James. James had a severe case of paranoid schizophrenia, so he would hallucinate often, and he was a patient afraid of his illness. He had an appointment with me every day of the week, and I’ve made agreements with his family that somebody spends every weekend with him as I was out of the office and if he has any serious problems, to take him to the hospital for evaluation there. </p>\n\n<p>James is one of the patients I’ve had calling my home number. I just needed to reassure him that I was going to see him the next day and he would thank me and hang up. </p>\n\n<p>James had called me one week, explaining that he could feel hands all over his skin. He had called several times with the same type of problem, but the only difference was that it was hands. The day after the call he came to his appointment and had a bruise on his arm in the shape of a hand. I suspected he had grabbed his arm with all his strength and not remembered he’d done it himself. He denied this and insisted “they did it”. The next day he had another one, and the next day another and so on. The angles were as if he did it himself, and after asking the medical team to take a look, they also put it down to James’ own hands, as even the size matched. </p>\n\n<p>James never missed a session… until January 12th. He just didn’t show up. I began to worry and decided to call his home number, only to be greeted with screams on the other end of the line. I slammed the phone down and paced around my office. Including my lunch break and James&#39; missed session, I had an hour and 45 minutes, so I felt obliged to go over to his apartment and check on him.</p>\n\n<p>When I arrived, I could hear the same screams as I did when I called. I knocked loud and the screams stopped. I knocked again and called James’ name, informing him that it was me and I was just checking up to see he was alright. I heard nothing in response, so I knocked again. </p>\n\n<p>I was met with a loud “go away!” It was James’ voice</p>\n\n<p>“James?” I called “is everything OK?” </p>\n\n<p>“I’m fine! I’m not feeling well. Please leave.” He didn’t sound as he usually did, but I respected his request and left. </p>\n\n<p>I was sat in my car outside his apartment block and I was about to leave, however I felt as though something was wrong and I got back out of my car and headed back up to his apartment. I knocked again and all I could hear was the ear-piercing screams I heard twice before. I could not leave without physically seeing James was alright, because from what I could hear, something was very wrong. I knocked once more and still nobody answered, so I tried the door handle and found the door to be unlocked. As I walked into the apartment there was an empty hallway with a door directly facing me. I slowly opened the door and I have never seen anything so horrifying in my entire existence. </p>\n\n<p>James was on his knees with his back to me, ripping out his hair. I said his name and slowly walked towards him before he threw out his arms. “STOP!” he screamed</p>\n\n<p>“J-James? What…”</p>\n\n<p>James stopped me mid-sentence “Doctor Hill, please. They’re here. G-go a…a…” he let out a bloodcurdling scream and his back seemed to snap right in the middle and he was bent all the way back, looking right at me. Only, his eyes were black, and his mouth was so wide it looked as if his jaw had completely dislocated. He was shaking and letting out a low-pitched scream that was definitely not his voice. </p>\n\n<p>I started backing away towards the door when multiple loud, cracking sounds accompanied James getting up to his feet. At what felt like lightning speed, James’ face was inches away from mine and he laughed loudly in my face. I fell to the floor and pushed myself against the wall. His eyes seemed to become ‘normal’ again and he looked at me in horror. He struggled to step back away from me and let out a loud ‘no’ before putting his hands up to his face and digging his fingers into his eye sockets. He gritted his teeth and screamed through them while blood seeped from the sockets, before he rips out both of his eyes and drops to his knees, falling forward onto his face. </p>\n\n<p>It took me around 5 minutes to calm myself down enough to call for help. I had to stay in the apartment with James’ body until help arrived and I was taken with the police to give a statement, not that I could get much out through crying and reliving it. </p>\n\n<p>I haven’t been back to work since, I’ve been diagnosed with Post Traumatic Stress Disorder and I’m currently on my 6th week with a psychiatrist. They say that James only committed suicide, that he had &#39;a sickness&#39; and now I do too. They say the demonic state he was in never happened and I made it up as a coping mechanism for &#39;feeling like I failed James as a psychiatrist&#39;.</p>\n\n<p>They&#39;re wrong.</p>\n\n<p>This morning I woke up with a hand print on my arm. </p>\n</div>\n","author":"stonecold-btch"}