{"rank":"8","title":"Henry","id":"8lbdyz","url":"/r/nosleep/comments/8lbdyz/henry/","time":"1527007058000","body":"<div class=\"md\"><p>The rain beat a steady rhythm on the asphalt. In the dark sky above, the rumble of distant thunder rolled slowly toward us.</p>\n\n<p>“Daniel.” The sound of my name pulled me from my reverie. I turned my head away from the drenched playground and toward Miss Wasson. “Are you with us?” she asked, resting a hand on the edge of my desk. I looked to the watch on her left wrist. It was a beautiful timepiece; a circular face surrounded by a gold bezel, with a wide two-tone bracelet. Fine golden hands pointed to the time; just a little before four pm. It would be another half hour before I would be able to escape. &quot;Daniel,&quot; she chided again.</p>\n\n<p>“Yes,” I answered quickly, looking up at her. &quot;Yes,&quot; I repeated, somewhat sheepishly. The corner of Miss Wasson’s mouth turned upward in a slight smile as she moved back toward her desk. My sole companion sitting at the desk next to mine waved a finger, mimicking a scolding. I ignored her as my eyes drifted back outside.</p>\n\n<p>Dark, dreary and wet. It was the perfect metaphor for Friday afternoon detention. I tried to force my attention back toward my math textbook but I found myself unable to concentrate.</p>\n\n<p>“Miss Wasson,” Emma, my sole detention buddy wheedled. “Can I go yet?”</p>\n\n<p>Unwilling to try and force myself through my next math problem, I focused on Miss Wasson instead. I had assumed she was somewhere over forty judging by the laughter lines tugging at the corner of her eyes and the faint wrinkles on her brow. She was still a handsome woman; tall, with her dark brown hair cut short. Her jaw was pronounced, giving her the look of a fighter. While she had always been kind and patient with me, she could be fearful when angry.</p>\n\n<p>She tapped the face of her watch in response to Emma’s question. “Mr Dawes made it clear to me you were to remain in detention until four.”</p>\n\n<p>“It’s nearly four now.”</p>\n\n<p>“And when it’s exactly four, you may go.” Miss Wasson looked to me and I flushed as my gaze lingered too long on her. I looked down at my textbook as she approached. “How are you finding these?” she asked quietly.</p>\n\n<p>“Fine,” I lied. I was a smart kid but always struggled with numbers. I had flunked the previous night&#39;s homework so badly, Miss Wasson had placed me in detention so I could catch up.</p>\n\n<p>I watched as she traced a finger down my work so far. “Good,” she said, “But slow. I’m expecting you to have this complete before-”</p>\n\n<p>Emma’s scream pierced the classroom.</p>\n\n<p>Both Miss Wasson and I jumped as one. “Emma Delaney!” Miss Wasson shouted, quickly regaining her composure. “What do you think you’re doing?” Emma raised a shaky hand but said nothing. I watched as the teacher’s expression softened. “Emma, what is it?”</p>\n\n<p>I looked out to the darkening playground, expecting to see someone staring through the window but there was no one there. “Emma?” Miss Wasson placed a hand on her pupil’s shoulder.</p>\n\n<p>“I saw Henry,” Emma squeaked.</p>\n\n<p>I felt myself swallow hard.</p>\n\n<p>“Oh for the love of…” Some of Miss Wasson’s fire returned. “Emma, I will not have you disrupt Daniel with some childish story.”</p>\n\n<p>“I saw him,” Emma repeated. Wet eyes looked up at Miss Wasson. “It crawled under the cabinet.”</p>\n\n<p>Doubt flashed across Miss Wasson’s features for a brief second. She looked at her watch with a heavy sigh. “You may go.” Emma didn’t need a second invitation. She didn’t bother packing her bag, she simply grabbed it, her books and bolted for the door.</p>\n\n<p>I listened to the fading footsteps faded as Emma raced down the tiled corridor. “Henry.” Miss Wasson laughed softly as she sat herself on Emma’s now empty desk. “Not a bad way to buy yourself a couple of minutes out of detention, I suppose.”</p>\n\n<p>“I’ve heard other people say they’ve seen him too,” I offered. Everyone had heard the stories.</p>\n\n<p>Miss Wasson’s smile was kind. “I’ve been teaching here for close to twenty years now, Daniel. The Henry story has been going well before I started. Don’t let Emma’s acting spook you.”</p>\n\n<p>I never would have thought Emma to be clever enough to think of pulling such a stunt. Or talented enough to be so convincing. &quot;She seemed pretty convincing,&quot; I offered shakily, trying to ignore the small flash of shame. At fifteen I was too old to get spooked by ghost stories.</p>\n\n<p>“You don&#39;t believe her, did you?” Miss Wasson’s tone suggested the sort of patience reserved for when is talking to a particularly simple child. Before I could deny that I did, Miss Wasson had stood up and moved back toward the front of the class. I watched as she fetched a long ruler from the holder beside the whiteboard. “Cabinet, was it?” I nodded weakly. “Ok. I’ll chase our friend Henry and then you get back to your work,” she said, pointing with the ruler.</p>\n\n<p>I nodded again as she knelt by the cabinet. “Henry?” Miss Wasson poked hard with the ruler. “Henry?”</p>\n\n<p>I felt myself grow uneasy. I wanted to say that she had proven her point, that I was being silly and I should get back to work. &quot;Miss Wasson,&quot; I said meekly. She turned to look at me. &quot;Miss Wasson, I.....&quot;</p>\n\n<p>The words died in my mouth with a whimper. </p>\n\n<p>A hand crept out from underneath the cabinet. A pale white hand and nothing more. I was frozen in place as it scuttled forward toward Miss Wasson. Distracted by me, she did not see it as it crept toward her. The hand brushed her own. I could see the surprise register on her face before she looked slowly down.</p>\n\n<p>There was no screaming. Miss Wassson simply gasped as as the ruler dropped from her hand. She followed it down, slumping to the ground at the foot of the cabinet.</p>\n\n<p>“Miss Wasson?” She didn’t move, her eyes were closed tight. Slowly, I raised myself from my seat, trying to ignore the bile that began to rise in my throat. “Miss Wasson?” I tried again, more feebly than before.</p>\n\n<p>Slowly, Henry crawled up Miss Wasson’s left arm and onto her back. His pale form stood out starkly against the dark grey of her sweater. I watched as he started moving toward her neck. Some unknown instinct kicked at me then, an inexplicable belief told me he meant my teacher harm. I was too afraid to move toward them. My mind screamed that I should but my legs would not respond.</p>\n\n<p>Instead, I lifted and heaved my textbook toward them. It sailed embarrassingly wide, landing with a heavy thud on the wall behind where Miss Wasson lay.</p>\n\n<p>Henry turned at the sound and scuttled back toward the cover of the cabinet. I ran to Miss Wasson. She didn’t respond as I lifted her under the arms and dragged her into the corridor.</p>\n\n<p>I didn’t stop until we were both outside.</p>\n</div>\n","author":"DolorousSpud"}