{"rank":"314","title":"My boyfriend didn't drown","id":"8lbj52","url":"/r/nosleep/comments/8lbj52/my_boyfriend_didnt_drown/","time":"1527008143000","body":"<div class=\"md\"><p>“The water’s freezing,” Brandon said.</p>\n\n<p>“That’s half the fun.”</p>\n\n<p>After much persuasion, he gave in. The cold shocked both of us down to our bones, but there was something romantic about it, too, just the two of us shivering in the dark waters with the night sky overhead like velvet. The only sound was our laughter, interspersed by the chattering of Brandon’s teeth.</p>\n\n<p>We’d swum about a quarter mile out when he suggested we head back. He wasn’t much of a swimmer, and he was getting tired. I flipped onto my back and started for the shore. </p>\n\n<p>When you’re gazing up at the stars with your head half-submerged, you kind of lose yourself. Maybe that&#39;s why I didn’t notice Brandon was gone until it was too late. I’d stopped to tread water for a moment and catch my breath, and suddenly he just… wasn’t there. The unbroken surface of the Puget Sound stretched out before me, black except where it shimmered with the reflection of the pale moon.</p>\n\n<p>“Brandon?” I waited to see a head of dark hair emerge. Waited for a “gotcha” that never came. The silence would’ve swallowed me whole if it wasn’t for the sound of my own panicked breathing.</p>\n\n<p>Waiting was all I could do for the remainder of the night. I waited for the Coast Guard to arrive. I waited from the deck of the rescue boat as they searched for a mile in every direction. My lungs ceased to function, and they only began working three hours later when they shone a flashlight onto the white body bobbing gently in the waves, all the breath flooding out of me in a stuttering gasp.</p>\n\n<p>I watched in mute horror as they pulled Brandon out of the water and pumped his chest up and down, up and down. Brackish water bubbled from his mouth and spilled down his chin.</p>\n\n<p>“He’s not dead,” I said. “He’s okay.” I could feel the sympathetic gazes of the crew on the back of my neck. </p>\n\n<p>An hour later, we were at the hospital. Against all odds, my boyfriend was alive. Pale and truly awful-looking, but alive. They’d restarted his heart and strapped him up to the ECMO, a machine that drained and reoxygenated his blood, then pumped it back into his listless body.</p>\n\n<p>The doctor presiding over him made it a point to let me know it was a miracle. Three hours underwater without the aid of his heart and lungs, and it looked like there was no neurological damage. “It’s amazing, really. He must have dropped into an incredibly low metabolic rate to survive,” he told me. I was so relieved I practically floated my way through the rest of our conversation: No, I didn’t see any wildlife in the area. </p>\n\n<p>No, I didn’t see him go under. </p>\n\n<p>No, I didn&#39;t see when he came back up.</p>\n\n<hr/>\n\n<p>Four days later, Brandon was off the ECMO and out of the hospital. I drove him back to our apartment.</p>\n\n<p>“You really don’t remember any of it?” I asked.</p>\n\n<p>He sighed. “Not a thing.”</p>\n\n<p>“I’m sure it’s fine,” I said. The doctor had told me amnesia was common, expected even, after traumatic events. I decided to drop the subject there and then—there was no reason to dredge up a bad memory, even if the events of that night were still a mystery to me.</p>\n\n<p>Count your blessings, they say. I wasn&#39;t prepared to question mine.</p>\n\n<hr/>\n\n<p>Brandon and I, we&#39;ve been a couple for five years and lived together for three of those. We&#39;re getting to the point where we know each other almost better than we know ourselves. I like to think that I&#39;m finely attuned to changes in his mood, that I can pick up on his sadness or frustration when others can&#39;t.</p>\n\n<p>But when he started behaving differently, I wish I hadn&#39;t been the first to notice.</p>\n\n<p>There was no earth-shattering shift in his personality, no single incident that started it all. Instead, it was the little things, and I could <em>almost</em> ignore them if I didn&#39;t think too hard.</p>\n\n<p>For one, Brandon&#39;s stopped snoring. Never before did I think that I&#39;d miss that snoring of his. At night, I watch the rise and fall of chest as he lies asleep, and the absence of sound feels wrong, empty somehow.</p>\n\n<p>He doesn&#39;t blink as much anymore. I know, that&#39;s the strangest thing for someone to notice, but once I did, I couldn&#39;t stop. The realization came when we were in the middle of watching a horror movie—well, <em>he</em> was. I’d gotten a little squeamish during the gory parts, so I’d started watching him instead, cataloguing his reactions.</p>\n\n<p>At first I almost giggled at how attentive he was, his eyes glued to the screen as he brought handfuls of popcorn to his mouth. As the seconds went on, it started to be more odd than funny. He wasn’t blinking. I mean, three minutes went on and I didn’t see his eyes close for even a moment. Feeling uncomfortable, I brought my attention back to the screen, but I couldn’t focus on the movie anymore. </p>\n\n<p>I’m not sure if that was when it started. I don&#39;t mean to say he’s ceased blinking entirely—when we&#39;re talking, I can&#39;t help myself from focusing on his eyes, and he does blink. Slowly, and in a way that almost seems he&#39;s doing it <em>consciously</em>, but he blinks nonetheless. I don&#39;t know. Maybe it&#39;s a drawn-out joke, and I&#39;d be losing the game if I confront him about it.</p>\n\n<p>I&#39;d be lying if it said none of this was affecting me. I&#39;ve been having these dreams every couple of nights. At first, I think that I&#39;m falling into a black void, but then I&#39;ll look up, and I realize I&#39;m sinking into dark water, the surface a hundred meters above and shrinking away fast. There’s never anything I can do to stop it. I always wake up before I reach the bottom, if there is even a bottom. </p>\n\n<p>For the first new nights, I woke up terrified, clutching at Brandon&#39;s arms as he asked me what was wrong, but over time, they stopped filling me with dread. They&#39;ve become calming, even. Something predictable to expect when I turn the lights off at the end of the day.</p>\n\n<p>I stopped bringing it up to Brandon, though. It&#39;s such a tiny thing, keeping this dream from him, and it&#39;s hard to explain why I even feel the need to. There have been these moments in conversation where I&#39;ll bring something up, a silly inside joke or a memory from a couple years ago, and for a split second—so brief I think I&#39;m imagining it—my boyfriend&#39;s face goes blank. Then he smiles and nods, and I find that I&#39;m beating myself up for having that flicker of doubt. </p>\n\n<p>I tell myself it&#39;s natural to forget things, anyway, and well, maybe his memory isn&#39;t what it used to be.</p>\n\n<p>Maybe neither of us are what we used to be.</p>\n\n<hr/>\n\n<p>It was three in the morning when I woke up to use the bathroom. I yawned and slid out of bed, rubbing the sleep out of my eyes on my way to the toilet. I froze as I slid back into bed. Brandon was missing from my side. I tensed for a minute, the worst possibilities running wild through my mind before I heard this soft, wet sound coming from somewhere in the apartment. Stopping in my tracks, I listened as closely as I could. I couldn&#39;t tell what the sound was, but I could follow it.</p>\n\n<p>I padded my way down to the kitchen. The lights were all off, and I had to take small, delicate steps, being careful not to make too much noise as if I was approaching a skittish animal.</p>\n\n<p>The sound grew louder. Was that chewing I heard? </p>\n\n<p>I stopped at the door frame and peered inside.</p>\n\n<p>My nose adjusted before my eyes did, and I almost gagged on the smell. God, the smell. I could taste it on my tongue. It was foul, with a coppery undercurrent, like dead fish.</p>\n\n<p>There was the silhouette of Brandon&#39;s body, painfully familiar even though his back was turned to me and he was stooped over the sink. He was grabbing something out of the basin, but I couldn&#39;t see what; from my vantage point, it looked like a dark, gelatinous mass. My eyes nearly popped out of their sockets as he brought a fistful of the stuff to his mouth. </p>\n\n<p>I heard a sharp <em>crunch</em>, a muffled chewing, and the wet slide all the way down his throat.</p>\n\n<p>A tiny whimper escaped my lips, and instantly Brandon stiffened, his spine going plank-straight. He didn&#39;t turn around. When he spoke, his voice was calm and still as a lake.</p>\n\n<p>&quot;Go back to bed.&quot;</p>\n\n<p>I listened.</p>\n\n<p>That night, I dreamt of dark waters.</p>\n</div>\n","author":"crystakat"}