{"rank":"46","title":"Sometimes it's Better not to Wear a Seat Belt","id":"8lbrnc","url":"/r/nosleep/comments/8lbrnc/sometimes_its_better_not_to_wear_a_seat_belt/","time":"1527009760000","body":"<div class=\"md\"><p>A steady rain was dumping on me from the heavens as I walked home from work - I’m a 23 year old female grocery store clerk and don’t drive, since I never had the motivation to get my license (I was into some pretty shady stuff a while back, but that’s not the point of the story). The air was hot and thick with humidity, and I was stuck walking in a good old Mississippi rainstorm. There were severe thunderstorm warnings as I was leaving, so I was hauling ass trying to get home hoping not to get struck by lightning, sucked up into a tornado, or the like. Sometimes someone I know will drive by me and give me a ride home - I’ve made friends with some of the regulars at my store. </p>\n\n<p>This evening in particular, I saw headlights coming up behind me, casting a long shadow of my silhouette in front of me. I turned around, despite not being able to see the car behind the lights. I slowed down and moved over to the edge of the road, stepping in the mud to avoid being hit. The car slowed down next to me, and I saw the familiar body of the Jeep Liberty my neighbor and customer Marty stopping to offer me a ride. I’ve taken him up on his offer before, he is a completely harmless father of 2 young girls, and I know something inside of him pities me. This night, I of course took him up on the offer to bring me home, although I warned him that I was absolutely drenched and would get water all over his car. </p>\n\n<p>“Nonsense” he said “I would feel terribly if I let you catch a cold walking home because I didn’t want a little water in my car”</p>\n\n<p>With that, I climbed in and pulled the passenger seat belt over my shoulder and clicked it into place. Marty never wore a seat belt - some “back in my day” nonsense that I tried to convince him otherwise about. It had become a banter between the two of us every time I got into his car.</p>\n\n<p>“Come on, seat belts save lives” I would say, and did this night</p>\n\n<p>“No thanks m’lady, I don’t want to get trapped in this hunk of metal should we turn over” he replied “Besides, back in my day I never wore one and I’m still here today.</p>\n\n<p>We continued down the road, him asking me about my day and me continuing the conversation. The ride in total would be about 5-10 minutes, but was taking longer because Marty was taking it slower due to the conditions outside. Stubborn as he is when it comes to seat belts, he was always aware of the weather and adjusted his driving accordingly - some safety points are owed to him there. </p>\n\n<p>All of a sudden, I saw headlights coming towards us around a bend at an alarming rate. They shone so bright that the other car’s high beams must have been on. Marty yelled some profanities and declared that he couldn’t see, and began flashing his lights at the other car to get them to shut their own brights off. Rather than turn them off, the other car swerved into our lane, and began weaving around the road. This all took place in a matter of seconds, but I remember it so vividly and it felt like the air moved so slowly around us. </p>\n\n<p>Marty did what he could to swerve around the oncoming car, but its path was too unpredictable and we ended up colliding with it head on. The rest I don’t remember but it has been filled in for me by family and forensic analysts. </p>\n\n<p>I guess Marty had flown through the windshield of his car upon impact - making me all the more upset about the seat belt thing. I was held in the car, but sustained severe leg and back injuries that left me paralyzed from the waist down. I had been in and out of consciousness for a long time, but that&#39;s what I knew from the start. Once I had come back into myself enough, my family sat me down to tell me that Marty had been in a coma the entire time, and was essentially brain dead. I could not even believe this, and immediately jumped to the conclusion that this was all my fault. If I hadn’t accepted the ride from him, he would have been further down the road and maybe not have hit the other car. </p>\n\n<p>I guess the other guy was drunk and died on impact. I didn’t care too much what happened to him - I was pissed that he could be so careless, but again that’s not the point of the story. I continued for weeks in the hospital and eventually in rehab, working on my wheelchair skills and such, hoping to someday walk again (wishful thinking, I know). All the while, I couldn’t stop thinking about Marty - I felt as though I had taken a father from his two young daughters, and a husband from his wife. I can only imagine the grief they felt. </p>\n\n<p>About 3 months after the accident, I had been brought home. I had gained some independence with the wheelchair, and during the time I was in the hospital my parents had built a bedroom for me downstairs and created a whole accessible bathroom for me - I am incredibly lucky to have them. However, when I got home, things started getting really strange and really freaky. </p>\n\n<p>I would wake up at night hearing someone calling my name, and Marty screaming about how he couldn’t see. I would be sweating and screaming, calling for my mom to come help me. This happened almost every night, and my doctor told me it was common - a form of PTSD. </p>\n\n<p>I knew this wasn’t just PTSD though when I started seeing Marty a few weeks later. I would be in my kitchen getting food, in my room trying to fold laundry, getting out of the shower, etc when I would see his bloody face, severely mangled from the accident. He would look at me and offer me a ride, saying his car was right outside. I would look and SEE THE CAR sitting in my driveway, plain as day with no evidence of the accident whatsoever. </p>\n\n<p>I would turn back around and Marty would still be there, grinning at me and saying “I promise I’ll wear my seatbelt this time” and then walk out to the car, opening the door and shutting it behind him. These visions were so vivid that I tried to not think about them - they were far from dreams, and felt just so real. I could smell the blood on his face and hear his footsteps on the way out. </p>\n\n<p>I told my mom and she said that they were still part of PTSD, and brushed it off. Marty was still in a coma in the hospital, and there was no way he could be coming to my house. His car had been completely destroyed, and his family actually donated it to one of those drunk driving awareness groups that shows kids what can happen to you and others when you get behind the wheel when drunk - meaning it was not being repaired and would not have even been in the area. </p>\n\n<p>While I tried to brush them off, there was something different between these visits and the visions I had in my dreams of the accident. It felt so real, so otherworldly, and I couldn’t just ignore them. So today, I decided to set a trap of sorts. </p>\n\n<p>Typically, we leave the doors unlocked - I’m never home alone anymore in case I fall or something (my mom’s job was nice enough to let her work from home for an undefined amount of time). Our neighborhood is quiet, and I never really felt unsafe with the doors unlocked in the middle of the day - and that’s when these events were happening. So, this time I decided to lock the doors. Not only did I do the handle and deadbolt, but we have a chain lock we never use and I made a point to lock that and tell my mom I was (my excuse being that I was going to take a nap and she was in the office on the other side of the house so I wanted to be extra safe). After locking all the doors, I shut my door and sat in my bed not sleeping, but just waiting.</p>\n\n<p>Sure enough, after about 45 minutes of watching, I heard the deadbolt unlock. I called out to my mom, asking if it was her, but got no response. I then heard the door open, but stop short at the chain. Now, a chain lock is designed to be nearly impossible to open from the outside, and can only be undone by people in the room. But, all of a sudden, I heard the chain clatter to the floor and the sound of heavy footsteps began approaching my room.</p>\n\n<p>Marty’s face appeared again, covered in blood and grinning, asking me if I needed a ride. My jaw hit the floor, as he should not have been able to get in if he were some kind of human. Knowing though that this was probably a hallucination, I continued with our usual routine, looking out my window to see his Jeep in the driveway.</p>\n\n<p>Marty said his seat belt line, then proceeded to walk out the door. I sat in bed, unable to move. This time, something different happened though. He started glowing with a whiteish light, and began to beg me to come with him.</p>\n\n<p>“It’s so lonely here, no one can see me but you. We went through something traumatic together, and I need someone to come with me who knows me. I can’t face this alone Addison” </p>\n\n<p>Calmly, I said “Marty, I’m sorry. I can’t go with you. Who will tell your kids the story of how kind you were to me? I promise you I can look out for them. But please, stop visiting me”</p>\n\n<p>“I’m sorry. I just feel so alone. I hope you know I didn’t do this to you on purpose”</p>\n\n<p>“Of course Marty, please do not worry”</p>\n\n<p>With that he left, and I heard the door shut behind him and the locks click. I figured this was my imagination’s way of ending this hallucination. However, when I got out of my bed to check it out, while I did find the deadbolt done and the handle locked, the chain lock was hanging, and not in the slot.</p>\n\n<p>My stomach sank seeing this; whatever this was, it was Marty. Dead, alive, or in limbo, he was coming to see me. And since then, he has kept coming back each day around the same time. Each time, he is begging me to come with him. And each day, I feel more and more compelled to join him. As much as I don’t blame him, I hate my life now. I lost all independence, can’t work, can’t leave my house and I too feel alone in this place. </p>\n\n<p>It’s easy to tell nightmares from reality when you wake up at 3AM. You can calm yourself down, tell yourself it was just a dream and go back to sleep. But it’s worse when you are fully awake and aware of your surroundings. You can feel that something is not quite right, and please trust your gut. I know what I’m seeing is not PTSD, but rather Marty begging for help and I don’t know how to help him. I don’t know how much longer I can keep up my willpower to not join him, as each time he comes his injuries are less severe and he seems more and more human. I can’t tell what’s happening.</p>\n\n<p>Maybe this is what dying is like for people in comas. Maybe being brain dead lets your soul run loose. I really don’t know too much about this but what I do know is that what I’ve seen is real, as real as what we went through on that fateful night. Sometimes, I think I would have been better off if I hadn’t worn my seatbelt. Sure I might have died, but living like this is a fate far worse.</p>\n</div>\n","author":"insomnia_storyteller"}