{"rank":"22","title":"Tight Spaces","id":"8lbwj3","url":"/r/nosleep/comments/8lbwj3/tight_spaces/","time":"1527010711000","body":"<div class=\"md\"><p>There’s an abandoned building just on the outskirts of my crumbling, disgusting hometown. It was the original elementary school before they moved everyone to a new building after a mold problem started showing up in the entryway a couple decades ago or something. I’ll be honest, I don’t know the full background of the place. It doesn’t even matter much. What’s most important is that it’s old, it’s abandoned, and it’s a popular spot for drug addicts and stupid teenagers alike.</p>\n\n<p>I was one of those stupid teenagers. You see, the place was supposedly haunted, which was total bullshit, but the lack of cell service and leaky pipes egged the urban legend on. It became a popular spot for hazing, and groups of kids came in droves to dare each other to stay a few hours in the musty halls. My idiot friends decided to join in on the fun one special October night and I was the even bigger imbecile who went along with them. I was desperate for peer approval and figured this would be a great way to prove myself to the others.</p>\n\n<p>There were four of us in total: Ryan, Valerie, Ben, and myself. I was a pretty lonely kid who spent most of her time playing video games and avoiding her parents, and I thought the other three were just so cool compared to myself. We rode in Ryan’s truck with Valerie sitting shotgun and me and Ben sitting in the back. The two in the front were already all over each other, freely groping and kissing despite our lives being at stake, and while I was pretty grossed out I pretended not to care. I was just thankful that Ben wasn’t trying to feel me up or lick my neck or anything weird like that.</p>\n\n<p>It was just after 10 PM when we parked in the school’s empty rundown lot. The building was completely dark and, admittedly, looked kind of damn creepy in the nighttime. I was never someone who believed in the supernatural, but as I sat in the back of that truck, looking out at the decaying building while Ryan and Valerie sucked face in the front, I could feel my heart picking up the pace as nervousness crept into my veins. It was totally dumb of me and I knew it, but the idea of spending the whole night in that place brought a feeling of pure dread over my body. I didn’t want to get out of that vehicle. I didn’t want to go into that school. Anxiety was washing over me out of nowhere, but I snapped back into reality when I felt someone’s hand clasp over my own. I looked at Ben and saw him smile gently at me in the dark.</p>\n\n<p>The four of us climbed out of the truck. Ryan extracted some supplies from the back for us that he’d brought along and handed them out. Our very own survival kits, he joked. In total he’d brought two flashlights, eight beef jerky packets, two boxes of sea salt, and two bottles of water.</p>\n\n<p>“What’s this, a cooking class?” I asked him, gesturing to the salt. I was being a smartass, of course. I knew what they were for.</p>\n\n<p>“Ghosts don’t like salt,” he told me anyway as he handed Ben a small backpack. Inside was half of the supplies.</p>\n\n<p>We decided to split up into two groups. Ryan and Valerie were one, Ben and I were the other. I had to stop myself from rolling my eyes into the back of my skull when Valerie suggested the idea, under the guise of “covering more ground.” Of course they’d want to split up. The whole idea was so those two could fuck in a haunted school, not explore more. I wasn’t completely stupid.</p>\n\n<p>“Hey Stel, be nice to Benny, alright?” Ryan snorted as he wrapped an arm around his girlfriend. She giggled and nuzzled into him, and I tried not to retch at the sight. “He’s kind of a coward, yknow? Go easy on him.”</p>\n\n<p>Ben scowled beside me as he took my hand and began leading me to the entryway. He was telling the other boy to fuck off or something, but I wasn’t paying attention anymore. As my feet carried me to the building, that sense of fear returned to my gut. I wanted to turn back and go home, I wanted to pull out of his grasp and run far the fuck away from that place. It was ridiculous. I was just being paranoid, I told myself. There were no child ghosts lying in wait in that school. Everything would be fine.</p>\n\n<p>I focused on Ben’s touch. It was the first time I’d ever held hands with a boy that wasn’t my older brother when crossing the street. Even though the warmth of his hand brought butterflies too, they were much different than the other jitters I was feeling. Lighter, warmer. I tightened my grip on him and he did the same.</p>\n\n<p>The school smelled awful, kind of like the unfinished basement of my house. It was dusty and dirty and I’m sure the mold had only multiplied since it had been abandoned. The hairs on the back of my neck stood on end as we stepped inside. Uneasiness trickled through my blood, and I felt like we were being watched.</p>\n\n<p>“D’you think there’s any homeless dudes living in here?” I asked Ben, and he laughed before shrugging his shoulders. I don’t think he understood that I wasn’t joking that time.</p>\n\n<p>“I dunno,” he responded, “But if there are, I promise I’ll protect you.”</p>\n\n<p>We walked for a little while. I carried the flashlight, he carried the backpack. There wasn’t much to see aside from disgusting classrooms filled with dirt and grime and the occasional rat. We didn’t see any homeless people, thankfully, but my uneasy feeling never let up. If anything, it only got worse as we explored.</p>\n\n<p>After a while we found the kitchen, which seemed to delight Ben. There wasn’t much to look at, but he thought it was cool that it was still pretty much intact aside from the dust. I wondered out loud if there was any school food left over in the freezer and he laughed.</p>\n\n<p>It didn’t take him long to find the metal cabinet. I don’t know what it actually was, but it looked to be some sort of oven or fridge or whatever. It was completely metal, though, and the doors seemed to seal when they were shut so they gave a little pop when you opened them. The space inside was big enough to fit maybe three people in if they squeezed up together, which brought along Ben’s wonderful idea.</p>\n\n<p>“Let’s get in,” he said, smiling at me in the light of the flashlight. He looked excited to try it out, but my feeling of dread multiplied at his words. Claustrophobia has always been one of my top phobias. I had a walk-in closet back then, but I couldn’t stand being inside with the door closed because I was always sure the walls were closing in on me. I hated tight spaces.</p>\n\n<p>But there was no way I was telling him that. The whole reason I came to that damn school was to look cool and collected in front of my friends. That image would be completely botched if I chickened out of climbing into a stupid little metal cabinet. So I agreed to do it. I figured it wouldn’t be that big of a deal. It would only be for a few seconds. Just a few seconds and then we would come out and we’d be done with it.</p>\n\n<p>I climbed in first. He was right behind me, crawling into the small space before carefully shutting the doors behind them. Just like that, we were sealed into the tight space. I felt sick and dizzy right off the bat, but I tried to push it out of my mind. I instead focused on something else to keep the panic at bay, choosing to listen in to Ben’s rhythmic breathing.</p>\n\n<p>“It’s like our own little hiding place,” he said with a chuckle. Gently, he took the flashlight from me and switched it off, bathing us in total darkness. I bit my lip as my anxiety plunged again, but I didn’t say a word of protest against it.</p>\n\n<p>I felt his hand touch my arm and then my hip, and I assumed he was searching for my hand again. However, when I went to give it to him, he disregarded it and instead let his palm fall to rest on my thigh. My breath hitched in my throat. I smacked him away, hoping he’d get the idea that I wasn’t interested in losing my virginity in a fucking abandoned elementary school.</p>\n\n<p>He didn’t. “Stella,” his breath was hot against my neck, and I leaned my head against the metal wall as I felt him grow closer. “Come on… I know you want this…”</p>\n\n<p>“No,” I whimpered. His hand was suddenly at my breast, squeezing, pain flooding through my chest. I felt disgusting. “Get off of me…!”</p>\n\n<p>I kicked at him, knocking his hand away long enough for me to lunge at the metal doors. They didn’t open. They didn’t even budge. I froze momentarily before panic began controlling my actions, and suddenly I was banging against the doors in an effort to get them to open. The walls were closing. I was suffocating.</p>\n\n<p>“Ben, stop!” I shouted as he touched me again, his hands reaching for mine and pressing them against the wall behind me. I kicked at him again, but he was straddling me now, and I felt completely powerless. “Stop! The doors won’t open! Ben, seriously!”</p>\n\n<p>He wasn’t listening. I pleaded with him as he kissed my neck and collarbone. I screamed and shouted as he forced my shirt up and over my face. The walls were closing, the walls were collapsing. My hands were free, and I managed to get a hold of his head. He was strong, but my adrenaline was stronger. I pushed him off of me, and a loud thud echoed through the cabinet as I felt the back of his head slam into the metal wall behind me.</p>\n\n<p>“Fuck…!” I heard him hiss, and then he was fighting against me with a new sense of rage. I panicked. I was panicking. The four metal walls were so tight around my throat. I dug my fingers into his hair, gagging as I felt the follicles beginning to rip under the urgency of my grip. I shoved his head back again, this time with more force, and a loud crunch sounded from his skull. I slammed his head a third time. I was panicking, I was terrified. You have to understand that. I didn’t want to hurt him.</p>\n\n<p>He fell limp after that, and I was left alone, panting and crying in the dark. I was sure he was dead, that I’d killed him. My body felt alien, disgusting. I vomited over myself. The smell was awful.</p>\n\n<p>I grabbed my phone from my back pocket, but of course my service was dead. I started kicking and screaming, hoping that the other two would hear my pleas and come rescue me, or at the very least that the doors would give way and open again. My voice had grown hoarse after a couple hours, though, and no one had come.</p>\n\n<p>I decided to check on Ben. He was slumped in the corner of the metal box, his eyes closed and a trickle of dried blood from his nose. I checked his neck for a pulse and was pleasantly surprised to find one. There was no doubt that he was injured, though, and I had no idea how to help him. I figured he would just have to wait until we were rescued.</p>\n\n<p>Time ticked by as I did my best to ignore my increasing claustrophobia. At some point I fell asleep, but I woke again around 5 AM. I was lightheaded and dizzy. Figuring I was dehydrated or hungry, I munched on a jerky stick and sipped some water, but the feeling didn’t go anywhere. The space around me felt tighter than ever, and I realized I was struggling to breathe. I realized that maybe I was running out of oxygen, that maybe that was why I was so lightheaded.</p>\n\n<p>Ben was still out cold. The four of us had planned to meet back up at the truck at 6 AM and, if we weren’t all there, the others would come looking for the missing persons. I had an hour left to go. Just an hour, and I would be rescued, I was sure of it. But my dizziness only added to my anxiety, and I could feel my breath beginning to quicken as panic settled in again. There wasn’t enough oxygen for the both of us to last an hour. There wasn’t enough. I knew this.</p>\n\n<p>I looked at Ben. Checked his pulse again. It was still there. He was still there. Breathing. Using up oxygen.</p>\n\n<p>I know I shouldn’t of done it. What I did was horrible. I am a monster, and I know it. There was just… Something so satisfying about how my hands wrapped around his throat. One of us had to live, I had decided. There was only enough air for one of us, I had decided. And I was so angry at him, too. So sick and disgusting for what he’d tried to do to me. He couldn’t fight back as I strangled him, and for some reason, that only made me feel better about doing it. Like he’d done this to some other girl before, taken advantage of her when she couldn’t fight back, and now I was the revenge he deserved.</p>\n\n<p>He stopped breathing. I felt my muscles relax as a flood of relief washed over me. There was enough air for me. The walls were closing in, but there was enough air. In the calm following Ben’s death, I fell asleep.</p>\n\n<p>I awoke to a scream. It was Valerie. Light had begun to pool in through the kitchen, and I blinked to see her and Ryan standing outside of the cabinet. Ryan was holding some metal kitchen utensil that I think was a ladle. I remember the handle being just the right size to fit in the metal cabinet’s door handles. They were both staring at Ben, and I think Valerie was gagging on the smell of vomit and death, but I didn’t care.</p>\n\n<p>I crawled out of the tight space.</p>\n</div>\n","author":"karrnelius"}