{"rank":"21","title":"Der Teufelsstein Part Two","id":"8lc01w","url":"/r/nosleep/comments/8lc01w/der_teufelsstein_part_two/","time":"1527011413000","body":"<div class=\"md\"><p><a href=\"https://www.reddit.com/r/nosleep/comments/8ky05c/der_teufelsstein_part_one/?utm_source=reddit-android\">https://www.reddit.com/r/nosleep/comments/8ky05c/der_teufelsstein_part_one/?utm_source=reddit-android</a> </p>\n\n<p>I&#39;m not sure if I did the link to part one correctly, so I apologize if I didn&#39;t. </p>\n\n<p>When I came to the sun was sinking behind the mountains. I sat up forgetting in that moment what had happened hours before. I looked around rubbing my eyes. Where was I? How did I get here? Wait a minute! I was in the forest and night was coming. Panic started to rise in my chest. That&#39;s when I saw him and remembered what had happened. I screamed at him, &quot;What do you want from me?&quot; He didn&#39;t answer, of course he wouldn&#39;t, he is a wolf. He just continued to stare at me. I got up and and shouted, &quot;I&#39;m getting the hell out of here before it gets dark wolf! If you want to eat me then do it already!&quot; As I turned to storm away my Oma&#39;s friend, Gertrude, who visited after her passing, was standing right in front of me. I screamed &quot;AHHH! Jesus, you scared me Frau Bauer! What are you doing out here?&quot; &quot;He called for me,&quot; she stated pointing to Woofy, &quot;He said it was time.&quot;</p>\n\n<p>Time? Time for what?! The anxiety in my chest became full on panic and my instinct was to run, but my brain also knew the wolf was faster and I&#39;d either fall and get hurt or I&#39;d get terribly lost. &quot;T-t-time?&quot;, I stammered out. &quot;There are some things that you need to know about Fräulein. Things I told you not to worry about. I was a fool. Ignorance alone cannot protect one from darkness,&quot; she answered. &quot;Tell me everything and start with the mutt,&quot; I demanded. Woofy let out a low growl. &quot;I will,&quot; she mused, &quot;when we are back in front of the fire with a cup of tea and some food. You must be starving. There are too many eyes and ears in this forest.&quot; </p>\n\n<p>We followed Woofy back to the edge of the woods. We went into the house and he sat at the door. She spoke to him (in a tone so low I couldn&#39;t eavesdrop) before coming in as I was lighting the fire and turning on the lamps. I put a kettle on for tea and Frau Bauer started making a tray of food crusty bread, cheese, fresh fruit and apple strudel. </p>\n\n<p>We settled in the sitting room and she started her story. &quot;Your Oma no doubt told you of the folklore of our people. Some of them as old as time herself. The wolf is a guardian, but not of people. Let him show you.&quot; She whistled and he came in. As he trotted from the door to the sitting room he turned into an old man. I gasped audibly, &quot;ein Werwolf? Woofy ist ein Werwolf?!&quot; A werewolf, I asked, Woofy is a werewolf? &quot;No he is a Aufhocker. Much worse, but true to our legends. He is the reason people learned to fear the wolf. Not those silly stories of werewolves. People who think they are wolves, ha,&quot; she laughed, &quot;Aufhocker will eat you up if you turn to darkness, he has a purpose.&quot; I looked over and he was a wolf again. Apparently this was his preferred form. </p>\n\n<p>She continued, &quot;I was not completely truthful, or rather I didn&#39;t tell you the whole story when you asked me before of the devil&#39;s stones. The truth is that the two stories connect. The small stones, the devil&#39;s stones, used to be a part of devil&#39;s rock (the land formation). It was said the devil himself had a seat here in Odenwald. A throne of sorts. Legends say a battle happened and the throne was broken and the stone pieces were spread throughout Germany&#39;s forests and placed in protection to prevent the devil from repairing the chair and taking up his throne once again. Oma was a protector.&quot; &quot;And you know this how?,&quot; I asked with a raised eyebrow and a tone of disbelief. </p>\n\n<p>&quot;Oma and I have been friends a long time, no? Our families are intertwined. For centuries we have been together. The Bauers, Guntherman&#39;s and Lehman&#39;s. You remember Oma&#39;s friend Beth Lehman? Her too. Witches they call us. Funny during the witch trials over 600 people were tried in Bamberg alone and most of them were innocent. Witches are not foolish enough to be flamboyant in public, usually. We are watchers of the forest, we keep the balance of power and protect the innocent when we can. That is why the forces entrusted the devil&#39;s stones to us. Your Oma&#39;s death shifted the balance without replacement. She should have prepared you! The old biddy!&quot; </p>\n\n<p>It wasn&#39;t that she didn&#39;t try, believe me. My Oma had some odd beliefs. I thought she was harmless, but out of her mind if she actually believed it. She had a fairy tree in the sitting room behind her chair with all sorts of bells and pretty ribbons hung from it, a crystal ball held by silver dragons talons, tarot cards wrapped in velvet and crystals and candles in every color. She always wore a necklace of a fairy carrying an amethyst, for protection from negativity she said. I never believed. I was Catholic like the rest of the family, but I also believed in science. Now, I had no choice but to believe. </p>\n\n<p>Crystal balls and tarot cards are often associated with black magic, but the purpose they serve is what makes them what they are. They are a tool and how you choose to use them is up to you, the user, the seer. </p>\n\n<p>Gertrude helped me set up a shrine type of circle for the box. It was to protect it from being heard, she told me, so its negative energy was trapped and absorbed by the wood and the crystals. I thought the whole situation was verrückt! Crazy, mad, demented, but better safe than sorry. </p>\n\n<p>Now, I feel for those of you reading I have to explain the Aufhocker, Woofy. Aufhocker&#39;s closest translation is shapeshifter. In German legends it doesn&#39;t have the ability to change into anything it pleases. Usually animals and on occasion humans. They are usually seen as dangerous and are said to rip out throats of victims who don&#39;t learn the lesson the Aufhocker is trying to teach. Woofy was sent to protect the stone from the after life, one of who knows how many, and Gertrude told me if I gave into the darkness he would literally eat me all up. </p>\n\n<p>I read the note Oma left me. She mentioned the oak used to make the box and that it had ties to the catholic church. I jumped on the internet and did a search. That&#39;s when things turned weirder, not that I thought that was possible. It was like somehow the back button kept getting pressed when I was reading, the screen flickered twice and finally I gave up for the night. A weird draft blew through the house and blew out the candles lit to protect the stone. I lit them again. At 10:13 PM the clocks all chimed. At 11:28 my teacup slid off the table tea splashed everywhere. Good thing for carpet otherwise the cup would have shattered. I retired at midnight. I slept in Oma&#39;s room again. I woke up at 1:17. A whooshing noise had done it. The doors on Oma&#39;s hutch were open and all the candles rolled out and clattered onto the floor. I went out into the sitting room. The fire and all the candles had blown out. I lit them all again and sat in a chair. I looked out  and saw Woofy sitting at the window. He howled. I stayed in the sitting room. I put a thick quilt on the sofa and grabbed Oma&#39;s down pillow. It was 2:30 before I slept again and I had nightmares. Oma appeared and told me, &quot;Destroy or protect. The choice is yours. It must be done. Not everything is as it appears.&quot; With that she turned into a crow and flew out the window. Visions of Woofy floated in my consciousness, then Gertrude and finally a cloaked man with a hidden face and a gnarled walking stick. </p>\n\n<p>Over the next couple days the little oddities increased. I was able to research the oak tree my Oma spoke of at work and locate the church in Fritzlar, a town 3 hours north. The original church had to be rebuilt, but it was the lore I was interested in not the building anyhow. I needed to find someone who would tell me what to do with this thing, this curse; because Gertrude knew it needed protection, but wasn&#39;t offering up a solution on how to silence it. Someone knew I had it and now I was in trouble. </p>\n\n<p>I went to Gertrude&#39;s home. Herr Bauer answered the door and said to come in. Gertrude sat in the kitchen at the table. She put tea on. I told her my plan to go to Fritzlar to look for information. I didn&#39;t go too far into details. I told her I was taking the box and the stone, a black tourmaline and a amethyst. Gertrude was concerned for my safety she said. Would the powers let me get there? As much power as the light has so does the darkness, she claimed. I&#39;ll be fine I told her, but in my mind I did want someone to know where I went just incase things turned sour. </p>\n\n<p>That night was the worst yet. The usual happened around 10 at night; cupboard doors would creak open and slam shut, the drafts, and the objects around the house being tipped over or pushed to the floor. A large rush of air blew through the house and carried a voice with it, barely audible. &quot;Lasse mich los,&quot; release me it said. The lights went out and came back on twice. By midnight the house was truly alive. I went to bed. I&#39;d read not to give more power or energy than you need to. The hutch doors blew open with a bang. All the candles flew out of the hutch and onto the floor. The tarot cards were pushed to the floor as well. I got out of bed and looked to the ceiling and prayed. The house was calm only for a moment. I wasn&#39;t the right kind of person to vanquish this type of power that much was obvious. I went back to the sitting room and found two tarot cards sitting on the coffee table; death and the devil. Normally these cards can indicate a number of things; the end of a situation (death) or turbulent times (the devil). I flung the cards across the room and spoke directly to whatever was listening, &quot;Light always outweighs dark. It has been written.&quot; Woofy was outside the window. His place was only to intervene if I gave in, not to protect me. </p>\n\n<p>The next day at work I was exhausted. I returned to a house turned upside down. It was time to end this. I wrapped the box the box in velvet and grabbed an empty box and I put the box and all the crystals in it. I grabbed clothes and all the cash I had on hand. I headed to the Bauer&#39;s. I was going to ask if I could spend the night before leaving. I needed the rest and their house would provide silence. I left the box and the crystals in the trunk. Gertrude asked where it was. She said not to be leaving them unattended. Hmm, she never said that before, but maybe she had a bad feeling too. I brought the box in and she lit candles. The Bauer&#39;s insisted I eat dinner with them before bed and Gertrude said she&#39;d leave me some sandwiches for the trip. I thanked them. </p>\n\n<p>Gertrude seemed rather nervous during dinner and I dont blame her. She invited the devil into her house. Woofy didn&#39;t come either and subconsciously we were both probably worried about that. Gertrude and I ended up chatting for awhile over pie and tea. She asked if I had looked at the stone since last night and I admitted I hadn&#39;t. I opened the box and found it glowing like lit coal under the velvet. It was awake. We both jumped back. &quot;You shouldn&#39;t take the risk driving with that thing Liebe,&quot; she implores. I tell her I will leave it if Woofy comes back. He&#39;s its true guardian anyhow. Gertrude has a way of calling him and I know it. </p>\n\n<p>Why the stone didn&#39;t cause unrest at her house was a mystery to me. The next morning Woofy was at the edge of the woods when I looked out the window. Fine, it was settled. I would leave the stone. He would make take over for now. </p>\n\n<p>In Frtizlar I gained knowledge of what to do, but I must tell you the story not the solution. </p>\n\n<p><strong>I am typing the conclusion as I type this. Hang in there! Thanks for reading</strong></p>\n</div>\n","author":"cchaffee123"}