{"rank":"151","title":"Nightshift At The Plant - Uncle Harry","id":"8lcb7f","url":"/r/nosleep/comments/8lcb7f/nightshift_at_the_plant_uncle_harry/","time":"1527013599000","body":"<div class=\"md\"><p><a href=\"https://old.reddit.com/r/nosleep/comments/8k041i/nightshift_at_the_plant_thats_not_a_pony/\">That&#39;s not a pony ...</a></p>\n\n<p><a href=\"https://old.reddit.com/r/nosleep/comments/8kf49e/nightshift_at_the_plant_the_unwelcomed_visitor/\">Unwelcomed Visitor</a></p>\n\n<p><a href=\"https://old.reddit.com/r/nosleep/comments/8kv0az/nightshift_at_the_plant_malachai/\">Malachai</a></p>\n\n<p>With the servitor showing up at the plant again to try to take Chloe and the fact that Micah’s great uncle wanted to user her as a sacrifice I gave Malachai the spare room to stay in until he took care of Harry Thomas Woods.</p>\n\n<p>I didn’t know how to feel about having a man I barely knew in my house, but the fear of losing Chloe outweighed my misgivings.</p>\n\n<p>Tuesday when I went in for my shift, Malachai rode with me.  If anyone asked about his presence, I could pass it off as having a stalker and his being an old friend of Michah’s who was back in town.  Or at least I hoped that I could.  Malachai looked like the sort of man you met in a back alley after dark.</p>\n\n<p>Chloe loved him though.  Her eyes would light up when she saw him, and her little pudgy hands would reach for him.</p>\n\n<p>I openly admit that the first time he laid her down on the counter to change her diaper, I had to repress myself from shooing him away so that I could do it.</p>\n\n<p>I also openly admit the annoyance at how good she was for him.  Chloe was a wiggle worm when it came to diaper changes, but not for Malachai apparently.</p>\n\n<p>“Selene, I need to ask you something a little personal,” he said, looking up from his laptop with that black brow furrowed.  “I’ll apologize for the asking, but it’s important.  Do you remember when she was conceived, and if you do, do you remember if anything was different that night?”</p>\n\n<p>My face flamed at his question, and I’m sure my indignation showed.</p>\n\n<p>“As I said, I’m sorry, but this is important,” he said again.</p>\n\n<p>I thought for a time, mentally doing the math from the day she was born and going back nine months from then.  “It would have been in September,” I murmured aloud, still thinking back to see if any particular night stood out to me.</p>\n\n<p>The memory flooded my mind at once, causing my breath to catch in my throat painfully.</p>\n\n<p><em>“Hey, baby, why don’t you and I go get a bath?” Micah asked, a roguish smile on his lips.  “I picked up some lotion I think you’re gonna like, and I’ve got a bottle of your favorite wine.”</em></p>\n\n<p>“September twenty-first,” I said, my eyes vacant as I recounted the details.  “I’d been working in the yard – he’d gone into town for something.  He suggested a bath – as hot and dirty as I was, I agreed.  He’d bought me new body lotion – it was in a dark-red glass jar, and it smelled absolutely intoxicating.  It warmed when he rubbed it into my skin – I remember feeling hyper-sensitive to touch, and wanting him to touch me more than was normal.  It was like I just could not get enough of him.”</p>\n\n<p>I didn’t realize I was in tears until Malachai handed me tissues.</p>\n\n<p>“I’m sorry to make you go through those memories, angel,” he murmured, looking like he’d been kicked.  “I know how painful they are.  I’ve got a few of my own.”</p>\n\n<p>“How old are you, Malachai?” I heard myself ask.</p>\n\n<p>He uttered a short laugh.  “Thirty-seven,” he replied.  “I feel far older, though.”</p>\n\n<p>John walked into the guard house then, and stopped dead.  “Malachai?” he queried, looking confused.</p>\n\n<p>“Live in the flesh, old man,” Malachai teased.  “Let me guess: you thought I was dead.”</p>\n\n<p>“Good guess,” John said, smiling some now.  His eyes went to me and Chloe.  “Tell me you’re looking after them.”</p>\n\n<p>Malachai nodded.  “I am, John,” he confirmed.</p>\n\n<p>“How bad is it?” </p>\n\n<p>“Chloe is the great-great niece of Harry Thomas Woods,” Malachai deadpanned.</p>\n\n<p>“Son of a bitch,” John swore, leaning on the counter.  “I  knew things were bad, but I  had no idea he’d be involved.”</p>\n\n<p>“Wait, you knew him?” I asked John, puzzled.</p>\n\n<p>John nodded, running a hand through curly reddish hair.  “Met him a few years ago at a company party.  He was a complete jackass – bragging about how he’d built this plant with his own two hands.  Bullshit he did.  He just designed it – it was men like me and Rooster who built this son of a bitch.”</p>\n\n<p>“Good old Harry,” Malachai muttered, shaking his head.  “The poor bastards who didn’t bow down to his greatness became part of that building permanently.  That or … they were sacrificed.”</p>\n\n<p>At midnight, I saw a car pull into the lot.  It was a sleek, silver thing – the make or model I had no idea.  It circled a few times before pulling into a parking spot just out of sight, and I wrote it off as someone’s wife bringing them dinner.  Chloe was in her playpen watching the mobile go round, and Malachai had stepped into the restroom.</p>\n\n<p>The door opened, and an old man wearing a black hat and using a cane with a wolf’s head in gold walked in.  Icy blue eyes locked on me, and a smile curved his thin mouth.  “Hello, Selene.”</p>\n\n<p>My blood turned to ice in my veins, and my free hand reached to wrap around the baseball bat under the counter beside me.  “Harry Woods, I presume?” I asked, proud that the terror I felt didn’t come through in my voice.</p>\n\n<p>“Oh, now, just call me Harry, dear,” he oozed, walking up to the counter.  Those unsettling, dead eyes went to Chloe, who had frozen in her playpen and was staring at him with wide eyes.  “My great-great niece.  She’s exquisite.”</p>\n\n<p>I wanted to vomit at those words.  As he turned to move down the counter, to come behind it to where Chloe was, a voice like the distant rumble of thunder stopped him dead.</p>\n\n<p>“You take one step towards her, Harry, and you won’t like what happens next.”</p>\n\n<p>The look of pure malevolence on that old man’s face stopped my heart, and all I could think was I needed to get Chloe and get the hell out of there.  The hell with the job, I’d find something else, but we weren’t safe there anymore.</p>\n\n<p>“Malachai,” Harry spat, turning to face him.  “Why are you here, boy?”</p>\n\n<p>Malachai advanced on him slowly, his expression a blank slate.  “You know why I’m here, you old fool.  You know exactly why I’m here.”</p>\n\n<p>While Harry’s back was turned, I darted over to Chloe and snatched her up out of her playpen to hold her tightly against me.  I was shaking all over, and tears streamed over my cheeks, but he wasn’t touching my daughter even if it meant my own death.</p>\n\n<p>Harry narrowed his eyes at Malachai, and his servitor appeared behind Malachai at once.</p>\n\n<p>I opened my mouth to scream a warning, and before I could Malachai did something I couldn’t logically explain.</p>\n\n<p>A long, black blade just appeared in his hand, and he rammed it backwards into the servitor’s chest without taking his eyes off Harry.  The servitor screamed, smoked, and then vanished, leaving Malachai and Harry facing off.  “I think you and I have done this before, Harry,” Malachai expressed.</p>\n\n<p>Harry growled something unintelligible, throwing his hands out to the sides …</p>\n\n<p>Malachai murmured something softly and waved his left hand at Harry, preventing him from completing the spell.  “You’re not getting either one of them, Harry, and that’s a promise.”</p>\n\n<p>“This isn’t over, Malachai,” Harry spat, shoving past him with a deadly look.  “You wait and see!”</p>\n\n<p>Malachai just turned to watch him go, one black eyebrow raised.  When the silver car left the lot at speed, he turned to me and Chloe.  “Other than being scared shitless, are you two okay?”</p>\n\n<p>I nodded, still bouncing her on my hip and swiping tears away.  “I just thought he looked evil in the photo – that photo doesn’t do justice to how evil that man is,” I said, my voice quavering.</p>\n\n<p>Malachai rounded the counter and drew me and Chloe both up against him warmly.  He didn’t say anything.  He just held us like that for a time.</p>\n\n<p>By the time he drew away, I was calm again. Chloe gave him her trademark smile, her little arms reaching out, and I let her go to him easily.  Part of me wondered how she would take it when the issue of Harry was resolved and he left us.  I’d cross that bridge when I came to it.  “What are you, Malachai?” I asked bluntly.</p>\n\n<p>“I’m the good guy, Selene,” he replied without batting an eye.  “I’m what evil fears the most.”</p>\n\n<p>His answer left a lot to be desired, but I let it go.  He’d kept Harry from touching Chloe, and that was all that mattered.</p>\n</div>\n","author":"RhapsodyinVelvet"}