{"rank":"6","title":"Down By the Creek (Part 3)","id":"8lccwo","url":"/r/nosleep/comments/8lccwo/down_by_the_creek_part_3/","time":"1527013941000","body":"<div class=\"md\"><p>You ever had the feeling that you&#39;re being watched? </p>\n\n<p>That sense of uneasiness and fear; you ever had that feeling? </p>\n\n<p>Well, once I got to Memphis, Tennessee, that feeling hit me like a freight train. </p>\n\n<p>&quot;18 years.&quot; I thought. </p>\n\n<p>I hadn&#39;t been to my hometown in 18 years. </p>\n\n<p>&quot;Thanks.&quot; I said to the driver, then he drove off. </p>\n\n<p>My hometown hadn&#39;t changed much through the years. </p>\n\n<p>I walked down the road and my mind was flooded with memories. As a boy, I used to go the ice cream parlor every Friday. I looked at the ice cream parlor with a sense of pity. </p>\n\n<p>The parlor had closed. </p>\n\n<p>Boards covered up the door and the windows. </p>\n\n<p>The parlor looked like a haunted house now. </p>\n\n<p>&quot;Good memories.&quot; I muttered to myself. </p>\n\n<p>I headed down the street. Cars drove by me, and people waved. I waved back and smiled. Did they recognize me? </p>\n\n<p>They didn’t seem to, so I left it at that. </p>\n\n<p>I walked down 5th Avenue and got to the elementary school. </p>\n\n<p>Cars were in the parking lot, and the buses were unloading kids. </p>\n\n<p>I don’t mean to be a stalker, but I watched the kids go inside. </p>\n\n<p>I tried to imagine myself in that group of kids. That same freckle splattered face, broken glasses, messy, orange hair, and green eyes. How dumb I must have looked. </p>\n\n<p>Then, that sense of uneasiness fell over me. </p>\n\n<p>I turned around to make sure no one was watching me. All I saw was a parking lot full of cars. </p>\n\n<p>Then, everything fell silent. </p>\n\n<p>The buses had gone away, and all the kids were inside the school.  </p>\n\n<p>I was completely alone, except for the few cars that were on the road. </p>\n\n<p>I took a glance at the school once more, and then headed back to the street. </p>\n\n<p>That’s when I saw the 3 boys on the playground. </p>\n\n<p>There was one small kid on the ground and the other two boys were standing up. </p>\n\n<p>I knew at first glance what this was. </p>\n\n<p>I walked over to the two boys standing up. They were kicking the small boy on the ground and yelling curses. </p>\n\n<p>One of the bullies saw and sped off down the road. The other one didn’t see me. </p>\n\n<p>Anger flooded through me and I rammed into the bully. </p>\n\n<p>He was big for his age. Almost as tall as I was, and I&#39;m 6&#39;1. </p>\n\n<p>The kid fell flat on his back and screamed in terror. I reached out for him and lifted him up by his shirt. I slammed him against the slide. </p>\n\n<p>Unrelenting rage. </p>\n\n<p>The bully started to scream, and then all at once, I knew what was happening. </p>\n\n<p>I was too fixated on the bully to realize that I had almost transformed. </p>\n\n<p>My hands were black and wispy, and my arms were pulsating. </p>\n\n<p>I looked at the bully; his face was contorted with fear. </p>\n\n<p>As my anger and rage went away, my arms started to turn back to normal color, and I felt much better. </p>\n\n<p>I felt much weaker too. </p>\n\n<p>My arms loosened, and I let the boy go. </p>\n\n<p>He ran away as fast as he could. The smaller kid had left too. </p>\n\n<p>I had almost killed that boy.  </p>\n\n<p>My knees weakened, and I fell to the ground. I put my hands in front of my face and started to cry. My tears came with heavy sobs and screaming. I cried for all that had happened. From the monster in that creek to the point in my life at that moment. </p>\n\n<p>My chest started to hurt from the sobs. </p>\n\n<p>The tears were hot, and they stung my eyes painfully. </p>\n\n<p>They rolled down my face in streams, and they splattered onto my shirt. </p>\n\n<p>&quot;I am a monster.&quot; I muttered to myself. </p>\n\n<p>I got up on one knee and my wiped away my tears. I came to this town to do one thing and one thing only. </p>\n\n<p>To destroy the monster that made me who I am. </p>\n\n<p>My knees wobbled as I stood up fully. </p>\n\n<p>I walked off the playground and started towards my house. A flood of memories started as I did. </p>\n\n<p>Every time I looked up ahead of me, I saw a small boy being pushed around by Allen and Ralph. </p>\n\n<p>I could see his glasses being broken, his book pages ripped out. </p>\n\n<p>Then, for the first time in years, I remembered my parents. </p>\n\n<p>My mom and my dad. I had forgotten how much I&#39;d loved them. </p>\n\n<p>They had so many problems to face when I was sentenced to that mental institution.  </p>\n\n<p>I guess disowning me was the answer to their problems. </p>\n\n<p>At least, that’s what the psychiatrists told me.  </p>\n\n<p>I don’t know where my parents are now, but I hope they burn in hell someday. </p>\n\n<p>I didn’t cry when they told me, in fact, I was numb to it all. I haven&#39;t cried about it since. I was about to cry then, but I fought it back. </p>\n\n<p>It took me a few minutes to get to my house, but once I got there, everything started to come back. </p>\n\n<p>The gate that my friend and me would jump. </p>\n\n<p>The door that Allen and Ralph would bust through to bully me. </p>\n\n<p>All of it came back to me. </p>\n\n<p>I smiled a little bit, and it helped.  </p>\n\n<p>The house was boarded up. All the windows were shattered from rocks being thrown into them. The door was busted open, probably by teenagers. My old house. </p>\n\n<p>I gawked at the house for a while. I couldn’t help myself. Moreover, you can&#39;t blame me, I had been gone for 18 years. </p>\n\n<p>I took a deep breath and stepped into the backyard. </p>\n\n<p>The creek was within view. </p>\n\n<p>That was when the fear started to creep in. </p>\n\n<p>Unrelenting and total fear. Fear of the monster that created me. Fear of the thought of fighting it and the fear of losing. </p>\n\n<p>What would happen if I lost? </p>\n\n<p>I didn’t want to know. </p>\n\n<p>I walked on the path that lead me to the swamp. I turned around a few times to make sure I wasn’t being watched. Swirls of fog coated the path and tree bent forward, as if they were alive. </p>\n\n<p>After a few minutes, I got to the edge of the swamp. </p>\n\n<p>It was completely silent. </p>\n\n<p>The water was still. </p>\n\n<p>&quot;Come out!&quot; I shouted. </p>\n\n<p>Nothing replied. Where was the monster? Was it gone? </p>\n\n<p>That’s when a whisper sounded. </p>\n\n<p>&quot;Well, well, well,&quot; It sounded, &quot;look who&#39;s here. My creation.&quot; </p>\n\n<p>&quot;The creation that has come to destroy you.&quot; I said. I began to transform. </p>\n\n<p>&quot;Your sense of bravery makes me sick. It seems that my expectations of you were wrong.&quot; It hissed. </p>\n\n<p>&quot;What were your expectations?&quot; I asked. </p>\n\n<p>&quot;I expected you to thank me. After all, I am your creator.&quot; It replied, slyly.  </p>\n\n<p>&quot;Thank you?&quot; I shouted, &quot;You ruined my life! I&#39;m going to destroy you!&quot; I yelled. I felt a bolt of anger surge through me. </p>\n\n<p>&quot;Hahahaha.&quot; It cackled, then, it appeared.  </p>\n\n<p>It rose up from the swamp water, a huge, black, pulsating blob with tentacles. The same green eye in the middle. I couldn’t see its mouth, even though it was five feet away from me. </p>\n\n<p>It moved closer to me, and I transformed fully. I felt stronger. </p>\n\n<p>&quot;I will do destroy you.&quot; I spat. Then, I ran straight at the monster. I screamed and sent a shockwave of power into the monster. </p>\n\n<p>The monster didn’t even budge. </p>\n\n<p>Then, the monster swiped a tentacle across my body. It burned, and it sent me back a few feet. </p>\n\n<p>I landed in the swamp water hard. </p>\n\n<p>&quot;You think you can destroy me?&quot; The monster asked. With that, the monster lunged at me and threw into a tree. </p>\n\n<p>I saw stars when I hit my head. </p>\n\n<p>That’s when I got angry. </p>\n\n<p>I lunged up from the ground and tackled the monster with all my might. I started to punch it. </p>\n\n<p>I could feel it moving up and down underneath me as I sent punches. </p>\n\n<p>I could hear the monster screeching as I started to poke out its eye. </p>\n\n<p>I was thrown backwards by a force of energy. </p>\n\n<p>The monster rushed at me and started to choke me with its tentacles. I could feel blood rushing to my head. I tried to use my own tentacles to suffocate the monster, but I couldn’t move. </p>\n\n<p>The monster stared at me with its cold, green eye. I could hear it cackle. </p>\n\n<p>&quot;I am stronger than you can could ever imagine!&quot; The monster shrieked, and then it threw me onto the land. </p>\n\n<p>I was too weak to stay as the monster. </p>\n\n<p>I transformed back into my original self. </p>\n\n<p>The monster picked me up by my neck and slammed me against the tree. </p>\n\n<p>&quot;You will never win.&quot; I said through gritted teeth. </p>\n\n<p>The monster stared at me and said, &quot;Your right.&quot; </p>\n\n<p>Then, something weird happened. </p>\n\n<p>The monster let go of me and started to transform. </p>\n\n<p>I could see it pulsating and shrinking. </p>\n\n<p>&quot;If I can&#39;t win here,&quot; The monster said, &quot;then I will win inside you.&quot; </p>\n\n<p>Then, the monster transformed into a swirl of black and flew at me. </p>\n\n<p>I tried to run away, but the monster knocked me down. Then, it started to fly inside my mouth. </p>\n\n<p>Cold started to spread throughout my body. I tried to scream, but I couldn’t. </p>\n\n<p>I couldn’t breathe either and I started to jerk back and forth. </p>\n\n<p>Then, everything stopped. </p>\n\n<p>I lied on the ground and took in deep gulps of air. </p>\n\n<p>Then, I threw up. I retched and saw black liquid coming out of me, but the monster never came out. </p>\n\n<p>I tried to stand up, but I couldn’t. </p>\n\n<p>&quot;What&#39;s happening to me?&quot; I muttered aloud. Then, sharp pains racked my body. I started to scream, and that’s when a voice arose in my head. </p>\n\n<p>&quot;You will never win Scott. You cannot fight me forever. One day, you will succumb to the darkness. To the evil. And when that day comes, there will be nothing to stop it.&quot; </p>\n\n<p>&quot;Nothing...&quot; </p>\n\n<p>The voice stopped, and the pain stopped too. </p>\n\n<p>I stared at the ground and started to cry again. </p>\n\n<p>I&#39;m so scared right now. </p>\n\n<p>Sometimes I hear voices at night, telling to kill and to succumb to the darkness. </p>\n\n<p>Every day it gets worse. An infection in my chest has started. My skin is turning black, and its decaying. </p>\n\n<p>Will I become the sinister monster I was destined to be? </p>\n\n<p>Or will I fight and become the monster I chose to be? </p>\n\n<p>That I don’t know. </p>\n\n<p>That single minded evil... </p>\n\n<p>that unending monster.</p>\n</div>\n","author":"Dan100903"}