{"rank":"0","title":"A two, a five and a king all of which were hearts","id":"8lce0h","url":"/r/nosleep/comments/8lce0h/a_two_a_five_and_a_king_all_of_which_were_hearts/","time":"1527014159000","body":"<div class=\"md\"><p>So, five years ago me and three of my friends went on a party trip to Mallorca. We drank way too much on the night before our flight back home. One of my friends actually got a tattoo of a royal straight flush as he had just won 50000$ in a poker match. Consequently, he decided to fund our trip as we had told him to go all in on his hand. </p>\n\n<p>Later that evening we got to our hotel room and we came up with the best idea: let’s play poker! So, we started playing and after a while we noticed that three cards were missing. The missing cards were a two, a five and a king all of which were hearts. My friend noticed that his tattoos cards were also hearts. “Not a big deal”, we thought and continued playing with a different deck until another of my friends realised that the cards that were missing were the same as our landing date 2.5.13.</p>\n\n<p>This kind of freaked us out, but we still drank and played through the night. And I even made a joke about the whole thing as the cards covers had G.H.O.S.T written on them.</p>\n\n<p>  We woke up in the middle of the day hungover from last night. We were lucky as our flight back home was at night. I woke up to the sound of my friend screaming bloody murder.</p>\n\n<p>. The card deck that had the cards missing was spread out on the table, with the cards set to spell his social security number.  . He was shaking out of fear and I realised that he might be having a panic attack and lied to him that I spread the cards. </p>\n\n<p>But I hadn’t done it. I’m sure it was one of my other friends.</p>\n\n<p>We went to the reception to give our keys back but the hotel manager, who was supposed to be there every day,  was not there. We were kind of in a hurry as we had to eat, so we left a note and the keys on the front desk. We went to grab some breakfast. We had an english breakfast at 1 pm.</p>\n\n<p>  As I was eating my beans my friend’s face turned blank. He was reading the local news and he read that the hotel manager was found dead in a lake. We all kind of went silent for a while and I  couldn’t even finish my breakfast as I thought of that sweet old man being killed and being thrown into a lake. We ignored this for the rest of the day but the event still haunts me to this day; that the murder might have happened right next to us while we were having fun.</p>\n\n<p>On our flight to Helsinki we started talking about those missing cards. We found it spooky that the manager was killed and those missing cards portrayed our landing date. We all just agreed not to talk about that night to not freak ourselves out even more.</p>\n\n<p>As we landed at Helsinki we all departed and said our goodbyes to each other. Except the friend whose social sec. number was written out. He just stood there for a solid twenty seconds until I punched him gently. He laughed and hugged me for some reason. We all left in seperate cars as we lived in different parts of the country.</p>\n\n<p>I haven’t kept in touch with my old friends. My life of partying and hangovers is over. I’ve settled down and have a nice family and a job.</p>\n\n<p>The thing that made me post this story was that a week ago I was revisiting my pictures from my old holidays and I noticed that one of my friends was cut out. On every single picture I had of him and me .</p>\n\n<p>I went to check his facebook and it was memorialized. There was a link to a news article on a Spanish newssite. I passed it through a translator and the article read that there was a tall blonde man in his 30s found dead in the same lake as the hotel manager. The article was only 2 days old at that point. The weirdest part of the article was that in the autopsy, they found three playing cards lodged in his head. A two, a five and a king all of which were of hearts.</p>\n</div>\n","author":"denkpotato"}