{"rank":"27","title":"Am I in trouble? Or am I just a dumb blonde?","id":"8lckek","url":"/r/nosleep/comments/8lckek/am_i_in_trouble_or_am_i_just_a_dumb_blonde/","time":"1527015444000","body":"<div class=\"md\"><p>I’m either losing my mind or am in a serious trouble…</p>\n\n<p>My name is Mabel L. I’m not going to give you my last name because doing that in the past may be why I’m in this trouble. Anyhow, here’s the deal:</p>\n\n<p>I recently – about a month ago – moved into a new apartment in a small city in the US. I’m 21, single and live alone. And in fact it’s the first time in my life that I’ve lived alone.</p>\n\n<p>For the first month of being here everything’s been great. I’ve started a new office job and have already made quite a few friends there. I really love my position and the only major downside is that I’m on almost the opposite side of the country to my family. But in a way it was intentional to move so far – I need to grow up. But overall things have been so good which has left me kind of suspicious; anytime things are going too good, you just know something bad will happen.</p>\n\n<p>The issue is I’m not actually certain anything bad has happened… I’ll explain.</p>\n\n<p>Over the past few days, a few odd things have happened in my apartment. The problem is that these things are all so truly insignificant or misinterpretable or, most likely, the result of just pure absentmindedness on my part that I honestly can’t tell what’s up. I’ve been mulling them over and over and I can’t determine if I’m in mortal danger or am just being a flake (indeed my hair is blonde).</p>\n\n<p>I&#39;ll just list the incidents below:</p>\n\n<p>I always sleep in the same attire: bra and panties. It’s how I’ve slept since I was 12, maybe even earlier. I feel quite comfortable that way and so I’ve been sleeping with bra and panties only (no socks) every night for about 10 years.</p>\n\n<p>So, a few nights ago, I went to sleep with my usual outfit. But, when I woke up the next morning, my panties were gone. My first instinct was to assume I must have gotten up in the middle of the night, took them off for some reason I don’t remember, and passed back out. But that didn’t make sense for multiple reasons. For one, I don’t drink or take any medication and I’ve never had any issues with sleepwalking or waking up in the night and forgetting I had. But more importantly, I could not find the panties <em>anywhere in my entire apartment</em>. Any my apartment really isn’t very big so I should have found them. The more I looked, the more confused I became… How could a bright, bright hot pink pair of panties just disappear in the night? It perplexed me the whole day but I just couldn’t come to any reasonable conclusion. <em>Oh well, it’s just a pair of panties</em> I told myself. That was four days ago.</p>\n\n<p>That next day, three days ago, I got up, showered, got dressed, and went to work. Everything seemed as it should be. Work was fine, nothing out of the ordinary. Did what I had to, had some fun at lunch with some girls who work on my floor, did some more work and headed home.</p>\n\n<p>It wasn’t until I got to my apartment door that I noticed that something else might be “wrong.” I pulled out my keys to unlock my apartment door, found the right key, inserted it into the lock and… I stopped.</p>\n\n<p>I’d only had my new apartment key for a month so it’s entirely possible I just wasn’t familiar enough and my brain had some weird lapse of memory but… I could swear it was the wrong key that I just inserted into my front door’s lock. It was ever so slightly a different shade of brass (if that even exists) and the part of the key still sticking out of the lock at the back was a different shape… I think. And the lock too – the lock itself looked almost identical, but just slightly different. But, when I turned the key, the door unlocked… And I went inside. And like the day before, I spent the rest of it slightly uneasy and eventually went to bed.</p>\n\n<p>The next day, two days ago, was the worst. </p>\n\n<p>My family has property upstate: quite a bit actually. Almost 200 acres. So, all throughout my childhood we would go up there on weekends and vacation weeks and just have a blast. I would often bring my best friend V and the two of us would make the absolute most of every second up there.</p>\n\n<p>Anyway, one of the times we went, 9 years ago when we were both 12, we were half way up a large hill with my father just slightly behind us and we turned around and demanded he take a picture of us immediately. The sun was setting, there were giant fields and trees behind us and the sky was brilliantly blue with only a few beautiful white puffy clouds. My father took the picture and to this day it’s my absolute favorite photo I’ve ever taken. I’ve even placed it in its own folder on my phone’s photo library and I look at it at least once a week. I know every pixel of the photo practically by heart.</p>\n\n<p>Well, two days ago, while at work, sometime in the afternoon, I took out my phone to glance at that favorite photo of mine. And, what the fuck… Way in the background is suddenly a man I’ve never seen in the photo before. He was too far back to really make anything out but he was wearing mostly dark clothes and certainly blended in with the shrubs and trees behind him, plus, it was at twilight… But how could I possibly have never noticed that before? I mean, it is <em>possible</em>, but <em>probable</em>? I don’t think so, not at all.</p>\n\n<p>That one stuck with my all day. The more I looked at the photo the more I convinced myself it was entirely possible I just never noticed him before. So, eventually, I just sort of pushed it from my mind. And, again, I did what I did the rest of the day and went to sleep.</p>\n\n<p>What happened this morning is what convinced me to make this post…</p>\n\n<p>I woke up, panties and bra still in tact, brushed my teeth, and hopped in the shower. All seemed normal until I grabbed the bar of soap I’ve been using the past week to wash myself. When I picked it up, I could feel an ever so slight indenting on the back side of it. I turned it around, brought it close to my eyes, and, I swear... <em>H E L L O : )</em>  was etched into the soap. I dropped it immediately and my mind went crazy with racing thoughts.</p>\n\n<p>Does it even really say HELLO? The etching was practically microscopic and shallow and it was smeared considerably. But, also, many bars of soaps have engravings on them; is that what this was? I looked at the soap again and could see the very clearly etched and prominent Dove symbol: maybe Dove added a second engraving to be more friendly? Yes, that must be it… I was too afraid to confirm this so I’ve just been leaving untouched that explanation in my mind.</p>\n\n<p>I began to scan my history for any signs of stalkers or future stalkers and couldn’t come up with much. A few odd online friends maybe throughout the years.</p>\n\n<p>The only one that stuck out at all, and believe me it sticks out so barely, is with a guy named Marlin I used to talk to when I was 11, ten years ago. We met in one of those generic chat rooms and talked for a bit. He got weird, I guess, but nothing telling. At a point he wanted to meet up. I confessed I was only 11 but he wasn’t totally thwarted, but that was the last we spoke. Our last conversation ended in him jokingly telling me he’d find me some day. But, believe me, he was very obviously joking around; I only mention it now because I’m freaked the fuck out.</p>\n\n<p>What is going on here? And I in trouble or just another dumb flaky blonde who can’t remember her own name let alone the shape of her apartment lock?</p>\n</div>\n","author":"masnaTellsHisStories"}