{"rank":"7","title":"Assumptions","id":"8lcn54","url":"/r/nosleep/comments/8lcn54/assumptions/","time":"1527015988000","body":"<div class=\"md\"><p>I’ve posted the stories of two people so far who wanted to share their disquieting incidents as a way to release and for clarity. It started out as a technique for us to cope with our traumas, but I’ve been getting messages from other people who feel encouraged to share similar experiences.</p>\n\n<p>One such person is Dora, who read <a href=\"https://www.reddit.com/r/nosleep/comments/8i0sm2/gullibility/\">Tina’s story</a> and wanted to share her own anecdote that touched on mistaken assumptions and prejudice. Dora recited her bizarre ordeal to me, so I did what I guess I do now, and typed it out, working on keeping her voice and my style. Some names and details have been changed to protect the innocent.</p>\n\n<p>Below is Dora’s story.</p>\n\n<p>-------------</p>\n\n<p>“Excuse me, Miss, can you please help me find my dad?”</p>\n\n<p>I’m distracted from my cellphone by a polite, little boy tugging at my sleeve. The food court in this bustling mall is packed with friendly faces escaping the summer heat, yet this kid somehow chose to approach me.</p>\n\n<p>He can’t be older than seven, his cherubic face framed by a halo of wild locks, his S&#39;s whistling due to a missing front tooth. He’d fit right in with the rowdy first-graders I teach.</p>\n\n<p>He looks up at me with nervous eyes, one hand still gripping my sleeve, the other holding a cellphone. Kids these days, mastering technology before they can walk. I didn’t get my first cellphone until I was fifteen, but I’m positive all my students are already coding their own apps.</p>\n\n<p>“My dad said to call if I got lost, but I can’t because my phone is dead.” He bites his lip anxiously.</p>\n\n<p>“Hey, buddy, don’t worry. Why don’t you give me his number? We can call him from my phone.”</p>\n\n<p>“I…I don’t remember it…” he replies, his voice wavering.</p>\n\n<p>I pat his arm as I comfort him. “Hey, no problem! We’ll just go to security. They can say your name over all the speakers in the mall so your dad will know where to find you, how’s that?”</p>\n\n<p>He nods and holds out his hand. I take it, tossing my vanilla milkshake and abandoning the table I worked hard to secure. A couple of teens pounce on it at the same time as a businessman. I’d have loved to stay and watch the fight, but I have a little kid to reunite with his father.</p>\n\n<p>We begin walking and the kid looks around, searching for a familiar face.</p>\n\n<p>“What’s your name, buddy?”</p>\n\n<p>“Benjamin Drell, six-and-a-half years old, at [address],” he announces proudly.</p>\n\n<p>“Ah, okay. But don’t give your address like that to strangers, Benjamin,” I warn. “Only to police officers or someone you trust.”</p>\n\n<p>“But I trust you.”</p>\n\n<p>“Well, thank you. But you just met me and you alw-“</p>\n\n<p>“Hey, you there, stop!”</p>\n\n<p>The sound of panicked yelling causes Benjamin and me to turn around. A man is running towards us and I hug the kid protectively as I take a confident stance. Benjamin doesn’t seem to need my protection, though, as he points excitedly.</p>\n\n<p>“There’s my dad!”</p>\n\n<p>The man comes to a stop in front of us, his eyes darting between Benjamin and me as he tries to assess the threat level. His features soften as he holds his hand out. Benjamin grabs it, now linking the three of us.</p>\n\n<p>“Benji, don’t ever scare me like that!” the man says, sighing in relief, before turning to me with a grateful smile. “Thank you for helping my son.”</p>\n\n<p>I don’t release Benji’s hand. “You’re welcome. I hope you don’t mind, because I can see Benjamin knows you, but can I have some proof you’re his dad and legal guardian, please?”</p>\n\n<p>The man looks surprised, but complies as he pulls out his cellphone and swipes through a few photos of him and his son together. “My wife passed away last year, so it’s just Benjamin and me. I don’t have legal documents on me, but I swear I’m his father.”</p>\n\n<p>“This is my dad, Miss. He’s single.”</p>\n\n<p>I look down at Benji, amused. Kids these days.</p>\n\n<p>“Aha, all right Benji, that’s enough,” the man says with a flustered chuckle before addressing me. “Thank you again, I really appreciate your caution.”</p>\n\n<p>“No problem,” I reply. “I’m a teacher, so we have to keep an eye out on abductions, especially from family members.”</p>\n\n<p>Benji looks up at his dad innocently. “Can she have lunch with us?”</p>\n\n<p>“Hoo boy, my son’s really putting me on the spot, isn’t he?” the man says, emitting a short laugh as he shifts from one leg to the other. “Well, I would like to thank you. How about I treat you to lunch? Or at least a coffee?”</p>\n\n<p>“Oh, thank you, but I’m sorry! I’m already meeting someone for lunch,” I reply with an apologetic smile.</p>\n\n<p>The man shrugs good-naturedly. “Ah, I tried, eh, Benji?” He extends his hand to me. “My name is Terry, by the way.”</p>\n\n<p>I can’t wiggle my hand out of Benji’s to shake it. “I’m Dora.”</p>\n\n<p>Benji, swinging our linked arms, exclaims gleefully, “Like Dora the Explorer?”</p>\n\n<p>I try to hide my sigh of exasperation. “Same name, yes! But I don’t go exploring much, unfortunately.” I wink at him and he giggles.</p>\n\n<p>“Come with us, Miss Dora. I’m having a kid’s meal, you can have my toy!” Benji generously offers.</p>\n\n<p>“Thank you, Benji, but I’ve really got to go, buddy. Enjoy your lunch with your dad, okay?” I gently pry my hand out of his grip and ruffle his hair, then look up at his dad. “Terry, it was nice meeting you. You boys try not to lose each other again!”</p>\n\n<p>I turn and walk away, trying to ignore Benji’s crestfallen face. I jog over to the food court and spot Daphne leaning against one of the columns, dressed in her realtor best, arms crossed.</p>\n\n<p>“Hey, Daffy. Sorry I’m late!”</p>\n\n<p>“Hey, Dork. What happened to ‘5:30 on the dot’? I’ve been waiting for ten minutes!”</p>\n\n<p>I inform her that ten minutes isn’t that devastating a period to wait and proceed to tell her what happened while we stand in line to order our pad Thai. It takes us another ten minutes just to find a table.</p>\n\n<p>“So, was the guy cute?” Daphne asks as she breaks apart her chopsticks.</p>\n\n<p>“I guess, yea. He’s got that tall, lean, clean-cut thing going for him. Gave those brown eyes to his son, who’s adorable, by the way.”</p>\n\n<p>“And the kid invited you for lunch?” Daphne laughs when I nod. “Now there’s a little matchmaker in the works.”</p>\n\n<p>“Haha, yea. Kids these days,” I chuckle as I take a bite of my spring roll. “Speaking of matchmaking, how are you and Jordan hitting it off?”</p>\n\n<p>“Ah, it’s going well,” Daphne replies with a mouth-full of noodles. “Her thesis is driving her mad, though, which is driving me mad. All she talks about is her research. I can’t wait until she presents it, then we can really work on getting to know each other…in more ways than one.” She winks.</p>\n\n<p>I shake my head amusedly as I dig into my lunch. I’ve barely taken two bites when we’re interrupted by Terry, who runs up to me frantically.</p>\n\n<p>“Oh, thank God, you’re still here! Dora, you have to help me!”</p>\n\n<p>“Terry? What, how? Where’s Benji?” I ask, bewildered.</p>\n\n<p>“He ran off,” Terry explains. “I…he was disappointed I couldn’t…that you didn’t stay for lunch. It isn’t your fault! He just misses his mom and he…he’s still too young to understand. I talked to security and they’re searching but the photos I have aren’t that recent. You’re the only one who knows what he looks like today. Please, can you help me?”</p>\n\n<p>Daphne speaks up before me, “Sure, we’d love to help. Let us know where to start looking.”</p>\n\n<p>“Thank you, thank you! I searched the toy stores and the play area. Maybe you can search the top two floors and I’ll search the bottom two?” Terry pulls out his cellphone. “Here, take my number so we can contact each other in case…when we find him.”</p>\n\n<p>I enter his number and give him a missed call. “Don’t worry, Terry. We’ll find him. Daphne and I will keep in touch.”</p>\n\n<p>Terry thanks us profusely before running off, and we jump right up and begin our search.</p>\n\n<p>We scan every store on the third level, from electronics to lingerie, and the restrooms. Yes, men’s as well. We move on to the second level and, after weaving through two stores calling out Benji name, we hear a meek reply from under a display of multicolored Crocs.</p>\n\n<p>I crouch down. “Benji! There you are, buddy! Why’d you leave you dad? He’s worried sick!”</p>\n\n<p>“Did he tell you to look for me?” he asks, unable to conceal a small smile.</p>\n\n<p>“Oh, he’s a devious little one, isn’t he?” laughs Daphne.</p>\n\n<p>I sigh. “Benji, that wasn’t very nice. Your dad is very worried. Always stay with him in big, crowded places. There are some strangers that may not be very nice. Stay with people you trust, buddy. Okay?”</p>\n\n<p>Benji crawls out from under the display. “I trust you, Miss Dora.”</p>\n\n<p>Daphne mimes an “awwww” and I give her the “shut up” expression.</p>\n\n<p>“Do you trust me too, Benji? I’m Dora’s sister, Daphne.”</p>\n\n<p>“Like Daphne in Scooby-Doo?” Benji asks curiously.</p>\n\n<p>Unlike me, Daphne’s doesn’t hide her exasperated sigh. “Do kids even still watch that show?”</p>\n\n<p>I shrug in reply as I call Terry and hold out a hand to Benji, who happily takes it. “Terry, we found him!”</p>\n\n<p>“Oh, thank heavens!” Terry exclaims. “Is he all right? Where was he?”</p>\n\n<p>“He was hiding under a flamboyant display of Crocs. He’s safe and sound.”</p>\n\n<p>“Thank you! I’ve seriously got to have a word with that boy. Listen, I’m going to grab my car, I’ll meet you at the parking lot across the fountain. I think my son needs a time-out.”</p>\n\n<p>Daphne and I each take one of Benji’s hands as we make our way to the mall entrance. It’s a blistering Tuesday afternoon and not many people are hanging around outside. We stroll over to the crosswalk and make a point of looking both ways twice, imprinting some traffic rules on Benji.</p>\n\n<p>We wait for a grey, windowless van to pass by, but it slows down and lingers in front of us. Daphne scoffs at the rudeness of some people but is cut short as the van’s door slides open and the three of us are pulled inside so fast I barely have time to comprehend the situation before I’m out cold.</p>\n\n<p>…</p>\n\n<p>I wake up to a snoring sound, only to realize it’s me. I’m crumpled into myself against the corner of a wall like a discarded accordion. I groan as I lift my head off my chest and wipe away the drool. I look around, dazed and lost, my head aching. Wherever I am, it’s dark, musty, and humid. The gritty floor grinds and crunches as I shift my weight hesitantly.</p>\n\n<p>“Dora? Dor, please tell me that’s you!”</p>\n\n<p>“Daphne? Daphne! Where are you? What happened?”</p>\n\n<p>“What happened? We fell for the oldest fucking trick in the book!” Daphne spits out as she strikes something metallic and it reverberates. “That psycho used his kid to lure us in and here we are in his basement or whatever the hell this is.”</p>\n\n<p>“What?!” I scramble into a standing position, panting anxiously, the stale air dense in my lungs.</p>\n\n<p>“Dammit, Dora! How could we not see it?”</p>\n\n<p>I reach out my hands, trying to make sense of where I am. My cell is not much larger than a phone booth and the walls feel like solid brick, except for one side which has metal bars, top to bottom. I’m grateful I’m not claustrophobic.</p>\n\n<p>I grab the coarse bars and shake them rabidly. They shudder and clang, but remain in place. I jump as I feel a soft touch on my hand and draw back.</p>\n\n<p>“Dor, did I just touch you? I think we’re in adjoining cells. At least, I hope that was you I touched.”</p>\n\n<p>I reach out again and feel for her hand, grasping it tightly. “Yes, it’s me, Daph. I…I can’t believe this is happening. I’m so sorry, I have a soft spot for kids. I didn’t think…I’m sorry…”</p>\n\n<p>“Dor, we have to get out. I’m not going to spend my life as a psycho&#39;s plaything or be trafficked or whatever.”</p>\n\n<p>“What do you have in mind?”</p>\n\n<p>Daphne answers my question by screaming for help at the top of her lungs. I wish she had given me a warning as my ears ring at her shrill tone echoing throughout our dungeon.</p>\n\n<p>A door creaks open, sending a hazy tunnel of light over a flight of stairs, and Daphne clams up so fast the absence of sound is like a vacuum.</p>\n\n<p>“If you don’t keep quiet, I will hurt the child,” a man growls, his threat accompanied only by his elongated shadow.</p>\n\n<p>His tone sounds warped, like a man trying, and failing, to deepen his voice. This doesn’t seem to be Terry.</p>\n\n<p>“You sick lunatic!” Daphne yells. “It’s not enough to use your own son to bait people, now you threaten us with him as well?!”</p>\n\n<p>“What? I’m not threatening you with <em>my</em> son!” the man says in disgust, forgetting to disguise his voice.</p>\n\n<p>This definitely isn’t Terry.</p>\n\n<p>Daphne hasn’t caught on yet. “He’s not even your son?! That’s even worse, you deranged motherf-“</p>\n\n<p>“Daph,” I whisper urgently, “this isn’t Terry.”</p>\n\n<p>“What?!” Daphne hisses back at me.</p>\n\n<p>“Sir,” I call out, “the boy’s name is Benjamin. He’s just a child. Please, tell me, is he safe?”</p>\n\n<p>“Safe from you, yes,” the man says, attempting to regain the falsified, deep voice.</p>\n\n<p>“I don’t understand. What do you want?” I ask, hoping I didn’t already know.</p>\n\n<p>“You are blasphemous and unclean in the eyes of the Lord,” the man replies. “We cannot allow a child to grow up in such immoral conditions. We have saved him and you have been brought here because your vile, ungodly behavior should not go unpunished. You will be cleansed.”</p>\n\n<p>“What on Earth are you talking about, you freak? You don’t know us!” Daphne yells.</p>\n\n<p>Forced, heavy footsteps descend the staircase and we’re greeted with the silhouette of a short, stout man who’s trying to look taller than he is. Despite his best efforts, he doesn’t look physically intimidating.</p>\n\n<p>Yet, being physically intimidating isn’t a requirement if one has other tools at their disposal. He walks up to our cells and slams a baton against the bars, almost striking our fingers. My sister and I release each other’s hands as we draw back.</p>\n\n<p>“I will not allow sinful acts under my roof!” he barks, his phony baritone cracking.</p>\n\n<p>I stare in shock as it dawns on me. “Sir, Daphne here is my sister.”</p>\n\n<p>An awkward pause teases the atmosphere before he says, “All your kind are liars, you’ll say anything to save your depraved skins.”</p>\n\n<p>Daphne finally picks up on the situation. “Sir, I assure you Dora is my little sister. She’s engaged to Benjamin’s father, his only parent after the mother tragically passed away. We were on our way to the father’s car when you picked us up.”</p>\n\n<p>I hide my bewilderment at Daphne’s unnecessary additions as I plaster an earnest expression on my face, nodding while discreetly relocating my thumb ring to my ring finger.</p>\n\n<p>The man isn’t convinced as he growls, “It’s so easy for your kind to deform the truth and make a mockery of natural society.”</p>\n\n<p>Daphne isn’t discouraged. “We believe in natural society and strive to protect it! Dora’s wish is that Benjamin grows up in a complete, God-loving home. Her and the father aim to get married soon.”</p>\n\n<p>The man takes a step back as he mulls my sister’s words. “And you?”</p>\n\n<p>“Oh, I’m with Jordan. A very intelligent PhD student. Brilliant. I can’t wait until we have children of our own and settle in the suburbs.”</p>\n\n<p>I stifle a snort at the blatant lie she ended her story with. Daphne hates the idea of setting down. I’m impressed, though, at how easily she’s rising above the prejudiced insults spewed by this man as she speaks to save our lives. I just hope Daphne’s odd choice of overplaying her act works against this zealot and his pompous pig-headedness.</p>\n\n<p>The man’s demeanor is getting increasingly agitated as he struggles with accepting the truth. “Lying is a sin. Your kind only know of sin and, here, we work to crush th-“</p>\n\n<p>“What you’re doing here should be commended!” Daphne interrupts ardently. “It cannot be easy seeing flagrant sin all around, corrupting our communities. We thank you for looking out for the children.”</p>\n\n<p>I nod as I manage to procure an approving smile.</p>\n\n<p>The man’s shoulders ease up as he sighs and finally speaks with his natural voice. “Yes. It’s a never-ending struggle. They are like a virus. Infecting the vulnerable through schools and media. They brainwash our kids.”</p>\n\n<p>“Oh, I agree,” I chime in. “Maybe you can suggest some wholesome shows and sites for little Benjamin. I can pass them on to his father once you let us go. I’m sure my fiancé is very worried about us and would be thrilled to know Benjamin is safe.”</p>\n\n<p>The man still seems hesitant, but Daphne isn’t giving up.</p>\n\n<p>“Tell me, are there any actual sinners down here at the moment?” she asks with an air of innocent intrigue.</p>\n\n<p>“No, we haven’t caught any for months,” the man sorrowfully replies.</p>\n\n<p>“Perhaps that’s a good sign!” Daphne exclaims. “You’ve cleaned up well!”</p>\n\n<p>The man is quick to correct her. “Oh no, they are sly vermin. They hide in plain sight. But we’ll find them.”</p>\n\n<p>“With your devotion, I don’t doubt it!” Daphne says encouragingly as I nod in agreement.</p>\n\n<p>Thankfully, her passionate flattery does the trick as the man finally unlocks our cells.</p>\n\n<p>“I deeply apologize,” he says. “We acted on the mistaken assumption that you were a homosexual family.”</p>\n\n<p>“Give it no mind, my good man,” Daphne replies, really putting a lot of schmaltz into her act. Her theater background is proving handy. “You’re doing God’s work. How many blasphemous people have you rid the world of so far?”</p>\n\n<p>“We had an unfortunate incident that nearly shook our faith and broke our family apart,” he says before turning his gaze up and vehemently pointing towards the ceiling. “But, with the grace of God, we found our mission. For the past two years, we have purged six couples and ten promiscuous singles. We have saved four children and found them worthy, God-fearing homes.”</p>\n\n<p>As her sister, only I can see the contempt hidden behind Daphne’s awestruck expression. “What dedication! Why haven’t you told the world of your selfless acts?”</p>\n\n<p>“Ah, the world will never understand,” he says, shaking his head. “It’s been corrupt, the purity leeched by the devils of society. These are desperate and trying times.”</p>\n\n<p>I nod. “Indeed, sir, it may be a thankless mission but we’re here to thank you for caring about our youth and community. Please, if you may lead us to little Benjamin, we would love to reunite with his father.”</p>\n\n<p>“Yes, of course,” he says, ushering us up the stairs.</p>\n\n<p>After ascending, a living room is immediately in our line of sight. I spot Benji sitting tensely on a couch in front of a TV, a plate of apple slices on his lap, a glass of milk in his white-knuckled grip, and the arm of a wiry woman around his shoulders. They’re watching Dora the Explorer.</p>\n\n<p>The moment Benji turns and sees me, relief washes over his face, although he’s still too afraid to move. I’m just grateful he isn’t being subjected to anything traumatic, in spite of what the woman looks like.</p>\n\n<p>“Thank God,” the woman sighs exaggeratedly as she hears us. “If I have to hear the brat ask for this horrid show one m-” She turns, only to see Daphne and me standing alongside the man.</p>\n\n<p>She jumps up, but keeps a tight grip on Benji’s shoulder. “What’s the meaning of this, Joseph?”</p>\n\n<p>“Miss Dora! Miss Dora, I’m sorry for hiding!” Benji cries out, teary-eyed.</p>\n\n<p>“Hey buddy, it’s all right!” I soothe. “These people just wanted to talk and now we can go home. Isn’t that nice?” I reach out a hand. “Come, let’s go see your dad!”</p>\n\n<p>The lady digs her claws into Benji’s shoulder as she snarls at me, “Hang on there, you filthy sinner.”</p>\n\n<p>“Marjorie, dearest, we were mistaken,” Joseph explains. “They are sisters, and this boy is the son of a widower to whom this lady is engaged to. The other is married to an educated, young man.”</p>\n\n<p>While Joseph is talking, another lady, not much younger than me, meanders into the living room from the kitchen, holding a bowl of cereal. She leans against the door frame and crunches loudly, observing the scene with subdued curiosity.</p>\n\n<p>Joseph’s words don’t appear to convince Marjorie as she eyes us suspiciously, so Daphne decides to butter her up as well. “This gentleman here, Mr. Joseph, is it? Mr. Joseph explained your mission and we really appreciate the work you’ve been doing. We’re impressed you‘ve taken such direct initiative.”</p>\n\n<p>I fervently nod once again in support of Daphne’s praise and Marjorie, while still looking skeptical, tilts her chin up in a sanctimonious pose.</p>\n\n<p>Heavy footsteps draw our attention and we turn to see an actual, physically intimidating man walk into the room, cradling a shotgun on his shoulder. If we stretch our imagination and say Joseph and Marjorie are the brains, then this guy is definitely the brawns.</p>\n\n<p>Any ideas I had about eluding them and running just evaporated. I guess we’ll have to continue relying on our words. I nervously glance at Daphne and see a bulb flash behind her eyes. I hope her idea isn’t too out there.</p>\n\n<p>“You know, I live in a neighborhood where there’s a house filled with sinners. Benji, bud, you better cover your ears,” Daphne coaxes.</p>\n\n<p>Before Benji can comply, Marjorie has covered his ears for him, a look of curiosity softening her stern expression. Benji tenses up as he looks at me fearfully. I smile and pretend to cover my own ears, winking at him to try and ease his nerves.</p>\n\n<p>Joseph asks a bit too eagerly, “In what way? What have they done?”</p>\n\n<p>&quot;Oh, what haven’t they done?” Daphne sighs dramatically. “Twenty girls living together. All homosexual promiscuous nymphomaniacs.”</p>\n\n<p>Marjorie gasps. “Disgusting.”</p>\n\n<p>“Tell me about it, they’re tarnishing our quaint community!” Daphne exclaims before looking around furtively. “If you promise not to say where you got your information from, I can give you their address and you can help purge our neighborhood from scum like them.”</p>\n\n<p>Marjorie looks at Joseph and he smiles enthusiastically. “Twenty! Marjorie, dearest, can you imagine?!”</p>\n\n<p>He walks over to the cereal-eating lady and shakes her shoulders excitedly. “Jackie, your mistake gave us gold! You were wrong about them but they brought us almost double our entire haul!”</p>\n\n<p>Jackie replies with a smile that doesn’t quite reach her calculating eyes. It makes me uneasy as I wonder if she knows where Daphne is going with this.</p>\n\n<p>Joseph turns towards the man with the shotgun. “We need to get Luke and his group too, we aren’t enough. We’ll need the vans, we can’t have a shortage.”</p>\n\n<p>Joseph’s enthusiasm appears to have rubbed off on Marjorie as she finally let’s go of Benji. He jumps up and sends the apples and milk flying as he runs and wraps his arms around me.</p>\n\n<p>“I’m sorry, Miss Dora,” he sniffles.</p>\n\n<p>“Benji, buddy, this isn’t your fault,” I soothe as I hug him back. “Now, let’s say goodbye so we can go see your dad!”</p>\n\n<p>Benji mumbles a goodbye while his face is buried in my stomach. Marjorie tuts irritably at the mess he left behind but Joseph hastily returns the farewell as he slides closer to Daphne, eager to hear the location of their next prey.</p>\n\n<p>She gives him a winning smile as she lists the address of the vacant house she’s been trying to sell for the past three months. “Now, don’t you say you heard it from me!” she says playfully. “And a tip? Don’t go before midnight. There’ll be too many innocent people around.”</p>\n\n<p>Joseph nods. “Thank you. You are one of God’s angels sent to protect the world.”</p>\n\n<p>Daphne bashfully brushes away the compliment. “Oh my, no, I just feel more confident now that I’ve been influenced by you. We will be anticipating your blessed work, don’t disappoint us!”</p>\n\n<p>I nod yet again, hoping we weren’t laying it on too thick. I just want to get Benji to safety.</p>\n\n<p>“Now, if we could just collect our bags and be on our way. We have to prepare for a charity potluck that aids amputee, cancer-ridden orphans.” Daphne&#39;s resentment is starting to become transparent as she laces her words with sarcasm.</p>\n\n<p>Noticing their lingering reluctance, I speak up. “Ah, yes. The poor children suffer enough without the ugliness of immoral behavior. If, along with our bags, you can provide me with a list of suitable children’s shows and sites, my fiancé and I would really appreciate your guidance in raising little Benjamin without negative influence.”</p>\n\n<p>Marjorie finally goes to fetch our bags as Joseph gives me a meager list of children’s shows and websites I‘ve never heard of. Dora the Explorer isn’t on the list. I guess it was nice of them to allow it to taint their TV set for Benji’s sake, although I’m pretty sure it wasn’t the Dora he was requesting.</p>\n\n<p>Joseph holds our bags hostage as he and Shotgun Man usher us into the garage and slide open the door of the grey, windowless van. I try to innocently stroll to the back and get a glimpse of the license plate, but my wandering makes Joseph uneasy and he blocks me.</p>\n\n<p>“Please get in,” he orders us. “I will drive you to a neutral spot and you can take a taxi from there.”</p>\n\n<p>With Benji’s safety in our hands, we do as we’re told, politely accepting the opportunity to ride in the back of his foul, cluttered van with Shotgun Man for company.</p>\n\n<p>Once the door slams shut, we’re left in the dark. The van begins moving and I try to monitor the trip&#39;s directions, but the multitude of circular turns leaves me lost. This obviously isn’t Joseph’s first rodeo.</p>\n\n<p>We’re sweating and stifled but try our best to keep the atmosphere light for Benji’s sake. We agree to distract ourselves by playing games. Benji suggests “I Spy”, but after realizing that black was the only viable color, we switch to “20 Questions”. After each of us got two turns, not including Shotgun Man, the van comes to a halt.</p>\n\n<p>Joseph is true to his word, dropping us off in a neutral spot that is, apparently, the middle of nowhere. We thank him graciously and he nods, hands us our bags, and peels away. None of us manage to get the plate number in the dark.</p>\n\n<p>“Where the hell are we? Can you believe that asshole? Leaving us here after we practically drowned him with flattery and admiration. Ugh, I feel so dirty…” Daphne dramatically brushes off her clothes.</p>\n\n<p>“Daph, language,” I scold as I hug Benji close.</p>\n\n<p>I look around, the moonlight revealing vague details. “Daphne, wait…I think this is Milner’s Rock! Isn’t that the tree Finn accidentally crashed into?”</p>\n\n<p>Daph snorts. “Are you serious? What does prim and prude Joseph know about Milner’s Rock?”</p>\n\n<p>“Probably one of their hunting grounds?” I guess. “This place is usually swarming with teen love.”</p>\n\n<p>Daph shudders aloud. “Ewwww. Ugh, I can imagine him creeping around, self-righteously leering. Well, there’s no one here now. It’s too hot for any type of intimacy. I’m melting.”</p>\n\n<p>Daphne pulls out her cellphone to call the police. I pull out my own phone and I’m not only surprised to see that it’s 10:23pm but that I also have eighty-four missed calls from Terry. He almost single-handedly drained my battery. I call him back immediately.</p>\n\n<p>“Hello?” Terry’s voice is strained and anxious.</p>\n\n<p>“Hey, Terry! My God, you won’t believe it when I tell you we were kidnapped! My cellphone might die soon, so I just want to let you Benji is safe and we’re calling the police, okay?”</p>\n\n<p>“D- *crackle* -m sorr- *crackle* offen- *crackle* back saf-.”</p>\n\n<p>“Terry, can you hear me? Man, the signal sucks out here. We. Are. Okay. Benji. Is. Safe. Here…talk to him!” I try to make my voice cheery to convey our safety as I hand the phone to Benji.</p>\n\n<p>“Hi Dad!...Hello?...Dad, can you hear me?….Daddy?...I can’t understand you.” Benji looks up at me, frowning.</p>\n\n<p>I take the phone back. “Hello, Terry?” The static is overwhelming and, soon, the call drops.</p>\n\n<p>Daphne is having the same problem as she walks around trying to get a signal. “Ugh, I remember when no signal was a good thing when we’d come up here.  Peace and quiet as we ravag-“</p>\n\n<p>“Okayyy, Daph. Children present!” I announce loudly.</p>\n\n<p>Finding ourselves stranded, we decide to walk down the road towards the city.</p>\n\n<p>After half an hour, approaching headlights blind us. I’m wary about hitchhiking, but my cellphone has been long dead by now, Daphne hasn’t been successful in finding a signal, we’re sweating profusely, and Benji is exhausted, laying his head on my shoulder as I carry him on my back.</p>\n\n<p>Daphne waves the car down and it’s a couple of teenagers who’ve decided to brave the heat in the name of love. They immediately offer to turn around and drive us to the police station. They also generously provide us with their cellphone chargers, water bottles, and even offer Benji a chocolate bar, which he politely declines.</p>\n\n<p>The moment a signal appears, I call Terry again. “Terry, hey! Sorry about the bad signal!”</p>\n\n<p>“Dora, please listen. I’m not upset. Just, tell me, is Benjamin safe?”</p>\n\n<p>“Yes, don’t worry, Terry, he’s safe! We’re off to the police station at [address], okay? Meet us there.”</p>\n\n<p>“As you wish, Dora. I’m very grateful you’re deciding to bring my son back safely. That is a good step in alleviating the situation.” His intonation sounds stilted, like he’s being told what to say, and I frown as I realize what’s happening.</p>\n\n<p>“Terry, I didn’t abduct your kid,” I flatly inform him, causing Daphne to turn to me with a shocked expression. “I know today must have been a parent’s worst nightmare so I don’t blame you for assuming the worst in me. Honestly, Daphne and I assumed the worst in you too, for a moment.</p>\n\n<p>“We were kidnapped, Terry. The three of us. By this crazy family. Don’t worry, we did our best to make sure Benji wasn’t affected and, thanks to Daphne, we made it out. We’ll tell you all about it at the station. We’ll see you soon. Okay?”</p>\n\n<p>“As you wish, Dora. I will see you and Benji soon. Please, may I speak with my son?”</p>\n\n<p>“Sure thing!” I hand the cellphone to sleepy Benji. “Here you go, buddy! It’s your dad!”</p>\n\n<p>“Hi dad....Daddy? Are you okay?” Benji sits up, worried. “A-are you mad at me?...Oh...Are you sad?…I’m sorry for hiding…No, I&#39;m okay…Miss Dora is with me, and Miss Daphne…Yea…We’re in a car now…No, we were in a house…I don’t know….A big van that smelled like Buppy...No…I am…I miss you too…I will see you, right?...Okay…Bye.”</p>\n\n<p>Benji then hangs up, hands the phone back to me, and snuggles close, sighing. The couple driving, who were impatiently waiting for the call to end, excitedly pounce with their questions. We give them the bare minimum for Benji’s sake, although he eventually begins dozing off, so I doubt he would have noticed.</p>\n\n<p>The car pulls up to the police station and we’re suddenly swarmed by police officers. They ask us to come out of the car quietly with our hands up. We all do, including the bewildered couple, except for Benji, who’s hugging me tightly. An officer pulls Benji away from me and he begins crying.</p>\n\n<p>“Benji, it’s okay, they’re police officers!” I call out. “You can trust them! They’re taking you to your dad!”</p>\n\n<p>An officer cuffs my hands behind my back. Daphne and the two teens are also being arrested. I give the couple an apologetic shrug, but they actually seem rather enthralled by the whole thing.</p>\n\n<p>I look around as we are being escorted into the station and am relieved to see that Benji has been reunited with his father, the latter who is giving me a disappointed frown. I shoot one back at him.</p>\n\n<p>…</p>\n\n<p>At the station, the whole mix-up is solved. Daphne&#39;s plan had already prepared the groundwork for a sting operation and the police went with it. They set up the scene and, for a few days, windowless vans staking out the area were greeted with an Oscar-worthy performance of what they&#39;d consider to be flagrant perversion.</p>\n\n<p>After four days, Joseph and his group made their move, and the police were ready. Out of all of them, only Jackie opened up about the family’s disgusting crimes. Turns out, she’s Joseph’s youngest sister and one of the “sinners” they despise. She was the shock that drove her family to amp their mission, and they gave her an ultimatum: convert or die.</p>\n\n<p>It’s a sad story, but she still participated in most of the kidnappings and was aware of the adoptions, “conversion methods”, and murder. At least she knew the victims’ names and where they were buried so that their families could have closure. She also had the addresses of the families that had heedlessly adopted the kidnapped children.</p>\n\n<p>…</p>\n\n<p>As for Terry? Well, he apologized and I forgave him. I have no hard feelings. The incident was so bizarre that, if it didn’t happen to me personally, even I may have doubted its verity. From Terry’s perspective, I was a stranger who disappeared with his child. He didn’t know me. I didn’t know him either. So, we sought to correct that. So far, things are going smoothly.</p>\n\n<p>As for Benji? Well, he’s a smart, resilient kid and bounced back quickly without any lasting trauma, although he did develop an aversion to sliced apples. He was also true to his word and, on our first family date, generously offered me his kid’s meal toy.</p>\n</div>\n","author":"starkframes"}