{"rank":"255","title":"There's something weird about my parents' suit of armor","id":"8lcs2e","url":"/r/nosleep/comments/8lcs2e/theres_something_weird_about_my_parents_suit_of/","time":"1527016973000","body":"<div class=\"md\"><p>A few days ago, Mom came home with a suit of armor.</p>\n\n<p>My parents are constantly buying garish, over-the-top home décor. They think, for some reason, it’ll make our 2000 square-foot colonial look like a mansion. We’ve got a gold-trimmed mirror in the foyer, Oriental rugs in the family room, silver-plated tea sets in the kitchen…</p>\n\n<p>And now a suit of armor in the living room.</p>\n\n<p>Now, because this is Nosleep, you&#39;re probably expecting some terrifying description. Like – it’s an authentic, 18th-century suit of armor that a knight was murdered in. Well… it’s not. It’s a 7-foot-tall piece of crap, cobbled together from scrap metal and sheets of tin. My mom paid like fifty bucks for it at some garden store. <a href=\"https://imgur.com/ilmYRvB\">Here&#39;s a photo if it,</a> if you&#39;re curious.</p>\n\n<p>Anyway, on Tuesday night, it was raining buckets. I woke up around 2am from the sharp <em>crack</em> of thunder, and then I couldn’t fall back asleep. I decided to go downstairs to get a glass of water.</p>\n\n<p>As I reached the last stair, I jumped.</p>\n\n<p>There was the suit of armor. Standing there, in the foyer, in front of the gold mirror.</p>\n\n<p>I shook my head. Dad must’ve moved it last night, after I went to sleep. “You’re going to give me a heart attack,” I muttered, staring at the chink in the metal where his eyes would have been. </p>\n\n<p>I went into the kitchen and got the glass of water. Mr. Whiskers stirred listlessly in his bed. I then started back towards the stairs – but not before smiling at the suit of armor.</p>\n\n<p>“Night owl, huh?” I whispered to him.</p>\n\n<p>Silence, of course, unless you count the rain pattering against the glass.</p>\n\n<p>“Hey, between you and me, you’re kind of handsome,” I said. “I like tall guys. Especially tall, <em>shiny</em> guys.”</p>\n\n<p>I chuckled.</p>\n\n<p>And then I noticed it.</p>\n\n<p>He looked… <em>more</em> shiny than usual. In the overhead lights, the metal of his visor was gleaming brightly.</p>\n\n<p>I walked over, and leaned in.</p>\n\n<p>He was wet.</p>\n\n<p>“Huh, that’s weird,” I said, swiping a finger across his helmet. Sure enough, it came away wet. I looked up at the ceiling – but I didn’t see a leak of any kind.</p>\n\n<p>A few minutes later, I went to bed.</p>\n\n<hr/>\n\n<p>The next morning, I forgot all about my rendez-vous with Sir Knight. I was late for school, and Mrs. Urman was already on the warpath against “senioritis.”</p>\n\n<p>But as I screeched out of the driveway, I was intercepted by our neighbor, Mrs. Timms. I would’ve just ignored her, but she’s super nice. She even gave me 50 bucks as an early graduation present.</p>\n\n<p>“Emily!” she yelled. “Emily, can I talk to you?”</p>\n\n<p>I reluctantly rolled down the window. “Mrs. Timms, I’m late for school –” </p>\n\n<p>“You have a lot to answer for, young lady.”</p>\n\n<p>Her brusque tone caught me off guard. “Uh, what?” I said, suddenly wondering if the red-faced woman was the same gentle-mannered neighbor I knew.</p>\n\n<p>“One of my chickens is missing.”</p>\n\n<p>“I’m really sorry to hear that, but –”</p>\n\n<p>“It’s that damned cat of yours!” she bellowed.</p>\n\n<p>“What?”</p>\n\n<p>“Don’t deny it. Penny’s feathers are right there, in your front yard!”</p>\n\n<p>I turned. Sure enough, a few buff-colored feathers scattered the grass.</p>\n\n<p>“You make sure your damned cat stays inside, or you’ll be sorry,” she growled. Then she stalked back down the driveway, and slammed the front door shut.</p>\n\n<p>I made my way to school, but I couldn’t get my mind off Mrs. Timms all day. While I had no doubts that Mr. Whiskers was innocent (he didn’t have a drop of blood on him), I felt just awful. She loved those chickens with all her heart.</p>\n\n<p>So after school, I immediately ran over to her house. <em>Clack, clack, clack.</em> I swung the knocker hard. “Mrs. Timms!” I called, gripping the box of chocolates I had bought her. “Mrs. Timms?”</p>\n\n<p>No answer.</p>\n\n<p>But I knew she was in there, because I heard the distinctive <em>clang</em> of dishes and pots coming from deep within the house.</p>\n\n<p>Annoyed, I shoved the chocolates into her mailbox and walked into my house.</p>\n\n<p>My parents were at work. I dropped my backpack on the floor, and walked into the kitchen. Pulled out a yogurt, and opened the trash to throw out the top.</p>\n\n<p>That’s when I saw it.</p>\n\n<p>A chicken carcass, lying at the top of the garbage.</p>\n\n<p>Picked clean.</p>\n\n<p><em>Maybe it was Mr. Whiskers,</em> I thought, heart pounding. <em>My parents must’ve found the body, and thrown it away.</em> But somehow it looked… too clean. There wasn’t a drop of blood, a fiber of meat left on the thing.</p>\n\n<p>I shut the garbage and turned away.</p>\n\n<p>There stood the suit of armor in the foyer, still as a statue. </p>\n\n<p>A lone feather stuck to his sword.</p>\n\n<hr/>\n\n<p>It was about 3 AM when I heard the racket and pulled myself out of bed.</p>\n\n<p>A metallic clanging noise, over the sheets of rain, as if someone was banging pots and pans together. Rubbing the sleep out of my eyes, I walked over to the window. <em>What kind of idiot thinks it’s okay to make this much noise?!</em></p>\n\n<p>I parted the blinds and peered out. </p>\n\n<p>A glint of fire.</p>\n\n<p><em>What the hell?</em></p>\n\n<p>I swung out of my bedroom. <em>Someone must have thrown a cigarette in the grass, and it caught fire,</em> I thought. I thundered down the stairs.</p>\n\n<p>As I reached the bottom, my breath caught in my throat.</p>\n\n<p>The suit of armor was gone from the foyer.</p>\n\n<p>I ran to the front door. I grabbed the doorknob, and was about to yank it open, when –</p>\n\n<p>A rumbling, terrible roar shook the house.</p>\n\n<p>Then the house flashed with gold, as a blast of fire pierced the darkness <a href=\"http://blair-daniels.com\">outside.</a></p>\n</div>\n","author":"BlairDaniels"}