{"rank":"22","title":"An App Called Autopilot (Part 2)","id":"8ldi40","url":"/r/nosleep/comments/8ldi40/an_app_called_autopilot_part_2/","time":"1527022277000","body":"<div class=\"md\"><p><a href=\"https://www.reddit.com/r/nosleep/comments/8ktxdr/an_app_called_autopilot_part_1/\">Part 1</a></p>\n\n<p>Hey guys, me again. Let’s get right to it.</p>\n\n<p>So it’s been a few days since I wrote my first account, and I have been abusing the ever-loving crap out of this new app. I’ll be honest, after I wrote that first entry, I was a bit skeptical that I would ever be returning. I thought maybe the whole thing was just a fluke or random lapse of memory on my end. But now I know that’s not the case. </p>\n\n<p>The app is quite the stunning feat of technology if I do say so myself. My memory during the autopilot state is completely blank, and after it’s nullified I feel as though no time has passed. It’s literally like jumping from one moment to the next. Not time travel per say, but it might as well be with how it feels.</p>\n\n<p>My job requires regular repetitive motion which mostly involves picking up boxes and cases and stacking them neatly on a pallet. After the effect of the app wears off, I can feel the lingering physical effects of manual labor on my muscles. My hunger and thirst patterns seem mostly unchanged as well, however my mind never really seems tired. I almost wonder if the autopilot hypnosis works as a sort of micro-sleep for my mind. I never really feel very tired anymore, which is also a nice bonus, but sleep has definitely become a bit more difficult as a result.</p>\n\n<p>Management decided to do a little investigation into the aforementioned bathroom incident. They brought in what seemed like way more people than necessary to try and figure out who the graffiti culprit was. All for nothing though, as they still have no idea who did it, and no one has yet claimed responsibility.</p>\n\n<p>HR has also been tasked in evaluating the mental wellness of each of the night shift employees. Each of us were assigned a time and date for a meeting with one of them in order to just talk about our feelings and shit. The most annoying part about it however, is that it must be done outside of shift hours. This is why I’m not a huge fan of HR in general. Anytime they get involved with anything it just overly complicates everything and accomplishes very little. At least I get paid for the meeting though, but more on that later.</p>\n\n<p>The main boss; this douchebag with slicked back grey hair and an omnipotent pompous attitude came in and spoke to us about the incident. He tried to maintain a calm demeanor and boost morale while also identifying the perpetrator. No luck though, and there was no denying the inkling of disdain on his bloated, wizened mug. </p>\n\n<p>He rounded out the meeting with vague and no doubt empty promises of better shift lengths and a more stable work schedule. Underneath his contrived persona also rested thinly-veiled threats of resolution, but it’s all bullshit. I’ve been here two years and they’ve been promising that, and nothing has changed. If there’s one thing I can always rely upon in my life, it’s the sheer incompetence of my employer.</p>\n\n<p>I’ve of course continued to experiment with the Autopilot app. I decided to take it slow and increase the hypnotic period in small increments. I started on Monday (the day after my previous post) and utilized it in much the same way as I had the first day. Doing 2-hour periods with breaks in between. All the while the time zipped by in much the same manner as my previous account. One second, I’m listening to the binaural beats, and the next I’m jolted back to my senses by the high-pitched alarm.</p>\n\n<p>On Tuesday, I decided to up the ante. I did a four-hour increment which led me directly into lunch. And then continued with four hour increments the rest of the day. My shift was about 14 hours that day, but to me seemed only to last about an hour because of the interval breaks. No side effects of note, and the app still seems to be actually doing what it had promised.</p>\n\n<p>Wednesday I decided to go for the whole enchilada. I set the hypnotic period to ten hours right off the bat at the start of my shift. When the alarm went off, I found myself holding a broom in my hands and sweeping up my assigned aisle. I couldn’t hide the smile which then formed on my lips.</p>\n\n<p>Thursday, I repeated the same approach as Wednesday. I set the alarm to go off after 12 hours but had a slight miscalculation. When the alarm went off, I found myself driving in some vacant lot which I did not immediately recognize. Confused, I stopped my car and used the GPS to determine my location. It turned out I was close to my work, but in a separate plaza about half a mile down the road. </p>\n\n<p>I had never been to that area, hence the initial confusion, but rationalized that my hypnotized mind must’ve just taken an alternative route. Honestly though, I found that notion kind of troubling. The app is supposed to maintain cognitive pattern ability based on memory. If that’s the case, why would my unconscious self take a new route that I had never taken before?</p>\n\n<p>When I got home I also noticed something else. The right-hand side of my bumper was crunched in and the headlight was slightly broken. I had hit something, no doubt about that. No idea what it was, but the evidence was clear as day. I groaned at the sight, knowing I hadn’t the money, time or desire to fix it. Luckily the headlight still works though.</p>\n\n<p>Hopefully whatever it was that I had hit does not possess a security camera in the immediate vicinity. All I can do at this point though is hope I didn’t hit anyone or anything which could be traced back to me. I need to be more careful going forward, I’m sure of that. I’m going to make an effort to calculate my exact shift length a little better. Needless to say, I don’t think it’s exactly safe to be driving around while in a hypnotized state.</p>\n\n<p>I have the copy of my hours sheet in hand now, and as I suspected, nothing is out of the ordinary. The hours clearly indicate that I did indeed do all my work for the previous days mentioned. </p>\n\n<p>Monday: in at 4:03 pm out at 3:12 AM. </p>\n\n<p>Tuesday: in at 3:58 PM out at 5:46 AM. </p>\n\n<p>Wednesday: in at 4:01 PM out at 1:58 AM.</p>\n\n<p>Thursday: In at 3:56 PM out at 2:08 AM. </p>\n\n<p>The hours I work are based entirely upon customer’s orders, hence the variance in shift lengths. But there it is in black and white, clear evidence of my attendance and workload. I even have my incentive sheet, which marks how fast I gather the items and how many cases I accumulate. 2,789 on Monday, 3,306 on Tuesday, 2,467 on Wednesday and 2,913 on Thursday. As you may have guessed though, no memory of any of it. I’ve had no encounters with management to indicate anything out of the ordinary. Well, maybe I have but I have no memory that either so who’s to say? Regardless though it is clear that through my amnesiac states I have continued working and being productive. More productive than usual actually.</p>\n\n<p>On Thursday I also had my pre-shift meeting with the HR representative. I walked into the office to meet a middle-aged woman with short curly hair, glasses and a genuine smile. Her name is Margaret. We got acquainted with one another, and she began to rattle off the questions. Most of them, I assume were similar to your basic psychologist visit.</p>\n\n<p>“How are you feeling lately?”</p>\n\n<p>“Do you like the work you do?”</p>\n\n<p>“Is there any issues that you see that need to be resolved?”</p>\n\n<p>I could’ve gone in depth with each of her questions, but I didn’t. I didn’t care. I knew the meeting was a waste of time, and nothing would likely come from it. I maintained a feigned interest in her questions but offered little response effort.</p>\n\n<p>Don’t know if this is related, but I’ve had quite the bad cluster of headaches the last couple of days. The pressure is usually focused right at the base of my neck. Some days are worse than others, but it’s remained pretty consistent unfortunately.</p>\n\n<p>I’ve been doing a bit of research on my symptoms, and by research I of course mean a visit to good ole Web MD. I put in my symptoms and surprise, I apparently am in stage four brain cancer. That or I’ve contracted some strange parasite native only to Papua New Guinea. Seems like an entirely accurate analysis if you ask me, but for now I’m just gonna grit my teeth and bear it.</p>\n\n<p>Still no luck finding the app online or in the app store. I found a few others with similar names, but none that matched the Autopilot app I know. I browsed around in the app itself, but soon found it to be pretty bare-bones. The only thing on the app itself is the timer and alarm details. There’s not even a publisher name at the bottom of the screen.</p>\n\n<p>The weekend came and went much too quickly, and before I knew it I was on the eve of Saturday and the commencement of another week. I groaned at the thought of the weekend being over again so soon, but at least now I have an ace up my sleeve. </p>\n\n<p>The Sunday work day began, and I found myself in an especially terrible mood. Sunday is normally the biggest and most pain in the ass day of the week, so right off the bat I decided I didn’t want to mess around. I opened the Autopilot app and set the timer for 16 hours, completely forgetting the events of the last attempt in the heat of the moment. The binaural beats commenced, and everything faded away.</p>\n\n<p>Next thing I know, the annoying alarm shakes me from my hypnotized state. I find myself alone in the light of dawn, on a sidewalk somewhere in town. The streets are mostly silent, and only a few cars pass at prolonged intervals. Confused, I glance around and try to ascertain my position. Where is my car? What am I doing?</p>\n\n<p>I pull out my phone to silence the alarm, and notice something incredibly worrying. Blood, on my hands, t-shirt and I can even feel the sticky residue on part of my face. Not a whole lot of it, but more than enough to warrant concern. My heart begins to race as I turn on my flashlight and inspect myself. My hands were bathed in a sticky crimson, but I had no immediate wounds that I can find. That may have been the most worrying thing of all though.</p>\n\n<p>I quickly have a look around the area and soon surmise my location. Luckily, I was close to my apartment, only about three blocks away in this side neighborhood street. But what was I doing there? </p>\n\n<p>I reach my apartment several minutes later and quickly scurry inside. I flick the switch and my eyeballs are violently accosted by a harsh artificial light to which they were not accustomed. Moments later my eyes adjust, and I see the extent of my condition in the bathroom mirror.</p>\n\n<p>Speckles of blood extend from my hands and travel partially up my forearms, while also covering various spots on my shirt. There were no obvious visible cuts or open wounds. My head was throbbing immensely though. I concluded that I must have been in a fight or scuffle of some sort. Why and with who though, I have no idea. I washed it all off in the sink, but then a troubling thought occurred to me.</p>\n\n<p>My roommate Ben, I haven’t seen him in a while now. Normally we don’t see much of each other during the week due to our opposing work schedules, but I didn’t see him on the past weekend either. I searched our apartment and quickly found that he wasn’t here. His car is still in the parking lot, but there is no sign of him being here. I tried calling him, but his phone went straight to voicemail. I know it’s early and he may have just shut it off to be able to sleep, but I don’t know. I don’t want to jump to conclusions, but I’m getting a bit nervous. I hope he’s okay.</p>\n</div>\n","author":"zachariusfrost"}