{"rank":"5","title":"Path of immortality","id":"8ldzwd","url":"/r/nosleep/comments/8ldzwd/path_of_immortality/","time":"1527026174000","body":"<div class=\"md\"><p>Isolated, that&#39;s the only way I can describe my emotions currently. I&#39;ve only been the same for three years so far, and if it wasn&#39;t for my later enhancements I might not have noticed I was different. But they knew I was different, and they weren&#39;t happy about it. I guess when you transcend death you&#39;re bound to make enemies, right? Sometimes Immediately, as if they know the instant you&#39;ve changed, and they make you pay for it, with everything you esteem in your life.</p>\n\n<p>But I guess if I&#39;m going to tell a story it might as well be from the start. The year was 2015, and I was a genetics study, but even then I knew that the future of humanity was at our fingertips. I felt like we were just an arms reach away from immortality and we could all be gods, exploring the universe itself. Oh how naive I was, I wasn&#39;t thinking about the gravity of what I was doing. But once I knew, well I couldn&#39;t not try it. I mean who wants to die? And how it was developed, it wouldn&#39;t keep me from dying, it would only keep me from aging. I was immediately fired from my job (a “Pack your shit and get out, your no longer an employee here.” With no further explanation, despite the discreteness and precaution I took, I chalked it up to coincidence. </p>\n\n<p>It was the next night my house exploded, I was at the bar drowning away my unemployment sorrows, my wife and kids weren&#39;t. We all died in a gas leak explosion per the incident report, I thought it was strange that without finding my body they considered me a casualty, but with me not going and talking to the police after it happened I figured they mucked up their job. I drifted for a while after that, just walking aimlessly, eating crap from garbage cans when I was hungry. I eventually started stealing, I mean who&#39;s going to chase a dead man for theft? I sold what I stole, it quickly got to progressively more expensive items until I no longer needed money.</p>\n\n<p>It was around then when I made my lab. I developed a fungi with all the nutrients I needed that could grow inside my stomach, it could use the fumes as it&#39;s fuel, but as it touched the actual acid it was digested. Alcohol kept it from getting out of hand. However just as I started to feel alive again from the nurturing of my creation, I was descended on, by someone wearing a black suit and sunglasses. He shot me in the chest with a suppressed handgun and left, without saying anything or doing anything else. I&#39;m not sure how long I layed on the ground bleeding, or who saved my life. I awoke in a back alley a few blocks away with stitches in my chest.  </p>\n\n<p>At that point I knew someone knew what I was doing, and was watching me, but how? I hadn&#39;t the faintest idea. There are many things beyond that of what we can see. With knowing that I was a target, an anger instilled itself in me, my family was murdered. I stockpiled supplies in my lab and opted for a reinforced door that you&#39;d have to use explosives to get through. My next project was developed to strengthen my tendons, and to be able to reprocess stem cells to vital organs. Once I achieved the results I was looking for I adapted it for myself, increasing my strength and durability exponentially. </p>\n\n<p>It was around this time I started getting visions and hearing noises and sometimes voices. I&#39;m still unaware if it is an unknown symptom of my enhancements, or something that comes with the new “form” I have. It was very distracting, I quickly made a circlet that monitored and blocked incoming frequencies including quite a few that I&#39;m sure many are unaware of. I then came to terms with the fact that the man I once was is dead, and decided I needed a new name. Nin is my name now, it&#39;s kind of strange naming yourself. I&#39;ve been in my lab for about a year now and am running low on just about everything, mainly alcohol, parts, and research equipment. My problem now, the downfall of what I have achieved, is I cannot leave, my newfound strength fails me, I believe they cemented me in. </p>\n\n<p>If you&#39;re reading this, this is not a plea for help, this is simply a warning. If you choose the path I chose, they will know. They WILL ruin you, they WILL kill you.</p>\n</div>\n","author":"ReallyImAnHonestLiar"}