{"rank":"18","title":"Caught in the Kitchen","id":"8le7dk","url":"/r/nosleep/comments/8le7dk/caught_in_the_kitchen/","time":"1527027792000","body":"<div class=\"md\"><p>I really hope the data transfer can get this out… I&#39;m getting scared... It started earlier this week.</p>\n\n<p>She was squeezing herself through the door, panting heavily while I stood behind her. Once we were in the apartment, I locked the door behind us and she leaned on the large wooden closet and wheezed.</p>\n\n<p>“Take off my shoes, Danny.” she ordered, just as I was about to take the groceries to the fridge. I sighed. I’d learned to keep my mouth shut over the past few months. My face is as blank as I can make it.</p>\n\n<p>“Yes, Annie.”</p>\n\n<p>The apartment is dark and the air is thick and deprived of oxygen. I kneel down on the dirty floor and begin to untie her shoes. My face comes close to her giant belly. It hangs in two folds, spilling out of the ugly blue jeans she’s wearing. I couldn’t remember when I last washed those. She smelled awful, like a mouldy sock.</p>\n\n<p>“Hurry up!” she says. </p>\n\n<p>Her breathing was still heavy. I untied the shoelaces, grabbed her by the heel and she lifted her leg slightly off the floor. It didn’t reach high enough, so I struggled with the shoe.</p>\n\n<p>“Ow! What the hell?!”</p>\n\n<p>“Sorry. I can’t get it off, your foot is too close to the ground.”</p>\n\n<p>“Well you could’ve asked me to raise it more, huh.”</p>\n\n<p>“Could you raise it a bit more?”</p>\n\n<p>She sighed, looking off to the kitchen. I thought to myself then, that she’s probably looking forward to the shitty food we’d bought. She’d made me buy it. Her leg didn’t budge, even though just judging by her face, she was straining more than before. I forcefully took off the shoe, earning myself a huff.</p>\n\n<p>It was the exact same routine every day for more than half a year. I’d wake up in the morning, leave for work, come back to get her and go to the supermarket together to buy more food. More disgusting, shitty junk food. Boxes of frozen pizza, bags of doritos. So many fucking bottles of coke, everything sweetened, cheap and disgusting.</p>\n\n<p>It was putting a strain on my income, but I condoned it. Garbage is affordable, I reasoned, and there’s no way I could afford this much healthy food. </p>\n\n<p>Still, it killed me to see us do this every day, pretending that everything was just fine. We didn’t talk about it so I’d start to fantasize about imaginary scenarios. Maybe if I cooked her a nice meal she’d consider eating better food. I loved her as she was, I’d tell myself, but her being this obese was making our lives so much worse. It seemed to me then, that it would have just taken a little. I became hopeful. Maybe I could do something. Make our lives healthier. Cook healthier food and be happy again. Looking back, it seems like I’d slipped from reality.</p>\n\n<p>A raise would probably be necessary for this plan to work, so that healthier food would be financially viable. The excitement for change and a hearty meal took over and I asked for that raise. The rude, dismissive rejection curbed some of my enthusiasm. Not all of it was gone, though, I was still hoping to ease some better food into our diet.</p>\n\n<p>The last of my wishful thinking vanished when my - admittedly mediocre, but not awful - broccoli risotto was spat out back onto the plate, scooped into the trash and washed down with coke and Cheetos.</p>\n\n<p>Soul crushing? True, but mostly just eye opening. Eye opening to how very much I hated Annie. How very much I hated my fat fucking wife. The feeling was an endless scream inside me, lasting three months straight, with not a minute of pause.</p>\n\n<p>Every waking moment, from the ring of my alarm clock, to the second I laid my head on the unchanged sheets. Being woken up every night by her incessant sloppy munching in her sleep. Helping her with everything while working to sustain us. All of it was suffocating me.</p>\n\n<p>The slurpy noise Annie’s mouth made when she slept was the same sound of her eating. It made me feel sick. After I took off her shoes we went to the kitchen and I made her some microwaved food. She slurped while she ate and the sound reminded me of the night before. The nausea came quickly.  </p>\n\n<p>I couldn’t contain myself so I went to the bathroom. It was my private place, not just because it had a lock, but because Annie was practically unable to fit through the door for the past quarter year. It took her twenty minutes one way the last time she tried and she cried for an hour between passes.</p>\n\n<p>I had to take care of her all the time. She’d text and call me during work and I’d constant help her with getting up and getting dressed, like a small child. It was so draining. So morbid. I even had to help her go to the toilet. Disgusting. I was so tired of literally taking her shit.</p>\n\n<p>Times like these, I went to the bathroom and turned on the shower. I had a little secret. I opened the toilet’s water tank and took out a large plastic bag. Inside it were a few knife sharpening stones and a cleaver in a leather case.</p>\n\n<p>Times like these I take out the cleaver, put the stones on a wet towel on the floor and start sharpening the blade. Call me a nerd, but sometimes while I do it, I say the chant from Lord of the Flies.</p>\n\n<p>“Kill the pig. Cut her throat. Spill her blood.”</p>\n\n<p>Incidentally, there was a fly in the bathroom that day. It flew around, bumping into the light on the ceiling, before finally landing on the toilet seat, looking at me. I stared back said:</p>\n\n<p>“Kill the pig. Cut her throat. Spill her blood.”</p>\n\n<p>I sounded more aggressive than I’d expected. It felt good.</p>\n\n<p>“Kill the pig.” the blade hissing on the 4000 grit whetstone, becoming sharper.</p>\n\n<p>“Cut her throat. Spill her blood.”</p>\n\n<p>My movements become more and more forceful.</p>\n\n<p>“Kill the-”</p>\n\n<p>My phone vibrated, startling me. Messages from my boss from over an hour ago. The temporary shock and fear of getting caught wore off and I was agitated again.</p>\n\n<p>I was being bullied at work. Ever since I asked for that raise, I’d been facing sarcasm and mockery. Constant jabs, sarcastic comments, telling me to hurry up or “I won’t ever get that raise”. Harassment, too, I’d been nicknamed “Danny darling” and slapped on the ass at least thrice working there.</p>\n\n<p>The messages on my phone, sent quite a while ago, hadn’t been received because there was no reception in the kitchen. The signal is weak in the area anyway, but because the previous owner added a layer of insulation to the walls, my phone was more or less useless in the kitchen.</p>\n\n<p>The insulation made the whole apartment hot and stuffy too, but at least I could sharpen my cleaver in peace, confident that Annie would be unable to hear it (though I still ran the shower just in case).</p>\n\n<p>My boss was threatening to fire me again if I didn’t come in for overtime. I was also being blamed for some mess that popped up. Needless to say, I didn’t make the mess, but I was an easy scapegoat. “Danny darlin’ you ought to clean up after yourself.”</p>\n\n<p><em>“Kill the pig.”</em></p>\n\n<p>“You make your wife do all the cleaning at home, too? Poor thing.”</p>\n\n<p><em>“Cut her throat.”</em></p>\n\n<p>“If you take so long they’ll never give you that raise!”</p>\n\n<p><em>“Spill her blood.”</em></p>\n\n<p>I leave the knife and the stones on the floor for later and, seething with rage, return to work.</p>\n\n<p>Five full hours later I’m back home, putting away my work clothes in the hallway closet. We got this particular piece of furniture at a yard sale a few years back. Annie even helped me carry it up when we moved in. It’s large, wooden, and the door is broken from when my wife leaned on it a little too hard. I stood for a moment, spent and sulking, before being interrupted by a piercing voice from the kitchen.</p>\n\n<p>“Danny?!”</p>\n\n<p>I don’t punch the closet. I close my eyes and answer.</p>\n\n<p>“Yes?”</p>\n\n<p>“Danny where the hell have you been? Get in here. Where the hell were you all this time?!”</p>\n\n<p>I step into the room mid-sentence, looking at her face through the thick, dark kitchen air. No windows, just the faint light of her cell phone.</p>\n\n<p>“I was at work.”</p>\n\n<p>“You could’ve bothered to fucking tell me!”</p>\n\n<p>“Sorry.” I say and start to turn towards the bathroom.</p>\n\n<p>“Danny could you please grab me a bite to eat?” I stop and can’t contain a sigh. She stares at me more than usual.</p>\n\n<p>“What would you like?”</p>\n\n<p>“I don’t know.”</p>\n\n<p>I sigh again and pop a pizza in the microwave, impatiently wait for it to finish, then bring the box to the table and drop it in front of Annie.</p>\n\n<p>“Bon Appétit!” I turn to leave.</p>\n\n<p>“Danny, could you please sit with me a bit?”</p>\n\n<p>“I’m sorry, Annie, I’d like to take a shower.”</p>\n\n<p>“I have to take a shit after I’m done.” she argues.</p>\n\n<p>I sit down, watching her and grinding my teeth as she eats. I shake my head when she offers me a piece of the vile looking meal. We say nothing else, but she watches me all the while. There seems to be something else on her mind.</p>\n\n<p>When she’s done I bring over the potty seat from the bedroom, then give her space to do her business. I vomit while cleaning the bucket in the bathroom later. Transparent acidic liquid. It’s 9 PM and I haven’t eaten anything yet.</p>\n\n<p>I sit on the bathroom floor and something seems off. I look around. It’s the only relatively clean space in the entire apartment. The cleaver and the whetstones are undisturbed, and then I notice the broom, knocked over on the floor.</p>\n\n<p>I don’t remember knocking it over, though I was nauseous when I came in carrying the bucket. Had it been like that when I stepped in? Too tired to care, I hunch over my sharpening kit and quietly rub the stainless steel against the Belgian Blue.</p>\n\n<p>Two hours later I was ready to go to bed. I checked the doorframe of the bathroom before I left. I found a scratch in the paint that looked new, maybe a jeans button had made it.</p>\n\n<p>I go to the kitchen and start the process of going to bed. We move her over and change her. I’m really tired so it’s all a blur and I’m asleep the moment my head hits the pillow.</p>\n\n<p>I’m awakened soon enough. The bed is making an awful noise.</p>\n\n<p>“Annie?”</p>\n\n<p>“Could you help me with the toilet Danny?”</p>\n\n<p>Of course. We forgot it in the kitchen. She walks out the door with heavy steps while I muster the last of my energy to get up. I felt hungry and so fucking pissed. Walking into the hallway, I noticed the lights were still off.</p>\n\n<p>“Annie?!”</p>\n\n<p>I stormed into the kitchen.</p>\n\n<p>“ANNIE.” I yelled for the first time in months. It felt good.</p>\n\n<p>The kitchen door then closed behind me and a key swiftly but shakily turned the lock. Then I heard grunting. I stepped to the door and tried the handle, just to be sure.</p>\n\n<p>&quot;ANNIE?! OPEN THE FUCKING DOOR!”</p>\n\n<p>There was more grunting. Then, a loud crash shook the door. The knob turned downwards. I tried moving it, but it didn’t budge. Then it hit me. The closet. She pushed over the huge closet in the hallway. </p>\n\n<p>“WHAT THE FUCK ARE YOU DOING ANNIE?!”</p>\n\n<p>“I’M FUCKING SCARED. YOU WERE GOING TO EAT ME, DANNY!” she is crying, her breathing is heavy.</p>\n\n<p>“What?!”</p>\n\n<p>“I found the knife... Cleaver… thing, whatever. And the sharpeners. You were going to eat me, weren’t you? I heard you say it… I heard you… Kill the pig!”</p>\n\n<p>“What the fuck, Annie? What, why would you think that, you fucking… Let me out of here now!”</p>\n\n<p>“You’ve been looking at me like that. You’ve been looking at me like if I was a pig! You’ve… You’ve been feeding me like a piece of meat!!!”</p>\n\n<p>There was a silence and I felt myself getting more and more detached. I snorted, it was a desperate laugh, though not without its own morbid comedy. She may be a pig but I’m done eating garbage.</p>\n\n<p>“Annie, listen. Please let’s just call the firemen so they can get me out of the kitchen and we’ll talk, okay?”</p>\n\n<p>“I… Danny I can’t, okay?” she starts to cry and I am feeling more and more alienated. I find her absolutely fucking disgusting.</p>\n\n<p>“What? Why the fuck? Could you not shit me right now? I have work in what, three hours!”</p>\n\n<p>“Danny, I’m not…”</p>\n\n<p>“Let me out this instant, you stupid fat bitch.”</p>\n\n<p>This time, the silence was longer.</p>\n\n<p>“Just because you’re a pig doesn’t mean I want to eat you.”</p>\n\n<p>She whimpered when I said that and, despite my constant complaints, she hasn’t said anything since... It’s been six days.</p>\n\n<p>At first I was content to just wait it out. Then, when I realized our frozen pizza supplies weren’t as plentiful as I’d imagined, I panicked a little. After three full hours of struggling I gave up on getting enough reception for my call to the police.</p>\n\n<p>I tried to reason with her for a bit, apologizing, but managed to lose my temper again. It was back to the waiting plan then. She’d need me to help her out eventually. Annie couldn’t do anything on her own due to her obesity. Sooner or later, she’d have to be driven to the supermarket.</p>\n\n<p>Even with my credit card, the money would run out in a matter of weeks, especially since I was probably getting fired before the next paycheck.</p>\n\n<p>I was thus content with waiting. I was, that is, until last night. I’m counting on a data transfer miracle to get this out in time. I woke up at 3:37 AM on my bed made of chair pillows, when I heard a sound that chilled me to the bone. The steady scratches of a knife being sharpened.</p>\n</div>\n","author":"CageVenom"}