{"rank":"12","title":"HAVE YOUR TICKETS READY","id":"8le8lh","url":"/r/nosleep/comments/8le8lh/have_your_tickets_ready/","time":"1527028104000","body":"<div class=\"md\"><p>    My brother died when he was twelve. I was fifteen; and I was supposed to always look out for him. I failed my role, that day.</p>\n\n<p>    He had soccer practice one afternoon, and I would usually go with him and dad: earning my title as “Big Brother.” But I had a new girlfriend. You know how it is with teenagers! All I wanted to do was spend time with her, plan our “happily ever after,” together, and make out. Unfortunately, on this particularly rainy evening, our happily ever after would end with my little brother Tim’s life.</p>\n\n<p>Like I said: Tim and Dad were heading over to the practice field, in our broken-down, little scootabout with nearly bald tires, (it’s a wonder Tim ever got to play sports, considering how broke we were) and they were already running late. Typical. My brother was always a little whiny when it came to everything he wanted. But he was the baby. So, he got a pass. Not around me, though; he knew if he wanted my attention, he would have to be a soldier. A gung-ho, balls to the wall, trooper! When he was with me...he learned tough love. </p>\n\n<p>Well, according to Dad, Tim was complaining about how late they were going to be,</p>\n\n<p>“We’re not gonna get there ‘til everyone else is gone, Da-yud!” he would imitate in that prepubescent Tim voice.</p>\n\n<p>Well, “Da-yud”  looked back to fuss at my kid brother. As he looked back, they were fast-approaching a red light. Dad slammed on brakes. The tires slid, hydroplaning to the middle of the intersection. Another car was zooming on, “trying to avoid getting caught by the light,” my dad would recall. I guess the other light was yellow. That’s my only justification. But, I wasn’t there, so. </p>\n\n<p>The car rammed the rear passenger-side of my dad’s ride. </p>\n\n<p>“He never seemed to slow down!” Dad cried.</p>\n\n<p>Tim’s body...looked like it had been run through a trash compactor. When the police brought me and my mom for. . . confirmation. Dad was in the hospital with three broken ribs, two fractured,  shattered hip and arm. He suffered some internal as well as external bleeding. And a slight case of whiplash. So...he couldn’t exactly make it to the funeral. </p>\n\n<p>The driver of the other car survived the crash. He resided in the same hospital, on a completely different floor. Intensive Care Unit. The asshole wasn’t going anywhere fast now. Except, maybe Hell.</p>\n\n<p>    A few weeks after the funeral, after fasting over my failings as “Big Brother”, I began hallucinating. I’d see Tim in the hallway, at my bedroom door, in the middle of the night. He wasn’t abandoned model clay, anymore though. He was just. . . Tim. </p>\n\n<p>A lot of times, I’d see him so clearly, that I would forget about the accident. I’d forget he had ever left; </p>\n\n<p>I’d ask him, “What’s up, buddy?” or “Tim? What’s wrong, man?”</p>\n\n<p>Because, every night, when I’d see him, he’d have a somber expression across his face. It almost seemed like it was painted on. The dimension and detail was there; there was simply no emotion. </p>\n\n<p>Some nights, I’d get up and walk towards him. As my eyes adjusted to the light . . . or dark, he would disappear. It was just like in the movies. It was creepy as hell. Then, some nights, when I approached the apparition, he vanished; but it felt more like a dream. </p>\n\n<p>“Maybe you were sleepwalking. . . “ my mother would suggest between muffled sobs. </p>\n\n<p>I tried explaining to them, that he’s been coming to me almost every night for the past few weeks. </p>\n\n<p>“Listen,” they’d sit down with me, “we know this has been hard on you! It’s been hard for all of us. You aren’t the only one who misses him, you know.”</p>\n\n<p>I stopped talking to them after a while. Isn’t it just like parents to make a shitty situation even shittier? </p>\n\n<p>“Whatever,” was my new catchphrase. Or, at least, that was when I started using it, like every other brooding teenager.</p>\n\n<p>    I began waiting up for my brother to show. I wasn’t exactly sure if it worked like that, but I literally had nothing to lose. My parents didn’t believe me. I had left my girlfriend after the wreck. I abandoned my friends. So. Fuck’em.</p>\n\n<p>Surely enough, though, just as I was sitting awake in my room, anticipating the arrival of my unforgotten sibling. . . he didn’t. I sat there. I watched the doorway. I looked at the clock: 1:16 AM. This was typically the time I’d awaken to my brother’s presence. But he was AWOL. But what did I do? I waited longer!</p>\n\n<p>1:30 AM: Nothing.</p>\n\n<p>2:00 AM: Nada</p>\n\n<p>2:45 AM: Absolutely, not a goddamned trace!</p>\n\n<p>“Maybe I am just crazy,” I thought to myself. Still. . . I stayed awake. </p>\n\n<p>3:17 AM: Eyes got heavy.</p>\n\n<p>I didn’t care. It wasn’t like I needed to go to school the next day, anyway. I would just sleep in.</p>\n\n<p>3:18 AM: I was gone. My mental will was not stronger than my physical urge to rest. But I realized. . . that was alright.</p>\n\n<p>3:19 AM: There he was. Standing at the threshold to my bedroom. </p>\n\n<p>His painted expression glitched. This was new. Different. Unsettling.</p>\n\n<p>“Spence.” His lips didn’t move. But it was his voice; and his. . . expression. . . glitched. . .</p>\n\n<p>I wanted to speak. I even tried. It hadn’t been this difficult before. But to hear his voice. . . coming from his being. . . just sort of caught me off guard.</p>\n\n<p>“H-hey, Tim!” I was shocked that that just blurted out. But have you ever thought about something so hard, that it just jumped out of your mouth? That’s what that was, I think.</p>\n\n<p>“Hey, Spence.” He giggled. Still, with a voiding veil throughout his visage. </p>\n\n<p>“What-” I stammered, “What have you… you been up to?”</p>\n\n<p>He moved. Forward. Yet, he never moved;  if that makes sense. Probably not.</p>\n\n<p>Whatever.</p>\n\n<p>His nearly whole body showed grey and blue with the light from my window. The back of him lit up more vividly, but more distortedly, from the hall’s luminescence. It was almost like he was reflecting the glow from behind him. . . like a camouflage. His face glitched, again: only this time I could see a smile pixelate from it. It sounds weird, I know. But if I came out and said “he was holographic,” then it wouldn’t even come close to being accurate! So, imagine him as one of those articulating, wooden models; then picture someone putting highly detailed decal-sticker of a face: eyes, nose, mouth, moles: everything so perfect about him, and it being completely imperfect! But. . . his voice. . . and now his smile. . . this was my little brother! This was Tim!</p>\n\n<p>“You don’t have to be afraid of me,” his voice soothed the air with a brisk low tone. “It’s just me.” He shifted, motionlessly, again. His smile blanked itself away.</p>\n\n<p>“No, Tim.” I assured him, “I’m-I’m not afraid of you!” I laughed nervously, “You know me: I don’t get scared.”</p>\n\n<p>I stood up, cautiously. I wanted to run to him! I wanted to hug him! But. . . he disappeared the last few times. . . I didn’t want to have to wait a whole 24 hours before I could see him again. Granted, I was legitimately scared out of my senses. But I couldn’t let him see that. I shambled, exhaustedly towards him, still at yield. And as I drew in, his. . . existence became more hollow. More transparent. The blues and greys turned into more of a reflective primer; until I made it right to him. When I got in front of him, he was gone. </p>\n\n<p>I stumbled to my knees, into the doorway. I pounded the carpet with my fist, just knowing I screwed up! No matter how many times I let him get away from me, I was still so selfish that I tried it one more time just so I could hold him! I regretted this, mostly, because I never took the opportunity to embrace him when he was alive. I resented myself, because I failed him when it mattered!</p>\n\n<p>I buried my face into the shag, in an attempt to dry my silent tears and choking gasps. </p>\n\n<p>“Big Brothers don’t cry,” I’d tell Tim when I got scolded for whatever I might have screwed up, or even when I broke my leg playing football.</p>\n\n<p>“Big Brothers don’t cry,” I repeated to myself, trying to stand back up. </p>\n\n<p>I walked to my bed with wet cheeks, but was halted. . . by the blues. . . and greys. . . and reflective primer in the form of an articulating mannequin sitting, back against the wall in the center of my bed. I was halted. And I remained there,</p>\n\n<p>“You’re-” I gulped down the dissolving lump in my throat, “You’re back!”</p>\n\n<p>His glitchy image was all but new to me, now. I watched the sides of his face extend, in such a frame-by-frame motion, I was almost sickened. But as it manifested into that Little Brother Smile, I couldn’t help but feel a sleepy sense of calm immediately after.</p>\n\n<p>“I didn’t go anywhere,” he giggled again.</p>\n\n<p>I sat on the floor.</p>\n\n<p>“Why do you keep coming to me, Tim?” I asked with a shutter, realizing how cold I must have seemed. Especially when his head glitched slightly to the left, mouth, partially opened, and eyes glimmering widely in the faint light.</p>\n\n<p>“I mean,” I corrected myself, “No matter how many times I tell mom and dad that I see you, they never even try to believe me! Why don’t you go show them you’re real!?”</p>\n\n<p>He vaguely shook his camouflaged head “I can’t go to them. They don’t want to see me.” </p>\n\n<p>“What do you mean, kid? Of course, they do!”</p>\n\n<p>“No, they don’t!” he raised his voice. I heard him do this, plenty, when he was alive. There was no doubt in my mind that this was my Baby Brother.</p>\n\n<p>“OK! OK, buddy. Then keep your voice down,” I chuckled, shaken. </p>\n\n<p>“What is it, pal?” I asked, standing back up, “What do you want me to do?”</p>\n\n<p>“I don’t know,” he began to whimper, “I don’t know why I’m still here.”</p>\n\n<p>“Well, there has to be some reason, Timmy.”</p>\n\n<p>I began walking towards him again, “If I come sit with you, you’re not gonna disappear again, are ya?” I tried to laugh to settle my nerves. Maybe it would help him feel better, too.</p>\n\n<p>He shook his head.</p>\n\n<p>I made it to the bed, and looking at that bending light through my grey,  little brother, I felt sick again. My body...my mind...knew this wasn’t natural. </p>\n\n<p>“This isn’t normal,” I guess I breathed aloud.</p>\n\n<p>“I know.” He sniffled.</p>\n\n<p>I sat beside him and looked into those electric eyes as they glowed downward. I leaned against the window above my bed, and just watched him. We didn’t talk, much more. We just sat there; and we were at peace.</p>\n\n<p>    The same thing happened the following nights: we said “hi”, and enjoyed each others’ company. I was satisfied with that. Then, the more we stayed together, the more he began to look more like himself. He moved more fluidly. . . there were no more pixels or glitching. I almost forgot his disposition. I would occasionally ask if he’d ever figured out why he was still around, and he’d just shrug. I know it doesn’t sound it, but I thought it was kind of polite. What’s the etiquette to talking with ghosts? I don’t think that was one of my high school extracurriculars!</p>\n\n<p>One night, though, I asked him, “So, what are you still doing here?”</p>\n\n<p>And he said something I never expected to come from his mouth, “They said. . . “ he hesitated for so long, “. . . I need somebody to come with me.”</p>\n\n<p>The hair on my arms stood on end, but I laughed, “What are you even talking about, kid?”</p>\n\n<p>“They said I can’t go with them until somebody comes with me!”</p>\n\n<p>“OK! OK! Calm down, buddy! Who said that?”</p>\n\n<p>“The Soul Keepers,” he looked at me with his bright eyes, now dimmed with distress. “Who else?”</p>\n\n<p>“I’m sorry, Tim,” I stared at him with a smirk, “I don’t have friends like you do.”</p>\n\n<p>He nodded. “Yeah. The Soul Keepers told me I need to take more people with me:</p>\n\n<p>‘Think of it like a carnival ride,’ they said, ‘the operators can’t start the ride if there aren’t enough riders!’</p>\n\n<p>“They were weird!”</p>\n\n<p>I laughed again, then inquired, “Oh! OK! So, you just have to wait for more ‘riders’ to join you; well, I’m sure several people have ‘cashed in their tickets’ by now. Don’t you think that would be enough?”</p>\n\n<p>He shook his lowered head, again, “No. It’s got to be certain ‘riders’. People who were supposed to ‘get on’ when I did. The people who are responsible for my ‘riding’.”</p>\n\n<p>I couldn’t laugh anymore. </p>\n\n<p>“And who are those people supposed to be?” I asked.</p>\n\n<p>He looked at me, “You know who they are.” </p>\n\n<p>Then just like that, he was gone. Again!</p>\n\n<p>But now, my head was full of names of “the people responsible” for my little brother’s death. And I knew all of them.</p>\n\n<p>The Driver of the car who hit them.</p>\n\n<p>My dad for not paying attention.</p>\n\n<p>My ex-girlfriend who kept me from being there for Tim.</p>\n\n<p>    I didn’t see Tim again for a week. Well, I didn’t see him until I went to see the driver of the other car, at the hospital. He had recovered well enough to be moved to a real room, a couple of weeks, prior. I remembered his name. I got his information. I went to see him in his room. </p>\n\n<p>I had picked up a complimentary ink pen out of the lobby. I knew this would be messy, but I had to do it. I had to clear my brother’s list.</p>\n\n<p>He slept. Almost. . . peacefully. </p>\n\n<p>“Are you kidding?!” I thought to myself, as I watched his chest crest and cleft, like the murderous waves of the rippling ocean.</p>\n\n<p>“How can you sleep, knowing you took the life from a twelve year old boy?!”</p>\n\n<p>I ejected the pen, and moved right next to the evil slumberer. I hovered it over his swelling jugular. Then lightly placed it onto the dimple in his neck. I lost the patience to hesitate, and thrust it into his neck. As the sharp pain startled the bastard awake, I grabbed the pillow from behind him and shoved it over his face. This drove the writing utensil deeper, and absorbed the blood as he suffocated. I kept the pressure over his face until his monitor flat-lined. I rushed out of the room shortly after. I knew I would get caught, soon; but not until I finished off Tim’s fellow ‘Riders’.</p>\n\n<p>    I swept myself to my ex’s house, and text her to come outside. She did, and I took her for a walk. We went to the park, the whole time, I ignored her questions of why I was so sweaty. And if that was my blood. And if I was ok. And blah blah blah!</p>\n\n<p>I pulled her behind a tree and kissed her. Grabbing her by the sides of her head, as if to give her the most passionate and soul-burning arousal a teenage girl would ever experience. As I pulled away, her head still in my hands, I looked into her amorous eyes. They were brown and gleaming. Her smile reflected her affection. . . I pushed her skull into the tree. Her eyes rolled, senselessly around her now swollen sockets. Her face turned purple from the sporadic rush of blood to the front. I smashed her against the trunk again. And again. And again! She must have bitten her tongue at some point, because the last time her cranium hit the bark, a mass of flesh jumped onto my face. My knuckles had started to bleed from scraping the wood. I didn’t care. I sat her down onto the roots, and kissed her puffy, bleeding, blue lips.</p>\n\n<p>I ran home.</p>\n\n<p>    My dad rolled himself into his bedroom in his wheelchair, only to find me sitting on the edge of his bed. I held his .38 special revolver in my hand.</p>\n\n<p>“What are you doing in here?” he demanded.</p>\n\n<p>I raised myself up with the gun pointed, eagerly at his chest. He raised his good hand.</p>\n\n<p>“Son,” he began to bargain, “put that thing down. It’s loaded.”</p>\n\n<p>He maintained a sort of calm demeanor as the muzzle poked the buttons on his shirt. I don’t understand how. At this point, I would have been pissing all over myself; squalling, begging for my life. But not him. What the hell kind of monster isn’t even afraid that his son is pointing his fully loaded six-shooter directly at his heart. He didn’t deserve an explanation. . . Even though he asked,</p>\n\n<p>“What’s going on? I know Tim’s death has been difficult, but please! Put it…”</p>\n\n<p>I shot the gimp. Blew him backward about a foot. No. He didn’t die. He just stared at me. In awe, I suppose. He must not have felt it. So, I pressed the heated barrel to his wound, and watched him writhe. For a few moments, he understood exactly what the “ticket to ride” really costs! His eyes drooped closed. And his head fell. The expression of agony still. . . painted across his face.</p>\n\n<p>My brother appeared right next to him, with that beautiful and innocent smile that I missed for so long! He walked, not glitched, up to me, and touched my leg.</p>\n\n<p>“Big Brother?” he requested.</p>\n\n<p>“What is it, buddy?” I smiled with a tear.</p>\n\n<p>“There’s still one more responsible. And one seat left.” He giggled.</p>\n\n<p>I looked down at my sweet baby brother, “I know, Tim. I know.”</p>\n\n<p>I put the gun beneath my chin and pulled the trigger.</p>\n\n<p>...BLACKNESS…</p>\n\n<p>I didn’t see a carnival. I didn’t see the other “riders”. I only saw Tim. </p>\n\n<p>He glitched. And spoke. But it wasn’t his voice. The glitch wasn’t the same. It was like he was stuck. . . like he couldn’t respond. He was. . . taller. His face. . . didn’t hold the same “painted expression.” It showed like a television screen, with Tim riding a carnival ride. With my dad. Behind them were my ex and the other Driver. They were already excited to get the ride going!</p>\n\n<p>The screen closed-up to My Little Brother. He said, “Thank You, Big Brother.”</p>\n\n<p>I teared up. The screen went black. As did the room. Then, I saw lights. Carnival lights. And they spelled out. </p>\n\n<p>“WELCOME TO HELL: Have your tickets ready”</p>\n</div>\n","author":"JGWillikers"}