{"rank":"22","title":"They Came From the Sky and Stayed in the Sea Part 3","id":"8lealv","url":"/r/nosleep/comments/8lealv/they_came_from_the_sky_and_stayed_in_the_sea_part/","time":"1527028559000","body":"<div class=\"md\"><p><a href=\"https://www.reddit.com/r/nosleep/comments/8ha5ac/they_came_from_the_sky_and_stayed_in_the_sea/\">Part 1</a></p>\n\n<p><a href=\"https://www.reddit.com/r/nosleep/comments/8iz8dg/they_came_from_the_sky_and_stayed_in_the_sea_part/\">Part 2</a></p>\n\n<p>Meeting Sophia was almost surreal. Upon arriving and signing in as a visitor, I was led to a day-room. There were large windows that flooded sunlight over small tables and chairs, some occupied but most vacant. The room itself had two obtuse angles on one side, giving it a more rounded appearance. I was pointed in the direction of one of those angles, to where a woman sat alone in a rigid looking armchair. She had her legs curled up with her feet pressing against the inside of one side of the chair while she leaned over the opposite arm of the seat, sketching in a thick book. As I approached her, I recognized the book as a generic spiral sketchpad, the type you can pick up almost anywhere. </p>\n\n<p>I stopped and stood in front of her awkwardly, suddenly unsure of what to say. After a silent moment, her languid movements ceased and she lifted the pencil from the page as she looked up at me. The resemblance was immediate and uncanny to my eyes. There was no doubt that this woman was closely related to my mother. The obvious differences I noticed right away were that she was very thin and had soft green eyes. My mother isn’t very large but she is nowhere near skin and bones or even possesses the small frame that I thought I alone had the monopoly on in the family. Her eyes are also a gray-blue like mine and as far as I can remember, no one else on her side has green eyes.</p>\n\n<p>“Yes?” The woman asked me.</p>\n\n<p>“Sophia?” I replied although I was already certain about the answer.</p>\n\n<p>She nodded slowly in response.</p>\n\n<p>“Hi,” I took a deep breath and let it out. “I’m Brooke. May I sit down?”</p>\n\n<p>Her eyes widened and sparkled with recognition and she nodded quickly, motioning to the empty chair beside her, “Yes, please! Oh goodness, Brooklyn, you’ve grown up!”</p>\n\n<p>“Yeah,” I answered while seating myself with a shy smile.</p>\n\n<p>“I can’t believe it’s been so long since I saw you last,” Sophia mused.</p>\n\n<p>“Yeah,” I said again. “I have to be honest, I don’t remember you at all.”</p>\n\n<p>Her smile faltered for a moment as her face flashed with a pang of hurt and what I can only assume was a bit of guilt. She shook her head slightly as if to physically rid herself of the sting. Her smile returned and she looked me over with bright eyes.</p>\n\n<p>“Well, it has been a long time. So many years… How’s Jenn doing?” She asked me, her mind seeming to fight against memories in order to keep her in the present.</p>\n\n<p>“Mom’s… she’s okay, I suppose. Everything has been pretty rough lately,” I answered. I wasn’t sure how much my aunt knew about the current family situation. I didn’t even know if she had been notified of her parents’ passing.</p>\n\n<p>“She’s strong. She always has been. Me, on the other hand…” Sophia trailed off for a moment with a sheepish shrug. “I think if I was out there, I would have ended up in here when Dad died. We were all so close at one time, you know? That changed when I came here. I became a distant member of the family and the relationships just kind of fizzled. I think that’s the only reason I’m not in worse shape now.”</p>\n\n<p>“So you know?”</p>\n\n<p>“Yes, of course. Jenn came to visit me a few times over the past few years and she let me know what was going on. I was expecting it when she told me that Mom passed away and then it wasn’t a complete surprise when Dad’s time came, either.”</p>\n\n<p>“I’m sorry.”</p>\n\n<p>“What? No, no, no. I’m the one who’s sorry. With as much as they adored you, I’m sure you were close and you must be hurting so much.”</p>\n\n<p>I shifted in my seat and looked down at my hands in my lap, “Yeah…”</p>\n\n<p>“Hey,” she leaned forward and touched my hand. I looked up at her, looking at her through eyes that were fighting back tears. “It’s okay to mourn.”</p>\n\n<p>I nodded and we sat in silence for a moment. Looking back on it now, I’m sure she was probably lost in reverie just as I was.</p>\n\n<p>“So,” she clapped her hands together lightly. “What brings you here today? Not that I mind, I’m rather excited, but after all these years, I can’t help but wonder.”</p>\n\n<p>“Well, if I’m honest about it, I want you to first promise me that you won’t be angry with anyone.”</p>\n\n<p>“Why would I be angry?” She asked. I gave her a tight-lipped, pleading look. She nodded, “Okay, I promise.”</p>\n\n<p>“Alright, well, I didn’t actually… know about you,” I spoke with drawn-out words, unsure of how I would explain it without her feelings getting hurt. Surprisingly, she just looked at me with an attentive expression and not a hurt or upset one that I was expecting. I continued, “I didn’t even know that I had an aunt until Mom and I were cleaning out some stuff and I took home a bunch of books to keep. One of them was hollowed out to hide a journal.”</p>\n\n<p>I watched as her expression changed from calm to slightly alarmed. She stared at me with wide eyes and I suddenly felt ashamed for reading something so private.</p>\n\n<p>“Did you… Please tell me you didn’t…” Her voice was soft but trembled as she struggled to form the words.</p>\n\n<p>“Yes… I read it,” I admitted to her. Instantly, her face softened and she looked at me as one might look at a wounded animal they know there is no hope of saving.</p>\n\n<p>I searched her eyes, trying to find unspoken answers. I wasn’t sure how to handle this anymore, not that I really had an idea before. It made sense to me for her to be angry or feel violated but I never expected her to possibly feel bad for me. Thoughts raced through my mind as I tried to theorize why reading her journal would make her look at me that way. A line from a movie rattled across the front of my brain as if it were playing right in front of me: “Yeah, no harm ever came from reading a book, either. Remember how that one went?”</p>\n\n<p>“Have you seen them?” Sophia finally broke the silence.</p>\n\n<p>“Them?” I asked. She turned her attention to her sketchbook that still sat on the wide arm of the chair and began flipping through the pages previously used. When she got to one near the beginning, she handed me the book and I looked at the graphite drawing. It was hard to make out any sort of shape amongst the smudges and shading but when I stopped trying to look for details, I realized that the subjects of the image didn’t really have a shape. Smoky blobs similar to images I had seen of amoebas covered the page. Tentacle-like tendrils reached out to the edges, seeming to almost try to breach the paper world that they belonged to. Amongst the darkened amorphous forms, white was speckled like a black and white drawing of a night sky in a place with no light pollution. These were the creatures that she had dreamt of those years ago, the ones that came from the sky and invaded animals, leaving ice in their veins.</p>\n\n<p>“I don’t know,” I told her after examining the page.</p>\n\n<p>“What do you mean you don’t know?” She demanded. The lightness that I had seen only a moment ago seemed to turn dark and her edges became sharper with obvious panic.</p>\n\n<p>“I just, maybe,” I stammered and looked from her to the page and then back to her. “I’ve had dreams but it’s usually something else. I think I’ve seen these things in the distance but I can’t be entirely sure.”</p>\n\n<p>She took the book from me and sank into her chair as far back as she could. I got the impression that if she could disappear into the cushions, she would have. Her face turned to look out of the window next to us and she stared outside, barely moving. If not for the steady breaths she took, I wouldn’t have been sure she was still alive or anything more than an incredibly crafted sculpture.</p>\n\n<p>I’m not sure how long we sat there without speaking. It felt like half an hour at least, before I was finally able to muster up the courage to say something. I wasn’t sure just what to say but I felt that I needed to break the tensioned silence somehow.</p>\n\n<p>“Sophia?”</p>\n\n<p>“Hmm?” She responded without moving.</p>\n\n<p>“You seem like you’re doing okay; why are you here still?” I blurted out without really thinking about what I was asking.</p>\n\n<p>She turned her head slowly to look at me once more and studied my face before responding, “I never stopped having the dreams. And after what happened in that place…” She shook her head instead of finishing her sentence.</p>\n\n<p>“In the cove? What happened?” I prodded.</p>\n\n<p>“No,” she shook her head firmly. “The less you know the better. I think you need to go.”</p>\n\n<p>I was taken aback by her request and gaped at her for a moment before standing and nodding dubiously, “Okay. I’m sorry if I-”</p>\n\n<p>She cut me off with a wave of her hand as she stood up. My aunt Sophia wrapped me in a tight hug and held me for a few seconds before kissing my cheek and sitting back in her chair. She began to stare out of the window again and I took my leave, making sure to leave my phone number with an orderly in case Sophia wanted to contact me.</p>\n\n<p>That night the dream changed again. Instead of waking up after I saw the heartbreaking horse, I became engulfed in a darkness that seemed to ebb around me until I was no longer on the beach, or really anywhere for that matter. It was frigid but I felt as if I was the reason for the cold. My body felt as if it was emanating an icy aura from deep within, pushing against and overtaking any warmth in myself and the air surrounding me. Drum beats sounded from somewhere not too far off and a soft melodic chant mixed itself among the steady rhythm. Instead of an abrupt ending, the sounds faded continually until I could no longer hear anything but the tinnitus ringing in my ears. After a short moment, I woke up to my own dark bedroom.</p>\n\n<p>On Thursday, I received a call from my mother who had just tried to contact Sophia. When she phoned the facility in order to speak to her on the phone, she was notified that Sophia Campbell had checked herself out of their care on Tuesday, the day after I met her. They didn’t say why and couldn’t tell Mom very much but from what she gathered, it seemed that they had no reason to worry about Sophia’s safety to herself or others and that she was released without a problem.</p>\n\n<p>Of course, my mother questioned me about what the visit entailed and how she seemed. I told her the truth and said that she seemed fine until I mentioned the journal. I didn’t share with her that I have been having dreams similar to Sophia’s, though, as I didn’t want her to begin worrying about my safety or sanity. We both agreed that although she still seemed frightened by her own nightly visions and experience at History Look Cove, there was no other indication that she shouldn’t be allowed in the public world. Mom told me that Sophia’s stay was by her own choice more than anything and it had been for a while. What really worried us about her sudden decision to leave was that she hadn’t been out in the real world for most of her life and she didn’t tell anyone on the outside that she was even considering it.</p>\n\n<p>There wasn’t much either of us could do aside from trying to keep an eye out and ask the psychiatric facility to notify us if she came back. A call to the police only proved fruitless, as she wasn’t considered a danger and all they could do to help was create a missing person’s report. So we</p>\n\n<p>were left with a heavy dose of anxiety and confusion but hoped that Sophia would make contact soon.</p>\n\n<p>I wasn’t expecting the dreams to change so soon but Friday night brought something new that I interpreted as a possible clue to the situation.</p>\n\n<p>Again, I was on the beach of the cove but unlike the previous dreams, there were no animal noises to be heard; the gentle rolling and crashing of the waves was the only sound. When the ground began to quake, I stood up and watched with expectation as the water roiled before the charred coral island rose from the depths as it had every night prior. The creature appeared and slipped into the ocean, swimming in my direction. With each dream, I found myself able to stand the sight of the being more and more. By this dream, it no longer instilled the same fright in me as it had the first or second time. I was still terrified, but it was a deeper rooted horror stemmed from the danger that I seemed to feel in its presence and not from the sheer sight of the rotted mess of the unnatural animal.</p>\n\n<p>It opened its maw and let out the unearthly bellow that rattled my eardrums and shook me to my core, inevitably causing me to fall to the ground in pain. My eyes closed and opened to the beach void of the creature. The pile of seaweed-worms in its place continued to twitch and writhe. When I noticed the amoeba-like forms that Sophia had drawn, I felt as if I could see them more clearly, unlike any human should be able to see at that distance and in the night.</p>\n\n<p>The rotting horse was there, on the cliff, looking down on me, as well, but this time, it wasn’t alone. Next to the horse, with a hand placed against its neck, was Sophia. She stood high above me, looking out over the ocean for another moment before turning her head to look down to the beach, to me. Her face was twisted into a heartbroken façade and she looked like tears were glistening on her cheeks. The horse, a mare, shifted next to her and I saw her hand slide down to an open wound in the animal. At first, I could not be sure if she noticed that she was now touching torn flesh but I quickly realized that she knew what she was doing. Her hand gently slid inside the horse and I watched it bob its head and stomp but stand in place as she pushed her arm until it was submerged inside up to her elbow.</p>\n\n<p>Sophia stroked the horse’s cheek with her free hand while she seemed to dig around inside of it. I was sickened at what she was doing and flabbergasted as to how the horse was allowing her to do it. My attention was stolen away by something tickling my feet.</p>\n\n<p>When I looked down, I realized that slimy green flatworm-like creatures had surrounded me where I knelt and were beginning to wrap themselves around my feet. The ones in front of me slithered and began to slide up my knees. Desperately, I tried to stand but they stretched out and darted quickly to cover my calves and hold me down. I grabbed at one and tried to yank it off of me. In response, I heard a hiss similar to steam and felt a small shock of electricity localized to the area of skin the one I had a hold of was touching. Were these some sort of electric eels?</p>\n\n<p>The raw creatures continued their assault, leaving prickly shocks along my body as they worked their way up to cover as much of me as they could. My hands were rapidly held in place and became immobilized by the strangely strong things. When one began to snake its way around my neck, I looked up at where Sophia and the mare stood. She began to pull her arm out of the decaying hole and I saw the oily ooze drip from her arm, the same that had covered the monstrosity that approached me from the water. Her hand was now curled into a fist, clutching a dark, greasy mass of what I could not even begin to guess. She brought her clean hand to her mouth and blew me a slow kiss before bringing the mass to her lips and taking a bite. Shiny oil dripped down her chin as she chewed it and shoved more into her mouth before she even had the chance to finish the first bite. In less than a minute, her hand was empty.</p>\n\n<p>My breathing became labored as the thing around my neck tightened and began to cut off my airway. The familiar icy feeling began to pulse through my veins but I attempted to ignore it, determined to focus and call out to Sophia. I opened my mouth to yell to my aunt but nothing came out, the words choked off by my new slimy organic scarf.</p>\n\n<p>Sophia took a step back, then another, and I watched as she vanished into the tree line. Abandonment gripped my heart for a split second but then I saw her form dart from the trees and launch itself off of the edge of the cliff. The act wasn’t in slow motion and her fall didn’t take longer than typical time. In an instant she was standing there, alive on the cliff, and the next, she was crashing into the demonic island. I was glad that I couldn’t hear the breaking and cracking of her bones, as the sight of her body becoming limp and mangled was too much to bear. Tears stung my eyes and I closed them tight, still fighting to even breath.</p>\n\n<p>Drums sounded in the distance and I heard the same melodic chant from before begin. Pressure left my body and I opened my eyes, expecting to be covered in darkness and seated in a dark void of ice and emptiness. I found myself still on the beach, however. The sea-worms were retreating to the ocean and in the distance, I could see shadows twisting and hovering around where my aunt’s now lifeless form lay broken on the sharp edges of their home. I couldn’t see what they were doing to her but I felt deep inside of me that whatever it was couldn’t be good.</p>\n\n<p>I cried. I cried for the loss of a family member I had just found. I cried for the loss of something beautiful. I cried for the hopelessness I suddenly felt for humanity and the animals that had already been lost to these things. I let my body fall to my side and curled up into a tight ball and I cried for what felt like hours.</p>\n\n<p>When it seemed that my body had run out of tears, I sat up and found myself unable to tell the difference between the pounding of the drums and the pounding of my own head. I sat up and looked toward the island that still loomed in the ocean like a diseased organism. My heart stopped and sank when I saw Sophia standing on the highest platform. As if able to tell I was looking at her, she raised an arm that looked like it was filled with more liquid than bone and waved to me.</p>\n\n<p>I awoke, screaming, to an empty bed and dark bedroom. Frantically, I yelled for Chuck but received no response. I sobbed, my tears renewed from being released from the dream where I had cried them all away. I called for him until my words faltered. I was too terrified to move from where I was and I just needed something to remind me that it was okay, I needed him to tell me it was all just a dream.</p>\n\n<p>After a few moments of quietly crying, I finally realized that I could still hear the drums and chanting. How were they here? How had they followed me from my nightmare? I tried to listen to determine how close they might be. A loud bang on the window beside me made me jump and scream.</p>\n\n<p>And then I truly woke up. Chuck was there, holding me tight in his arms already.</p>\n\n<p>“Hey, hey, shhh,” he cooed softly in my ear. “It’s okay, I’ve got you.”</p>\n\n<p>“No! No, no, no, no,” I repeated over and over. He rocked me gently and kissed my forehead and cheek.</p>\n\n<p>“It was just a dream, baby. You’re okay,” he tried to soothe me. That was exactly what I had wanted to hear only a short time ago but now all I could think was that it wasn’t okay, nothing was okay.</p>\n\n<p>I quieted down and tried to let myself relax in his embrace. I was too on edge and shaken, though, so the most I was able to do was steady my breathing. After sitting like that for half an hour, I felt like I was composed enough to explain what I had seen to him. He listened intently and was kind enough to not try to alleviate the situation with jokes, as he usually did. When I finished, he looked at me with concern.</p>\n\n<p>“What can we do to make this stop? Do you need to see someone?” He asked.</p>\n\n<p>I shook my head almost vehemently, “No, no doctors. They couldn’t help Sophia; they won’t be able to help me.”</p>\n\n<p>“Then what?” He questioned.</p>\n\n<p>“I don’t know… But I think she might be going there,” I responded.</p>\n\n<p>“Sophia? Going where?”</p>\n\n<p>“To the cove.”</p>\n\n<p>“Why would she go to the cove?”</p>\n\n<p>I shrugged, “Without knowing what happened to her when she went there before, I have no idea.”</p>\n\n<p>We sat in silence for a while, neither of us sure of what exactly to say.</p>\n\n<p>“Do you think you should go get her?” Chuck finally asked.</p>\n\n<p>I looked at him hard and narrowed my eyes. Part of me yelled a resounding yes but the other part of me begged to not go to that horrible place. I couldn’t think of how exactly to answer but found</p>\n\n<p>myself nodding.</p>\n\n<p>“Alright, we’ll look at flights in the morning.”</p>\n\n<p>And we did. Chuck was able to get another couple of hours of sleep before work this morning but I wasn’t able to sleep a single wink after that horrifying night vision. I was awake when he rose to the smell of an already brewed pot of coffee. After he dressed and settled down with his mug of steamy liquid, we booted up the computer and began taking a look. We can’t be sure that Sophia is there but it’s the best place to start, I think. He’s going to talk to his boss about getting a couple of days off at the beginning of next week and we planned on flying out early Monday morning.</p>\n\n<p>Saturday brought some unexpected issues. Chuck wasn&#39;t able to get Monday off of work and wouldn&#39;t be able to take any time until Wednesday. When I offered to go alone and have him stay here, it resulted in a frustrating argument. He called me reckless while I called him overprotective. Things were said, tempers raged, but finally on Sunday, after not talking to one another for over twelve hours, we were able to come to a compromise. I still flew on out Monday, yesterday, and he will be joining me on Wednesday, tomorrow.</p>\n\n<p>So here I sit, in a cheap little motel just outside of Savannah, typing this up in an attempt to calm myself and focus on the details or anything, really. I can&#39;t get the entire situation and the dreams out of my mind so I figured this was the best way to try to get some sort of handle on things and myself without the failure of just trying to clear my mind and ignore it.</p>\n\n<p>I can&#39;t deny it, though, I&#39;m freaking out. When Chuck gets in tomorrow, we&#39;re going to rent a car and drive down to the cove. I’m scared to sleep until then but I’m even more anxious about what we might find at History Look Cove. I’m just hoping that we find Sophia alive.</p>\n</div>\n","author":"boewhiskey"}