{"rank":"1","title":"0504, update 1","id":"8lebxw","url":"/r/nosleep/comments/8lebxw/0504_update_1/","time":"1527028888000","body":"<div class=\"md\"><p>Update for you guys, though I&#39;m not really sure how to explain all of what happened last night. A little bit after I posted the first entry, the two ports opened and I got a good look at one of my captor. It was a tall man in a dingy suit and glasses that were much too dark for the dimly lit hallway outside the door. His face was a bit gaunt and his skin was deathly pale. What stood out to me were his eyes though. Despite the darkness of his glasses, a sickly green glow emanated from behind them. For the few seconds that we&#39;d locked eyes I felt fear, cold and needle-like fear that set my hair on edge and had made me take an inadvertent step away from the door, relief flooding my system when I&#39;d managed look away. &quot;Food. Eat. Surgeon will visit soon. Going to need all energy.&quot; He&#39;d spoken in clipped sentences before sliding the top port closed and sliding a tray through the bottom one. I waited for his footsteps to fade away before I even moved for the food.</p>\n\n<p>Who or whatever the hell that was, I get the feeling its not normal. Not human. I don&#39;t know what&#39;s scarier, this entire situation or the fact that I&#39;d have to deal with Suit Guy if I ever wanted to get out of here.</p>\n\n<p>I sat on the floor in front of the door and set the tray on my lap, immediAtely scarfing down the stale bread and cold soup that was apparently my dinner for the night. I was just about to set the tray back in the port when I happened to take a look through it and could make out the dim outline of another cell door, bottom viewport open just like mine. My heart skipped a beat. Did that mean there were others trapped here like me, imprisoned against their will? There was only one way to find out.</p>\n\n<p>&quot;Hello?&quot; I called quietly, getting as close to the port as I could. &quot;Is-Is anyone here?&quot;</p>\n\n<p>I waited for a long, agonizing for a moment. A quiet whisper was my reply. &quot;He doesn&#39;t like for us to talk to each other.&quot; A woman&#39;s voice. Young. &quot;If-if he catches us he&#39;ll kill us.&quot; So I wasn&#39;t the only one here. I don&#39;t know if that&#39;s a relief or not.</p>\n\n<p>&quot;Who is he?&quot;</p>\n\n<p>&quot;He is the Surgeon.&quot; There was that name again. The Surgeon. First from Suit Guy and now from the captive in the cell across from mine. Whoever he was, he seemed to be the one in charge from the sound of it. If Suit Guy was right, then I&#39;d probably be meeting him soon enough. I&#39;d get my answers from him.</p>\n\n<p>&quot;Where are we?&quot;</p>\n\n<p>&quot;I don&#39;t know. Didn&#39;t you hear me? Do you want to die?&quot;</p>\n\n<p>&quot;Not really. I just want answers.&quot;</p>\n\n<p>&quot;Well get them from someone else.&quot;</p>\n\n<p>So much for making a friend.</p>\n\n<p>&quot;One more thing; who are you?&quot;</p>\n\n<p>There was a long, long silence before she let out an audible sigh. &quot;I... I don&#39;t know. All I know is this stupid number. 0514. I woke up in this room a couple dausbwith nothing but this shitty cot and an even shittier laptop. I tried getting ahold of someone, anyone but it&#39;s like I&#39;m the only one on the Internet or something.&quot;</p>\n\n<p>Just like me.</p>\n\n<p>A frown pulled on my lips.</p>\n\n<p>What the fuck.</p>\n\n<p>&quot;I&#39;m 0504 by the way.&quot;</p>\n\n<p>Loud footsteps echoed down the hall.</p>\n\n<p>&quot;Whatever. Shut up. Someone&#39;s coming.&quot;</p>\n\n<p>I couldn&#39;t quite blame her for being a dick, given the circumstances but jeez. Way to lay it on thick.</p>\n\n<p>&quot;0504, 0514, move away from your doors.&quot; This voice was authoritative and deep, the kind you&#39;d find on like a military man or something. I took a step backwards. I hope 0514 did too. &quot;Hades, Styxx, if you would be so kind.&quot; The sound of metal sliding against metal was followed by the lock of my cell clicking and my heart began to race.</p>\n\n<p>My chance was coming. I didn&#39;t want to waste it but... there was someone else here. I couldn&#39;t just leave her to her fate. If I acted and it didn&#39;t work then that could get the both of us killed. But if I did and got out, I&#39;d be free but she&#39;d still be here, trapped with someone calling themselves the Surgeon. I&#39;ve no doubts that it wouldn&#39;t end well for her. God damn it.</p>\n\n<p>The door slid open, revealing a small man in a long white coat with hands behind his back. He had a scruffy beard and neatly combed black hair. Beady blue eyes started long at me before a grin tugged at his lips. &quot;0504, it is a pleasure to make your acquaintance. My name is not important but you can call me the Surgeon. Seems to be what everyone else likes to call me.&quot; He shrugged and stepped into my cell, Suit Guy entering behind him, blocking my way out. &quot;Now, I know you&#39;re wondering just what you&#39;re doing here. Or maybe it&#39;s why you can&#39;t remember anything.&quot; That grin of his only seemed to grow wider and wider as he spoke, as if he could barely contain his excitement for what was to come next. Suit Guy only stood stoically. &quot;You are the bréagadóir. The liar. I was paid to change that, be it through surgery or other methods. My methods may seem a bit unorthodox but I promise you they work. None of my customers have ever been disappointed.&quot;</p>\n\n<p>My palms were slick with sweat. I didn&#39;t like where this was going. &quot;What is this?&quot; I asked.</p>\n\n<p>&quot;This is surgery my friend. We&#39;re going to get that lying out of you whether you like it or not. Styxx, bring her in.&quot; Suit Guy stepped aside as another man in a dingy suit stepped in, gently guiding a woman into the cell before giving her a rough push towards me. She stumbled into my arms with a squeak and shot me a nasty glare before moving away and turning her attention back to the three men. The cell felt more than a little cramped. &quot;I believe you two are already acquainted. 0504 meet 0514. Bréagadóir meet Míbhásta. As of today, you two are gonna be the best of friends. Perhaps you can discuss your sins.&quot; the Surgeon turned to leave. &quot;The heart that bears it all is the healthiest, after all.&quot; He gave a dark chuckle as he left, followed by the Suit Guys. The door slammed closed and the lock clicked, locking us in once more.</p>\n\n<p>&quot;Well I gu-&quot; My face was on fire the moment she&#39;d slapped me, anger in her deep green eyes and a frown on her lips.</p>\n\n<p>&quot;This is your fault.&quot; She hissed. &quot;If you didn&#39;t try to talk to me I bet this would&#39;ve never happened.&quot;</p>\n\n<p>What a cunt.</p>\n\n<p>That was a couple hours ago and not much has happened since. 0514 isn&#39;t talking to me and hadn&#39;t done much else but sit in the corner, watching me.</p>\n\n<p>My situation, as I understand it, is this:\n- I don&#39;t know where I am.\n- I don&#39;t know who I am.\n- I&#39;m not the only prisoner.\n- 0514 and I are to share this cell.\n- the mastermind behind all of this is a man named Surgeon. He has answers but he&#39;s not telling. He was paid to bring me here for &#39;surgery&#39;.\n- Bréagadóir means liar. Apparently I&#39;m a liar.</p>\n\n<p>Still don&#39;t really know what&#39;s going on, but it&#39;s a start. Hopefully I can get out of here soon. A burger sounds so good.</p>\n\n<p>Signing off for now. I&#39;ll keep this updated. Hopefully someone finds this.</p>\n\n<ul>\n<li>0504</li>\n</ul>\n\n<p>I found 0504&#39;s journal thing. I&#39;ll keep this short and sweet.</p>\n\n<p>There&#39;s something in this cell. It&#39;s always just out of sight but I know it&#39;s there. Watching. Waiting. 0504 doesn&#39;t seem to notice but I do. It scares me.</p>\n\n<p>Please help.</p>\n\n<ul>\n<li>0514</li>\n</ul>\n</div>\n","author":"patient0504"}