{"rank":"209","title":"My first boyfriend","id":"8lec80","url":"/r/nosleep/comments/8lec80/my_first_boyfriend/","time":"1527028946000","body":"<div class=\"md\"><p>I met Aaron when I was 15, on a park bench just outside of town. I was there with Fraser and Deb, but they both left me in peace once we’d struck up a conversation. </p>\n\n<p>To say he was handsome would be a mistake. His dark curly hair was cute, sure, but he had a small rash of angry red spots across his forehead and his front teeth had a gap between them. He had bright blue eyes, though, and they were beautiful. He was tall, around 6’ 2”, and a few years older than me. He was in the local upper sixth-form and played in a band I’d never heard of. I thought he was cool, and he thought I was cute. We exchanged numbers and then I went home to my Mum for dinner. Chicken and veg. I pushed it round my plate; the only thing I could think of was being able to message him. </p>\n\n<p>I wanted him to message me first. When he didn’t, I drew up the bravery to do it.</p>\n\n<p><em>Hi, it’s me. We met in the park.</em></p>\n\n<p><em>Hello, me. :)</em></p>\n\n<p>And that’s how it started. He took me on a date the next week. We went to the local cinema and he held my hand for a bit. Then, we went to a bar. I was underage so he bought my drinks. After I’d had four, we went outside and he walked me home. Round the corner from my house pulled me close and kissed me. I felt the scratch of his stubble against my skin. He was sober. I told my friends we weren’t seeing each other. He’d asked me to keep it quiet, just because of my age and the fact that he didn’t exactly have a brilliant track record. He didn’t want people judging him. I understood that. He also didn’t want his band mates thinking anything was going to get in the way of his music. That made me feel kind of cool, really. He even wrote a couple poems for me. </p>\n\n<p>The next few times we met at his house after nightfall, always once his parents had left. It gave us “privacy” to get to know each other, or so he said. I didn’t like that so much, but he was my first real boyfriend so I didn’t put up too much of a fuss. I stayed over a few times and it was mostly alright. </p>\n\n<p>On our fourth date he strangled me to death. He assaulted me first. It hurt. I was disappointed, really. I thought we’d maybe found something special. The feel of his hands round my throat and the anger in his eyes as he watched mine turn glassy made me wonder how many times he’d done it before. Of course, by this point I couldn’t feel a thing, but it still made me cringe when I watched him quietly dissect and then dispose of my body. Aldi plastic bags and a hole in the ground made up my final resting place. I felt sad that my Mum and Dad wouldn’t get to bury my body. They probably wouldn’t even find out what had happened to me. None of my friends knew his name, and to be honest I didn’t even know that he’d given me his real one. He was older than me, and he probably lied about the school he went to and all... not that I could do anything if he’d told me the truth anyway. I was dead, after all. The dead really are quite silent. </p>\n\n<p>That is, I thought we were. I don’t know what I was expecting, being dead and all, but you sort of stick around. At least I did anyway. Over the next few months I saw my friends panicking, my family falling to bits and there was nothing I could do. Well, not for them. Watching my mum cry every night broke my heart. I wanted to reach out and touch her; let her know o was still around, but I simply couldn&#39;t. Eventually I stopped visiting. It was too painful.</p>\n\n<p>Aaron was a whole other story. I stuck around his quite a lot. I watched it all. The lies, the manipulation. How he would reel girls in and abuse them. I don’t know how many girls he’d killed before me, but for the most part he was happy just sucking the life out of them metaphorically, then letting them go, often with bruises and trust issues. Turns out he wasn’t 18 at all. He was in his late 20s and his parents didn’t exist. Well, not in the way I thought they did. His mum had died years ago and when his Dad had moved he’d left “Aaron” the house. Oh yeah, and his real name was David. </p>\n\n<p>So I watched David do his thing for a little while. Then he started properly seeing another girl, a year or so younger than me. She was cute, with ginger hair and freckles. I saw him whenever she’d left, how he’d masturbate to the though of killing her; how much he so looked forward to doing it. I knew I couldn’t let him kill her too. Once he’d invited her round a couple times I knew it was now or never. I’m not quite sure how I did it, but I managed to shift myself into her whilst she was asleep. Don’t ask me how I managed it, because I don’t really know. One minute I was hovering over her, and the next I was sort of stepping into her skin, like it was a pair of trousers. It felt so weird to be able to move again, as a person. Her name was Amelia. My name was Amelia. </p>\n\n<p>I slipped out of bed, being careful not to wake him (which was easy because I was so small and childlike). It made me shiver to think that he found this prepubescent body so appealing, not to mention what he was planning to do to me. Her. What he was planning to do to her. </p>\n\n<p>I went to the kitchen and picked the biggest knife I could find. Then, creeping up the stairs, I wondered how exactly it would feel to kill someone. Good, I imagined, fucking fantastic. I’d be ridding the world of someone evil. By the time he woke up, it was too late. I was straddling him, and the knife plunged into his chest before he could even vocalise his surprise. At first, he tried to stop me, but I was so angry that it gave me the strength of three people. I stabbed him again and again and again, blood spraying into my eyes and mouth. He tasted amazing. I hoped he could watch my eyes like I had watched his. </p>\n\n<p>Once he was dead I thought I’d be able to leave and let Amelia be. I was wrong. For the life of me I couldn’t leave. I was trapped inside her body. It was such a bizarre feeling. I’d been dead for so long and wished for life every day, and now I was alive I couldn’t escape. Also, I didn’t know a thing about body disposal. Plus, I was tiny and he was a giant. A giant, bloody heap. There was blood sprayed all over the walls, the bed was soaked and I was drenched too. Trying to do anything seemed pointless. So, I didn’t. </p>\n\n<p>They picked me up a few days later. Amelia’s parents reported her missing, and David hadn’t destroyed her phone, so they were able to track it. When they found me- her- she was still drenched in blood. David’s body was easy to find, and since there was no proof of what he’d done to me and what he was planning to do to her, they decided it was best to take me- her- off to a secure mental health facility, at least to see what was going on. Their being to keep me there for the forceable future. They asked me if he’d raped me, and I told them the truth- yes, but not in this body. I told that that I’d been someone else before. All the talk of being dead didn’t really help anything. So, they moved me into my new home. I guess that saved me- her- from prison, or a reformatory school. </p>\n\n<p>I feel awful, I really do. For Amelia. I swear, the more time passes, the more I feel like I always was her. The lines blur. When I was moved to the forensics ward they started pumping me full of all sorts of drugs. Anti anxiety meds, antidepressants, and antipsychotics. Soon my brain sort of started to erase my previous life. My life before Amelia, and the killing. I started to think that maybe- just maybe- I’d made it all up. Maybe it’s like my psychiatrist says, “all a delusion”. But how come I remembered dying so vividly? </p>\n\n<p>They say his name was Andrew, and he was 16, not 26. He had parents who had been away for the weekend. He went to Amelia’s school. He was a brilliant student with “so much to give”. But if all of that was true then how could I have been so <em>sure</em> of what he’d done? I had been so certain that he deserved to die, how else could I have had the strength to stab him over 100 times? How did I have to stomach to sit by the body for two days, in the middle of summer? If he wasn’t evil, then what did that make me? </p>\n\n<p>Who does that make me?</p>\n\n<p><em>I&#39;m writing this from the inside of the forensics ward. For now, I’m allowed access to ”my” phone so long as I comply with regular checks from staff. For some reason I’m allowed the reddit app, alongside a couple games. They check my internet history, but don’t really delve into the apps much (plus I always log out anyway) I guess since it&#39;s a children&#39;s ward, they don’t care too much so long as you’re not kicking up a fuss, or getting up to anything sinister online. I usually only have access for an hour or so twice per day though, and that sucks, but sometimes if nice staff are on duty they let you have it for a bit longer. Since I&#39;m always behaving, most of them turn a blind eye.</em></p>\n\n<p><em>I&#39;m being reviewed soon though, and I get the feeling I’ll be moved somewhere much less pleasant... wish me luck, I guess.</em></p>\n</div>\n","author":"coniferstance"}