{"rank":"0","title":"My other shadow","id":"8ledzk","url":"/r/nosleep/comments/8ledzk/my_other_shadow/","time":"1527029376000","body":"<div class=\"md\"><p>I can’t generally remember a time when I wasn’t obsessed with the paranormal, and maybe this could be the reasoning for this happening, as it may have made me an easy target. </p>\n\n<p>The best way to explain this story is in exact chronological order, although this was not the original way I had pieced it together, this is the most comprehensible way to explain.</p>\n\n<p>Anyway, lets start with some context,</p>\n\n<p>Across the street from me lives 2 of my childhood friends, and ever since me and my younger sister have been going over to their house, we have suspected there was some sort of otherworldly presence, as my sister recalls seeing a dark figure look outside their window when no one was home, and she frequently house sits for their family when they leave on vacation, and even though she firmly claims to not believe in ghosts or spirits, she refuses to go to the house alone, as she states she feels unsafe and she can feel negativity when she enters the house.</p>\n\n<p>My childhood friends, Maya and Willow, have messed around with an Ouija board plenty of times with their dad, who is a firm believer in the supernatural, and has somewhat of a partially unknown history with it, so it wouldn’t be unlikely that something else lives in their house. </p>\n\n<p>Now let’s start the story.</p>\n\n<p>Me (around 7 at the time), My sister Ally (probably 6), Willow (Either 6 or 5) and Maya (3 most likely), had all been sitting in Maya and Willow’s basement, in a small crawl space under their stairs. We had all been sharing “scary stories” (or at least what we found scary at that age) to each other. When it had came time for Willow to shar her story, she told us a “real” story from when she was 3. </p>\n\n<p>“When I was 3, it had been really late at night, and I had walked down into my basement to get an extra blanket because I was cold. When I walked into the basement, only one light was on, and it was in the laundry room. When I walked down the stairs, I had saw a “shadow witch” run down my hallway, I followed her into the laundry room, and she ran into the closet door and slammed it shut and the light went out. And I have never opened the closet door since.”</p>\n\n<p>As a kid I thought was a load of bull and had basically completely forgot about it as a grew up. \nI still frequently hung out with Maya and Willow, forgetting the story willow had shared with us that day in the basement stairs crawl space.</p>\n\n<p>Fast forward to when I was probably 12-13 ish.</p>\n\n<p>I started having these weird nightmares, typically of me walking up or down stairs, and a shadow figure pushing me down the stairs. </p>\n\n<p>Though I specifically remember one of the dreams taking place at Maya and Willow’s house. I was sitting in their living room, when all the lights turned out, and a terrifying shadow figure stepped down their stairs, and had asked me this:</p>\n\n<p>“Do you know the darkness?”</p>\n\n<p>I answered with probably the weirdest answer I could have came up with. </p>\n\n<p>“Yes.”</p>\n\n<p>Suddenly the figure had grabbed a hold of my hair, and furiously dragged me up the stairs to the upstairs portion of Maya and Willow’s house, then I had suddenly woken up in a cold sweat.</p>\n\n<p>The summer of being 13, I had woken up around 3:30 in the morning for no reason at all. After I woke up I couldn’t fall asleep for anther 30 minutes, so I just decided to get up and play on my laptop for a bit. I had been listening to green day and my chemical romance (I was emo when I was 13) for about an hour, when I had felt the presence of something come into my living room. Assuming it was my dad confronting me about being on my laptop in the middle of the night, I took my headphones off my head and looked up and said “Dad?” although it was not my dad staring at me when I looked up. </p>\n\n<p>In front of me stood a 7-foot-tall shadow figure, staring down at me with its face of nothingness. </p>\n\n<p>Naturally my body jolted, out of fear, and the creature disappeared. I threw my laptop back where it belonged and ran into my bed and didn’t come out until morning.</p>\n\n<p>After that, I never had a dream with a shadow figure again, nor did I see it anywhere.</p>\n\n<p>For 2 years after that, I researched to try to fund out what it was. Numerous sources stated it could have been a demon, a negative spirit, or just a shadow person. I downright refused to believe it was a demon, as I could think of no ways in how it could have appeared where it did. My house was not haunted, nor was there any sightings of anything creepy or strange in my tiny house, though after a while I had brushed the situation off my shoulders, as there was no other investigating I could do with it, until just recently.</p>\n\n<p>I had been visiting Maya and Willow for the first time in awhile, as I don’t see them as often as I have made other friends and branched out from hanging around them.  </p>\n\n<p>We had been hanging out in their basement, when I passed the laundry room and looked at a closet door that sat behind the washing machine.</p>\n\n<p>And that’s when it hit me.</p>\n\n<p>I confronted Willow about that shadow witch story from now almost 10 years ago. I had giggled at how fake it seemed for a 5-year-old girl to tell, but Willow didn’t laugh or giggle back, she just gave me a very worried look along with her sister. </p>\n\n<p>“Hailey, I wasn’t lying about that… I swear to god that it actually happened.”</p>\n\n<p>I gave Willow a worried look back and told her all the stuff that had happened with the shadow figure, from my dreams to actually seeing in real life.</p>\n\n<p>She stated she often has dreams similar to mine, but she’s been having them almost all her life, along with her younger sister Maya. </p>\n\n<p>When I had gotten home that night I had finally pieced it together.</p>\n\n<p>Something must have attached itself to me one day, and had been showing itself in my dreams, and once to me in real life. I have no clue what the creature could be classified under, but I hope it was not a demonic creature. Whatever it was though is no longer attached to me, I hope.</p>\n\n<p>I await to see if in the future I can make a part two to this, as Maya and Willow still live across the street from me, and I’m free to visit them anytime. Although now if I do visit, I proceed with caution due to the fear of having a creature follow me back home again.</p>\n\n<p>If you have any other ideas of what this could have been, please feel free to tell me.</p>\n</div>\n","author":"haileydrawsthings"}