{"rank":"0","title":"There’s Someone on the Other Side of My Mirror","id":"8legee","url":"/r/nosleep/comments/8legee/theres_someone_on_the_other_side_of_my_mirror/","time":"1527029955000","body":"<div class=\"md\"><p>I work for a small law firm in the Midwest, where everyone extends a greeting as they walk past and there’s always fresh coffee in the lobby. The original ten story structure that is deemed our corporate office was built in 1902, and you can still locate many of the artifacts from the 1900’s throughout the long hallways and dark, dimly lit corridors. I’ve always found something charming in the way that we’ve managed to keep our rich history alive, until now. </p>\n\n<p>Our Director of Maintenance, Roger, has recently been pushing for renovations and updates throughout the building. Partly because they’re desperately needed, mostly because attracting millennials to come work for us is that much harder if we aren’t keeping up with the times. I’m one of the lucky employees who was selected for a full office facelift, which essentially meant that Roger painted an accent wall in my tiny area and gave me free reign to find new decorations throughout the building. </p>\n\n<p>While searching on the tenth floor, which is equivalent to the Room of Requirement from Harry Potter... filled floor to ceiling with dusty artifacts from forgotten times, I was struck with the notion that I’d really like to find a vintage mirror for my office. Now, I’m about as narcissistic as the next 20-something year old woman, but I still could not tell you what possessed me to begin searching for a mirror. </p>\n\n<p>After struggling through piles of decorations for what felt like hours, I came across a large, oval shaped mirror with gold trim. The glass was slightly warped from years of use, but I figured that made it all the more authentic. It was quickly cleaned off and brought to my office for installation. It now rests neatly on the wall, directly behind my desk, nestled in between two filing cabinets. Roger insisted that this was a quirky place to put it, but it felt right at the time. </p>\n\n<p>The following morning, I arrived at work as usual and began checking my emails. Noting that I had a meeting scheduled in 30 minutes, I stood up, turned around and checked my hair and makeup in my new mirror. As I moved a stray curl back into place, I had the most remarkable sensation that I was being watched. The hair on my arms stood up, my breath caught in my throat, and I started moving closer towards the mirror. </p>\n\n<p>Of course, nothing was there. I chalked up my emotions to insecurity, I’d never fully checked myself out in such a bold way while in my office before. I steadied my breathing, gathered my things, and left for my meeting. By lunchtime, I’d all but forgotten about the strange experience. </p>\n\n<p>That afternoon, after enjoying my third cup of coffee, I checked my teeth in the mirror. Again, I was struck by the strong sensation that I was being watched. Or rather, that I was looking at something beyond my own reflection. This time, I leaned in closer to the mirror and began to really examine it.  The pair of dark, green, luminous eyes that stared back at me were definitely not my own. </p>\n</div>\n","author":"Jorflin"}