{"rank":"34","title":"Please believe me...","id":"8leidk","url":"/r/nosleep/comments/8leidk/please_believe_me/","time":"1527030397000","body":"<div class=\"md\"><p>It began as innocent conversation.</p>\n\n<p>My wife (30) and I (29) had been fighting a lot. Our kids were staying with my mom while we tried to sort out our relationship problems, but we were getting nowhere fast. I was messing around on my phone one night and stumbled across an app that allows users to chat anonymously with people in their area. I was bored, so I went ahead and downloaded it. I had no idea what I was in for.</p>\n\n<p>To be fair, my first post was misleading. I said that I was separated and just managed to pry off my ring. No responses. Typical. I don’t live in a very densely populated area anyway. So, I took to scrolling through nearby posts and one caught my eye. A young woman was complaining that her crush still had strong feelings for his ex and wanted someone to chat with, to take her mind off him. I replied something to the effect of, “I have a lot on my mind, too. Maybe we can help each other out.” That’s how it all started.</p>\n\n<p>For the first few days, the chats were tame. I told her she shouldn’t get so hung up on a guy who refused to move on. Then, we started talking about the usual things; interests, hobbies, books, music, etc. We actually had a lot in common and she was really nice, so I soon found myself messaging her quite frequently. During one conversation, she asked my name and what I looked like. I won’t lie: I knew deep down where this line of questioning was likely to lead, but my wife hadn’t shown any interest in me for a year, so I went along with it. I asked her the same questions. She described herself as “not the prettiest,” so I asked for a photo. You know, for science. She obliged and I was quite pleased to inform her that she was mistaken. Long, red hair; bright green eyes; a light spattering of small freckles; and porcelain-perfect skin. I was instantly smitten, so I sent a photo back. “You’re not too bad yourself,” she said. So, there I was, with this twenty-year-old beauty complimenting my looks. I let things get out of hand. Don’t judge me.</p>\n\n<p>Two days and many hours of chat later, she asks if I’d be interested in meeting face-to-face. Naturally, I jumped at the chance, but of course I didn’t make it obvious how excited I was. I still had no intention of doing anything improper with this girl, but the idea of spending some time with someone who was actually attracted to me was enticing. It didn’t hurt that she was a total knockout. Before I went to bed that night, we had made a date for the next day.</p>\n\n<p>I could tell throughout this process that my wife was starting to get suspicious, but I brushed it off. When I left that afternoon for my date, I told my wife I had an appointment at the VA hospital. She seemed to buy it. At her request, I dropped her off at her sister’s and headed off to meet my date. We met at a local park and started down the small walking trail that led into the woods surrounding the park. My God, she looked amazing in that yellow sundress and the gentle breeze brought to my nostrils a heady scent of cherry blossom perfume and vanilla lip gloss. As we walked and talked, I lost myself in her eyes. I also lost track of the time. When had the sun gone down?\nI had told my wife I’d be gone for about an hour. No matter. I’d just tell her my appointment got sidelined by some medical emergency. Why hadn’t she tried to get ahold of me. Just off the trail, I could hear the rustling of nocturnal woodland creatures starting their day. The girl beside me took my arm and leaned in close against an unusually chill wind, resting her head on my shoulder. I’m pretty sure my heart skipped several beats at that moment. I stopped walking and turned to face her, looking down into those brilliant emerald eyes and…my breath caught in my throat. The air had stagnated and the rustling I’d heard before had stopped. There, just a few feet off the trail, stood a figure silhouetted against a low, red moon whose light did nothing to push back the darkness around us. </p>\n\n<p>I knew the figure immediately. I’d seen it every day for the past 15 years. My date, however, wore confusion plain on her face as she turned around. That movement was the trigger. My wife leapt from the trees, her face a grotesque mask of vile, seething hatred. Before I could lift a hand, my wife&#39;s hand shot out, fingers closing like a vice around a neck so slender. With a feral strength I’ve never seen, my wife descended upon my date and yanked as they hit the ground. Blood sprayed her face as my date’s perfect skin peeled away, exposing the muscle, veins, and esophagus beneath. The poor girl’s scream became a sickening gurgle as my wife set to work tearing through flesh with her bare hands. Had her fingernails always been that long? I snapped out of shock and rushed forward, trying to pry my wife away from her target, but with what seemed like no effort, she flung me several feet off. Her face was twisted by malice, covered in gore, teeth clenched to the point of cracking as she shredded the last of the tissue of my date’s neck. I retched as she grabbed, bent, and finally broke the girl’s collar bone. She’d already drowned in her own blood, but my wife continued her brutal task without hesitation.</p>\n\n<p>After several minutes of watching in horror as the woman I’d married and had a family with literally tore that poor young woman apart, she stopped. Fear, cold and unforgiving, paralyzed me as she stood, still clenching a handful of what looked like intestines. As she turned toward me, slow and deliberate, I noticed it. The glow, so faint it could almost have been the reflection of the moon, deep in her eyes. She took one step toward me, but it was off somehow. Her bone structure wasn’t right. Her face was gaunt, corpselike. Her limbs hyperextended slightly, the joints too sharp. And she had never, in our entire relationship, been so quiet. Throughout the entire grisly murder, she hadn’t made a sound. Another step brought her close enough that I could see her teeth, still clenched, looking like they’d been filed to points. Two more steps had her standing directly over me. She crouched, her posture unnatural, leaning in until her blood-soaked face and my panic-stricken one nearly touched. When she spoke, her voice echoed over itself with a sound like rocks grinding together. “Hell hath no fury like a woman scorned…but we try our best to perform to the sarisfaction  of the client. The price is, of course, quite high.&quot;</p>\n\n<p>I’m back at home now, lying in my bed. The light is off. My “wife” is sitting in the corner watching and wearing a satisfied smile as I write this. I love you, baby. I’ll never speak to another woman, I swear. Please believe me...</p>\n</div>\n","author":"strike8echo"}