{"rank":"73","title":"I've found something really weird at the bottom of my grandma's well (update 2)","id":"8lek1d","url":"/r/nosleep/comments/8lek1d/ive_found_something_really_weird_at_the_bottom_of/","time":"1527030794000","body":"<div class=\"md\"><p><a href=\"https://www.reddit.com/r/nosleep/comments/8izkbx/ive_found_something_really_weird_at_the_bottom_of/?utm_source=reddit-android\">Part 1</a></p>\n\n<p><a href=\"https://www.reddit.com/r/nosleep/comments/8jylii/ive_found_something_really_weird_at_the_bottom_of/?utm_source=reddit-android\">Part 2</a></p>\n\n<p>Hey there guys, I hope you’re all doing okay out there.</p>\n\n<p>So Sunday rolled around and so did my cousin with his abseiling gear in tow. He had some questions about the whole situation, of course. I’d explained over the phone that there was something at the bottom of the old well I really wanted to check out, that I’d consulted some people on what to do (you guys), and asked if he’d be able to help me. It took a little convincing but he eventually agreed.</p>\n\n<p>I was reservedly fixing the bathroom radiator when I saw his dusty red pickup in my drive. I poured him out a cup of coffee and expanded on the situation, the tunnel, showed him the footage I caught. He was after that his interest was as piqued as mine and we wasted no time in grabbing the equipment and getting it set up. He had his reservations about me going down alone, seeing as he would be manning the line. Fortunately I had thought ahead and bought some handheld radios so we we’d both know what I found or if there was some kind of trouble. I also picked up an ‘Oxygen Gas Detector Analyser’, thanks to the user who linked me to it.</p>\n\n<p>So we get it all setup, myself harnessed in and I get ready to go down. I’d already checked it out with the ‘Detector Analyser’ and the readings had been good so nothing to worry about, though I was taking it with me in case that changed deeper in. So Emanuel lowers me in, I try not to have a panic attack about the deep dark drop and in no time I’m scraping the dirt of my knees by this boarded up passage, which I eased open with a screwdriver and a little helping of elbow grease.</p>\n\n<p>So I’m immediately faced with a single room, about 10ft by 10ft. Right down there at the bottom the stench is about 1000x worse than at the top, like a horde of homeless people took up residence and a few generations lived and died in the humid blackness. It didn’t take long to figure out that the smell was coming from whatever was growing across every available surface. It looked like some kind of moss, black and oily, leaking something thick and wildly foul smelling.</p>\n\n<p>I decided, against my better judgement, to venture inside. I tried to step on bare patches the stone floor was like a bumpy ice rink. I go to the other end of the room and shine my light to see a flight of stairs. This hole is something like 200 feet deep and there’s goddamn stairs at the bottom. I let Emanuel know and told him I was going to see where they went.</p>\n\n<p>I sheepishly made my way down, keeping in mind these steps are greased and I can’t even see how far down they go. About half way down I hear the rapidly fading voice of Emanuel and I explain that I’m slowly making my way down, realising that any moment now I’m going to lose reception entirely. I was battling the instinct to flee at this point, but I didn’t stop. I didn’t stop because in the back of my head I knew that it was now or never, and if I didn’t do it now I’d forever wonder where the fuck my crotchety old grandma’s freaky-ass well goes.</p>\n\n<p>I pressed on and after a few more minutes of careful descent the steps end. The stuffs still coating every surface and the smell has only grown stronger. At the bottom of the steps it stops being the carefully built stairs and walls and becomes, what looks like, a naturally occurring cave system. I took a bit more of a look at the greasy walls and realise there’s some kind of vine, also layered with oily moss. This ‘vine’ disappears off into the cave system beyond and suddenly I realise that it’s no vine at all. There’s a cable of some kind all the way down there. I thought maybe I was about to hit the center of the electric grid or something.</p>\n\n<p>A bit deeper in and I begin to hear my radio crackle. I’m thinking that somehow I’m catching Emanuel’s signal still but then I hear it pop and go silent. Then it spoke. Something like “Oh how long? Return my child.” It was a woman, possibly a teenager. Right there I was on the verge of freaking out when I hear another sound, not from my radi this time, but from the hall, and only a few yards away. The shrill cawing of a crow. I flip up my torch and there it is, up on the cable with beady eyes set on me, a big black fucker.</p>\n\n<p>I’m getting some serious chills at this point and I can feel my shirt sticking to me as I perspire with inexplicable dread. Something I can’t explain just gripped me and held me there looking straight into the crow’s twitchy face as it begins to caw and caw, and from somewhere even deeper down in there I heard more, I swear to God. I heard what must have been hundreds of crows, shrieks echoing down the corridor. I have never been so absolutely filled with terror in my entire life.</p>\n\n<p>I turned and ran best I could up the stairs, taking them on all fours and slipping and sliding the whole way up. I started screaming to Emanuel and he started freaking out too. When I asked him later he said all he made out was “Crows! There’s a fuckload of crows!” which he assumed was a metaphor for something. I’m not sure if anyone has ever harnessed and ascended as quickly as I did when I got to the top. Emanuel is presently assuming I was fucking with him and has taken his abseiling gear home with him.</p>\n\n<p>I just don’t know what to think about this. I mean what in the name of God are crows doing down, at least 300 feet, in the ground? Is there some kind of underground crow I’ve never heard of? Emanuel said it must have been bats and something to do with the darkness and my mind playing tricks on me just made me imagine it.</p>\n\n<p>I DID NOT IMAGINE IT</p>\n\n<p>And I didn’t imagine the voice on the radio either. I’ve got no doubt whatever’s down there and whatever I heard the other day are related. So why are there all these voices and random phrases coming from the bottom of a fucking well? I feel like I’m losing my sanity here guys, please, someone offer me some help or a solution. I said fuck that place for the night and stayed at my parents instead.</p>\n\n<p>Am I going crazy?</p>\n</div>\n","author":"Twofailedactors"}