{"rank":"421","title":"Channel","id":"8leqw6","url":"/r/nosleep/comments/8leqw6/channel/","time":"1527032536000","body":"<div class=\"md\"><p>My father was in a car accident two and a half years ago and he’s never been the same since.</p>\n\n<p>It was awful. For six months he was in a coma, and when he woke up, there was nothing left inside. He couldn’t talk. Couldn’t eat. Couldn’t even shit by himself. It was a living nightmare to see my once loving, passionate father turned into a stranger.</p>\n\n<p>My twin sister Ruby and I set up our schedules to make it work. I’m a trained nurse, I can handle the more medical side of thing, and when I’m gone Ruby will step in and keep it together.</p>\n\n<p>My mother never even entered the room he stayed in.</p>\n\n<p>Don’t get me wrong, my parents weren’t awful to one another. My father put their relationship as ‘comfortable’ before the accident. But not happy. And once the man I knew as dad was gone she saw no reason to have anything to do with him. Several times my sister and I have had to cancel dates, meetings, and even had to stay home from family reunions because my mother refused to so much as look at her husband.</p>\n\n<p>That’s what made it harder when two months ago Dad turned to me and said the first words since the accident.</p>\n\n<p>I don’t even remember what I was doing in there, maybe I was getting ready to spoon feed him dinner, maybe I just wanted to tell him how my day was going, but he turned towards me. This wasn’t a simple reaction to stimuli, it was an active movement. Then he spoke.</p>\n\n<p>“Laura? I’d like to speak to Laura, now.”</p>\n\n<p>I remember screaming and crying before I realized I had no fucking idea who ‘Laura’ was.</p>\n\n<p>My mom was the only one home, and she rushed down the stairs to get into the bedroom. She froze at the threshold and stared at my father.</p>\n\n<p>My father scowled, an expression I never remembered him making in the past. He shook his head. “There’s no Laura here? I guess I’ll leave,” He sniffed before the light went out of his eyes.</p>\n\n<p>No matter how much I tried, begged, my father did not respond. He was gone.</p>\n\n<p>But he never was really there in the first place.</p>\n\n<p>The next day when I checked my phone during lunch break I had missed 16 texts and three calls from Ruby. Even my mother had sent me a few very poorly typed out text messages.</p>\n\n<p>Apparently our great grandmother, my brother, and several other people had spoken through my father. All of them having died months or years before.</p>\n\n<p>I was a mix of anger and let down. My father clearly needed to be checked into the nearest hospital and reevaluated, perhaps this was his way of his mind making sense of the world again.  I was resolving on a proper scolding once I got home.</p>\n\n<p>Of course, work ran late and when I got home I immediately went to bed.</p>\n\n<p>The next morning I was woken by my mother and her friends sitting around my father, drinking tea and asking if they could talk to their dead loved ones.</p>\n\n<p>It took all of my self-control not to kick all these women out and to start screaming at my mother, but the longer I stood at the threshold, the more eerie the situation became.</p>\n\n<p>One of the ladies, I think her name was Marguerite, asked to speak with her grandfather while twittering and laughing away. My father blinked a few times before he shouted, his voice several octaves lower than I’d ever heard.</p>\n\n<p>“Bitch! Don’t test us! Your grandfather’s still alive, although not for much longer by the looks of it. Not that you’d mind, damn cunt you are, you’re just content to sit on your fat arse while he wonders when he’ll get so much as a damn phone call!”</p>\n\n<p>My father’s American. We’d not even travelled over to Britain. Yet his accent was as thick as someone born in London.</p>\n\n<p>Marguerite went pale as a ghost before fleeing from the room. The rest of the ladies were horrified, shaking and no longer gossiping around my father’s now vegetative form.</p>\n\n<p>It was then I began to believe there was something more than just a half destroyed mind babbling whatever nonsense came to it.</p>\n\n<p>My mother was thrilled. She mostly asked to talk to Arnold. My brother had been in the car when my father had the accident and hadn’t made it. He was only sixteen. But all she had to do was ask for ‘Arnie’ and my father would start asking about how his old girlfriend was doing and if I’d ever gotten together with my secret boyfriend at the time, Craig.</p>\n\n<p>Only Arnie knew about Craig. My mother was a bit of a control freak and knowing I was in a relationship would’ve driven us both to insanity. I rarely let anyone know that I was in a relationship, and although the thing with Craig had come to a halt after the accident, I still hadn’t told anyone.</p>\n\n<p>I began to believe then. But my mother is what made me regret that belief.</p>\n\n<p>Every day there was new people at the door, paying up to fifty dollars for just minutes to speak with a loved one that they’d lost. They’d walk out with wet eyes and smiles while my mother counted up the bills.</p>\n\n<p>Ruby and I both objected to this. It wasn’t fair to Dad to use him like this. But my mother brushed us off and told us if we didn’t like it, then we might as well leave. And that was the last thing we wanted to do, leaving our mother alone with our poor Dad, god knew how much he was aware of.</p>\n\n<p>I finally decided I wanted to use Dad’s ‘gift’. I wanted to talk to Arnie. Ask if he was in any pain.</p>\n\n<p>It was around midnight when I crept into Dad’s room, only to find out Ruby was already there. Tears were rolling down her cheeks as my dad held onto her hand, stroking with his thumb. Almost like he used to do.</p>\n\n<p>But then Ruby ripped away from him. “You fucking liar! Liar!” She screamed before she ran from the room, nearly running right into me. Our eyes locked, and she shook her head.</p>\n\n<p>“Don’t. Don’t. Don’t do what you are planning on doing. Please, Rachel.”</p>\n\n<p>Then she ran down the hall and I heard the front door slam. Her car peeled out of the driveway with a squeal of the tires and she was gone.</p>\n\n<p>Dad’s face was twisted in a dark expression, and once I stepped across the threshold, I felt a heavy weight on my chest. I cleared my throat several times to try to make it go away, but even so I stepped closer to my dad’s bed.</p>\n\n<p>I sat beside him.</p>\n\n<p>“… Who are you?”</p>\n\n<p>My dad slowly cocked his head to the side, studying me, before his lips curling into a smirk. “Hello, Rachel. You always were Dalton’s favorite, weren’t you? Oh, he loved Ruby and Arnie, but you were the apple of his eye,” He said in a high pitched falsetto, the kind that he used when he was channeling a female spirit.</p>\n\n<p>This wasn’t any spirit though. In the flickering light of a candle near his bed, his eyes seemed to be red, the color of fresh cherries. His favorite fruit, I remembered.</p>\n\n<p>I coughed again, the weight not leaving. “Who are you?” I asked again, more forcefully.</p>\n\n<p>Dad’s eyebrows raised. “I’m your father, don’t be silly.”</p>\n\n<p>I frowned. “No. Who are you? Answer me the truth,” I said.</p>\n\n<p>Dad shook his head, and I saw a glimmer in his eyes. Almost like the father I once knew. “Well, I suppose you have me there. I’m not your father. I’m closer to who your father wanted to be though. Always looking in the mirror, feeling a dysphoric repulsion to his appearance but letting no one know… tell me, do you remember that time when you were six years old and caught your father sneaking in?”</p>\n\n<p>Memories are such funny things. They’re unreliable, only tell one half of the story, and can so easily be forgotten and pushed away.</p>\n\n<p>But being reminded of that night seemed to push away the cobwebs of my mind.</p>\n\n<p>I’d gotten up because I’d peed the bed. I was a bedwetter as a child and rather risk the anger of my mother, I’d taken my PJs and sheets and put them in the wash, hopefully so she wouldn’t catch on. I’d learned how to do the laundry very early in life.</p>\n\n<p>But I was on my way back when I heard the door close. My head jerked towards the front door.</p>\n\n<p>My father was there, wearing strawberry colored gloss and a backless midnight blue dress. He nearly tripped on his heels as we locked eyes. We stayed very quiet. I felt like I’d seen something out of a cartoon or a movie and had no idea how to react.</p>\n\n<p>My dad’s eyes grew sad before he, no, she reached into her clutch. She pulled out a butterscotch candy and held it out to me.</p>\n\n<p>“This will be our secret, all right? Please… don’t tell your mother.”</p>\n\n<p>I took the candy and unwrapped it. I loved butterscotches. The moment it was in my mouth the deal was sealed. I nodded and gave my father a tight hug.</p>\n\n<p>The weight on my chest became unbearable. I was gasping and shaking my head. “Dad… what? What was happening that night?” I croaked, trying to force air down my lungs.</p>\n\n<p>Dad held my hand, her eyes dead focused on mine just like the night I caught her sneaking home. “She wanted to be around people like her. She never cheated on your mother, credit to her name. Your father was a kind, loving woman who always wanted you to be happy. Your mother didn’t quite see it that way when she found out what Daddy dearest was doing at night. So, she cut the brake line. She didn’t know Daddy was going to take Arnie for a drive that day. Daddy was going to tell Arnie the truth, and then the car rolled, and Daddy flew off to heaven to be with the angels… but her body survived.”</p>\n\n<p>I couldn’t breathe anymore. I coughed and desperately tried to inhale but it was like something was caught in my throat. My father’s hand wrapped around mine and suddenly the breath came easily, along with the bitterest sobs.</p>\n\n<p>“Mom… Mom couldn’t have! She couldn’t have…” I gasped, my Dad shushing me as she rubbed my hand. Just like she used to when I was hyperventilating and couldn’t calm down.</p>\n\n<p>“She did. She was going to cut off life support but you never gave up. She always resented your father when she found out the truth. Perhaps that resentment took even further root as your father took Arnie to the grave as well.”</p>\n\n<p>I sobbed and buried my head into Dad’s chest, snot dripping from my nose as my father hushed me and smoothed my hair. I don’t know how long we remained like that, but finally I sat up, able to finally breathe normally again.</p>\n\n<p>“… Who are you?” I asked for the final time.</p>\n\n<p>Dad smiled.</p>\n\n<p>“I’m your Friend, Rachel. How about we keep a little secret together? Do you know how to cut a brake line, love?”</p>\n\n<p>I shook my head no.</p>\n\n<p>“I’ll tell you how. It’ll be our. Little. Secret.”</p>\n\n<p>‘Friend’ extended her hand, and unfolded it to reveal a butterscotch candy.</p>\n\n<p>“Can you keep a secret, Rachel? Don’t tell your mother.”</p>\n\n<p>I took the candy, twirled it between my fingers. Slowly undid the wrapping, pondering its golden color. Thinking about what I was going to do. Remembering what my mother did. And I popped it into my mouth.</p>\n</div>\n","author":"theoddcatlady"}