{"rank":"9","title":"Dead people are terrible at keeping secrets","id":"8lexzz","url":"/r/nosleep/comments/8lexzz/dead_people_are_terrible_at_keeping_secrets/","time":"1527034290000","body":"<div class=\"md\"><p>I have secrets that I have never told another soul and in the last couple of months I have been feeling lonely. I wanted to find someone to confide in and to express myself really. I wanted to express things to someone with all of the embarrassing weird things that I do on a daily basis. I am a normal average person who works in a betting shop and customer service has been the only job I have ever had. </p>\n\n<p>I decided to pick a grave yard and pick a random grave to express myself to and spit out all of my secrets to. I chose a grave with a dead person inside because I couldn&#39;t commit to telling my secrets to someone who is alive. People that are alive are always judgmental and you never know what&#39;s going through thier minds. </p>\n\n<p>On the first time I decided to tell one of my secrets to a grave with a dead person inside and the stone looked so old and it looked like no one had visited this grave for a long time. The first secret I had let go was about my porn addiction and I did feel ashamed for watching porn but being a lonely person with no love life i just needed something you know. It felt good to express myself. </p>\n\n<p>The very next day I had messages from people that I knew but lost contact with expressing either their disgust or surprise at my addiction to porn. Some found it hilarious and I was so embarrassed and I couldn&#39;t believe how they must have known. The only thing or person I had expressed this secret with was with a dead person buried deep into the ground. So I had to change which grave I would express my secrets with and I decided it would be a dead female buried deep into the ground. Her stone looked lovely and tidy like someone still remembered her. </p>\n\n<p>I decided to tell her what I have been doing at the betting shop to earn extra money on the side. I had figured out that after realising the bar code on betting slips from rival bookmakers confused the computer which recorded winnings from fixed odds betting terminals, allowing me to take money without the loss being detected.  </p>\n\n<p>Successful punters playing games on the electronic slot machines got receipts with a bar code. These were scanned on a terminal at the counter to show how much had been won and allow this amount to be withdrawn from the till. </p>\n\n<p>If the link between the slot machine and the till broke down staff could override the system and manually make an &#39;offline&#39; payment of the sum indicated on the receipt, with special permission required if it involved more than £100. </p>\n\n<p>It felt good expressing this secret but the very next day I was fired on the spot from my manager. I couldn&#39;t understand or believe or how they must have known what I have been doing. My manager wouldn&#39;t tell me who told him about what I was doing but to think I had expressed this secret to a dead woman is really disturbing. </p>\n\n<p>So mow people thought I was some perverted creep who was addicted to porn who was also a cheat and a thief. I mean I thought dead people would be good at keeping secrets because they are dead bit it seems that they are not. So I chose another grave that belonged to a dead man and I expressed a secret to him of a time when I slept with a friends sister. This friend was really protective of his sister and would do violent things to anyone who touched his sister. I felt ashamed of this act towards my friends sister and so it felt good to express it. </p>\n\n<p>Then one day there was a knock at my door and when I opened it I found myself in front of an old man who said he knew someone&#39;s secret. This secret belonged to my friend whose sister I had relations with and my past friends was that he was going to kill me and that this old man didn&#39;t want a perverted porn addict as well as thief buried next to his coffin. </p>\n\n<p>I got out of town and I managed to escape getting killed but I am not telling anymore secrets to dead people buried in a grave.     </p>\n</div>\n","author":"shortstory1"}