{"rank":"78","title":"My Shop is Full of Extraordinary Things [Part 2]","id":"8lf4k6","url":"/r/nosleep/comments/8lf4k6/my_shop_is_full_of_extraordinary_things_part_2/","time":"1527035938000","body":"<div class=\"md\"><p><a href=\"https://www.reddit.com/r/nosleep/comments/8kptvy/my_shop_is_full_of_extraordinary_things_part_1/\">Part 1</a></p>\n\n<p>It was early in the morning when I retrieved the mirror from Mrs. O’Connor’s home, packing it up and putting it back in my shop. It was a pity that she and the artifact were not compatible, but it’s expected when handling items as <em>particular</em> as these. And I must say, there’s been a few curious eyes on the mirror already. I don’t think it will be long before it’s found a new home.</p>\n\n<p>As I’m sure you’re aware by now, I don’t sell ordinary antiques. None of them are quite the same, but none of them are what you would consider ‘mundane’. One look around the room will tell you all that you need to know. Whether you’re looking for a trinket for good luck, a peek behind the veil of worlds, or maybe just a companion, there is something here for everyone.</p>\n\n<p>It’s always exciting to see a new object brought into the store. Today, however, I had a rare moment in which I had to turn down a very concerned seller. The poor thing looked exhausted, unable to sleep for days perhaps, and was practically begging for me to buy a used office chair that they claimed was occupied by some dark, watchful spirit on a nightly basis. Well, had it been an antique, I surely would have considered it. Unfortunately for the miserable dear, contemporary items just don’t quite fit the bill for what I’m looking for. Besides, I had a distinct feeling the chair <em>itself</em> was not the issue. Some folks just attract all the wrong attention, you know?</p>\n\n<p>The most interesting part of my week, however, was the moment a man came into the store looking for something very specific. He wanted a doll to give to his young son, he said. He asked if I had any hand-me-down action figures or collectibles, and I regrettably told him ‘no’, but I did have a treasure even better than that.</p>\n\n<p>I led him to a wall of many different porcelain and cloth faces, but he scowled at them almost immediately.</p>\n\n<p>“I’m not getting my son a babydoll.” There was a crassness in his voice.</p>\n\n<p>“Not <em>those</em> dolls. This one here … it’s a kid-favorite.”</p>\n\n<p>I delicately reached past to grab hold of an old cloth body, dressed in satin and lace. The frills at its wrists only partially hid porcelain hands, the fingers splayed. Atop a white ruffle at the neck sat a painted glass head. It was an antique jester, fit with bells on its hat and on its shoes and only minor chipping on its vibrantly-colored face. The man no longer wore a scowl, but now he wore a grimace of some disgust.</p>\n\n<p>“A clown doll?” He asked, his voice dripping with all the skepticism it could carry. “Kids aren’t into clowns. They like superheroes, army guys, princesses, all that shit.”</p>\n\n<p>He shook the doll in his hands, listening to the bells jingle. I couldn’t help but grimace that time, instinctively reaching out to hold the doll’s head still. The customer gave me the strangest look then, but I didn’t mind so long as he didn’t <em>shake it</em> like that.</p>\n\n<p>“You don’t want to treat it too roughly.” My voice was hardly above a whisper. “These old dolls, you know, they can’t be treated like that. They don’t <em>like</em> to be treated like that.”</p>\n\n<p>This is when the true skeptic appeared before me. He narrowed his eyes, giving the doll a questioning glance and then giving me an even <em>more</em> confused look. You see, I often like a skeptic. It’s all the more satisfying to win them over. But this man wasn’t only skeptical, he was breaking the rules right from the beginning. Suddenly, I was hesitant … but it wouldn’t make me a very good shopkeeper if I couldn’t convince a customer, now would it?</p>\n\n<p>“It’s a fragile old doll.” I explained further. “It needs to be treated with gentleness, with respect. But that’s good to teach children, isn’t it?”</p>\n\n<p>The customer still didn’t seem entirely positive of the purchase, glancing at me and then at the toy again. “And you’re sure you don’t have any action figures?”</p>\n\n<p>“Not a one.”</p>\n\n<p>The jester doll was wrapped up safely in paper and placed in a cardboard box, ready to be taken home to its brand new owner. I was happy to see it go. I had admired the doll, found it amusing to look at and its laughter at night to be quite charming, but it longed for a child to keep it company. The doll is special, after all. One could even say that it has a spirit all its own, with a personality and sense of humor. I only hoped that the father’s dismissal of its well-being did not inspire any of its more ‘nasty’ tricks.</p>\n\n<p>I’d like to tell a story about this particular doll. I’ve had this store for several years, and the doll has been in the shop for a grand majority of it. It belonged to the former owner, whose own child loved the doll so dearly that it aged without a single scratch or scuff. The unfortunate part of time is that it ages us all.</p>\n\n<p>My former employer, who owned the shop back when it went by a different name, brought the doll in himself and told me, ‘It doesn’t like sitting on a shelf. It wants a playmate.’ Now, in the beginning I figured this was just a fancy way of him saying that it was an eyesore in the home, but I was very wrong about that. The jester more than once <em>protested</em> to its place on the top of an old oak dresser, sitting next to a music box and with a few pieces of hanging jewelry on the other side. I could hear what almost sounded like a cry at night while closing up the store after the boss had gone home. It wasn’t a child’s weeping, however, but the dramatic, tormented sobs of an adult voice. It sounded muffled, and when exploring the store, I would find out why.</p>\n\n<p>The doll had thrown itself onto the floor. It was lying face-down on the tile, its fabric arms and legs curled slightly as if it had been crawling, and yet it remained completely motionless when I approached it. A few feet away, I saw what the doll had been facing. It was another display, this one shelved with dozens of other figurines and porcelain faces. I realized, as I stood there in the silence after the crying had stopped, that perhaps the jester would do better sitting with others of its own kind…</p>\n\n<p>That wasn’t the end of the doll’s mischief. This was at a time in my career when I came to understand and begin to accept that everything in this store carried something special with it. You can say there were ghosts, if that explanation suits you well, but the possibilities of what might live within an object are far more vast than just the human spirit. The jester doll had a personality, that’s for sure. It would occasionally turn its head with a startling snap if someone happened to bypass it to look at another doll, and my old employer and I had learned many times to always clean the jester’s porcelain face <em>first</em> or else we risked finding a broken babydoll head on the floor by morning. The doll didn’t only require special treatment. It demanded it. But when it was satisfied, its playful giggles were the least of our troubles, even if it could be a little eerie to listen to.</p>\n\n<p>A child was the perfect companion for a toy like this, so long as both the father and son understood the level of respect the jester desired. I did my very best to explain, but the man was flippant to my concerns as he paid for the doll and left the shop. I admit, for the sake of the child alone, I did feel a bit of hesitance watching him walk away.</p>\n\n<p>I would hear from him this morning as I did my rounds about the shop, dusting and adjusting every one of the hundreds of trinkets that had become a little tilted in the night. I put the taxidermy animals back in their spots (the two-headed skunk does enjoy a midnight walk) and collected the stolen jewelry from a particularly vain mannequin who can’t seem to keep her hands out of the precious stone collection. It was a struggle to get all of the rings off of her fingers, as she had curled them just enough to make it a chore, but everything was put back on display where it belonged just before time to open.</p>\n\n<p>I hadn’t expected to hear from the man who bought the doll, at least not so soon. He didn’t call, he didn’t leave a message, but that morning right as the doors were unlocked, he entered the shop with a furious march and the doll stuffed underneath his arm. I admit that I was a bit startled by the sight. Not only was he stomping up to the front desk with murder in his eyes, but the second he got there, he slammed the doll down in front of me with such force that I almost <em>felt</em> an ache against the back of my head just watching him handle it like that.</p>\n\n<p>“Is there a problem?” I asked. Stupid question.</p>\n\n<p>“What do you think?” He scoffed and pointed to the doll on the desk. “This thing has been scaring the absolute <em>fuck</em> out of my kid since I brought it home. He said it talks to him, tells him things - <em>violent</em> things - and tries to convince him that I’m out to hurt him. He’s gotten a rotten attitude, all because this doll looks like something from a shitty horror movie. The problem is that you sold me a creepy-ass toy and now my son won’t sleep at night because he says it won’t stay on the shelf and tries to get in his bed. So yeah, there’s a problem.”</p>\n\n<p>I couldn’t resist wearing my most sarcastic sneer. “Are you sure your son isn’t just projecting some … <em>learned</em> behaviors?”</p>\n\n<p>I watched him grab the head of the porcelain jester and toss it off the counter, letting it clatter to the floor. I heard it before I saw it. There was a loud, splitting shatter of porcelain against tile, and pieces of the doll’s head slid across the floor as if the center of its skull had burst right from the center. I couldn’t help but bare my teeth in a grimace, suddenly getting this sinking feeling. I suppose you could call it secondhand concern. This man had made a mistake, and I almost felt sorry for him if he hadn’t brought it upon himself. After all, it isn’t my job to pair someone with the perfect antique, just as a butcher has no business dictating how a customer cooks their meals.</p>\n\n<p>“Give me a refund.” The man spat.</p>\n\n<p>Without saying anything, I pointed to a sign at the edge of the desk: “no refunds, no returns”. We went over it the day before, and the fact that I had to repeat myself so often was quite tedious, to be frank. The disgruntled father just slammed his fist on the counter once in some desperate display of intimidation, nothing left to say except to turn around and march across the room towards the exit. He smashed an old glass bottle on his way, knocking into a stand of vintage medical equipment, and probably wished he could have slammed the slow-closing door on the way out as well.</p>\n\n<p>I grabbed a cloth to place the bits of broken porcelain in, deciding to save as much of the doll’s original body as I could. It didn’t quite need the same delicate treatment as before. After all, whatever mischievous spirit was inside was no longer there, leaving the jester doll a mere empty shell that was once occupied.</p>\n\n<p>No, whatever was inside that doll was now free to roam. I got the distinct feeling, however, that it would be following that man home to really enjoy its brand new freedom and pay a few visits of ‘thanks’ to the one who desecrated its vessel. And while it may seem wicked to think that maybe he deserves it, I do hope for the best regarding his family.</p>\n\n<p>More than that … I was just glad to see his rude self getting the hell out of my store.</p>\n\n<p>I placed the broken shards from the doll on the edge of the desk, reminding myself to glue it back together later and see if it could be salvaged. The bottle, however, was hardly worth saving at all. I only hoped that losing one piece of the otherwise complete collection of 19th century cure-alls would not take away from the worth of the set. My only thanks was that the bottle was empty. I didn’t want to even imagine what it would <em>smell</em> like if any of them spilled onto the floor.</p>\n\n<p>As I am writing this, I’m recalling what happened less than an hour earlier this very day. After I had swept up the shards from the broken bottle, making a small note to bury them later, someone stepped into the shop with an item to sell. It was a young woman, and though the item she held was no longer desired by her, she didn’t display any of the usual fear or subtle panic that I was used to when someone was getting rid of a so-called ‘haunted’ object. Rather, she approached the desk and smiled at me, saying:</p>\n\n<p>“I have something you’ll be very interested in.”</p>\n\n<p>I was intrigued, even more-so when she showed me what she had. It was a unique, leather-bound chest, no doubt made of wood but wrapped in a lightly tanned hide. She gave me a clever sort of grin as she asked, “What do you think this is?”</p>\n\n<p>“Well, it looks like a tiny treasure chest,” I spoke in amusement, but she simply shook her head and passed the box across the desk so that I could inspect it. Something about the leather was strange to me. It was paler than imagined, but clearly lacking in dyes. It even had shrunken, dehydrated pores and discolored spots on the surface like <em>freckles…</em></p>\n\n<p>“Bound in human skin.” She told me in a slow, enunciated whisper. As I moved to touch the lock that graced the front of the magnificent artifact, she put her hand on the top of the chest to stop me. “Don’t open it. But you can hold it up to your ear.”</p>\n\n<p>So far, this entire conversation was perplexing, but I did exactly as she said. I held the box up to my ear, noting a certain warmth coming from it, and I heard a most peculiar rhythm from inside. It was slow, but steady, never stopping.</p>\n\n<p>“It’s <em>breathing.”</em> I gave her a look of amazement, continuing to listen. “And it has a heartbeat. What <em>is</em> this? Where did you find something like this?”</p>\n\n<p>The woman’s smile only widened as if she had never been so proud of a discovery in her life. “It’s from an old family collection,” she explained calmly. While she did, she took a few steps around the desk to inspect the other items on display. “As for what it is, well … none of us were very sure. But you’re an expert in these items, aren’t you? I think you can figure it out.”</p>\n\n<p>I nodded my head, admittedly excited by the prospect of learning more. But of course, there was the subject of payment to worry about.</p>\n\n<p>“This is a truly one-of-a-kind item.” I told her with a somewhat nervous chuckle. “What would it cost me to buy it from you?”</p>\n\n<p>To my surprise, the woman didn’t accept any money for the box. Rather, her eyes scanned towards the end of the table where she spotted the broken shards of the jester doll. One of her painted fingernails pointed to it with a determined smile.</p>\n\n<p>“I’ll trade you for that doll.”</p>\n\n<p>“The broken one?” I asked.</p>\n\n<p>She nodded, certain of her choice, and replied with a level of haughtiness. “I’m sure I can fix it up for my collection.”</p>\n\n<p>I would be a fool to say ‘no’, wouldn’t I? And that’s how I ended up with the most unique, yet mysterious object in my shop: a small chest, bound in human skin, with its own lungs and heartbeat hidden inside. I’m sure you can imagine the temptation to open it, but I’m refraining if only to learn more of its secrets. It isn’t kept on any shelf, nor is it on display for anyone to buy. Rather, it now sits comfortably on my desk for study and not for purchase.</p>\n\n<p>Tonight, I believe I will take the chest home with me to take a closer look. Though, I admit, I promised from the first day I worked here that I would never take anything out of the store. The trouble it could cause would far outweigh the pleasure of having a piece of this collection in my own home, but …</p>\n\n<p>Well, this artifact is special. And <em>I</em> am a professional. There is nothing in this antique that my expertise can’t handle.</p>\n</div>\n","author":"wendingus2"}