{"rank":"95","title":"I Worked At a Funeral Home Once","id":"8lf61g","url":"/r/nosleep/comments/8lf61g/i_worked_at_a_funeral_home_once/","time":"1527036327000","body":"<div class=\"md\"><p>I got a job at a funeral home in the spring.</p>\n\n<p>I wanted to assist the cremator, but it turns out funeral homes get a little apprehensive about hiring straight out of high school university students to handle the bodies they’re taking care of. I guess I was lucky enough to get a job at the front desk as a receptionist.</p>\n\n<p>Sitting on the edge of a small town near Lake Ontario, the funeral home only had a handful of employees. It was a small enough town that we weren’t always overloaded with work, but big enough that I didn’t know every single local that ended up in the freezer. We had Jerry the funeral director, me, the eighteen year old receptionist, and then there was Sam, who never left the back building during his shift. I think there had been another receptionist who came in on the weekends, and sometimes I saw an older woman driving a van in and out from behind the small building out back.</p>\n\n<p>It wasn’t the most exciting of jobs. I answered the phone and consoled mourning friends and family members when they came in. There was a huge stack of tissue boxes sitting under my desk right by my feet to make sure I never ran out. The highlight of my day would be leaving the front desk to offer tea and coffee to the family and friends waiting for a viewing. Sometimes I got to glimpse the body lying in the casket, vases of flowers in every corner of the viewing room. In comparison to what my boss and the cremator were doing in the small building in the back, it was a kind of boring job.</p>\n\n<p>My misconceptions about funeral home clients had led me to think that mourning friends and family members would be way too upset to even think about yelling at the lowly receptionist standing behind the desk. Unfortunately, being the lowly receptionist behind the desk meant breaking the news to sons and daughters that if they want to see mom one more time before she’s fed to the fire, it’s going to come at a cost. It takes time and effort to make corpses presentable, a seemingly unknown fact.</p>\n\n<p>Dead bodies bloat and decay. The eyes stay open, although sunken, and the mouth flops open as if their last moments had been one of terror, which usually isn’t the case. Not since hospitals became the normal place to die. The skin starts to slip off their bones, not to mention they’re going to start smelling without proper embalming. They’re not the perfectly well behaved bodies people often see on TV, arms naturally crossing over their chest, eyes and mouth staying shut without the help of wire.</p>\n\n<p>Despite the fact that I had been initially hired as a receptionist, my boss the funeral director, a middle aged man named Jerry, would often send me to the small building behind the funeral home where they did cremations. Considering I had originally applied as a cremator, you could imagine how excited I was.</p>\n\n<p>That was after a month and a half of working every weekday at the receptionist desk. I wasn’t going to complain if he wanted to take over the (very slow, and often lonely) job of answering phones, especially on days we didn’t have viewings. Looking back, I think he used to send me back there to give himself a break, especially when there were bodies to burn and a lack of viewings booked. Being the funeral director, Jerry could’ve easily helped with cremations instead of taking over the desk, but I guess his laziness won over his reluctance to trust an eighteen year old with no experience with bodies.</p>\n\n<p>The first day Jerry sent me to the small building out back, Sam had seemed pretty excited to have someone else to work with that wasn’t our boss. He greeted me, showed me where they kept the bodies in order (which I just ended up calling ‘the freezer’) and the crematories, which were basically huge ovens. Then Sam said: “Don’t you know you’re still going to be paid like a receptionist?”</p>\n\n<p>I knew, but I had just quit a retail job and wasn’t about to pass up putting “corpse burning” on my résumé. It totally beat “Sales Associate” or “Head Cashier” especially since Sam wasted no time teaching me the ropes; he taught me which bodies to fetch from the freezer, how to get them on the gurney without his help, and which tiles to roll over so the wheels don’t get caught and send the body flying. My biggest fear was having the gurney stall on a tile, the metal bars hitting me in the lower stomach and making me fall forward. Right into the corpse. Sam did it once as a joke to scare me, and it became an intrusive thought of mine ever since.</p>\n\n<p>Sam always hovered to make sure I was sliding the right corpse into the crematory. I’d always look back at him before he gave me the thumbs up to press the big red button that set off the flames. Without him watching over my shoulder every five minutes, I probably would have tossed the wrong body into the flames.</p>\n\n<p>Sam didn’t have the stereotypical <em>‘I burn bodies for a living’</em> look to him. He was in his mid twenties, a pretty friendly guy who had been out of school for a couple years. Even before I was being sent to the back to help him out, he’d spend some of his lunch break hanging out with me. I think he must of been the only one who really welcomed me to the funeral home. </p>\n\n<p>Most of my interactions with Sam included him trying to make me laugh, usually making fun of the way a corpse looked. Bloated faces and discoloured limbs were hilarious to him, but sometimes we talked about things other than the recently deceased.</p>\n\n<p>The days I was stuck behind the receptionist desk, I started to miss Sam’s company a lot, thinking about how lonely he must have been in that small building behind the funeral home. Or, maybe I was just projecting my loneliness on him while I greeted mourners and avoided telling them viewing costs.</p>\n\n<p>After my shift, which usually ended at 6pm, I made a point of stopping at the small building behind the funeral home to say ‘bye’ to Sam. Being the only cremator there, he usually stayed a couple hours before midnight before he went home. I was aware of the nights where he would stay all night, burning bodies to make sure he wouldn’t fall behind and be prepared for the next day. I never bothered mentioning it to him that I knew, knowing how cheap and lazy Jerry had a tendency of being. I doubt I was the first receptionist to be sent to the back building to help burn bodies while still being paid minimum wage.</p>\n\n<p>After those all-nighters, Sam would try his hardest to creep me out. I would be getting the gurney ready to work through the freezer when Sam would tell me he saw Mrs. Bella get up and try to escape the freezer the night before. His stories usually ended with him insisting he had to coax an animated corpse onto the gurney, which was a little creepy when you were about to do just that.</p>\n\n<p>The day I got my university acceptance, Jerry sent me to the back building to help Sam catch up with the body pile. As usual, I didn’t mind leaving the receptionist desk to help Sam. I had the email open on my phone, wanting to show Sam and thinking he would have been excited for me.</p>\n\n<p>When I got to the back room hoping to see Sam during his lunch break, I couldn’t find him. He wasn’t in his usual seat at the coffee table, where he was usually forced to sit alone unless I was sent back there early in the day. I left my bag on the coffee table and headed to the room where we keep the crematories.</p>\n\n<p>I ran into Sam in the dimly lit hallway connecting the room with the crematories and the freezer. He was standing at the corner, looking down at his phone when I literally walked right into him. I yelped in surprise, taking a step back before picking up my phone I dropped. He didn’t look at me, still staring down at his phone in mild annoyance.</p>\n\n<p>“Hey Sam,” I said, voice cheery. “Jerry sent me back here to help you out with the cremations. Are you all backed up?” I expected him to laugh at the question, but instead he took a moment to lift his head before he looked at me.</p>\n\n<p>He made a noise in the back of his throat that sounded something close to acknowledgment. Then his blue eyes went wide for a moment, as if just then realizing I was standing there. He put his phone back into his pocket before he forced a smile. “Oh, hey Leah.”</p>\n\n<p>Sam was unusually quiet during his shift that day. He didn’t bother cracking jokes or teasing me when I stuttered on one of the tiles with the gurney, jolting the corpse on top and nearly making it slide off. All I got was a half concerned glance as he tugged the front bars to help me get it over the rise of the tile. As I finished loading the body, getting it ready to slide into the crematory, I glanced over my shoulder when I didn’t hear the OK to press the big red button.</p>\n\n<p>He was looking off to one corner of the room, beyond the row of two crematories that took up most of the room. The corners of the room always looked dark, as if the ashes from the bodies had risen up and clung to the walls, which actually wasn’t the case. The entire back building was dimly lit, with many of the light bulbs in the ceiling burnt out since Jerry didn’t bother replacing them unless he absolutely had to. The shadows on the dirty ceiling often gave the effect of ash and grease.</p>\n\n<p>“Sam?” I asked, reaching up to touch his shoulder when he didn’t respond. </p>\n\n<p>Without looking at me, he checked the body, double checking the tag before looking to his list. He finally looked up and gave me a thumbs up, and I reached over to smack the big red button that released the flames.</p>\n\n<p>I knew his mother was in the hospital, so I reasoned his absent-mindedness to her. I wouldn’t have been surprised if he told me he had been texting his sister all day, who lived decently closer to the city where their mother had been admitted. </p>\n\n<p>“Hey,” I said, after a moment of stagnant silence. “Are you alright? You seem real distracted today.” Sam shook his head and another forced smile followed the action. </p>\n\n<p>“Actually,” he started, “about that. I was wondering if you could do me a favour. Like, a <em>really</em> big favour.”</p>\n\n<p>“I mean, I guess. Depends on what it is.” I knew whatever it was, I was probably going to say ‘yes.’ Sam hardly ever asked me for anything.</p>\n\n<p>“I’ve got a lot of work to do before tomorrow,” Sam told me. “Jerry overbooked the place so, you know, I’d usually stay the night to get the bodies ready. He’ll probably have you on receptionist duty so you won’t have to see me running around like a chicken with its head chopped off tomorrow morning. Thing is, I can’t stay the night.”</p>\n\n<p>“You want me to stay overnight and keep the crematories running?” I asked before he could suggest the question. </p>\n\n<p>“If that’s okay with you,” Sam said, looking a little sheepish about the request. Sam cared about this place way more than he was paid to. Looking back I think he must have cared about this place more than Jerry did. “Look, I know staying overnight at this place is a big thing to ask you to do, and Jerry probably won’t pay you for it. But I’ll cover it, I promise.”</p>\n\n<p>“I don’t know. I don’t think I’m legally allowed to run this place alone,” I told him. “What if I mess up? Jerry’ll probably fire me to cover his ass.”</p>\n\n<p>“You know what you’re doing,” Sam insisted. “Dude, you’ve been shadowing me for almost a month now. You already know what to do, I’ve seen you work on your own.”</p>\n\n<p>I was silent for a moment, and Sam must have taken that as a rejection because he ended up sighing and shaking his head. He grabbed my shoulder, giving it a small squeeze before he offered me a sympathetic smile.</p>\n\n<p>“You know, don’t worry about it. If we end up behind tomorrow, maybe that’ll finally light the fire under Jerry’s ass that’ll make him hire another cremator.”</p>\n\n<p>I didn’t want Sam to think I couldn’t do the job even though I wasn’t very confident in myself. Working at the funeral home, this job meant a lot to me. More than it should have. More importantly, I didn’t want to let Sam down. I wanted him to trust me.</p>\n\n<p>“Wait,” I blurted out when Sam started walking out of the cremation room. “Hold up, I’ll do it.”</p>\n\n<p>Sam turned around with a big goofy smile on his face. He patted me on the shoulder again and the action coupled with his smile made me feel warm. Well, warmer than when I was standing right next to the crematory through my protective gear.</p>\n\n<p>“Thanks Leah,” he said. “You’re gonna do awesome, don’t worry about it. Hey, maybe if we tell Jerry you ran the place by yourself, he’ll permanently move you back here with me.”</p>\n\n<p>We both knew how unlikely that was. Despite the fact that cremators didn’t make a whole lot of money, Jerry would rather toss himself into one of the crematories before he even thought about hiring another cremator to pay. But it was a nice thought that would get me through the lonely night.</p>\n\n<p>That evening, before Sam left at the end of his shift, he showed me where he left the clipboard with the list of names and the order they had to be worked on. He also left me his keys and showed me how to close up the place when I was finished. It was only important because we both agreed that Jerry shouldn’t find out until the next day, from Sam himself.</p>\n\n<p>“So, how come you can’t stay the night?” I asked as I walked Sam to the back door.</p>\n\n<p>“Well, it’s a Tuesday night and I have things to do,” Sam told me. I must have looked surprised because he bursted out into a laugh, smacking the side of my arm. “I’m joking. I have to go see my mom.”</p>\n\n<p>“Oh,” I said with a shrug. “That’s okay, you don’t have to tell me about it, then.” </p>\n\n<p>“Don’t worry about it. I’ll be here before the viewings start. You won’t have to do nearly as much work as you think. Oh, and make sure you’re alone when you close up, alright?”</p>\n\n<p>I laughed, thinking what he was saying was just a joke to creep me out during my first night alone at the cremation building. I saw his cheek twitch a little, in what I had assumed was a small smile. We said our goodbyes and I shut the door behind Sam, making sure to lock it.</p>\n\n<p>The small building behind the funeral home never creeped me out during the day when Sam was around. Even if Sam ran out for a quick minute to grab something, I never felt  scared in the presence of a pile of corpses. Creeped out maybe, but as a budding anthropology student, my interest in death was a given.</p>\n\n<p>I started from the top of the body list. Even though Sam had taught me how to get through the pile faster, the bigger bodies going in before the smaller ones, I didn’t want to mess anything up. So, I started in the order that the list gave me. Thankfully, Sam didn’t leave me to drown on my first night alone. He had taken time out of his shift to stack the bodies in manageable piles, the top of the list, of course, being the top of the pile.</p>\n\n<p>The first body I placed on the gurney belonged to a middle aged woman named Jenna Paprik. She was a smaller woman, around my height, but uncomfortably skinny. I didn’t know how she died, but the old woman with the van had picked up her and a couple of other bodies from the local hospital. I rolled her out, hyper aware of the raised tiles as I pushed her down the hallway. Sam wouldn’t be here to laugh at me if I tripped and ran into the gurney, but he also wouldn’t be here to help me get her back onto it. The only sound in the hallway was the sound of the old wheels squeaking along the floor. The silence, coupled with the low buzzing of the cheap lights in the ceiling, was starting to make me uncomfortable.</p>\n\n<p>When I got to the room with the crematories, I double checked the list to make sure Jenna Paprik’s family didn’t want a viewing before I fed her to the flames. They didn’t. I wondered if she had anyone at all that wanted to see her, or if she was doomed to be a box of anonymous ashes for distant family to pick up.</p>\n\n<p>Sam often told me about the bodies that were brought in when we worked together. He spoke about the cause of death, and who they had been but I didn’t listen much. I felt if I started thinking of these corpses as real people that had goals and aspirations, I wouldn’t be able to feed them to the fire and then scrape them out. I must have been right.</p>\n\n<p>After feeding Jenna Paprik into the flames, I sat down on the stool Sam usually occupied and looked over my list. The silence was chased away by the sound of the crematory, an absolute monster that filled the air with crackles and flames. I dreaded going back into the quiet hallway and into freezer, where I’d be met with low buzzing and the thrumming of the cooling system, so I unwound the earbuds from my cell phone after pulling it from my pocket.</p>\n\n<p>I had two text messages. Before Sam left, I had texted my mother telling her I would be sleeping over at a friends house for the night. I wasn’t about to tell her I was spending the night in an empty funeral home, technically unpaid. The second was a text from Sam, just a simple ‘Good luck!’</p>\n\n<p>With my earbuds in my ears, I found it easier to find comfort in the small, empty building. I filled the other crematory with the second body, Andrew Denson. Andrew looked around my age, which I’ll admit, made me a little uncomfortable, especially since the family didn’t want to see their kid one more time. Almost reluctantly, I gave him the same fate that Jenna Paprik had just a half hour before.</p>\n\n<p>Then came the boring part. With only two crematories, I was forced to wait until the bodies were nothing but ashes, which often took roughly two hours with adult bodies. I checked my phone, seeing it was about to be midnight, but I was making good time. Even if I wasn’t able to get through all of the bodies, it’d really lighten the load for Sam tomorrow morning.</p>\n\n<p>It couldn’t have been fifteen minutes since I pushed the big red button on Andrew Denson. I was sitting there dozing off, only staying awake because of the music playing from my phone and the fact that I was forced to sit up. I wouldn’t have been able to hear the rattling coming from Andrew Denson’s crematory, and I didn’t, but when I lifted my head, I saw the huge, metal door jolting forward. It opened by not even an inch but it was enough for me to notice. It shook as if something was trying to push it open, only to be stopped by the latch.</p>\n\n<p>I stood up, thinking my eyes were playing tricks on me. Considering I’d usually be at home getting ready for bed at this time, it wasn’t hard to believe. I didn’t move from where I was standing, but I pulled my earbuds out of my ears. The room was filled with the same crackling flames confined to the crematory, but there was another noise there too, and I wouldn’t have noticed it if I hadn’t stood there in silence for a moment.</p>\n\n<p>It sounded like breathing. Not my own breath, which I had then realized I was holding, but laboured breathing to the beat of the door jolting hardly an inch off the opening of the crematory. It would have swung wide open if it hadn’t been for the latch. Something in there was being suffocated.</p>\n\n<p>Then came the screaming. It was shrill, and I initially thought it was the sound of something sizzling, getting ready to pop. It stopped and I heard a gasp, lungs trying to fill with oxygen but getting nothing instead. The shrill scream started again as the door tried to swing open.</p>\n\n<p>I couldn’t move from where I was standing. Andrew Denson was dead. He was on my list and he was <em>very</em> fucking dead when I put his body on the gurney and stuffed him into the machine.</p>\n\n<p>Despite the fact that I knew Andrew had been dead, I was convinced I was hearing someone be burned alive. I fucked up big time and I threw some living guy into the crematory. I wasn’t thinking properly when I shoved my phone into my pocket and leaped towards Andrew Denson’s crematory. If I had thrown a living guy into a crematory, then that means the old woman with the van had picked up a living guy from the hospital, and the nurses and doctors before her had announced a living guy dead. I wasn’t thinking about that when I tried to tug open the crematory door, realizing I had to turn it off before throwing over the latch.</p>\n\n<p>I smacked at the side of the machine next to the big red button, trying to remember how to turn it off as the shrill cries grew louder. The sound of the flames finally died down and I could make out what the shrill screams were saying.</p>\n\n<p>“Stop!” cried shrivelled lungs. “Stop! Let me out!”</p>\n\n<p>The door tried to swing open again, and without waiting for the machine to cool, I threw over the latch and yanked the door open. I screamed, falling backwards.</p>\n\n<p>Up until that moment, corpses went into the crematory fully intact. A couple hours later, they left the machine as a pile of ashes and maybe a couple bits of bones that needed to be ground up. When I threw open the door, a burned, blackened hand reached out toward me. Andrew’s light brown hair had been burned off completely, his skin in a cracked, charred state. His eyes must have lost moisture completely, but his puffy blackened lids stopped him from fully looking at me.</p>\n\n<p>“I can’t feel my chest,” came a low, wheezing voice. I could hear Andrew’s lower body struggling to push him forward, limp legs pushing against the floor of the crematory.</p>\n\n<p>I backed away from the outstretched hand. Andrew was coming toward me, trying to pull himself out of the crematory and onto the floor with me. His hand lifted again, faster than I had expected it could and grabbed at me. I felt a tugging around the back of my neck, and my wide eyes glance down at the charred fingers, realizing he had snagged my rose quartz necklace. Frantic, I smacked at his cracked, blackened hand, crying out when I fell back and broke free.</p>\n\n<p>I took off, and I didn’t look back.</p>\n\n<p>My sprint out of the building was only stopped when I had to look for the right key to unlock the back doors. I could still hear the shrill cries from behind the crematory room doors I had shut behind me. When I was out, I slammed the back door shut behind me, making sure to lock it.</p>\n\n<p>I stood there behind the building in the dark for some time, trying to catch my breath and block out the thrumming in my ears from my rapid heart beat. I didn’t realize I was still in protective gear until I felt how warm I was standing in the cool night air. I tugged my gloves off and put the goggles on my forehead.</p>\n\n<p>I didn’t know what to do. I couldn’t call my mother and tell her I had agreed to stay at the funeral home overnight and had accidentally burned a guy alive. There was no way in hell I could call Jerry about the mistake that had been made either. At that point I was also contemplating calling the police, but I was also afraid of getting in trouble. How do you explain you accidentally threw someone into the crematory thinking they were a corpse? If the funeral home’s eighteen year old not-cremator was charged with manslaughter, wouldn’t that mean the whole funeral home would get in trouble too?</p>\n\n<p>There was something sitting in the back of my mind, something I was doing my best to ignore. It was the fact that there’s no way Andrew Denson had been alive when I wheeled him into the cremation room. He was dead in the freezer, dead in the hallway, and dead in the crematory. I didn’t want to face this fact, instead willing to believe he had actually been alive all along.</p>\n\n<p>I ended up calling Sam.</p>\n\n<p>The phone rang and rang, and as I stood there in the dark I was afraid he wasn’t going to pick up. A small part of me actually hoped he wouldn’t pick up so I didn’t have to pull him away from time with his sick mother. I couldn’t last the night alone getting through the body pile and I had accidentally burned someone alive. Either way, he was going to be disappointed in me.</p>\n\n<p>Finally, Sam picked up his phone.</p>\n\n<p>“Hey, Leah?” he said in place of a greeting. He sounded so far away, as if he were speaking at the phone from the other side of the room. “What’s up? Are you alright?”</p>\n\n<p>“Hey,” I replied, and I realized my voice sounded small and shaky. “Hey Sam. I think I screwed up real bad.”</p>\n\n<p>I told him about Andrew Denson. I made sure to specifically mention how dead he was when I put him on the gurney, rolled him down the hallway, and started up the machine. He was just lying there. Like a corpse. Up until twenty minutes ago, he was nothing more than a corpse.</p>\n\n<p>“Okay,” Sam said, and he didn’t sound annoyed or disappointed like I expected him to. He didn’t even sound surprised. “Stay right there, I’ll be there in ten.”</p>\n\n<p>I stood there in the dark, hyper aware of every little sound around me. I didn’t look back at the door, thinking I might see the charred and cracked body of Andrew Denson behind the grimy windows.</p>\n\n<p>Sam showed up in five minutes, which was surprising because I never saw the lights of his car when he pulled up in the nearby parking lot. He looked really calm, way calmer than I expected him to look and a lot less distracted than he was during the day. He even greeted me with a smile, which I probably responded with a slight smile of my own.</p>\n\n<p>I unlocked the door, and we went back into the building with me following closely behind him. The shrill screaming had stopped, and all that could be heard was the roar of the crematory as it burned Jenna Paprik. The lights flickered a little as Sam walked down the hall, as they usually do, but in the paranoid state I was in, it made me uncomfortable.</p>\n\n<p>Sam opened the door and I let it swing shut behind him, deciding whether I wanted to face Andrew Denson again or leave. I didn’t want to leave Sam alone, and I also didn’t want to make him think I was suddenly scared of being a cremator so I pushed the doors open and joined them.</p>\n\n<p>Everything was exactly how I didn’t leave it. The machine on the far end of the room, the one I had stuffed Andrew Denson in, was shut. The crematory wasn’t on and I spotted Sam setting it back up to burn. He looked over at me before beckoning me over.</p>\n\n<p>“You sure this is the one?” Sam asked, as if there weren’t just two crematories in the room. Or maybe it was disappointment in his voice. My heart sank when I realized he was forcing himself to believe me.</p>\n\n<p>“Yeah,” I told him. “It looked like he was trying to get out. I turned it off and I pulled the door open and he was trying to crawl out. I swear, Sam.”</p>\n\n<p>He wasn’t going to tell me about how unsafe it was to yank the doors open before it cooled. I wondered if he was going to tell Jerry about what happened. If I wasn’t so shaken, I would have been worried about losing my job.</p>\n\n<p>“The door was shut when I got in here,” he tells me. “The latch was shut on it too. Are you sure you didn’t just get creeped out? I won’t laugh at you, I promise. This place can get really creepy at night.”</p>\n\n<p>“No, I swear!” I insisted, but I couldn’t prove it. I couldn’t exactly open the door on the machine and show him how Andrew wasn’t lying on his back anymore.</p>\n\n<p>I didn’t push it after that, feeling too shaken to feel embarrassed about the whole situation. Thankfully, Sam didn’t hold it over my head. He must have finished whatever personal business he had to take care of, because he spent the rest of the night with me going through the bodies.</p>\n\n<p>At around 2:30am it was time to scrape Andrew Denson out of the machine. Sam was already getting Jenna’s ashes together, the small bones getting ready to grind into a fine powder, so that left me with Andrew. I wondered if Sam did that on purpose, so I’d have to face the fact that what I thought had happened hadn’t actually happened.</p>\n\n<p>It would’ve worked too. When I scraped out his ashes, I had been ready to accept that maybe I had been too tired to work the night shift and started hallucinating when something shiny caught my eye. With a gloved hand, I sifted through the ash, picking up a very tiny shard of what I thought was glass. There were other tiny shards catching the light in the ash, and what I thought was glass had actually been my rose quartz. It must have been yanked from my neck. The leather strap would have burned up completely, leaving the rest of the necklace to heat up and break.</p>\n\n<p>My stomach filled with dread and I felt sick. I must have looked pale because Sam asked me if I was alright. Swallowing down the feeling, I looked up at him and forced a smile, nodding as I returned to Andrew Denson’s ashes. I knew Sam wasn’t going to believe me, so I didn’t bother telling him. I knew he would just come up with a logical explanation, like maybe my necklace had dropped on the body while I was wheeling it out of the freezer. It wasn’t possible. The leather strap forced me to lift it over my head if I wanted to take it off.</p>\n\n<p>I felt sick right up until 5am when we had finally gotten through a good chunk of the pile for the night. Jerry would be coming in two hours to open up the funeral home, setting up for the first viewing of the day. Sam offered to close up the building so I could get some sleep before we were both dragged back to work. The buses were running at this time, but the funeral home was only a twenty minute walk from where I lived. I walked since I felt a little too shaken to stuff myself onto a potentially packed bus. </p>\n\n<p>When I got into my bed, the sky already becoming a light blue, I found I couldn’t sleep despite being exhausted. Every time I shut my eyes I saw Andrew Denson reaching toward me and grabbing my rose quartz off my neck. I heard the shrill screams coupled with the sound of sizzling, waiting for the <em>pop</em>. I stayed awake right up until my alarm went off, telling me I have to catch the bus back to the funeral home.</p>\n\n<p>Jerry didn’t say anything when I walked in to stand behind the desk ten minutes before opening. I hoped the concealer I smeared under my eyes made me look a little more awake, and since there was going to be a couple of viewings today, it wasn’t unusual for me to show up with a face full of makeup.</p>\n\n<p>Throughout the entire day, Jerry kept coming out from the small building behind the funeral home, grumbling to himself. More than usual, anyway. I wanted to go to the back and check on Sam, but my entire day was spent giving out condolences and serving tea and cookies. More than anything, I wanted someone to talk to about what had happened, even if Sam didn’t believe me.</p>\n\n<p>My shift finally ended, and as the family members of the last viewing left the funeral home, I closed up. I left the door unlocked, knowing Jerry usually leaves his car keys and belongings behind the desk and would be back to grab them. I was surprised when Jerry met me at the door of the building behind the funeral home.</p>\n\n<p>“Oh, hello Jerry,” I said, trying to hide my surprise to see him. He looked vaguely annoyed to see me there.</p>\n\n<p>“Shouldn’t you be heading home?” he asked. I shook my head.</p>\n\n<p>“I am, but I wanted to say ‘bye’ to Sam before I go. I haven’t seen him all day.”</p>\n\n<p>“You and me both. If you see that lazy bastard, tell him Jerry’s looking for him.” He stomped away, and I was left standing there in confusion.</p>\n\n<p>I pushed the door open, calling for Sam, and was met with no response. I didn’t want to be afraid of the building, especially since I wanted to work there permanently, but after the events of the night before, I couldn’t help but be unsettled about returning. I quickly realized Sam wasn’t there, and he likely hadn’t been there all day.</p>\n\n<p>Sam didn’t show up to work the next day or the day after that.</p>\n\n<p>Sam didn’t answer any of my texts, either. Jerry didn’t exactly seem concerned about Sam, insisting that he was just avoiding work. If Sam were to walk through those doors, Jerry would have fired him right there on the spot.</p>\n\n<p>It was clear to me that Jerry had given up on Sam. I wondered if he had ever cared about Sam beyond Sam being his employee, which really wasn’t a lot to begin with. I guess he had no choice but to find a replacement for Sam, and he seemed more annoyed about the fact that he’ll have to start sorting through résumés.</p>\n\n<p>It was that Saturday that I was visited by two police officers in uniform. My mom was alarmed when she opened the door and they asked for me, and I’ll admit I felt a little nervous about it as well. I thought maybe they’ll start asking me about Andrew Denson and if I knew he had been burned alive. That was the lie I was still telling myself, that Andrew Denson had been alive when I wheeled him from the freezer. It was the only way I could justify how my rose quartz ended up in Andrew Denson’s ashes.</p>\n\n<p>When they first came in, the first officer had asked if she could speak to my privately. I complied, of course, but my mother had insisted on sitting in on the conversation. The officer’s partner sat nearby with my mother, who was concerned I had gotten myself into trouble. </p>\n\n<p>To my relief, and then to my immediate dread, the officer brought up Sam. She first asked me how long I had known Sam, and how often I saw him. Then she asked if I knew if there was anyone who would possibly want to hurt Sam. I don’t think I hid how upset I was very well, because the officer looked at me with sympathy clear on her face when I told her ‘no.’ I told her I hadn’t known Sam for very long, but he was a really nice guy and I couldn’t imagine anyone hating him, except for maybe Jerry for superficial reasons, but he hated everyone. She grilled me for a little bit longer, as sympathetic as she could. </p>\n\n<p>Then the officer said: “Are you aware Samuel Mitchell’s body had been discovered last Wednesday morning?”</p>\n\n<p>I was distraught. I felt tears prick behind my eyelids and I blinked them back, not wanting to cry in front of my mother or two officers.</p>\n\n<p>“No,” I told her, voice shaky. “I didn’t know that.”</p>\n\n<p>The officer told me they suspected foul play. That’s all she said, ‘foul play.’ What she didn’t tell me was that Sam’s car had been found pulled to the side of the road, a half hour drive away from where he lived. It was one of those roads close to the forested paths that didn’t have any lights, so at night it was pitch black. His body had been found a twenty minute walk from the car, deep into the woods. Two university students out on a hike that morning had found him and immediately called the police. He had been driving back from seeing his mother at the hospital.</p>\n\n<p>There had been no doubt Sam was dead. His face had been disfigured beyond recognition, eyes beaten until the lids swelled black, cheeks and lips hanging off his face in what had looked to be crude knife cuts. The rest of his body had been beaten severely. When I later saw him, I wanted to say he had been hit by a truck and then backed up on in an attempt to crush him beneath the wheels. Apparently they suspected the work of only a single person.</p>\n\n<p>“The body was discovered around 7am,” the officer told me. “But we suspect his body had been there for a couple of hours. Closer to midnight.”</p>\n\n<p>Confusion overtook my dread when I realized Wednesday morning had been when Sam and I had been rushing to get through the piles at the funeral home. I rubbed at my eyes with the back of my hand, brows furrowed.</p>\n\n<p>“That can’t be right,” I told the officer, and she looked surprised. “I saw Sam after midnight.”</p>\n\n<p>“What do you mean?”</p>\n\n<p>I glanced at my mother before I decided that telling the whole truth would help me in the long run. “I was having some trouble alone at the funeral home, that’s where me and Sam worked. It was my first night shift alone and I got a little creeped out, so I called him. He showed up a couple minutes later and stayed with me during my shift. That was a little after midnight, and he stayed until morning.”</p>\n\n<p>From the corner of my eye I could see how alarmed the officer’s partner looked. My mother looked equally alarmed, but I didn’t know if that was because I admitted to seeing Sam after he was supposed to be dead, or because she found out I had agreed to stay overnight at the funeral home.</p>\n\n<p>“And you’re sure this was Samuel Mitchell?” the officer asked, her voice slowing as if there’s a chance I could be confused by the question. I nodded.</p>\n\n<p>“I called his phone and it was definitely Sam.”</p>\n\n<p>After making me repeat what happened, excluding Andrew Denson trying to throw open his crematory, the officer thanked me for my time, and then thanked my mother to be polite. Her partner still looked spooked, and at the time I would have been too, if I hadn’t been so upset over finding out my friend had been murdered.</p>\n\n<p>Even worse, I was apparently the last person to see him <em>after</em> the murder. Except he had been very much alive.</p>\n\n<p>I got into a fight with my mother after the police left. She didn’t like me working with bodies and she was pretty sure I was a <em>receptionist</em>, which opened up a whole bunch of other problems including legality. I didn’t doubt Jerry owed me more money than I had been paid.</p>\n\n<p>She told me she didn’t want me working there anymore, and I reluctantly agreed to quit when she threatened to drag the law into the situation. As much as Jerry annoyed me, he had been the one who gave me the opportunity in the first place. I also thought about how much Sam cared about that funeral home as well. I told her I’d hand in my resignation on Monday and she finally left me alone. </p>\n\n<p>It was that Monday that I found out Sam was going to be cremated at the funeral home he had worked at. Jerry was surprisingly the one who told me, and this was immediately after I had handed him my resignation. He actually seemed sad when he told me.</p>\n\n<p>Sam wasn’t going to have a viewing. Jerry was a pretty good mortician, but I didn’t think even he could make Sam presentable again. When I realized I wouldn’t get to see Sam one more time, without the reminder of what had happened to him, I nearly bursted into tears behind my desk. How could I have explained to mourning clients that I myself was mourning a friend I had only known for a couple of months?</p>\n\n<p>It’s Tuesday now, a week after they found Sam, and I want to be the one to cremate Sam’s body. It isn’t something I had to think hard about, and I’m pretty sure I had decided on it the moment Jerry told me Sam was being cremated here. It wouldn’t be hard to do either.</p>\n\n<p>Sam is being cremated on Friday, the day the new cremator is supposed to show up. I met him when he showed up for the interview. He’s a quiet guy named Alex who keeps his head down. I can already tell it won’t be hard to insist I take the night shift from him.</p>\n\n<p>As it stands, I’ve accepted what happened with Andrew Denson wasn’t just something I hallucinated. On Friday, I’ll wheel Sam out of the freezer and re-introduce him to the crematory. Somehow it feels right that I’ll be the one to lift him on the gurney and press the big red button. At midnight, I’ll be able to give Sam a proper goodbye.</p>\n</div>\n","author":"TerribleEyes"}