{"rank":"35","title":"Part 1: Government Human Experiments","id":"8lf80o","url":"/r/nosleep/comments/8lf80o/part_1_government_human_experiments/","time":"1527036826000","body":"<div class=\"md\"><p><a href=\"https://www.reddit.com/r/nosleep/comments/8lx3wb/part_2_government_human_experiments_the_lab/\">Part 2</a></p>\n\n<p>I sat at the desk in my little corner office, looking out the windows behind my chair, enjoying the vibrant colors of the setting sun. One of my favorite things was always to watch the sun rise and set, the beginning and the end. I took a draw from my pipe and enjoyed the taste of the smoke before I exhaled. As much as I enjoyed the short moments of peace like this, I knew they were not going to last very long. A man with skillsets like mine were always in high demand, and people always find a way to figure out where people like me go, even if we try to disappear. ZZZZZ, ZZZZZ, ZZZZZ. I took another draw from my pipe and let out an exaggerated exhale, knowing that my next task was about to come up. ZZZZZ, ZZZZ, ZZZZ. I swiveled my chair around and picked up my phone, sliding the bar at the bottom of the screen to answer the phone. A very hoarse voice spoke into the phone, speaking clearly but quickly.</p>\n\n<p>“New assignment came up for you, meet your handler under the central bridge in 30 minutes.”</p>\n\n<p>Click. The sound of the line ending was the only goodbye I was given. I took one last draw from my pipe and dumped the charred tobacco into my trash can, a little sad the bowl was only halfway done. I put the pipe in my top right drawer and grabbed my keys, then began to make my way to my car. As I walked around the empty parking garage, I got to the jet black sedan and proceeded to start the car. The news came on the radio, announcing the 30 teenagers to go missing in the past 6 months still had not been found. I found it quite strange that this many kids were disappearing, but more so that fact that all of them were around the ages of 17-18. High school aged. I switched the radio to the first jazz station I could find in hopes of relaxing a bit before this next contract came in. As I navigated through town, I glanced at my watch and saw it had been 20 minutes since the call came in. I picked up the pace a little as I didn’t like to make it a habit to piss off my employers. I pulled up by the bridge and put two quarters in the parking meter, giving me 30 minutes of time to take care of business. I took the stairs to the sidewalk beneath the bridge and began to walk underneath the bridge. I glanced at my watch and saw that it was now exactly 30 minutes since I got my call.</p>\n\n<p>“Excuse me sir, could you please spare some change for a homeless old man?” the bum sitting in the shadows asked me, without making eye contact.</p>\n\n<p>“Of course I can, here.” I said with my stern, deep voice as I pulled a twenty out of my pocket and handed it to him.</p>\n\n<p>It was at this point that everyone around us had cleared away, and after doing one final glance to the left and right, he stood up and dusted himself off.</p>\n\n<p>“I really hate doing this cover sometimes you know? Being a fucking homeless guy. Hell I have to jump in a dumpster everytime to get an authentic smell so no one suspects anything.” My handler, Syver, complained.</p>\n\n<p>“Bleh save the sob story for someone who gives a shit. Last I checked you don’t get called during your relaxation times to come and clean up messes that other people seem to have a huge habit of making.” I responded</p>\n\n<p>“Watch it there Conte, we all answer to a superior. You should know with your time spent in special forces.” He began to lecture me</p>\n\n<p>“Yea, yea blah blah blah. You fucking government types never know when to shut up. Listen, its getting late on a Friday, you smell and look like shit, and people could be beginning to start walking here at any moment. Hurry up and tell me whats going on.” I sharply responded</p>\n\n<p>Syver let out an exaggerated gasp.</p>\n\n<p>“Since you asked so nicely, theres been a government project in town that recently shutdown. Something to do with human trials and experimentation. Possible genetic splicing and alteration. We don’t know the location of where it was but we know its within 100 mile radius of town. The only problem is the division files all disappeared and there were no backups.”</p>\n\n<p>“So let me get this straight, you’re going to have me search this town and the surrounding area in hopes that I stumble upon some secret government lab, which you also know nothing about?” I questioned, becoming increasingly annoyed</p>\n\n<p>“No. We know the location of a scientist who worked there. He’s trying to flee the country but so far we’ve been able to cancel or redirect his flights. He’s in a town about 3 hours drive from here. We have the motel room and everything that he is staying in. There will be a folder in your apartment with all the relevant information about him.”</p>\n\n<p>With the meeting finally done, I shook Syver’s hand and made my way back to my car. I began the drive back across town to return to my apartment building and get ready for my upcoming mission. I parked in the lot outside my apartment and made my way to the second floor, to the room at the very end of the hallway. I turned my key in the lock and walked indoors, enjoying the homey smell my apartment has. I lit a candle and put my kettle on the stove top. I pulled out my favorite mug and filled my diffuser with green tea leaves. With all the prep work done, I proceeded to my bed room. Inside was a black armored trunk, a dresser, and then my rather closet that contained my collection of suits. I began to take my clothes off and look in my full body mirror as I did. As the layers came off I observed my medium stocky build, my abs and muscular arms, and the veins protruding from my arms and neck. I ran a hand over my silky smooth dome, and then brought it down to twiddle with my moustache. As I stood naked in the room, I slipped on a pair of pajama pants and my bath robe. I walked out into the living room as the kettle began to whistle and poured my cup of tea. With my tea in hand, I sat down at my desk in the living room and turned on the lamp. A black folder with big red letters that read “CLASSIFIED” lay on the desk. I took a sip of my tea and began to dive in.</p>\n\n<p>“Dr. Johnathon Cloutz.  38 years old. PHD in human genetics and biology. Attended school at MIT, Stanford, and Notre Dame. Graduated valedictorian of his class for all his degrees. Now with all these credentials what were you doing working for the government?” I spoke aloud to myself, genuinely curious.</p>\n\n<p>I looked at the picture of the man that was included. He appeared to be about 6’2, was very slender with straight blonde hair and round eye glasses. I had no doubt that getting information out of this guy would be no problem at all. Egg heads like him usually never spent time getting physical when they were younger and typically have low pain tolerances. I smiled a wolf’s grin as I thought about how much fun this was going to be, it had been a while since an assignment like this had come in. Attached in the file was a paper with all the information and instructions I would need.</p>\n\n<p><strong>Acquire location of lab from Dr. Cloutz.</strong></p>\n\n<p><strong>Acquire any relevant information about experiments that occurred at lab.</strong></p>\n\n<p><strong>Find out if he told anyone, if there are any copies of data, anyone else from the lab around.</strong></p>\n\n<p><strong>If so, find copies of data and destroy them.</strong></p>\n\n<p><strong>After all intelligence has been ascertained from him, terminate him.</strong></p>\n\n<p><strong>Find anyone he may have told or who also worked in the lab, and terminate them.</strong></p>\n\n<p><strong>Report back at ‘phone number redacted’ with findings for further instructions after task is complete</strong></p>\n\n<p><strong>He is located at ‘City, zipcode, motel name, and room number redacted’</strong></p>\n\n<p>With my mission and task clear, I made my way into my room and got on top of the twin sized bed in the corner of my room. I shut my eyes and within seconds sleep enveloped me.</p>\n\n<p>I opened my eyes smoothly and sat up out of bed. I looked at the red numbers on the night stand next to my bed. It read 03:30. I flipped on the lights to my room and unlatched the top of my trunk. As I opened the top the extensions of the inside folded out to the left and right. I pulled out a pair of my black tactical pants as well as a plain black T-Shirt. I put on my clothes and then slapped on my pair of black combat boots as well. Cliché, I know, but if it works it works. From the right extension I selected my favorite folding pocket knife and grabbed my trusty side arm. I ran my hands along the opaque metal of the 1911, feeling the heavy weight and cool steel in my hands. I took a glance and the smiley face sticker on the handle and smiled a little. I grabbed the black suppressor and screwed it onto the end of the barrel. I grabbed my three magazines, loaded one in the pistol and racked the slide. The other two I put in the designated pockets on my pants. I slide the pistol into the holster on my pants and looked at myself once over in the mirror before I closed my trunk and made my way to the kitchen. My coffee machine already had my brew ready so I put it in my travel mug and grabbed a protein bar from my cabinet. Sadly there was no time for a complete breakfast this morning.</p>\n\n<p>By the time I had made my way to the neighboring city where Dr. Cloutz was hiding, it was about 7 am and the sun was beginning to come up. I needed to work quickly if I was going to grab him. I pulled into the motel parking lot and parked as close to the room as I could get. It was a shitty run down roach motel with the only other car parked at the front desk. I approached the door that was his room number and pulled out my lock picking kit. Within seconds I had the door unlocked and drew my sidearm. I walked into the room and locked the door behind me. I made my way to where the bed was and noticed the still body that was there. I turned on the lights to the room and ripped off the covers. Dr. Cloutz awoke with his eyes wide, filled with terror as he saw a menacing bald man in his motel room toting a pistol.</p>\n\n<p>“Good morning doctor, I don’t know if your secretary told you but I happen to be your first appointment of the day” I said with a smile on my face.</p>\n\n<p>“wh… wh… who are you?” he questioned, with his lip quivering and entire body shaking with fear.</p>\n\n<p>“I’m room service. I’m here to clean up your room. Not very bright for how many degrees you have huh?” I replied sarcastically.</p>\n\n<p>His eyes became even wider as he made the conclusion of who I was and why I was here.</p>\n\n<p>“NO. NO PLEASE, I beg you! Don’t kill me. I swear I didn’t know that we would be experimenting on children, I only wanted what was best for humanity, but I didn’t want to do it like this.” He pleaded “It wasn’t my fault. I was only following orders, they said that they wanted results and that they would be bringing us the test subjects and we were to ask no questions about it.”</p>\n\n<p>“Wait, what the fuck are you talking about?” I was become slightly heated. I aimed my pistol at him “You had better explain, and you had better do it in plain English too.”</p>\n\n<p>“We were part of a research group, we were tasked with increasing the survival capabilities of human beings. They would give us test subjects and have us splice the DNA of these subjects with different species to try and get results. Sometimes it would be octopi, cuttlefish, cock roaches, any animal that was deemed to have a desirable survival traits. I wanted out the moment they starting bringing in children as the test subjects but I swear that I did not want this.” He explained to me.</p>\n\n<p>“All right, I’m going to ask you a few questions, and I promise that it is in your best interest to tell me that truth. Does anyone else know about this? Is there any collection of data about what you were doing? And where is this lab?” I questioned him.</p>\n\n<p>“The only copies of the data are in the lab, and I’m the only one who knows the details of the lab, everyone else was either killed or lost in the lab when we had a breakout. I was fortunate enough to not be in the lab the day it happened and so that’s why I was running.” He told me</p>\n\n<p>“Wait, you said breakout? What breakout, what the fuck do you mean breakout? I thought this was a research lab, not a damn prison.” I was getting more and more annoyed by the second.</p>\n\n<p>“We were doing human experimentation in the labs. The breakouts were the test subjects getting out of their cells and beginning to attack the scientists. As a failsafe, the lab locked itself and it is impossible to get in without my universal login code for the terminals.” He stated</p>\n\n<p>“Ok, so here is what is going to happen. You are going to write down where the lab is, how I get there, and the login code for me to get in. Or your last few moments on earth are going to be incredibly painful” I told him</p>\n\n<p>He got a piece of paper and began to write out what I asked him.</p>\n\n<p>“After what I’ve seen, after what I’ve done, I welcome death. If there is a hell I earned a one way ticket there. That’s for certain. The lab entrance is in the basement of the local high school, just follow these directions and when you get to the basement you’ll see an old computer. Type in this login code and the elevator will take you down. Just know, the horrors you will see down there can’t be unseen.”</p>\n\n<p>“Yea yea yea, horrors, scary shit, just give me the paper.” I snatched it out of his hands.</p>\n\n<p>After looking over what he gave me, I proceeded to put two rounds in his head and one in his chest. I then holstered my pistol and made my way out of the room locking the door and putting the do not disturb sign on the door handle. I got in my car and drove a few miles away and pulled out my phone. I dialed the number given in my folder and the phone began to ring. When it was picked up I stated</p>\n\n<p>“Dr. Cloutz has been dealt with, the location of the lab has been attained. All copies of relevant data are in the lab and no one else outside the lab knows what was going on.” I briefed over the phone</p>\n\n<p>The same hoarse voice that called me originally the day before replied.</p>\n\n<p>“Excellent. Return back to town. You’re going into the lab and cleaning up this cluster fuck of a mess. I want this issue solved within 48 hours. Call this same number when you are done, and proceed with extreme caution. No one knows what was going on in that lab.”</p>\n\n<p>The usual audible click indicating that my conversation was over gave me a bit of satisfaction. I never knew why I enjoyed doing things like this, but man do I have a ball with them. I opened the center console of the car and pulled out one of the cigars. I opened the windows and proceeded to cut the end of it. I then put the cigar in my mouth and lit it, enjoying the smokey flavor. As I put my sunglasses on, I pulled my car onto the interstate and began my journey back home. As the words of Dr. Cloutz sunk into me, I began to have a feeling of dread. Human experiments. Gene splicing with other species. Children. I shuddered at the last thought and pushed it out of my mind. Best not to think about it until I absolutely have to.</p>\n</div>\n","author":"Shadelsmra"}