{"rank":"14","title":"(Part 1) The Knock At The Door Made The Kids Disappear","id":"8lfapl","url":"/r/nosleep/comments/8lfapl/part_1_the_knock_at_the_door_made_the_kids/","time":"1527037479000","body":"<div class=\"md\"><p>It was Thursday. The kids were out playing in the back when I got a knock at the door. I told them to stay there and that I’d be right back. They were old enough for me to trust that they’d do what I’d say. </p>\n\n<p>The man at the door had a package that needed to be signed off. I was confused because I hadn’t ordered anything but I signed anyways. I went through the house and set it on the table. I checked the back and made sure the kids were all right before going to the kitchen to open the package.</p>\n\n<p>It wasn’t to a specific name so I wasn’t sure if it was mine or my husband, Ian’s. I opened it and couldn’t have ever expected what it was. It was a note in a random note looking form. It was the type that had the newspaper clippings all over it as the words instead of being hand written. I quickly called my husband in confusion due to him answering and being okay. I told him what the note said and he was confused as well. We have 2 kids, both of which are playing in the backyard as this is happening. </p>\n\n<p>“24,000 per kid. 24 hours. Will be in touch.”</p>\n\n<p>I ran to the back after reading it to find them no where in site. I instantly started screaming for them. </p>\n\n<p>“Liam!!” I yelled as my husband called 911 from his end. </p>\n\n<p>“Isaac!!” As he gave the dispatcher our address. He hung up saying he’d be home soon. The cops showed up soon after. I gave them my story and made a report trying to contain my tears and hysteria. After they left, I waited hours for Ian to get home. He works an hour away and it usually takes him one to two and a half hours to get home. But it had been four sense I got off the phone with him. </p>\n\n<p>I wasn’t hungry so making dinner wasn’t an option. Especially because my husband was no where to be found. I tried his phone multiple times and watched the news’ to make sure nothing worse could happen today. A knock came upon my door again. Another package needing to be signed off. I instantly called the cops as noted to. </p>\n\n<p>When they showed up, we opened the package together. All of us were confused as to where my husband was. But soon after the cops arrived, he showed up. The package was already open and inside was a piece of Liam’s shirt ripped from what I was assuming he was still wearing along with a Polaroid of both my kids. </p>\n\n<p>A note inside read “24,000 per kid. 24 hours. This address”</p>\n\n<p>I was balling my eyes out when he walked in. He was concerned but we were more concerned about him. He was cut up and bruised. </p>\n\n<p>“Where have you been?!” I yelled at him. Still balling I began to lightly but angrily punch him. He grabbed my hands and looked upset and angry at the same time. </p>\n\n<p>“I am so sorry Lilly.” Was all he could say. </p>\n</div>\n","author":"bbymads"}