{"rank":"27","title":"Someone broke into my house and I only found out after I got out of the shower","id":"8lffmp","url":"/r/nosleep/comments/8lffmp/someone_broke_into_my_house_and_i_only_found_out/","time":"1527038737000","body":"<div class=\"md\"><p>I was up later than usual last night, around 12:00 am or so. I can recall the feeling but not the reason; I felt tired and yet something seemed wrong as if the air had changed. There was something about the sensation I got every time I drew a breath while laying in bed. I would get close to falling asleep until the air in my lungs animated my mind away from sleep. I seriously considered taking a Melatonin supplement, until I realized that the reason I don’t is because of the awful nightmares I have with any sleep aid. I am always running, always fleeing, always hiding, and yet there is no conclusion to the nightmare-induced anxiety until I wake up in a cold sweat. </p>\n\n<p>I grew irritated with tossing and turning in my bed, so I decided to take a relaxing hot shower to help me sleep. I let my anger get the best of me as I got up, and slapped my alarm clock to the floor because it was mocking me by reminding me of how late it was. I undressed and grabbed a spare towel. It’s easier for me to enter my bathroom completely naked, making sure I don’t drench my clothes accidentally. </p>\n\n<p>On my way to the shower, I was reminded of how empty my home was. It was just me, my possessions, some spiders, and the clutter in my basement. I’ve tried for years to fill the emptiness in my home and in myself with someone I could love. Nobody stays with me because they’ve said I’m too boring, too bare...In short, I live up to no standard that women look for. I’m close to accepting my loneliness, considering that I am better for struggling against overwhelming odds. </p>\n\n<p>The shower was nice and short. It felt good to feel some semblance of warmth on my body. I didn’t shower for long because I hate to waste so much water and because I have no true reason to stay fully clean. I also dislike getting out of the shower and being greeted by excessive steam and humidity. It’s hard to breathe, and the feeling is similar to the one that is keeping me up. Something feels wrong, different, and it’s unsettling because this has not happened to me for several weeks until today. I can’t ever remember the reasons, but I never forget the feeling. </p>\n\n<p>I got out of the shower and noticed a figure in the bathroom, standing in front of the closed door. There was still some steam because I accidentally closed the door, and let the hot water run a little too long before I got in. In the haze, I could barely make out the figure. I’ve never hallucinated before, so I knew this figure had to be real. It seemed to be of average build and had all the features a person would based-on its outline but I couldn’t see its face...If it had one. My first instinct was to call for help but nobody besides this stranger, a few spiders, and the clutter in my basement. </p>\n\n<p>Neither I nor the figure made any movement at first; I was piecing together the reason for the figure being here, but I don’t know what the figure was thinking...If it even could think. I decided I should not make any sound, and instead only make subtle movements. I lowered my left arm to place my towel on the ground and saw the figure was mimicking my movements. Was I hallucinating for the first time in my life? Was I being mocked? Were this figure’s motivations so utterly alien to me that I mistakenly believe it has any intention at all? I didn’t know the answer. </p>\n\n<p>I began to make more obvious movements, increasing the speed of my movements as well. The figure copied my actions a fraction-of-a-second behind me, and we never lost eye-contact with one-another. My intention was to brush away enough steam to finally see the figure without haze. I managed to somewhat do this, and saw that the figure had to of been a person, probably partially nude, and had his clothes laying on the floor next to him. I was slightly relieved to know that this person was not a hallucination because I didn’t bring clothes to the bathroom. </p>\n\n<p>This person had to be an unhinged robber, a rapist, a murderer, or a voyeur. No other person has a key to my house, as I lock all my doors to prevent persons like him from entering. He must have picked a door-lock or broke a window. I suppressed a morbid chuckle as I facetiously wished that any woman would stay as long as this person. While I’ve gradually grown more apathetic, I still did not wish to be violated or killed; I could handle a pervert, and I didn’t have much that was worth stealing. Even if I was killed, I wouldn’t be found until my decay greeted the noses of my neighbors. Even if I was violated, I could not say anything because I don’t have anyone to go to. </p>\n\n<p>As I became more and more unsettled, I realize why I had previously felt unnerved before my shower. This person must’ve gotten into my home before my shower, and I did not realize their entry because I rarely leave my bedroom after dinner. I now understood why the air in my house had felt wrong and discomforting; it was because he was already in my home before I saw him after my shower, staring at me and thinking about what to do with me before I had a chance to do anything-at-all besides showering. He must have known this would be the place to catch me with my pants down, he had to know me and what I do. I think I’ve been watched by this person for far longer than just tonight. The idea that someone could observe me in my home while I’m unawares was entirely disturbing. There’s no sound reason for anyone to take this much interest in doing anything with or to me because I’m too plain, too boring, and exceedingly average to the point that I am less than average. </p>\n\n<p>I could no longer simply stand here and stare, this encounter had to have a conclusion or else I would surely go mad. I slowly walked forward, careful to not slip nor make sudden movements. He was still copying my movements but he wasn’t moving forward like I was, simply slowly walking in place at a pace that was just one beat slower than myself. As I drew closer and closer, the haze of the steam lost its effect entirely and I could finally see the entirety of the person in my bathroom.</p>\n\n<p>It was me, staring at myself in the mirror. I was unsettled by my very existence, and I can never fully forget how much I disturb myself. I don’t deserve this house, and I consider myself breaking into it every day. My thoughts and my self-loathing watch me from every corner of my home, and they become more visible to mock and torment me because of who I am. </p>\n\n<p>I suddenly failed to suppress the reasons that I knew no woman would ever stay with me, never care for me longer than a week. As the brief time I spent with them grew longer, I gradually was consumed with panic that they’d suddenly abandon me; I was always becoming unreasonably obsessed with these women, believing that I may keep them in my life so long as I never left them alone so they couldn’t contemplate abandoning me. After the first three women abandoned me, I realized that I wasn’t doing enough to make them decide to stay with me. There was always more I could do, and so I did do more. </p>\n\n<p>The first girl was Sarah...Sarah Jacobson. She was stunning and I was baffled why she picked me; she insisted that she go to the store on her own, but I couldn’t risk her abandoning me. I acted so suddenly and forcefully that she didn’t make a sound, as if she actually so easily decided to stay with me. I haven&#39;t let any of the others know that Sarah is my favorite.</p>\n\n<p>It was hard to drag her to my bedroom, but over these past few months, I’ve gotten stronger and better at helping women get to my bedroom. They enjoy cuddling, and I always sleep easy with my arms around and protecting them. No matter how high I crank the heat in my home, they always end up being unnaturally cold. </p>\n\n<p>I never violate them. They are too pure, too kind, and too patient for me to even attempt at degrading them like that. I want them to always know that I care about them so much for their personality, their cute introvertedness, and them as a person rather than an object. The closest I come to even just inappropriately touching them, which still makes me uncomfortable despite the fact that they&#39;re perfectly fine with it, is when I give them baths. I don&#39;t really feel the need to ask them why they need my help to bathe. I&#39;ve just assumed that it&#39;s just another expression of their desire for intimacy and a deeper connection. </p>\n\n<p>It always inevitably ends with them trying to leave me, despite how these women happily deciding to stay with me longer than usual. They just stayed with me a little longer than the first three, for around a month. I still appreciated their company. After the next two girls left me, I realized I was still not doing enough to encourage them to stay with me. I couldn’t bear to see them leave after all this time, and so I did more to help them decide to stay. I wanted to make sure they had somewhere to stay in my house, but I didn’t have much room. I eventually decided to help them move into my basement where there was more room for them to enjoy as they stayed with me. I always did enjoy my basement because it was more isolated from the thoughts that plagued me, and I think the women liked it for the same reason. </p>\n\n<p>I still cannot comprehend what I actually did to make these women want to stay with me for this long. They don’t even mind it when I bring other women into my life and also convince them to stay. I seemed to have truly improved myself as I struggled against the overwhelming odds that stood between my loneliness and happily keeping kind and caring women in my life. I still want to bring more into my life, to fill the entirety of the void that’s been growing inside of me over the past few decades. I will have to increase the size of my basement to make room for these new potential lovers. </p>\n\n<p>I’m not lonely. I have myself, a few spiders, and so many caring women in my basement. I’ll still be working on suppressing my anxiety because I don’t want to ever worry any of my girlfriends.</p>\n</div>\n","author":"EiplecOco"}