{"rank":"40","title":"The day my husband lost his mind.","id":"8lfidr","url":"/r/nosleep/comments/8lfidr/the_day_my_husband_lost_his_mind/","time":"1527039452000","body":"<div class=\"md\"><p>Jeff and I have been married for 30 years, and together for 37. We’ve been through a lot. We’ve had two sons, Regan and Kyle, a few dogs, a few houses, and we’re going to be grandparents in a matter of months. We had a good life, and were incredibly happy. I say that in the past tense, because just a mere two months ago, my life stopped dead in its tracks, and changed forever. I know I shouldn’t be coming here of all places, but I didn’t know who else to turn to. I’m so desperate for answers, I think this will literally kill me. </p>\n\n<p>On March 5th of this year, Jeff and I were having an ordinary night at home, watching a movie. We’re empty nesters, so little date nights are common for us. It was about 7pm when Jeff leaned forward, clutching his chest. It was completely out of the blue, and I was startled. He had told me he was experiencing crushing chest pain, and trouble breathing. Being a middle aged couple, I figured it could very well be a heart attack, and rushed him to the hospital. I had every woman’s worst fear in mind, that I was going to be a widow at 54. </p>\n\n<p>We made it in time, and Jeff was seen immediately, and checked into room 213 in the emergency department. Tests were run, blood was taken, and Jeff was given some medication. I felt a little more at ease, thinking that my dear husband was well taken care of and in the safe hands of doctors. It was approaching 11pm, and Jeff suggested I go home to let our dog out and get some sleep. I obliged. I was tired, and I knew he’d be safe. On my way out, I gave his nurse my phone number in case of emergency. I had confidence that he was going to be okay, but I still tossed and turned all night. </p>\n\n<p>The next morning at 8am, I arrive back at the hospital. I had barely slept a wink. Luckily, his doctor notifies us that Jeff in fact did not have a heart attack, but an episode of chest pain called angina. “Great,” I thought. Something treatable. We were discharged with a prescription and some information on chest pain and heart disease. I was happy to have Jeff home. </p>\n\n<p>We enjoy a quiet day at home, relaxing and spending time together. We both decided to take a few days off work, just in case something were to happen again. Nothing eventful happened that day. We updated our sons on what had happened, and other than being a little tired, Jeff felt fine. What happened the next day would haunt me to my core. </p>\n\n<p>I woke up on the morning of March 7th, 2018 as I would any morning. I leaned over to wake Jeff and offer him a cup of tea, as per our usual morning routine. \n“Who the hell are you?” Jeff blurted our, sounding startled. \n“Don’t be silly, love. Come on, let’s have some tea,” I giggled. I didn’t think he was serious. \n“I have no idea where I am or who you are. What the hell is going on?” He sounded more and more agitated. \n“Jeff, it’s me. It’s Colleen. Your wife.” \nHe stared at me blankly. It was clear he had no idea who I was. I explained over and over our life story. He remembered nothing. Not our sons. He just kept asking for his mother. </p>\n\n<p>Jeff had never shown any signs of dementia. He had never taken drugs. I was at a loss. My whole world crumbled. What had happened to my sweet husband? I did the only thing I thought of, and drove him back to the hospital. Once we were there, I burst into the ER where he was treated two nights ago. I tearfully collapsed onto the floor, incoherently babbling about how my husband was gone. I was surrounded by staff and security guards. I looked up and saw a familiar face. It was the nurse who had cared for him. \n“PLEASE!! Help me! What did you do to him? My husband is gone!” I shouted.  He looked like a deer in headlights. A mixture of confusion and fear. Before he could answer, I was being escorted to a private room by security. I felt so helpless. </p>\n\n<p>I explained every detail of what happened to my husband. He didn’t remember me, or our children. He didn’t remember his home. I could tell they thought I was crazy, but the head doctor agreed to admit him and run tests.  </p>\n\n<p>Days passed. Weeks passed. The results of every single test were normal. No head injury. No dementia. No drugs. The doctors had no answers for me. My husband spent a week in a psychiatric unit, only to be sent home to me because of his “issues.” I was living a nightmare. Every single morning was the exact same event. He didn’t recognize me, or remember anything about his life. Our sons stopped coming around, they couldn’t see their dad like this. Neither could I. I was at my boiling point. I was his caregiver, his punching bag, and the one who had to explain everything to him over and over again. He couldn’t even use a fork. </p>\n\n<p>It’s been two months, and after a dark time, I think things could be looking up for us. No doctors have ever been able to give me an answer, but it’s okay. I haven’t slept in almost 4 days due to my husband wandering and attempting to escape the house, but it’s okay. People tell me to move him into a home. I’ve lost all my friends, but it’s okay. Just about an hour ago, I wrapped the cord around my husband’s neck and began to pull with all my strength. \n“It’s okay,” I whispered into his ear. He stopped struggling. It’s okay. </p>\n</div>\n","author":"falling_into_gravity"}