{"rank":"255","title":"My wife drowned our daughter.","id":"8lfk57","url":"/r/nosleep/comments/8lfk57/my_wife_drowned_our_daughter/","time":"1527039916000","body":"<div class=\"md\"><p>Jess and I had Echo when we were young, her being twenty and me being twenty-one. In a way, we were growing up along side our daughter, her teaching us about life while we attempted to do the same. We weren’t perfect parents, but we were happy. Well, until Echo turned eight. </p>\n\n<p>“Daddy...” I heard Echo whisper as I descended the stairs for a midnight snack. </p>\n\n<p>I looked around in the darkness, fishing for the light switch. Light flooded the room as I flipped the located switch, revealing my daughter. She was huddled up on the couch, hugging her knees. </p>\n\n<p>“Sweetie? What are you doing?”</p>\n\n<p>She looked towards the stairway, bringing her gaze back to me. </p>\n\n<p>“Mommy won’t come down here.” </p>\n\n<p>Confusion set in, but I entertained her words and went to sit by her. </p>\n\n<p>“What do you mean?” I pushed. </p>\n\n<p>Again she looked to the stairs, as if  checking to make sure it was clear. </p>\n\n<p>“Mommy keeps coming into my room at night. She...she goes into my bathroom.” </p>\n\n<p>I smirked at the thought, wondering why Jess would do such a thing. We shared a bathroom, and had much more comfortable accommodations than our daughter. Still, I pushed for more information. </p>\n\n<p>“Why does she go into your bathroom?” </p>\n\n<p>She gave a small gulp and hugged my arm. </p>\n\n<p>“She makes a bath...and then stands by my bed.” </p>\n\n<p>I raised a brow. The story was taking a strange turn and I was losing my patience. </p>\n\n<p>“Sweetie, tell me everything. What did mommy say?” I pushed. </p>\n\n<p>Echo’s eyes water a bit, but she nodded through it. </p>\n\n<p>“She counts.” </p>\n\n<p>“Counts?” </p>\n\n<p>Echo nodded, raising nine fingers. </p>\n\n<p>“She started at twenty, but every day she goes down one!” She cried. “She got to nine last night, and then she smiles and leaves...” she explained, her eyes pleading with me. </p>\n\n<p>I found all of this very strange, obviously. Echo wasn’t known for her make believe tales, nor did she crave attention. Everyone lies, but usually with reason. This was just...bizarre. </p>\n\n<p>I grabbed Echo and brought her back to her bed, tucking her in and assuring her nothing was going to happen. She looked at me with a trusting gaze, giving a hesitant nod. </p>\n\n<p>I retreated to our room, looking at my wife who was fast asleep. I shook my head, aiming to deal with it in the morning. </p>\n\n<p>I was restless throughout the night, my daughters story bringing a plethora of weird scenarios. The mind will create realities where truth is absent, and they are rarely preferable. Still, I managed to get a few hours of sleep before my alarm demanded my attention. </p>\n\n<p>I got up, kissed my wife’s head and prepared for work. The morning was normal. I checked on Echo, who looked to be sound asleep. I shrugged, assuming the issue would go away. Still, I’d bring it up over dinner. </p>\n\n<p>The work day went on as it usually did and I arrived home around six, like always. All was normal. Echo watched TV while absently coloring a piece of paper and Jess was finishing up supper. </p>\n\n<p>Things were fine for a little over a week until one day when I came home from work. I knew something was off because every window in the house was covered with what looked like our linens. Sheets, pillow cases, etc. I attempted to turn on the lights, but to no avail. The switches didn’t work, and only silence greeted me. </p>\n\n<p>“Jess? Echo?” I yelled, but no one answer. </p>\n\n<p>Throwing caution to the wind, feeling safe in my own home, I flicked my phones light on and began my ascent up the stairs. </p>\n\n<p>My own home felt foreign, the darkness erasing memorable areas and turning them into foreign spots. An end table became an obscure figure, a family portrait showing unfamiliar faces. </p>\n\n<p>“Jessie! I yelled. </p>\n\n<p>I heard nothing. I decided to check on Echo first as I turned down the hallway. I could see the faint light from under her doorway.  I rushed towards it, an unsettling feeling consuming me. I burst into her room, the flood of light blinding me for a moment. My eyes adjusted, and I was greeted by my wife. </p>\n\n<p>She was sitting on the edge of Echo’s bed, curled up and staring absently at the wall. </p>\n\n<p>“Jess?” I called out. </p>\n\n<p>She remained silent, but her eyes drifted toward me for a second before returning to the wall. I looked around for Echo. Part of me screamed to check the bathroom, the lingering thoughts of last weeks event flooding my mind. </p>\n\n<p>I walked over to my daughters bathroom door, hesitantly grabbing the handle. It was cool to the touch as I jerked it open. I wish I hadn’t. </p>\n\n<p>Echo was still, as still as the water that surrounded her. Her lifeless body, slightly blue and bloated, stared lifelessly towards the ceiling. </p>\n\n<p>I vomited immediately, the only reflex that I couldn’t suppress. I fell to my knees beside the tub, grabbing my daughters body and holding it tight against me. </p>\n\n<p>“W-wha...Jess! W-hat did you did you do?” I screamed.</p>\n\n<p>It felt like a weight was on my chest, like a new appendage had grown inside me while another had been lost. </p>\n\n<p>What followed was a series of screams, a phone call to the police, and a thorough investigation. They took their time, but they immediately put Jess in cuffs. </p>\n\n<p>They interviewed me. They interview her. They did an autopsy, and a wide assortment of tests. Not that they needed to. It was pretty simple what had happened. </p>\n\n<p>Jess had drowned Echo. When asked why, she simply stated that she “wasn’t supposed to have children.” </p>\n\n<p>I don’t know why she did it. We were happy. We talked about life and happiness all the time. We loved our little Echo. Yet shortly after Echo’s eighth birthday, Jess drowned her own daughter. </p>\n\n<p>I wish I had a reason or moral to give you all. But I think the only thing to take away from this is that some monsters aren’t malicious in nature. Some monsters kiss you goodnight. And some aren’t monsters at all. Those are the kind that take us by surprise. </p>\n</div>\n","author":"Kennon02"}