{"rank":"4248","title":"I broke into my son's locked bedroom","id":"8lfupr","url":"/r/nosleep/comments/8lfupr/i_broke_into_my_sons_locked_bedroom/","time":"1527042647000","body":"<div class=\"md\"><p>I consider myself to be a very religious man. I&#39;ve tried to raise a family with the same ideology, but neither of my sons really took to it. My son Jake would worry any man of God.</p>\n\n<p>My son Jake kept his bedroom door locked. When he was in it, it was locked. When he&#39;d leave, he&#39;d lock it with his key. We didn&#39;t have a spare key, so we just let it be.</p>\n\n<p>After the death of his older brother, Tyler, Jake became reclusive. He would rarely speak to me or his mother anymore. Often times he would walk right past us, without acknowledgement or answering any questions.</p>\n\n<p>When Tyler died, it was hard on us all. My wife and I had each other, but Jake had no one. I could hear him sobbing from outside of his door but he didn&#39;t want anyone to help him. He wanted to be left alone.</p>\n\n<p>In a way, I understand. I understand how tempting it can be to isolate yourself and shut out your surroundings. It&#39;s easier to only worry about yourself. After losing a sibling, your best friend, I can see why Jake would not want to get close to anyone again, in case they ended up leaving him as well.</p>\n\n<p>Jake didn&#39;t go to the funeral. At first, I was pissed. I was livid that he wouldn&#39;t give his brother the respect he deserved. Tyler fought for our country and his brother attending his funeral was the very least he deserved. The pastor ended up calming me down. </p>\n\n<p>“Everyone grieves in their own way,” he said.</p>\n\n<p>Lately, I&#39;ve become increasingly worried about Jake. I can hear him crying again. He leaves his room with a puffy face and takes off for school, not saying a weird. I tried to talk to him the other day, and noticed something horrific.</p>\n\n<p>“Jake, don&#39;t you want some breakfast before you take off?”</p>\n\n<p>“No,” he said, making a break for the door.</p>\n\n<p>“Jake, I miss my son. Can you please talk to me?”</p>\n\n<p>Jake stopped. He stood there for a minute, contemplating whether or not to just walk out the door. </p>\n\n<p>“Why? So you can take me to church? Please, pray for me.” His face shot daggers into my eyes.</p>\n\n<p>When he turned towards me, his words didn&#39;t matter. I had noticed something else.</p>\n\n<p>“Jake!” I exclaimed, grabbing his arm.</p>\n\n<p>I pulled his jacket sleeve down, revealing multiple cuts.</p>\n\n<p>“Jake…,” my voice trailed off.</p>\n\n<p>Jake pulled his arm away from me and stomped out the front door. I fell to the floor in a crumbling heap. I didn&#39;t want to lose another son.</p>\n\n<p>“Honey! Honey, what happened!” My wife ran from upstairs to my aide.</p>\n\n<p>I explained to her what I saw. Our son had been hurting himself. My wife broke down in tears, and we both agreed that we needed to get into Jake’s room. We had to find whatever we could to help save him.</p>\n\n<hr/>\n\n<p>A fear boiled in my stomach. My wife and I stood in front of the bedroom door for what felt like hours. </p>\n\n<p>“We can&#39;t,” she said, tugging on my arm.</p>\n\n<p>“We have to. If we could find just one thing that can help us save him. I can&#39;t go through this all again.”</p>\n\n<p>My wife nodded in agreement. We couldn&#39;t lose another child. We refused.</p>\n\n<p>I shook the doorknob to confirm that it was locked.</p>\n\n<p>“So, how are we gonna get in? Are we just going to bust it down?”</p>\n\n<p>“We might not have to. Hold on a second.”</p>\n\n<p>I went to the kitchen and got a butter knife. I put the butter knife in the doorknob and turned it. To my surprise, it worked. The door was unlocked.</p>\n\n<p>“Holy… shit! It was that easy?” I turned to my wife.</p>\n\n<p>“Let&#39;s just hurry,” she replied.</p>\n\n<p>I opened his door and the first thing that hit me was the smell. It was vile. This room had been shut in for years and but it’s odor could&#39;ve told you that before I did.</p>\n\n<p>Lined across his walls were posters. Various bands, movies; stuff I didn&#39;t even know he liked. My wife started going through his drawers.</p>\n\n<p>“Fuck…,” my wife said.</p>\n\n<p>“What is it?”</p>\n\n<p>My wife grabbed her mouth as her eyes started to swell up with tears. With her other hand, she handed me a paper. It was a note.</p>\n\n<p>“I don&#39;t want to live anymore.”</p>\n\n<p>I squatted and buried my head in my knees.</p>\n\n<p>“Shit… Fuck!”</p>\n\n<p>I can&#39;t lose another child. I said a small prayer, asking for guidance. I couldn&#39;t lose Jake.</p>\n\n<p>“Let&#39;s keep looking, honey,” I rubbed my wife’s back.</p>\n\n<p>We each took a side of the room and searched intensely. His room was a mess, going through all of his stuff took hours. We found almost nothing else of interest.</p>\n\n<p>“Let&#39;s check under his bed,” my wife said.</p>\n\n<p>We walked over to his bed and each of us lifted up a side of the mattress. My wife gasped.</p>\n\n<p>“What is it?!”</p>\n\n<p>She held up a razor blade. I assume it was the one he used to hurt himself. The words “fuck life” were written on it in sharpie.</p>\n\n<p>My head was limp in my hands. My son wants to die. We’re to blame. We had failed him.</p>\n\n<p>“What are you doing?!” My son stomped into his room.</p>\n\n<p>“Jake!” I exclaimed in shock. “Shouldn&#39;t you still be in school?”</p>\n\n<p>“It was a short day… Why do you have that?”</p>\n\n<p>“Honey,” my wife stood up, relieving herself from her crumpled, crying position. “Honey, we know you want to kill yourself.”</p>\n\n<p>“What the fuck?” Jake said, now backing up. “Get… Get out.”</p>\n\n<p>I stood up and walked towards Jake. “Son, we love you.”</p>\n\n<p>“What… the hell?” Jake was paralyzed, tears streaming down his face. My wife gave him a hug that he did not return.</p>\n\n<p>“We love you so much, baby. We don&#39;t want to lose another child.”</p>\n\n<p>“Why… why do you still have the blade?” Jake asked.</p>\n\n<p>I held him down. My wife did the work. Deep, vertical cuts down each of his wrists. His cries pleaded with us to stop, but we just couldn&#39;t. He can&#39;t kill himself.</p>\n\n<hr/>\n\n<p>The neighbors were good to us. As were the police. Two sons lost to suicide? We were viewed with much pity. We didn&#39;t deserve it. We knew we would meet our rightful place in hell when the day came. We were content with that.</p>\n\n<p>When Tyler came back from Iraq, he was a mess. He was missing his right leg. His girlfriend had left him. His best friends had died. We tried our best to help him, but it wasn&#39;t enough. Tyler made it clear that he had no intention of living.</p>\n\n<p>All the signs were there. Tyler was going to kill himself. Soon. I couldn&#39;t let that happen. I couldn&#39;t lose my son to suicide. We were able to do it quick and painless. Some pills in his coffee. That is our sin, not his.</p>\n\n<p>I thought that would be the end of it, but unfortunately not. Jake wanted to die too. He was sick of the world and wanted to kill himself. We couldn&#39;t let that happen. Suicide is a sin.</p>\n\n<p>I refuse to let either of my sons go to hell.</p>\n</div>\n","author":"10gentlemen"}