{"rank":"455","title":"The Tea Shop Ghost","id":"8lfxke","url":"/r/nosleep/comments/8lfxke/the_tea_shop_ghost/","time":"1527043330000","body":"<div class=\"md\"><p>“Well, it’s official,” said Margaret, looking over the report that Kristal had prepared for her. The dismay in her voice caused my stomach to sink.</p>\n\n<p>“No way. I don’t believe it.” Beth’s eyes were wide and tremulous. She was about to start crying, like always.</p>\n\n<p>“Come on, there has to be something we can do,” said Emi. Determination was set permanently in the lines of her face like a tattoo. She practically glared at Margaret from out her smudged black eyeliner. “Remember what you told us? It’s not over ‘til the fat lady sings.”</p>\n\n<p>“Yeah, well, she’s gone and sung. Look at these numbers if you don’t believe me.” Margaret threw the paper on the counter in disgust and we all crowded around to look at it. I, being the best at numbers aside from Krista, knew immediately that we were up shit creek without a paddle. The others took longer to convince, but we all came to the same conclusion.</p>\n\n<p>“We’re going out of business,” said Margaret.</p>\n\n<p>I groaned. “Not now. I finally got a job that doesn’t make me want to kill myself… don’t make me look for another one.”</p>\n\n<p>She gave me a sympathetic, almost apologetic look. As though this was her fault somehow. “I’ll write you a good letter of recommendation.”</p>\n\n<p>Fantastic. Just great. The first job I’d really excelled at in three years and it was being yanked away from me. By who, you ask? By that great evil known as Capitalism. In the world of online shopping and huge retailers, a tiny specialty tea shop just can’t compete. At least, not in an average Podunk town in the middle of rural Minnesota.</p>\n\n<p>“Well, you might all be giving up, but I’m not,” said Emi. She never did know when to quit. She was probably the most stubborn person I’ve ever met. Half the time, it made me want to kiss her. The other half I spent wanting to strangle her.</p>\n\n<p>“We can update our Facebook, post more on Twitter, try to get the word out to more people,” said Beth, sniffling and wiping her eyes. We had jokingly nicknamed her ‘Crybaby,’ except it really wasn’t a joke at all. If you so much as looked at her funny, she’d burst into tears.</p>\n\n<p>“We could, but it wouldn’t do us any good,” said Margaret. “We can’t take orders online because we can’t keep a goddamn website running. Nobody around here seems much interested in our tea. And we’re practically hemorrhaging money. We might as well call it quits. I’ve had a good offer on the place and…”</p>\n\n<p>“Oh no you don’t! You CAN’T sell this place!” shouted Emi.</p>\n\n<p>“The hell I can’t!” Margaret shouted back.</p>\n\n<p>The screaming match continued as I closed my eyes and retreated inside myself. I wished I could be alone to mourn. Unlike Emi and Beth, I had already accepted the reality of the situation. I wasn’t about to fight it. Fighting it would only mean holding out hope for the impossible. Maybe it was because I was a bit older than Emi and Beth, but I had learned a lesson from life that they hadn’t yet: sometimes, hope is the worst possible thing you can inflict on yourself.</p>\n\n<p>The fighting began to escalate along with Beth’s crying. I was about to yell at them all to shut the hell up when a large <em>bang</em> caused us all to jump. A huge box had fallen off a shelf in the back room.</p>\n\n<p>Emi and Margaret looked properly chastised. “Sorry, Tom,” mumbled Emi.</p>\n\n<p>That was sort of a running joke in our tea store. From the time that Margaret opened the shop, we noticed strange noises, things out of place. Most likely it was nothing but our own imagination. Still, we liked to pretend we had a ghost haunting the place. That way, whenever something strange or creepy happened that we couldn’t explain, we’d shrug it off and say, “there goes Tom again.”</p>\n\n<p>The room was silent for a few moments after Tom’s interruption. Then, Margaret spoke up again, more quietly this time.</p>\n\n<p>“Look, I’m not any happier about this than you guys are. But if we don’t shut down on our own, the creditors will come and do it for us anyway. I’m sorry, guys. There’s nothing else that we can do. I wish it didn’t have to be this way, really, I do. But… well. That’s just the way it goes, I guess.”</p>\n\n<p>It was far from the most eloquent speech I’d ever heard, but it made my eyes fill with tears. Even Emi began blinking furiously and turning her head away from us so we wouldn’t see her getting emotional.</p>\n\n<p>So that was it.</p>\n\n<p>We spent the rest of the day in gloom, the dark clouds of our uncertain futures hanging over our heads. I had the night shift, so everyone else headed home around six and I found myself sitting at the counter, moping.</p>\n\n<p>“I hate this,” I muttered, looking around at the deserted shop. Sighing, I turned to the rows of tea we kept behind the counter, deciding that I might as well brew myself something to pass the time. I pulled out my favorite black tea along with a lighter jasmine blend. I turned my back to the counter so I could pour myself some hot water.</p>\n\n<p>A sharp tapping sound nearly made me jump out of my skin, sending boiling water splashing onto my wrist. Swearing, I turned around and saw another tin of tea sitting on the counter – one I was sure hadn’t been there before.</p>\n\n<p>A shiver ran down my spine. Although we all pretended that Tom was real, I don’t think any of us really believed it at that point. Sometimes, though, something like this would happen, and I’d become uncomfortably aware that I wasn’t alone in the store.</p>\n\n<p>I picked up the tin and read it. It was a tea that I didn’t recognize – most likely something Margaret had ordered that hadn’t sold well. It must have been sitting underneath the counter. I wondered how long it had been there. The label was faded, but I could read that it was some kind of mango peach herbal blend. I figured that adding it to my tea couldn’t hurt, so I started to make it.</p>\n\n<p>“Hot or iced?” I muttered to myself, although the question was moot because I never brewed iced tea if I could help it. Then the door to the ice box flew open and my heart skipped a beat.</p>\n\n<p>“O…kaaaaay… Iced it is?” I was getting ready to add the tea when our jar of sugar slid across the table towards me.</p>\n\n<p>My jaw dropped open. I’ll admit, weird stuff had happened in the store before, things that we couldn’t really explain. But <em>nothing</em> like this.</p>\n\n<p>For a brief moment, I considered calling Margaret, telling her what had happened, and leaving early. After all, nobody would notice if I locked up and went home. Not like anybody came in to see us, anyway. But I reconsidered. Tom – or whatever it was – hadn’t hurt me. And it was clearly trying for something. What was the worst that could happen if I went along with it?</p>\n\n<p>So I did. I added four teaspoons of sugar – more than I ever put in my own tea – and started brewing. Five minutes later, I had a glass of fresh iced tea sitting in front of me. I wrinkled my nose a bit at it – I usually hate iced tea – before shrugging and taking a sip.</p>\n\n<p>It was <em>amazing.</em></p>\n\n<p>And I say that as a person who rarely drinks anything other than straight black tea. It was the perfect blend of earthy tones and bright citrus notes. It was smooth like velvet going down my throat. It was flavorful but not heavy, light but not weak.</p>\n\n<p>I took out my notebook and scribbled out the recipe before I could forget it.</p>\n\n<p>The next day, I arrived at the shop early in the morning (despite it being my day off) and made Tom’s concoction for the girls.</p>\n\n<p>“Wow, this is seriously awesome!” said Emi. I wasn’t surprised by that, though, she’s a real herbal fan.</p>\n\n<p>“If only people knew we had <em>this</em> in our store,” said Kristal, her tiny pale hands barely big enough to wrap around the cup, “we’d sell out in no time!”</p>\n\n<p>“Yeah… if only…” said Margaret.</p>\n\n<p>Just then, an idea struck.</p>\n\n<p>“Hey, do we still have those pitchers in the back?” I asked.</p>\n\n<p>Margaret nodded and I ran back to get them, along with a ton of sample cups I’d found on a dusty shelf.</p>\n\n<p>“Why don’t we show everybody what we have?” I asked, excitement starting to hum in my blood. The other girls caught on immediately. Emi started helping me make the tea while Margaret set up a small table just outside our door. Kristal, ever the artist, made a beautiful colorful sign that said, ‘TRY OUR SWEET NEW CREATION!’</p>\n\n<p>I wasn’t sure it would work… but I hoped it would. I volunteered to spend the entire day handing samples to people outside. Beth came in and helped. If there was one chance to save our store, this was it, and everybody wanted in.</p>\n\n<p>It went better than we ever could have imagined.</p>\n\n<p>It was hot that day – above ninety degrees Fahrenheit, which is the temperature at which most Minnesotans melt – and nobody could resist trying our ice-cold tea. Soon, the store was flooded with people. Word spread quickly, and everyone walking down Main Street came in to have a taste.</p>\n\n<p>We sold more that day than we had for the past month.</p>\n\n<p>By the end of the day, Margaret noticed we were running out of the mango peach blend. Once the store closed for the day, she began to frantically search through old invoices to find where she’d gotten it. We all joined in to help her.</p>\n\n<p>“Seriously, if we don’t find this, it doesn’t matter how well we did today,” she wailed, tearing open yet another unmarked box full of old papers.</p>\n\n<p>“We WILL find it,” said Emi, her eyes blazing.</p>\n\n<p>Just then, a single sheet of paper floated down from the top of one of the cabinets we’d wrenched open in our search. <em>Tom.</em> I snatched it from the air and read it.</p>\n\n<p>It was an order form for about twenty teas, one of which was – you guessed it – Mango Peach Delight.</p>\n\n<p>“FUCK YES!” screamed Emi.</p>\n\n<p>“I knew it!” gasped Kristal.</p>\n\n<p>“Someone up there loves us!” cried Beth.</p>\n\n<p>While they all cheered, I smiled at the air around me.</p>\n\n<p>“Thanks, Tom.”</p>\n\n<hr/>\n\n<p>Things changed rather quickly after that.</p>\n\n<p>Business was booming. Everyone wanted our tea. But just buying drinks in the store wasn’t enough – they wanted to be able to brew it, too. Soon, we were selling the tea in loose-leaf form along with tons of brewing equipment. Our debt shrunk and, after a while, we started to actually turn a profit.</p>\n\n<p>Things were looking up.</p>\n\n<p>Unfortunately, there was still a major problem.</p>\n\n<p>It started because I tended to stay in the store after hours. I would stick around for a few hours and try making new tea blends. Tom would help me. I’m not sure why, but he took a liking to me – he didn’t show up that much while the other girls were around, but he was always there when they were gone. He and I worked together, and we came up with a few other blends that sold quite well. One or two of them even rivaled our original miraculous concoction.</p>\n\n<p>Naturally, when money was consistently stolen from the safe, I was the first suspect.</p>\n\n<p>I’ll never forget the day Margaret called me to the back room.</p>\n\n<p>“I don’t want to have to do this, Sami, but I don’t see myself as having a choice anymore,” she said. “Over the past several weeks, over three hundred dollars have been stolen from the safe. And, well, you’re the one who’s had the most opportunity to access it after hours.”</p>\n\n<p>“You don’t <em>seriously</em> think that I’m the one doing it, do you?!” I couldn’t believe what I was hearing. My jaw actually dropped. I don’t mean to brag, but out of all the employees, I was the hardest worker and the one most devoted to the store. There was no way I was stealing.</p>\n\n<p>But the look on Margaret’s face told me that she’d already made up her mind about me.</p>\n\n<p>“I’m going to question all the employees,” she said. She wouldn’t look me in the eye. That’s what hurt the most. “But I have to face the facts.”</p>\n\n<p>What followed after that… well. Let’s just say there were some hurtful words thrown back and forth and I ended up storming out of the shop, tears in my eyes. The other girls were there – Kristal and Beth and Emi. None of them would look at me. I realized at that moment they all knew, they’d all been talking about it behind my back.</p>\n\n<p>I ran out of there knowing that my reputation was in shreds.</p>\n\n<p>I considered not going in to work the next morning. After all, they’d already decided I was guilty, even if I wasn’t. It just seemed like too much, going back and having to work with them and pretending everything was alright.</p>\n\n<p>Turns out, I didn’t have to make that choice.</p>\n\n<p>Work was called off the next day. Margaret called us all personally to tell us what had happened, but she didn’t have to – we’d seen it on the news already.</p>\n\n<p>A dead body had been found inside our store.</p>\n\n<p>The police didn’t release a name or description of the victim at first. All they said was that the cause of death appeared to be asphyxiation, although they were not yet sure how it had occurred. The victim was found in front of the safe, which was conspicuously hanging open.</p>\n\n<p>The next day, we learned that the dead body had been identified as Beth.</p>\n\n<p>The story came out slowly, and once it did, Margaret was practically groveling at my feet to apologize. All the missing money had been found in Beth’s apartment, stashed under her pillow. She’d gone in that night to steal as well. Something had happened, and her throat had closed up, causing her to asphyxiate. The police were puzzled as to why she died. Their best guess was an allergic reaction, although to our knowledge Beth didn’t have any allergies.</p>\n\n<p>At the end of the day, things worked out alright for me. Margaret apologized and my job was safe. Business boomed and we got even more customers, mostly gothy teens convinced that Beth was haunting our store. Of course, the position of Store Ghost had been filled long before her unfortunate accident.</p>\n\n<p>One night, as I was closing the shop, I could feel someone watching me. I knew who it was, and I had a strange hunch that I owed him something. I closed my eyes, knowing I wouldn’t see him.</p>\n\n<p>“Thanks for having my back, Tom,” I said.</p>\n\n<p>I felt a hand squeeze my shoulder. And I knew then with certainty what Tom had done for me.</p>\n\n<hr/>\n\n<p>A few weeks later, we finally got around to filling Beth’s position.</p>\n\n<p>A new girl came to interview with us. Her name was Jenna. She had bright green eyes and red hair, a permanent smile plastered over her face. I liked her immediately.</p>\n\n<p>Before Margaret offered her the job, she told her sternly, “We have a strict policy against stealing. If it happens once, you’re out. No ifs, ands, or buts. And no second chances.”</p>\n\n<p>I nodded and couldn’t resist adding, “Tom doesn’t like thieves.”</p>\n\n<p>Jenna looked at me, puzzled. “Who’s Tom?” she asked.</p>\n\n<p>I just smiled.</p>\n\n<hr/>\n\n<p><a href=\"https://www.facebook.com/ronavaselaar/?ref=bookmarks\">+</a></p>\n</div>\n","author":"sleepyhollow_101"}