{"rank":"6","title":"The embodiment of death grabbed my leg.","id":"8lg0el","url":"/r/nosleep/comments/8lg0el/the_embodiment_of_death_grabbed_my_leg/","time":"1527044051000","body":"<div class=\"md\"><p>This story takes place when I was 11, so keep in mind that I made retarded decisions for fun, which would almost cost me my life. I&#39;m 22 now, and I&#39;m just gonna tell the world what happened to me because this has been in the back of my mind for 11 years.</p>\n\n<p>I went to visit my grandparents in Arizona. I live in Nevada, so it was only like a four-hour drive to their house. When we got there, we exchanged hugs and went inside. I was gonna spend the whole summer at my grandparent&#39;s house, which was going to be extremely fun considering that they had a pit bull mix, named Truffle, and there was a girl that I liked in their neighborhood as well. Both were reasons why I stayed for the summer.</p>\n\n<p>About a month into the stay, I decided to go into the pool since it was hot as hell outside and I needed something to do besides play games on my Xbox all day and watch TV. So, I got into my suit, grabbed a towel, and went into the backyard.</p>\n\n<p>As soon as I went outside, I felt the heat on my body. I kinda liked it and sat outside for a few minutes, before I began to sweat. At that point in my life, there was a basketball hoop by the pool on the deeper side. My grandparents never liked it when I went into the deep end of the pool since I was still very young and was kinda short.</p>\n\n<p>But, since my grandparents weren&#39;t home, I decided, &quot;Fuck it. Why not?&quot;, so I jumped into the basketball hoop. The nails holding the hoop down were somewhat rusty, which is the cause of what happened next.</p>\n\n<p>I jumped in and my leg got caught in the net. With me falling into the pool, the fucking basketball hoop broke off the rocks and fell with me under the water. Backboard and all. I couldn&#39;t release my foot from the net. I thought I was going to die.</p>\n\n<p>Then, I felt something grab my leg. I looked over to my left and I saw something. It was something that looked human but wasn&#39;t human at all. It had long, disgusting looking gray fingers with medium sized fingernails. It was covered with hair, head to toe, that made it look like as bear from a certain distance. It&#39;s &quot;skin&quot; was entirely gray.</p>\n\n<p>The thing I will remember about it the most were it&#39;s... &quot;eyes&quot;. They weren&#39;t even eyes, they were just balls of pure, horrifying darkness. A void where nothing could go in or out, nothing could escape. Almost like a black hole.</p>\n\n<p>While I was looking into its eyes, it pulled me deeper into the pool. I began to try and get my leg out of the net and away from that fucking monster. I finally got my right leg free from the net and kicked the thing in the face. It let go of my left leg, and I slowly went up to the surface.</p>\n\n<p>I got up to the surface and breathed in while wheezing and almost puking. I was out of the water. I was alive. But, I was still terrified, thinking that the thing that grabbed me was still in the water. So, I quickly swam to &quot;shore&quot;, which was basically a place where somebody wasn&#39;t fully in the water while in the pool, but it still went up to your stomach if you were sitting down. I decided to look under the water while at the shore.</p>\n\n<p>There was... nothing there.</p>\n\n<p>As I got older I began to think about what the thing that grabbed me was. Just last week, I was thinking about this and came to the, somewhat insane, conclusion that the embodiment of death itself grabbed my leg and pulled me farther under the water that day.</p>\n\n<p>I have never told anybody about it, seeing as they would think that I was insane. Like, come on, I felt something grab my leg, to which I would a minute or so later kick it, and then go up to the surface and see nothing when I looked back under the water? That makes no sense to the average person, and it doesn&#39;t even make sense to me.</p>\n\n<p>I still don&#39;t understand why that happened. I&#39;m still somewhat traumatized by the incident. A couple hours ago, I was sleeping and had a dream where the embodiment of death would succeed in killing me.</p>\n\n<p>I&#39;m never going to go into a pool again.</p>\n</div>\n","author":"sillywilly04"}