{"rank":"19","title":"Pocket Dial: a true horror story.","id":"8lg2fr","url":"/r/nosleep/comments/8lg2fr/pocket_dial_a_true_horror_story/","time":"1527044562000","body":"<div class=\"md\"><p>Let&#39;s start off with a little background. I was a 12 year old girl and I was home alone. It wasn&#39;t unusual for me to stay home alone for a weekend or so. My father was on a business trip, which isn&#39;t abnormal either. On the first day, I was enjoying the freedom. But then, things took a turn.</p>\n\n<p>DING: a text from somebody with the same area code as me. It read, &quot;Hello.&quot; I was confused and thought somebody might have gotten the wrong number. I replied asking, &quot;Who are you?&quot; But I got no response. I stepped away and started to cook dinner. I left my phone in my room because I didn&#39;t think I needed it. However, when I finished cooking and sat down in my room with my food, I realized that the mysterious number called me and was sent to voicemail. When I tried to reach him, I was sent to his voicemail almost immediately. &quot;Please leave your message for ...&quot; there was a slight pause before I heard a voice that made me feel so uneasy, &quot;Brian Ponce Contreras.&quot; \n We played phone tag for a couple of hours, calling each other back time after time, but neither of us were at the phone when it rang. Around 10 pm, I called again to see if he would actually pick up this time. Finally, he answered. I tried to start the conversation with a, &quot;Hello?&quot; But before I could finish even greeting him, he hung up. I was exhausted from the day so I went to bed.</p>\n\n<p>The next morning at about 11 a.m. I got, what seemed like, an accidental call from Brian. It&#39;s hard to make out what I heard, But I&#39;m pretty sure I heard somebody who sounded female, maybe mid-20s, screaming and crying for help. However, it sounded muffled, as if somebody was trying to shut her up by covering her mouth. It took him around 15 seconds for him to realize that he was on a call with me. Once he realized, he immediately hung up. Minutes later, I got another text from him, &quot;Do you want to be best friends?&quot; I didn&#39;t reply because I was creeped out. </p>\n\n<p>I didn&#39;t hear from him for a couple of hours. Curious, I tried to call him. The line rang a few times before being sent to voicemail. It was then that I realized he had taken his full name off of his voicemail recording. Not even half an hour later, he called me again. I could still hear muffled screams. It sounded like a girl was trying to call for help. Another text message was sent to me minutes after hanging up. &quot;Where do you live?&quot; he asked. I didn&#39;t respond. Seconds later, another text, &quot;Let&#39;s be friends.&quot; I was terrified. So terrified that I didn&#39;t end up sleeping all night. Later that day I ended up calling the police and giving them all of the information that I knew about this guy, hoping to help the girl in this situation. I never heard from him again.</p>\n\n<p>To this day, I still don&#39;t know who that man is, how he got my number, or what happened to that girl that I heard. I&#39;ve tried my best to find articles or records of this man but every google search has come up with nothing. It scares me that there is a possibility that this man is still roaming the area that I live in.</p>\n</div>\n","author":"CryBabyTaylor"}