{"rank":"163","title":"Time Stops At Midnight","id":"8lg4hi","url":"/r/nosleep/comments/8lg4hi/time_stops_at_midnight/","time":"1527045057000","body":"<div class=\"md\"><p>I don’t know why,  I don&#39;t know how, all I know is that time stops at midnight.</p>\n\n<p>It always does. Even if you claim it doesn’t because you’ve pulled many all-nighters and it’s never stopped for you; it has, you just don’t recall. I think only a few people do though, so don’t worry. But time stops at midnight.</p>\n\n<p>I’ve yet to find someone else who can experience it as I can. I’ve wandered around the neighborhood, I’ve even gotten in my car and driven around, looking for anyone else who might be out at this time, like I am, but I haven’t seen anyone yet. But time stops at midnight.</p>\n\n<p>It stops for exactly 120 minutes. Two hours. Two long, boring hours. Or at least they used to be boring, now, not so much. It’s starting to get scary when time stops at midnight.</p>\n\n<p>The first time I realized what was happening, I tried to wake my parents. They didn’t wake up. I screamed at the top of my lungs, shook them until my arms hurt, I even hit my mom with a pillow a few times, but they didn’t wake up. They also weren’t dead though; I could see and feel that they were breathing. Everyone is. They lay in bed, or sit in front of the television, or wherever they were before time stopped at midnight, </p>\n\n<p>One time it happened while I was at a party. One minute I was pushing through a crowd of people dancing all over each other, and the next minute everything was quiet and everyone was still. Time had stopped because it was midnight.</p>\n\n<p>I usually go on walks, sometimes I just stay inside and read or watch a movie. When midnight hits, the clocks change. The change from 12:00 am to a countdown of 120 minutes. It’s torture. Televisions don’t work, because there’s no broadcast if time is still. It took me a few days to find out that I could still watch stuff online, provided that I was holding my laptop when time stopped at midnight. </p>\n\n<p>I stopped going on walks two days ago, when I started to feel like I wasn’t alone anymore. I felt eyes following me the entire way down the block and back to my house. I didn’t feel that before. It used to be calm. There was no wind, but it was fresh outside; not too hot and not too cold. The moon was out, casting a dim light upon everything. Now, it’s a little too cold, and the moonlight looks harsh and artificial. But time still stops at midnight.</p>\n\n<p>The first day that I didn’t go for a walk, nothing happened. I stayed inside and read a book, then when time started again I fell asleep. I don’t know why, but I don’t feel safe falling asleep when time stops at midnight. </p>\n\n<p>Last night I heard something. It sounded like footsteps, but they were too fast. I sat in the silence and listened as the unmistakable sound of pounding steps got louder and louder until it was right outside my window, where it came to a sudden halt. I held my breath and checked the clock. 30 minutes to go. </p>\n\n<p>I could feel someone standing outside my window, and although I couldn’t see anything through the thick curtains, I felt like I was being watched. I didn’t do anything except sit and wait out those 30 minutes. When there were 10 seconds left, the footsteps started again, too fast, but this time they were moving away from my window. When time began again, I worked up the nerve to slightly peel back my curtain. There was no one there. </p>\n\n<p>I opened up the window and poked my head out to look around. Nothing. Then I looked down at the ground below my window. Footprints. But not one pair of them; dozens of them, all covering my front lawn. They had trampled down the grass. </p>\n\n<p>I closed the window and got back into bed, but I never fell asleep. Now I’m sitting here, waiting with my heart wanting to pound its way out of my chest. I don’t know what’s out there, but they know about me, and I don’t know what I’ll do when time stops at midnight. </p>\n</div>\n","author":"EaPAtbp"}