{"rank":"4","title":"My Kitchen threw a Temper Tantrum","id":"8lg8r3","url":"/r/nosleep/comments/8lg8r3/my_kitchen_threw_a_temper_tantrum/","time":"1527046167000","body":"<div class=\"md\"><p>What is the worst decision you ever made in your life? Mine was opening up a bakery. I know, I know. What’s wrong with opening up a bakery? Maybe I went bankrupt or maybe I found myself in crippling debt. I could have even suffered from a horrible baking accident to do with hot fudge being spilled on my face. None of these things happened, what did was ten times worse.</p>\n\n<p>At first everything was perfect. Business was great, and I even got an award for being the top bakery in the county, thanks to my cupcakes. That was when weird things started happening. Really strange things.</p>\n\n<p>The first incident was when I was making a three tiered cake for the wedding the next day. It was late, around 3 am, and I was just setting the cake out to cool. I turned my back to start making the frosting when there was a loud clatter behind me. I turned abruptly to find my smallest layer smashed on the ground. Okay. So maybe I left it too far on the edge. It’s no biggie, I have cake batter leftover since the layers are all different flavors. I can just make a new one. I probably left it too close to the edge of the counter. I turned back around to make the frosting when something hard came into contact with my head. Looking down, I saw the second largest layer at my feet. Thank goodness the pan wasn’t hot anymore. Now this time, I was concerned.</p>\n\n<p>“Luke! Are you playing another trick on me? This isn’t funny! I have to have this cake to the wedding venue by 7 am tomorrow!” I yelled out, assuming it must have been my employee and good friend, Luke. He was 19 and loved playing pranks on all the staff. However, he’d never intentionally done something to ruin a client order. Still, strange things had been happening all week. Flour all over the floor. Baking powder in the wrong cabinet. Washed dishes being found dirtied all over again with no evidence of actual baked goods anywhere. </p>\n\n<p>None of this really concerned me at the time, as I gave all my employees permission to use my kitchen as long as they brought their own ingredients (or reimbursed my own) and always cleaned up after themselves. So I didn’t see too much of a problem, just made sure to remind all my staff of the rules. I like to think I’m a fairly easy going employer, as I’ve had horrible bosses and the last thing I want is to be like one of them. Anyways, I let the incidents go. But, none of those times were near as obvious as the moment that followed that whatever this thing was, was not an employee. And it most definitely was not trying to play a simple prank.</p>\n\n<p>I watched in horror as the last piece of cake slid over the counter. A chill went through me. Nothing was moving it. The windows were closed, and even if they weren’t, the wind can’t move a cake pan. I saw no string pulling the pan either. I watched in terrified silence as it slid to the edge of the table. I watched as it hovered in the air for what felt like a lifetime before dropping to the hound with such momentum that the pan split and cake went flying. </p>\n\n<p>I backed up in pure terror, only for the cabinet behind me to open with a force that made my legs buckle. I fell to the ground and watched in horror as utensils went flying, cabinet doors opened and closed all on their own. Plates flew out, shattering to the ground, though miraculously none of them hit me. The oven doors opened and slammed shut? Sending waves of heat in my direction when I knew they should have been cool by now. </p>\n\n<p>I high tailed it out of there as fast as I could. There was no way I could stay there. So now I’m home, after taking my delivery truck back to my house , too scared to walk the five blocks. I remade the cake and I’m still going to deliver it tomorrow. Nothing strange happened at my house, but I may look into getting some sort of protection over it to be sure. I called all my employees and gave them the week off. I’m closing the bakery, at least for this week. I’m sure hoping whatever that thing was had the decency to turn the ovens off. </p>\n\n<p>I don’t know what to do, and I don’t know why this is suddenly happening after a year of owning the building. Anyways, I’ll try to keep an update on what’s going on. I’ll see what I can find about this sort of thing in the meantime.</p>\n</div>\n","author":"Readforlife"}