{"rank":"1","title":"Please Help: who’s the man in my house?","id":"8lger5","url":"/r/nosleep/comments/8lger5/please_help_whos_the_man_in_my_house/","time":"1527047867000","body":"<div class=\"md\"><p>Before getting started I just wanted to make it known that I’ll try my best not to linger. There’s so much to this story that I just want it all to be told,  but I’ll try to do it in the shortest way possible. I also am no author by far, so please bare with me and give me feedback! I really am at my wits end. \n———————</p>\n\n<p>A few years back, or more like a decade ago, my family and I moved into our new house. I was too young to be in school, and my mother had chosen to quit her job before the big move. \nWhile bringing shipments of home-goods from one place to another, my father tended to sleep at the old place on weekdays. The new prospective owners had a few weeks left before they were able to move in, and the area wasn’t good enough to leave the place completely empty. </p>\n\n<p>This allowed for me and my mom to get in some serious bonding time. Even as a small child, I always enjoyed helping around the house; whether it be unboxing dishes, or ‘painting’ the walls. \nOne night, we had finished a long days work and retired to bed. At the time, beds hadn’t been delivered and the bedrooms were still being finished. This resulted In our living room and a blow up mattress being the place to be. </p>\n\n<p>Not long after we had fallen asleep, I remember hearing my name being called. I swiftly woke up and turned to my mother who was still asleep. I wiped my eyes and sat up. My eyes scanned around the room, but nothing. I then turned my head to stare out into the sunroom. (Now mind you, due to the house still lacking some of the basic necessities.. there were no curtains anywhere). The sunroom is a decently sized room, about 15X12 feet, and made of complete glass, all of which are individual sliding doors. One of these sliding doors also separated the actual house from the room. \nWhen looking in the room at first, I had t noticed anything too out of the ordinary, but then something deep inside of me had said to get up. I listened. </p>\n\n<p>Walking over to the glass door, I looked into the corner of the room, there stood a man.  He was standing still and just looking at me. I did not feel scared, or worried at all. In fact, I remember feeling calm and safe. The man looked to be of African American decent, but his coloring was completely off.. it was as if there was a permanent light shining through him, it covered his entire body. His clothing was torn, and he wore what had seemed to be a ragged button up, and dark pants. \nThe man smiled at me, but said nothing. \nAfter a moment of looking at one another, he raised a hand to point next to him. Besides him lay a burlap sack, and from within, ropes seemed to be sticking out. He smiled at me one last time, then raised both his hands and head towards the ceiling. \nNext think I knew, I woke up. </p>\n\n<p>Being thrilled about this new experience I told my mom as soon as I could. “There was a man in the sunroom last night.” Is all I could say. \nShe looked at me as if I was crazy, I told her about him standing there and then me waking up, but nothing of his clothing or the sack. \n“We were painting all day yesterday, the fumes must have been too much for you. It was probably just a dream.” She said. And that was the end of that. </p>\n\n<p>————————</p>\n\n<p>Now  fast forward a few years, and I’m now in eighth grade. \nFollowing the same morning routine as always, my mother woke me up and told me to get ready. \nBeing a young pre-teen I took a lot into making myself presentable, including pounds of makeup and an unhealthy amount of styling products. </p>\n\n<p>While straightening my hair, my mother sat at the vanity on the other side of the bathroom. Casually she turned in her chair and looked at me. I could see her reflection in the mirror and stopped. I turned to her, her face looked different. It wasn’t as happy as it normally was at 6am on a weekday. </p>\n\n<p>I looked at her for a while before she finally spoke. \n“Do you remember, that man? The one you said you saw?” It took me a moment to realize what she had been talking about. </p>\n\n<p>I laughed at the question, finding it odd for her to be bringing it up. Her on the other hand, didn’t laugh at all. \n“Why...” I asked, feeling my stomach start to turn. \n“Well, I don’t want to freak you out but, I think I saw him.” \nI couldn’t do anything but look at her. She had a straight face and then turned back in the seat, facing her back towards me. \n“What do you mean, ‘think you saw’ him?” I ask. \nShe then went on to explain something that made my eyes water. </p>\n\n<p>She had been letting the dogs out as always, when suddenly, she saw a man run out of the woods. He headed straight for the pond, full speed. He did not see my mother looking at him until she took a step forward to make sure her eyes weren’t deceiving her. He then stopped mid stride, and turned towards her. She explained that this man looked angry, and wore only tattered clothing. He then started running full speed towards her, and towards the house. My mother fell back-words out of fright and started crawling away from the door. </p>\n\n<p>To this day, she will say it was the most horrendous feeling she has ever felt. \nFortunately, the old owner of the house installed a street lamp near the house, for their children to have light at night while playing. </p>\n\n<p>My mother says, once he hit the light. He vanished. \nShe explained how the dogs ran besides him toward the house, he looked of African decent... and most importantly.. wore a rope. Tide around his waist. \nWhen she told me this I felt like I couldn’t breath. I had never told her about the sack of rope, so how could she have known? </p>\n\n<p>Since that incident my mother and I tell our stories as simple spiky takes around a bonfire, and nothing more. \nYears had gone by between me seeing him and my mother’s experience so we expected nothing else to happen. Until now. </p>\n\n<p>———————</p>\n\n<p>Fast forward to a few weeks ago, I am now home on summer vacation after finishing up my sophomore year of college. \nThere isn’t much to say other than, I was in the living room one afternoon, while my parents both were in the kitchen. I decided to eves-drop (sue me, it’s what kids do!) </p>\n\n<p>I had overheard my mother whispering in a shaky voice, explaining to my father something that gives me anxiety now, anytime I go somewhere. \nShe told my father that upon driving to work that morning,(she has since taken on a job since I went away to school) she was looking in her rear-view mirror and saw a man sitting in her backseat. \nSOME REAL HAUNTING IN CONNECTICUT STUFF I KNOW! </p>\n\n<p>She didn’t explain what he looked like nor have I asked her about it, but it makes me wonder. \nWhat’s going on? Why does this keep happening? Who or what is this? I didn’t know where else to go with this, so please. If you have any information that could help or any suggestions I’m all ears. I just don’t know what to think anymore.</p>\n</div>\n","author":"autumn1620"}