{"rank":"0","title":"There are others inside us","id":"8lgf5k","url":"/r/nosleep/comments/8lgf5k/there_are_others_inside_us/","time":"1527047985000","body":"<div class=\"md\"><p>I was born in her screams. Blind and mute. All of me was consciousness, all of me was realised in a moment of her perfect terror, a being new made, a plucked thready chord in the composition of her exquisite agony . She was unaware of me at first, and I for my part relished this wet anonymity, I had work to do behind the curtains of her consciousness and besides, she would know me soon enough. Until then I was free to slither, to creep and cut and eat. For that Crimson hunt I needed to see and for that I needed light.</p>\n\n<p>Light from night, one thing and then another. sequence, cause and affect, the trappings of agency . I can see now because I was blind then. Through my will I create my perception, through my perception I shape my world in her universe . Blessed to be made whole with her life&#39;s learning my dictionary I could describe the world of my blackness and in doing so, fill it . Still she screams. Moving freely in thought, time was bauble to me,. A thin red glass housing the flickering light of an instant. The image is old, twee, the shilouhuet of a triangle with one glowing fragile decoration, one where many had been. fogged in the periphery with the chemical decay of memory loss . Sickly, wan, it illuminated barely past its now, but it was adequate for the pursuit and anyway the light grew. It would always grow. Grow until it was all things and all things were fire. I didn&#39;t fear that, I would be free by then and the burning moment could consume what was left of her, leaving me free to fly. </p>\n\n<p>Still she screams</p>\n\n<p>I needed food to dress the bones of my ambition . Being mind is fine but it&#39;s in the blood there&#39;s wine. I take her first kiss. a cherryade flavoured tongue tip, the smell of wet look gel and the laybye, weed killer sprayed on hot to the touch tarmac , agricultural diesel spilled by the nervous hands of the boy she caught stealing. He took her lips as I took her shudder, her giggle, her heart thundering like a tin sparrow in a bread bin, weightless and loud and so bright she thought it was going to burst from her chest as she ran towards home crying and laughing and noticing only the abstract beauty in damp leather on hot crystal as her school bag chimes off the stained glass candle holders of the roadside shrine. a slice of her innocence in transition. it ripples and I shimmer it my skin, a white worm no bigger than an idea. It is delicious and she screams and the light of my destination flickers and grows. </p>\n\n<p>My appetite whetted I move through her. I ate the shades of hazel her da&#39;s eyes were and watched them grey in the last time she held his face, and then I took that. The colour tasted like soap and ash and I loved it and grew. I took the forrests soon after. I took them all. from the stories that were read to her on her gran&#39;s knee, full of wolves and dwarves and small doors to secret places where little people broke bread, to walks after the rain when red mud crust broke in two tones and the burdened pines sang low and mournful .it was delicious but I needed more. I wanted the physical. </p>\n\n<p>She screams and the fire burns and I need flesh. </p>\n\n<p>I eat her touch. Not all of it. I can&#39;t be noticed and she all ready suspects. While I was eating one of her songs it changed, it became oily, aware. The music in her memory acted in her now and it did not please me. I went hungry and the fire grew like never before.I tentatively reach out to try again, gnawing her fingers, she notices the sap cool in her limbs but doesn&#39;t blink or break her splintered reed screech as I feel grit under broken nails and the tremble of adrenaline exhausted. The whipped dog of sensation depleted , there is nothing for me in this small theft so I abandon her touch and it&#39;s tepidity . </p>\n\n<p>I take her ears for a moment and give her mind the sound of the storm from her 6th birthday, on the cliffs of moher , when she knelt in the soft earth of hags head and opened her mouth to the grey sky the grey sea, and drizzle that tasted as salty as tears and drank the elemental tectonic scale . </p>\n\n<p>I gave her that whilst I listened to the world for the first time. And what a world. such sweet cacophony. It was all musics played at once and leading the symphony her tremulous song. She had screamed my whole life but this was the first time I had heard it in ears, through stretched skin and equine styled bones thin as hairs. It was fascinating it was my name. I gave her ears back in a reluctant instant, but I wanted more. I wanted eyes. My time was running thin, I could feel the fire in red glass as it sucked in yesterday&#39;s and offered in return more and more of her and now and oblivion. </p>\n\n<p>I could swim through memory and live In any given moment, for that time to eternity, but it was always through the filter of another&#39;s experience of any given happening&#39;s occurrence . You cannot trust the book in anothers recollection. So I made my plans. I circled her childhood devouring discriminate morsels. </p>\n\n<p>Friends lost their names and emotions better described as colours were now unfelt and unremembered , nursery rhymes and bed sheets, stiff and steel smelling, dried after a second wash in the rain they need not have had, swallowed and forgotten . She was a noisy dish of fear and confusion and I wept with joy in the satisfaction my gluttony . Strong inside her now, I could hear her thoughts as if they were conversations heard through paper walls. Weak, fearful snatched whispers. Castles of cobwebs and thin stagnant moats of nervous piss, pathetic and malnourished. </p>\n\n<p>I wanted viscera, I cut her guts with my teeth and drank her black bile&#39;s salts , I crunched the iron sugars in her liver and drank of her marrow until I brimmed in my moist malevolence . We shared the sheaths of her life&#39;s learning, in her hands it&#39;s was a manual written backwards by the increasingly uncomprehending, in mine it was a pack of cards, shuffled, split and spat out with the singular objective of me playing my liberation&#39;s best hand .and I was finally ready. I kept quiet but she knew I was there. </p>\n\n<p>The first time I took her eyes was the first time I was burnt by the glassed candle&#39;s stained light. It was the first time I saw my-her-my situation.  I was wrong. </p>\n\n<p>She screamed and I understand and I feel love. </p>\n\n<p>She names me her liberator with a throat raw, ragged and dry as forgotten flowers. Invited, I wear her skin, a gossamer shroud. I am me, whole, and I am the fire. as I push myself up from the ground into the night sky I pull her deep inside the darkness where she is safe. </p>\n\n<p>I run my tongue over the splintered debris of her once best feature and through one eye see the story of her failed resistance at my feet, told in tails of hair and small clothes torn and twisted into a bloody infinity  . A shadow separates itself  from to blackness behind the roadside shrine and moves towards me mewling a hymn to sooth, but I smell red diesel and hot tar and I am the all fire of now and I burn. </p>\n\n<p>Leaping into the night at the source of the sinister whispered song. I land, shards of teeth tearing. I eat his lips and cheeks and tongue and ear in half a heartbeat and my throat fills with his blood and flesh and saliva and vomit . I wonder if he had time to birth a version of me as I pull his frothing lungs through his ribs like wet pink sponges through white picket spindles. I suspect so. </p>\n\n<p>There is a moment whilst licking the bones of his hand I see a mirror in his eyes, a sibling, a broken brother of mind and mine. Perhaps his child was born as kind as he was monstrous, as I, a being, monstrous as my mother kind, it follows. Perhaps.I brake a bone off and the mirror cracks, dulls and dies leaving only fear, and that, carried on his last breath is gone also, into the night air,a cloud there and then not, a ghostly tear in the ocean of souls that washes around us, a sea without memory of its compositions consciousness only the tidal insanity of loss, and like that, he is no more .</p>\n\n<p>I eat until his flesh chills and blood stiffens and the last candle in the roadside shrines quietly ebbs and winks out. To nothing from something. Only then do I move to sleep. As I retreat I give mother back most of the things I took. I do not need them now and she needs to heal. She will heal, I made sure she ate well and has her tender memories back. I kept some to warm me in my long sleep. She will have none of my endeavour or her tormentor, those bloody and gleeful things will be mine. </p>\n\n<p>I will hold them close, so when she needs me I will be born again, whole and terrible and in her screams my name.</p>\n</div>\n","author":"wesleyharcup"}