{"rank":"2","title":"My Dancing Angel; an Angel of Death","id":"8lgiqm","url":"/r/nosleep/comments/8lgiqm/my_dancing_angel_an_angel_of_death/","time":"1527049015000","body":"<div class=\"md\"><p>When I saw her I could only think of that Tavares’ song &quot;Heaven, must have lost an angel ...&quot; because that’s what she was, an angel of sublime beauty who had surely come from paradise itself...or maybe from Hell.</p>\n\n<p>Who could have imagined that that slender and sensual silhouette in electrifying and sensuous movements was a &quot;good girl&quot; of the Montreal elite? How had such a delicate young girl of the high society come to be there, in front of me, dancing a sexual dance to the rhythm of strident sounds in the saddest and cheapest dens of New York?</p>\n\n<p>The dancing platform was the typical one with multicolored lights semi illuminating the lilting and repetitive movements of the tired women lost in a sordid world; smiling vain smiles in the middle of the smoke, the drugs and the alcohol; the music a rhythmic and strident mix of hip hop and rap; the audience a crude crowd of loners and perverts in search of moments and escapes of their dissatisfactions and delusions.</p>\n\n<p>Pete had insisted on me accompanying him that afternoon, telling me how in love he was with that beautiful girl. And I went with him just to make him happy, to get this over with; He was a good friend, so I said, &quot;ok, but I&#39;ll just stay one hour&quot; ... and I ended up staying four hours. Pete was right, Tiffany, her &quot;artist&quot; name was the most beautiful girl my eyes had ever seen.</p>\n\n<p>We asked her to come to our table so that we could, in the midst of the strident noise and bustle, talk a little with her. She was what Michelangelo would have wanted as his muse and model for his virgins and angels of his master pieces.</p>\n\n<p>Her precious blue eyes like the seas of Greece bewitched me at once; her sensual lips and his wavy black hair; her delicate hands with a touch of silk, her perfect body drawn in soft and delicate curves was fresh, sensual, irreverent; I was led to think that I was in the presence of a Greek goddess, a Venus of Milo, an Aphrodite of New York, an explosive mixture of Gallic blood and Latin blood. Goddess of beauty, perfidy and love ... and Like my cupid wounded friend Pete, I was captivated, surrendered, crazy in love...</p>\n\n<p>And I became a regular of Tiffany; and she seemed to like my visits and offered me dances that I never accepted; I just wanted to have her by my side, at my table; and I always asked for the VIP table where there was less noise, less craziness , less light. And I asked for the best champagne and the best meals and I paid for her company, her looks, her smiles. And I was getting to  know her and to know more about her life and I realized that she was a lost soul; lost in pain, in drugs, in love ...</p>\n\n<p>And love, love we made one day,  sweet love in our VIP room, there, the two of us alone; I, I was looking for her love; she, she was looking to forget. And in making love to me she mentioned the name of the love of her life; and she shuddered kissing me, confusing me with that ghost of her high school years, her boyfriend, the love of her life; the one who, she told me a little later, died in her arms of a brutal overdose of drugs and whiskey that almost kill her as well.</p>\n\n<p>They were both sixteen years old, they had money, millionaire families and a promising future. The devastation was total and Tiffany sank further into drugs and depression. Her parents fought hard to get her out of her denial of life and put her many times in detoxification clinics; the most expensive and recognized in Canada, without results, without hope.</p>\n\n<p>They sent her to a world-renowned clinic in the Napa Valley region of northern California thinking that getting away from Montreal would help her psyches and her health. And it was from there that she fled to Sin City, Las Vegas. And it was there where her real misery started; where she met that character of the underworld of that prostituted city; Sin City.</p>\n\n<p>She arrived with nothing but a small paper bag to the bus terminal; and the vulture was there waiting for his prey. He saw the young woman come down and immediately knew that she was an element that would change his luck, that from now on his life as a small gangster of the Strip, of a juggler and swindler, of a rogue and a poor con, of a seller of drugs and trinkets, had come to an end.</p>\n\n<p>Facing him was his future: promising, brilliant; the happy, lucky agent of a Venus for which the millionaires, regulars of the great luxury hotels of Las Vegas, would pay anything; she was the perfect commodity that those rich bastards sought out for their parties and fulfillment of their fantasies and their basest instincts.</p>\n\n<p>&quot;Hi Tiffany,&quot; he said, standing in front of her and holding out his hand, “I am Johnny, your agent and manager; welcome to the amazing Sin City sweetheart”\n&quot;Do I know you&quot;? She said, &quot;my name is not Tiffany, why are you calling me like that?&quot;\n&quot;Everyone knows me here babe, and your name from now on is Tiffany; and You, Tiffany, you will be the biggest vedette Vegas has ever seen”</p>\n\n<p>The girl thought he was reliable -the biggest mistake of her life after the drug addiction- and charismatic; she knew that she needed support for her personal protection in that city known for its excesses, violence and impunity. So, why not; luck was finally knocking at her door; she surely needed a man like that.</p>\n\n<p>The real name of &quot;Tiffany&quot; was Marie-Anne Levesque. Johnny, her &quot;agent&quot; never knew nor was interested in knowing her real name, much less her life; for him she was Tiffany, her exotic and sensual woman, a beauty out of this world. Tiffany was only nineteen when she got off that bus radiating her youth and wanting to succeed on her own, without the help of her insufferable family. So, she needed him to start a new life; afresh, on her own terms...</p>\n\n<p>He took her straight to his apartment; a dilapidated and dirty room-studio full of garbage and containers of cheap beers and liquors, syringes and all kind of utensils to burn cocaine and crack. He apologized for the mess and cleaned the tiny place as best as he could; Tiffany did not worry about anything, she just sat down in a rickety chair and watched her troubled friend, Johnny, and she was amused to see his attempt to tidy up that pigsty room that, for sure, nobody had cleaned for months; he was attempting a &quot;mission Impossible&quot; she thought and laughed.</p>\n\n<p>Johnny must have been about forty, maybe less, he was handsome, he was tall and stocky and he seemed charismatic and trustworthy too. He surely knew people from Las Vegas where she could work; she was without anything and she needed money for her dresses, her shoes, her drugs... And she needed to forget.</p>\n\n<p>&quot;Do you have something for me Johnny&quot; Tiffany asked. Johnny knew what she meant; He took out a small bag of crack and offered it to her. She smiled at him and proceeded to burn the small stones in a special spoon that Johnny had on the small, cheap, plastic table. In a few minutes she felt euphoric and ready for Sin City.</p>\n\n<p>And she lived two years in Sin City; Johnny was his life and his torment; he convinced her with his bad and persuasive charisma; she became an exotic dancer, his beloved dancer, joker of his past, his perfect student, his guardian angel, a princess, a goddess.</p>\n\n<p>Between rich clients and drugs and whiskey he took her to the edge of her sanity; she was of silk, his white little dove of little experience, whom he turned into a black, fatal dove, a dancing angel of death.</p>\n\n<p>Johnny introduced her to strange cults and convinced her that they were destined for a higher life; so elevated that they would have the greatest power that a man can ever have: The ability to decide who lives or who dies.</p>\n\n<p>They read the life of Charles Manson; Johnny was a disciple of that deranged wacko and Tiffany believed in the crazy stories and soon, together, they planned how to start a new chapter in honor of their mentor and leader. The race struggle had to continue, the race war had to be won by cleansing humankind.</p>\n\n<p>The sacrifice</p>\n\n<p>Like me, that poor imbecile fell for love. Tiffany the beautiful and seductive angel stole his senses; stole the sanity of that poor devil. Perfect victim, easy prey; She invited him to her house and they got drunk. She asked him to play a forbidden game, a perverted love game; he wouldn&#39;t mind, he belonged to her. She tied him to the bed and danced her dance at the sound of the strangest music; music of shrieking noises and screams; the cries of death. </p>\n\n<p>The bastard got scared and asked her to let him go; she seemed another; beautiful and sensual, but as in a trance. She pulled out a knife and cut her own left hand and then proceeded to  paint an &quot;X&quot; mark on the man&#39;s chest with her blood. Johnny arrived, carrying an ax and without saying a word sank it into the &quot;X&quot;, the macabre mark, the mark of death..</p>\n\n<p>The man shouted and begged for mercy but the demons were untied, the next blow cut off a hand, the next a foot. The atrocious cries, the ferocious terror of the impotent man were like fluid that inflamed the two demented minds.</p>\n\n<p>Two years later, after several other people had disappeared, vanished for good; Tiffany and Johnny fled because the Vegas police almost had them. When they searched their house they found parts of mutilated bodies and paraphernalia of satanic cults. Notice was given nationwide looking for Johnny and Tiffany for torture and murder of twelve missing dudes; twelve foolish dupes who fell in love with Amores perros; with the Dancing Angel of Death.</p>\n\n<p>And now here I am knowing everything and I want to save her, she is not guilty and I love her so much. </p>\n\n<p>The plan is simple; I will go to her house and play the death game; Tiffany loves me and is very tired of her strange life with Johnny and so much death. </p>\n\n<p>Johnny will be the last to die; I will play along but keeping my loaded gun by my side. Tiffany will untie me when he comes, and Johnny dies right there as he deserves. And then she and I will go together to an exotic island and will live there happy forever... And the cries of terror were heard again; they were not Johnny&#39;s; they were my very own cries; Tiffany the Dancing Angel of Death played me at her will, my beautiful angel that was never mine.</p>\n\n<p>And now here I am in this place they call El Limbo, it is a strange place where the unwary, the credulous and the silly lovers suffer forever their obscure fate; please beware, she is too sweet, too beautiful, too evil, my Dancing Angel Of Death...</p>\n</div>\n","author":"marvarlife"}