{"rank":"481","title":"I think my grandfather might be a serial killer. Final part.","id":"8lgnmj","url":"/r/nosleep/comments/8lgnmj/i_think_my_grandfather_might_be_a_serial_killer/","time":"1527050500000","body":"<div class=\"md\"><p><a href=\"https://redd.it/8epbdy\">\nPart One</a>  </p>\n\n<p><a href=\"https://redd.it/8fg0wx\">Part Two</a>   </p>\n\n<p><a href=\"https://redd.it/8g3t9k\">Part Three</a>   </p>\n\n<p><a href=\"https://redd.it/8gmv5o\">Part Four</a>   </p>\n\n<p><a href=\"https://redd.it/8h7vaz\">Part Five</a></p>\n\n<p><a href=\"https://redd.it/8hjvu5\">Part Six</a></p>\n\n<p><a href=\"https://redd.it/8htpr5\">Part Seven</a></p>\n\n<p><a href=\"https://redd.it/8i5k72\">Part Eight</a></p>\n\n<p><a href=\"https://redd.it/8ivfxi\">Part Nine</a></p>\n\n<p><a href=\"https://redd.it/8jnl02\">Part Ten</a></p>\n\n<p><a href=\"https://redd.it/8kl3aj\">Part Eleven</a></p>\n\n<p>&nbsp;</p>\n\n<p>My grandfather is going to die and its my fault.  That’s the thought that keeps pushing to the surface as I pound on the lab door, screaming for Prakesh to let me out.  To not do this.  I try to force the idea back down—it’s a distraction and I need to focus—but it keeps working its way through me like shrapnel driven by some inexplicable need to harm.  I step back and slam against the door with my full body weight once, twice, and on the third time I feel my collarbone give way when I hit.  Biting back a sob of pain and rage I beg again through the door for the doctor to leave him alone, but the only answer I receive is silence.</p>\n\n<p>&nbsp;</p>\n\n<hr/>\n\n<p>&nbsp;</p>\n\n<p>I had gone to pick up Prakesh from a department store parking lot over an hour away.  He was a small and fidgety man, standing next to his car with a small duffle bag in hand.  When I identified myself as Dr. Barron’s grandson he greeted me warmly, and when I handed him the black sack to put over his head and asked him to get in the back so he wouldn’t be seen, he nodded without complaint or any sign of surprise.  Whether that was because my grandfather had already told him he couldn’t know the location of where he was going or because he was just that compliant, I wasn’t sure.  I looked through his duffel bag but it was just a collection of medicines, syringes, and a few other medical supplies that I supposed he brought in case my grandfather had forgotten something that was needed for the procedure.</p>\n\n<p>&nbsp;</p>\n\n<p>We drove in silence for the most part other than me periodically asking if he was comfortable enough, and when we arrived back at Jager Solutions I carefully led him inside the warehouse where my grandfather was waiting.  After patting him on the back and thanking him again for his help, my grandfather led Prakesh down to the lower level before finally removing the black sack from the man’s head.</p>\n\n<p>&nbsp;</p>\n\n<p>Prakesh had looked dazedly around at the bright lights and new surroundings before focusing on us and smiling.  He said he was ready to begin whenever we were, and in less than an hour my grandfather was in the vault and under anesthesia, strapped down to the same metal table where so many outsiders had lain.</p>\n\n<p>&nbsp;</p>\n\n<p>I didn’t like the look of him on that table.  In a hospital gown, asleep and tied down, he looked so vulnerable.  As he had instructed, I was standing at the open door to the hatch, gun ready in a holster at the back of my belt.  I knew that Prakesh had seen the gun and I had made no attempt to hide it, figuring its presence might serve as a deterrent if he was up to something nefarious after all.  </p>\n\n<p>&nbsp;</p>\n\n<p>But I thought my grandfather was right—Prakesh seemed to be a good man who genuinely liked my grandfather and deeply appreciated him saving Prakesh’s daughter years before.  They had talked amiably for a few minutes as my grandfather had gone under, and it seemed natural and heartfelt. </p>\n\n<p>&nbsp;</p>\n\n<p>As he was fading into unconsciousness, my grandfather had waved me over.  When I was close by, he gave my arm a squeeze and met my eyes.  “Remember everything we talked about.  I love you and I’m very proud of you.”  I saw tears forming at the corners of his eyes.  “I put a letter for you on my desk in the lab too.  Just wait and read it when this is over, however it turns out.”  Giving me another squeeze, his eyes began to flutter shut as his hand slipped away.  Wiping my own eyes, I went to my post by the vault entrance.</p>\n\n<p>&nbsp;</p>\n\n<p>While my grandfather had described the procedure to me, I only understood it at the most basic level and I assumed it was going to be a fairly long operation.  In truth, after Prakesh started to work it was all done in less than an hour.  My grandfather had already shaved his own scalp around the surgery site, so after sterilizing the area, Prakesh used a surgical saw to cut out a small piece of skull on the left side of his head, setting it aside on one of the rolling instrument trays in the room.  He then inserted a thin metal rod that my grandfather had showed me was actually an endoscope—a small camera used in brain surgery.  This was followed by thin, hollow tube when he said he had located the seed.  A tiny rod ending in an articulated claw was inserted down the tube, with the idea of it being positioned at the other end to safely grab the seed and pull it back through the hollow tube itself and out of my grandfather’s brain.</p>\n\n<p>&nbsp;</p>\n\n<p>As Prakesh worked I felt myself growing tenser and tenser, cool sweat pouring down my back and legs as I waited for it to be finished or for something to go wrong.  I kept imagining my grandfather suddenly waking up and trying to attack us as the seed took him over, or perhaps worse, him just disappearing entirely if the seed became damaged during extraction.  But nothing like that happened, and when Prakesh finally removed the extraction rod, I saw the small metal claw at the end held something small and black.</p>\n\n<p>&nbsp;</p>\n\n<p>“Is he okay?” I blurted out, instantly regretting any distraction I might be causing while surgery was still going on.  Prakesh didn’t turn but nodded.  </p>\n\n<p>&nbsp;</p>\n\n<p>“He’s very strong, and I think it went well.  Like your grandfather probably told you, this isn’t my specialty, but after I replace the skull door and bandage him up, he should be done.”</p>\n\n<p>&nbsp;</p>\n\n<p>I nodded back before realizing he couldn’t see it with his back turned.  “Good.  That’s awesome.  Thank you so much for helping us.”  I thought for a moment I saw Prakesh flinch, but he continued to work steadily and I decided it was my imagination.  A few minutes later he was finished and washing up, and when that was done he approached me with a small plastic tray.  In it was the seed.</p>\n\n<p>&nbsp;</p>\n\n<p>“He wanted you to store this I think.  In the lab, maybe?”\n&nbsp;</p>\n\n<p>I nodded.  In the days leading up to this, my grandfather and I had talked about a number of things, but much of the time was spent on showing me features of this place and teaching me more lessons about hunting.  Most of it would come out casually in the way of a story about this or that, but I knew he was trying to prepare me for if I decided to stay and help him, or if he didn’t make it, prepare me if I decided to carry on his work.  I wasn’t sure I knew the answer to any of the longer-term questions, but as the surgery day drew closer I knew that at the very least I was going to see him through it and make sure he was safe.</p>\n\n<p>&nbsp;</p>\n\n<p>And what Prakesh was saying was true.  My grandfather had wanted to store the seed in a secure freezer in case it didn’t dissolve this time.  He theorized it was possible since it was being extracted rather than disappearing from a corpse, and if it did stay he wanted it safely confined and available for study.  Seeing it held out to me in that plastic tray, it seemed like a physical manifestation of my relief that it was safely out of my grandfather.  I smiled at Prakesh, fighting the urge to give him a hug and reaching for the seed instead.  </p>\n\n<p>&nbsp;</p>\n\n<p>I left the vault and went to the door of the lab, Prakesh following behind.  He was saying something about how impressed he was with my grandfather’s set-up down here, but I was hardly paying attention.  Holding the seed, even in a tray, felt somewhat akin to holding a poisonous snake, and as I carefully walked it into the lab my eyes never left it.</p>\n\n<p>&nbsp;</p>\n\n<p>This was likely why it was so easy for Prakesh to reach forward, yanking the gun out of my belt, holster and all, while shoving me forward with the other hand.  I stumbled forward, my first panicked thought of not dropping the seed, which rolled dangerously close to the edge of the tray’s raised lip before settling back into the bottom.  It then struck me what had actually just happened and I turned to see Prakesh slamming the door shut, his face looking sad as the slab of metal swung in and obscured him from view.</p>\n\n<p>&nbsp;</p>\n\n<p>I cursed and sat down the tray gingerly before running to the door.  It was designed to lock from the outside in case there was ever a problem in the lab, and I knew of no other way out.  I beat on the door with my fists, screaming for Prakesh to let me out, but there was no response.  I tried to calm down, searching the door for any sign of weakness I was overlooking.  It was a sturdy metal door and the hinges were on the outside as well.  I looked around the lab for something I could possibly pry the door open with, but there was nothing I could see that would make a dent in the job.  Finally, I went back to yelling and pounding on the door, slamming against it hard enough to break my collarbone.</p>\n\n<p>&nbsp;</p>\n\n<p>At this point, as I lay defeated and weeping at the bottom of the door, I knew at least fifteen minutes had passed.  Prakesh could have easily killed him already or something even worse.  He could be carrying him off to be tortured right now.  And it was all because I thought it was over and let my guard down.  I failed in the one thing my grandfather asked of me—to keep him safe.</p>\n\n<p>&nbsp;</p>\n\n<p>I beat my head with my fists as I cried harder.  I could feel myself slipping closer to some deep nadir of self-loathing and despair, and I forced myself to stop.  Now was not the time for this weak bullshit.  I needed to think, to try and be more like him.  I needed to be smarter and better.</p>\n\n<p>&nbsp;</p>\n\n<p>Wiping my face I stood up and started looking for anything that I might have missed or that might be useful.  I saw my cell phone on one of the counters, but it was useless at the moment.  My grandfather had turned on a series of cellphone jammers before I arrived with Prakesh to keep him from being able to communicate with the outside world while he was with us, and the controls for them were in the living quarters, not the lab.  I jammed the phone into my pocket and kept looking.  </p>\n\n<p>&nbsp;</p>\n\n<p>When I reached his desk I saw the envelope he had left me sitting at its center.  I hadn’t even noticed it when I was looking for a prytool for the door, but now it was hard to take my eyes from it.  I knew my time was limited, but I felt some dim hope that it would contain some solution for our predicament.  That like so many times before my grandfather had out-thought his opposition before they even knew he was there.</p>\n\n<p>&nbsp;</p>\n\n<p>I tore into the letter and saw it was written out in his deliberate but messy handwriting:</p>\n\n<p>&nbsp;</p>\n\n<p><em>Jason, you are a good man.  You deserve to have a happy life and you need to have your own reasons for what you do and how you live.  I have asked a lot of you, and for the last few days I’ve been preparing you for this kind of life, but that’s wrong and selfish of me.  I won’t ask you to sacrifice your happiness to continue my work after I’m gone.  If you ever decide you want to, this place is yours, but I honestly hope you don’t.  Hunting these outsiders is an important cause, but it’s a very lonely life.  I started out of pain and revenge, out of not caring if I lived or died.  I’ve come to realize those aren’t good reasons, or at least not good enough, and those aren’t burdens I’d ever want for you.  If I had it to do over, I’d have spent more time with you and your parents instead of pushing you all away.  But life is a series of choices and I can live with mine.  I’ve managed to help those I could and I got to spend the last few days with you.  Hopefully I’ll get to see you again, but either way, I’m satisfied with how things have turned out and I hope you are too.  Love you, Grandpa.</em></p>\n\n<p>&nbsp;</p>\n\n<p>Reading his words, I felt a swell of love for him.  I also felt the resolute certainty that he was wrong.  Looking back on the last few days, I realized I had felt a growing sense of purpose and rightness that I had never had before.  At times it had been terrifying, and I had no illusions I would be as good at it as my grandfather was, but I felt like I was capable of helping him.  Of helping others.  And that it was what I was meant to do.  Any last uncertainty faded away as I read the letter, my mind refuting his points as he made them.  This could be a good and full life, and it didn’t have to be lonely or done for the wrong reasons.  And whatever my grandfather’s reasons for starting down this path, I knew that he had stayed on it because he was a good and strong man that couldn’t stand by while those evil fucks hurt people.</p>\n\n<p>&nbsp;</p>\n\n<p>And I was going to fucking tell him that in person.</p>\n\n<p>&nbsp;</p>\n\n<p>I put the letter down, my mind racing as everything seemed to slow down around me.  I had to be at 20 minutes now.  If my grandfather was dead, time was less of an issue, but I doubted he was.  Not yet.  Assuming Prakesh was taking him away from here and wanted him alive, he probably needed to stabilize him further and then prep him for being moved.  It was a guess, but that would probably take fifteen or twenty minutes if he was having to monitor his vitals and keep him medicated enough to stay under without killing him.  He then had to physically drag him up and out to a car, find keys for the car, and drive away.  Another ten minutes given how much larger my grandfather was than Prakesh.</p>\n\n<p>&nbsp;</p>\n\n<p>That meant I might have 5 to 10 minutes before they were gone.  That would have to be enough.  </p>\n\n<p>&nbsp;</p>\n\n<p>I ran to the refrigerator where he stored blood and tissue samples of outsiders.  Looking through the blood vials, the most recent two were dated three months earlier.  I had no idea if this was going to work and if freshness had anything to do with it, but it was the best chance I had at this point.  I gave the vials a shake, uncapped the first one, and drank it down as quickly as possible.</p>\n\n<p>&nbsp;</p>\n\n<p>Immediately my gag reflex tried to rebel against my plan.  Punching my leg, I fought down the urge to vomit through gritted teeth and then uncapped the second vial.  Down the hatch.  There was no nausea now, and I thought maybe the trouble was past.  Then my midsection flamed into white-hot pain that dropped me to my knees.  I would have screamed if I was able, but there was no air left in my lungs, or in the world at all it seemed.  I fell onto my side, clutching my stomach with both hands as the pain rolled upward into my chest.  I felt myself spasm once, twice, and then the pain was suddenly gone.</p>\n\n<p>&nbsp;</p>\n\n<p>“Fuck.”  I gasped, ragged breaths slowly coming back to me.  “Okay.  Part one done.”</p>\n\n<p>&nbsp;</p>\n\n<p>Ideally I would have waited longer before the next step to insure that the blood had time to “take” if it was going to at all.  But there was no time and I was just going to have to hope for the best.  Leveraging myself back up to a semi-standing position, I used the counter to shuffle around to where the plastic tray sat.  I swallowed my revulsion at the sight of the seed sitting there, its black surface reminding me of the dark surface of a spider’s abdomen as it sat hunkered down and quietly dangerous.  </p>\n\n<p>&nbsp;</p>\n\n<p>Not giving myself more time to think about it, I picked the seed up and swallowed it quickly like the world’s bitterest pill.  It had almost no taste other than being faintly salty, and I suspected that taste was coming from the bits of brain fluid clinging to its surface.  I held onto the counter and waited, my worry building that ingesting it would either do nothing or just make it easier for it to take me over, blood or no blood.</p>\n\n<p>&nbsp;</p>\n\n<p>After a minute with no change, I walked slowly back over to the door and put my ear up to it, trying to hear any signs of what Prakesh was doing or if my grandfather was still alive.  At first I heard nothing.  Then I realized I was hearing something after all.  A small, popping sound.  But it wasn’t coming through the door, and as I turned and looked around the lab I couldn’t find its source there either.  That’s when I realized it was my collarbone knitting back together.</p>\n\n<p>&nbsp;</p>\n\n<p>Within a couple of seconds the pain in my shoulder was entirely gone, and as I slammed my fists into the door again I could feel the change immediately.  My arms felt stronger, more solid, and with each blow I felt the door starting to give way more and more.  When I felt the first hinge pop loose on the other side, I shifted to kicking the door.  Three kicks later it was down and I was out.  </p>\n\n<p>&nbsp;</p>\n\n<p>I looked around, but I saw no sign of anyone in the hall or across in the living quarters.  Heading into the vault, I was terrified I’d find my grandfather’s dead body laying on the metal table, but it was thankfully empty.  That left outside.</p>\n\n<p>&nbsp;</p>\n\n<p>I ran upstairs and was heading outside to see if the cars were still there when I caught movement in the corner of my eye.  I turned back to see Prakesh hunting for a set of keys at the little corner workshop my grandfather had set up in the above-ground warehouse.  When he heard me approaching he spun around, his eyes wide.</p>\n\n<p>&nbsp;</p>\n\n<p>“You got….You stay back!  I’m warning you!  I’ll shoot you!”  He glanced down and I could tell by his expression that he had left my gun in the car.</p>\n\n<p>&nbsp;</p>\n\n<p>“It doesn’t look like you will.  Where’s my grandfather?”</p>\n\n<p>&nbsp;</p>\n\n<p>His eyes darted towards the cars outside, but he was already shaking his head.  “I have to take him.  They found me, they found my family.  If I don’t take him to them, they’re going to take my wife.  My baby girl.  I’m…”</p>\n\n<p>&nbsp;</p>\n\n<p>I raised my hand.  “Stop.  Shut up.  Who took them?”</p>\n\n<p>&nbsp;</p>\n\n<p>“The cult.  The House of the Claw?  I think they had been looking for us since my daughter got away from them, but…”</p>\n\n<p>&nbsp;</p>\n\n<p>“Shut up again.  Your daughter was part of the cult?”</p>\n\n<p>&nbsp;</p>\n\n<p>He nodded weakly.  “She…she was brainwashed.  Fell in with them through a college boyfriend.  And when she wanted to leave, they wouldn’t let her.  She sent me a text asking for help after almost a year, but I had no way to find her.”  Tears were mingling with the sweat on his cheeks now.  “I…I love your grandfather.  He tracked her down somehow and got her out of there.  Got my girl back to me.  She’s so much better now.  So happy.  I can’t lose her again.”</p>\n\n<p>&nbsp;</p>\n\n<p>I felt anger flooding my chest as I advanced closer across the warehouse floor.  “You dumb fuck.  Did it ever occur to you that she never really left or that she fell back in with them?  That <em>she’s</em> how you got tracked down?”</p>\n\n<p>&nbsp;</p>\n\n<p>He was shaking his head as I spoke.  “No, that’s not possible, she would never…”</p>\n\n<p>&nbsp;</p>\n\n<p>“How did they know you were doing surgery on him?  Who did you tell?”</p>\n\n<p>&nbsp;</p>\n\n<p>I saw his eyes widen and it was all the answer I needed.  In the back of my mind, I knew that this rage I was feeling was more than I had ever known, more than I could even really comprehend, but I didn’t care.  This stupid fucking man and his daughter were trying to kill us.  The House was trying to kill us.  The outsiders were trying to kill us.  And they were all going to fucking pay.</p>\n\n<p>&nbsp;</p>\n\n<p>As I reached the first workbench and started around it, Prakesh tried to dart away around the other side, but he was far too slow.  I snatched him back and threw him against a table, several wrenches and screwdrivers falling off their hooks and clattering to the wood below.  Gripping his throat I fought back the urge to squeeze harder as I brought his face up to mine.</p>\n\n<p>&nbsp;</p>\n\n<p>“No more bullshit.  Where is my grandfather?”</p>\n\n<p>&nbsp;</p>\n\n<p>His nose was running with snot now, and it seemed to physically pain him to say the words when he spoke.  “In the pick-up out there.  Passenger seat.  He’s sedated but alive.”</p>\n\n<p>&nbsp;</p>\n\n<p>I nodded.  “Good.  Now when and where were you supposed to take him?”  </p>\n\n<p>&nbsp;</p>\n\n<p>He tried to shake his head again and I gave his throat a hard squeeze.  He croaked out, “I can’t tell you.  They’ll…”  I let go of his throat and grabbed his wrist, holding his left hand down to the table as I picked up one of the screwdrivers that had fell there.  An hour ago I couldn’t have imagined ramming a screwdriver through a man’s hand, but now it was surprisingly easy.  </p>\n\n<p>&nbsp;</p>\n\n<p>After his hand was pinned, I slapped him hard across the mouth to stop his screaming.  He gave out a wet sob and then told me he was supposed to be meeting them at a motel a couple of hours away at ten o’clock that night.  He told me the name of it and said he already had a room key in his pocket.  I took it out and saw from the plastic keychain it was room 609 at the Sunset Motor Lodge, just like he had said.</p>\n\n<p>&nbsp;</p>\n\n<p>“Look…I’ve told you everything I know.  Please, let me go.  Let me get my family to safety.”</p>\n\n<p>&nbsp;</p>\n\n<p>I stared at him for a moment, weighing my options.  I felt the stirrings of what felt like sympathy for him, but I knew better.  I had spent so much of my life confusing weakness and uncertainty with mercy and consideration.  It was easy to do living a mundane life where the stakes were low and very little mattered.  I was finding now that when things really mattered, the right thing to do was usually the hard thing, but it was also the easiest to see.</p>\n\n<p>&nbsp;</p>\n\n<p>“Sorry, but I’m not done with you yet.”</p>\n\n<p>&nbsp;</p>\n\n<p>After I quickly gagged and bound Prakesh and secured him back down in the vault, I ran to the pick-up truck to check on my grandfather.  He was just as the man had said—slumped over and heavily sedated, but still very much alive.  Reaching under the driver’s seat, I pulled the key free from where it was taped and started up the truck.  To be safe, I drove an hour away to a hospital where I told them that my grandfather had been attacked by some unknown assailant prior to my arriving to meet him for lunch at a local restaurant.  Luckily, I’d had the foresight to drive in the direction of his actual hometown, which the hospital was only forty-five miles from, and I had googled restaurants so I could name a real place.</p>\n\n<p>&nbsp;</p>\n\n<p>The local police were still called, of course, and I gave them an earnest but unhelpful statement.  Both the cops and the doctor had questions about the shaved portion of his scalp and the surgically precise wound to his skull, but they could only listen to so many blank-eyed and shrill assertions by me that “they needed to find whoever the maniac was that did that to my grandpa” before sullenly giving up.  The whole thing looked bizarre, but what could they do about it? Three hours later I was done with questions and knew he was in stable condition, so I left to finish what had to be done.</p>\n\n<p>&nbsp;</p>\n\n<p>By eight o’clock I was in Room 609 waiting, and the evil cultists were punctual if nothing else.  At 9:59, there was a heavy knock on the door.  Looking out the peephole I saw three figures, meaning there was at least one or two more out there somewhere.  I opened the door, staying behind it, figuring they would come on in and be distracted when they saw what was inside.</p>\n\n<p>&nbsp;</p>\n\n<p>It worked well.  As the light from the parking lot security lights spilled across the room, two figures tied to motel chairs were illuminated, their forms and features a patchwork of amber light and shadow as the men entered the room in confusion.  The first figure was Prakesh.  He was clearly dead, his arms broken and held at odd angles and his throat cut almost to the point of decapitation.  The second was Prakesh’s thirty-year old daughter, Gabrielle.  Or as one of the cultists called her,</p>\n\n<p>&nbsp;</p>\n\n<p>“Gabby baby?  What are you doing here?”  The man was rushing forward to kneel at her side, trying to pull the gag off her tear-streaked face.  Her eyes had gone to him immediately when the door opened, but now they were back on me, the shadow behind the door.  She tried to scream a warning through the gag as it was yanked down, but it was too late.  </p>\n\n<p>&nbsp;</p>\n\n<p>I slammed the door shut behind them, driving a knife into the neck of the closest one as the third started turning towards me.  He started fumbling for a gun, but he was slow, and by the time he started to raise it, I had already removed the knife from his friend and slashed it across his eyes, banishing any idea of attack from him forever.  He clutched his face as he began to yell, but it was all short-lived.  Five fast stabs into his torso and he slumped to floor as his life seeped out onto the dirty orange carpet.</p>\n\n<p>&nbsp;</p>\n\n<p>By this point Gabby’s voice was free and she was yelling for “Keith” to kill the “motherfucker”, which apparently was me.  Keith had different ideas, as he had abandoned trying to free her and was running for the bathroom.  Gabby’s opinion of who the “motherfucker” was seemed to shift suddenly, but it didn’t matter.  They were all going to die.</p>\n\n<p>&nbsp;</p>\n\n<p>I was going to pursue Keith, but then the front door crashed open as the remaining members of the cell came barreling in.  I jammed my knife into the smaller one’s thigh, but my hand slipped off the blood-soaked handle even as the larger of the two brought a ham-sized fist down across my face.  I felt something give as my jaw shattered and the world went grey.</p>\n\n<p>&nbsp;</p>\n\n<p>I was only out for a couple of moments, but it was enough time for the pair of them to hit me again and for courageous Keith to come back in and start trying to explain to Gabby baby the merits of a strategic retreat.  I acted as though I was nearly unconscious, taking the hits while trying to propel myself back to the front door.  It had slammed back closed after their entry, and while the latch was broken, it seemed wedged shut pretty tight.  I assumed they noticed it too or they wouldn’t have let me stumble/fall against it in the first place, laughing bitterly about how they were about to “fuck my world” for what I had done to their friends.</p>\n\n<p>&nbsp;</p>\n\n<p>They looked confused as I pushed myself up the door slowly and looked at them, my eyes clear.  My face felt swollen and lopsided, and I could feel my jaw itching.</p>\n\n<p>&nbsp;</p>\n\n<p>“Uf aven’t oticed e sell.”</p>\n\n<p>&nbsp;</p>\n\n<p>Keith looked at the other two, the smaller of which was sitting on the floor now trying to tie a belt around his leg.  “What the fuck is he saying?”</p>\n\n<p>&nbsp;</p>\n\n<p>“I ed, uf aven’t oticed e sell.”  Fuck, my jaw felt like it was on fire.  Not thinking, I grabbed it and shoved, a bolt of pain shooting through my head as it snapped back into place.  “I said, you haven’t noticed the smell.”</p>\n\n<p>&nbsp;</p>\n\n<p>Their eyes were wide, first looking at me and then at Gabby as she started screaming.  “Shit!  Shit!  I remember!  When he brought us in here the room smelled like gas!  Gasoline!”</p>\n\n<p>&nbsp;</p>\n\n<p>I reached into my pocket and brought out the small flare I had brought from Jager Solutions.  “I think I might survive it.  I doubt any of you will.”  Lighting the flare, I tossed it down in the middle of them and watched as everything turned to fire.</p>\n\n<p>&nbsp;</p>\n\n<p>The newly freed Gabby and Keith ran back for the bathroom, but I had already been in there.  The window was too small for a person and I had soaked the walls in there too.  They were already engulfed as they reached the doorway, their flaming bodies dancing together towards an escape they’d never find.</p>\n\n<p>&nbsp;</p>\n\n<p>The other two came towards me, intent on getting out the door.  The small one’s pants were already blazing from him sitting on the floor, and after a feeble dash forward that was ended when I kicked him in the chest, he decided that thrashing around on the floor screaming was the best way to go.  The large one, the last one, put up more of a fight.  He punched me, tried to choke me and shove me out of the way.  Finally, when he saw he was burning he wrapped me in a fiery bear hug as though to take me with him.  I burned with him for a few seconds before his ligaments gave way and he slumped down, a layer of his molten skin sloughing off onto the front of my smoldering shirt.</p>\n\n<p>&nbsp;</p>\n\n<p>I turned and yanked the door open, dropping outside on the concrete walkway to roll away the few places I was starting to catch fire myself.  Then I was up and running around back to where I had parked the car.  On the way to the hospital I stopped and changed into the extra set of clothes I had brought, and by the time I reached my grandfather’s room, the only sign of trouble I still carried with me was a sweet, smoky smell that still clung to my hair.</p>\n\n<p>&nbsp;</p>\n\n<p>I thought he was asleep when I entered the room, but then his eyes were open and staring at me.  He didn’t say anything at first, and as I approached his bed he frowned. </p>\n\n<p>&nbsp;</p>\n\n<p>“Who….who are you?”</p>\n\n<p>&nbsp;</p>\n\n<p>I felt my stomach plummet.  After all of this, his brain had been hurt by the surgery after all.  But it was okay, I would take care of him and hopefully over time…</p>\n\n<p>&nbsp;</p>\n\n<p>I realized my grandfather was laughing and my jaw dropped open.</p>\n\n<p>&nbsp;</p>\n\n<p>“Sorry, I couldn’t resist.”</p>\n\n<p>&nbsp;</p>\n\n<p>“You old bastard.  That’s not funny.”</p>\n\n<p>&nbsp;</p>\n\n<p>He grinned at me.  “It’s kind of funny.”  He stopped and looked at me, his face growing more serious.  “Are you okay?  I know things must have gone wrong somehow for me to wind up here.  What happened to Prakesh?”</p>\n\n<p>&nbsp;</p>\n\n<p>I looked away at the wall.  “He made some bad choices.  But it’s dealt with.  I dealt with all of it and we should be okay.”</p>\n\n<p>&nbsp;</p>\n\n<p>My grandfather frowned again.  “I don’t want you having to deal with all of this.  It’s not fair to you.”</p>\n\n<p>&nbsp;</p>\n\n<p>I looked back to him, shaking my head.  “It’s my choice.  I want to help and I want you to teach me.  We can do more together.”  I paused.  “And neither of us will be alone any more.”  </p>\n\n<p>&nbsp;</p>\n\n<p>He studied me for several seconds before clearing his throat and nodding.  <a href=\"https://redd.it/8lggje\">“I like the sound of that.”</a></p>\n\n<p>&nbsp;</p>\n</div>\n","author":"Verastahl"}