{"rank":"71","title":"Mucus.","id":"8lgsdr","url":"/r/nosleep/comments/8lgsdr/mucus/","time":"1527051971000","body":"<div class=\"md\"><p>The symptoms started two days after I got back from the lake trip I took to Oregon with a couple of friends. Looking back, I know it must have been from when Wesley dunked my head under the water. He had caught me by surprise, and as I went under I swallowed a big gulp that had me nearly puking when I came up, but I held back the vomit. Knowing what I know now, I shouldn’t have stopped it. </p>\n\n<p>My nose started dripping the first hour into the six hour drive home. I felt the trickle of mucus making its way from the bottom of my right nostril towards the top of my lip. I grabbed a napkin that was in the center console, and wiped the mucus away. Only, it got worse as we drove. I tried to fight back the constant drip by tilting my head back against the headrest and sniffling nearly every ten seconds, but it was useless. I made Wesley pull over at a gas station and wait while I ran in to grab a box of tissues.</p>\n\n<p>By the time I made it home to be dropped off, I had just about cleaned out the entire box of Kleenex. My nose felt not so much as a drip, but more so as if someone had turned the faucet on. Both sides of my nostrils were leaking a steady stream of clear mucus that seemed to stick to my skin as I wiped it away. I was relieved to be home so I could take some cold medicine, but not as relieved as Wesley was to get me out of his car.</p>\n\n<p>I rolled up a couple balls of tissue and plugged them into my nostrils as I unpacked, hoping to stifle the constant flow. My jaw hung open as I was forced to breathe through my mouth. As I inhaled, I could feel the congestion building deep in my chest and throat. I tried to cough it up, but after a few forceful attempts my throat began to burn so I stopped. Once I had finished unpacking, I took some Nyquil, put a fresh box of Kleenex on the night stand, and went to sleep. Or tried, at least. </p>\n\n<p>The night was restless and I couldn’t relax. The constant sniffling and wiping away at my dripping nose had me frustrated as I struggled to find a comfortable position. The little sleep I did get, I had propped myself up against the wall at the top of my bed, almost as If I was seated a chair. The floor next to me had become covered in used tissues. In my restless state I had begun to just wipe away the mucus and throw the tissues to the floor, not to be bothered enough to get up and throw them away.</p>\n\n<p>When I woke up, I couldn’t breathe through my nose and I couldn’t see. Not because I had gone blind, but because my eye lids were sealed shut. Pink eye was the first thought that crossed my mind. With my jaw hung open, I navigated my way to the towel cabinet, grabbed one, and made my way into the bathroom. I ran the towel under warm water and then pressed it to each of my eyes. It took me about five minutes to finally get my eyes to open. Being able to see again, I looked at myself in the bathroom mirror.</p>\n\n<p>Running along the drip path from my nose to upper lip, expectedly, was a film of mucus. It was almost white in color and seemed to have hardened in the night. I looked at it closely in the mirror, my heavy mouth breathing fogged up parts of the glass. With my index finger I poked at the filmy mucus. I expected the mucus to be dried and crusty, but instead, my finger seemed to almost stick to my face. I pulled my finger away, and lines of mucus stretched from the tip of my finger to the skin of my upper lip. <em>How weird</em>. I used the washcloth and warm water to wipe away the mucus.</p>\n\n<p>I should have gone to a doctor right then, I admit, but I’m stubborn. I took some Dayquil and thought with a little rest and an easy day, the cold symptoms would subside. I was wrong</p>\n\n<p>By noon, congestion in my chest and throat had built to the point where I could feel the pressure from inside pushing against my sternum. With each deep breathe, mucus bubbled and popped in my throat. I tried to drink orange juice and water to hydrate, but swallowing had become increasingly difficult and my throat felt as if it was being sealed shut. The worse though, was my eyes. </p>\n\n<p>Just like my nose, the clear mucus began to pour from out of my tear ducts. Streams of the sticky fluid ran from the corner of my eyes, down my cheeks, and would hang from the bottom of my chin if I couldn’t wipe it away fast enough. </p>\n\n<p>I felt as if mucus had taken over my body and was consuming ne from the inside out. I could hardly breathe, my nose and eyes were leaking a steady stream. I decided it was time to go to the doctor, when a sharp pain of nausea panged in my stomach. </p>\n\n<p>With my knees against linoleum tile and hands gripping porcelain, I stared into the bowl of toilet water. Sticky mucus from my nose and eyes reached out until it made contact with the water, and hung there suspended as I failed to wipe it away. I was too focused on the knot in my stomach.</p>\n\n<p>At first nothing came up. The mucus blocking my throat kept whatever was in the pit of my stomach down. But with what had to be ten or more forceful heaves, clumps of mucus began shooting from my throat, into the toilet bowl, sending splashes of water against my face. The knot that was in my stomach began to slowly make its way up my esophagus. With each heave, along with a spray of mucus out of my mouth, the knot (now feeling more like a lump) made its way up until I felt it at the back of my throat. With one last hurl I pushed from my lungs as hard as I could, sending what I expected to be a large ball of mucus into the toilet bowl. </p>\n\n<p>The feeling was almost euphoric as my throat and airway finally opened. I wiped away the lines of mucus that streamed from the toilet water to my face. With my eyes cleared and being able to breathe properly, I looked into the porcelain bowl and saw what had been inside my body. I almost threw up one more time in disgust.</p>\n\n<p>Against the white porcelain, surrounded by the film and clumps of mucus, was an eel like creature which squirmed around in the water. Its long slender body was tied in a knot, and it had begun to contort itself in the bowl to become untied. I stared at it as it writhed around in the bowl of mucus for more than a minute, until it had undone itself and returned to its elongated form. It had to be about six inches in length and an inch in diameter. It was slightly brown in color and looked featureless except for two ends which came to a point. </p>\n\n<p>I stared at it in disbelief that this thing had been in my body. I grabbed my cell phone, took a picture of it, and sent it to Wesley. He replied a few minutes later: </p>\n\n<p>“Dude. Gross. What the fuck is that? BTW I think I caught the cold you had, my nose has been running nonstop for the last hour.”</p>\n\n<p>He’s going to freak out when I tell him.</p>\n</div>\n","author":"whothefuckisG"}