{"rank":"68","title":"I woke up in a different version of reality, and I don't know how to go back (update)","id":"8lgv17","url":"/r/nosleep/comments/8lgv17/i_woke_up_in_a_different_version_of_reality_and_i/","time":"1527052814000","body":"<div class=\"md\"><p><a href=\"https://redd.it/8l7od5\">Original Post</a></p>\n\n<p>The knocking wouldn’t stop. I waited hours. I haven’t slept, and pulsating pain trickles from my head to my right shoulder.   </p>\n\n<p>I had to answer the door. I dreaded it, but I needed to. Whoever the fuck Ali was – she wasn’t going to stop until I answered, and I wasn&#39;t about to sit around and wait. </p>\n\n<p>I unlocked the door, took a deep breath, and swung it open.</p>\n\n<p>A tall white woman stood in front of me, surrounded by darkness. She stood with her hands in front of her, as though in anticipation of something. Her thick blonde hair looked almost unnaturally smooth, and it reached all the way to the tip of her elbows. She looked straight at me, with the slightest smile, as though nothing was out of the ordinary. She shot me a look, her facial expression unchanging. </p>\n\n<p>“Where have you been babe? We’ve all been worried about you.” The calmness of her voice sent shivers down my spine. She spoke to me as though we had known each other for years, as though the darkness was an ordinary occurrence. Or as though she didn’t notice it as it swallowed the area around her.</p>\n\n<p>“I… who are you?” I managed to spit out. </p>\n\n<p>Her eyes continued to lock with mine. Her smile unwavering. It was as though she had been expecting the question.</p>\n\n<p>“Don’t be silly, babe. It’s Ali. Quit screwing around, we need to get going if we want to be on time to meet my parents.” She extended her hand to try to reach mine, but I moved backwards. </p>\n\n<p>“<strong>Fuck that.</strong> I want some answers. <strong>Now.</strong>” The pounding in my head got worse, but I tried to brush it aside. I wanted to know what was going on. </p>\n\n<p>Her smile grew sour. It didn’t disappear – it was still there. But it looked as though someone had taken the corners of her lips and contorted them upwards. She tilted her head to an angle, as though she was a dog perking her ears to listen more closely. </p>\n\n<p>“Don’t be silly. It’s time to go outside. You went out a little early, but I’m not mad at you. Let’s go.”</p>\n\n<p>She stepped forward as she spoke. I took a step backwards.</p>\n\n<p>“I need you to go outside if you want to make it on time. I want you to make a good first impression on my parents. Go outside.”</p>\n\n<p>Another step forward. Another step back. She was entering my house. </p>\n\n<p><em>Buzz</em></p>\n\n<p>“Let’s go. Now.” </p>\n\n<p>Her voice grew deeper, and darker. The words spat out like they were venomous. Her eyes rolled back, turning her stare into one of only white. Her smile grew greater, contorted as though her muscles had no limit. Her smile now unnaturally began from the top of each of her cheekbones, her lips thinning as the smile widened. She opened her mouth briefly as though to speak, but no words came out. She had no teeth, and her gums appeared as black as her surroundings. </p>\n\n<p>One step forward. </p>\n\n<p><em>Buzz</em></p>\n\n<p><strong>SLAM</strong></p>\n\n<p>I didn’t look back. I slammed the door and locked it. The knocking began again, my phone continued to buzz, and my head was pounding. I leaned against the door and dropped. My head was killing me. </p>\n\n<p>Who the fuck was Ali? </p>\n\n<p><em>What the fuck</em> was Ali? </p>\n\n<p>I checked my phone. The buzzing continued. Three hundred texts.</p>\n\n<p>“Go outside.” </p>\n\n<p>“Go outside.” </p>\n\n<p>The incoming texts grew more aggressive.</p>\n\n<p>GOOUTSIDEGOOUTSIDEGOOUTSIDE</p>\n\n<p>I threw my phone across the room. I heard a crack, followed by continued buzzing. I abandoned my phone and ran back to my room, shut the door, and locked it. I opened my laptop. I needed answers.</p>\n\n<p>I opened Chrome and typed in “YourTube.com” in the search browser. I figured the biggest hub of videos on the internet would have some explanations. But I wasn’t greeted with the familiar green and black logo – instead, Chrome directed me to some adware site, telling me how to get women to obsess over me. I decided to Yahoo “YourTube” and found that the name had apparently been changed to “YouTube.” Great. A bit of a stupid name, but at this point I was willing to accept anything. </p>\n\n<p>The knocking grew louder, more frequently. The rhythm had been broken. My headache was nearing the point that it had become blinding. I could tell that I was running out of time. I got on YouTube and looked up “pocket dimensions” (as per the recommendation of one of the commenters on my previous post). </p>\n\n<p>I clicked the first video and watched the two-minute video. It was really hard to concentrate – this headache was intensifying. The outside of my vision grew white, blurry, and somewhat faded. </p>\n\n<p>A pocket dimension seems to be a dimension of the universe that exists outside of the one we experience. It is not completely dissimilar, but it is somewhat unique to my own universe.</p>\n\n<p>In the related videos, something caught my eye. An all-caps title, the words all strung together. It read:</p>\n\n<p>“YOUDONTBELONGHERE”</p>\n\n<p>I quickly pressed “back” on the Chrome webpage. To my horror, every video was now titled, “YOUDONTBELONGHERE.” I slammed my laptop shut and sunk to the floor. That’s when I noticed it.</p>\n\n<p>The knocking had stopped. </p>\n\n<p>It had been intensifying for the past half-hour or so, but it suddenly stopped.</p>\n\n<p>My house was completely silent. The silence was somehow worse than the knocking. But the silence was impermanent too.</p>\n\n<p>“What are you doing on the floor?” Ali asked, one towel wrapped around her slim body and another drying her blonde hair as she left my shower. Her eyes appeared normal now, but her smile still unnerved me.</p>\n\n<p>“How the fuck did you get in here?” I sputtered out, drowning in confusion and paralyzed by terror.</p>\n\n<p>“My key?” she said. “Quit fucking around and get ready. My parents are waiting for you. We gotta be outside in 10 minutes.” Her smile never broke. Her blue eyes penetrated mine, and I could sense </p>\n\n<p>I just stared at her. What else was I going to do? </p>\n\n<p>I ran past her. </p>\n\n<p>I ran out the room. </p>\n\n<p>I ran out the front door. </p>\n\n<p>I ran past the first few steps that were visible. </p>\n\n<p>I closed my eyes,</p>\n\n<p>and without hesitation, </p>\n\n<p>I ran into the darkness.</p>\n\n<hr/>\n\n<p>I opened my eyes, and saw nothing. I did not see darkness. I did not see shapes, outlines of objects, nor the faintest glow of light.</p>\n\n<p>I did not feel a breeze. </p>\n\n<p>I did not feel… anything.</p>\n\n<p>I did not hear. </p>\n\n<p>I did not experience anything.</p>\n\n<p>I experienced nothing.</p>\n\n<p>Total silence. A total blindness. Nothing existed. </p>\n\n<p>I do not know how long I experienced nothingness. An eternity and a moment were equivalent. Neither made sense, yet both were the subjects of my experience.</p>\n\n<p>As I walked forever, it was only a moment. As I thought forever, each thought faded into obscurity to be overtaken by the next thought. </p>\n\n<p>And then, I was in my bed. I jolted upwards. The lights were off, and Ali was sleeping next to me with her back towards me.</p>\n\n<p>I lived an eternity of nothingness and it was equivalent to an instant. </p>\n\n<p>I don’t know how much longer I can stay here. I don’t know how to escape. I got out of bed and walked to my kitchen. I looked out the window. And I saw a neighborhood. I saw the night sky, pollinated with the stars and illuminated by moonlight. </p>\n\n<p>I still have not slept. It is morning now. </p>\n\n<p>Ali got up, her smile stretching her face, her eyes piercing mine. She approached me and kissed my forehead through her thin lips, tooth-less gums smudging against my forehead. </p>\n\n<p>The memories of my reality have faded because I experienced them an eternity ago. I do not know what belongs to my reality anymore.   </p>\n\n<p>I want to go back to my reality. But something tells me home is no longer recognizable to me. </p>\n\n<p>“Babe, get ready. We&#39;re gonna go meet my parents.”  </p>\n\n<p>It&#39;s time for me to go outside. </p>\n</div>\n","author":"CGRampage"}