{"rank":"2","title":"They deserved it","id":"8lh079","url":"/r/nosleep/comments/8lh079/they_deserved_it/","time":"1527054541000","body":"<div class=\"md\"><p>I was stalking through the woods making no sound thanks to my soft sole boots molding around every would be  unfortunate sound of a stick breaking. I was just walking enjoying the woods and the peacefulness of being outside. </p>\n\n<p>It was almost dark. It was 50 degrees outside so, I had on my sleek black jacket and my SA skull face shield on. I had the face shield pulled up on my nose where only my eyes, half of my cheeks, forehead and hair were visible. My black gloves were keeping my hands warm and flexible. </p>\n\n<p>I continued to stalk through the woods until I heard whispers.\nI ducked down into some foil, quickly concealing myself from view. </p>\n\n<p>The whispering was getting closer. It was coming from 3 guys. They were discussing where to go. There was 3 guys and 3 girls. They were most likely the ages 17-19 at the oldest. They were obviously from the city judging by there over filled packs. </p>\n\n<p>The guys averaged 6’0 and probably 200 pounds. Despite being city slickers they all looked to be in good shape. The girls averaged 5’10 and my best guess 130 pounds. </p>\n\n<p>It was obvious they worked out. So I wanted to know why they were whispering. You don’t go into the woods to be quiet unless your hunting. So maybe they had something to hide. I didn’t have anything better to do so why not follow them?</p>\n\n<p>After they were about fifty yards away I got up and stayed in the thicker side of the forest to not be seen. They seemed to be walking with purpose. They were making calculated turns but I’ve never have saw them out here before so, how would they know the woods this good unless they had coordinates leading them. I didn’t have a very good view of them from fifty yards away so, I closed into 20 yards and could see that one of the guys had a phone most presumably the source of direction.</p>\n\n<p>As I was following them I noticed they were pretty quiet and also about 4 hours from any civilization. They stopped and began taking a break. As so, I walked about 30 yards away so that I would not be spotted. They started talking about the disappearances of people. They were laughing about it so, I figured that they may know something because why be out this far into the forest and start discussing stuff like that? I had a uneasy feeling of where they were going.</p>\n\n<p>They started discussing what the others were doing at the cabin. Now I knew why they were here. They were talking about nonsense so I tuned them out and waited till they got up and started walking. </p>\n\n<p>I was excited that they were the ones going to the cabin I couldn’t hardly wait to greet them. I separated from them and quickened my pace where I would get to the cabin before they would. It was a nice four bedroom four bath, upstairs cabin. Two rooms on bottom and two rooms on top. I got there way before they would and got into my tree to wait.</p>\n\n<p>They got there by dark and entered. They searched the room for there friends but didn’t find them. One of the girls said that they probably left because they don’t like to have fun anyways, more fun for us. Yes indeed there would be some fun. They unpacked and got settled. One guy and one girl in each of the rooms except for a fourth room. They separated so they had to be in relationships with each other.</p>\n\n<p>I entered the upstairs bedroom that wasn’t occupied. I slide my six inch blade out and got ready.  I entered the bathroom and got what I needed. I made short work of the guy and the girl. I put the chloroform on the guy first when he was definitely out I zip tied him behind the back wrist to elbow and biceps. The woman I did the same.</p>\n\n<p>The second set on the bottom floor were different. I didn’t like how they looked. So I did the chloroform on both and zip tied them. I also gagged them and began cutting on both there faces. The last set I chloroformed and zip tied.</p>\n\n<p>I drug them all outside under the bright light of the LED lamp. I had my face shield on and a black hat on to make me look ominous. One set woke and started shouting at the others to wake up. The others stirred and woke. They started hyperventilating when they saw set twos faces. Of course set two couldn’t feel the pain of the cuts but, the cuts were obvious.</p>\n\n<p>They wanted to know who did this so, of course I had to step out and greet them. What a pleasant site to see the surprise on the people’s faces when they see someone who is smaller than them have them at the knifes blade. I’m only 5’7 and 160 pounds so I was pretty satisfied with the look on there faces.</p>\n\n<p>Of course they wanted to know why I was doing this, my reply was simple “you know why”. They tried to play dumb but I knew what they did. So I decided to refresh there memory with there other friends. The first set of friends went up to the cabin with several dogs. But at last I was following them and found out they were going to torture the dogs but I couldn’t let that happen so, later that night before they could cut up a beautiful German shepherd I went behind the man and knocked him out with my baton then for the woman I grabbed the hand that had the knife and sliced off her pinky, finger next to pinky, and middle she started to scream until I scooped up her fingers and shoved them into her mouth where as she passed out. Then I put them on the table where they tried to plead me not to do this. </p>\n\n<p>My answer was “you were going to do worse to ten dogs, TEN innocent lives were going to be tortured and tossed like garbage so, you earned your punishment.”</p>\n\n<p>I won’t go into details but y’all will understand you just don’t attempt to do anything like that to any kind of animal. So back to the three sets they were looking at me like I lost my mind. So, to start with the mental torture I politely informed them that the steaks they ate about two hours ago wasn’t dog it was there friends and they all paled at that and started dry heaving and I politely informed them that they had already digested it so it wouldn’t come up no matter how hard they dry heaved. </p>\n\n<p>So I proceeded to start laughing at them. Then one girl had the nerve to ask why them. So, I proceeded to inform her of what they were planning to do with the dogs and what they have done to defenseless people and she said none of them had done such a thing well then I took out her journal and read what was planned she then quit talking. I informed her I didn’t like liars so, I went over to here and cut her hamstrings. Now I had all of there attention. I pulled her by her hair to the center of attention while she was shouting and screaming and I proceeded to inform her we all were six hours from civilization so, no one would hear her anyways.</p>\n\n<p>Once she was in the middle I whistled a call and she paled she thought she knew what was going to happen but when no 10 dogs came running she started to breath easy until  Buddy appeared. Buddy is a wolf mixed with husky so, he is a huge dog standing at three feet tall and a hundred and forty pounds, he was a beast. They all started to pale as they realized what Buddy was going to do. </p>\n\n<p>Buddy came to my side and I told him to attack and attack he did it lasted an hour and thirty minutes till I told him to finish. All the others were dumbfounded. “Now look y’all, y’all brought this on yourself you just can go around doing stuff like that and especially in these woods. Y’all thought y’all were expert killers but as you should have figured out your not y’all just a bunch of city slickers who go for the weak. If your real you’ll go for another killer an experienced one but, I couldn’t do that especially when I found out what was to be done with the dogs, that’s a huge NO, dogs are no kill. But y’all didn’t find that out till late didn’t you.”</p>\n\n<p>“So I’m done talking.”\nI moved toward a guy but, at last he “broke” free of the zip tie and he ran like a bitch. So, I looked over and said “y’all don’t leave I’ll be back and Buddy will keep you company just so, you know.” \nI jogged after him, for someone who was a lot bigger than I he sure did take off fast. He was too clumsy, running leaving a easy trial. I followed with ease as I don’t do speed I do endurance and patience you’ll mess up if you go to fast especially with a cliche broke ankle. But at last his ankles held up but, his wind did not he doubled over too winded to look around. I moved around a tree that was a couple yards away. I waited till he straightened and I threw a rock in front of him in some bushes and he was breathing so loud I was sure everyone probably could hear him. He backed right into the tree I was at and I came around and sliced his stomach open and stood beside him. “You should’ve fought, you probably would’ve had a better chance”. </p>\n\n<p>I returned to the others and was delighted to see they had gone no where. “I’m happy to announce that you friend has been took care of”. \nI went into the house and received the 9mm and asked them if they thought I was a good shot. No answer so I just chose the man with the carved face and let the bullets fly. He’ll bleed out. The woman with the carved face met a knife to the lung. She’ll die of her lung collapsing. Then there was one guy and one girl. </p>\n\n<p>I let the 10 dogs take care of them. Real sweet dogs to do that and yes besides the dog’s trauma they all were sent to some clients where they are receiving training and unconditional love.</p>\n</div>\n","author":"whit_450"}