{"rank":"0","title":"Reaching Out to Help","id":"8lh4ds","url":"/r/nosleep/comments/8lh4ds/reaching_out_to_help/","time":"1527055995000","body":"<div class=\"md\"><p>I walked up to his mailbox, and took one last read through my note, nervously reading and rereading the paper, as if the words on the page shuffled around into a two-dimensional amorphous blob.</p>\n\n<blockquote>\n<p>Hey, Kev. You&#39;re a nice guy.</p>\n\n<p>And, no, not those self-proclaimed “oh, please sex me up or else you&#39;re a slut” type of nice guy. I mean, yeah, you did crush on me and we did date once or twice, but even after we decided to stay friends, you ACTUALLY stayed my friend. When we were at Erie a year later, you sat around the campfire with me after Debra dumped her apple juice on my head due to her stupid pranks, all to make sure that I was okay. I wasn&#39;t, and it was awkward and you didn&#39;t really know what to do, but I can see your intentions. You did bring me Tom&#39;s towel, even though he chewed you out about the whole thing because he thought you&#39;re just taking a last minute swim. But, just look at Tom, Debra, Ahmed, Leo, even Arielle, my own girlfriend. None of them were there. But you? You actually being there when no one else was, that was sweet of you, and that was more than enough for little ol&#39; me. I know it bugged you, and you felt like you had to, but that&#39;s definitely more than what the others did. Those days were kind of a mess, but anything to make it less shitty, I suppose.</p>\n\n<p>And don&#39;t think for a second that this isolated incident was just the one time you were nice. You freaking try, dude! Remember how you were banging your head on the wall because you bought like... three burgers too many from BK? I couldn&#39;t stop laughing because you used to have the biggest appetite! It was hilarious! You could have saved your food for later, but you specifically took a detour through downtown just in the hopes to find someone who was homeless. And you phrased your decision as “I gotta go to the pharmacy for some bandaids for this cut I have on my leg. It hurts so bad, yadayadayada.” Oh, give me a break. There was a pharmacy on the straight path to your place. And you didn&#39;t even want to show me that alleged cut. I don&#39;t know everything about you, but as your friend and as an awesome person in my totally unbiased personal opinion, I do know when you&#39;re feeding me some grade A bullshit. I didn&#39;t say anything because I knew you would have been embarrassed out of your mind. I don&#39;t know why, but your kindness isn&#39;t something to be embarrassed about. It really isn&#39;t.</p>\n\n<p>I already hear it now. “I&#39;m not kind, it was just a random happenstance.” No, Kevin. I want you to just stop making that justification to yourself. No matter how many times you repeat it to yourself, you need to understand that you are truly a wonderful human being. It hurts me so much to even listen to you when you act like that. Every time I throw a nice compliment like “Hey, you look great today, or at least better than me!” or “Bro, you got a 98 in calc? Nice job, that test was hard!” you just laugh it off and say “oh, I don&#39;t look that good” or “I&#39;m not that smart, I could have gotten 100”. Honestly, I didn&#39;t get it for the longest time. I wrote off your whole self-deprecation schtick as just a thing that you do, and hey, sometimes I got a laugh from it, but lately, it feels like it passed the point of no return, and all that comes out of your mouth now are jabs at yourself. I mean, it has been this way for the longest time, but it got so much worse. Not gonna lie, I started thinking about it, and it was stressing me out. I&#39;m sorry, but I needed to figure out what was going on with you.</p>\n\n<p>Recently, I&#39;ve spoken with Tom about it, your situation. He was really hesitant to open up about what was on your mind. He called it some personal stuff, that I would judge you for it. I told him straight up that whatever you had on your plate, I&#39;d understand. But if I&#39;m being honest, I don&#39;t. I don&#39;t understand it at all. He said you were depressed? How? How in the fucking world could someone like you be depressed? You&#39;re kind, and sweet, and caring. You&#39;re smart, you&#39;re amazing at archery, and seeing you passionate about why MLP is obviously the worst show you have ever seen is downright hilarious. And... you were so happy at one point. And putting it together with depression? It doesn&#39;t make any sense. I don&#39;t know what the hell happened to you to be like this.</p>\n\n<p>Tom didn&#39;t go into full detail, if that&#39;s what&#39;s worrying you. I couldn&#39;t blame him. It must have been on his mind as well, but then again, I&#39;m not super close to him, but you are. I don&#39;t really have permission to pry more, and frankly, I don&#39;t know if I can. This entire situation has left me really confused as to what I can do. I want to understand it, and I want to help you, but I do need to ask it: what CAN I do? Because I don&#39;t know how. God, I&#39;m repeating myself. I don&#39;t even know how to talk to you about it. All I can do is write.</p>\n\n<p>You know, I remember when I asked you about the time you dropped off Lucas and Mary, even though I knew for a fact you absolutely hated children, let alone those mischief makers. You told me &quot;Those kids walking at home, by themselves, in the middle of the night? No way! Not if I can help it!&quot; That&#39;s kinda how I feel now. I want to help you, in any way I can. Except, you know, the whole hating you part. I pretty much hate nothing about you, and you shouldn&#39;t either.</p>\n\n<p>I&#39;m just super worried about you, Kevin. It worries me to no end, ever since I learned about what you&#39;re going through, doubly so since I can&#39;t understand it. After my mom... I don&#39;t want it to happen. Not again. Even though I don&#39;t understand it, I want to help. Even without that understanding, it doesn&#39;t mean I can&#39;t help. I want to support you, no matter what.</p>\n\n<p>Kevin, if you take anything away from this conversation, please, please, PLEASE just do me this one favor.</p>\n\n<p>You&#39;re a nice guy. Please be nice to you.</p>\n\n<p>-Melly B.</p>\n</blockquote>\n\n<p>That&#39;s all I wrote. I gotta hope he understands. I sighed and went back home to sleep.</p>\n\n<hr/>\n\n<p>There&#39;s a knock on the door. After one or three knocks, I groaned, rushing to the door, only to dash back to slip into my jimmies. Last night had been pretty rough, ever since the dorm AC broke.</p>\n\n<p>After tripping over a couple of empty soda cans, I finally reached the door. Peeping through the peephole, I see two guys, both wearing a red bandana, crossing their arms and standing back to back. I straightened my back and scrunched up my face to be halfway presentable.</p>\n\n<p>&quot;Hiya guys! To what do I owe the pleasure of meeting these two new-aged gansters?&quot; I greeted. Kevin sighed, and couldn&#39;t hide a cheeky grin.</p>\n\n<p>&quot;We&#39;re gonna be passin&#39; by Costco today! Gotta get the noods&#39; ready for cramming.&quot; Tom said. I rolled my eyes, only briefly seeing Kevin smack Tom&#39;s arm. Tom chortled lightheartedly.</p>\n\n<p>&quot;I... don&#39;t feel like tagging along today. But hey, you guys go have fun, alright?&quot; Tom shrugged, and headed back to his car. Kevin squirmed around a little bit, before speaking up.</p>\n\n<p>&quot;Umm... Melly?&quot; He started, but trailed off. Watching his sullen eyes dart around, it seemed that Kevin&#39;s lost his train of thought.</p>\n\n<p>&quot;Yes?&quot; I tried to inch out what he wanted to say.</p>\n\n<p>&quot;I just wanted to say thank you for... the letter two days ago. You freaking tried, and even though what you wrote wasn&#39;t exactly what I wanted or needed to hear, you did help it, more than you know.&quot; He smiled at me, but I turned away.</p>\n\n<p>&quot;Oh, it&#39;s nothing really, I just... You know.&quot; Receiving these types of compliments was a little... weird, especially from him out of all people! Though... it was a little back-handed... &quot;But Kevin, are you doing any better from the dep-&quot;</p>\n\n<p>Before I could finish what I was saying, Kevin&#39;s finger was on my mouth, and he was shaking his head.</p>\n\n<p>&quot;I don&#39;t like that word.&quot;</p>\n\n<p>A horn from behind blared out. &quot;Oi, Kev! Hurry up already!&quot;</p>\n\n<p>We both chuckled, in spite of the intense atmosphere that had just arisen. Kevin reached into his pocket and handed me a letter. Walking away, he left me with five words.</p>\n\n<p>&quot;I prefer the term &#39;it&#39;.&quot;</p>\n\n<p>Closing the door, and pushing aside the various shoes near the door, I leaned against the wall, slowly sliding downwards, and opened the letter.</p>\n\n<p>It&#39;s... my letter. He wrote down a couple of things, but this is definitely...</p>\n\n<p>my...</p>\n\n<blockquote>\n<p>Hey, Kev. You&#39;re a nice guy.</p>\n\n<p>And, no, not those self-proclaimed “oh, please sex me up or else you&#39;re a slut” type of nice guy. I mean, yeah, you did crush on me and we did date once or twice, but even after we decided to stay friends, you ACTUALLY stayed my friend. When we were at Erie a year later, you sat around the campfire with me after Debra dumped her apple juice on my head due to her stupid pranks, all to make sure that I was okay. I wasn&#39;t, and <strong>it</strong> was awkward and you didn&#39;t really know what to do, but I can see your intentions. You did bring me Tom&#39;s towel, even though he chewed you out about the whole thing because he thought you&#39;re just taking a last minute swim. But, just look at Tom, Debra, Ahmed, Leo, even Arielle, my own girlfriend. None of them were there. But you? You actually being there when no one else was, that was sweet of you, and that was more than enough for little ol&#39; me. I know <strong>it</strong> bugged you, and you felt like you had to, but that&#39;s definitely more than what the others did. Those days were kind of a mess, but anything to make <strong>it</strong> less shitty, I suppose.</p>\n\n<p>And don&#39;t think for a second that this isolated incident was just the one time you were nice. You freaking try, dude! Remember how you were banging your head on the wall because you bought like... three burgers too many from BK? I couldn&#39;t stop laughing because you used to have the biggest appetite! <strong>It</strong> was hilarious! You could have saved your food for later, but you specifically took a detour through downtown just in the hopes to find someone who was homeless. And you phrased your decision as “I gotta go to the pharmacy for some bandaids for this cut I have on my leg. <strong>It</strong> hurts so bad, yadayadayada.” Oh, give me a break. There was a pharmacy on the straight path to your place. And you didn&#39;t even want to show me that alleged cut. I don&#39;t know everything about you, but as your friend and as an awesome person in my totally unbiased personal opinion, I do know when you&#39;re feeding me some grade A bullshit. I didn&#39;t say anything because I knew you would have been embarrassed out of your mind. I don&#39;t know why, but your kindness isn&#39;t something to be embarrassed about. <strong>It</strong> really isn&#39;t.</p>\n\n<p>I already hear <strong>it</strong> now. “I&#39;m not kind, <strong>it</strong> was just a random happenstance.” No, Kevin. I want you to just stop making that justification to yourself. No matter how many times you repeat <strong>it</strong> to yourself, you need to understand that you are truly a wonderful human being. <strong>It</strong> hurts me so much to even listen to you when you act like that. Every time I throw a nice compliment like “Hey, you look great today, or at least better than me!” or “Bro, you got a 98 in calc? Nice job, that test was hard!” you just laugh <strong>it</strong> off and say “oh, I don&#39;t look that good” or “I&#39;m not that smart, I could have gotten 100”. Honestly, I didn&#39;t get <strong>it</strong> for the longest time. I wrote off your whole self-deprecation schtick as just a thing that you do, and hey, sometimes I got a laugh from <strong>it</strong>, but lately, <strong>it</strong> feels like <strong>it</strong> passed the point of no return, and all that comes out of your mouth now are jabs at yourself. I mean, <strong>it</strong> has been this way for the longest time, but <strong>it</strong> got so much worse. Not gonna lie, I started thinking about <strong>it</strong>, and <strong>it</strong> was stressing me out. I&#39;m sorry, but I needed to figure out what was going on with you.</p>\n\n<p>Recently, I&#39;ve spoken with Tom about <strong>it</strong>, your situation. He was really hesitant to open up about what was on your mind. He called <strong>it</strong> some personal stuff, that I would judge you for <strong>it</strong>. I told him straight up that whatever you had on your plate, I&#39;d understand. But if I&#39;m being honest, I don&#39;t. I don&#39;t understand <strong>it</strong> at all. He said you were <del>depressed</del>? How? How in the fucking world could someone like you be <del>depressed</del>? You&#39;re kind, and sweet, and caring. You&#39;re smart, you&#39;re amazing at archery, and seeing you passionate about why MLP is obviously the worst show you have ever seen is downright hilarious. And... you were so happy at one point. And putting <strong>it</strong> together with <del>depression</del>? <strong>It</strong> doesn&#39;t make any sense. I don&#39;t know what the hell happened to you to be like this.</p>\n\n<p>Tom didn&#39;t go into full detail, if that&#39;s what&#39;s worrying you. I couldn&#39;t blame him. <strong>It</strong> must have been on his mind as well, but then again, I&#39;m not super close to him, but you are. I don&#39;t really have permission to pry more, and frankly, I don&#39;t know if I can. This entire situation has left me really confused as to what I can do. I want to understand <strong>it</strong>, and I want to help you, but I do need to ask <strong>it</strong>: what CAN I do? Because I don&#39;t know how. God, I&#39;m repeating myself. I don&#39;t even know how to talk to you about <strong>it</strong>. All I can do is write.</p>\n\n<p>You know, I remember when I asked you about the time you dropped off Lucas and Mary, even though I knew for a fact you absolutely hated children, let alone those mischief makers. You told me &quot;Those kids walking at home, by themselves, in the middle of the night? No way! Not if I can help <strong>it</strong>!&quot; That&#39;s kinda how I feel now. I want to help you, in any way I can. Except, you know, the whole hating you part. I pretty much hate nothing about you, and you shouldn&#39;t either.</p>\n\n<p>I&#39;m just super worried about you, Kevin. <strong>It</strong> worries me to no end, ever since I learned about what you&#39;re going through, doubly so since I can&#39;t understand <strong>it</strong>. After my mom... I don&#39;t want <strong>it</strong> to happen. Not again. Even though I don&#39;t understand <strong>it</strong>, I want to help. Even without that understanding, <strong>it</strong> doesn&#39;t mean I can&#39;t help. I want to support you, no matter what.</p>\n\n<p>Kevin, if you take anything away from this conversation, please, please, PLEASE just do me this one favor.</p>\n\n<p>You&#39;re a nice guy. Please be nice to you.</p>\n\n<p>-Melly B.</p>\n</blockquote>\n\n<hr/>\n\n<blockquote>\n<p>Melly. I want to tell you something that I&#39;m sure wouldn&#39;t be a surprise. A lot of my joy and happiness comes from helping others. That&#39;s something I know for a fact. &quot;<strong>It</strong>&quot; isn&#39;t healthy, and I have a really hard time coping. So I just help. That too, isn&#39;t healthy. That&#39;s why I ended up seeking some professional help, in this awful time of my life. The help really worked wonders against &quot;<strong>it</strong>&quot;. I have some really good insight about the condition now, and of many other parts of my life I never even considered. But in spite of &quot;the meetings&quot;, and in spite of &quot;<strong>it</strong>&quot;, I still have the drive to help others in any way that I can. Just like you.</p>\n\n<p>Even now. So please, let me help. I can help you, even if only by sharing my story with you.</p>\n\n<p>I can help you with &quot;<strong>it</strong>&quot;.</p>\n</blockquote>\n</div>\n","author":"TipsSlight"}