{"rank":"1010","title":"Daddy's Girl","id":"8lh7o2","url":"/r/nosleep/comments/8lh7o2/daddys_girl/","time":"1527057133000","body":"<div class=\"md\"><p>I’ve been blessed with a happy childhood. I know this, and I’m not ungrateful. I know others have endured suffering I myself cannot imagine. Hunger. Pain. Grief. Others have worked far harder for far less, and found contentment. I know this. I know all of it. I’m not ungrateful.</p>\n\n<p>I’ve been, always, my father’s daughter. Daddy’s little girl. Of my mother I remember little—only an impression of warmth and a dash of perfume. When I was too young to understand, she ran away with her accountant and moved across the country to start a new life, one without my father and me. At first she sent me cards—birthday, Christmas, even a get well card when I had my tonsils out—but gradually they became fewer and farther between, until by the time I was in middle school they’d stopped completely. By then, I didn’t mind. My mother was more a figment, a fever dream. My father was everything to me.</p>\n\n<p>My father is a hard-working man. He works with his hands, building houses. He built this house, my childhood home. When I was younger, he was gone often, out working. We didn’t have much money, though I didn’t recognize it as poverty until later: buying other people’s clothes at garage sales, their smell still woven into the fabric; shopping with a grocery list limited to the items covered by EBT; getting school supplies as birthday presents.</p>\n\n<p>I was happy enough, as children are in their ignorant bliss. I didn’t know yet what I was missing. But my father wanted more for me. He wanted to give me everything. So he studied in night classes to earn his contractor’s license, and he took out a loan against the house he’d built with his own two hands, and he carved out a piece of prosperity for us. He’s had his own business for nearly ten years now, and he’s known by his peers to be fair and honest.</p>\n\n<p>After the first few years of a struggling fledgling business, things changed. My clothes were new, and only smelled like the lavender fabric softener our new housekeeper used. We bought groceries without looking at the prices, and trips to restaurants, once reserved for special occasions, became a weekend ritual. I moved to a prestigious academy across town, with knee-length skirts in their school uniforms, and Ivy League acceptances in every graduating class.</p>\n\n<p>Despite all this, my father did his best to keep me from turning out spoiled. There were rules in his house: not many, but they were iron-clad. My father provided for and loved me, and in many ways allowed me to explore and grow independently. All he asked was that I follow his rules, and he never set a rule he didn’t explain. My father was a fair man, after all.</p>\n\n<p>The earliest rule I remember was that I was not to go in the basement. This was easily enforced, as the basement was locked, and I did not know where he kept the key. The basement was dangerous, he told me, when I, out of childish curiosity, demanded to know <em>why</em>. There were black widows down there, spinning their webs in wait for me. And quite possibly rats, he added, which is why he went down so often, to set traps. Rats were also the source of the sounds I sometimes heard coming from beyond the locked door: a faint scratching and, more rarely, a soft squeak.</p>\n\n<p>As I grew up, the rules became less about personal harm (Don’t touch the stove. Don’t run with scissors.) and more about personal responsibility (No phone until you finish your homework. No borrowing the car until you’ve done your chores.). I rebelled against these, as all teenagers do, sometimes with scathing judgements only a child can deliver to a parent. My father was patient during these scenes, and waited until I’d worn myself out before explaining. “Cecilia,” he said. “The world is a hard place. It doesn’t give handouts. I need to know that when I’m gone, you can take care of yourself. And the only way to do that is develop self-discipline. You’re a smart girl, and you can do anything you could possibly dream of. But you gotta work to get there.”</p>\n\n<p>Of course he was right. I knew he was right, however much I resented his pronouncements. But it placed me in good stead: that self-discipline he instilled in me lead to a spot on the varsity lacrosse team, where we went to state; it helped me as Student Body Vice President when the President was sidelined by mono the week before Homecoming; and it all seemed to culminate that day when an official-looking envelope arrived in the mail, bearing the letter that congratulated me on acceptance to the University of Chicago. He was there for all of that, in ways large and small, and I’d never seen him so proud as the day I’d opened that letter.</p>\n\n<p>And, like the stalwart father he is, he was there for the bad things, too.</p>\n\n<p>There was only one other rule I was expected to abide by while I was in his house: no boys. Ever. My father was suspicious of friends and male acquaintances, and even disliked my male teachers. “Boys have one thing on their mind, Cissy,” he’d told me more than once. “You can’t let them distract you—you’ve got a future, girl, and you can’t let it get away from you.”</p>\n\n<p>This was partially why he sent me to an all-girls school—to keep me focused on my education. Luckily enough, this rule turned out to be pretty easy to follow. Though I’ve never gotten up the courage to tell my father that my “best friend” Lynn was actually a lot more. I can’t think what he’d say if he knew what we got up to during our “study” sleepovers.</p>\n\n<p>I think about Lynn a lot, though it’s been nearly a year since I’ve seen her. She ran away from home, and no one’s heard from her since. It’s my fault, really. We hit a rough patch the summer after junior year—she wanted to come out, I didn’t. I didn’t know what it would do to my dad, and I wasn’t willing to risk it. I was scared. She called me a coward, and she was right, so I called her something worse. She insisted on getting out of the car and walking home, and I drove off, and that was the last I saw of her.</p>\n\n<p>It wasn’t the last I heard of her, though. A few hours later, she tried to call me, but I turned off my phone. I went out with some friends and stayed past curfew. I thought my dad would be livid when I got home, but he was out too, likely on one of the emergencies he got called on sometimes. I passed out on my bed, and it wasn’t until the next morning that I heard she was missing. No one knew where she’d gone.</p>\n\n<p>The police questioned everyone, including her “best friend.” I lied to them, said nothing was wrong, I didn’t know why she would want to run away, her family loved her, her teachers loved her, everybody loved her. I didn’t tell them about the dozens of texts she’d sent, begging me to answer, or the voicemail, her voice broken from crying, “Cece, I’m sorry, I shouldn’t have pushed you. I get that you’re scared, okay? I’m scared, too. I just want us to be able to live like normal people, you know? I don’t want to hide anymore—I <em>love</em> you, and I’m tired of acting like it’s something to be ashamed of! Goddamn it Cece, why won’t you <em>answer</em>? I’m coming over, and I’m <em>not leaving</em> until you <em>talk</em> to me!”</p>\n\n<p>That was a rough time. Back then, I thought I was the reason she left.</p>\n\n<p>Now I <em>know</em> I am.</p>\n\n<p>My dad went out tonight, drinking with buddies from work. I have the house to myself. I’d just printed a paper for school, and went into my dad’s study to get it. I rarely go in there—it’s his “man cave,” and I know he values his privacy—but that’s where the printer is. There’s also a fax machine, and his laptop, and this big, cherrywood desk he salvaged. It’s a beautiful thing. When I was younger, I used to sit in the big office chair, with my feet swinging, and trace the grain in the desktop wood. I liked the smell of wax and wood, and the way the handles were set with decorative curls. I used to go through all the drawers, just for the sake of opening them—kid stuff, you know you did it, too. There was always one drawer, the bottom left, that he kept locked. When I was a kid, this bothered me—I didn’t like any secrets except my own. As I got older, I figured it contained something he was embarrassed about—porno mags was my best guess—and then I forgot about it completely. Tonight, as I took my pages describing the role of light in Ralph Ellison’s <em>Invisible Man</em>, I saw that the drawer was, ever so lightly, open.</p>\n\n<p>Maybe he forgot to lock it. Maybe, trusting me to be the loyal daughter, he stopped bothering. Maybe he wanted me to find it, though this last one I highly doubt.</p>\n\n<p>I wouldn’t have thought of myself as the snooping type. But there was still a bit of that little girl inside me who wanted to know <em>why</em>. And I thought, selfishly, that if I had access to my father’s secrets, maybe it’d be easier to share my own.</p>\n\n<p>So I opened the drawer.</p>\n\n<p>Inside was a camera. An old thing, not even a touch screen, no streaming, no bells and whistles to speak of. I was a little unnerved. A camera? I’d never seen this camera before. And why one so old?</p>\n\n<p>I thought again of pornography, and wondered if I <em>really</em> wanted to look. What if I’d found my father’s amateur porno tape? I’d have to blind myself. <em>But</em>, I thought, the weight of my own secrets pressing on me. <em>But</em> <em>if it was</em>—if it was, there’d be no way he could judge me. So I bit the bullet and I turned it on.</p>\n\n<p>There were, indeed, pictures of women. No, girls—girls my age, some even younger. So many girls. So many crying, frightened, screaming girls.</p>\n\n<p>I’m not going to tell you what was being done to them. You already know. You’ve read this story before.</p>\n\n<p>I was horrified, but I kept going through the camera, photo after photo, every image making my stomach roil. You’ll wonder why I did it, why I didn’t just drop the damn thing and call the police. I admit, it was a foolish reason, and selfish, but I <em>needed</em> to give it a chance—I needed to know if there was an exception—just one, single photo that showed me something different.</p>\n\n<p>Because the thing that horrified me the most wasn’t the blood. It wasn’t the contorted figures, or the bodies hanging limply with blank, blank eyes. It was how familiar they all looked, even though I’d never seen them before. A pattern playing over and over through each picture: straight dark hair cut at the collarbone with blunt bangs, in some cases obviously a wig, in others the hair chopped messily, dye darkening the skin along their hairline; a splash of freckles across the nose, sometimes smudged, as though drawn on; and a small cut, just under the chin, not more than an inch long, right where I have a scar from falling off my bike when I was seven.</p>\n\n<p>I was looking at the scene of my death, perverted and parodied, over and over and over, played out with these strangers, these girls, these poor, mutilated, living dolls of me.</p>\n\n<p>I don’t know how many pictures there are. I didn’t get through them all. I couldn’t keep going after I got to Lynn.</p>\n\n<p>She was wearing the neon eyeshadow I’d gotten her for her birthday, the palette she wore the night we fought, the night she disappeared. Her mascara had run, and lipstick was smudged around her mouth. I thought of how she used to kiss me with that mouth, a coat of lipstick freshly applied, leaving an imprint on my own lips when she pulled away. “Thought I’d refresh your lipstick,” she’d say, and laugh like it was the funniest thing in the world. She had the most beautiful laugh: rising and falling, like a roller coaster.</p>\n\n<p>She was done up the same way as all the others—her wig was crooked, and the running mascara had ruined the freckles. She must’ve struggled when he made the cut, because there was more blood than the other photos. She must’ve fought him hard, just like she wanted to fight the world. I wonder if she cursed my name as he snapped the picture.</p>\n\n<p>It’s getting late. My dad will be home soon. When he arrives, I’ll be waiting for him. I’ve already gotten the shotgun out of the safe. It’s loaded, safety on, resting beside me on the desk while I type this. My father made sure I know how to use it—he wants me to be able to protect myself against a hard, cruel world. A gun is not a toy, he said to me at the shooting range. Don’t pick up a weapon unless you intend to use it.</p>\n\n<p>He’s a wise man, my dad.</p>\n\n<p>I’m posting this so that someone, anyone, will know what he’s done, and what I’m going to do. I’m going to wait for him on the stairs by the front door, shotgun in my lap. I’ll keep my hold steady, my finger off the trigger until I’m ready to fire, just like he taught me.</p>\n\n<p>You think I’m going to kill him. I can’t say that I won’t—it depends, I guess, on him. The gun here is less a weapon and more an incentive—an incentive to fetch the basement key, to unlock that long-forbidden door, to march down into the darkness filled with things so much worse than spiders and rats. An incentive to lock himself into the manacles and chains bolted to the walls and ceiling, an incentive to keep nice and quiet while I review his chest of toys, gleaming and silver and sharp. You’re wondering why I’m posting here, why I haven’t called the police. It’s because once the police get him, he’ll be gone for good, and I’ll be left with that little girl inside me, that little girl who always wants to <em>know</em>. So I’ll allow him this one, single chance to tell me *why* . Then I’ll decide.</p>\n\n<p>You see, I’m a fair person. I’m my father’s daughter, after all.</p>\n</div>\n","author":"firesidechats451"}