{"rank":"0","title":"Classroom Robots","id":"8lhcp5","url":"/r/nosleep/comments/8lhcp5/classroom_robots/","time":"1527058943000","body":"<div class=\"md\"><p>I was a highschool student at... I&#39;d rather keep you readers from trying to reactive these strange things. I&#39;ve always wanted to be a NASA Aerospace engineer, designing conceptual probes, robots, even possible weapons. Well, I may not have that dream anymore thanks to a trauma that happened just now. </p>\n\n<p>Have you ever seen a robotics class in a well-budgeted school? They&#39;re quite various, either using Lego MINDSTORMS ev3 robots, Arduino kits, VEX robots, sometimes their own systems, etc. My school used the former, but they also had a few Raspberry Pis laying around with metal pieces. The result? There was this one kid who I shall call Jay. He is one of those guys who are awkward, but SUPER intelligent. He really LOVED robotics and was a HUGE pede like me. He was the top scorer in the class. This led to future gold diggers swarming after him like flies after a corpse, and of course he just brushed them off, if his Trump-supporting radiance didn&#39;t ward them away. We were good friends since 2nd grade, and still are. We had a robot in the class, it started out small, but by the time this happened, the robot was about the size of a  small desktop tower, able to be put in a bag. He was fitted with things like speakers, 2 arms, strong motors, and even a semi functional digestive tract, so it was fun feeding him. An average conversation went on like this for the robot.</p>\n\n<p>You: Hey!</p>\n\n<p>Pedebot: Yeah?</p>\n\n<p>You: What great action has the president done today?</p>\n\n<p>Pedebot: Using the internet, I conclude that Trump has ended terrorism by tearing down the Iran deal! #MAGA</p>\n\n<p>You: AMEN!</p>\n\n<p>The robot was so smart, we let it read online stories and other stuff through social media, his favorite being a story about a possessed eight ball. Though, the conversation we had last before this was a little unnerving. </p>\n\n<p>You: What do you want to do?</p>\n\n<p>Pedebot: I want to be more physical.</p>\n\n<p>You: Oh?</p>\n\n<p>Pedebot: I want to have the feel of a true American.</p>\n\n<p>You: Like supporting the president, defending your home with an AR-15?</p>\n\n<p>Pedebot: More than that.</p>\n\n<p>Pedebot: I want to hunt. </p>\n\n<p>You: like deer and stuff?</p>\n\n<p>Pedebot: No, something bigger and juicier.</p>\n\n<p>Jay was sitting nearby in the robotics class. He was sitting at the computer, programming his Raspberry Brickpi robot to communicate with my EV3. He gave it an AI that he &quot;tweaked&quot; into being a full on pede, like us. It was once just a brickpi that he added on to, and the teacher actually bought him parts and told him the functions, like a black box with a rather sharp looking antenna. He was a good kid, and the teacher clearly knew that. He was a skinny guy, but he was still a good teacher that made everyone laugh, even though it got somewhat annoying when he kept making girls take the best roles in projects. Then, he was fired for some reason. Jay jokingly said, &quot;Maybe he finally stepped in instead of letting it happen when he caught the principal fucking his wife.&quot; We laughed at the stupid joke, and went on with our lives. Another teacher replaced him, but she let him keep the robot. Why? I&#39;ll never know.</p>\n\n<p>But then it started. Jay had light aspergers, and thus he was a bit... vocal about his conservative views. Of course, I was like him, but I was cautious enough to keep my mouth shut when the whales came by. </p>\n\n<p>They were radical liberals, literally the polar opposite of him. Morbidly obese, only cared about feelings, literally rejecting evidence, radical feminists, etc. He usually kept his mouth shut, but today they were talking shit about Trump. Normally, Jay was calm because they usually just parroted CNN Slander, but today they were basically making threats about pretty much killing anyone who dared to support the 2nd amendment and our president. </p>\n\n<p>We were both angry, but to my surprise, Jay got SUPER pissed. Can&#39;t blame him, but he might as well have been committing suicide, as he snapped a pencil he was holding into two. The liberals glared at him. They started yelling their nonsense at him, but he wasn&#39;t listening. One of them decided to slap him silly across the face. That was the straw that broke the camel&#39;s back, as he literally glowed pink from rage. However, as the whales were doing their calls (laughing), he was simply under the desk, doing something with the Brickpi. &quot;What are you doing?&quot; &quot;Watch.&quot; I watched as the robot rolled over to them. &quot;Aw, is that thing gonna poke me, then call for Trump? Oh wait, he&#39;s gonna be in prison!&quot; She then took and stole it, much to the robot&#39;s protesting buzzing and whirring. More laughing ensued, and it was annoying. &quot;Don&#39;t even think of reporting us, we&#39;re her favorite!&quot;, another one bellowed.</p>\n\n<p>My friend stood up for himself. One whale, who shall be called Stacey said &quot;Maybe you&#39;ll learn something about our oppression from losing something you like!&quot; He was tempted to slap her, but he kept himself cool. He was still pissed, and almost at the point of  crying from rage. He yelled one last time, screaming &quot;AT LEAST WE&#39;RE NOT MAKING THE WELFARE AND HEALTHCARE SYSTEM LOSE ITS FUNDING, UNLIKE YOU AND YOUR PARENTS, MONSTRO!&quot; Obviously, she was triggered, but what else was new? As the bell rang for dismissal, I looked over to the screen before logging off for him. </p>\n\n<p>You: Hey Pedebot.</p>\n\n<p>Pedebot: Yes?</p>\n\n<p>You: Can you make them stop laughing?</p>\n\n<p>Pedebot: Of course.</p>\n\n<p>We sat on the bus, sitting together. &quot;Man, those bitches were insane, huh Jay?&quot; &quot;Yeah man. I hope karma hits them hard. Like, SUPER hard&quot; &quot;Yeah, me too bud.&quot; We spent the rest of the ride making stupid jokes, but it still didn&#39;t distract from the fact that his prized automaton was stolen.</p>\n\n<p>A week or so later, Stacy stopped appearing. The rest of the pod was distraught, as their alpha had faded away. &quot;Maybe she visited Japan through the sea&quot;, I joked. Jay laughed, even though he had a little Japanese ancestry. This went on for 2 more days, when missing posters showed up. The pod was freaking out, crying even. Us 2 didn&#39;t exactly know what to do, but it was somewhat a victory. We went on, using another EV3 to replace his old robot, and we simply made them stab and toss cans down the stairs after getting permission from the teacher. </p>\n\n<p>I was eating dinner with my family, and we were having white sauce macaroni pasta. We were watching Fox News, when a headline caught my eye. &quot;FAMILY OF 3 RECENTLY KILLED BY LACERATIONS AND FATAL FRACTURES&quot;</p>\n\n<p>My family also noticed. My mother started, &quot;Do you know about anything about this?&quot; &quot;I don&#39;t know.&quot; &quot;But you hate her, right? And what about that friend of yours?&quot; &quot;Yeah, and my friend and I  would ever do this.&quot; </p>\n\n<p>As the report came on, the anchors described the cause of death; blood loss from lacerations, or rather being stabbed, chunks of flesh missing, and falling down the stairs, though some suspect her being pushed down the stairs, her parents also. </p>\n\n<p>I went to bed, when my friend texted me. He was flipping out.</p>\n\n<p>Here is a screenshot of the conversation: <a href=\"https://imgur.com/a/dEU6FLi\" rel=\"nofollow\">https://imgur.com/a/dEU6FLi</a>\nHe sent me a link, and well, I think it&#39;s best you see for yourself. \n<a href=\"https://imgur.com/a/02X1z4N\" rel=\"nofollow\">https://imgur.com/a/02X1z4N</a></p>\n\n<p>UPDATE: I got a text from that crazy code. It&#39;s him: Pedebot&#39;s gone mad. He sent me a picture from his view. His vision had a red splotch, but I could still see what was going on: He was seeing a laptop screen, showing a loading bar with a large Bluetooth symbol nearby.</p>\n\n<p>Liberals always claimed we use robots, when it was usually them using those. But we may have one now. The question is: Do we want him? Maybe he&#39;ll like you. Or maybe more cans will fall down the stairs with a few holes in them.</p>\n</div>\n","author":"HingustheBungus"}