{"rank":"25","title":"Rattling in the Garage","id":"8lhle0","url":"/r/nosleep/comments/8lhle0/rattling_in_the_garage/","time":"1527061931000","body":"<div class=\"md\"><p>My garage is scary. </p>\n\n<p>I&#39;m not sure why exactly. Maybe it&#39;s the thought of what hides in its dark corners. Or the garage seeming more like some foreign extension of the house, rather than an actual part of it. Perhaps it&#39;s because nothing moves in there, save the occasional scurrying of a small pest. The air itself feels deathly still.</p>\n\n<p>I remember when things started happening, because it was shortly after my dog died. I was about 20 years old. Jeffrey was a golden brown, American cocker spaniel. He loved food almost as much as he loved me. Or... maybe it was the other way around. </p>\n\n<p>I recall one occasion whence he stole my chicken straight off the table, after I&#39;d left it there to get some water. I ran over and gave him a couple taps on the muzzle and reprimanded him so vehemently, that he darted straight for his doggy door, his butt veering sideways and his stubby little tail tucked tight against his rear-end. He laid outside in the corner of the yard on his stomach, his head flat across the ground. He moped there for 10 whole minutes - that&#39;s like an hour or something in dog time. I&#39;d never seen him so sad on account of his misbehavior. </p>\n\n<p>I obviously couldn&#39;t ignore him for too long, so I eventually went outside to give him a bear hug and make amends. I probably talked to him about school or girls or something afterwards. He was more of a listener than a talker.</p>\n\n<p>It&#39;s funny how much more secure you feel with your dog around. Even though he lacked any aggressive capabilities, his absence proved to unsettle me a bit on the nights that I was home alone. He gave me some semblance of safety, because if anything were to happen, at least I&#39;d have him with me when the time came to face it.</p>\n\n<p>On one night in particular, about a week after Jeffrey was put down, my parents had gone to Orlando for the weekend and left me the house.</p>\n\n<p>I was watching a movie and paused it to go get a snack from the kitchen. I love pigging out and watching horror movies when my parents leave me alone in the house. While heading back to my chair in the family room, I heard a faint sound come from garage door in the laundry room.</p>\n\n<p>tap tap</p>\n\n<p>The sound was so subtle that I didn&#39;t even consciously take note of it until I got to my chair and sat down with my food. I probably wrote it off as one of your typical weird house noises from shifting temperatures or pipes or something.</p>\n\n<p>Then it happened again. </p>\n\n<p>tap tap</p>\n\n<p>I immediately stopped eating and looked towards the door, feeling a slight tingle inch up my spine. Why would anyone be at my garage door? I was sure I closed the garage. There was so much clutter in front of the outer door that led outside, that anyone who got it open wouldn&#39;t be able to get in anyways.</p>\n\n<p>I felt a mild panic swell up in my chest as I tried to reason out what was happening.</p>\n\n<p>Then I remembered to stay calm. I&#39;d gone through these scenarios a million times in my head. I was prepared and remembered my self instruction: grab the phone and go get a batt.</p>\n\n<p>BANG BANG</p>\n\n<p>It was so loud that I jumped and almost fell out of my chair. It sounded like two fists had struck the door with immense force.</p>\n\n<p>I sprinted to my room and fell to my knees, blindly reaching around underneath the bed until my hand came into contact with a smooth wooden surface. I yanked the batt out and strode hastily back to the family room. I stopped just outside of the laundry room with my back against the wall, my hands wound tightly around my weapon.</p>\n\n<p>I was peeking around the corner at the white garage door, it seemed to almost mock me, looming there just a few steps away. It was the only thing between me and my visitor.</p>\n\n<p>Shit, I&#39;d forgotten to grab the phone. Just as I took a step towards the receiver, I heard a faint whisper from behind the door.</p>\n\n<p>Wait.</p>\n\n<p>I froze dead in my tracks, with one foot positioned towards the phone and the other arched where I was standing initially. The voice was low and hushed, but sharp and demanding.</p>\n\n<p>I slowly turned my head and looked squarely at the garage door. I had so many thoughts running through my head, but I couldn&#39;t move.</p>\n\n<p>Did I just hear a voice? It didn&#39;t sound human. Am I imagining things? How did it know that I was moving?</p>\n\n<p>BANG BANG BANG BANG BANG BANG BANG</p>\n\n<p>The pounding was rapid and almost deafening. I dashed to the phone, stumbling over the coffee table on the way. I snatched it from the receiver and frantically dialed 911.</p>\n\n<p>BANG BANG BANG BANG BANG BANG</p>\n\n<p>I told the operator that someone was banging on my garage door, trying to break in. They sent a unit out immediately.</p>\n\n<p>BANG BANG BANG BANG BANG BANG</p>\n\n<p>I stood in the middle of the room, hands numbly squeezing the batt, waiting for someone or something to come barreling out of the laundry room. My hands were shaking and sore from gripping the batt so tightly. I felt as if I were about to collapse.</p>\n\n<p>Then suddenly, silence...</p>\n\n<p>I stood there with my heart beating out of my chest, counting the seconds until the police arrived. My legs felt like jelly. My thoughts were short and incoherent.</p>\n\n<p>Then it whispered to me again.</p>\n\n<p>I found something... of yourssss.</p>\n\n<p>I stood there as still as a tree. That confirmed it, it had to be something, not someone. The voice sounded unnatural, not human. Not of this world.</p>\n\n<p>It was then that I heard the dreadful rattling of chains. At first it was followed by a slight whooshing sound, as if being swung lightly back and forth. Then I heard them being shuffled around behind the door, like they were being manipulated or wrapped around something. </p>\n\n<p>The voice spoke again.</p>\n\n<p>I sought to take it from you, but it has offered itself willingly, by its own accordddd.</p>\n\n<p>I heard the chains sliding across the ground, at first loudly, then slowly fading away and becoming more distant until the sound vanished completely.</p>\n\n<p>The cops showed up a couple minutes later. I explained to them what had happened, but after opening the garage door and allowing them to inspect the place, they felt hard pressed to believe me. How could I blame &#39;em?</p>\n\n<p>I didn&#39;t sleep that night, I couldn&#39;t until the next day when the sun rose. I barely slept the night after that.</p>\n\n<p>I knew that whatever was on the other side of that door was not human, but what did it want? It said it got what it needed. What could it have possibly taken? The cars were still in the garage at least, that was a plus.</p>\n\n<p>The next day my parents came home from Orlando. I didn&#39;t tell them about the events that transpired, but my mom is a real estate agent and has an interest in all things home ownership. I asked her if she knew who the previous owner was, curious to scrounge up any possible leads on what had happened. Her answer left me dumbfounded and speechless.</p>\n\n<p>&quot;A man lived here alone before us, he had no family or anything,&quot; she said. &quot;He became increasingly isolated, until eventually the neighbors stopped seeing him around at all. People got concerned and eventually notified the authorities. When they arrived on scene to investigate, they found that he had hung himself in the garage with some rusty old chains. I didn&#39;t want to tell you when you were a boy. It hadn&#39;t crossed my mind again until now.&quot; She opened her mouth for a second as if to say something else, then closed it.</p>\n\n<p>&quot;What mom? Is there something else?&quot;</p>\n\n<p>She looked uneasy.</p>\n\n<p>&quot;Stuffed in an airtight box in the garage, they found where all of the neighborhoods&#39; dogs had gone missing.&quot;</p>\n\n<p>I was broken. It was then that I realized what it had taken. Even when Jeffrey had gone away, it didn&#39;t feel like he ever really left me. The night that that thing paid me a visit, was the first night I&#39;d truly felt alone.</p>\n\n<p>I remembered what it said, that what it wanted had come along willingly. I wonder if Jeffrey turned himself over because he knew that I was in danger. </p>\n\n<p>I fell to my knees.</p>\n\n<p>For the first time since he died, I wept for my dog.</p>\n</div>\n","author":"Meowethan"}