{"rank":"81","title":"I Think I Was A Sacrifice","id":"8lhmrf","url":"/r/nosleep/comments/8lhmrf/i_think_i_was_a_sacrifice/","time":"1527062441000","body":"<div class=\"md\"><p>I knew living alone was a mistake. Even if I adopted Scout to protect me. She was a large pit bull that was sweet as taffy but a very good guard dog. She learned when people were expected to come over, I trained her with a toy by the door. So if a knock comes at my apartment door and I wasn&#39;t expecting it, Scout goes ballistic.\n&nbsp;\nMost of the time I opted to just have the toy by the door to avoid her going crazy.\nShe was still weary when strangers were at the door when it opened, though.</p>\n\n<p>It was a normal Friday night. I came home from classes and was ready to have a nice relaxing glass of wine. I tossed my laptop on my couch and walked into the kitchen.</p>\n\n<p>&quot;Scout!&quot; I called as I reached the linoleum.\nIt was a small, one bedroom apartment on the first floor. So I thankfully had some backyard to let her out into. She came thundering down the small hallway and licked at my outstretched hand with enthusiasm.</p>\n\n<p>&quot;Missed you too, girl,&quot; I said followed by a laugh.\nI hooked her to her chain and opened the sliding door to the small patio space. She bounded out the door and began sniffing around. After securing the door shut again and clicking the lock in place I walked into my kitchen and poured myself a glass of moscato.</p>\n\n<p>I was tired. The week was long, my advisor had me completely revising my 250 page novel, sentence by sentence to ensure top quality. I checked my phone and sighed. My fiancée, Kyle, was probably out with his friends at his grad school across the country in New York. It was unnerving to be so far away from him. He was my rock and my protector in undergrad. The first few months apart from him were going to be rough.</p>\n\n<p>I took a sip of my wine. It was cheap so it was sweet and fruity on my tongue, the small bite of alcohol in my throat as I swallowed. Another sigh escaped my lips and I glanced at my phone again to check the time. It was only 9 pm but I was fading fast. I had stayed in the library until 8 revising and my brain was shot. It was going to be an early night.</p>\n\n<p>I mindlessly turned on the TV and let the cable drone in the background as I let my exhausted brain settle. The effort it took to switch to Netflix and turn on my latest binge was even too much for me. I had done all day, late night revisions before but the fog that clouded my brain was different. My thoughts came at a crawl as if they had to first pass through sludge before actually forming.</p>\n\n<p>The wine glass in my hand was still most of the way full. It wasn&#39;t the alcohol. Uneasiness washed over me. Occasionally I ran out of my anti-anxiety and depression medicine and for a week I had a fog inducing migraine until I got my refill. But this wasn&#39;t the same fog. It was different and continued to swallow my thoughts as I tried to form them.\nScout whined at the glass door to the yard trying to remind me to let her inside. I lolled my head to the side and looked at the time on my phone. 10pm. There was no way an hour had passed. But Scout whined again and it took a second for me to remember I usually let her run for 30 to 45 minutes when I got home. She would get lonely if it was much longer than that which explained her whining at the door.</p>\n\n<p>I shook my head in a lousy attempt to clear the fog. My body felt like it had turned to lead as I stood up.\nScout started barking and jumping on the glass. Out of character behavior for her but I brushed it off to me having neglected to let her in for so long. I began walking to the door when the world turned sideways and then went dark. The last thing I heard was Scout&#39;s vicious barking.</p>\n\n<p>The same bark she used when strangers entered the apartment.</p>\n\n<p>The fog was still present when I began to come back to consciousness. Antiseptic assaulted my nose and my head began to reel in panic. I wasn’t on the floor in my apartment where I passed out. I felt the stiffness of a plastic mattress under my back and the tightness of restraints around my wrists and ankles. Panic became full blown and I opened my eyes. I was met with darkness again as I realized I was blindfolded.</p>\n\n<p>Where I was was a mystery. It smelled like a hospital and the bed I was in felt like a hospital bed. I felt a needle in my left elbow but didn’t hear the sounds of any heart monitor. Even if I were in a hospital I wouldn’t be blindfolded. Restraints, maybe if I had been violent but. I’d passed out in my living room after being drugged. At least that’s the only explanation my fog filled brain could come up with.\nI wanted to call out but fear left my throat closed. I laid still and tried to remain as calm as possible. Time passed at a crawl and the drug induced fog didn’t fade as I thought it would. I tried to think of anyone in my life that would do this to me. But I couldn’t.</p>\n\n<p>I drifted in and out of sleep, exhaustion stemming from the fear.</p>\n\n<p>Hunger had ached heavily at my stomach for a long while by the time I heard the voices. My heart jumped into my throat as I laid as still and quiet as possible, hoping my stomach would stay silent as they came in.</p>\n\n<p>I heard the unlocking of a deadbolt and the swing of a door opening. Two sets of footsteps entered, one heavier than the other.</p>\n\n<p>“She’s properly sedated?” His voice was even and calculated.</p>\n\n<p>“Yes, sir.” The second was gruff, much deeper.\n“Then let us begin. His awakening shouldn’t be put off any longer.”</p>\n\n<p>I quivered internally as the thin sheet covering me was drawn back. Cool air slicked across my abdomen and thighs. They must have stripped me down to just my underwear. Embarrassment gripped me for a second as the cold air hardened my nipples and I realized I was exposed, restrained, and vulnerable. Thoughts of being assaulted in a different way invaded my thoughts and a whole new fear washed over me.</p>\n\n<p>Through all this I remained as still as possible though. They assumed I was asleep and in a few moments I really wished I was.</p>\n\n<p>Searing hot pain began emanating from my stomach. I bit my inner cheek hard trying not to cry out. It felt like they were cutting me open. The pain that was blossoming and throbbing made my head reel.</p>\n\n<p>Then they began chanting and my blood ran cold.\n“Sit Dominus in mundum venerit hodie. Dat hujus Virginis frequentate nobis, ut eius sponsa eius, et portal. Utinam non pluit ut benedicat eius studiosissimus sectatores a chao, donec hodie in aeternum.”</p>\n\n<p>The cutting continued as they chanted the phrase over and over again. Though there were only two their voices echoed throughout the room and the cuts on my stomach began to burn hotly. My resolve to hold still faded and I began thrashing against my restraints. I was screaming, what exactly I wasn’t sure, but my vocal chords strained in effort.</p>\n\n<p>“Hold her!” the even toned one yelled.</p>\n\n<p>I managed to wiggle the blindfold off my eyes and the warmth of candlelight almost soothed me. But I realized I was in the center of the candle circle and the fear was back. I wanted to look at my assailants but the damage to my stomach took precedence.\nCarved into my flesh was a series of symbols I didn’t even remotely recognize. The last one was crooked as I had began thrashing as it was cut into me. Blood was pooling but not spilling from the wounds and they were glowing an ominous red from within. They burned more as they began to glow brighter.</p>\n\n<p>Standing next to me holding a bloody scalpel was a slender, plain man in a lab coat. He had dark hair and eyes and a very dark complexion. His muscle was a large, burly white guy that walked over and held my ankles down with one hand and pressed my chest down with the other. His boss nodded in approval and they resumed the chanting as they had before.\nThe burning in my wounds flared to a peak and my body trembled in the intense pain. Behind the man in the lab coat a light similar to the one glowing in my wounds began flickering. They chanted louder and louder, the boss’ eyes growing wide with excitement as he saw the other light. I was still screaming, at least, I think I was. The red light overpowered the candles in the room as darkness fully engulfed me.</p>\n\n<p>I awoke again the smoke in my lungs. Violent coughs ripped through me as my lungs burned. My restraints were undone and the room was destroyed, everything aflame and darkened except my bed and myself. The scorch marks indicated some type of explosion where the red light had started to form before I passed out. The men lay burned on the ground. I took out my IV, pressing again the hole to prevent bleeding, and crawled out of the bed. Flames licked at my feet as I lowered them to the floor but I didn’t feel their heat. I needed to get out of there, even if I was burned in the process. When my feet landed, the flames retreated away from me.\nI kicked the bodies of my captors in turn and the one in the lab coat groaned weakly in response. I was wobbly and weak and there was still drugged fog in my thoughts. But I kicked him again, harder this time.</p>\n\n<p>“Get up, tell me how to get out of here!”</p>\n\n<p>I had more questions but the smoke persisted in my lungs. He didn’t budge but I needed out. Whatever had happened was his fault anyway. I wobbled my way to the door which appeared ripped from its hinges. The room was at the end of the hall which only gave me one direction to go. I persisted against the fog and stiffness in my joints. I had to use the wall as support and again the flames there avoided contact with my skin.</p>\n\n<p>Eventually I found the other end of the hall and a lobby after climbing a set of spiraling stairs. I must have been in the basement. The doors that should have served as the entrance were also torn apart from the inside out. I stumbled out, the broken glass slicing open the flesh of my feet. When my feet landed on dirt in the parking lot I collapsed again in exhaustion.</p>\n\n<p>The fire department was the first on the scene, the building was an old abandoned cooperation office. A farmer noticed the smoke and called in the fire. When I got to the hospital I was told I had been missing for about a week. I wasn’t sure how long I was out for but the weird ritual only took a few hours.</p>\n\n<p>When the cops came to interview me they told me they found one body in the basement where I was held. The African man in the lab coat had managed to escape the fire. His muscle had died from smoke inhalation. They asked about the destroyed doors and I told them I knew nothing, I also didn’t mention the thing about the fire. The nurse came in and shooed them away, insisting I needed rest. The IV I had been given gave me nutrients I needed along with a cocktail of different sedatives, made ineffective by my inability to process a certain proteins present in all of them.</p>\n\n<p>My parents and Kyle flew in to be with me. I was in the hospital for weeks. The wounds on my stomach were documented by the police and treated by the doctors. They became infected and extended my stay. I was miserable, but having Kyle at my side for support helped.</p>\n\n<p>But the doctor is coming back and I need to rest for a while. I’ll update again soon.</p>\n\n<p><a href=\"https://www.reddit.com/r/nosleep/comments/8lvy9e/i_think_i_was_a_sacrifice_2/\">Part 2</a></p>\n</div>\n","author":"SilverScripte"}