{"rank":"12","title":"No Sleep for the Wicked","id":"8liewi","url":"/r/nosleep/comments/8liewi/no_sleep_for_the_wicked/","time":"1527072892000","body":"<div class=\"md\"><p>I think I&#39;m losing my mind, I mean, I probably did a long time ago... But, this is a little much, even for me, and I don&#39;t mean my actions or anything that I&#39;m going to be telling you. When I say I&#39;m losing my mind, I say it because for some fucking reason I&#39;m letting you know what has transpired over the last couple days... And then some. This is hard for me, so bear with me, I don&#39;t open up often.</p>\n\n<p>Two weeks ago, my Aunt passed peacefully in her sleep. She&#39;d been my guardian since I was sixteen, and my parents disappeared out of the blue. Police think they ran off, tired of the responsibilities that came with having a teenaged daughter. We were always well off, and I wouldn&#39;t say I had a bad childhood - aside them pawning me off to a Catholic School and pretending I didn&#39;t exist. They weren&#39;t going &#39;tolerate&#39; a gay child, and they said time and time again they&#39;d wished they had gone through with the abortion. Some people draw the short straw, I was cool with it. </p>\n\n<p>Anyway, everyone knew how my parents felt about me, and so it was an open and shut case. The fact that they&#39;d cleaned out their accounts and safe - along with no signs of foul play sealed the deal, and the state placed me in my aunt&#39;s care. Life was great, she was great, everything was great. No, I&#39;m serious, we got along famously. She never had any children, and accepted me with loving arms, we&#39;d do everything together Hell, she homeschooled me. The last six years with her were the best of my life. </p>\n\n<p>When my aunt passed, I was - and still am, overcome with so many emotions that I almost didn&#39;t feel the change. I was oddly empty, yet full. It was like... I became numb but... I don&#39;t know, maybe more sensitive? Not sensitive in the blubbering, eyeliner and tear streaked face, pathetic mess way... No, more attuned to my surroundings, almost as if I could feel every bit of energy in the air. I felt stronger than ever, I was almost quite literally swelling with power. I just didn&#39;t know what to do with it yet, or how to use it. I didn&#39;t understand what Fate had in store for me.</p>\n\n<p>I&#39;d always had weird dreams, dreams that I knew actually meant something, just like I&#39;ve always been a lucid dreamer. At least that&#39;s what I thought it was, until a few night ago. I&#39;d finally started to come to terms with my aunt&#39;s passing - though I still wasn&#39;t sure what was happening inside me, when I slipped into bed that night. The sensation I&#39;d been feeling since her death had intensified, to the point where I was tingling non-stop. This is where the story begins, this is where my life starts.</p>\n\n<p>I was dreaming, I was wide awake but I was dreaming, it wasn&#39;t anything new. For the most part, at least. I was standing in a field of flowers, flowers that seemed to be taken from a watercolor painting. Reds, oranges and pinks all blended together beneath a blazing sunset, the almost angry sun half hidden behind the soft mountain scape. I felt the soft breeze caressing my skin, and smelled the soft, sweet aroma of the flowers. </p>\n\n<p>I remember thinking to myself, &quot;This must be heaven.&quot; As I do when my dreams are so comforting, when a gentle and familiar voice reached my ears.\n&quot;You couldn&#39;t be further from the truth, love.&quot; My heart fluttered at the sound of my aunt&#39;s voice, I was overcome with joy as I turned around to meet her comforting gaze. I ran to her, flowers lightly whipping my calves with each stride. I slammed into her, and she whisked me off my feet, into a spinning hug.</p>\n\n<p>&quot;Aunt Rowan!&quot; I cried, as she stepped out of our embrace. &quot;I&#39;ve been so lost without you,&quot; I was spitting out a million words a minute as I spoke, &quot;I&#39;ve got so many questions! Things have been weird, and what is going ON with me?&quot; I found myself laughing as I realized, how real she felt, how solid. &quot;No, seriously Aunt Rowan, what&#39;s going on?&quot; I keep asking myself why I wasn&#39;t paniced or even terrified, but I doubt I&#39;ll ever know the answer.</p>\n\n<p>Her onyx hair lifted slightly with the breeze, the sun&#39;s firey red reflecting off it as she spoke, &quot;We will get to all of that soon enough Ryder,&quot; She placed her hands on my shoulders and squeezed, &quot;first we need to get down to business.&quot; As if on cue, a bench appeared behind her and she sat down, patting the place beside her. I quickly sat, eager to understand what this all was, what it meant. I looked to her with eyes ravenous for answers, despite trying to be patient.</p>\n\n<p>&quot;My love, you&#39;re not dreaming,&quot; she rose her hand to silence me as I started to protest. &quot;Your body is in bed, resting, but your mind is here with me.&quot; She patted my thigh as she explained, &quot;We are currently in Hell.&quot; Her words hit me like a freight train, my stomach dropped.</p>\n</div>\n","author":"Dykoramma"}