{"rank":"133","title":"Why you should turn your phones on silent mode","id":"8lir24","url":"/r/nosleep/comments/8lir24/why_you_should_turn_your_phones_on_silent_mode/","time":"1527076626000","body":"<div class=\"md\"><p>Someone somewhen somewhere made this research about the random feeling that your phone is either ringing or vibrating when it really isn’t. They coined the terms “phantom vibration syndrome” and “ringxiety” to refer to this phenomenon. You can google this outrage if you like. It’s true. You know it’s true.</p>\n\n<p>The effects of this condition are actually mild. Most phone users aren’t really annoyed by the weird feeling; one can totally get used to the notifications and might even long for it. For the rare few who are bothered, effects range from irritation to mood swings to acute bipolar episodes. Especially when you’re expecting an important message and you hear your phone ringing only to find out it was just the syndrome kicking in.</p>\n\n<p>The research said that to control this condition, one may transfer the mobile phone’s position from one place to another throughout the day, change the tone or vibration pattern from time to time, or simply silent the device.</p>\n\n<p>That is if you are NOT alone in a room with only the dim lights on when the anxiety arrives.</p>\n\n<p>Okay, this is the reason why you are reading this article right now. You have to survive. You have to get through the episode. To do that, here are what you should remember:</p>\n\n<ol>\n<li><p>Check your phone immediately. This step only applies if you have the phone in your person when the alert comes. Upon looking at your phone, you will either see an actual notification or nothing at all. Even if the latter occurs, the phantom vibration will still end. That’s how it works.</p></li>\n<li><p>In case your phone is not within your person such as when you placed it on the bedside table, a rather different approach is required. Why, you ask: because here is where the danger lies.</p></li>\n</ol>\n\n<p>Think. Think whether you’re expecting a call or not. Think whether your phone had been actually turned on or not. Think whether the volume of the ringtone or the tenacity of the vibration is reasonable or not. If the answer to these questions are all YES, then check your phone immediately. But if you get even one NO…</p>\n\n<ol>\n<li>Do NOT reach for your phone. Wait until the episode is over. Know that when someone really important is calling, that person will surely call a second time. Only then should you answer. But during the first notification when you get at least one NO on the previous questions, keep your hands on your side and simply wait. Breathe. Pray. But in no case move.</li>\n</ol>\n\n<p>There are two possibilities if you fail the third step. First, upon reaching for your phone, you’ll feel something brush your hand. As if someone—something—is reaching for your phone to answer as well. The second: if you manage to check your phone during this instance, you will see an incoming call displayed on your screen. You may decide to answer the call or not; it will not matter.</p>\n\n<p>The voices will arrive shortly.</p>\n</div>\n","author":"AdvancedAccounting98"}