{"rank":"0","title":"Stadler House: Book One: Chapter Nine","id":"8livxs","url":"/r/nosleep/comments/8livxs/stadler_house_book_one_chapter_nine/","time":"1527077898000","body":"<div class=\"md\"><p>Maggie sits rocking on her bed with a flashlight in her hands with terror on her face. She quickly moves the light around the room, “Hurry up, Stephen.” She jumps with the sudden crash and boom of lightning and thunder outside the group home. </p>\n\n<p>Maggie notices a shadow move along the wall and quickly points her flashlight in its direction only to reveal nothing. She exhales in relief, “Just the storm.” The bedroom door clicks and slowly unlocks. Maggie watches in horror as the door slowly swings open. </p>\n\n<p>“Stephen?” Maggie pleads. Maggie jumps when the door reveals Anna standing in the hallway just outside the door. Anna seems to glide slowly into the room as if carried along by a slow-moving air current, “are you okay, Ms. Maggie?”</p>\n\n<p>“I’m fine, but how did you,” Maggie watches Anna cross the room to the foot of the master bed. Maggie pauses feeling a sudden stabbing pain in her abdomen. Maggie moves off the bed and pauses to grab her stomach. </p>\n\n<p>“Did it hurt?” Anna rounds the foot of the bed towards Maggie. Maggie stares in shock as she notices Anna enters leaving a bloody footprint with each step. Maggie groans in pain, “Did what hurt?”</p>\n\n<p>Anna’s hair suddenly turns white and her eyes become soulless voids, “When they cut her from you?” Maggie watches unable to defend herself, “What are you talking about?” Maggie falls to the floor doubled over in pain, “Her who?”</p>\n\n<p>Anna glares at Maggie raising a single clenched fist and gesturing at Maggie, “Your child was murdered by the same doctor’s that saved you from bleeding out.” Maggie writhes in agony and pain as sensations of ripping and tearing come from her abdomen, “No, they said the baby was dead.”</p>\n\n<p>Maggie pulls a single hand away from her stomach as her pain intensifies. She stops when she sees that now blood covers her palm and her eyes widen in terror, “What the hell is happening?”</p>\n\n<p>Anna small mouth slowly twists into a vile and ghoulish toothy grin, “Both of you were ours.” Maggie slowly pushes herself up from the floor to her feet, “please go get Dr. Stadler I think something is very wrong?” A massive torrent of blood splashes to the ground from beneath her nightshirt.</p>\n\n<p>Anna twists her small fist in the air, “Your daughter misses her mommy.” Maggie quickly turns pale as more blood hemorrhages from her pooling on the floor beneath her. She gasps wide but cannot find the strength to speak. Maggie tumbles to the floor once again and begins crawling away from Anna.</p>\n\n<p>Anna watches Maggie trying to escape her, “Mother and Child should never be separated.” Maggie reaches the open door only to have the heavy wooden door pull from her weakens grasp and slam closed, “Why are you doing this to me?” </p>\n\n<p>“We are bored with explanations. Just die!” a Long shadowy tendril surge across the floor from the room’s closet. The tendril tears into Maggie penetrating her beneath the nightshirt. Maggie screams, “Stephen!”</p>\n\n<p>Maggie stops her scream as blood erupts from her mouth. The shadow tendril rips a large chunk of flesh away from Maggie’s insides dragging it from beneath her nightshirt. The tendril drags the flesh across the room to Anna side.</p>\n\n<p>From the shadows next to Anna forms a dog-like shadow creature that immediately moves to the lump of quivering flesh and starts to consume it.  Anna pats the shadow dog on the head encouraging it to continue. </p>\n\n<p>Two more shadow tendril lance from the darkness to Maggie seizing her legs and forcing them wide apart. Maggie feels hips rip from their sockets and screams, “Stop!” Anna glares at her and twists her fist again. Maggie’s body unleashes a violent torrent of blood and meat from beneath her nightshirt.</p>\n\n<p>Maggie’s face turns pale as more tendrils lash out from the shadows ripping deep into her flesh. Each tendril exacts a lump of quivering jelly-like flesh and drags it back to the shadow dog. The shadow dog is joined by more dog-like creatures that begin to fight over her insides.</p>\n\n<p>Maggie’s flesh loses its strength as she feels herself slipping into unconsciousness. She falls to her side watching as the tendrils continue to rip her apart piece by bloody piece feeding it to the shadow dogs. </p>\n\n<p>Anna smirks as countless shadow tentacles lung out of the master bedroom closet and seizes Maggie’s near lifeless body. “Take her already.” Anna declares loudly. She watches as in a swift single motion the tentacles yank Maggie’s body into the closet followed closely by the shadow dogs.</p>\n\n<p>The door to the game room burst open as an enraged Dr. Stadler storms in, “Rodney. John. Tyler. Who made the mess in the kitchen and did not clean it up?” Dr. Stadler quickly scans the room and sees no one. He shakes his head and moves to the end of the couch.</p>\n\n<p>He stops walking as he hears a wet crunching sound, “Storm’s getting bad everyone to the main house, now.” He turns cautiously to the darkened corner emitting the grotesque and sickening noises. He feels compelled to approach the darkness and does. </p>\n\n<p>“What the fuck!” Dr. Stadler discovers a shadow dog-like creature chewing on John’s remains. He becomes horrified and slowly backs away, “John!” The creature raises its head to examine Dr. Stadler only to return its full attention back to its meal. </p>\n\n<p>Dr. Stadler turns to flee and trips across Tyler’s remains, “Tyler?” The shadow dog turns to the doctor and snarls at him. It stops eating John and crosses the floor seizing Tyler’s body. It growls at Dr. Stadler then proceeds to drag Tyler next to John’s remains. </p>\n\n<p>Dr. Stadler burst into the kitchen through the back-door and turns to slam it shut. He immediately locks the door behind him, “the fuck was that thing.” He searches his thoughts for a rational answer to what he witnessed.</p>\n\n<p>Dr. Stadler jumps with fright when he hears a Rodney’s muffled voice come from the refrigerator. He bound to the refrigerator and snatches open the old appliance door. “Rodney?” he watches startled as Rodney tumbles out.</p>\n\n<p>Dr. Stadler kneels next to the young man and checks to make sure he is still breathing, “thank god!” Rodney coughs and gasps for air, “Anna?” Dr. Stadler tries to comfort the teen, “I haven’t found her yet.”</p>\n\n<p>“We got to get out of here, Doc. She’s the one who locked me in the refrigerator,” Rodney pleads. “She’s just a little girl, Rodney,” Dr. Stadler tries to remind the teen. Rodney shakes his head defiantly, “No! She’s Not!” Dr. Stadler looks confused by his confession.</p>\n\n<p>“She got into my head,” the color returns to the young man’s face. Rodney points to his head, “She got into my head, Doc. She made me see the accident all over again.” Rodney lowers his head, “I watched them die all over again, “She kept telling me it was all my fault.”</p>\n\n<p>“Either way we got to find her. There is something in the house and it has killed Tyler and John,” Dr. Stadler assault the young man with news of his discovery. Rodney weeps immediately, “What How?” Dr. Stadler gestures to the Game room door, “We need to get everyone out of her right now!” </p>\n\n<p>Dr. Stadler helps the young man to his feet. They jump startled when something crashes hard against the inside of the Game Room door next to them. Sounds of something clawing and digging against the door send them fleeing from the kitchen.</p>\n\n<p>Upon reaching the staircase Dr. Stadler turns Rodney to face him both men’s faces are full of fear and terror. “Meet me outside. I have to get Maggie and Emily out of the house.” Rodney shakes his head at the words, “If you run into Anna.”</p>\n\n<p>“I’ll get her out too,” Dr. Stadler offers as he starts his ascent of the staircase. “No,” Rodney interrupts, “Run.” Dr. Stadler lowers his head and continues up the staircase. Rodney searches his feeling for a long moment.</p>\n\n<p>The sound of a door splintering echoes from the kitchen. Rodney offers not second for the evil to reveal itself to him. In a flash, the young man sprints through the hall and out the front door to the group home. </p>\n\n<p>Rodney stops once on the lawn far from the front of the house. He looks back to the group home and spots Anna glaring at him from the master bedroom window. A Chills run down his spine as the demonic form true form of the creature dwelling in the girl reveals itself during a brilliant flash of thunder. </p>\n\n<p>“Doc, be careful she’s in your room!” He screams refusing to re-enter the building. He stops yelling as he hears the sounds of low guttural animalistic growls surround him just beyond the reach of the poach lights illumination.  He leaps from the lawn and sprints down the poorly-lit path leading away from the group home. </p>\n</div>\n","author":"roger75lee"}