{"rank":"2566","title":"Trust the Men on Craigslist","id":"8lizsr","url":"/r/nosleep/comments/8lizsr/trust_the_men_on_craigslist/","time":"1527078931000","body":"<div class=\"md\"><p>If you’re going to judge me for meeting a stranger on Craigslist, I’d prefer that you stop reading right now. </p>\n\n<p>I live with enough <em>internal</em> judgment as it is. </p>\n\n<p>I was twenty. I had a used 1999 blue-green Toyota Corolla, social anxiety, and $19.13 in my bank account. It was the first semester of my junior year at Carleton College, and there were half a dozen get-togethers every weekend that I was running out of excuses to avoid.</p>\n\n<p>So I decided that babysitting would be the <em>perfect</em> way to spend my Friday nights. </p>\n\n<p>The thought of spending my weekend nights all alone, studying, while making nine dollars an hour soothed my neurons more than I could possibly say.</p>\n\n<p>Don’t judge me. You don’t know my life.</p>\n\n<p>So when I found Amy on Craigslist, everything seemed perfect. Chloe was five, Ivan was in his terrible twos. Get it?</p>\n\n<p>After a week of email and text exchanges, I felt like I really knew her. She was 33 years old and a stay at home mom who was itching to get back into the workforce. “You’re perfect,” she had disclosed several times via text.</p>\n\n<p>Nothing seemed sketchy. And if you can’t make a leap of faith at least once in a while, doesn’t that make for a miserable and empty existence?</p>\n\n<p>*</p>\n\n<p>I was the consummate professional. I had a pantsuit and everything (yes, I was wearing Converse to a job interview, but it was kid-friendly), and I was ready to charm the shit out of those fucking kids. </p>\n\n<p>I pulled the Corolla in front of the house at 7:30 p. m. for the 8:00 interview, then sat and stared out the windshield for twenty minutes before walking in ten minutes early. Because, you know – the anxiety. </p>\n\n<p>It was already dark by that time in the Minnesota October, and I slipped my way up the frozen cement walkway in an oversized parka and mittens. I ran the doorbell with my thumb and waited. As I watched my breath rise up in plumes, I imaged all the bad things that might be happening behind that door. I couldn’t help it. </p>\n\n<p>I was relieved when it finally opened, and extremely tense when it wasn’t Amy.  </p>\n\n<p>Unless Amy was a baby-faced man-child with a creepy smile. </p>\n\n<p>He stared at me, pale-faced, for several awkward seconds. Then his eyes started to gravitate past my neck, and toward my chest. </p>\n\n<p>“Um,” I stated awkwardly.</p>\n\n<p>His eyes snapped back up to mine, and he offered a delighted smile. “Come on in. Um, Amy, she’s my aunt, and she’s in the back with Chloe and Ivan.”</p>\n\n<p>I watched the steam rise in front of me as I breathed a sigh of relief. He knew everyone’s name. That meant he could be trusted.</p>\n\n<p>Right?</p>\n\n<p>I walked into the house, past the staircase, and he snapped the door shut behind me.</p>\n\n<p>It was a pretty nice place, to be honest. He walked past me, deeper inside, without offering to take my coat. I waited for a beat, then took it off, looked around, and left it on the floor. </p>\n\n<p>I really didn’t want to inconvenience anyone by asking where I should put it.</p>\n\n<p>I kept the mittens on, because my pantsuit had no pockets.</p>\n\n<p>Trotting quickly, I followed him into the kitchen. We went through and came out into a living room, where he sat down on the couch. He patted the cushions next to him. I froze in place at the thought of sitting next to a stranger. </p>\n\n<p>After an uncomfortable silence, I finally addressed the stranger (which I hate doing). “So…. will I be meeting the kids tonight?” I paused. “Because, I, ah…. thought I’d be meeting the kids tonight.”</p>\n\n<p>I was an eloquent speaker.</p>\n\n<p>“Amy wants you to interview with me,” he said in voice that tried to be smooth, but was just creaky.</p>\n\n<p>He licked his lips.</p>\n\n<p>“I have to pee!” I announced chipperly. “Which way?”</p>\n\n<p>The man-child looked genuinely confused. “Ummm. It’s the room with the toilet in it.”</p>\n\n<p>This raised an alarm. One of the very uncomfortable things about social anxiety is knowing that there is <em>sometimes</em> legitimate anxiety that needs to be separated from the things that my friends “see” to placate me. </p>\n\n<p>Do you know that feeling you get when you’re about to encounter an ex (who you’re totally over but not really), for the first time in months, knowing that he’ll be showing up with another woman? Combine that with looking over the edge of a three story roof while watching a kid faceplant on the concrete and knocking out his front teeth. <em>That’s</em> the level of anxiety that consumes me when I can’t control it. </p>\n\n<p>I couldn’t control it in that moment.</p>\n\n<p>I tried to think of something to say, but just gave up and walked out of the living room. </p>\n\n<p>The bathroom is the sanctuary of the anxiety-stricken, so I darted my face all around the house in search of one. My eyes landed on a hallway lined with photos, so I headed in that direction with the hopes that it would lead me out of sight.</p>\n\n<p>I was walking through the hallway when I stopped. </p>\n\n<p>The photos on the wall were all of the same family. </p>\n\n<p>They didn’t look much like the man-child at all. </p>\n\n<p>A couple who looked to be in their sixties was featured in every one. They were probably twenty years past childbearing age, with flecks of white in their hair. Both were thin and black, which stood in stark contrast to the round-faced, pale man-child in the living room. Three children appeared in various photos with them, all of whom were in their late teens.</p>\n\n<p>I thought about the living room.</p>\n\n<p>There were no toys.</p>\n\n<p><em>Chole is five</em> </p>\n\n<p>I looked to the blank white fridge. There were no drawings stuck to its surface.</p>\n\n<p><em>Ivan is two</em></p>\n\n<p>There was no baby gate at the staircase.</p>\n\n<p><em>You’re perfect</em></p>\n\n<p>And that’s when my anxiety went into overdrive. I would have had to go past the living room to exit through the front door, so instead I turned an trotted down the hall. I think that I heard man-child stand up, but I wasn’t interested in sticking around long enough to find out how much of it was my own imagination. </p>\n\n<p>I emerged into a small room with tall vases on the floor <em>that’s kid-friendly</em> and realized I was at the end of the house.</p>\n\n<p>There was no back door.</p>\n\n<p>I tried to open the window, but it was locked. I fumbled with the hitch. I couldn’t use my fingers with the mittens binding them, and was unable to open it. My panicked mind told me <em>I don’t have time to take off the mittens</em> while I <em>definitely</em> heard a man-child walking through the house and I <em>finally</em> grasped the hitch and it slooooowly spun around until the window was unlocked and I pushed and pushed and pushed until it finally opened in a <em>whoosh</em> of cold air.</p>\n\n<p>I climbed into the frosty night, but my Converse caught something on the way out. </p>\n\n<p>I don’t <em>know</em> if it was the sill, or if it was a hand.</p>\n\n<p>I tumbled on to the ground, lay still for half a second, and scrambled to my feet.</p>\n\n<p>This was the backyard. I was still far away from my car. Shit.</p>\n\n<p>I ran around the side of the house, trying to stay quiet. Instead, I knocked over a trash barrel. A cat screamed. Dammit.</p>\n\n<p>As I moved forward, the Corolla began to emerge in the distance, and I started running toward it. That was a mistake.</p>\n\n<p><em>Man,</em> was that ground icy. Who knew that a tailbone could hurt so much when it hit the floor?</p>\n\n<p>I got up and walked briskly, my feet sliding every which way along the frozen concrete, as I approached my car. </p>\n\n<p>My hands were rattling from cold, nerves, and pain. I tried to get my key through the lock, but it wouldn’t go in. Tears streaming, I pinched the tip, aimed it at the keyhole, and forced it.</p>\n\n<p>Goddam Value Edition Corolla with no remote locks.</p>\n\n<p>I opened the door, threw myself in, started the car, and peeled away without waiting for the engine to warm up. </p>\n\n<p>Three blocks away, I was about ready to give myself permission to cry.</p>\n\n<p>The sensation of <em>wrongness</em> hit me then, but it took a second to understand why my spatial orientation was off. </p>\n\n<p>There wasn’t supposed to be a head in the back seat reflecting from the rearview mirror.</p>\n\n<p>I screamed and turned the car toward a tree. </p>\n\n<p>The crash wasn’t bad, but the airbags deployed. Given the speed I’d been going, it didn’t hurt any worse than my tailbone did.</p>\n\n<p>I pushed open the car, dropped to the ground, and threw up. Once my gut was clear, I sprinted into the woods and hid in the shadow. </p>\n\n<p>After five minutes had passed, I was about ready to admit that I’d imagined the head in the mirror. I had stood up and taken one step forward when the rear, driver-side door opened. </p>\n\n<p>A shadow stepped out, slammed the door behind it, and walked away down the road.</p>\n\n<p>Two hours passed before the fear of hypothermia finally coaxed me from my hiding spot. I had left my parka in the house. </p>\n\n<p>I never told the police about the man in my car. Who would have believed me? Facing the inevitable skepticism was more than I could bear. I said that a cat had run in front of me, and that I’d steered toward the tree in an attempt to avoid it. </p>\n\n<p>My anxiety had forced me to plan ten (yes, ten) contingency stories for the police if they asked too many of the wrong questions. </p>\n\n<p>In the end, though, they simply decided that my car was safe to drive, flipped their notebook into a pocket, and left.</p>\n\n<p>I drove straight to my dorm room and stayed there until classes resumed on Monday. I peed in a Gatorade bottle because I was afraid to open the door. My borderline anorexia stormed past its threshold, and I actually felt better skipping meals for three days. </p>\n\n<p>I told myself that it was better to keep secrets.</p>\n\n<p>That no one would believe me.</p>\n\n<p>That even if someone did, it wouldn’t do any good. So there was no risk worth seeming crazier than I already was. </p>\n\n<p>It helped me to sleep at night. </p>\n\n<p>For thirteen days.</p>\n\n<p>At the end of October, a woman named Katherine Ann Olson tried to meet Amy from Craigslist for a babysitting gig.</p>\n\n<p>Amy wasn’t real.</p>\n\n<p>But Michael John Anderson was. He murdered Katherine when she arrived. He’d been planning it for some time.</p>\n\n<p>Michael will spend the rest of his life in jail, God willing. </p>\n\n<p>It’s impossible to forgive myself for keeping my story a secret. The knowledge that I was so close to dying – and saving someone else in doing so – has set fire to every nerve in my body. I had to drop out of school. </p>\n\n<p>I was never able to drop back in. </p>\n\n<p>That night has shattered my life. Paranoia, fear, and guilt are as omnipresent as sound and light. </p>\n\n<p>In a way, I’ll spend the rest of my life in <a href=\"https://www.facebook.com/P-F-McGrail-181784199029462/\">jail, too.</a></p>\n\n<p><a href=\"https://www.reddit.com/r/ByfelsDisciple/\">BD</a></p>\n</div>\n","author":"ByfelsDisciple"}