{"rank":"1250","title":"Now hiring: last three employees killed themselves","id":"8lj749","url":"/r/nosleep/comments/8lj749/now_hiring_last_three_employees_killed_themselves/","time":"1527080754000","body":"<div class=\"md\"><p>12 weeks looking for a job and things were getting desperate. I’m talking water-and-electricity-off desperate, with the landlord playing my door like a drum. </p>\n\n<p>I called my way through entire directories of offerings, often not sure what I was interviewing for until the morning of. I’d get three or four meetings on a good day, but nothing stuck until the excessively tan man from Mello Corp shook my hand. </p>\n\n<p>“You’ve made a good decision,” Cameron had said, pulling me in a bit too close. “Employees at Mello Corp are like a big family. They all stay for life.” </p>\n\n<p>I wish I’d gotten a chance to clarify what my actual responsibilities were. I just saw a salaried position and a plush dark-wood office, and that was good enough for me. It didn’t help that Cameron only described the requirements in vague generalities about loyalty and teamwork. Even the liability forms didn’t help — just a flash of an official letterhead and it was whisked away, leaving me nodding and smiling. </p>\n\n<p>Truth is that I don’t have much respect for office jobs. I figured a week laying low and Googling things would teach me everything I needed to know. So far so good — few days in, and I’d spent it all coasting around chatting with people. I was given some menial cleaning tasks, and a few organizing and carrier jobs, but mostly I was free to just watch and learn. </p>\n\n<p>It seemed to be a delivery company, although they only shipped one product. No-one ever mentioned what the product was, and I didn&#39;t want to betray my ignorance by asking. Few dudes in their late thirties said they’d been here over 15 years each though. First and last job they’d ever take. The two women working the phones were both 10+ years, and another guy upstairs said he&#39;d been here over 40. </p>\n\n<p>Cameron wasn’t joking about the commitment. The funny thing is though, no-one seemed the least happy or boastful in announcing their sentence. There wasn’t any small talk in the break room, no affectionate nicknames or the inside jokes you’d expect with such long camaraderie. </p>\n\n<p>All eyes were sullen, tracing patterns in the uniform carpet. Muffled voices, drudging steps, smiles that gave up before they started. </p>\n\n<p>“I don’t get it,” I casually threw out to one of the guys. “Why does everyone stay so long if they don’t like it here?” </p>\n\n<p>“They don’t all,” he said, not quite meeting my eyes. “Last three with your job killed themselves to get out early.” </p>\n\n<p>I gave him a big grin, sucking up to show I appreciated his joke. His deadpan face betrayed nothing. My grin slowly faded as we sat together in silence, him shuffling one foot against the other. Then he left, and I was left standing wondering what the hell was going on. </p>\n\n<p>I can’t imagine myself in this gloomy place for 10, let alone 40 years. I resolved to keep applying to jobs and only work here until I found something better. Besides, I sort of enjoyed the thrill of the hunt, and this place was snooze-ville. </p>\n\n<p>I wish it had stayed that way. Few days later and I was making my first outside delivery. Blank cardboard package, about the size of a cake. I was bored waiting to receive it, then bored waiting in traffic. I was bored when I rang the doorbell, and bored when she opened the package. And then something started buzzing. And it wasn’t boring anymore.</p>\n\n<p>Wasps were flooding into the air, and they resented their captivity with a vengeance. The sound magnified within seconds until it was all I could hear in every direction. I did what any sane person would do: scream like a little girl and run as fast as I could without looking back. Only I did look back — about a hundred feet down by my car. When I noticed the buzzing had all stayed there around the woman. </p>\n\n<p>She wasn’t screaming anymore. Her throat had swollen shut, bulbous swellings covering her face and neck. She still flailed around with her arms and legs, but the movements were getting more sluggish with every vain stroke. The things were crawling through her hair, up her dress, even into her open mouth. </p>\n\n<p>I&#39;ve seen allergic reactions before. There was a kid in my middle school who ate a peanut and turned into a balloon animal, but it was nothing like this. I don&#39;t know if the wasps were purposefully stinging the same spots around her face and neck or if that&#39;s all I could see, but the swellings seemed to stack on top of each other, one grotesque swelling budding off the last. </p>\n\n<p>First things first, and I vomited. Then I wiped my mouth, got in the car, and made sure all the windows were rolled up. By then my phone was ringing: </p>\n\n<p>“Now you really are family,” Cameron’s voice was a ray of unwelcome sunshine through a dreary morning.</p>\n\n<p>“You knew? What was inside, you knew about the —” </p>\n\n<p>“They’re magnificent, aren’t they? Put someone’s scent in the box, starve them a little, and then that’s the only one they’ll hunt.” </p>\n\n<p>“You’re absolutely insane. I know where you work. I’m calling the cops and —” </p>\n\n<p>“Smile for the camera, won’t you?” he interrupted. </p>\n\n<p>“Huh?” I looked up and down the street. A blinding flash. One of the guys from work was standing outside my window with a camera. He gave me a thumbs up and took another picture. </p>\n\n<p>“That will go well with the live video,” Cameron said. “Combine that with the signed confession you have plotting and executing her murder —”</p>\n\n<p>“I didn’t sign —” </p>\n\n<p>“Are you really sure?” </p>\n\n<p>It didn’t matter what I tried to say. It was caught in my throat anyway. </p>\n\n<p>“You have a break until 1, then two more deliveries in the afternoon.” </p>\n\n<p>The phone cut off. </p>\n\n<p>Well I’d love to explain more, but my break is almost over and Cameron is very clear that he doesn’t like lateness. Maybe I&#39;ll leave early instead, <a href=\"http://tobiaswade.com\">like the others.</a> </p>\n</div>\n","author":"TobiasWade"}