{"rank":"692","title":"Copycat","id":"8ljgq0","url":"/r/nosleep/comments/8ljgq0/copycat/","time":"1527083076000","body":"<div class=\"md\"><p>My husband is a good man. He&#39;s loyal, hardworking, and so many other things that come together just to form the word, decent. A decent man. Cops get a tough rep these days but my Danny is a diamond in the rough. Every case, every victim is personal. Danny doesn&#39;t turn up in the morning for his paycheck; he turns up to help out those in need, to find them their justice. He&#39;s got this deep passion for doing good, and protecting and serving is what gets him out of bed in the morning.</p>\n\n<p>Unfortunately, in today&#39;s world, all those traits that make Danny the perfect cop are exactly why his job is always under fire. We live in a capitalist society, where the justice people receive is dictated not just by their plight, but by their class, their relevance and the size of their pockets. Nobody wants to invest their resources in solving the case of the dead homeless man, not when there are bigger and more important people pulling more headlines. Nobody but Danny. You know those cliché scenes you see on cop movies, where the troubled protagonist heaves home with a box of files and notes and bits of evidence, to spend every waking moment at home poring over their cases, driven by the fire burning in their eyes to stop crime and save lives? That&#39;s my Danny, camping out on the dining table in our little kitchen well into the night to try and find that missing piece.</p>\n\n<p>I see a dedicated, strong, good man. His captain sees someone who wastes time, wastes resources and doesn&#39;t let go when he needs to. If they could take him out of field work, put him at a desk job and stop him pursuing cases, they&#39;d do it in a heartbeat. The only thing keeping him out of that is the Copycat.</p>\n\n<p>The Copycat is a serial killer unlike any I&#39;ve ever heard of. Every killer has their own signature - a weapon of choice, a target demographic, a favoured means of torture. The Copycat&#39;s signature is their lack of defined signature. Instead, they work by imitation. The first Copycat kill took place on the outskirts of town. The victim was Tina Lamont, daughter of an influential political figure. She was visiting whilst her dad spent a few days liaising with our mayor over a local charity effort they were working on together. Tina disappeared on the second day of Mr Lamont&#39;s visit, and was found on the third. It took days to work out the motive behind her murder; her dad was well-liked, or as well-liked as any politician can be. The kill was sloppy, a gruesomely slit throat and a body dumped on the ground on the outskirts of a forest, with no effort to hide it. Most odd was the outfit Tina wore - a garish, dirty lingerie set, all red and black lace. Miles apart from the dignified persona she usually presented. The case was national news, and had investigators all over it.</p>\n\n<p>Danny was the one who cracked it. He&#39;d been working overtime on a case recently, a prostitute who&#39;d been murdered and dumped just a few weeks before. The victim, Jessica, had been seen by her friend getting hired by a sketchy-looking patron, and disappeared shortly after. Naturally, Danny was the only one who cared enough about Jessica&#39;s case to notice that Tina&#39;s case was almost identical. Tina had similar facial features to Jessica, and the same long brunette hair. The outfit found on Tina&#39;s corpse was an uncanny match for the one Jessica had been wearing when she died. They were killed in the same way, and dumped in the same spot. </p>\n\n<p>Suddenly, Danny was the middle of an investigation, instead of being pushed to the side. He had the evidence, the investigation history, the intel on Jessica&#39;s case to contribute to Tina&#39;s. It was almost laughable how stark the difference was between the two cases - murdered in exactly the same way, and yet Jessica&#39;s investigation only mattered if it helped to solve Tina&#39;s. Danny hated the injustice it carried, but he also saw the opportunity to find justice for both girls, so he ploughed through it.</p>\n\n<p>And so it continued, and has continued, for the last 3 months. The Copycat has struck 7 times now, each time taking the life of someone newsworthy, imitating the death of someone brushed under the carpet. Danny&#39;s career has been blooming ever since, and he&#39;s leading the hunt for the Copycat. His investigative skills, paired with his compassion and deep interest in all of the cases, have propelled him to centre stage. And still he works so hard, so carefully and diligently to try and finally catch the Copycat. He still spends his time off obsessing over that dining room table covered in evidence.</p>\n\n<p>That&#39;s how he is now, hands working hard over the paperwork spread over his workspace. I give his shoulder a squeeze, and he smiles up at me with tired eyes.</p>\n\n<p>&quot;How&#39;s it going, honey? Any closer to catching him?&quot; I slowly rub his shoulders as I speak to him, I can feel the tension built up in his muscles. </p>\n\n<p>He sighs. &quot;Every time I think I&#39;ve caught him, he slips out from under me. I&#39;m missing something, but I just don&#39;t know what.&quot;</p>\n\n<p>I keep massaging him, and rest my chin on his head, inhaling the smell of his hair. &quot;I&#39;m sure you&#39;ll get there love, I know you can.&quot; I feel the slightly movement in his head as he smiles.</p>\n\n<p>&quot;Thank you, baby. I&#39;ll catch this bastard one way or another.&quot;</p>\n\n<p>He doesn&#39;t speak to me for a while after that, but I don&#39;t blame him. I know how he gets when he&#39;s hard at work. I have plans tonight anyway, an evening yoga class and a few drinks with my girlfriends. I know Danny will be all tied up for a few more hours, so I don&#39;t need to disturb him again.</p>\n\n<p>I get out to my car, and pull out of the drive slowly. There are so many bumps in this road, and I can&#39;t bear the squeak of my car&#39;s back end when I hit them too hard.</p>\n\n<p>I&#39;m early to yoga class, but it doesn&#39;t matter. I have one quick stop to make before I get there. I pull into the alleyway; it took me ages to find on a local map, being in one of the worst parts of town and hardly a tourist hotspot. </p>\n\n<p>The squeak in the back of my car is still audible, and it&#39;s getting louder. Thankfully, this alley is deserted, lined only with derelict buildings. I pop open the trunk and his expression contorts in panic, his voice muffled to a squeal by the duct tape keeping it shut. The same tape binds his wrists and ankles tight.</p>\n\n<p>Just over a week ago, down this same alleyway, a corpse was found. Robert Tanner was a drunk, abusive alcoholic with an estranged wife and two kids who hated him. He&#39;d been found slumped beside a large, industrial garbage bin, with a stab wound in his throat, not unlike Tina and Jessica all those months ago. That was ideal - I&#39;m no expert, and learning new techniques isn&#39;t easy. Robert hadn&#39;t caused much of a stir, the only family he did have were less than interested in caring about how he died. Nobody had bothered to press further. Nobody but Danny. </p>\n\n<p>The details of the case were easy to get ahold of, spread in my kitchen as they were. I even saw a picture of the corpse how it was found, taken during initial investigation. Kevin Dueler, one of the biggest local names in accounting, matched Robert&#39;s size and facial structure, and even wore his hair the same way. I don&#39;t know how easy it was to stab Robert, but Kevin was a breeze. I&#39;m good at this by now; I&#39;ve figured that it&#39;s much easier to kill a man when he&#39;s bound and gagged. Theres much less screaming to cover up, and I can take my time. Once the blood stops running I untie him, and arrange him in the same slumped-over manner I saw in that photograph. </p>\n\n<p>My work is done, and I&#39;m not even late for yoga. I stand back a while and admire my handiwork. I&#39;ve really come to appreciate the beauty in this kind of art. Red on pale white, slowly turning blue. The flexibility of the body as it cools, so easy to manipulate. A pretty price to pay for the man I adore.</p>\n\n<p>My husband is a good man, who works hard to do what&#39;s right. As long as the Copycat keeps killing, he gets to do what he loves without those asshole bosses of his trying to undermine his ethics. As long as he has me, his doting wife, his job is safe, and so is our livelihood. I love you, Danny.</p>\n</div>\n","author":"humhallelujahh"}