{"rank":"290","title":"How to get to Hell","id":"8ljhzx","url":"/r/nosleep/comments/8ljhzx/how_to_get_to_hell/","time":"1527083379000","body":"<div class=\"md\"><p>I knew I was involved with some unsavory individuals. I didn’t need my years of experience as a homicide detective to figure that much.</p>\n\n<p>Pentagrams, clandestine meetings, and the constant iron smell of their blood-soaked clothes.</p>\n\n<p>I was okay with our arrangement. I kept the rest of the police force off their trail, destroyed evidence, muddied crime scenes. </p>\n\n<p>Until this morning we had what I considered a nice, working relationship. I took their money, did what my contact asked of me, and didn’t ask questions.</p>\n\n<p>I’d let a lot of things slide. Neighborhood kids disappearing. Calls from “Bruce” in the twilight hours to help clean up their mess. Hell, they even dented the fender on my Cadillac once after using it in one of their “rituals” without my permission.</p>\n\n<p>When they killed my Granny, though… they went too far. I walked in to find her on one of their signature upside down crosses. </p>\n\n<p>Of all the horrible things at the scene, it was the cheeky blood-graffiti on the wall of her living room that really sent my blood pressure through the roof.</p>\n\n<p><strong>THE OLD WOMAN IS DINING IN HELL</strong></p>\n\n<p><strong>IF YOU DON’T LIKE IT</strong></p>\n\n<p><strong>GO FLUSH YOURSELF</strong></p>\n\n<p>I wanted to smash every piece of glass in the house, but I held my peace. </p>\n\n<p>This was Granny’s house, and she does not tolerate tussling, horseplay, or violence of any kind. If I broke so much as a coaster, she’d shove the feet of her walker up my ass, tennis ball and all.</p>\n\n<p>I have to go after her.</p>\n\n<p>I guess I’m going to miss my daughter Allison’s birthday party today. My ex will bitch about it later I’m sure, but this is kind of an emergency. One simply must not waste time when his Granny’s been damned. </p>\n\n<p>I add “make it up to Allison” to the to do list, and start gathering the supplies.</p>\n\n<p>Flashlight?</p>\n\n<p>Check.</p>\n\n<p>Rubber waders?</p>\n\n<p>Check.</p>\n\n<p>Knee length boots?</p>\n\n<p>Check.</p>\n\n<p>Baggie of fish food?</p>\n\n<p>Check.</p>\n\n<p>Roll of quarters? Slab of bacon? Bottle of Ménage à Trois merlot?</p>\n\n<p>Check, check, and check.</p>\n\n<p>Everything on Granny’s list. Most of it I know what to do with, but I’ve never understood the wine. Still… I can’t help but feel like I’m forgetting something.</p>\n\n<p>Considering the urgency of the situation, though, I decide I’d better just go. I don the waders, boots, and backpack stuffed with the other supplies and head to the bathroom.</p>\n\n<p>I step into the toilet.</p>\n\n<p>You know that feeling you get sometimes when you close your eyes in the shower and lean in to rinse off your face wash? When hot water is spraying directly onto your face, you can’t see, and you get that creeping feeling like something is coming for you? </p>\n\n<p>That feeling like you’d better open your eyes and turn around to see what’s watching you?</p>\n\n<p>You get that feeling for a reason.</p>\n\n<p>You see, water isn’t just a good conductor of heat and electricity. Those are physical forms of energy, but it conducts spiritual energy as well. So the reason you feel that way under the water with your eyes closed is that - in those moments - <em>something really is out to get you.</em> </p>\n\n<p>Without the water, your spidey-senses are too dull to pick up on it. And with your eyes open you’re too distracted by the physical world around you.</p>\n\n<p>So I step into the toilet. I close my eyes. I pull the handle, and down I go, falling forever until I finally land with a dull splash.</p>\n\n<p>When I open my eyes I’m not in Granny’s bathroom anymore. I’m in the dark. I fumble through my bag for my flashlight. When my groping hands find it, I press the button to light up my surroundings. </p>\n\n<p>It’s been a while since I’ve been down here, so I’m having trouble getting my bearings.</p>\n\n<p>No black sludge. Damn. I missed the industrial district, which is the most direct path. No flushed pacifiers or other random objects, so it wasn’t the housing district either. <em>Yesssss.</em> I won’t have to deal with the fucking zombie goldfish pond this time.</p>\n\n<p>Judging by the smell of coffee-scented piss overwhelming my olfactory senses right now, I’m somewhere under the center of the city, where the white-collar businesses are. Somehow the acrid coffee aroma lingers just behind the more prevalent smells of excrement.</p>\n\n<p>You know how they say the road to Hell is paved with good intentions?</p>\n\n<p>It’s actually paved with six to eight inches of piss and shit, and it’s not a road at all. It’s a sewer system.</p>\n\n<p>God, it <em>reeks</em> down here. I kick myself for leaving my own addition to the supply list - nose plugs and Vicks VapoRub - at home. I knew I was forgetting something. </p>\n\n<p>Oh well, no use crying over spilled milk (or spilled coffee piss).</p>\n\n<p>I trudge on for a mile or so, and the pool of human muck grows deeper and danker. It’s nearly up to my chest when I have to stop and brush aside a particularly nasty diaper that smells like old curry and hot lava had a baby and that baby then took a massive, black dump.</p>\n\n<p>To keep it dry, I’m holding my pack with arms raised above my head. I can’t go much further until I’m literally swimming in shit. I’m brave, but I’m not that brave. </p>\n\n<p>I stop and listen.</p>\n\n<p>After a while I hear a faint splashing in the distance. Evenly spaced echoes of something approaching in the dark. As the sounds grow closer, my flashlight begins to dim then goes out completely. I toss it aside. No use carrying it any further. They never work past here.</p>\n\n<p>As the ominous, rhythmic splashing continues I see a dim glow begin to light up the tunnel far ahead. </p>\n\n<p>The dark blue light expands as its source grows closer. I see a large shape approaching, gliding gracefully over the water. As it grows closer, I can see that it’s some sort of gondola, rippling over the piss and filth with the inevitable approach of death itself.  </p>\n\n<p>Aboard the vessel is an enormous, hooded man with sunken eyes, weary from his rowing and clearly displeased about his journey toward the distant shore being disturbed. </p>\n\n<p>The Ferryman lowers his paddle, displacing the filth-water and slowing himself to a halt. He reaches out to me with a gaunt and bloodless hand and spreads his bony fingers open with his palm facing upward.</p>\n\n<p>I rifle through my pack as best I can with it held aloft above the waves made by the rocking of the boat. My hand finds the roll of quarters and I toss it up to him.</p>\n\n<p>He catches it and greedily rips the roll open, quickly scanning through its contents. His sallow eyes light up and he excitedly holds one coin out for me to see. </p>\n\n<p>It’s a Kansas buffalo quarter. Limited edition. He tosses the rest of the quarters into the sewage, but he tucks the buffalo carefully into the folds of his robe.</p>\n\n<p>“Yeah, I knew you’d like that one. When I found it, I saved it just for you.”</p>\n\n<p>The Ferryman wordlessly wipes the back of his hand across his eyes. Then he puts both his hands together - as if he is praying - and shakes them briefly in my direction. </p>\n\n<p>I think he likes my offering.</p>\n\n<p>He must, because he reaches down and grabs me under the arms, lifting me into the gondola as easily as a parent lifts a small child overhead.</p>\n\n<p>I feel a twinge of guilt at the thought. I&#39;d never missed one of Allison&#39;s birthdays before.</p>\n\n<p>The Ferryman lowers his massive paddle again, and the vessel takes off in the same direction I came from.</p>\n\n<p>He’s not taking me back to Granny’s, though. The scenery changes now that I’m in the boat. </p>\n\n<p>By some morbid magic the Ferryman has taken me out of the sewer, away from the stink, and onto the still, obsidian waters of a fathomless lake.</p>\n\n<p>He’s taking me with him, to his one and only destination. The same place he takes all the souls of men when our time has come. The other world. The next one.</p>\n\n<p>I relax and enjoy the ride. This has always been my favorite part of the trip, and it seems like ages since I saw these waters last. </p>\n\n<p>The bewitching light of our lantern fills a cavern which few among the living have ever seen. I won’t share its secrets with you. I don’t want to rob you of the wonder you’ll feel when your time comes and you see them for yourself.</p>\n\n<p>I interrupt my awestruck staring only once to bend and pick a bioluminescent, otherworldly lily that floats by, being careful not to touch the water in the process. Allison will surely forgive me for missing her party when she sees this. </p>\n\n<p>I return to my vigil. Tirelessly, my guide rows onward until our destination comes into view.</p>\n\n<p>We make a gentle landing, and the Ferryman motions for me to depart. I thank him and step out of the boat onto the shore below. As he pushes off and heads back into the distance, the light from his lantern begins to recede with him.</p>\n\n<p>I waste no time, frantically scanning the sand as far as I can see by the waning, blue light. </p>\n\n<p>I thought I might be in the clear this time, but - just before my world is again encased in total darkness - I see what I’ve been searching for. </p>\n\n<p>Footprints in the sand.</p>\n\n<p>I wasn’t alone here.</p>\n\n<p>I hold my pack in front of me, clutching it tightly to my chest. I can’t afford to lose its contents in this dismal abyss, where they might never be recovered. </p>\n\n<p>I walk on, carefully placing one foot in front of the other trying to keep as straight a line as I can with the water at my back.</p>\n\n<p>Fun fact: Humans have a tendency to wander in circles when left in the dark. You could easily lose your way in the darkness and end up right back at the water. </p>\n\n<p>Exhausted and thirsty from your journey you might even be tempted to drink from it. Some have tried, and those never made it a step further.</p>\n\n<p>With the helpless claustrophobia of being trapped in the silent blackness creeping subtly in, It wasn’t hard to imagine being lost down here forever. </p>\n\n<p>I tried to push that terrible thought far away, reminding myself that I’d made this journey before when – as if to make a point – my shuffling foot struck something hard, protruding from the sand, and I fell to the ground, spilling the contents of my pack in the process.</p>\n\n<p>I reached blindly about, crawling on hands and knees. Thankfully, I found the wine bottle before it rolled too far. The fish food I could do without. But those footprints earlier said I&#39;d need the bacon…</p>\n\n<p>Growling. Growling in the dark.</p>\n\n<p>It rumbled throughout the cavern, echoing over the water and shaking the ground beneath me. I felt the loose sand cascading over my hands as my searching grew more and more frantic.</p>\n\n<p>Then the barking starts, just meters ahead of me. Those awful, loud canine sounds. I count at least five distinct voices. These are not barks of alert or of welcome, but of warning… This is their territory, and I am an unwelcome intruder.</p>\n\n<p>I very much doubt their bark is worse than their bite. I need the bacon.</p>\n\n<p>I need the bacon or I’ll <em>be</em> the bacon.</p>\n\n<p>I hear padding footsteps as the nightmare beast draws near. I feel its hot breath, and - in that breath - I smell the smell of a death beyond death. </p>\n\n<p>The sounds are coming from directly above me now, just as my trembling fingers find the slimy slab of meat amidst the shifting sand.</p>\n\n<p>I hastily grab the meat and toss it upward as hard as I can.</p>\n\n<p>“Here boys! Eat up!”</p>\n\n<p>I hear snapping jaws in the air above me and feel their flying, putrid slobber spraying my face. There is more fearsome growling and a series of wet, ripping sounds as they fight over their unexpected treat. </p>\n\n<p>In seconds, it’s over and the dreadful growling stops. I feel a huge, hot tongue covering my arm and hands, licking the last remnants of the bacon clean.</p>\n\n<p>Then the threatening sounds have been replaced by a chorus of heavy, happy panting.</p>\n\n<p>Timidly, I reach up and toward the one of the panting sounds. My hand finds a wet nose and I trace up and over its bridge to find soft, velvety fur. I rub behind the flopping ears, and trail down the sinewy neck which connects… into a second neck, complete with a second head.</p>\n\n<p>I scratch the second head. Rinse and repeat the process for the third… And so on. Six heads in all this time.</p>\n\n<p>Huh. New record.</p>\n\n<p>“Good boooooys! You like that bacon, huh? Can you please help me get out of here?”</p>\n\n<p><em>Roof-ruff!</em></p>\n\n<p>I’ll take that as a “yes.”</p>\n\n<p>The ground shakes as giant padded feet take off ahead of me. They are way too fast for me to keep up, but they stop every so often to playfully bark so I can find my way in the dark, following the many barking voices.</p>\n\n<p>Eventually my eyes discern a sharp line of light ahead. Impossibly bright, but it doesn’t seem to penetrate into the cavern and diffuse into my surroundings. My canine guide brings me toward the light and we step into it together.</p>\n\n<p>I reel from pain as my eyes struggle to adjust to the light source. I blink away tears as the many headed dog comes into view. They look like a basset hound, six heads panting and six tongues flopping out of grinning mouths.</p>\n\n<p>They are kind of cute in the light, but I’m certain this isn’t their true form.</p>\n\n<p>I pause and reflect gratefully on the deep darkness I met them in. I shudder to think of what they must look like amidst that darkness.</p>\n\n<p>After one more round of scratches behind their ears, the hounds depart, leaving me in this new place alone. I observe my surroundings. </p>\n\n<p>The light wasn’t as bright as I first thought. It just seemed bright in contrast to the utter darkness of the cavern. It was low and sultry, like an old-fashioned night club.</p>\n\n<p>Red velvet carpet. Satin curtains. The sounds of smooth jazz floating in the air. Ah. At last.</p>\n\n<p>I’ve made it to Hell.</p>\n\n<p>I ready myself for a fight. My Granny is held captive here, and I intend to free her at any cost to myself. No matter what devils I have to bash about the face and ears, I <em>will</em> save her. </p>\n\n<p>I hear voices up ahead, coming from the kitchen behind the bar. A man’s cackling, maniacal laughter and another softer voice I couldn’t quite make out.</p>\n\n<p>“Oh you absolutely <em>slay</em> me!” The high register of the man’s voice calls out amidst laughter.</p>\n\n<p>The voice is louder now than at first. He’s approaching the door to the room I’m in. I ready myself for action and raise the wine bottle overhead to swing as a bludgeon. I might only get one chance at this.</p>\n\n<p>Then I recognize the second voice and my resolve falters.</p>\n\n<p>“I kid you not, the look on his face when I shook the empty medicine bottle at him during his heart attack… Priceless.” It was Granny’s voice. Followed by them laughing together.</p>\n\n<p>The man who walks through the door is not the devil I expected. <em>He is the devil.</em> He just isn’t the devil I <em>expected.</em> </p>\n\n<p>I’ve been here before in years past for various deliveries and pickups - even once for ladies night during the lonely aftermath of my split with Allison’s mom - but I’ve never actually met the proprietor of the place.</p>\n\n<p>He isn’t red and horny. He’s handsome and svelte. Indescribably so. He isn’t a naked goat demon. He wears a black, modern tuxedo with satin lapels. Instead of horns, his hair is stylish. Short on top, shorter on the sides. His ears each glisten with a single, tiny diamond stud.</p>\n\n<p>Instead of a pitchfork, he’s carrying a cheese board.</p>\n\n<p>He sees the look of bewilderment on my face and bursts into another round of cackling laughter.</p>\n\n<p>“Welcome to Hell, sonny old boy! Ethel here said you might come. She really is a hoot.”</p>\n\n<p>“Aren’t y – aren’t you torturing her? Is that… is that <em>cheese?”</em> I mutter as he casually takes the bottle from my hands, where I’d held it, still frozen in swinging position.</p>\n\n<p>“Of course it’s cheese. What kind of host serves his guest wine without cheese? What do you think I am, some kind of monster?&quot;</p>\n\n<p>“Well… yeah actually. I mean… aren’t you Satan?”</p>\n\n<p>His pleasant smile changes immediately into a scowl. And I’ll be damned if even his scowl isn’t beautiful. It’s unnerving. </p>\n\n<p>“It’s Satin, actually... Pleased to make your acquaintance.” He takes a melodramatic bow before continuing. “If I ever get my hands on Moses, we are going to have a <em>long</em> talk about his spelling. It’s impossible to find good help in this day and age...”</p>\n\n<p>“Speaking of help… where are all the demons? Surely we’re not the only ones here.”</p>\n\n<p>Satin sighs and rolls his eyes. “As you can see, there are no demons here anymore. They all left for Earth a while back. Something about finding a better leader in America.”</p>\n\n<p>“Ha! It’s ‘the land of opportunity’ you know?” my Granny chimes in before he continues.</p>\n\n<p>“In fact, one of my favorite old coworkers - Big nasty bugger by the name of Bruce. Used to run our kid’s department – invited me out today. I’m sure it will be a blast, but I just can’t bring myself to leave the bar abandoned.”</p>\n\n<p>“A demon outing huh… Heavy metal concert? Or some good, old-fashioned bar hopping?”</p>\n\n<p>Satin shakes his head slowly as if he&#39;s become lost in thought.</p>\n\n<p>“Actually, they were just crashing a kid’s birthday party. Some girl named Allison.”</p>\n\n<p><a href=\"https://www.reddit.com/r/nosleep/comments/8m2fbd/update_how_to_get_back_from_hell/?st=JHM70I7O&amp;sh=9525dad2\">Part 2</a></p>\n\n<p><a href=\"https://www.reddit.com/u/Deesco5/?st=JGNPKE94&amp;sh=a169fb49\">Deesco5</a></p>\n</div>\n","author":"Deesco5"}