{"rank":"26","title":"The Girl with Kaleidoscope Eyes","id":"8ljqa6","url":"/r/nosleep/comments/8ljqa6/the_girl_with_kaleidoscope_eyes/","time":"1527085195000","body":"<div class=\"md\"><p>To say that the 1960’s was an unusual time is a rather large understatement, especially when you grew up in San Francisco like I did. I turned nineteen in March of 1967, and it didn’t take long for me to join what the <em>San Francisco Chronicle</em> had dubbed “the hippies”. The summer of 1967 became the Summer of Love, something I took to heart more than most, I think. That was the summer I met Rose.</p>\n\n<p>Rose was the epitome of the girl in San Francisco with flowers in her hair. In fact, she wore her long, blonde hair down with greenery and feathers, and twirled her long skirts to Janis Joplin and Jimi Hendrix. A mainstay for us local counterculture kids, she was a big believer in free love and the powers of nature and all that jazz. In all, she was your stereotypical flower child. But there was something about her that made her seem so ethereal, like she was a ray of sunshine molded into human form. Perhaps that’s why I fell for her, hard. I certainly wasn’t the only one. </p>\n\n<p>The one odd thing about Rose was that she thought that she had some kind of…metaphysical abilities, a belief that no one attempted to disprove. But no one believed her, as they just thought that it was a part of her idiom. She already has a somewhat witchy, magical persona; psychic powers would fit perfectly into that image she was cultivating. </p>\n\n<p>Those apparent powers were what we discussed on a night I would never, ever forget. A group of us were sitting, smoking, chatting, and generally trying to piss off the establishment by existing. Rose seemed distant and slightly wilted. She was quieter than usual, and she didn’t get up to dance or sing. I scooted over to her side, the scent of nag champa and jasmine wafting off her skin and hair. I offered her the joint that was being passed around, but she declined. </p>\n\n<p>“Hey…you okay?”</p>\n\n<p>She turned to me, her large green eyes anxious and almost scared. </p>\n\n<p>“Yeah. Just…thinking, you know?”</p>\n\n<p>She trailed off, staring across the park.</p>\n\n<p>“Thinking about what?”</p>\n\n<p>It was a few minutes before she spoke again, not bothering to turn and look at me.</p>\n\n<p>“The world. How we perceive it. How much there might be that we don’t see or can’t see.” </p>\n\n<p>She turned to me and lowered her voice to a secretive pitch. I leaned in slightly to hear her.</p>\n\n<p>“I’ve always felt that there is something else in this world that we can’t see, but we can feel it. I can feel it wherever I go, no matter what I do. It’s like there’s a silk curtain separating our world from what’s beyond and I can sense something behind it. But I can’t peek. Not yet.” </p>\n\n<p>She sighed. “You probably think I’m crazy. They all do.”</p>\n\n<p>“No!” I said, perhaps too quickly. “I believe you, I just…don’t have your…uh…gift, I guess.”</p>\n\n<p>Rose’s face brightened, and her eyes took on an almost feverish quality.</p>\n\n<p>“You do?” </p>\n\n<p>I nodded. She smiled. </p>\n\n<p>“Then…I have a thought. I think I figured out a way to see past that curtain. But I need someone to be there for my journey. Why don’t you come by my place at midnight tonight?”</p>\n\n<p>She was giddy with excitement, and my infatuated mind, against my better judgement, agreed.</p>\n\n<p>I arrived at Rose’s apartment at a little after midnight. She had a small place that we were all familiar with, since many of us casually lived there. My stomach was filled with butterflies as I walked down the hall to her door at the end. </p>\n\n<p>The door was ajar, but this wasn’t unusual; Rose often left the door slightly open since people were constantly coming and going from her apartment. I pushed it open.</p>\n\n<p>Immediately, I was hit in the face with the smell of incense. Again, not unusual, but this incense was different. Darker. I smelled something…metallic in the air, something off. The lights in the apartment were all off too. </p>\n\n<p>“Rose?”</p>\n\n<p>No answer.</p>\n\n<p>Rose’s bedroom was in the back of the apartment. I slowly crept down the hall. Her door was wide open.</p>\n\n<p>The lights were off in her room too, but it was completely illuminated by candles. The incense and metallic smell were stronger here. I heard a small noise and nearly jumped out of my skin. The source of the sound was Rose’s precious record player. The record had finished playing, and it was just spinning and spinning, making sharp little scratching sounds every few seconds. I didn’t bother to see what the album was. My eyes quickly scanned the rest of the room and I noticed that the mirror was smashed and shards of silvery glass littered the floor.</p>\n\n<p>I turned my focus back to the center of the room and I saw her.</p>\n\n<p>Rose stood facing the open window. She was naked, and her pale skin seemed to reflect the sporadic beams of moonlight that were streaming in. Her hands were dark and dripping with a thick liquid. I felt myself beginning to panic. <em>Maybe the mirror smashed and she cut herself on one of the pieces</em>, I thought, frantically hoping that this was just a benign misunderstanding. </p>\n\n<p>I took a cautious step closer and my foot stepped on something soft and round. Maybe a grape? It squished under my foot, but I was too focused on Rose to care. The atmosphere in the room was heavy, and it almost vibrated with something akin to electricity. The room itself seemed to emit a low hum, a primitive, ancient sound that rattled the very depths of my chest.</p>\n\n<p>“David?” </p>\n\n<p>Her voice was barely a whisper, the inflection almost like a prayer. She turned to face me.</p>\n\n<p>The front of Rose’s bare body was drenched in a deluge of blood. The source came from her face. Where her beautiful doe eyes had once been, there were large, jagged chunks of mirror pressed into the sockets. I could see my horrified expression in the reflection. I knew what I had stepped on now. But Rose’s own expression was one of pure rapture. She lifted her arms and opened them, as if beckoning me into her embrace.</p>\n\n<p>“It’s all so clear now.”</p>\n\n<p>She laughed, a golden arpeggio of sound.</p>\n\n<p>“I can see now, David. I can see. And it’s just…beautiful.”</p>\n\n<p>I ran from the apartment and I kept running until I felt like my lungs were going to give out. After that night, I gave up the hippie lifestyle. I never saw Rose again, and to this day, I have no idea what happened to her. Some of my old friends who knew her think she was probably institutionalized for schizophrenia or something. But I don’t think that she was mentally ill. I think Rose really saw something that night. I don’t have any proof, just a feeling. A feeling that something called to her and she answered; she pulled back that silk curtain. And one nagging question has wormed its way into the grey matter of my brain, burrowed deep into my psyche: what did she see?</p>\n</div>\n","author":"bloodandbutterscotch"}