{"rank":"4","title":"Missing Pair","id":"8ljyck","url":"/r/nosleep/comments/8ljyck/missing_pair/","time":"1527087001000","body":"<div class=\"md\"><p>The cows grazed at the other end of the paddock, watching us two cross the field with dead indifference. Thin calves squatted beneath their parents like gargoyles and it wasn’t until a dozen or so heads rose to moo at the dark sky that I realised the entire heard had cowered into one corner. The grass there was savagely cropped, gnawed to rough stumps and in some patches right down to the dirt, unlike the thick tuffs James and I passed through. Plenty of food to spare this side and none had taken- maybe the fertiliser gave it a funny taste. </p>\n\n<p>I began to tell James. “What I don’t get is why it still smells so awful from here?”</p>\n\n<p>“Like someone crapped in a copper deposit.” said James. ”How did you find this place again?”</p>\n\n<p>“Not on the way to the bathroom if that’s what you’re implying.”</p>\n\n<p>I cracked into laughter at that and James joined, his misty breath trickling into the cool air. Two guys trespassing on farmland had no reason to be there, and only after crossing the creek did I realised I was set to riot.</p>\n\n<p>I stuffed my hands into the track jacket he’d lent me. “Really though, thanks.” </p>\n\n<p>“Don’t sweat it. I’ve been kicked out loads.” He said</p>\n\n<p>“Yeah, but my mum doesn’t exactly kick me out. She guilts me into leaving and then guilts me for not coming back.” I made a fist. “I just need to take my energy out on something otherwise we’ll keep arguing.”</p>\n\n<p>James slung an arm around my shoulder, panning the sky with his free hand. “On land this big there’s always a castaway shack to knockdown- or an outhouse. Hopefully one that’s empty.</p>\n\n<p>“I’m willing to bet it is. This is private property, you know.”</p>\n\n<p>We broke into laughter again and I greeted a new, hearty warmth under the jacket. I knew it’d feel real good to break something right then, while I wasn’t all anger and frustration. Destroying property with no humour made you the grumpy old man throwing away the neighbouring kid’s Frisbee. The shack was still a paddock over, though reaching it neither of us were enraged or cathartically bashing planks. For me at least, the night rested coolly at the pit of my stomach like wet roses on a grave.</p>\n\n<p>James reached the fence ahead of me and straddled the top beam. Now having entered the gnawed grass, I noticed the cows only reared their skin-sagged heads for him. Except the calves. A half dozen or so beady little eyes tracked me. I rose my hands into claws and mock growled at them, thinking we’d get a good laugh out of them stumbling across the field. The scare fell flat- none even flinched.</p>\n\n<p>“Just wait till its morning and they can see your face.” said James from his perch.</p>\n\n<p>“How about I tell them why you’re called the paddy-whacker.” I said and James laughed so hard snot shot out his nose.</p>\n\n<p>An engine rumbled nearby. James searched the field as if expecting to see the Farmer’s crop tractor driving murderously towards us, but the sound came from the road across the creek, skirting the plot.</p>\n\n<p>I called out to James. “Get down, it’s my mum.”</p>\n\n<p>Headlights spilled onto the paddock, hitting James’ position. He slipped off before they lingered on him. The dead grass wouldn’t conceal me. I hauled myself over the railing, slamming my head on the second bar down. The warmth of headlights touched my skin… and passed.</p>\n\n<p>I sat up and rubbed my neck. It only throbbed weakly but for a moment I thought I heard splashing and wondered whether I’d been concussed, and I asked-</p>\n\n<p>“Do you smell blood?”</p>\n\n<p>“You’re not bleeding,” James began, then scrunched his nose. “Ah, gross. It’s strong”</p>\n\n<p>I glanced around the patch of grass I had landed on and spotted a pile of dung back on the other side. Thick blood coated the mixture like a squashed jam donut.</p>\n\n<p>“Starved cattle. Blood in the stool. This guy needs to be reported for animal cruelty.” I said.</p>\n\n<p>“Better make sure it’s anonymous.” Said James.</p>\n\n<p>He pulled me to my feet. I dusted loose grass clippings off my jeans, trusting there’d be no manure clung to my backside. It’d gotten so dark I wouldn’t be able to tell until I’d plunged my fingers into the sticky swab.</p>\n\n<p>“She’ll be out all night now that she’s worried.” Guilt prickled in my chest, but she wanted me to leave. “We’ll take a detour upstream, further away from the roads. There has to be a crossing eventually.”</p>\n\n<p>We set off walking, keeping the creek nearby. James had picked a thin branch from a tree and guided it in front of him. A tool to take his attention and avoid talking. I was about to thank him again, tell him that he could call me an arsehole and I’d still be grateful, but then I smelt it and chose not to open my mouth- as if the stalking whiff could possess. The stale, grassy smell of shit, copper, and burning incense. Wiping the back of my jeans, I only felt denim.</p>\n\n<hr/>\n\n<p>A dirty white sneaker washed down the stream, laces hung in the water like fishing lines. It bobbed in the black water and my thoughts returned to the splashes I’d heard after hitting my head. A ripple overturned the shoe; empty- and no half chewed ankle that reached for the shore.</p>\n\n<p>Thickets of thorn bushes lined the bank, barbs a bruised purple. A sharp white gleam caught my eye, <em>the other shoe?</em> Hanging on a coil of thorns, a bare bull-skull hovered inside, spikes running through its eye socket and mouth. <em>It died standing,</em> I thought. <em>After having its face cross-stitched, suspended like that.</em></p>\n\n<p>James lobbed his stick. It speared next to the skull. He smiled proudly, but his delight subsided once I didn’t smile back.</p>\n\n<p>He finally asked. “The fight with your mum that bad?”</p>\n\n<p>“The usual teen angst and parental clash.” I said.</p>\n\n<p>“My parents and I argue, but nothing I’d concuss myself over.”</p>\n\n<p>I doubted the concussion, but he had a point. “I quit a part time job. One she organised. An old high school friend of hers runs a workshop over in Suther Haven- general mechanics, the odd beat up car. Even offered a tertiary qualification in engineering, plus hourly wage. </p>\n\n<p>“He showed me the tool box and not much else. Apparently he believed in education through customers-screaming-at-you. I got so stressed just thinking about the next shift I told him I was done. Now he’s pissed that I left without notice, as if a part-time high schooler quitting was the downfall of his business, and my mum says I don’t have any other responsibilities to stress about.”</p>\n\n<p>“Tell her your boss was a dick.” James said, “If he’s a dick now imagine what he was like in high school- she’d buy it.”</p>\n\n<p>“Maybe you should feed me lines through an open window while I explain that.”</p>\n\n<p>“Forget it, I have some string and cups we can use.”</p>\n\n<p>The thistle hedge and dead trees thinned to a small clearing. A squat bridge stretched flat over the creek, hardly reaching my height. The planks gleamed darkly as if recently soaked in rain, raising a mildew smell. </p>\n\n<p>“Is that a shack?” James pointed to the adjoining field. A young structure of two wood sheets stuck from the ground. A slanted tin roof gripped the top. “Called it. And it’s an outhouse- did we bet on that?”</p>\n\n<p>“No, but I’ll race you to it.” I said.</p>\n\n<p>“You’re on. Loser scares the critters out.”</p>\n\n<p>James shoved me and took off across the bridge, planks creaking underfoot. <em>Dirty race for a dirty place</em>, I thought and chased after him, boards now whining like cork squeaks. <em>In that case I can play the sympathy card. Make him scare the rats away- the calves didn’t even flinch for me.</em> The wood warped, sliding on its nails. The heel of my shoe dug into the damp layers. I never felt the board snap; my foot passed through like it found a hole. A chunk of wood sliced my shin. I tried to pull up but the chunk dug further in. </p>\n\n<p>James, having already reached the other side, hesitated at the first board. He didn’t risk stepping onto the bridge; it wouldn’t do us any good if we both got stuck.</p>\n\n<p>“Have any tweezers on you?” I grunted. “I’ve got a big fucking splinter and my leg’s not coming out with it still in.”</p>\n\n<p>“I’ll go under, see if I can unsnag it.”</p>\n\n<p>James clambered down the slope, a drop no longer than 2 metres, and out of my sightline. There was a light tug at my foot and I yelped.</p>\n\n<p>“Sorry about that. It’s not deep but it’s in there- and probably loaded with bacteria. This shit looks mouldy” James swivelled my foot again, slower this time. “Hoh-boy that’s creepy.”</p>\n\n<p>James let go, dropping unexpected wait on my wound. The wood drove back in.</p>\n\n<p>“Can we focus on my foot here?” I said.</p>\n\n<p>“Hold up a second, I want to make sure I haven’t wandered into a séance. Someone’s hoarded shoes under here like it’s the lost and found section of an amusement park.” James gagged. “And you know what? I think I found where that smell is coming from, aside the obvious.”</p>\n\n<p>I felt James press against the soul of my shoe.</p>\n\n<p>“There’s even a white sneaker here that fits you.” The water splashed as something landed in. The sneaker, perhaps. “Alright, enough with that. Let’s get you down- or up, for that matter.”</p>\n\n<p>I braced my leg, imagining the pain as a squishy pop- like scooping out an eye ball. But James didn’t manoeuvre the wood sliver from its coin-slot ditch. The farmland was quiet without its cicada hum. When had the cows stopped mooing?</p>\n\n<p>“Any day now.” James didn’t answer. “Quit fucking around. This actually hurts.”</p>\n\n<p>The creek gurgled, drops hitting the water. Downstream, I could see that James must have loosened the pile. A pair of shoes washed away.</p>\n\n<p>I winced as blood dribbled, but it was cold like water. Water trickling from a clammy grip tight around my leg. I was tugged- <em>It</em> tugged me down, bending my foot hard into the wood. White shock filled my stomach, and I cried out.</p>\n\n<p>“Get the hell off me- James!”</p>\n\n<p>The chunk dislodged. I had my foot pulled so hard against the grip it flew up, grazing the exposed plank’s rough edge. Through the hole, a shadow moved and suddenly James was scrambling back up the slope.</p>\n\n<p>“Came out easy than I thought” He said.</p>\n\n<p>I held my bleeding shin. A gory sheet of flesh flapped in the air. “You could have been gentler.”</p>\n\n<p>“Oh shit, I didn’t realise it was that bad.” He looked tentatively at the bridge that swallowed his friend, then shuffled over. “Second time tonight I’m picking you up.”</p>\n\n<p>“First time you shut up though. All you had to do was say <em>Pulling it out now. Does that hurt? Should I stop?</em>”</p>\n\n<p>“My bad, I got distracted.”</p>\n\n<p>James helped keep the weight off my leg and carried me to the shack. Even distracted, he wasn’t the type to ignore a friend screaming.</p>\n\n<p>“Change of plans.” James said. “Instead of knocking it down we’ll glare angrily, then get you home.”</p>\n\n<p>“Good idea, but if my mum is still out looking for me I think I’ll catch a ride.”</p>\n\n<p>We headed back the way we came, passing through the thick side of the paddock. The cows were gone. I didn’t remember seeing a gate to let them out. I went first over the creek’s shallow crossing, careful to not soak my shoes, but James didn’t need to bother keeping his dry. </p>\n\n<p>He was missing his shoes.</p>\n</div>\n","author":"Hokons"}