{"rank":"317","title":"For Services Rendered","id":"8ljzam","url":"/r/nosleep/comments/8ljzam/for_services_rendered/","time":"1527087212000","body":"<div class=\"md\"><p>There was something special about Summer Donahue. Everybody who ever met her said so. All of us girls envied her during middle school and junior high. She was smart, she was sassy, she had boyfriends, money, a good life. \nWhile the rest of us had to work hard for what we wanted it seemed like everything always fell into place for Summer. </p>\n\n<p>She also destroyed everything I ever cared about. </p>\n\n<p>It started when we were able to arrange a senior trip to Europe for our marching band. </p>\n\n<p>Because Summer was our captain she got to pick where we were going to go, and according to our band director the sky was the limit. </p>\n\n<p>While most of us wanted to visit Barcelona or Paris, Summer insisted on a quieter locale, amid the tranquil countryside of Romania. She said she wanted to enjoy a good old fashioned camping trip. </p>\n\n<p>So of course, given the fact that it costed a lot less and we could stay longer; the band director agreed with her choice. </p>\n\n<p>We all got our parental consent and packed our bags to leave a week before spring break. \nI didn&#39;t know it at the time but that was when my boyfriend Todd had started talking to her. </p>\n\n<p>There was tension between Todd and I already thanks to an argument we had at the Valentine dance. </p>\n\n<p>Todd said I had trust issues, I was sure he was already cheating.<br/>\nStill I wanted the trip to be our chance to rekindle our relationship. </p>\n\n<p>It was about three days after we got to our destination that I found out that they were doing a lot more than talking. </p>\n\n<p>When Todd confessed to me, all I could do was cry and run off to the woods we were staying close to. I didn&#39;t care where I was going, so long as it was far from him. </p>\n\n<p>There I was, literally millions of miles from family in a small secluded forest walking in circles and crying my eyes out. Wishing all the perfect people in the world could be knocked off of their pedestals. </p>\n\n<p>That was when I saw him. </p>\n\n<p>I had been zoned out watching the clouds rolling over the mountains. Then my gaze strayed to the end of the tree line where this ancient oak rested at and I found myself staring at a handsome muscular young man. </p>\n\n<p>He had to be no more than two or three years older than I, but something about the way he sat there and slowly smoked on a strong cigar made him alluring. </p>\n\n<p>He was dark haired, tall, and had perfect green eyes that twinkled with a hint of mischief hiding behind them. He sported a dark fur coat and a fitting leather jacket, well ironed slacks and mountain boots that had recently been shined. </p>\n\n<p>As he tossed the cigar to the ground, I realized he had noticed me and I turned away in embarrassment.</p>\n\n<p>Before I knew it he had moved across the clearing to where I was and shot me a charming smile. </p>\n\n<p>&quot;Care for a smoke?&quot; he asked. \nHe had a lapel of flowers pinned to his coat. They smelled like dirt, which instantly set me off. </p>\n\n<p>There was something attractive about his confidence though so I responded in a flirtatious way, &quot;I&#39;m probably too young for you.&quot;</p>\n\n<p>&quot;But old enough to know how to have a good time?&quot; he responded as he leaned against the oak beside me. </p>\n\n<p>&quot;I should be, but instead I&#39;m here with you,&quot; I said. </p>\n\n<p>&quot;Tell you what, let&#39;s share a cig and a conversation. I get to know you and you me. You don&#39;t like what you hear, then we go our separate ways. No harm, no foul,&quot; he responded. </p>\n\n<p>There was something special about the way he said things. It made me feel comfortable. </p>\n\n<p>&quot;Okay, one smoke,&quot; I conceded and then checked my watch, &quot;And you got fifteen minutes until my curfew.&quot; \nNot that I had really anything to be running back to camp for. </p>\n\n<p>He smiled broadly and I saw he had yellow ugly teeth, then he waved his hand in front of my face and made a cigarette appear. </p>\n\n<p>&quot;Local magician?&quot; I asked him as I took it nervously. </p>\n\n<p>&quot;Something like that,&quot; he said. \n&quot;A small town like this probably doesn&#39;t get many tourists huh?&quot; I said, suddenly feeling like the air was getting colder as we spoke. </p>\n\n<p>He shrugged and answered, &quot;Sometimes. I don&#39;t come near to town that often though. But tonight is special. So you should feel thankful.&quot; </p>\n\n<p>&quot;Oh really?&quot; I smiled back. I was enjoying the playful banter. But I didn&#39;t like the idea of being here in these woods alone with a stranger. </p>\n\n<p>&quot;You came to Romania to learn the culture right?&quot; he asked. \n&quot;Eh... it&#39;s a long story,&quot; I said and checked my watch again. &quot;It&#39;s getting late. Thanks for the smoke though.&quot; </p>\n\n<p>&quot;Leaving? We haven&#39;t even made proper introductions yet,&quot; he said. &quot;Look... you seem like a nice guy. But honestly I doubt this is going to go the way you&#39;re hoping dude,&quot; I said. I was starting to wonder why I was even lingering there arguing with him. \nMaybe he reminded me of those people that could always get their way. </p>\n\n<p>&quot;What if I told you that it could go the way you wanted though?&quot; he asked. \nI snickered at him and stood up to leave. &quot;That isn&#39;t how life works,&quot; I said. I stepped away from him ready to get away before things got any stranger. I was halfway toward the edge of the clearing when he spoke again. </p>\n\n<p>&quot;Tell that to Summer Donahue.&quot; I froze in my tracks. </p>\n\n<p>I turned toward him and blinked for a second. </p>\n\n<p>&quot;How do you know about her?&quot; I asked. </p>\n\n<p>&quot;I know a lot of things. Like I know if you keep walking you will live an ordinary life the rest of your days,&quot; he answered. </p>\n\n<p>&quot;And if I stay?&quot; I asked as I moved toward the center of the grove again. </p>\n\n<p>&quot;Then we get to know each other a little better,&quot; he explained as he passed me a professional business card that was written in Romanian. </p>\n\n<p>&quot;I don&#39;t understand,&quot; I admitted as I kept feeling like he was staring at me. &quot;Hmm, I thought for sure I had it right; check again,&quot; he remarked with a sly grin. </p>\n\n<p>I looked at the business card again to see that the words were slowly fading and changing from Romanian to English. </p>\n\n<p>&quot;Martolea Julihov, private entrepreneur; professional handler; available every Tuesday and Thursday night to the weary and weak,&quot; I said reading it aloud and then tossed it on the ground. It faded away into the earth. </p>\n\n<p>&quot;That&#39;s a pretty neat magic trick,&quot; I said, laughing nervously. </p>\n\n<p>&quot;You don&#39;t believe in things you can&#39;t explain, but you will,&quot; he said. </p>\n\n<p>He paused and raised his coat up to cover his face for a moment. Then he dropped it and I found myself staring with my mouth wide open. </p>\n\n<p>I was looking at the visage of a hag, her face was covered with sores and warts. Her teeth were misshapen and her hair long and grey, her eyes nearly grey from blindness. </p>\n\n<p>I found myself stumbling to get up at the shock of the sight and mumbled, &quot;What... what are you?&quot; \n&quot;I have many names, dearie; many names that you will forget. the one on my card will suffice for now,&quot; she said. </p>\n\n<p>I wanted to run, to scream at the top of my lungs. But something in its gaze prevented me from doing so. \nHe whispered softly to me, &quot;There is no need to fear, dear child. I told you already that I am here to help you.&quot; </p>\n\n<p>&quot;To... to help me how...&quot; I asked. </p>\n\n<p>&quot;First you must listen to my voice... and hear my words, and forget this place,&quot; it responded. \nIt felt so easy to slip away. I didn&#39;t know why but I accepted his calling and soothing voice. </p>\n\n<p>&quot;Forget.. this... place..&quot; I repeated. </p>\n\n<p>&quot;Your friend, Summer. She has everything that you do not. What would you give to take it away from her?&quot; Martolea asked. </p>\n\n<p>I thought about it for a moment. I knew he was offering me some kind of bargain so I asked, &quot;You would hurt her?&quot; It sounded so enticing. </p>\n\n<p>&quot;I would make her pay the way that you feel she deserves. As you can see, I&#39;m a professional. And my services are well known here in this country,&quot; he explained. </p>\n\n<p>&quot;And the price?&quot; I asked. I knew there had to be one. No offer like this could possibly be free. The wind had stopped as the two of us stood there in the clearing. </p>\n\n<p>&quot;For taking a life, one must be given. An eye for an eye. But I&#39;m not unreasonable about this. It will be the death of a stranger, someone you have never even met. I will find them and the price will be paid,&quot; Martolea said. </p>\n\n<p>I couldn&#39;t resist thinking of the possibilities of what Summer had in store. The more I thought about it the more I realized this was really what I wanted. </p>\n\n<p>No one would ever know, I told myself. I shook his hand and felt a sharp burn on my palm. I looked at the small mark he had made and then found myself alone amid the forest again. </p>\n\n<p>I strolled back to the campsite and started to wonder if any of it had even been real. I saw Summer and Todd near the mess hall acting like love birds and felt rage. Maybe I had imagined the encounter simply to get revenge? </p>\n\n<p>Then as I settled down to sleep for the night, I heard the screams. </p>\n\n<p>They were coming from the cabin across from me where the other girls stayed. Where Summer was at. </p>\n\n<p>I grabbed a light coat and followed the other girls outside and toward the other building. </p>\n\n<p>The crowd made it difficult at first to know what had happened but then as our band director cleared the room, I could see the carnage. It was Summer Donahue, of course. </p>\n\n<p>Blood stained the floor, leading up to the edge of the bed where bits of flesh and bone were hanging loosely. Her body looked as though it had been shredded from the torso down, and her entrails hung against the back wall with nails staked into them, wrapping around her neck and choking the life out of her. </p>\n\n<p>There was no sign of what happened to her lower body, but it wasn&#39;t hard to imagine that the Martolea made quick work of it as well. </p>\n\n<p>I ran outside into the darkness as the girls spoke of a strange animal that had entered their room and attacked Summer. I felt my heart beat out of my chest as I looked toward the forest. I wondered if the Martolea was watching me as I stood there and tried not to vomit. \nThe cold air crept around me. </p>\n\n<p>Our trip was cut short after the incident, and on the way home my boyfriend and I made amends with each other. At first I thought he was just feeling sorry for himself but eventually our relationship grew stronger. </p>\n\n<p>I went on to get married to Todd, and last autumn we decided to start planning to have a family together. As time went on I forgot about Romania and I forgot about Summer. I was soon pregnant with our first child. It was an unexpected surprise and for those few weeks I was in constant disbelief. </p>\n\n<p>Then tragedy struck us a few weeks later when we went for our latest ultrasound. </p>\n\n<p>The doctor called us the next day to tell us that the baby would not live beyond my first trimester. I remember listening to the dead static of the phone and trying not to cry. </p>\n\n<p>The doctor explained that I was at risk as well and needed to come to the hospital for an emergency c-section to get the baby out before what was killing it caused the same affect on my body. </p>\n\n<p>We drove that night to get the procedure done, and I remember squeezing Todd&#39;s hand as I prepped for surgery. </p>\n\n<p>When they put me under, it felt like an out of body experience that some people talk about. I could see the surgeons working on me as fast as possible to save my life. </p>\n\n<p>Then I saw a shadow cross over the room and I heard laughter. In between the darkness I saw sharp gleaming green eyes. </p>\n\n<p>The demon&#39;s hands transformed into claws as it began to tear open my belly. His mouth shaped and opened wide to reveal sharp rows of jagged and rotting teeth. </p>\n\n<p>I heard a cry, like that of an infant and watched helplessly as the creature took the baby from my womb. Then as the darkness covered us both on all sides it began to devour the child. </p>\n\n<p>I screamed and kicked and cursed. I wailed at the top of my lungs as he ate the infant, his smile becoming smeared with its blood. </p>\n\n<p>Then I woke up in my hospital room, I found myself surrounded by family and friends coming to offer their support and care for me. \nI was too paralyzed to say much of anything except a few simple words. </p>\n\n<p>As the night wore on they lingered until at last it was just me and Todd in the room alone. I thought about the dream I had, and then woke my husband up. I had to confess everything to him. </p>\n\n<p>I started at the beginning and as I went he at first thought that the story was beyond belief. Then as I explained the price that the demon asked for he got quiet. </p>\n\n<p>He stood up and walked over to the nightstand where many of our guests had stopped by to offer us condolences and small gifts and picked up a bouquet of flowers. </p>\n\n<p>He brought them to my side and showed me the note that went along with them.  </p>\n\n<p>For Services Rendered- MJ </p>\n\n<p>They smelled like <a href=\"https://m.facebook.com/Kyle-Harrison-2120650624830271/\">dirt.</a></p>\n\n<p><a href=\"https://www.reddit.com/r/KyleHarrisonwrites/?st=JHJ8BEM0&amp;sh=5a3c2586\">330</a> </p>\n</div>\n","author":"Colourblindness"}