{"rank":"118","title":"If you’re traveling on the east coast, DO NOT STOP AT SOUTH OF THE BORDER","id":"8lk33s","url":"/r/nosleep/comments/8lk33s/if_youre_traveling_on_the_east_coast_do_not_stop/","time":"1527087991000","body":"<div class=\"md\"><p>When I was younger, I was obsessed with the billboards promoting South of the Border. Their questionably offensive, bright murals of donkeys and sombreros would liven-up the 9 hour drive to see my grandparents in the days before Netflix and cellphones. Those signs framed all of i-95, from Jacksonville to my destination in Virginia beach, and I’d beg my parents to stop—even just for a bathroom break—to see what the big deal was.</p>\n\n<p>Now they never did, my dad was notoriously fickle about the time. He didn’t want to waste a second for food or bathroom breaks. We’d spend the night before a road trip just making peanut butter sandwiches to avoid stopping for lunch and dinner. I could never justify a quick detour to him. All my childish begging and crying kind of made it a joke in my family. After a while, I began to feign disinterest to avoid their teasing but my curiosity never subsided. Whoever was in charge of their marketing must have been a genius because my skin would tingle with excitement with each sign we’d pass. Pedro was beckoning me to a land of cheesy bobbleheads and abandoned carnival rides that hadn’t been ridden in decades. A dilapidated tourist trap became a destination more sought after than Disney.</p>\n\n<p>Eventually, I assumed I would grow out of this fascination but have you ever in adulthood come across a toy that you wanted desperately as child: the Ewok Village that your neighbor had down the street but your mom insisted you didn’t need, or maybe the Barbie dream house that cost nearly four months of allowance and you never had the self-control to save for. Whatever it is, when you come across that sacred holy grail with the means to finally obtain it, something devilish happens. You get it, at any cost. You’re an adult now with no reason to buy a Furby, but you do so to finally satiate that infantile hunger. South of the Border was my Furby.</p>\n\n<p>Grandma Jane had died and her funeral was to take place in Virginia Beach. Unable to escape midterms, my family had driven to see her in her dying days while I was left to study and drown my work ethics in shots of tequila. To make her funeral, it’d be a nearly eleven hour drive from the University of Florida but thankfully my roommate had agreed to accompany me. She was lifesaver, a complete saint in her ability to somehow keep me on track while I struggled to even remember to brush my hair. Sofia kept me sane and I was eternally grateful for her offering to accompany me. Not many people would be willing to pass up spring break for a funeral.</p>\n\n<p>“It’s like spring break road trip.” She smiled, passing me a bottle of vodka. Underage drinking was largely legal in Gainesville if it was hell week. We had stumbled into a 7-11, hungover from testing, and bought it without a peep from the cashier or an attempt at carding us. “Sure we’re going to Virginia and not Tampa and we’re going to put an old lady in the ground and not fucking USF boys, but it’ll be fun!”</p>\n\n<p>I cackled, feeling dizzy from the alcohol. “You bitch. That’s my grandma.” I took a swig from the bottle. “Y’ know I haven’t been up there since middle school. We used to go up there every year for Christmas. Actually saw snow a couple of times.”</p>\n\n<p>“Snow isn’t that great, not really anyways. In Vermont, all it did was snow. I hated the damned stuff. Only thing to do in Vermont was to fuck for warmth, thank god for a defective uterus. No Condoms.” I passed Sofia the bottle. She wasn’t what you would call a “happy drunk”. She had issues with her infertility, joking about was her masochistic way of coping with it. I don’t think she liked who she was in Vermont. She had come to Florida to escape her old life. She didn’t mention her dad much or how high school was. I didn’t mention high school because I wasn’t popular but just the way she would briefly mention her time before college, you knew her reasons were more justified.</p>\n\n<p>I glanced at the numbers on my phone. 3:15.  “Dammit.” I flung my back against the mattress, partially for drama and partially because I was too tired to sit up. “We have to leave in five hours.” We both groaned but agreed to sleep.</p>\n\n<p>Five hour came and went and it was long before we groggily got up, thankfully not hungover. We managed to leave around one, blasting old Jason Derulo and One Direction songs from my tiny Elantra. Sofia was an infinitely better driver than I was so I climbed in the passenger seat, not minding her behind the driver’s wheel. My company was a can of salt and vinegar Pringles and a two vitamin waters. Long gone were the days of peanut butter sandwiches.</p>\n\n<p>In all honesty, it felt a little exhilarating to be making this trip without my parents. They were so domineering in how we spent our time. If Sofia and I wanted to, we could stop every half-hour for food or a bathroom break. Drunk with our new found power,  we stopped for greasy fast food burgers and frosties an hour later.</p>\n\n<p>Now I wouldn’t divulge this information if it weren’t absolutely necessary: I am lactose intolerant and Wendy’s frosties don’t exactly agree with my stomach. Within fifteen minutes, I was miserable.</p>\n\n<p>“Hey, Sofia,” my stomach churned. “We need to stop. ASAP.”</p>\n\n<p>“Ash, are you fucking kidding me.” She laughed, scanning the pine trees lining the highway for any semblance of a restroom. “What’s your opinion on shitting in the woods? Like, it’d make a great story . . .”</p>\n\n<p>That’s when I saw it. The sign of my childhood. Black-painted plywood sloppily adorned with a garishly designed, sombrero clad ranchero smiled down at me. 5 miles ahead: South of the Border. Childhood desire suddenly overwhelmed me. Just the sight of the sign regressed me to some decade-passed state of car rides and silly bands.  I didn’t want to be the one to say it, thankfully, Sofia read my mind and took the bait. “Let me guess, you want to go to South of the Border.”</p>\n\n<p>I tried to keep my excitement to a minimum. “I mean if you don’t mind.”</p>\n\n<p>Sofia glanced at me, taking only a moment’s notice from the road. “South of the Border . . . that sketchy-ass tourist trap. Ashley, people get food poisoning there all the time. No, that’s gross. Try again.”</p>\n\n<p>“No, let’s go! Like you said you wanted a story, I’m sure we’ll get a good one there!” Visions of tacky tourist shops displaying pastel baseball caps and plastic snow globes conquered the ever present fear of food poisoning and gnawed at my mind, begging for a chance at adventure. Sofia didn’t move her eyes off the road so she had no chance to see how desperately I needed this. This was my Furby.</p>\n\n<p>She rolled her eyes. “Fine, but only since we still have four hours to drive and I’m dead tired and god knows you’re not going to drive the rest. I hope you know that I’m expecting a damn good story.”</p>\n\n<p>The Carolina sky was beautiful when greeted during dusk although our arrival was a bit of a letdown. Flecks of orange and pink painted the sky in a macabre satire of the sun bleached buildings. A motel that was once a canary yellow had now faded to a faint semblance of discoloration while the stucco walls were chipped and branded by local kids. The area had a strong odor of piss and alcohol, something the receptionist of the motel had warned us against. She had said the area was a popular spot for gang violence, that two college girls wouldn’t have too much trouble but to be careful. Sofia said that she found that exciting, although I knew otherwise given how she shook, constantly looking over shoulder.</p>\n\n<p>“So, uh, what’s still open? It’s only seven, but it seems like a ghost town.” She said to the receptionist, Reyna.</p>\n\n<p>Reyna chuckled, displaying the lipstick smeared on what little teeth she had left. “It’s cuz we is a ghost town. Ain’t nobody come here nomore.” She looked us up and down. “I supp’se the diner as good a place as y’all could find in town. ‘Specially them waffles, to die for.”</p>\n\n<p>“We want to have a good time, what can you recommend.” Sofia hinted.</p>\n\n<p>Reyna huffed. “The gift shop has a real gator.” Partially because of the frosty destroying my stomach and partially because of the oncoming war between the strong-willed Sofia and Reyna, I ran for the bathroom.</p>\n\n<p>The walls were of the same color family as the stucco outside, a sickly excuse to distract from the growing mold. Green and black crept from the ceiling in a jarring contrast to the yellow. The tarnished faucet was bathed in algae and rust. Thankfully, the toilet was suitable after layers of paper over the seat. Still, it wasn’t a welcome sight.</p>\n\n<p>The air within the bathroom was musty and humid, even more so than the Gainesville swamps I had traveled from. It was in this bacteria-breeding ground that I found the suffocating notion that something was surely watching me. The glass in front of the sink seemed too foggy and the vents positioned above the toilet too large. Whether it was paranoia or instinct, I pumped the remaining soap into my hand, lathered, and got the hell out of there. I couldn’t shake the impression I got, though. There was something strange about the motel, something off putting in the vacant lobby and silent parking lot.</p>\n\n<p>There was no one there but Sofia, perched upon an orange stool along an empty bar. The receptionist was tucked into a tiny alcove beyond her desk, the faint blue glow of her ancient monitor haunted the dimly lit lobby. From my experience, even the most deserted hotels and towns still had a semi-lively bar. This place was just deserted.</p>\n\n<p>“Did you find any fun?” I joked.</p>\n\n<p>“Wow, you’re so funny,” She mocked, getting up and swinging the room key. “No, she was a bitch. Gave us the worst room I’m pretty sure. You should’ve seen her smug face when she gave me this key, probably thought she was goddam Will Ferrell.”</p>\n\n<p>She probably would’ve gone on for another thirty minutes but her stomach roared. “Let’s put our stuff up and get some waffles?” I offered as we finally set foot outside. The emptiness of our surroundings were unnerving, it was a set right out of Zombieland. There was calamity in the calmness of the deserted park, the sun that was threatening to set upon our arrival had now seceded to the moon. There was an eerie serene to be admired, like a theme park with its patrons abducted by aliens. Chills roared against my skin, electrifying my arm hair as if I were struck by lightning.</p>\n\n<p>“Fuck, I could go for a waffle!” She smiled but I couldn’t return the same energy. Despite the warmth of spring, I shivered. Sofia was unfazed as we approached the motel room.</p>\n\n<p>The only defining characteristic of the room was its lack of upkeep. In short, it was gross in typical motel fashion. The rug was shag and a burnt mustard shade, its murky color of indiscernible origins. The walls were grimy though surprisingly bare and void of sombreros and tacos. In fact, they were entirely blank besides a framed portrait of Michael Jordan一 we were the Carolinas after all.</p>\n\n<p>In the center of the room was one bed, a moth-eaten quilt draped over it. Given how strict she was about the cleanliness of our room, this must have been a nightmare. “Why the hell did you drag me here?”</p>\n\n<p>The eyes on the Michael Jordan poster seemed to follow me as I set my duffle bag on the ground. Something was peering out at us, I was sure of it now. I cast my eyes down and searched through my bag for Chapstick, regretting my insistence on staying the night.</p>\n\n<p>I looked back at Sofia but she wasn’t alone anymore. Perched on the bed behind her, a looming figure draped in bright shades of crimson and cobalt avoided eye contact, his head bowed and thin lips curled into a cruel impression of a smile. The air in my lungs caught, forbidding me a chance to breathe or speak. She froze, noticing him as I did. She didn’t say anything but as she tensed, he vanished after a fraction of second of existence. The figure wasn’t present long enough to assure tangibility, its likely it was sleep deprivation but I wasn’t sure.</p>\n\n<p>“What the ACTUAL FUCK WAS THAT?”</p>\n\n<p>“What are you talking about?” She responded, trying to maintain composure. “Let’s just get out of here and get dinner. I’m starving.”</p>\n\n<p>Reluctantly, I agreed in an attempt to avoid my mind playing tricks on me. It was against my being to leave a mystery unsolved but my stomach betrayed me, growling for waffles and hash browns. The diner wasn’t far, nothing really was at the glorified rest stop. Knowing such left me uneasy, whatever was in our room had the potential to be where ever we decided to go.</p>\n\n<p>The establishment hummed under the light of a fluorescent sombrero. Surprisingly, we weren’t the only ones there. A family sat in a booth near the kitchen and ate quietly. They had a daughter with curly blonde hair pinned into two tight braids and I remembered how I would’ve killed to sit where she was when I was younger. I smiled meekly at them as we found a seat.</p>\n\n<p>“Hi, how are y’all tonight? I’m Cindy. What brings you in?” Cindy was a portly, dimpled waitress with silver hair twined into a knot on the top of her head. She was surprisingly welcoming despite her job. I had wholly expected every employee here to tote the same disinterested attitude as Reyna. She slid two waters on the Applebee’s inspired, ceramic tabletop and withdrew a black notepad for our order.  </p>\n\n<p>“We’re just here for the night, we’re staying at the motel. Heard you guys make good waffles.” I smiled at Cindy, thankful for the warmth she seemed to bring. It made easier to ignore the peculiarity of the rest stop.</p>\n\n<p>“Really? Y’know, my dad was the manager at that motel for years. I know every room and every guest that ever spent the night, used to be a lot more to keep up with when I was a girl. Not too many people stay the night anymore, what room are you in?”</p>\n\n<p>I glanced at the key Sofia had in her lap. “305.”</p>\n\n<p>Cindy laughed, her neck quivering in agreement. “Somebody must’ve made an enemy of Reyna, huh?”</p>\n\n<p>“Damnit, I knew it.” Sofia laughed. “Why? Does the air conditioning not work or something? I knew that she was out to get me.”</p>\n\n<p>“Nah, there’s just rumors that’s all. Don’t worry, that room is as gross as any other room you could’ve gotten. Trust me. Now, how about those waffles.”</p>\n\n<p>The food wasn’t great but it was cheap enough that we didn’t care. Sofia and I managed to drown it in strawberry sauce and syrup until it tasted as good as candy. At one point, Cindy sat down beside me. “It’s my break.” She whispered.</p>\n\n<p>“You’re fine, I don’t mind you sitting down.”</p>\n\n<p>“No, it’s not that.” She spoke quietly and quickly, urgency clearly visible. Sofia and I leaned in. “Room 305, isn’t just rumors. It’s no good, you have to be careful in there. It’s not safe to be here over night, especially in that room. Try not to stay if you have to, but if you do, please, please don’t make any deals.”    </p>\n\n<p>She hoisted her round body out of the seat and booked it out of the diner before we had time to process what she had said.</p>\n\n<p>“What the fuck?” I nervously chuckled. Sofia seemed on edge but trying to remain composed.</p>\n\n<p>“Crazy lady must be in cahoots with Reyna.”</p>\n\n<p>I agreed hesitantly, my palms sweating in my lap. She seemed content with pretending that nothing was wrong but I couldn’t ignore the spying presence I felt earlier or the glimpse of a man I saw in the room. Cindy’s warnings only magnified this sense of malice hanging in the air.  I didn’t find her crazy at all, but I also didn’t want to start a fight. Sofia sacrificed her spring break to accompany me, I would have to suck it up. “I think you’re right.” I desperately wracked my brain for something to do to pass the time before bed. They were very clear that there was no WIFI or cable in any of the rooms. “Wanna check out the rides?”</p>\n\n<p>Whatever ghost town had existed prior was in opposition to the bustling park. Illuminated sparingly by a crescent moon, the Ferris wheel relied on its dim, yellowing bulbs to reveal the bodies stacked in the dozen or so cabins. Each teetering cart was occupied with passengers reveling in silence, just staring at what paranoia told me was us.</p>\n\n<p>“Hey,” Sofia poked my shoulder. “Is it just me or is everyone on the Ferris wheel dressed right out of Grease?”</p>\n\n<p>She wasn’t wrong. It seemed as if a promotional photograph was taken with extras dressed in faux-retro clothing in order to harken to nostalgia of the park’s earlier days. Each passenger sat still and proper as if awaiting the flash of a camera that was not to come. It sent shivers up my spine. Something wasn’t right. “No, they definitely are. Also, I can’t shake the feeling that they’re staring at us.”</p>\n\n<p>“I mean I think they’re just looking at . . .”  She trailed off, realizing that the hundred of hungry eyes weren’t positioned towards something behind us. We were the subject of their curiosity. The bustling pathway became a magnet field attracting the other patrons to us. They moved in a brisk and silently dignified manner, not running or clawing at us but ravenously pushing ahead. Sofia ran without warning to our room.</p>\n\n<p>She struggled to find the key for our room. “Hey, it’s okay. No one’s following us anymore.” I insisted, surveyed the park again: they had paused as if frozen. They resigned to let us enter our room but their glares didn’t cease.</p>\n\n<p>“I don’t like those vacant eyes.” She huffed as she managed to throw the door open, finally finding the key. She quickly locked it behind me and flicked on the switch. A man sat at the table as if he was waiting for us.</p>\n\n<p>“Goddamn! Who are you?”</p>\n\n<p>He smiled and twirled his handlebar mustache. He was the man I had seen earlier in the room, by Sofia. Now getting a good look at him I’m not sure how I missed it the first time: he was the embodiment of their mascot. He donned a white suit and multi-colored scarf, a sombrero framed his face and casted nasty shadows upon his nose.</p>\n\n<p>“I’m Pedro,” He mused, clearly enjoying himself. He spoke with a slight Mexican accent. “Welcome to the border of hell, or rather just south of it.”</p>\n\n<p>“You’ve got to fucking kidding me.” I laughed, albeit uneasily. It seemed too ridiculous. “What the fuck are you doing here? Did Reyna give you our key?”</p>\n\n<p>“Ashley . . .” Sofia coaxed, clearly panicked.</p>\n\n<p>‘Pedro’ turned to her. “Why, you didn’t inform her of my visit? Well this is awkward! Ugh, I hate to intrude like this, you want to tell or should I?” He paused, expecting an answer. Sofia casted her eyes down, biting her lip. “Guess, I’ll do the honors. South of the Border is a scam. Not just as in a tourist trap but in its essence. We advertise up and down the east coast because we rely on ‘you people’.</p>\n\n<p>“We feed on the energy of those who happen upon our little portal to the south. We need people to visit and spend the night to survive. Are our signs obnoxious and vagrantly offensive? Sure, but it appeals to middle America—we’ve done the focus groups. Why do you think you’ve felt enticed by a dumpy rest stop your whole life? We command it. We need sacrifices—is there any chance Sofia ever mentioned her family?”</p>\n\n<p>I didn’t respond, I don’t think I could if I wanted to.</p>\n\n<p>“No, of course not.” He chuckled, shaking his head to feign disbelief. It was a rouse to turn us against each other. “Now I, in particular, only require a sacrifice every decade. I entice someone to stay in room 305 and I make them a deal they can’t refuse, in return, I get one of each generation they span. It doesn’t sound like much but it&#39;s an investment. I always get what I want. I had the pleasure of running into Sofia’s grandmother back in my heyday, and since I’ve had her mother and I will have her . . . All in trade for her husband avoiding the war.” He paused to laugh again. “Didn’t get to go to Vietnam because he had a terrible car accident before he could be drafted, I like specifics. Avoids confusion. Well now Sofia is my only option! An only child, can you believe that? Was gonna leave her father all alone in the world unless she brought me a replacement. You.</p>\n\n<p>“You are her only chance at survival. One must die, the other can live. I’m not greedy.”</p>\n\n<p>She lured me here. She knew what was going on this whole time, she was never scared for us, she was scared for herself! I could feel myself boiling in rage as Pedro laughed. I had taken their bait.</p>\n\n<p>“Ashley, I am so sorry.” She lunged at me, the knife she had used to cut her waffle in her hand. She must’ve stolen it from the diner. I had no chance to escape. She stabbed my thigh and I screamed in pain. Her eyes were as vacant as the people we encountered on our way to the devil. She disassociated as she stabbed again aiming my heart, I struggle to push her off.</p>\n\n<p>“I want a deal,” I croaked. “You like deals, let me survive. Let me walk away with no wounds.” He smiled wickedly and snapped, Sofia flailed wildly before falling still while my wounds healed.</p>\n\n<p>“I look forward to this day ten years from now.” and with that he was gone. The body, however remained. He handed me Sofia’s knife. “I still require a sacrifice.”</p>\n\n<p>I’d like to say I didn’t stab like she had stabbed me. Nonetheless, I had. I killed her and threw body out to the hungry vultures outside that took such great interest in us, that was they were. Starving predators that waited for their prey to do all the work for them. Pedro had won. He got his sacrifice and he would get another, someone I would undoubtedly love.</p>\n\n<p>Still, I got into my car and I headed for Virginia Beach to see my family. I’d tell them I finally visited South of the Border and it wasn’t nearly fun as I imagined it would be. It was best, I’d admit. That you guys never took me as a kid: would’ve been a waste of time.</p>\n\n<p>I beg you to offer no mind to the hundreds of signs promoting South of the Border. It’s a trap, a death sentence for you and your family. It is dingy and corrupt and despicable in so many ways; protect yourself. Be stronger than the signs, do not let them entice you. </p>\n\n<p><a href=\"https://imgur.com/a/XVjI3sY\">Do not make a deal with Pedro. </a></p>\n</div>\n","author":"AshleyJoy03"}