{"rank":"106","title":"There’s Something Going on at the House I Babysit for.","id":"8lk6pb","url":"/r/nosleep/comments/8lk6pb/theres_something_going_on_at_the_house_i_babysit/","time":"1527088777000","body":"<div class=\"md\"><p>I began babysitting for my mom’s friend a few months ago. She has three kids, a girl slightly younger than me, a 10 year old boy, and another girl I think is around 5 or 6. The first time I babysat there, the parents weren’t going far, only to a friend of theirs party, and said they would be home around midnight. They were very welcoming, said I could raid the kitchen if I wanted, and left us to it. The boy was playing on his iPad in his own little game room, and the two girls were sitting in the living room playing board games. </p>\n\n<p>I sat in the living room, I distinctly remember Spider Man 2 being on the TV, until one of their two dogs began barking incessantly out in the hallway. I went out to check, and he was standing at the bottom of the stairs, going absolutely crazy. It was a little freaky, but I figured maybe the boy had gone upstairs and the dog was barking after him. When the boy came into the hallway and asked what was wrong, I seriously started to feel uneasy. I quickly picked up the dog, holding it away from me as it continued to bark and growl, and took him into the living room, and tried to forget about how unsettling him barking at the empty cold stairs was. </p>\n\n<p>I sat and played board games with the girls, occasionally going to check on the boy, until the youngest girl told her sister she wanted to go to bed. The oldest girl took her upstairs, and I can’t lie I felt a bit useless. Everything went fine, and I asked the oldest girl when she came back downstairs where the bathroom was. Out in the hallway, there were two doors, both with cute, Pinterest style signs for bathroom on them. I was about to say thank you and head towards the bathroom on the left, but she quickly told me to go in the other bathroom. At that point I didn’t think much of it and went into said bathroom. </p>\n\n<p>Later when all of the kids were in bed, I had to go to the bathroom again. I decided to go into the other bathroom, not thinking much of it. Immediately, the room was extremely cold and I could see my breath in front of me. I more or less ignored it, maybe I was just really warm after having the fire on in the living room. I did what you do in the bathroom, and went to leave. The door was jammed. The handle wouldn’t turn. I took a step back and looked at the door, maybe there was a lock higher up on the door, or something stuck in the hinges stopping it from opening. Seeing nothing, I attempted to open it again, jiggling the handle as much as possible, even pushing all of my weight onto the door. I started pushing on the door, thumping into it with all my weight, trying to somehow make it open. As I panicked more and more, my brain went through as many solutions as possible. Maybe I should shout - wake one of the kids to see if they could open the door from the other side. But I didn’t want to scare them; and that would definitely scare them. Maybe I should call one of the parents? I didn’t have either of their numbers on my phone. Stupid of me to not put it in my phone when I saw it on a post it note in the kitchen. I decided to call my mom. No service. With tears brimming in my eyes, I just kept pushing on the door and wiggling the handle. Suddenly the door flung open. I almost fell, but managed to stop myself. At the end of the hallway, I could’ve sworn I saw a shadow. It looked like the oldest girl was standing at the end of the hall, but because it was dark I couldn’t tell, and when I went to open my mouth to speak to her, she disappeared into the darkness of the hallway. The funny thing is, she had passed the stairs and was going in the direction of the kitchen, but I didn’t hear her go into the kitchen, or even go back up the stairs later that night. Without looking back, I ran to the living room and shut the door behind me, and spent the rest of the night with all of the curtains closed, curled up on the couch trying not to shake. </p>\n\n<p>Just after midnight, I went home and prayed I wouldn’t have to go back again. The house just seemed creepy to me, and looking back I realise my instincts were completely right. </p>\n\n<p>A few weeks later I was asked to come and babysit again, and because I’m a poor high school student and they payed me very well, I said yes. </p>\n\n<p>Everything was normal that time, and for the couple more nights I babysat the house nothing creepy or strange happened, except for footsteps above me, which I’m trying not to ponder too much, because in all honestly it’s probably just one of the kids waking up, or even one of the dogs. I pretend that both dogs aren’t in the room with me when it happens. </p>\n\n<p>Two weeks ago, I babysat at the house again. Things went relatively similar to the first time I babysat at the house, the dog barking at the stairs, the kids being super well behaved and quiet. After they went to bed, I had to go to the bathroom again. This time I made sure I didn’t even look at the door of the left bathroom, and was in and out as quickly as I could. The light was off in the hallway, so I had put my phone torch to get the the bathroom. When I was leaving, it suddenly became dark and I assumed the torch had gone off. But within a split second I realised the bathroom light had gone off, and suddenly the bath had begun running. But there was no bath in that room. Only in the other bathroom. I again ran into the living room, standing at the slammed close door, shaking and hyperventilating. I listened closely, the bath was still running. It was a loud bath, with an electrical drone coming from the walls when it went. I realised it would likely wake up one of the kids, and came to the conclusion I would have to go turn it off. And even if nobody woke up, I had no idea how long it would be until the parents came home and I thought that the bath would overflow and create a huge mess I couldn’t even begin to explain. </p>\n\n<p>After a few minutes, I finally plucked up the courage to go turn the bath off. I slowly opened the door, torch first, and crept into the dark hallway. As I reached the bathroom, I saw the door wide open, and peeked inside. There was a dark figure leaning over the tub, reaching across. It turned the tap off, and suddenly whipped its head up to look at me. My torch shone right on its face, beady eyes staring right at me like a deer in headlights. I slammed the door shut and ran. </p>\n\n<p>I stayed in the living room the rest of the night, the parents not coming home until around 3am that night. Normally, I would walk home - it was about a 15 minute walk - because they were usually pretty drunk and sometimes i was amazed they even made it home. But that night I asked the mom to drive me home - I was too petrified to go out in the dark alone. She drove me home, and it took all I had not to run into my house with tears streaming down my face. </p>\n\n<p>I haven’t been back to their house since, but am scheduled to babysit this Saturday. I’ll update if anything happens. I’m sorry if this was boring, because I know some of the things I’ve said can be explained away. But I’ve never been so freaked out in my life and I get the feeling whenever I’m in that house that I’m just not safe. I have the worst feeling of dread that something horrible is going to happen as soon as I step foot in the house, and am praying that this weekend goes by quickly and without anything strange happening. Please let me know if anybody has any ideas of what I could have saw. I know I wasn’t hallucinating; the look in its eyes could not have bern a figment of my imagination, I know that. People will say I was just freaked out and my mind was playing tricks on me, but I know what I saw and I have no idea what to do. </p>\n</div>\n","author":"phoebemarie12"}