{"rank":"50","title":"Stargazing, and the Star That Did Not Belong","id":"8lkcor","url":"/r/nosleep/comments/8lkcor/stargazing_and_the_star_that_did_not_belong/","time":"1527090054000","body":"<div class=\"md\"><p>The burly bear of a man was not what I was expecting from such a highly touted psychologist. The beady blue eyes still held a semblance of warmth as they peered from a wildly hairy face, and he moved with a grace that the hundred pounds he had on me belied. He seemed to have a lot of everything- hair, a big nose, a big belly. At first glance this towering mass of physical excess’ appearance almost instantly belied what I had hoped to get from this session. The earth-toned office in his home was larger than my entire studio apartment, but I still felt enclosed by the sheer nature of what I was here to confront. But then he finally spoke, I was put at ease by the basso delivered in a cadence worthy of Mr. Rogers:</p>\n\n<p>“I’m glad you could come. I know how hard it is to open yourself up to a near stranger. Trust me, you’ve made so much progress just by stepping into my office.” As soothing as his voice was, I still thought this was an odd thing to say, as therapy is supposed to be a lot of work. I would assume a psychologist wouldn’t exaggerate or give platitudes. But… men drove themselves to early graves rather than ask for help all the time. And what I was going to tell him took a lot of courage to share.</p>\n\n<p>“So you think everything wrong in your life stems from a single incident?” I was getting the sense that he was far more blunt than most psychologists.</p>\n\n<p>“Well, I have memories of that night,” I said. “Just a little bit. Nothing too bad. But I’ve been having nightmares periodically- and even when I don’t have them, I can’t sleep at night anymore. I feel too vulnerable. I took a job that pays half what I used to make just so I could work third shift and sleep during the day.”</p>\n\n<p>“And you’re certain there’s more to it than what you remember?” Dr. Hopkins filled his chair, which didn’t creak or groan under his girth. Quite the feat of engineering. The only light in the room were the lamp by the window and the one on his desk, and it made his amusing form seem more distant and mysterious.</p>\n\n<p>“All I know is that it’s a huge line of demarcation- I dividing my life into the time before that night and the time after. <em>Something</em> happened.”</p>\n\n<p>“Well, we’re going to get to the bottom of it, I promise.”</p>\n\n<p>It occurred to me that whatever we might unearth might be traumatic to recall; Dr. Hopkins gave no such warnings. He also didn’t speak or move, just looked at me expectantly from his chair. I almost laughed at myself when I realized I was too tense to even sit down. I promptly plopped down on the medical couch. It felt like sinking into marshmallow fluff, and my trepidation started to slowly melt away as I melted into the couch. Just like in the movies, I wasn’t facing him- hey, I’d never gone to any kind of a therapist before. I took nothing for granted in regards to expectations vs. reality.</p>\n\n<p>“Have you ever been hypnotized before?</p>\n\n<p>“I’m going to be right here with you. If you start to get scared, just look at me and remember I&#39;m here with you.&quot;</p>\n\n<p>“Don’t I need to keep my eyes closed?”</p>\n\n<p>“That’s the movies. What’s important is that you stay perfectly still and relaxed.” That was easy enough; sitting in that chair relaxed me so much my limbs splayed out, immobile and content.</p>\n\n<p>Time passed as a soothing blur as Dr. Hopkins guided me through the hypnosis, his voice drowned out as I imagined the gentle crashing of waves comforting me into near immobility. I think he counted down from ten, but I couldn’t quite make it out. But the important part was quite clear:</p>\n\n<p>“Tell me about that night.”</p>\n\n<p>“I like to go for nighttime walks out in the country,” I explained. “Because it’s just so peaceful. And l love being able to see the stars so clearly so I got this stargazing app.</p>\n\n<p>I clicked on the it and decided to see what I could find. How it works is that you point your phone up at the sky, and it overlays a star map over the screen so you could identify the stars, planets, and galaxies. I had downloaded a previous one whose overlay was a little faulty- I would point my phone just to the left of the constellation of Orion but it would still show up on the screen. The planets and the moon would be identified by a small picture of them under their name, and I was a little annoyed how it would show the picture of the moon next to the actual moon on the screen and not on top of it.</p>\n\n<p>But this one worked just fine- it was the same principle, and moon picture was displayed over the actual moon. So all was right with the world. It even had soothing, New Age-y music. I remember the first time I saw a light in the sky that was not identified on the screen. I looked at it for a few seconds, and when it didn’t move, I thought I had observed a supernova. I was thrilled- I had always hoped the red supergiant Betelgeuse in the aforementioned constellation of Orion would explode in my lifetime. From what I knew, a supernova would take time to reach peak brightness, and I wanted to see if I could notice the change,</p>\n\n<p>But… in the end, it was a prop plane. I was sure that it had remained still for too long to be anything terrestrial, but it all came down to height, distance, and our position relative to each other. When its movement finally became apparent, it picked up fast, the buzz of the propeller announcing my little mistake.</p>\n\n<p>That was a little bit of a bummer. So that night, the night I’m here to talk about, I thought I had made the same mistake. I had been playing a little game to myself- finding galaxies. I would point the phone up and try to see if I could remember the name of the nearest one, find it, and repeat it. I just wanted to test myself.</p>\n\n<p>I had just scoped out the constellation Boötes, remembering that the galaxy M3 was just off to the right. Sure enough, a slight movement in that direction pinpointed it. I was about to test to if I was right about M63 being above it or below it in relative location when I saw it. Another light on the screen, stationary and unmarked. I dropped the phone and looked directly at it. Just for fun, I decided to see how high I could count before this prop plane’s motion became apparent to my position.</p>\n\n<p>One…two…three…four…five……</p>\n\n<p>“You stopped counting. Is something wrong?”</p>\n\n<p>“It wasn’t moving,” I explained. “I should have been able to see a difference for as long as I looked at it.</p>\n\n<p>“I see,” said Dr. Hopkins, scratching his beard with his free hand as he wrote. In the silence of the office, those thick fingers rustling through the bristle of that neat trim was awkwardly loud. I looked around at all of the gewgaws and doodads he had adorning his shelves. A little more light might have shed some in turn on his personality if I could make his stuff out better. But this ponderance was cut off when he finally spoke again.</p>\n\n<p>“And how long did it stay before what happened next?”</p>\n\n<p>“Well, I started up counting again before I knew something was up.”</p>\n\n<p>I ended up counting to twenty before I realized that this probably wasn’t a plane. Maybe I was right this time and it was an actual supernova. I realized that it might start trending pretty quickly on social media, so I did a search on Twitter and found nothing, Google, zip. My interest in astronomy didn’t extend to terminology, such as ascension and declination, and I certainly never got ahold of the maths involved. There wasn’t more I could do, so I decided to continue on my walk and check in on it a little later to see if anything changed, be it in the sky or on the net.</p>\n\n<p>So I continued down that gravel road, the way illuminated by a forehead light I wore to keep myself visible to the rare passing car. I looked to my right, back up at Boötes, not even knowing why. The light was still there. But something was off when I saw the various pinpoints of starlight around it. I whipped my phone back out, and saw that it was now displayed in the constellation Hercules. I made sure the app was still properly aligned with the sky as it had been before. The picture of the moon was directly on top of the real moon.</p>\n\n<p>Getting a crazy idea, I kept walking, keeping my eyes to my right, trying not to let the object out of my sight. It was moving with me</p>\n\n<p>If it was a plane, it should have been coming directly at me to appear to stay so still for so long, If it was a helicopter, shouldn’t have I been able to hear its propeller by now. But no matter how far I walked, it remained in its same position in the sky relative to me. It was following me.</p>\n\n<p>And then I did something pretty weird. Trying it meant I was testing a crazy, impossible idea.</p>\n\n<p>“Were you that sure it was following <em>you</em>?” The back of Dr. Hopkins’ chair seemed to loom over him. I was a little annoyed at how wide-eyed he looked- one would assume you needed more of a poker face if you were in a field where people had to tell you about their sexual disfunctions, among other things. One could imagine passing judgement in those brown depths. I ignored it and continued.</p>\n\n<p>“Pretty sure. I turned back the way I had came and still it remained beside me. I ran, and it kept pace. I didn’t know what else to do, because I didn’t want it to watch me go home- as if it would be that hard to find me, but still… so I had an idea.”</p>\n\n<p>The forehead light was just a small LED affixed to a headband; I wore it more out of consideration for drivers on the road than to help me see. I could do that just fine. But now I had a real practical use for it. So I reached up, tapped it off and back on three times.</p>\n\n<p>And the light flashed three times in turn, and remained as it was. My heart sank. It seemed ages ago from when I had thought I had witnessed a new supernova, to the moment when I knew a complete unknown. And that seemed an eternity ago when I realized this unknown was <em>aware of me</em>.</p>\n\n<p>There weren’t any Air Force bases nearby. And wasn’t that what most UFOs were- just misidentified top secret experimental aircraft? I looked behind me, and saw a wide open field with a single house off at the far end. A dog suddenly started barking non-stop off in the distance. Then another. And another. People just let them yap all night out here, somehow managing to sleep soundly despite it. But the timing kept me from wondering if I was about to have a seizure. And when I reluctantly accepted the reality of that light, I suddenly felt horribly exposed. Everything else was a gravel road, empty fields, and a few trees. Being a mile and a half from home meant this house was my only chance. It was a tiny black box, barely visible even under the full moon. It was the only hope I had, so my legs went to work. Nagging questions were ignored, such as <em>How can hiding in a house help if that light is what you think it is? Is it right to involve whoever lives there?</em> But one rose above them all</p>\n\n<p>What if I woke the inhabitants and got them to come to my aid, only to find that there was nothing there? To be greeted with an empty sky and left with little more to show for it than a manic display? To be humiliated in front of strangers-</p>\n\n<p>“If I may interject, questioning one’s own sanity is usually a defense of it.”</p>\n\n<p>I said nothing. I turned to look Dr. Hopkins’ slender form framed by his chair. The shine of his balding scalp reflected what little light there was in the room, but his eyes had retreated into the darkness.</p>\n\n<p>“That…that doesn’t sound very scientific,” was all I could muster.</p>\n\n<p>“Delusions, various forms of mental illness, do not allow for gray areas, or for doubt,” Dr. Hopkins continued. “Did you know that drug addicts are paranoid about certain groups based entirely on what drug they use? One drug causes people to think their family is out to get them. Another that it is law enforcement who is after them. The human brain is more predictable than most are comfortable admitting.”</p>\n\n<p>Suddenly, I heard scampering and giggling outside the office door, something all too familiar that made me long to get out of here. He asked me the question I was about to ask him:</p>\n\n<p>“Do you have kids?” I wracked my brain- I started to wonder if this guy knew what he was doing. The whole “Only the sane question their sanity” cliché sounded pretty iffy to me despite his explanation. It seemed more like a platitude than science. And the child running around outside made me realize that maybe he should have started with some general questions- like whether I was married and having kids-before launching straight into this.</p>\n\n<p>“Yes. One.” The balding head tilted in the shadows quizzically.</p>\n\n<p>“A boy or girl?” I stared at the figure for a long time, watching how his spindly fingers serenely gripped the armrests.</p>\n\n<p>My head started to throb as I started to think of my pride and joy, and Dr. Hopkins noticed me rubbing my temples.</p>\n\n<p>“Let’s just move on. Continue, please.”</p>\n\n<p>“I decided that any evidence, or lack thereof, was the key to the whole thing. I should have just started running, but I just <em>had</em> to know.”</p>\n\n<p>I quickly opened up the camera in my phone and started filming. I repeated what I had done with the forehead light- this time with one flash, a pause, and four rapid ones. And the light mimicked me exactly. All of it recorded. The resolution wasn’t perfect, but I clearly caught it. If I went crazy because of all this later, I’d at least know I was sane in this moment. It should have occurred to me that signaling it was a terrible idea- because that was when it started to come closer. Or simply grow. Either prospect was terrifying. My legs began to work before I even dared to think, delving immediately into the depths of my willpower to find their limits. Crazily I thought simply running to the house would be no problem, but I was halfway across that huge field before my legs started to cramp. That’s why long walks are no substitute for short runs. I was running south- if only this had all happened before turning onto this street, when the house was to the west and I could have made the run down their paved driveway. Not this uneven field. But I tried to quell the pounding of my heart in my chest and between my ears by telling myself that this light was too overpowering a threat to be outwitted by running on a smoother terrain.</p>\n\n<p><em>Way to go,</em> I thought. <em>Forgiving your mistakes by admitting this is hopeless.</em> All the while the exterior light of the garage grew ever closer- as did one behind me, as my shadow grew longer and ever more pronounced. I heard cows bellowing in the distance- I guess there were some in the field on the other side of the street I had just run from. Funny what you can miss taking nothing but nighttime walks. Off in the distance, some ways behind the house, a pack of coyotes started going nuts, a cacophony joined in by owls from the nearest tree line. It seemed like this light, this object was upsetting the balance of nature, that it didn’t belong and anything with a hint of sapience knew it. Even as the ragged sound of my breathing was slowly drowned out by a dull hum, as I realized I could read a book without squinting now, I kept up the pace. My perspective was wobbling madly but I still had enough juice to close the final fifty feet of the driveway and front walk leading to the front door.</p>\n\n<p>A loud squawk of simultaneous noise and light to my right nearly launched me off of the concrete- it was the single red pickup parked in front of the garage. Its engine, radio, and all its lights came on at the same time, despite the obviously empty cab.</p>\n\n<p>I was running just for the sake of it- the safety offered behind closed doors only just occurring to me. As I placed my hand on the front door, not bothering to knock, I realized my panicked flight had been little better than curling up and surrendering to the inevitable. Contrary to what a lot of city people might believe, folks out in the country <em>do</em> usually lock their doors, because they’re more enticing for burglars due to distance from each other and the police. But again, I was lucky, and I tumbled inside, the overwhelming brightness behind me lessening as I fell into a dark living room. I slammed the door shut behind me, blotting out only some of the blinding light that also poured in through the windows. The unknown was literally at my doorstep, and I felt like an idiot for even trying to run. There was perhaps a little more dignity in surrendering to the inevitable, or simply to stand and fight.</p>\n\n<p>The power behind the light wasn’t about to give me even a second to rest easy; a beam that could only be a searchlight dragged itself across the face of the house Every electronic device in the house came on- televisions blared to life, microwaves beeped, radios squawked incomprehensibly. But whatever good luck I had held firm and I found what I was looking for without any fruitless room-to-room searching.</p>\n\n<p>In the master bedroom there lay an unremarkable middle-aged couple. They were fast asleep, and I couldn’t wake them up. I screamed at them for help, shook them, but they were dead to the world. With a snap, the venetian blinds over their windows suddenly rose, flooding the room with light. And when I looked back at the couple, they were sitting upright- but their eyes were still closed, and their heads hung limply this way and that. They were obviously still asleep, but when they spoke, it was loud and clear:</p>\n\n<p>“When I was fourteen years old I got a concussion when I fell off a rope that I was trying to swing into a swimming hole and I couldn’t fall asleep or I might die….”</p>\n\n<p>“I spent twenty minutes in the dead of winter two years ago trying to coax a stray dog away from the interstate only to almost get hit myself while it ran off into the woods…”</p>\n\n<p>Those were memories of mine. They had happened to me, and whoever else I had told of them, I seriously doubted it had reached these randos. There was no time to mull over this, because the bedroom door to shake- I had shown the foresight to hit the lock as soon as I had closed it, which now seemed There was a bathroom, and another door inside that led to the rest of the house. There was movement outside, masked by that overpowering light. I ignored it as  I bolted out, trying to tell myself that the pitter-patters I heard elsewhere in the house where just my imagination as I tumbled through the kitchen and into the garage, pounding on the garage door opener, not knowing what else to do.</p>\n\n<p>The garage door started to slowly rise.  And as the light flooded in, I saw the shadows of at least six pairs of spindly legs cast across the floor on the unoccupied side.  That was the end of my flight, as I heard the door behind me open as well.</p>\n\n<p>“And after this, you don’t have any clear memories?” Dr. Hopkins seemed to have rolled his chair out of the light of the single lamp on his desk, his slight form hunched forward contemplatively. I wish there was something in this Spartan office to look at to distract me from his black gaze. I hadn’t moved at all since the start of the session, my limbs still exactly where they were when I first lay down</p>\n\n<p>“No. The nightmares came right after that. Just…flashes of images. Something went wrong with my life after that. I can’t find my wife and my…son.” Why did I have to remind myself of the sex of my kid?</p>\n\n<p>“Have you noticed that things just don’t seem to make sense from one moment to the next, and when you try to mentally sort them out it just gives you a headache? Do complete contradictions in your senses occur and you don’t notice them for quite some time?” I had to think long and hard about that, but I realized he was right. How sparse was his office? How did he put me under?  I think I just started talking. There wasn’t a swinging watch or even a pen to focus on, but I just started remembering. And why can’t I picture my wife and kid?</p>\n\n<p>“Because you don’t have either. At least, not as you conceive them. And no, you did not say that out loud.” He finally rose from his seat, and I realized I was wrong about there being a desk between us. I did find it rather odd that he seemed so much smaller. It was no trick of the dim light, and something else started to niggle at my brain- I couldn’t move my arms or legs. It sure as hell wasn’t because the couch was so comfortable.</p>\n\n<p>“You’re not married, young man,” Dr. Hopkins explained. “To put it one way, some wires were crossed when you were returned. You remembered too much, for one. But at the same time you remembered too little. We tried to coax you, to let you know what we were doing was for a greater good. We showed you the receiver of your donation. We showed you the child born from your combined genetic material But when you were returned, these memories we had buried wormed their way into the surface in the form of a delusion. A delusion based on a misunderstanding of your experience, and a mishap you are here to correct. I wish to apologize for the inconvenience. Science is anything but exact, even when it’s 30,000 years more advance than your own.”</p>\n\n<p>The towering, beefy, hairy form of Dr. Hopkins seemed to flicker, overlaid over a smaller form whose proportions weren’t quite human. Both still loomed over me as I lay prone on the couch. Then it hit me- not insight, but the terror I had felt in my memory, that story, finally came over me in a wave.</p>\n\n<p>The lights came, just as I remembered them, and Dr. Hopkins, the tall, burly hirsute man who was also short, slender and completely hairless slowly made his way towards me.</p>\n\n<p>“I’m sorry our tools are so uncomfortably bright. We need so little light, what with the size of our eyes, so imagine how bad it is for us. Before we conclude the session, we have some people who are here to see you.”</p>\n\n<p>I was aware of something entering from the office door. A small, slender form padded in, followed by another of the same size. I could see little more than this, due to the range of vision allowed by my paralysis. My heart was pounding, as the shadows that had haunted my dreams</p>\n\n<p>It was a child, all right. But its skull was obviously enormous, even though it was covered by a blond mop identical to my own. The large eyes were almost human, despite their size, though there was no iris of color, only a large black sphere in the center of that sea of white. It could not have looked more innocent, as innocent as the small gray creatures watching me from the shadows most definitely did not. I felt reassured, and my heart seemed like it was finally able to get back down to a double digit pulse.  </p>\n\n<p>But it was a lull, a false hope, and the thudding in my chest picked back up again when I remembered what was standing just out of my sight. </p>\n\n<p>“We are at a genetic dead end, dear boy. Our current generation could be the last without drastic measures. You were one such harvest, and we allowed your progeny to meet you once upon her insistence. And they are still quite concerned about you now. We’re all quite grateful for your help, of course, and we’ll have you fixed up and on your way in no time at all.”</p>\n\n<p>“You thought I might hypnotize you by having you focus on a pen. It’s best to do that now. Focus on the pen. That’s all it is.” It looked like a pen, but the way he held it to my forehead meant its purpose was not to draw ink across paper.</p>\n\n<p>I saw cold, enormous black eyes behind that pointy piece of metal, and I discerned no emotion behind them as my skull flared with a white-hot, ruthless wave of pain. Then, black was all I saw.</p>\n\n<p>I have to say, seeing a therapist was the best decision I ever made. Just after that one session, the nightmares went away, I could sleep again. My head was clear for the first time in a long time.</p>\n\n<p>I pulled myself to my feet. Thank God it hadn’t rained recently, or else this field would be a 30-acre mud pit. I pulled out my Stargazing app, because I still had time for a walk before heading home. That soothing, New Age music came on as I slowly moved my phone to scan the sky. Hey, what’s that between the star Menkar and the galaxy M77? It flared and winked out the instant I realized what it was.</p>\n\n<p>Nice working with you, Doc.</p>\n</div>\n","author":"DustiinMC"}