{"rank":"3570","title":"An ancient relic in government possession has blinked for the first time in 500 years","id":"8lkjah","url":"/r/nosleep/comments/8lkjah/an_ancient_relic_in_government_possession_has/","time":"1527091446000","body":"<div class=\"md\"><p>If I had to tell you who I work for, I couldn’t.</p>\n\n<p>If I had to tell you why? I couldn’t even begin.</p>\n\n<p>In my youth, I had always found myself being interested in archaeology and the unknown. As a child I pictured myself as Indiana Jones, running about searching for artifacts and fighting off treasure hunters of all sorts - Nazi or self-employed.</p>\n\n<p>When the time came for me to begin college, I knew I had to follow in my father’s footsteps and try for Boston University. Not only to please my father and get him to pay for the fees but for another reason entirely: They did offer an Archaeology Major.</p>\n\n<p>As most would probably imagine, finding work in the field that bears fruit is no easy feat.</p>\n\n<p>I was living in a studio apartment alone, surfing through back pages of google looking for any jobs related to archaeology that had nothing to do with teaching where it all began.</p>\n\n<p>“Looking for archaeologist to fill positions on study team *HIGH PAY-RATE*”</p>\n\n<p>It took me quicker to send the author of the post than it took me to realize I never even read the contents of the post, even after all these years.</p>\n\n<p>In the following week, when I was doing my morning email check and trying to figure out how to scrounge enough cash to pay for my rent, I had an email from a person I wouldn’t even begin to try to recognize. On top of the fact that their email name looked like nothing more than an extra long license plate, the message only gave me a only a single phone number.</p>\n\n<p>In a combination of curiosity and desperation to work, I called.</p>\n\n<p>A light, enthusiastic yet hastened voice picked up.</p>\n\n<p>“Hello?” Sounds like someone was going somewhere in a hurry.</p>\n\n<p>“Hi, uh, this is Daniel K****. I am inquiring about an email sent to me giving me this phone number.”</p>\n\n<p>“Daniel, good to hear from you! I am Dr. Roberto Sanchez, let me explain what you’ll be investing your time in…”</p>\n\n<p>That was almost 9 years ago.</p>\n\n<p>__________________________________________________________________________________________________________________________________________</p>\n\n<p>I work for the government, you could say.</p>\n\n<p>Why? Well, for the money of course.</p>\n\n<p>On my first day, me along with a few others in a small team were to fill out various papers and confidentiality/non-disclosure forms. It was grueling and in the moment I missed nightly homework and research papers back in my schooling days.</p>\n\n<p>The department director, Dr. Sanchez is a small man, no taller than 5’5. He always shaved his facial hair, save for the mustache that he wore(and styled, becoming a joke amongst my colleagues). His demeanor however, despite his always serious and blank expression was in contrast as he proved to be an incredibly kind and candid man.</p>\n\n<p>Yet the field we were in was no place for the kind and candid.</p>\n\n<p>Dr. Sanchez had several “relics” in question, that we individually were assigned to study and figure out the various mysteries behind the objects, I was not given clearance to see what my colleagues relics were and like me, they couldn’t see or talk about what mine was.</p>\n\n<p>I remember the first day I laid my eyes upon it.</p>\n\n<p>“You may pick it up, if you’d like. The capsule it was found in, along with a letter are on the table behind it. The board of directors calls this one ‘The Makers Mark’ due to the letter, which I encourage you to read.”</p>\n\n<p>“What is it exactly…  ?” As I held a beautifully crafted medallion no bigger than my palm up to the light.</p>\n\n<p>He went on to explain “We know that in the 1500s this was found by the secretive Royal Expedition League, a short term group founded by the young king at the time. None knew of the organization&#39;s existence except for the people who they sold the capsule to; The Vatican.”</p>\n\n<p>The large coin appeared to be some sort of amber-gold color, with a finely chiseled “M”</p>\n\n<p>Protruding ever-so-slightly from each side of the coin, the letter appeared to be made from a lighter shade of sapphire.</p>\n\n<p>“Certainly an interesting history, but what about the science? What is this thing, in a literal sense?”</p>\n\n<p>Dr. Sanchez let out a sigh and rested his hand on the corner of the table. “Well, this is the rather difficult part but… we ran the artifact, along with the capsule and letter it contained through carbon dating.”</p>\n\n<p>I raised my brows. “And?”</p>\n\n<p>“It originally read 4.543 billion years.” He said.</p>\n\n<p>The idea this artifact was as old as the earth itself is absolutely ridiculous. “Impossible.” I said with certainty.</p>\n\n<p>His face seemed to grow even more serious. “I would’ve thought the same, but we ran it through again and again until we were certain. The dating read the same. Something about this isn’t right, read the letter for yourself. For now, I must go to a meeting on the second level.”</p>\n\n<p>Without saying further, he swiftly turned and walked out the open door and closed it slowly behind me, to leave me in my peace with whatever the hell this thing was.</p>\n\n<p>I turned on my computer, knowing I was tasked with figuring out what this thing was.</p>\n\n<p>It was when I picked up the letter which was more similar to a scroll than a letter, a certain feeling of dread which grew as I read every word.</p>\n\n<p><em>“When men are on the path to extinction, and they have created their own demise. I will make the world again.”</em></p>\n\n<p>That was only last month.</p>\n\n<p>__________________________________________________________________________________________________________________________________________</p>\n\n<p>Today is the day, or tomorrow. Maybe even next week, I don’t know when, but soon.</p>\n\n<p>You must be wondering what I am referring to. The answer to that you can see for yourself.</p>\n\n<p>I was in my office earlier, which in time became more of a personal lab as I discovered what little I could about the artifact in question. However today something happened that never happened before, and when it did I swear I could almost feel the sweat cascading down from my hairline.</p>\n\n<p>It started to glow - not glow, blink.</p>\n\n<p>The new light shade of blue shining from the “M” was blinking slowly, but there was a pattern.</p>\n\n<p>It didn’t take long to put it together. When it hit me I rushed to a pencil. Morse code.</p>\n\n<p>As the pattern changed here and there I hastened my writing.</p>\n\n<p>I already knew what it said before I finished, and for once my heart truly dropped as I read the message back to myself:</p>\n\n<p><strong>“Make peace with your end, I have awoken.”</strong></p>\n\n<p>Part 2: <a href=\"https://www.reddit.com/r/nosleep/comments/8lwv5h/an_ancient_relic_in_government_posession_has/\">https://www.reddit.com/r/nosleep/comments/8lwv5h/an_ancient_relic_in_government_posession_has/</a></p>\n</div>\n","author":"Gorbado"}