{"rank":"8","title":"Have you ever heard of the Skateboard Man?","id":"8lkrtv","url":"/r/nosleep/comments/8lkrtv/have_you_ever_heard_of_the_skateboard_man/","time":"1527093244000","body":"<div class=\"md\"><p>Have you ever heard of the Skateboard Man? He’s been on the news where I live lately. Nobody knows what his name is, where he came from or what he wants. All the reporters know is that he has killed 8 people so far and that he has no legs. How does he get around? By lying on a skateboard and pulling himself along with knives. I guess the noise he makes is the last his victims ever hear.</p>\n\n<p>I don’t have long so I need to get to the point. Yesterday I had an encounter with the skateboard man. This is what happened.</p>\n\n<p>I’m 15. My name is Isabelle. 2 days ago, my parents left for a 4-day holiday, leaving my 7-year-old sister and me behind, thinking we were mature enough to take care of ourselves. The day after they left, my sister and I were enjoying our temporary freedom, and we were already 4 hours into a Netflix binge session and 3 quarters into our fourth tub of ice cream before I decided to take initiative as the older sibling and tell my sister it was time for bed. My sister refused, saying that it was unfair that she had to go to bed when I was going to stay up for many more hours. I started arguing with her, but I realised I was fighting a losing cause, so eventually gave in and agreed to go to bed. However, before turning off the TV, I turned on the news.</p>\n\n<p>A local reporter announced a deal at the butcher near our house and then announced that the alleged “Skateboard Man”, had been spotted in our area and to make sure all your doors and windows are locked. This worried me slightly, but I always had a great deal of trust in my town’s police department, so I told my sister to go get ready for bed while I went around checking all the doors and windows. They were all firmly shut. I fed our cat and headed to our room.</p>\n\n<p>My sister was standing in our room when I came in. We share a bunk bed, and she usually sleeps on the top bunk. But today, she wanted to sleep on the bottom bunk. As I had done many times before, I explained to her that I was too big to fit on the top bunk. But she persisted and refused to sleep otherwise. I was already exhausted so I finally gave in and agreed. I turned off the light and squeezed into the top bunk.  </p>\n\n<p>I’d been trying to fall asleep for 20 minutes, still preoccupied with thoughts of the news report when my phone buzzed. It was a text message from my neighbour.</p>\n\n<p>23:59: From Howard: Hey Isabelle, I was about to go to bed when I noticed there’s a red skateboard poking out from under your car. Did you forget it out there? Just thought I’d let you know since it’s meant to rain tonight, and I wouldn’t want it getting damaged!  </p>\n\n<p>Usually, I would have run outside to get it since I love skateboarding, but something was off. I could see my skateboard hanging on the wall. That wasn’t my skateboard.  </p>\n\n<p>Almost simultaneously, I felt a glacial gust of air on my face. After a moment of thought, I realised that it was coming from my window. “That’s odd,” I thought to myself, “I locked that just a while ago.” This, of course, instantly sparked fear in the depth of my heart. I knew that I had to be strong, for the sake of my smaller sister, and managed to convince myself I had just forgotten to check it was properly locked. After locking the window again, I decided it would be smartest to stay awake, just as a safety precaution. My sister slept soundly on the bunk beneath me, and as the hours went by I felt my eyes dropping lower and lower, as I jolted awake over and over again. Around the 3rd hour, this happened, I heard a sound. I was instantly wide awake again. I didn’t know what the sound was, but it struck fear into my whole body.</p>\n\n<p><em>Tk chhhh… Tk chhhhh… Tk chhhh</em></p>\n\n<p>The sound of metal scraping along the ground. And a second later I saw the door creak open. He was there. A bald, short man, lying on a skateboard. I let out a whimper, and he looked up at me. Except something was wrong. His eyes were white. As if they had been stripped of their colour, and of any emotion. He smiled as his eyes bore into my soul. He sat there for about 2 minutes, craning his head back and forth as if he was trying to get the best possible look at me.</p>\n\n<p>Frozen to the spot by his penetrating glare, I felt like my heart stopped beating and my lungs stopped pumping air.</p>\n\n<p>Then he turned to my sister, and once again I heard that demonic sound as he dragged himself closer and closer to her bed. I screamed for my sister to wake up, but it was already too late. I heard a scream from below me and then silence. As I peered over the bunk bed’s side rail, I saw the Skateboard Man staring up at me once again. And then he tried to get up to me. Furiously scratching at the ladder, with more energy and force then I thought was humanly possible. He couldn’t get any higher than the first rung, but he continued anyway, foaming at the mouth and still smiling from ear to ear. I was already crying like a small child, and I curled myself into the foetal position and sat in the corner of the bed and tried to cry myself to sleep and convince myself that this was all just a bad dream.\nI woke up the next morning. I remembered what happened the previous night, and peered over the bed hoping it was all a bad dream, but I saw thousands of scratch marks on the ladder and my sister’s corpse lying on the bed. I threw up, this was all much too much for me. Why should these things happen to me? What have I done?!  </p>\n\n<p>Except I hadn’t noticed the worst part yet. On the wall next to me, an eerie message had been carved.</p>\n\n<p><em>See you tomorrow, Isabelle</em></p>\n\n<p>My heart skipped a beat, and I was sick again.</p>\n\n<p>Help. I don’t know what to do, how do I prepare for this? I don’t want to die tonight.  </p>\n</div>\n","author":"themattmace"}