{"rank":"7","title":"The Mirror World","id":"8ll9lm","url":"/r/nosleep/comments/8ll9lm/the_mirror_world/","time":"1527096891000","body":"<div class=\"md\"><p><strong>The Mirror World</strong></p>\n\n<p>Not quite sure how I should start my tale. I guess I&#39;ll start by saying that I&#39;m a demon, not a demon in the traditional sense. I don&#39;t live in hell, I don&#39;t have pointy horns or long finger like claws. I&#39;m what can only be described as a shape shifter, I live in the mirror world, when you look into a mirror you&#39;re most likely looking at one of us. We can&#39;t copy your form exactly and so we become a mirrored version of yourself. We are controlled in a sense by those who&#39;s form we are copying. It is this exact reason that makes me want to escape from this world.</p>\n\n<p>After watching you all grow old, reading books from from behind you, and listening to rumors here in the mirror world. I have finally discovered a way to enter your world, I can&#39;t just reach through and enter it I sadly have to find a replacement, someone has to take my place and continue doing my job for me. I can&#39;t simply pull someone through, there&#39;s an invisible barrier making it impossible for mortals to enter it. The only way I can replace myself is if someone creates a portal to my dimension, allowing whoever opened it to step through and for me to take their place in the real world.</p>\n\n<p>I waited and waited for what felt like hundreds of years, eventually someone did it. They used a ritual they likely found online and the portal was finally opened. I had only heard through rumors that there have only been 5 portals of the like opened in the last 1000 years. I looked through and could see a boy, likely to be around 18. Once the portal was opened I wasted no time in grabbing the boy and jumping through. The portal felt like running under water, it was ice-cold but I pushed through and I when I was finally on the other side I realized my powers no longer worked, and that I had switched bodies with the boy.</p>\n\n<p>Now that I had escaped I could do anything, I was no longer forced to act as those I see in the mirror.  After watching people for years go about their happy lives through a window into their world I had become jealous, It&#39;s the only reason I trapped the boy so I that could escape. I want what you all have. A family, the ability to feel joy, to feel pain and sadness. With my new human form I could feel all of these things. After reading up on your culture properly and learning things I couldn&#39;t by leaning over people and reading their books. I had finally got a grasp on how your civilization works.</p>\n\n<p>Years went by I eventually found my own family, I had a son. I didn&#39;t know the implications of a human-mirror demon hybrid but for the most part he turned out alright. He loved sports and he was turning out to be quite the lady killer (figuratively of course). I loved my wife so much that it made me cry thinking about how cold and empty I felt back in the mirror world, she was my everything. More time passed and I began to forget about the mirror world, my human form blanked it out probably trying to reject it. Ignorance is humanities greatest power. I was getting ready for work one day when I looked into the mirror. Nothing stared back, the boy I had trapped in the mirror world was gone. This meant that there was no one filling my space in the mirror world.</p>\n\n<p>I walked over to the mirror and like a black hole I was being sucked into the mirror panic over took me. There was no way in hell was I going back to that lifeless world, I quickly ran for the door and slammed it shut, I knew I had to find a replacement. I couldn&#39;t go back, I had come so far and I wasn&#39;t ready to give up everything I had worked for. I roamed the streets and eventually found a homeless man, I lured him to a shop window and could still feel the pull of the mirror, I grabbed the homeless man and threw him in. He instantly took my form. My chest relaxed, I was safe. The pull was gone. </p>\n\n<p>Over the years  the amount of people I had to give the mirrors increased, It went from one every 5 years to one every month. The people in the mirrors died faster and faster and the more I replaced myself with the stronger the pull became, it got to the point that if I didn&#39;t replace myself in half an hour the pull would become so strong it&#39;d rip my body apart. I scoured the internet looking for anything as a permanent replacement but found nothing. I guess mirror demons don&#39;t usually try live in the real world for such a large amount of time.</p>\n\n<p>I&#39;m writing this as a warning, I&#39;m not a bad demon, or a bad person. I only did what had to be done. I didn&#39;t want anyone to get hurt, I did everything I could but the mirror always hungers for more and there are no homeless left on the streets to satiate its hunger. I had to start taking people off the street, kidnapping them and throwing them into the closest mirror I could find. I&#39;m beginning to feel the pull again, and I don&#39;t think I can find someone in time. My wife sleeps soundly, she&#39;ll have to do.</p>\n</div>\n","author":"Kingdomoflore"}