{"rank":"182","title":"High Anxiety","id":"8llnz8","url":"/r/nosleep/comments/8llnz8/high_anxiety/","time":"1527099851000","body":"<div class=\"md\"><p>“You smoked too much again, didn’t you?” My boyfriend, Ryan said with a chuckle.<br/>\n&nbsp;  </p>\n\n<p>“No, I haven’t even gotten the chance to smoke yet! Besides you know if anything it helps chill me out. I just…think I’ve been reading one too many NoSleep stories. I’m starting to let my imagination run wild.”<br/>\n&nbsp;  </p>\n\n<p>“You’re always getting lost in that pretty little head. Do I have to sneak out of work and get you back out? It’s pretty slow tonight anyway.”<br/>\n&nbsp;</p>\n\n<p>He wasn’t wrong. Ryan knew me like a book. I spend so much time in my own head, my thoughts constantly going a mile a minute and an imagination as active as a young child’s, and it shows quite obviously. I don’t consider it a bad thing. At least, not most of the time, unless I start thinking about the wrong things and depress myself or freak myself out, tonight being the latter.<br/>\n&nbsp;  </p>\n\n<p>“No, honey, I’ve got the boys with me. Bo’s sitting on the couch and Tuck’s tearing up his bully stick on the floor, like usual. They got mommy’s back.”<br/>\n&nbsp;  </p>\n\n<p>“Well they <em>are</em> protective of their momma. It sounds like they’ve got it handled over there then, sweetheart. I better get back in there, but call me if you need me, okay? I love you.”<br/>\n&nbsp;  </p>\n\n<p>“Thanks baby, I love you too!”<br/>\n&nbsp;  </p>\n\n<p>I was being paranoid again. I never liked being home alone at night, and with Ryan being the GM of a restaurant that stays open pretty late, it came with some late night closes for him and opposing schedules for the both of us. I’ve always been this way since I was a kid, afraid of being by myself at night, of course then it was more normal. Never grew completely out of it, I guess. So I called my boyfriend for some reassurance. I didn’t do this often, if ever, but whenever my anxiety is high he just always seems to know how to calm me down.<br/>\n&nbsp;  </p>\n\n<p>I finally changed out of my work clothes and hopped in the shower. It felt good to finally settle in and unwind. I get home around 6:30 every evening and have a routine of taking care of our dogs Joey (“Bo”), a Jack Russell mix, and Tuck, a pretty cool mix of different medium-sized breeds but I’ll just sum him up to being 100% good boy. Anyway, their walk and dinner come before my settling in. After I finished my shower, feeling surprisingly more relaxed, I put on some pajamas, grabbed a bowl and watched some Always Sunny as I basked in the smoky ambience around me, feeling my body finally ease of pain and tension and sink into the couch. Say what you want about weed, but when you’ve got anxiety and chronic back pain, it’s all a gal could ask for. It&#39;s not like I&#39;m some do-nothing bum, I work very hard. But I’d take this over pain killers that make my head spin and stomach queasy any day.<br/>\n&nbsp;  </p>\n\n<p>About 30 minutes goes by and Tucker suddenly pops up from a snooze, stares at the door, and immediately begins to growl. This usually doesn’t strike me as odd, since we live in a smaller ground floor apartment in a small building where you can hear pretty much anything out in the hallway. I figured he heard the neighbors across from us leaving or entering their apartment, so I crawled over to calm him down.<br/>\n&nbsp;  </p>\n\n<p>“Hey, hey bud, settle down, it’s just the neighbors!”<br/>\n&nbsp;  </p>\n\n<p>I guess he’s learned the “just the neighbors” phrase quite well at this point because he immediately calmed down, but then only seconds later proceeded to get up and gallop over to the front door and sniff around. I wasn’t letting myself get too worried because Joey stayed put, cuddled up on the couch with zero interest in whatever Tuck was doing. I walked over and checked the peep hole just to quiet the little voice in my head, and of course, nobody was there.<br/>\n&nbsp;  </p>\n\n<p>“See, Tuck? I checked. It’s all good, you goof ball.”<br/>\n&nbsp;  </p>\n\n<p>He stared at me for a moment and honestly it made me feel a little nervous, so just to reassure myself, I quickly and casually checked my bedroom, closet and bathroom, ensuring all the windows were locked (when were they not, though? I don’t think I opened them once since we moved in) and nothing was out of place. Seeing nothing out of the ordinary and feeling rather silly, I came back out to the hall where Tucker still stood by the door. He let out a quiet “boof” and stared at me.<br/>\n&nbsp;<br/>\nThen it clicked, and I remembered he did this when he just wanted something.<br/>\n&nbsp;  </p>\n\n<p>“Ahh, I see what game you’re playing. You just want to goooo…outside?!”<br/>\n&nbsp;  </p>\n\n<p>Tucker immediately starting jumping and Joey quickly ran over and followed suit.<br/>\n&nbsp;  </p>\n\n<p>“Well, that certainly got you up, didn’t it, Bo? Alright alright, let me get your leashes.” Yes, I talk to my dogs like people. It helps me feel less…alone. Dog owners understand.<br/>\n&nbsp;  </p>\n\n<p>I was less than excited to be giving them another walk after having just showered and it was humid as hell outside, but it’d been raining for over a week where I live. Having not been able to visit the dog park I know they had a lot of energy to get out and I felt bad. So I leashed them up, not letting my door close entirely because our door’s been jamming and maintenance hasn’t yet come to fix it, and we were off on another good leg stretch.<br/>\n&nbsp;  </p>\n\n<p>I took the boys on a good 30 minute walk around my complex, down the road and up through the fields surrounding our buildings. It was dark by this point, but I didn’t mind it. We’d been here for months now and I felt safe enough in the area. With the dogs and decently lit paths, I had no concerns.<br/>\n&nbsp;  </p>\n\n<p>The rest of the night was pretty uneventful. I relaxed, had a light dinner, and got ready for bed. I usually smoke a small bowl right before bed because it helps me sleep. I’ve been a restless sleeper for a while now with my back issues and after trying melatonin and ZzzQuil, it seemed that for me, Buddha’s broccoli was the most effective sleep aid.<br/>\n&nbsp;  </p>\n\n<p>I flipped on the cable to see what was on only for it to show my local news channel. Ryan sometimes liked to catch up on today’s latest before going into work. <em>Of course</em> they’d been halfway through a segment regarding a recent break-in gone wrong the next town over. The poor woman and her infant child were home alone only to be bludgeoned to death when the woman woke up to the sound of her child screaming. They figured the child had woken up as the intruder made his way through her bedroom, the poor thing.<br/>\n&nbsp;  </p>\n\n<p>“Ha, yeah, okay. This is just what I need. Now I remember why I don’t watch cable TV.” I shuddered as I switched back to Hulu and started binging The Golden Girls for about the 300th time (another form of anxiety relief). While I was curled up on the couch watching more quality television in my inebriated haze, I began hearing noises. It’s not totally uncommon, with my loud upstairs neighbor and learning the noises my apartment makes as it settles at night, I didn’t think too much of it.<br/>\n&nbsp;  </p>\n\n<p>Until Tucker started to growl again. I looked over at him and saw the hairs standing up all down his back, and immediately felt tense again. I figured in my half-conscious state he’d heard someone out in the hall or my neighbor stomping around and I’d simply missed it, so I leaned over to pet him and ease his distress.<br/>\n&nbsp;  </p>\n\n<p>“Tuck, we’ve been through this, bud. It’s just the neighbors.”<br/>\n&nbsp;  </p>\n\n<p>He seemed to relax a bit and I was going to sit back in my little corner. I turned up the TV so that any background noise was drowned out, until I heard Joey “boof” from under the covers. I looked over to the lump that was my dog under the blanket with his snout sticking out as he started sniffing the air curiously, with purpose. He started making his way out from under the covers as Tucker started growling again, stopping only to whine as the hairs on his back stood up again. I was starting to get a bit more irritated than worried at this point. It’d been a long day and I just wanted to be a couch potato for the night.<br/>\n&nbsp;  </p>\n\n<p>“What is going on with you two? You got two great w-a-l-k-s today, it’s time to chill out.”<br/>\n&nbsp;  </p>\n\n<p>They remained firmly in place side by side, staring at the hallway, ears erect and chests out. I felt the anxiety creeping up and like the flip of a switch my mind began racing again. “There’s no way anyone is really here. Don’t let your imagination get the best of you now. Relax.”\nBut I couldn’t relax. Sure I had my dogs with me, but their bodies weren’t relaxing and their focus was still towards the hallway. What if someone was actually there? I lost my mace at a recent concert, and I don’t own a gun. It was all but effective in trying to convince myself that I was overreacting <em>again</em>, that there were no serial killers hiding behind a door waiting to kill me, that there was no Tommy Taffy lookin’ psychopath posted up in my closet, no glowing eyes in the contrast of my dark bedroom, nothing supernatural in the reflection of my mirror.<br/>\n&nbsp;  </p>\n\n<p>But hey, better safe than sorry, so for good measure I grabbed the biggest knife I owned from my kitchen and made myself inspect the apartment…again. Our apartment isn’t very big, mind you. A good 700 square feet and some change. Our bathroom is so small that Ryan and I can hardly be in it at the same time, so that wasn’t a concern. One dramatic pull on the shower curtain with nothing to appear behind it and I could feel the anxiety already begin to fade. I walked across our narrow hall to the bedroom and went right to my walk-in closet. With one dramatic pull on the string the light came on, revealing…nothing. With a sigh of relief I started to laugh. Partially from my flowery daze, but mostly because I just felt ridiculous walking around what I considered a fairly safe, if not small apartment with a butcher’s knife and my phone ready to dial 911. At any rate, where could a deranged killer even hide in here, if not in any of the few potential places big enough I already checked, right?<br/>\n&nbsp;  </p>\n\n<p>“Okay, maybe Ryan was right. I’ve definitely had enough,” I rolled my eyes at myself as I shot him a goodnight text before shutting down the living room and herding the boys to bed. I double checked that the front door was locked and deadbolted, the sliding glass door to the patio was locked and the Charley bar was down. I guess I let my anxiety get the best of me because I glanced at the clock on my oven and it was already 11:30, way past my bedtime on a work night (I’m an old lady in a 20 something year old body, okay?). I hurried to bed, putting on one of my favorite shows with volume down to fall asleep to. I usually slept with ear plugs but had run out, so I just threw on my blindfold and was finally ready to drift off peacefully.<br/>\n&nbsp;  </p>\n\n<p>“Everything is just fine, you checked everything.” “If someone even wiggles the door knob the dogs go nuts, you’re <em>fine</em>,” I repeated to myself. The boys just sat there staring at me for a while, but I was tired and had a long day ahead of me and really needed to get some sleep, so I made them finally lay down and they tucked themselves in close to me as I tried to push the little voice of uncertainty away in the back of my mind. I could tell the pups weren’t quite relaxed, but I chalked that up to them still having some energy from earlier. They’d get comfortable in a few minutes and all would be well. They really are great little guardians.<br/>\n&nbsp;  </p>\n\n<p>As my breathing began to slow, I felt myself starting to cross the threshold between awake and asleep. “How could anyone have gotten in here without being noticed, anyway?” I felt myself smirk at such a thought.<br/>\n&nbsp;  </p>\n\n<p>And then it hit me.<br/>\n&nbsp;  </p>\n\n<p>The door.<br/>\n&nbsp;  </p>\n\n<p>I’d left the door ajar on their walk.<br/>\n&nbsp;  </p>\n\n<p>My heart dropped and I heard a small growl from the dogs as a low, guttural whisper reached my ear:<br/>\n&nbsp;<br/>\n&nbsp;  </p>\n\n<p><strong><em>“You forgot to check under the bed.”</em></strong><br/>\n&nbsp;  </p>\n</div>\n","author":"JacqiPro13"}