{"rank":"2","title":"Have you heard of the Brack?","id":"8llx7l","url":"/r/nosleep/comments/8llx7l/have_you_heard_of_the_brack/","time":"1527101817000","body":"<div class=\"md\"><p>I stayed late at work last night to finish up a few odd ends. I work the typical 9-5 job in an office. Everyone usually runs to their cars by 5pm sharp, and usually, I&#39;m right there with them; except last night.  </p>\n\n<p>It was about 6:15pm when I heard a scraping noise. I have a window in my office, so I just ignored it and chalked it up to being a tree branch from the wind.  Only a few minutes had gone by when I heard the scraping noise again, except this time it was coming from the entrance of the building. Odd, yes, but in my head, this still could have been the wind. I continued with my work, hoping to be out of there by 8pm.  </p>\n\n<p>After about 15 minutes of complete silence, I was interrupted from my work by a LOUD growling noise. The noise sounded like it was coming from outside my office door. I nearly knocked all my papers from my desk when I heard it. It certainly startled me since it came out of nowhere and was as loud as a bear.  I knew that it was impossible for any animals to get inside the building because all the doors were locked, and not to mention, we are located on a busy street in town. There were no stray animals that lingered around here.  </p>\n\n<p>This dreadful feeling filled from my toes to my head, and I was fearful of what lay lurking on the other side of that wall. I sat there for at least five minutes in complete silence, when at last my phone rang. </p>\n\n<p>My husband called to ask if I&#39;d be home for dinner. I let out a deep breath that I hadn&#39;t even realized I&#39;d been holding, and decided that the stress of work was getting to my head. I logged off my computer, put my files away, and turned off the lights.  When I rounded the corner to leave my office, that&#39;s when I heard it again.  </p>\n\n<p>A LOUD deep growling sound, except it was coming from my office now. Yes, the sound was coming from inside my office, the office that I had just been working in.  You know that feeling you get, when it&#39;s dark out, and all the lights are off in your house. You are coming up from your basement, and you run like the speed of light because you feel like someone, or something is chasing you? Well, that was me, I high-tailed it out of there.  </p>\n\n<p>When I reached the parking lot, I noticed a deer carcass outside my office window.  Like I said before, we were located on a busy street. There were no stray animals around, especially not deer, and especially nothing big enough to eat a deer.  I&#39;m so thankful my husband called me when he did. I&#39;m afraid to even let my mind wonder to the possibilities of what would have happened if I stayed any longer that night.  </p>\n\n<p>I did a little research when I got home, and apparently a few other people have reported something like this happening to them. It&#39;s always the same case. The person was alone, or was someplace after hours when the scraping started.  One story that really jumped out to me was from a woman in Florida.  </p>\n\n<p>Her twelve-year-old son was complaining of growling noises when left home alone. The mom thought he needed to be less dependent on her, so she decided to leave him anyway. Only four hours had gone by, but when the mom returned, her little boy was gutted out in the middle of the living room. Since then, she reports that the growling noises are following her. She even joked at the end of her article that some may call her a stage 5 clinger, but I don&#39;t find anything funny about the situation.  </p>\n\n<p>Some have reported even seeing the creature (described as an inbreed between a man and a crocodile). Like the man from Missouri, he wrote to say that he was a janitor in a school. After school let out, and everyone had left for the day, he began sweeping when the scraping noise started. He turned around and saw it. Luckily, a student ran back inside the building to grab forgotten homework at that exact moment. He refuses to be left alone now.  </p>\n\n<p>They call it the Brack.  </p>\n\n<p>I&#39;m afraid it may have followed me home.  Occasionally, I&#39;ll hear a scraping noise (when I&#39;m in the bathroom, or taking a shower). You see, I&#39;m never alone for long though. As soon as my husband enters the room, it stops, but my husband has a hunting trip coming up this weekend, and I&#39;m afraid of what may happen while I&#39;m home alone.  </p>\n\n<p>So, that&#39;s why I thought I&#39;d write on here.  </p>\n\n<p>Have any of you heard of the Brack?</p>\n</div>\n","author":"briannaappling"}