{"rank":"362","title":"Someone knocked on my door – from inside my house","id":"8llzu1","url":"/r/nosleep/comments/8llzu1/someone_knocked_on_my_door_from_inside_my_house/","time":"1527102358000","body":"<div class=\"md\"><p>I’m a smoker.</p>\n\n<p>Oh, I know what you’re going to say. Believe me, I’ve heard it a thousand times before. <em>You smell bad. Your teeth are going to turn yellow. Have you ever seen a smoker’s lung? It’s going to kill you!</em></p>\n\n<p>I know the risks. But I need a way to destress, and believe me, smoking is a lot better than the alternatives I have in mind.</p>\n\n<p>Late on the night of April 12th, I decided to go out for a smoke. I had just finished some work for a client, and it required a lot of mind-numbing spreadsheet work. So I went out onto the porch, took a drag, and watched the smoke twist and furl up towards the sky.</p>\n\n<p>I was out there for about five minutes when I heard it.</p>\n\n<p><em>Thump. Thump. Thump.</em></p>\n\n<p>Someone knocking on my door.</p>\n\n<p>From <em>inside</em> the house.</p>\n\n<p>I froze. It felt like every muscle, every cell in my body was paralyzed. My heart pounded in my ears; I dropped the cigarette.</p>\n\n<p><em>Thump. Thump. Thump.</em></p>\n\n<p>There it was again – something rapping sharply on the inside of my door.</p>\n\n<p>At that moment, I felt two opposite feelings. The first was pulling me towards the door – to look in the peephole, or even open it, and find out who was on the other side. I mean, how could it be? Had someone been inside my house all evening, and I hadn’t noticed it?</p>\n\n<p>The second – which was more instinctual, more powerful – was to run away. Run across the front lawn, to the neighbors across the street, and call the police.</p>\n\n<p>But that would make me a scared little bitch, wouldn’t it?</p>\n\n<p>So I chose the first option. Grabbing the large branch that lay among the tulips, fallen from last night’s storm, I charged at the door.</p>\n\n<p>My hand fell on the doorknob.</p>\n\n<p>With a deep breath, I yanked it open.</p>\n\n<p>But through the doorway, I didn’t see my dark, messy living room.</p>\n\n<p>I saw the porch. The night sky, the front yard. The tulips fluttering in the wind. It was as if someone had placed a large mirror where the door had been, and I was seeing a reflection.</p>\n\n<p>Except, when I stretched out my hand, it fell on thin air.</p>\n\n<p>I turned around. Maybe, somehow, I was back inside the house, just looking out the door. That would make sense – well, the most sense, anyway. But no – when I turned, I saw the porch, the front yard, even the cigarette smoldering on the ground behind me.</p>\n\n<p>I stepped back and closed the door.</p>\n\n<p><em>Am I dreaming?</em> I thought, dropping the stick. I reached for the door again, hoping that when I opened it this time, I’d see the familiar shag carpet, grease stains, scattered garbage.</p>\n\n<p>The door swung open.</p>\n\n<p>It was the porch again.</p>\n\n<p>But this time –</p>\n\n<p>A dark shadow flit across it. It had the rough shape of a person, but was shorter and rounder, with legs that ended in long, talon-like feet. I only got a glimpse of it before it was gone, dissolved like smoke into the night air.</p>\n\n<p>Curiosity burning inside me, I stepped through the door.</p>\n\n<p>As soon as I did –</p>\n\n<p>The door snapped shut behind me.</p>\n\n<p>I wheeled around. Grabbed the doorknob. Jiggled, tugged, yanked. But it was locked tight. I turned towards the yard. “Hello?” I called, at a loss for words. “Hello? Anyone out there?”</p>\n\n<p>In reply – a faint chittering, carried by the breeze.</p>\n\n<p>I thundered down the steps, into the wet grass. “Hello?”</p>\n\n<p>And then I stopped.</p>\n\n<p>The shadows – of the tulips, of the wooden slats of the porch, of the fir trees and the road and the telephone pole –</p>\n\n<p>Were twisting, shifting, falling.</p>\n\n<p>I backed away.</p>\n\n<p>They coalesced into deformed, humanoid shapes. The acrid smell of smoke filled my nose; the chittering grew louder. They crept across the yard, over the grass, all focused on me.</p>\n\n<p>I ran to the door.</p>\n\n<p>Raised my hand, knocked three times, and prayed that it would open.</p>\n\n<p>Miraculously, it did. I fell face-first into the shag carpet. Scrambling up, I shut the door, drew all the locks, and collapsed in a heap on the ground. When I gathered the courage, I looked out the window – but all the shadows were in their correct places.</p>\n\n<p>When my heart began to slow, I reached for a cigarette.</p>\n\n<p>But all I could think about were the shadows, clawing at me from the cloud of <a href=\"http://blair-daniels.com\">smoke.</a></p>\n</div>\n","author":"BlairDaniels"}