{"rank":"4","title":"Reason why I don’t drive there at night alone","id":"8lm4l0","url":"/r/nosleep/comments/8lm4l0/reason_why_i_dont_drive_there_at_night_alone/","time":"1527103328000","body":"<div class=\"md\"><p>This is what happened to me one summer night, I’m not going to give the exact location for privacy reasons but I can say it’s in a very religious state. </p>\n\n<p>I usually like to go on late night drives, this was a few years ago around early June. I was on one of these drives in my Jeep Grand Cherokee, this was a well maintained dirt road that leads to a place called Sandy Beach by the lake, a frequent hang out and hunting spot. I turned off the pavement expecting to see maybe a deer or some birds so I was taking it fairly slow. Windows down and music up just enjoying the warm night air, the moon was about half crescent and the stars where bright for there was no buildings within 3 miles of this road. </p>\n\n<p>Once I came up the parking lot I was surprised to find that the road no longer went to the edge of the lake, usually you can drive right up to the water and a ways down the beach, either way I stayed in the Jeep and just turned around.\n I wasn’t far from the parking lot when I rounded a corner and saw something in the road, to avoid hitting it I slammed on my brakes, dust covered the area as I sat idling. As the dust cleared, I saw a grotesque site. Something that resembled a mangy black dog was in the middle of the road, it was staring right at me, it’s eyes where a glowing yellow color. I sat half frozen in fear and ciourisity as to what the hell I was looking at. Now I’ve heard stories about skinwalkers and dog men but this didn’t look like either, it was hunched over and extremely skinny with a long bony tail it’s skin was oily black with no hair I could see. It’s mouth was dripping with this black ooze, it’s claws looked maingled. </p>\n\n<p>I do t know how long I was staring at this thing, all I know was that I couldn’t move, as if it’s stare paralyzed me, everything else was quiet and I could only hear the blood rushing in my ears. At some point it turned towards me, and in one leap it jumped on the hood of the Jeep and stared threw the windshield, I was completely paralyzed with fear at this point. It slowly crawled up the windshield to the open sunroof, it’s yellow eyes peering into my soul as it opened its mouth. It’s breath smelled rotten, it’s maingled teeth where black and oozing this oily substance. I could only stare in horror as it reached one of its maingled arms down threw the roof, it got incredibly close to me. </p>\n\n<p>Something then snapped me out of my trance and I remember I had a gas pedal, so I just floored it. The rear tires spun in the dirt, trying desperately to grab traction. I just turned my head towards the road as the car learched forward hard, the thing on the roof tumbled along as I booked it out of there. I didn’t look in the rear view mirror the whole way to the pavement in partial fear that it was giving chase. As soon as I hit the compfort of the pavement again, the tires squealed and began smoking as I floored it the several miles back home. I was so terrified that I hardly slept that night.</p>\n\n<p>The next morning, I went outside to check on the Jeep, and that black ooze was still on the hood and windshield, confirming that is wasn’t just some nightmare. It was thick and smelly, it had the consistency of oil with like bits of dirt or something in it, the smell was putrid and made me gag. I went inside and washed my hands then immediately took the Jeep to a car wash. To this day I can still smell that stench.</p>\n\n<p>If anyone has an idea to what it was please let me know, I still don’t know what I saw and it gives me chills still to talk about it.</p>\n</div>\n","author":"HotwheelsMartini26"}