{"rank":"98","title":"Mister Clacky-Teeth","id":"8lmgem","url":"/r/nosleep/comments/8lmgem/mister_clackyteeth/","time":"1527105876000","body":"<div class=\"md\"><p>I met Holly on the first day of my freshman year of college. She had arrived a few hours before me and had claimed her side of the room already. I entered our shared room and was greeted by a short, scrawny girl standing on a chair to hang a poster above her bed. She turned and looked at me, tossing her reddish-brown pigtails, and grinned, showing off a mouth full of straight white teeth.</p>\n\n<p>“Hi!” she bounced down off of the chair and strolled over to me, her hand held out. “I’m Holly. You must be Jacqueline!” </p>\n\n<p>I shook her hand. “Good to meet you.” </p>\n\n<p>Holly clambered back up onto the chair and slapped a strip of clear tape on the corner of the poster. It was a brightly-colored print featuring several rabbits hopping through a field of wildflowers. The rabbits were various shades of pink, purple, and turquoise, reminding me of the Lisa Frank stickers that I had obsessively collected when I was younger. </p>\n\n<p>Holly and I chatted as we unpacked. She was from California and was studying theater. “I know it sounds nerdy, but I’m actually really excited for my first class,” said Holly. “My high school didn’t have much of a theater arts program, so I can’t wait to get on that stage!”</p>\n\n<p>“It’s not nerdy at all,” I told her as I placed folded clothes into my dresser. “I’m kinda looking forward to my first classes, too.”</p>\n\n<p>“What’s your major?”</p>\n\n<p>“I don’t have one yet. I’m undecided. But my first class on Monday is sociology, so that might be cool.”</p>\n\n<p>Initially, I hadn’t been embarrassed about packing Mitzy, but now that I was actually unpacking, I felt uneasy about taking her out of my backpack and putting her on the bed. Mitzy is a stuffed animal, a fox to be exact. I’d had her since the day I was born, and it showed. I’ve never thought of her as being ratty, but before going off to college, I washed her and repaired her as best I could, trying to make her look a little less worn and frayed. Mitzy was once a bright orange-red, but multiple washes and excessive snuggles had dulled her fur considerably. Her little white paws were a grayish color; there was no way I’d ever consider bleaching them, though. Something as harsh as bleach might damage her already delicate faux fur. Her black button eyes had been replaced at least a dozen times, but they were always shiny and comforting.</p>\n\n<p>I took Mitzy out of my backpack and set her down on the bed, half-hoping that Holly wouldn’t notice her. Holly had her back to me and was re-arranging her bedspread, which was dark blue with white rabbits on it. The second she turned around, though, she saw Mitzy and her eyes lit up.</p>\n\n<p>“Who’s this?” she asked, leaning over to peer at Mitzy, cooing excitedly and acting as if I’d smuggled a live kitten into the room instead of an ancient plush toy.</p>\n\n<p>“Oh, that’s Mitzy,” I replied, my cheeks growing warm with embarrassment. </p>\n\n<p>All of my friends had outgrown their stuffed animals, dolls, and security blankets, but I’d never been able to part with Mitzy. My closer friends liked to tease me a little about her; it was always good-natured, nothing malicious, but it stung a little to be considered the baby of the group simply because I still had a stuffed animal.</p>\n\n<p>“She’s so cute!” squealed Holly, clapping her hands. “She can be friends with Mister Clacky-Teeth!”</p>\n\n<p>Before I could ask who Mister Clacky-Teeth was, Holly pulled a wooden box out from under her bed and flung it open. The box was lined with plush pink velvet. Nestled amid frilly cushions was a stuffed bunny rabbit. Unlike Mitzy, it was in perfect condition, looking like it had come straight out of the toy store. It was pale pink with long, floppy ears and blue button eyes. Holly lifted it out of the box, picking it up and cradling it like a baby in her arms. </p>\n\n<p>“This is Mister Clacky-Teeth,” said Holly proudly. She slid one hand behind the bunny, and it seemed to twitch in her arms. Its mouth opened in a huge lopsided smile. </p>\n\n<p>“Hi, Jacqueline! Hi, Mitzy! I’m Mister Clacky-Teeth!” Holly’s voice was distorted, pitched into a lower tone that sounded playful and cartoony. Her own mouth never moved, though. She grinned, showing off her pearly white teeth. </p>\n\n<p>“Wow! How’d you do that?” </p>\n\n<p>Holly laughed. “I was, like, totally obsessed with Lamb Chop when I was little, so I taught myself ventriloquism,” she explained. She held the bunny out, showing me the hole in his back where her hand had gone. </p>\n\n<p>“That’s so cool.”</p>\n\n<p>“Thanks, Jacqueline! I hope we can be good buddies!” Holly spoke through Mister Clacky-Teeth again, opening his mouth wide enough to reveal a pink felt tongue. </p>\n\n<p>“Why’s he called Mister Clacky-Teeth?” I asked, surprised that the puppet didn’t have any teeth. </p>\n\n<p>“Oh, silly me!” Holly laughed and turned to the stuffed bunny in her arms. “Did I forget your dentures again, Mister Clacky-Teeth?”</p>\n\n<p>“You always forget my dentures, Holly!” she made Mister Clacky-Teeth laugh. </p>\n\n<p>I had initially been somewhat relieved to see Mister Clacky-Teeth because it meant that I wasn’t a complete and total baby for bringing along Mitzy. But there was something unsettling about seeing Holly talking to Mister Clacky-Teeth and having him talk to me. It felt surreal, like something that was happening in a dream. Holly’s enthusiasm and bounciness was causing whatever cuteness I’d initially found in Mister Clacky-Teeth to wear thin. It was wavering somewhere between tedious and creepy. </p>\n\n<p>Holly set Mister Clacky-Teeth down on the bed and bent over the wooden box again. “Mister Clacky-Teeth and I are working on an act,” explained Holly. She pulled a red and white item out of the box and popped it into Mister Clacky-Teeth’s mouth. She picked up the bunny puppet again, nestling it in her arms. </p>\n\n<p>The thing that Holly had placed into Mister Clacky-Teeth’s mouth looked a lot like those wind-up chattering teeth you see in novelty joke shops. The plastic red gums were slick and shiny, but instead of containing a neat row of white plastic teeth, it contained a hodge-podge of white nubs poking out at odd angles. The whole effect was jarring and weird, even more unsettling than having Holly use Mister Clacky-Teeth to talk to me. </p>\n\n<p>“Ain’t that right, Mister Clacky-Teeth? We’ve got an act!” </p>\n\n<p>“That’s right, Holly. We have one heck of an act!”</p>\n\n<p>“We’re still working on it,” said Holly, leaning over and stage-whispering to me, as if we were talking in front of an actual living thing instead of a pink stuffed rabbit. She glanced down at Mister Clacky-Teeth. “We can give you a little preview, though.”</p>\n\n<p>Before I could tell her that I didn’t want to see her act, she began to move her hand inside of Mister Clacky-Teeth’s head, moving the jaw up and down to make the plastic teeth click together. The teeth clicked and snapped together rhythmically, like castanets. </p>\n\n<p>“Hi everybody, I’m Holly! And I’d like to sing you a song!” Holly began to sing, warbling off-key in a high, lilting voice. “This is my friend, Mister Clacky-Teeth! He clicks and clacks and jibbers and jabs and he’s my very best friend! His clicky-clacky teeth are like a little drum set and he’s also cute as a button!” She paused and laughed, “I need to work on the lyrics, obviously. What do you think?”</p>\n\n<p>I forced a smile and a laugh. “He’s super cute,” I said. “And you’re, like, amazing. I mean, your mouth doesn’t move at all. It’s totally convincing.”</p>\n\n<p>Holly blushed, her cheeks turning bright pink. “Thanks!” Much to my relief, she set Mister Clacky-Teeth down on the bed and took his little plastic dentures out. “That’s enough, Mister Clacky-Teeth.” </p>\n\n<p>I felt a strange sense of relief when she tucked Mister Clacky-Teeth back into the wooden box and slid it back under her bed. “I’m starving. You wanna go grab a sandwich or something?”</p>\n\n<p>I followed Holly out of our room, and we made our way across campus towards the dining hall. By the time we had reached it, we were laughing and talking, and I had forgotten how uneasy Mister Clacky-Teeth had made me feel. When we got back to our room, we listened to music while I finished unpacking.</p>\n\n<p>My aunt had given me her old lava lamp when I’d graduated from high school. Its metal base was once covered with brilliant yellow smiley faces; they had faded to a lighter, more pastel-looking color over time. The thing was ancient and I hadn’t even tried plugging it in. The cord was frayed, the protective rubber casing peeled back in places, exposing old wires. </p>\n\n<p>“I had this in my dorm room back when I was a student,” my aunt had told me, beaming as I unwrapped it. “I doubt it still works, but it’d look so cute on your nightstand. It’ll add a fun retro vibe to your room!”</p>\n\n<p>I figured that I’d be allowed to keep it as long as I never plugged it in. I had been thinking of removing the cord and turning it into a succulent holder or something, but hadn’t gotten around to it. I set the lava lamp down on the shelf above my bed, carefully wrapping the cord up around its base.</p>\n\n<p>Classes began and within a few weeks, Holly and I found ourselves in different social circles. She spent most of her time hanging out with the other drama students. I found my own set of friends. Holly and I didn’t exactly drift apart, but we weren’t super close, either. If anything, she was easy to live with. She was friendly and vivacious, but she was quiet in the evenings when I wanted to study. We liked a lot of the same movies and TV shows, and we’d often hang out in the lounge with our fellow dormmates, watching trashy reality TV to unwind after classes. We hung out and ate meals together. I helped her learn lines for her drama classes and she helped me memorize the periodic table for an upcoming biology test. </p>\n\n<p>As we were gearing up for winter break, I decided to major in business. It felt like a good fit for me. By that point, Holly was spending more and more time with her new theater friends. She would drag herself out of bed early on Saturdays and Sundays, carrying Mister Clacky-Teeth’s wooden box under her arm. She rarely took him out of the box when she was in the room with me. </p>\n\n<p>“He’s not really a toy,” she told me once. “He’s a prop for my act. I need to keep him in mint condition. Besides, it’s a little weird to practice in front of an audience.”</p>\n\n<p>I had assumed that she was practicing in front of her theater friends, but didn’t bother mentioning it. After dealing with the rigamarole of finals and filling out all the paperwork needed to declare my major, I was more than ready for a brief vacation, and my roommate’s ventriloquy puppet was the furthest thing from my mind. Holly and I went our separate ways for winter break. She got to return to sunny California, while I was stuck with my family in the frigid midwest. </p>\n\n<p>In addition to celebrating Christmas with my family, I took the opportunity to schedule several necessary appointments. After receiving a clean bill of health from my doctor and a spiffy new haircut, I reluctantly went to the dentist. </p>\n\n<p>“Your teeth look good,” he said as he reviewed my X-rays. “But your wisdom teeth are going to have to come out.” I think he sensed my worry, because he smiled at me. “Don’t worry. It’s a simple procedure, and it doesn’t need to happen right away. I’ll put you in touch with an oral surgeon.”</p>\n\n<p>The oral surgeon glanced at my X-rays and told me that my teeth could wait until summer to come out. “You’re actually pretty lucky,” she said. “Three of your wisdom teeth are growing perfectly straight. It’ll be easy to remove them.” She tapped the X-ray, pointing to a white blob in my lower jaw. “This little fellow’s a bit crooked. I’ll have to break it apart in order to remove it. But that’s nothing serious. It’s actually a pretty standard operation.”</p>\n\n<p>The prospect of oral surgery wasn’t exactly thrilling, but at least I didn’t have to undergo it until summer. Winter break ended all too quickly and I headed back to campus. I got back to the room shortly after Holly did. </p>\n\n<p>“How was your break?” asked Holly, setting her backpack down on her bed.</p>\n\n<p>I shrugged. “It was average. I babysat for my cousins and went to the dentist. Did you do anything fun?”</p>\n\n<p>Holly grimaced. “Ick! I hate going to the dentist. Did you get a tooth pulled or something?”</p>\n\n<p>I shook my head. “No, it was just a regular checkup. The dentist took some X-Rays and said I need to have my wisdom teeth pulled this summer.”</p>\n\n<p>“That’s not so bad,” said Holly. “I had mine out last year. It’s a really easy operation. They put you out, and when you wake up, you get ice cream.” She rummaged around in her backpack. “Hey, the drama club is putting on a show at the Astro Tour this Saturday. You wanna come?”</p>\n\n<p>“What’s the Astro Tour?”</p>\n\n<p>“It’s a coffee shop in town.” Holly handed me the flyer. The words ‘GREATEST LITTLE SHOW ON PLANET EARTH’ were typed across the top in large blocky letters. Beneath it was a cartoon drawing of an astronaut. A word balloon coming out of his mouth proclaimed, ‘SINGING! DANCING! POETRY SLAM! VENTRILOQUY! SUPER FUN FOR ALL!’</p>\n\n<p>“Yeah,” I said, handing Holly the flyer back. “I’d love to come. Are you performing with Mister Clacky-Teeth?”</p>\n\n<p>Holly nodded eagerly. “I’ve finally got my act just perfect! I’d give you a preview, but I don’t want to spoil the surprise.” She grinned impishly, winking as she continued unpacking.</p>\n\n<p>On Saturday night, I walked with Holly to the Astro Tour Cafe. She carried Mister Clacky-Teeth in his wooden box, staggering under its unwieldy size. </p>\n\n<p>“Do you want some help carrying that?” I asked.</p>\n\n<p>Holly shook her head. “No thanks. Besides, we’re almost there.” She pointed to a short, squat building nestled between two larger ones.</p>\n\n<p>The Astro Tour was larger than it looked from the outside. In spite of its small, almost hobbit-sized front door, it was huge. Its high, arching ceilings were midnight blue and were painted with planets in psychedelic colors. The drinks were over-priced and had punny, space-themed names, like “Milky Way Mocha” and “Lightyear Latte.” There was a large stage against one wall, complete with curtains, a microphone, and an upright piano. </p>\n\n<p>“This place is so cool,” I said. </p>\n\n<p>Holly beamed. “They have regular poetry slams, readings, and talent nights.” She nodded at the stage. “I’ve gotta go prepare for my act.”</p>\n\n<p>I wished her luck, then bought myself a “Titan Tea” (which turned out to be overpriced, watery Earl Grey) before finding a seat. </p>\n\n<p>The acts ranged from mediocre to decent, but Holly’s was far and away the best. After listening to some angsty poetry, a bad cover of Lady Gaga’s “Bad Romance,” an excerpt from a self-published trash romance novel, an off-key acapella Cher medley, and some cringey standup comedy, Holly and Mister Clacky-Teeth took the stage.</p>\n\n<p>“Hi everybody! I’m Holly, and this is my friend, Mister Clacky-Teeth.” Holly beamed proudly at the audience. “Mister Clacky-Teeth, aren’t you going to greet your adoring public?”</p>\n\n<p>Mister Clacky-Teeth responded with a loud snoring sound. </p>\n\n<p>“Mister Clacky-Teeth! Wake up!”</p>\n\n<p>The bunny puppet jerked clumsily in Holly’s arms, as if waking from a deep slumber. “Sorry folks! I’m too tired to perform,” grumbled Mister Clacky-Teeth. Holly turned his head so that he was looking up at her. “Someone keeps my case under her bed.”</p>\n\n<p>“What’s wrong with that?” </p>\n\n<p>“Nothing. I just wish you wouldn’t rock it so much when you invite boys over!”</p>\n\n<p>The audience laughed. </p>\n\n<p>“Mister Clacky-Teeth!” Holly admonished him playfully. </p>\n\n<p>“I’m not saying Holly gets around, but if her feet were ever on the floor instead of in the air, we could put wheels on them.”</p>\n\n<p>Holly’s act was actually pretty funny. It felt a little weird to hear her making raunchy jokes about her sex life, especially because, as far as I knew, it was nonexistent. But her good-natured self-deprecating was refreshing after the previous acts. </p>\n\n<p>“Now, Mister-Clacky teeth, before we go, you should live up to your name,” said Holly. She pulled the little red and white dentures out of Mister Clacky-Teeth’s box and popped them into his mouth.</p>\n\n<p>“I never let him wear these when we’re not performing. Otherwise, I’d be picking bits of carrot out of them.”</p>\n\n<p>“At least I eat healthy!” Mister Clacky-Teeth retorted. Holly tilted his head, making him look her up and down in an exaggerated fashion. “What’s between your molars? Donuts?”</p>\n\n<p>Holly rolled her eyes. “Are we gonna sing for these nice people of not?” </p>\n\n<p>She started flapping Mister Clacky-Teeth’s jaw, using his hodge-podge of false teeth as makeshift castanets. “Oh, Mister Clacky-Teeth and I have been friends since I was small! After I taught him how to talk, we really had a ball! We’ve had such fun with you tonight, we love to make you laugh! Meet us after the show’s all done, you’ll get an autograph!”</p>\n\n<p>The audience applauded. I joined in, impressed with Holly’s skill as a ventriloquist and how funny her act had been. The singing at the end was still a little weird, especially because Holly couldn’t carry a tune to save her life. But she was still funnier than anyone else who had performed at the Astro Tour that evening. </p>\n\n<p>After Holly took a bow and put Mister Clacky-Teeth back in his case, she sat with me, and we watched the rest of the performers. “There’s a cast party afterwards,” said Holly. “You wanna come?”</p>\n\n<p>“Sure!”</p>\n\n<p>“I’ve just gotta run back to the room first. I want to put Mister Clacky-Teeth away. He doesn’t really like parties.”</p>\n\n<p>After the show, Holly and I dropped Mister Clacky-Teeth off in our dorm room before heading over to the frathouse where the party was being held. By the time we got there, the beer was flowing freely and the music was blaring. The frathouse was crowded and stank of weed, and Holly and I had to shout at each other to be heard over the din.</p>\n\n<p>“Looks like you ladies could use some driggity-dranks!” a drunk fratboy wobbled towards us, his eyes shining and his face flushed.</p>\n\n<p>“We sure could!” chirped Holly. “Which way to the bar?”</p>\n\n<p>“Just follow me. I’ll hook you two up.” The fratboy tried - and failed - to wink seductively. “Y’know, I wouldn’t mind hooking up with you, either.”</p>\n\n<p>Much to my surprise, Holly laughed. “Just show us where the drinks are, Casanova,” she said. We followed the fratboy, weaving through the sea of drunk partygoers until we reached a makeshift bar that had been crudely constructed from plywood and old folding chairs. A keg was set up behind it. The fratboy made a big show out of pouring the drinks for us. I looked around while Holly laughed and chattered with him. A string of bright pink, flamingo-shaped lights were strung up behind the bar, outlining an MC Escher poster. Someone had drawn little stick figures climbing all over the sideways stairs. I was in the process of counting them when Holly handed me a beer.</p>\n\n<p>“Thanks!” I sipped my drink. </p>\n\n<p>“Hey, I saw your act at the Astro Tour!” the fratboy grinned at Holly, pointing at her. “You had the bunny puppet! You were pretty funny.”</p>\n\n<p>Holly tossed her hair, preening and soaking in the attention. I continued to sip my beer and count the little stick figures in the MC Escher poster. Holly tapped my arm. </p>\n\n<p>“It’s way too stuffy in here,” she said. “Let’s get some air.”</p>\n\n<p>She looped her arm through mine, and we started to head back towards the door. </p>\n\n<p>“Aw, come on, ladies! Where ya going?” the fratboy staggered after us eagerly.</p>\n\n<p>“It’s too hot in here,” called Holly over her shoulder. “We’re going outside for a bit.”</p>\n\n<p>“Oh, I’ll show you the yard!” the fratboy stumbled, tripping on his untied shoelaces. He slammed into my shoulder, knocking my arm and causing most of my beer to spill down the front of my shirt. I cried out as the cold liquid hit my skin, more surprised than anything else.</p>\n\n<p>“Oh, wow. I’m sorry. Let me help you...” the fratboy grabbed a roll of paper towels off the makeshift bar. Before I could stop him, he started clumsily pressing them against my chest.</p>\n\n<p>“I’ve got it,” I said, trying to pry the paper towels from his hand. “Just - just stop it.”</p>\n\n<p>“No, here,” he insisted, “I spilled it, I got it for you.”</p>\n\n<p>I felt him squeeze one of my breasts through the paper towels. I jerked back, shrieking as I swatted his hands away from my chest. “Hey! Get off me!”</p>\n\n<p>“You fucking creep!” Holly stepped between us, snarling threateningly at the drunk fratboy. He gaped at her, his mouth opening and closing. “Stop groping my friend!”</p>\n\n<p>“No, I wasn’t! She got beer on her!” the fratboy was stuttering and slurring out an excuse when two other boys appeared behind him, obviously responding to Holly’s shrieking.</p>\n\n<p>“What’s the problem, ladies?” </p>\n\n<p>Holly pointed accusingly at the fratboy. “This pervert is trying to grab my friend’s breasts.”</p>\n\n<p>One of the other boys rolled his eyes. “For God’s sake, Tadd,” he groaned, grabbing the drunk by the arm. “We’ve talked about this!”</p>\n\n<p>“I am so sorry.” The other boy stepped between Tadd and Holly. He looked at me apologetically. “I’m really sorry about him. We’ll kick him out.”</p>\n\n<p>“No! I wasn’t! I didn’t mean to! She spilled her beer!” Tadd slurred as his friend dragged him from the room. “I was trying to wipe it up!”</p>\n\n<p>“Goddammit, Tadd!” Tadd’s friend lectured him, shouting to be heard above the music. “I keep telling you, we want girls hanging around here. We want girls to like it here. They won’t like it if you can’t keep your damn hands to yourself!” </p>\n\n<p>The remaining boy glanced at my beer-soaked T-shirt. “I’m so sorry about him,” he said. “You can borrow one of my shirts if you want.”</p>\n\n<p>Holly shook her head. “We’re leaving.” </p>\n\n<p>“Yeah,” I said, “it’s not fun anymore.”</p>\n\n<p>We turned and left, worming our way through the thick crowd, heading for the door. We pushed the door open and emerged into the cool night air.</p>\n\n<p>“You wanna do something else?” asked Holly as we walked away from the frathouse, leaving it behind us. </p>\n\n<p>“Nah. I think I’m gonna head back to the room,” I replied.</p>\n\n<p>“You want me to walk with you?”</p>\n\n<p>I shrugged. “Sure, if you want to.”</p>\n\n<p>Here is where I lose a big chunk of time. I don’t remember walking back to my dorm room with Holly or taking my beer-soaked T-shirt off and climbing into bed. I do remember waking up, though.</p>\n\n<p>The next thing I was aware of was a heavy weight resting on my chest. I groaned, struggling to lift my head. It felt like my brain had been replaced with cement. My thoughts were fuzzy and incoherent, and part of me desperately just wanted to go back to sleep. I couldn’t move, couldn’t raise my head up to look around. A dim shadow was sitting on top of my chest. I felt a pair of hands touching my face, fingertips stroking my cheek tenderly. My head throbbed and my mind swirled as I struggled to comprehend what was happening to me and why I couldn’t move.</p>\n\n<p>“Shhhhh...” Holly’s voice was trembling. “Just go back to sleep.”</p>\n\n<p>“What...” She pressed her fingers over my mouth, forcefully closing my lips down over my teeth. Holly’s face swam above me, her features fading in and out of focus. </p>\n\n<p>“Go to sleep.”</p>\n\n<p>I felt Holly’s fingers hooking around my lower lip, slipping into my mouth. I tried to turn my head, but my neck felt limp and refused to move. Holly gently pried my mouth open. I felt her running her fingers along my teeth, tasted something bitter and rubbery. Was she wearing gloves? </p>\n\n<p>“Hurry up!” a voice barked from the other side of the room. I shifted, trying to turn my head to see who else was in the room with us. The voice was low-pitched and cartoony. It took me far too long to realize that it was the voice Holly always did for Mister Clacky-Teeth. I turned my head, using every ounce of energy I could muster to pull free from Holly’s hands. </p>\n\n<p>Mister Clacky-Teeth was sitting on the edge of Holly’s bed, facing us. His round pink body seemed to pulsate as if he was breathing heavily. I squinted at him, trying to figure out what was going on. </p>\n\n<p>“Shhhhh...” Holly made another shushing sound as she turned my head away from Mister Clacky-Teeth. I looked up at her, realizing for the first time that she was sitting on me. Her knees were on either side of my arms, pinning them down. It felt like she’d placed a pile of bricks on top of me. I could hardly breathe. </p>\n\n<p>“I’m only gonna take your wisdom teeth,” whispered Holly. “I need them.”</p>\n\n<p>Her words didn’t make any sense to me at the time. It was like she was speaking a foreign language under water. I stared up at her, trying to process what she had just told me. She reached for something on the shelf above my bed. It was thin and shiny, glittering in the light. I blinked rapidly, willing the thing in her hands to come into focus. </p>\n\n<p>“Just go back to sleep,” pleaded Holly. She stuck her fingers into my mouth again, pulling my jaw open. She held up the object with shaking hands. For a brief second, it snapped into focus, and I tried to scream. The sound was muffled by Holly’s hand. She lowered the pen knife, bringing it closer to my mouth.</p>\n\n<p>I squirmed feebly, my limbs responding sluggishly to my brain’s panicked commands. Holly’s sweaty face swam in and out of focus as the knife dipped out of sight. </p>\n\n<p>I tasted the blood before I felt the pain from the knife in my lower gums. I tried to scream, but the blood was running down my throat. I gagged, trying to spit it out. I twisted and writhed, trying in vain to move my head so I could spit the blood out. I could feel it running down my cheeks and chin, seeping into the pillow beneath my head. It filled my mouth and flowed down my throat. I managed to swallow, narrowly avoiding choking on it. </p>\n\n<p>Pain flooded the lower half of my face. I tried screaming again. Hell, I don’t think I ever stopped screaming, but all that came out with a thick, wet, gurgling sound. I felt Holly’s fingers clumsily prodding at my back teeth, felt her shoving the knife into my gums. The knife’s blade was dull, obviously not intended for surgery, amateur or otherwise. Holly pressed down hard, forcing it into my flesh. </p>\n\n<p>“I’m sorry,” she whimpered. “I’m sorry! I’ve never done this before. I’m so sorry!” She wiped at my chin with one hand. The blue latex glove she was wearing came away smeared with bright red blood. </p>\n\n<p>“Stop moving!” she whined. </p>\n\n<p>“She’s choking, you dumbass.” Through my own pain, I heard Mister Clacky-Teeth’s voice again. “Put her on her side so she can spit the blood out.”</p>\n\n<p>I felt the pressure on my chest release as Holly scrambled off of me. I flailed my arms, trying to get myself off the bed. My limbs refused to cooperate. My legs jerked awkwardly, as if my joints had been replaced with jelly. Holly shoved me onto my side so hard I nearly fell off the bed. I stared down at the carpet, watching as the blood spilled from my mouth and onto the floor.</p>\n\n<p>“This isn’t working!” whimpered Holly. “I can’t find her wisdom teeth! There’s too much blood in the way.”</p>\n\n<p>“You need more light,” said Mister Clacky-Teeth from the other side of the room.</p>\n\n<p>Holly jumped up and started switching on lights. I managed to lift my head. The door was so close. I had to get to it. I had to get myself into the hall. Out in the hall, someone could see me and help me. I had to get out of this room and away from my roommate and her creepy stuffed bunny. I pushed myself off the bed, landing hard on the floor. </p>\n\n<p>I tried to scream, but all that came out was a hoarse, wet gurgle. Blood and saliva poured from my mouth, running down my chin and onto my chest. I reached for the door, my trembling hands grasping at empty air. The door was only ten feet away, maybe less, but it felt impossibly far away. It shimmied and wavered, fading in and out of focus as darkness threatened to overtake me.  </p>\n\n<p>I never saw Holly plug in my old lava lamp and switch it on. I was trying to crawl across the floor when she crouched beside me and shoved me onto my back. I swatted at her as she climbed on top of me again. She straddled my chest, using her knees to pin my arms down. </p>\n\n<p>“I just need your wisdom teeth.” Holly raised the knife again. “You aren’t gonna need them. You’re not even using them. Just let me take them.”</p>\n\n<p>I felt the knife in my mouth again. It slashed frantically, lacerating my gums and clipping my teeth, slicing the inside of my cheeks. Fresh waves of pain shot through my mouth and chin. It felt like my flesh was on fire, like Holly was trying to rip my jaw off. The room pulsed around me, growing unbearably warm as blood filled my mouth and began to run down my throat again. I gagged and sputtered, trying to cough it up. Holly’s fingers were blocking the way. I began to choke on my own blood. Dark spots appeared at the edges of my vision, and Holly swam in and out of focus. I couldn’t fight the darkness anymore. My eyes slid shut. Mercifully, the pain faded along with the rest of the world.</p>\n\n<p>I was awakened by the sound of an alarm blaring. My ears rang, but I couldn’t move my arms to cover them. Holly wasn’t sitting on me anymore. My head had been turned and I was lying on my side. The carpet beneath my face was soaked and sticky with blood. I didn’t know where Holly was, just that she was no longer on top of me. I wasn’t even sure if she was in the room. I tasted blood and metal, felt great gaping gashes on the inside of my mouth. Water pelted my body, soaking me immediately. </p>\n\n<p>Something orange was flickering at the corner of my vision. I struggled to lift my head to look at it. I was facing my bed. My purple bedspread was gone, replaced by dancing orange flames. I stared at it, too baffled and in too much pain to register anything. </p>\n\n<p>The floor beneath me seemed to vibrate. I tried to force myself up, to pull myself to my feet, but my body had gone numb. I managed to turn my head in time to see the door bang open. The figure standing there took up the entire doorframe, his huge, hulking form towering over me.</p>\n\n<p>“Mary mother of God.” The man’s voice was distorted, as if he was shouting at me from very far away. </p>\n\n<p>I felt blood spill from my mouth as I opened it. I tried to call out, to ask him for help, but all that escaped my mutilated lips was another thin gurgle. </p>\n\n<p>“Good God, kid, what the hell happened to you? Who did this to you?”</p>\n\n<p>I tried to tell him, but all that came out of my ruined mouth was a thin, choking sound and a torrent of blood and saliva. I felt large hands on my shoulders just before the darkness overtook me a third time.</p>\n\n<p>When I woke up, I was lying on my back again. I was on top of something soft, and a white blanket had been pulled up over me. My jaw ached. My mouth tasted like blood, but it was bone dry. After nearly drowning in my own blood, my throat was parched. Somewhere in the back of my mind, I registered the irony of this, but failed to find it funny. </p>\n\n<p>“Can you hear me, Jacqueline?” I heard a man’s voice somewhere above me. I looked around. A man was standing beside me. He was wearing blue-green surgical scrubs. “Raise your hand if you can hear me.”</p>\n\n<p>I struggled to answer him, but my mouth refused to open. My entire jaw was filled with pain, as if white hot nails had been pounded into my gums. Tears filled my eyes and started to spill down my face.</p>\n\n<p>“Shhhh. Don’t cry.” The man dabbed at my face, wiping tears away with a white cloth. “I’m Doctor Greenbaum. You’re in a hospital, and you’re safe.” He spoke slowly and smiled reassuringly, patting my shoulder with a large warm hand as he spoke. “We had to wire your jaw shut.”</p>\n\n<p>I reached up with shaking hands, trying to touch my face. Dr. Greenbaum shook his head, gently taking my hands in his and lowering them. “Don’t touch,” he said. “Are you in any pain? Lift your right hand for ‘yes’ and your left for ‘no.’”</p>\n\n<p>I shakily raised my right hand, noticing the IV stuck into my elbow for the first time. Dr. Greenbaum leaned over me, fiddling with something on the IV stand. “We’ve called your parents,” he explained. “They’re on their way. They should be here soon.” </p>\n\n<p>The door behind him swung open, and a haggard-looking police officer poked his head into the room. </p>\n\n<p>“She awake yet?” he asked. </p>\n\n<p>“Wait here,” said Dr. Greenbaum, patting my hand. I watched him walk over to the police officer, wondering why on earth he thought I’d be able to get up and leave. Even if I wasn’t exhausted, wracked with pain, and being slowly pumped full of medicine and painkillers, he and the cop were blocking the only door. </p>\n\n<p>“She can’t exactly talk to you.” I heard Dr. Greenbaum tell the cop. “We had to wire her jaw shut due to the damage.”</p>\n\n<p>“Christ on His throne. What the hell happened to her?” asked the cop.</p>\n\n<p>Dr. Greenbaum shrugged. “It looks like someone attempted to remove some of her back teeth.”</p>\n\n<p><em>It was Holly!</em> I wanted to scream. <em>My insane fucking roommate tried to rip my teeth out to give to her creepy rabbit puppet!</em> Fresh pain rippled through my jaw as Dr. Greenbaum and the cop turned to look at me. I didn’t fully realize that I’d been trying to talk. Since I couldn’t open my mouth, all I could manage was a series of pathetic, high-pitched whines.</p>\n\n<p>Using a notepad and a lot of hand gestures, I managed to tell Dr. Greenbaum and Officer Lutz what had happened. Dr. Greenbaum told me that a small dose of rohypnol had been found in my system; Holly had tried to drug me at the party. Fortunately - or maybe unfortunately, I’m not too sure - fratboy Tadd had knocked into me, spilling most of my drink before I could ingest it. I’m still not sure if I’m grateful to him or not. Part of me thinks that it would’ve been better if I’d gotten the full dose and been unconscious while Holly tried to steal my wisdom teeth.  </p>\n\n<p>In the end, my aunt’s busted lava lamp had saved my life. Holly had plugged it in, and the cord had begun spitting sparks, one of which had landed on Mitzy. In the end, all that remained of my beloved stuffed fox was her melted button eyes. The fire hadn’t devoured too many of my belongings. The brackish, dirty water in the sprinkler system had managed to damage and destroy everything else, including Holly’s possessions. Luckily, the fire hadn’t spread to any other rooms. An entire building full of panicking freshmen had been evacuated, but the damage was minimal. A handful of people were hurt in the chaos; one boy had been knocked over and had broken a rib after another fleeing student had stepped on him. Another girl had fallen down the stairs, resulting in a broken nose and a concussion.</p>\n\n<p>The police had found Holly sitting outside the building, covered in blood, clutching Mister Clacky-Teeth and crying. They had initially assumed that the blood had belonged to the girl who’d broken her nose. Once firefighters had rushed into our room and found me covered in blood and barely moving, they had brought Holly to the police station instead of the hospital. </p>\n\n<p>She wouldn’t talk to anyone except Mister Clacky-Teeth, and even then, all she did was apologize to him for not getting my wisdom teeth. Mister Clacky-Teeth’s dentures were made out of human teeth. Specifically, Holly’s old baby teeth, her wisdom teeth, and a few teeth whose owners still haven’t been found.</p>\n</div>\n","author":"AtLeastImGenreSavvy"}