{"rank":"86","title":"I've Seen Something Strange In Just About Every State: North Dakota","id":"8lmksc","url":"/r/nosleep/comments/8lmksc/ive_seen_something_strange_in_just_about_every/","time":"1527106800000","body":"<div class=\"md\"><p><a href=\"https://www.reddit.com/r/nosleep/comments/8ip4f6/ive_seen_something_strange_in_just_about_every/\">Nebraska</a></p>\n\n<p><a href=\"https://www.reddit.com/r/nosleep/comments/8joadb/ive_seen_something_strange_in_just_about_every/\">Pennsylvania</a></p>\n\n<p>It began raining heavily when we drove into Wannagan Campground, deep in the heart of North Dakota’s Prairie Grasslands. After a good half hour of driving on unpaved backroads, I’d been looking forward to stretching my legs. Now as I eyed the muddied gravel and soaked flora, the idea lost its appeal. </p>\n\n<p>As we pulled into a camp spur, I noticed only one other sign of life in the remote retreat – a small, dated Winnebago. Through the deluge I was unable to make out the occupants of the vehicle, but I thought I glimpsed a faint light coming from within. </p>\n\n<p>“Home sweet home,” my father grumbled – he too seemed less than thrilled about our choice of vacation spot. </p>\n\n<p>My little brother Alan roused from where he had slumped against the back passenger window. With a yawn, he looked around, taking in the desolate surroundings. A frown began to form on his face, and I knew before he spoke that his first words would be a complaint. “Daaad, do we have to stay here?”</p>\n\n<p>For once, I found myself agreeing with my brother. “Yeah,” I said, leaning forward into the front of the car, “can’t we find a hotel or something?” It was bad enough that at the age of eighteen, I’d been forced along on this family vacation. I didn’t relish also having to spend the time in a dingy campground in the middle of nowhere. </p>\n\n<p>“Boys,” my mother intoned from the passenger’s seat, “think of this as an adventure! Open skies, fresh air, and campfires. What could be better?”</p>\n\n<p>I thought I heard my dad grumble something about hot tubs and room service, but he knew better than to go against my mother. “Right,” he said, “let’s get things set up!” </p>\n\n<p>Forty-five wet and frustrating minutes later, we had our two large tents set up – our parents occupying one, and my brother and I occupying the other. By now the sun had begun to set behind the looming badlands, which surrounded the campground, further adding to the darkness of the overcast day. </p>\n\n<p>Unable to get a fire going, we were relegated to cold pop-tarts and trail mix for dinner. “You two best get a good night’s sleep,” my father said from the mouth of our tent, “we have a busy day planned for tomorrow.”\nThat proved easier said than done. The wind seemed to pick up sometime near midnight, and it stirred the tall grasses all around us. The sound of their movements reminded me of those long ago nights in Nebraska, and I shivered, uneasy in this foreign place.</p>\n\n<p>I could tell by my brother’s relentless shifting that he too was anxious. At one point he broke the silence, fearfully whispering, “What’s that noise?”</p>\n\n<p>I listed for a moment, and heard a soft shuffle in the distance. “It’s probably just some animal,” I whispered back, “go to sleep.” My frank reassurance must have been enough for Alan, for I soon heard his soft snores.\nI, on the other hand, lay away in the stifling darkness of the tent, listening to the sounds of the grasslands. Once or twice I thought I heard that shuffling come closer to the tent. I imagined some creature out there in the darkness circling our humbled dwelling like a shark circling a boat. My eyes began to droop, and on the cusp of sleep I heard a soft patter of something on our tent roof. </p>\n\n<p>The wind and rain had ceased by then, so I could fathom no explanation for a noise that sounded akin to fingers tapping against the nylon. I burrowed deeper into the shelter of my sleeping bag and squeezed my eyes shut. Eventually, I too fell asleep.</p>\n\n<p>The next morning we awoke to stagnant puddles and bright sunshine. The air was already humid, and the day was shaping up to be a warm one. After a quick breakfast, the four of us donned our hiking boots and day packs, and made for the nearest trail head. As we passed the Winnebago, I tried to sneak a peek through its windshield, but the glare of the sun and the vehicle’s darkened interior yielded nothing.</p>\n\n<p>My dad noticed the direction of my gaze, “Our neighbors must be early birds. Maybe we can invite them over for s’mores later on. Who knows,” he said with a wink and a nudge, “maybe they have a daughter around your age.” I tried not to roll my eyes, but failed.</p>\n\n<p>At a gas station along the Montana border, a worker had laughed when we told him our destination. “If there’s one thing I know be to be true about North Dakota, it’s that there’s a beautiful woman behind nearly every large tree.” He guffawed even more heartily, “but good luck finding many trees out there on the prairie.” </p>\n\n<p>North Dakota certainly hadn’t been my top choice for a vacation destination – heck, it hadn’t even been in my top 20 – but I had to admit, as we started up the dusty trail, there was a certain beauty in its ruggedness. As we headed further into the oddly shaped rocky hills, which made up North Dakota’s badlands, the wide gravel route gradually turned into a narrow pathway interwoven with tall grasses.</p>\n\n<p>In the distance we spotted a solitary buffalo grazing on vegetation, and passed by a herd of antelope resting in the sun. Once, I thought I glimpsed the grayish furry behind of a coyote, but its lanky form quickly disappeared into a cluster of sagebrush. </p>\n\n<p>We took a break at noon, enjoying the vista from the top of one of the eroded sedimentary hills. I went off a ways to find some private place to relieve my bladder and caught a glimpse of something red in the brush that lay along the hillside. </p>\n\n<p>I moved closer for a better look, and saw that it was a torn shirt. The T-shirt, a men’s large by the looks of it, looked like it had been there for some time. Its edges were frayed, and it sported stains from water and dirt. </p>\n\n<p>My eyes traversed the surrounding area, looking for some clue as to the shirt’s origin. On the ground a few feet away I noticed a tennis shoe. Its purple coloring and smaller size made it clear that this piece of clothing belonged to a female. A bit more wandering revealed a crushed pair of sunglasses, a baseball cap, a bloodied sock, and another purple shoe.</p>\n\n<p>With each discovery my heart rate increased. The objects were a startling sight out here in the middle of nowhere, and their haphazard disposal made me think some misfortune had befallen their owners. I was about ready to head back to the rest of my family when I noticed a flash of movement at the base of an adjacent hill.   </p>\n\n<p>From behind a lone juniper there, a pale face emerged. The face, shaded by a large brim straw hat, peered up at me with no small amount of apprehension. Wondering if she might know the clothes’ owners, I conjured up a smile and gave her a friendly wave.</p>\n\n<p>“Hello, down there! Do you know who these things belong to?” I held up a purple shoe to show the girl. The girl having been spotted, stepped out from behind the cover of the juniper. She was wearing a pale yellow dress that looked a bit too warm for summer, and looked to be a few years younger than I.</p>\n\n<p>She stood fidgeting slightly as I descended the slope in her direction. “My name’s Jake. I’m camping with my family over at Wannagan,” I said, pointing vaguely in the direction from whence I had come. “What’s your name?”</p>\n\n<p>I was a few feet from the girl at this point, and I could see a smattering of freckles on her ivory skin. Her gray-blue eyes looked up at me through long blond lashes. She remained silent a moment appraising me as I did her. “Sarah,” came her whispered response.</p>\n\n<p>“How do you do, Sarah,” I asked, nodding at her. “Do you live around here?” She nodded in response to my second inquiry, ignoring the first. I waited a moment for her to elaborate, but she didn’t.</p>\n\n<p>Slightly unnerved by her muteness, I kicked at the dirt with the toe of my boot. “Anyway, I just wanted to make sure you were okay.” I looked back up at her and gave her a grin so wide, I’m sure my dimples were showing. </p>\n\n<p>I saw a slight blush of pink go against her cheeks, and a slight smile of her own emerged. She took a step in my direction, and lifted her hand as if she meant to touch me. My gaze collided with her pale one, and I stood rooted in place, as some spell had been cast upon me.</p>\n\n<p>The voice of my brother rung out from somewhere above me, “Jake, mom says you better get your butt back here! It’s time to go!</p>\n\n<p>I jerked around at the interruption and spotted Alan making his way to the edge of the hill above. He spotted me and beckoned. I held up a finger and turned around sheepishly to address Sarah. Only she wasn’t there. I looked all around, including behind the Juniper tree, but could spot her feminine form nowhere in the vicinity. </p>\n\n<p>Creeped out now, I hastened back to my brother and parents, eager to get back to the campground. I met up with the rest of the family, choosing not say anything about the discarded clothes or Sarah.</p>\n\n<p>That night I tossed and turned in the tent, unable to get the girl out of my mind. I let out a frightened squeak when my brother suddenly broke the silence, “What’s the matter,” he said, “thinking about your girlfriend in the yellow dress?” He laughed.</p>\n\n<p>I rolled toward where his voice originated in the darkness. “You mean you saw her?” I asked, shocked.\nI heard the rustle of his clothes, and I imagined he was shrugging. “Well, I didn’t see much of her, she was just ducking behind the tree when I came over the rise. I thought she looked a bit creepy, being that pale and all. Who was she anyway?”</p>\n\n<p>Slightly distracted by this bit of news, I whispered, “Sarah.” Just then the wind outside picked up, and I swear the temperature dropped a few degrees. I tried to ignore both. </p>\n\n<p>“Oooh,” my brother continued, “did I interrupt you two?” He made a kissing sound, and laughed again. Annoyed now, I lashed out with my bare foot and connected with his shin. “Ow!” He yelled loudly.</p>\n\n<p>I’m sure he would have been on me in a moment, if our dad hadn’t called out from the other tent, “You two better shut up and go to sleep!” We both grumbled under our breath, but did as we were bid. </p>\n\n<p>I awoke sometime before dawn, shivering. During the night the temperature must have fallen into the low fifties, and my sleeping bag and sparse clothing hadn’t been enough to combat the chill. I’d just curled tighter into a ball rubbing at my arms, hoping to warm myself up some, when I heard the rustle of my brother’s sleeping bag behind me. </p>\n\n<p>I figured he was cold too. I few seconds had passed when I felt the tips of his fingers brush against my upper back. “What are you doing,” I hissed at him. The slight pressure did not retreat like I had expected, but instead traveled upwards, towards my neck and face. A cold, slender hand brushed against my ear, and I stilled in confusion. </p>\n\n<p>Five distinct digits threaded themselves into my tousled hair, petting me. What the hell was my brother doing? Annoyance suffused me as it dawned on me that my brother might be trying to get back at me for that earlier kick to his shin. Perhaps, he meant to frighten me.</p>\n\n<p>I rolled over on my back, about to set him straight, when in the pale light from the rising sun I made out a face beside my own - one that was decidedly not my brothers. Freckles and pale eyes wide with something I couldn’t place greeted my gaze, and from my lips slipped the intruder’s name, <em>&quot;Sarah&quot;</em>.</p>\n\n<p>The girl smiled at me once more, but this time her lips parted revealing teeth that were rotting and stained red. Face to face now, her breath caressed me, and I could smell the sweet coppery tang of blood.</p>\n\n<p>I jerked back in alarm, and in my panic all but ripped the tent open in my haste to get out. I yelled bloody murder, waking my parents and bringing them rushing from their own tent. Half clothed and half asleep, they question me, “What? What happened?” </p>\n\n<p>Hysterical, I could only point to disheveled tent. No doubt thinking some wild animal was inside, my dad cautiously parted the gaping doorway, and let out a relieved sigh when an empty interior was revealed. </p>\n\n<p>“What the hell, Jake?” My dad yelled, “You just about gave us a heart attack! And where is your brother?” </p>\n\n<p>“I’m here,” came the reply from the now open rear door of our SUV, “I got cold during the night and went to sleep in the car.”</p>\n\n<p>I tried to explain what had happened to my parents, but they chalked it up to nothing more than a bad dream. “We might as well start packing up,” my dad said after everyone calmed down, “the sun is up.” </p>\n\n<p>After the tent and camping gear were loaded back into our car, my dad and I took once last lap around the campground. The Winnebago, silent as always, still remained parked in its space. Curious that our neighbors had never shown, my dad went over to try and look in the windows. From the sides nothing much was revealed, but a jaunt around the back revealed a bloody hand-print smeared across the back window. </p>\n\n<p>My dad grabbed my wrist and all but ran with me back to our vehicle. He ushered us all inside and peeled off in a hurry, only revealing to my mother his discovery after we had gotten well down the road.</p>\n\n<p>“Must have been a mountain lion that got to them,” my father reasoned, “We’ll report it to the authorities once we get back to civilization.” </p>\n\n<p>As luck would have it, we passed by a ranger a few miles into our return trek. We flagged his vehicle down and reported our macabre discovery. </p>\n\n<p>When my dad brought up the theory that cougar could be stalking the area, the ranger nodded. “Could be one possibility,” the man said, though he didn’t sound convinced. “Hard to say without taking a look see myself. Out here in the remoteness of the grasslands, no telling what might have befallen those folks.” </p>\n\n<p>The man gave a chuckled, “Heck, for all I know it could have been old Sarah. I heard she don’t take too kindly to lovey-dovey couples. She gets jealous.” </p>\n\n<p>He must have seen the perplexed look on my father’s face, for he elaborated, “It’s an old urban legend. Sarah’s and her folks owned a homestead in the vicinity of Wannagan near a hundred years ago. She fell in love with a nearby rancher, but her parent’s didn’t approve of him. Sarah didn’t care, and she and her man were caught by her father in a compromising situation. Legend goes the old man shot her lover and in a fit of grief Sarah disappeared off into the prairie never to be seen again.”</p>\n\n<p>The ranger noticed my wide-eyed stare from the backseat and addressed me, “You’re mighty lucky you had your family with you, young man, I heard tell Sarah’s keen on finding a new beau!” He laughed again, and turned his attention once more to my father.</p>\n\n<p>After the ranger took our names and contact information, we were once more on the way. We never did hear from any one as a follow-up, but a few months later I found an article on a couple that had gone missing while hiking in the same area. No remains had been found, but it was supposed they might have been victims of a mountain lion spotted in the vicinity. </p>\n\n<p>My dad took that as a plausible explanation for the abandoned Winnebago and the blood across the back window – he figured the cat must have snuck up on them while they were cooking their dinner. My encounter with the pale-faced girl made me think otherwise. As did the fact that I had looked closely enough to see that the blood had been on the inside of the window. </p>\n\n<p>If you ever find yourself vacationing in North Dakota. Do yourself a favor and choose a different campground. </p>\n</div>\n","author":"thecuriousdeadcat"}