{"rank":"17","title":"[Update] \"Am I in trouble? Or am I just a dumb blonde?\" - Don't worry everyone! Everything is fine!","id":"8lmqmu","url":"/r/nosleep/comments/8lmqmu/update_am_i_in_trouble_or_am_i_just_a_dumb_blonde/","time":"1527108015000","body":"<div class=\"md\"><p>First post: <a href=\"https://www.reddit.com/r/nosleep/comments/8lckek/am_i_in_trouble_or_am_i_just_a_dumb_blonde/\">Am I in trouble? Or am I just a dumb blonde?</a></p>\n\n<hr/>\n\n<p>Well, I’ve got great news everyone! Turns out I really am just a dumb blonde! There’s no problem whatsoever! Let me explain:</p>\n\n<p>If you need refreshing, I mentioned that my name is Mabel. I recently moved to a new apartment, alone in a new town.</p>\n\n<p>I mentioned some “odd” things that’d been happening to me the past few days. And I made the conclusion that I might be being stalked and possibly in some danger.</p>\n\n<p>Well, I’m glad to say that I was completely wrong! All the mishaps turned out to really be just the result my dumb-blonde-ness! Haha!</p>\n\n<p>First, I mentioned how 4 days ago I woke up with no panties even though I almost go to sleep with panties on. I’ll admit, I was pretty confused and slightly concerned; I ripped my apartment apart in search of those beautiful hot pink sexy panties. But I simply could not find them! Until now… I found the panties! They were in my freezer the whole time! How the heck did they get there?! I guess I really do sleepwalk! Oh well…</p>\n\n<p>Next, my key! My silly billy key… I explained that my key seemed to have been replaced with a new one that looked very similar and that the lock on my apartment door also seemed to have been replaced though it also looked shockingly similar to the one I had. So, just to be extra safe, I went down to the locksmith in my town and ask him what the deal was.</p>\n\n<p>“You silly girl – no wonder you’re blonde!” the locksmith said to me. You’re not going to believe this, but, he said, “You were just here a few days ago – you said you wanted to get a new lock because you’ve just moved in and wanted to be safe! Don’t you remember? You came into my shop and said, ‘Hello, my name is Mabel L. I’ve just moved into a new apartment alone here in town and I’d like a new lock on my apartment front door. Can you do this for me?’, and I said, ‘Well, certainly. What’s your apartment number?’ and you said, ‘216,’ and I said, ‘OK – no problem! I’ll have it changed in a jiff!’ and then I came to your house a few days later, and you answered the door, around 1pm. You really don’t remember? I certainly do!”</p>\n\n<p>And that was that! I don’t know how I possibly could have forgotten all of that but, again, I’m a blonde! There’s a reason there are so many jokes at the expense of “dumb blonde bitches”! It’s entirely because of blondes like me! I give us all a bad name! Haha!</p>\n\n<p>After that was the previously unnoticed man in the background of my favorite photo – the one with me and my best friend upstate on my parent’s property. Let me tell you, I remember that trip so vividly. Right before we got up that big hill with my father slightly behind, me and V noticed a mother bunny with 5 baby bunnies and oh. my. gosh. They were SO cute! We actually gave them all names: Ricky, Billy, Babe, Trist and… crap, what was the last one’s name… Oh, that’s right! We combined part of my last name, Lindsyn and V’s last name, Fetter and named it Letter! Isn’t that clever?! Haha!</p>\n\n<p>And I remember that at the top of that hill I found the most beautiful field of daisies any of us had ever seen. At least 100 yards long and 30 yards wide, nothing but daisies everywhere. I discovered that day that yellow is my favorite color. Maybe I should switch to sexy yellow panties at night… Hmm…</p>\n\n<p>Anyway, I also remember we went hunting in the woods at the top of that hill a few hours after taking the picture and I shot a deer… I felt SO bad afterwards, but luckily I only hit its back right leg in the thigh so it was injured but it was able to get away and I don’t think it died. That was part of why I became a vegetarian later in life.</p>\n\n<p>But, yea… what a great day that was. I’ll cherish that photo forever. Who even cares about that mysterious man in the background. It probably wasn’t even a man, it’s definitely hard to tell –  it was probably just a large tree I’d never noticed or something like that!</p>\n\n<p>Finally, about the soap! My bar of Dove soap had “H E L L O : )” inscribed on the back. I contacted Dove and they immediately put my mind at ease. Turns out that they’re doing a promotion where they put HELLO :) on 1 of every 10,000 bars of soap they package and anyone who notices and contacts them is then sent free soap for a month! Can you believe that?! So for the next month, I will be able to wash my wonderful, sexy, naked body under the hot shower water completely free for a month – maybe even longer if I can make it last! I hope the bars they send me have more inscriptions: I love Easter eggs like that! Kind of like the Easter eggs Bungie put in the Halo 3 campaign – boy did I love finding those…</p>\n\n<p>So, in conclusion, Mabel is fine. Mabel Lindsyn is <em>definitely</em> fine! Thanks everyone!</p>\n\n<p>Oh, also, I thought about it some more and I realized it was very rash and silly, and maybe even irresponsible, to assume it was that guy Marlin I used to talk to ten years ago in that chat room. I remember that he was actually a really nice and considerate guy. The fact that I immediately threw the blame on him for all these silly coincidences just proves that not only am I a dumb blonde but also that women are sort of unnecessarily bitchy sometimes. Hopefully I’ll change and behave in the future in that respect!</p>\n\n<p>OK – thanks for reading! I&#39;m safe!</p>\n</div>\n","author":"masnaTellsHisStories"}