{"rank":"11","title":"Virginia's Only Haunted Attraction That's Actually Haunted","id":"8lmr4l","url":"/r/nosleep/comments/8lmr4l/virginias_only_haunted_attraction_thats_actually/","time":"1527108120000","body":"<div class=\"md\"><p><a href=\"https://www.reddit.com/r/nosleep/comments/8kwn3t/an_abandoned_mining_town_in_the_appalachian/?st=JHJL0UBO&amp;sh=7010ab86\">Previous</a></p>\n\n<p>This story of Appalachian madness doesn&#39;t come from our dear friend Clyde. I&#39;ll be retelling a story told to me by my friend &quot;David.&quot; I met David when we were juniors at Radford, we sat next to each other in one of our Appalachian studies classes. David is from Wytheville Virginia, located about 10 miles southwest of Ft. Chiswell and a former Navy Corpsman with 2 deployments to Iraq and 1 to Afghanistan. I&#39;m including that excerpt about his military service so that you can understand that there&#39;s not much that scares him. </p>\n\n<p>Before I retell his story, it&#39;s important to gain some context.</p>\n\n<p>Major Graham&#39;s Mansion is a local landmark, it&#39;s as ingrained in the history of this place as anything could be. It&#39;s also rumored to be haunted. So much so that an episode of Ghost Hunters was filmed there. In 1826 Squire David Graham purchased some 2000 acres from another family that&#39;s still prominent in this area. The land itself was supposedly tainted by evil even before Squire Graham purchased it. The property&#39;s original owner was murdered by two of his slaves, Bob and Sam. According to the legend it wasn&#39;t pretty either. They supposedly caved in his head with an ax and then shoved his body into a barrel of moonshine. The slaves where later hanged somewhere on the property. To this day, people report seeing the slaves walking around the property, other times they see them hanging from the tree they were hanged from.</p>\n\n<p>In 1838 the &quot;Major&quot; was born. By the mid 1860&#39;s Major Graham had returned from 3 years of service in the Confederate Army. The Major was now the owner of the property and had renovations completed to add on additional rooms and structures, one such structure became an officers lounge/confederate recovery room and because of this many visitors to the mansion report seeing Confederate soldiers walking the halls.</p>\n\n<p>There are a few other spirits and disembodied voices reported to haunt the property and for a small fee you can stay the night in the mansion and conduct your own ghost hunt. Mostly the mansion is used as a Halloween attraction, especially these days. Every year people from all over come to visit the haunted house on Halloween, one year I met someone that came all the way from Columbus Ohio to visit the attraction. The haunted house is full of jump scares and creepy music but ignores the supposed REAL haunted history of the property, which in my opinion is much scarier.</p>\n\n<p>According to David, sneaking onto the property and trying to spend the most time alone there is almost like a rite of passage for many young men from Wythe County. Most guys make it 20, maybe 30 minutes before they scare themselves enough to come running back to the car. Most guys, but not David. </p>\n\n<p>Now that we&#39;ve set the scene, let me tell you the story David told me all those years ago.</p>\n\n<p>&quot;When I was 16 or 17, I was a junior in high school, so however old that is, I broke in to Major Graham&#39;s Mansion,&quot; David told me one day after class. </p>\n\n<p>&quot;The Halloween place? Why?&quot; I asked not sure where this was going.</p>\n\n<p>&quot;Because it&#39;s really haunted,&quot; he replied with a grin. &quot;Like for real ghost and demon type shit.&quot;</p>\n\n<p>&quot;Yeah, sure it is,&quot; I laughed. &quot;Did you remember to bring your Proton Pack with you, you jackass?&quot;</p>\n\n<p>David wasn&#39;t smiling anymore. &quot;No man, I&#39;m serious. We saw ... things there. Real fucked up things.&quot;</p>\n\n<p>I had to hear this story. David had a flair for embellishment, I wouldn&#39;t call him an outright liar, but he was known to tell &quot;big fish&quot; stories. &quot;What did you see? Please tell me, the anticipation is killing me.&quot;</p>\n\n<p>&quot;You&#39;re a real asshole sometimes, but I&#39;ll tell you. So like I said, I broke in to the Mansion when I was younger. I don&#39;t know what I was thinking, I don&#39;t know why I even thought it would be fun, but I did it. Me and a few buddies drove back there one night, it must have been close to midnight when we got out there. We had to ditch the truck pretty far from the mansion because we didn&#39;t want anyone to see the headlights. So we stumbled through the trees for awhile before we came up on chain link fence at the back of the property. My buddy Chunky, he wanted to cut the fence since his fat ass couldn&#39;t climb over but we ended up getting him over it. We decided to check out the main house first, oddly enough the door was open, I woulda figured it woulda been locked but it swung right open. There&#39;s a room upstairs that&#39;s sposed to be haunted by a little girl, the story goes that if you roll a ball into the room that it&#39;ll get rolled right back out.&quot;</p>\n\n<p>&quot;Ok... and did it? Did the ball come rolling back out?&quot; I asked with as much sarcasm as I could muster.</p>\n\n<p>&quot;Well we didn&#39;t have a ball to roll in there so we walked in and stood there for about 5 minutes just listening. I swear to you that I heard a little girl giggle but Chunky and Seth will tell you otherwise. Anyway, after that room proved to be a bust, we headed to the Confederate room. It was dead silent in there and nobody heard anything.&quot;</p>\n\n<p>&quot;So when does this story get scary Davey?&quot; I asked, knowing full well he hated being called anything but David.</p>\n\n<p>&quot;When we went to the old slave quarters, you asshole,&quot; David shot back with a grin. &quot;We headed out to the slave quarters  because that&#39;s where most people claim to see Bob and Sam.... I wish that&#39;s all I saw,&quot; he said, his voice trailing off as he looked across the quad in front of the Library. </p>\n\n<p>&quot;Don&#39;t be such a drama queen!&quot; I said pushing his shoulder and shocking him out of whatever trance he was in.</p>\n\n<p>&quot;No, I&#39;m serious, it was bad dude. We made it out to the out buildings and it was the darkest I ever remember it being, we didn&#39;t have any flashlights or anything so we kind of just guessed where they were. Well we found them and as we&#39;re walking up both Chunky and Seth stop. &#39;Y&#39;all hear that?&#39; Chunky asked the group. I didn&#39;t hear anything but Seth grunted in agreement. &#39;Shut up and listen David,&quot; Chunky said to me. I remember holding my breath and straining to hear.&quot;</p>\n\n<p>&quot;Hear what? God your stories take 6 years to tell.&quot;</p>\n\n<p>&quot;A baby screaming, loud. I finally heard it and it made the hair on the back of my neck stand up. It was.... otherworldly, yeah, that&#39;s a good way to describe it. We had no business hearing a baby screaming and it worried me. Part of me said to run but the other part of me told me I had to help that baby, so I ran into the building.&quot;</p>\n\n<p>Now his story was starting to creep me out, I couldn&#39;t think of anything smartassed to say so I just nodded.</p>\n\n<p>&quot;I saw the outline,or silhouette. whatever you want to call it of like a toddler. Looked to be about the size of a three year old. I called out &#39;hey buddy, are you ok?&#39;&quot;</p>\n\n<p>I realized I&#39;d been holding my breath, just a second ago I was thinking he was full of it, but something about the way he told the story made it seem so very real.</p>\n\n<p>&quot;Well then I saw the shadow or whatever move, like it was turning around. and where a face should have been I only saw 2 red eyes glowing. I felt like I was frozen, then the shadow started to change, it got really big, really fast and I could hear a loud growl coming from it. I turned and hauled ass out of there. Wouldn&#39;t you believe it, Chunky and Seth where already about 100 yds ahead of me. We hauled ass for the fence, jumped it. Chunky&#39;s fat ass didn&#39;t even need help this time and we tore off outta there.&quot;</p>\n\n<p>&quot;Whoa...&quot; was all I could muster. &quot;I feel like you might be bullshitting me still though.&quot; I said, forcing a smile.</p>\n\n<p>&quot;I swear on the graves of the 3 guys I lost in Fallujah,&quot; he said. An oath I had learned that David held sacred.</p>\n\n<p>&quot;Did you ever go back there?&quot; I asked.</p>\n\n<p>&quot;Fuck no, I didn&#39;t, and I never will.&quot; </p>\n\n<p>To this day, David swears that his story is true, and true to his word he never goes anywhere near the Mansion. I visited a few times in the years after he told me the story, only for the Halloween attraction, but I never ventured near the slave quarters. Knowing what I know now about this area, I&#39;m glad I never did.</p>\n\n<p>But now that I think about it... the last time I went to the haunted Halloween attraction I thought I saw 2 guys hanging from a tree, the grisly display was a ways away from the rest of the attraction area. You guys don&#39;t think it was Bob and... no, that&#39;s ridiculous. </p>\n</div>\n","author":"MakroYianni"}