{"rank":"6","title":"Down By the Creek (Final)","id":"8lmvn6","url":"/r/nosleep/comments/8lmvn6/down_by_the_creek_final/","time":"1527109048000","body":"<div class=\"md\"><p>When you look in the mirror at yourself, what do you see? </p>\n\n<p>A weirdo? A normal human being? A success? </p>\n\n<p>What do you see? </p>\n\n<hr/>\n\n<p>I was far away from Tennessee. I hitchhiked all the way up to Colorado in the past few months. I begged for enough money to buy me some warmer clothing. A jean jacket, carpenter jeans, a button up shirt, gloves, duck boots, and a snow cap. Good enough. </p>\n\n<p>If it covered up my decaying skin, I was fine with it. </p>\n\n<p>At first, it started in the center of my chest. Now, it was spread down to my stomach. </p>\n\n<p>The whispers in my head never stopped, and evil thoughts were in my head all the time. </p>\n\n<p>I got to the border of Colorado and found a lake. I went over to the lake and looked at myself in the water.  </p>\n\n<p>I didn’t recognize myself. </p>\n\n<p>My face was hollow and thin. I could see my decaying skin sneaking up to my neck.  </p>\n\n<p>I was turning into the monster. This time, there was no stopping it. </p>\n\n<p>&quot;It&#39;s only a matter of time Scott.&quot; </p>\n\n<p>&quot;Shut up!&quot; I yelled. </p>\n\n<p>The voices stopped, but only for a little while. </p>\n\n<p>It had only been a month since I transformed. </p>\n\n<p>I didn’t want to lose my clothing again, that would be bad. </p>\n\n<p>I stepped away from the lake and started to walk down the road. Ahead of me, I saw a forest. I was alone again. </p>\n\n<p>Snow was starting to fall, and my hands were getting numb. </p>\n\n<p>I didn’t feel like hitchhiking again. </p>\n\n<p>Then, a thought hit me. </p>\n\n<p>What if my bank account was still available? </p>\n\n<p>My mom always said that I had a bank account that I could access as an emergency. </p>\n\n<p>I started to get excited. </p>\n\n<p>Maybe my parents left me some money. </p>\n\n<p>After all, they did disown me, right? </p>\n\n<p>I walked on for a mile or two, and that&#39;s when I saw a gas station. </p>\n\n<p>There were only three gas pumps, but there was a convenience store inside. My boots crunched on the gravel as I walked inside. Warm air hit me, and that was the best feeling in the world.  </p>\n\n<p>There was a bunch of snacks and drinks. I looked to the right of me and saw an ATM. </p>\n\n<p>Bingo! </p>\n\n<p>I went over to the ATM and looked at it. I didn’t have a card to swipe, but that was no problem. Little did the convenience store owner know that I could hack into one of these. My mom showed me how to do it when I was seven. </p>\n\n<p>My mom was always one of those &quot;end of the world&quot; fanatics. Therefore, she always taught me survival skills. </p>\n\n<p>I started to tamper with the pins and the card swipe. There was a special way you had to do it. Almost perfect. After a few minutes of tampering, I finally could access the PIN screens. After a few minutes of hard memory thinking, I remembered my PIN codes. I typed it in and requested $200. Sure enough, it worked. </p>\n\n<p>&quot;Yes!&quot; I shouted. </p>\n\n<p>One of the employees looked at me curiously. He walked over to me slowly. </p>\n\n<p>&quot;Hey, you,&quot; He said, &quot;What are you doing?&quot; </p>\n\n<p>I didn’t answer him. After I got the money, I started to walk. </p>\n\n<p>The man followed me. </p>\n\n<p>He followed me out of the store and put a hand on my shoulder. </p>\n\n<p>&quot;Is that your money?&quot; He asked. His grip was like iron, and he was making me angry. My hands were starting to turn black and wispy. </p>\n\n<p>&quot;No.&quot; I thought. </p>\n\n<p>&quot;Why don’t you hand me the money and go on your way.&quot; The man said. </p>\n\n<p>I clenched my fists and tried to calm myself down. </p>\n\n<p>&quot;Listen, the money is mine.&quot; I said calmly. </p>\n\n<p>&quot;Are you sure? I saw you tampering with the ATM.&quot; The man said, smartly. </p>\n\n<p>&quot;Just let me go. I don’t want to hurt you.&quot; I said, turning around the to face the man. </p>\n\n<p>&quot;If you don’t hand the money over, I&#39;m calling the cops.&quot; The man said. </p>\n\n<p>&quot;Fine.&quot; I said through gritted teeth. That was the last straw. </p>\n\n<p>I shoved the man back and unleashed a torrent of anger at him. I saw him stagger back in shock. I punched him in the chest so hard that my hand went through. </p>\n\n<p>I was numb to it all. </p>\n\n<p>The man spit up blood and his eyes started to roll back into his head. </p>\n\n<p>I started to transform back. </p>\n\n<p>I pulled my arm out, and it was soaked in blood. </p>\n\n<p>I had lost my clothes again, and I was naked.  </p>\n\n<p>I stared at the man on the ground, then, I picked him up by the armpits and dragged him inside the store. </p>\n\n<p>I put him behind the cash register, said a short prayer, then backed away.  </p>\n\n<p>Thankfully, there were some clothes in the convenience store. </p>\n\n<p>I went over to the clothing racks. I picked out some underwear, jeans, long sleeve shirt, a jean jacket, and some tennis shoes and socks.  </p>\n\n<p>The smell of blood started to fill the air. The smell of pennies. </p>\n\n<p>I looked out the window to make sure no one was looking, or driving by, and then I took a few snacks, and some water, and then headed out. </p>\n\n<p>Therefore, that was my life a now. </p>\n\n<p>A ruthless murderer and a thief. </p>\n\n<p>&quot;Maybe the monster has taken over me.&quot; I thought. </p>\n\n<p>I pushed my skin and it sank down. The infection was getting worse.  </p>\n\n<p>The snow was falling in big flakes now; covering up the road. I left indentations where I walked. </p>\n\n<p>Then, sharp pains racked my body and I fell to the ground again. </p>\n\n<p>&quot;It&#39;s only a matter of time Scott.&quot; </p>\n\n<p>The pain continued to torture me, and I was starting to convulse. </p>\n\n<p>&quot;You will succumb to the darkness and this time you will not stop it.&quot; </p>\n\n<p>I screamed aloud as my skin started to shift and spread. </p>\n\n<p>&quot;I will never succumb to you.&quot; I said, fighting tears. </p>\n\n<p>&quot;Whatever the hell you are, I will never succumb to you.&quot; </p>\n\n<p>&quot;Language Scott. Let&#39;s not get too violent. Of course, you know who we are.&quot;  </p>\n\n<p>Then, confusion hit me. Why did the voice say we? </p>\n\n<p>&quot;Why did you say we instead of I?&quot; I asked. </p>\n\n<p>&quot;Because there is more than one of us, and in total, there are 3 of us. Including you.&quot; </p>\n\n<p>&quot;Who are the other two you bastards?&quot; I said, fighting the pain. </p>\n\n<p>Then, the voices of Allen and Ralph arose. </p>\n\n<p>&quot;Us.&quot; They said. </p>\n\n<p>Then, the pain stopped, and I started to throw up. </p>\n\n<p>Black liquid came out of me like a fountain. I could see an eye, tentacles, and some other things I do not want to describe. </p>\n\n<p>I was just about to die, when the puking ceased. </p>\n\n<p>I laid on my side, gasping for air. </p>\n\n<p>I turned around and saw the monster floating in the air. It was staring at me from a distance. </p>\n\n<p>The voices of Allen and Ralph arose again. </p>\n\n<p>&quot;You didn’t think we were dead, did you?&quot; </p>\n\n<p>That’s when the monster started to split in two. </p>\n\n<p>I could see human forms taking shape. I could see eyes, hair, legs, and arms. </p>\n\n<p>Then, they stood in front of me. </p>\n\n<p>Allen and Ralph. </p>\n\n<p>I stared up at them and they stared back. Their teeth were black and their hair was long too. </p>\n\n<p>They had both grown. </p>\n\n<p>Ralph was even skinnier, and Allen was just about the same. </p>\n\n<p>I scooted back and stood up. </p>\n\n<p>I pointed at them and said, &quot;You both should be dead.&quot; </p>\n\n<p>Allen smiled and said, &quot;But we&#39;re both standing here Scott, and you know it.&quot; </p>\n\n<p>&quot;If you won&#39;t succumb to the darkness, then we will make you.&quot; Ralph said. </p>\n\n<p>&quot;This can&#39;t be happening! You&#39;re both dead!&quot; I screamed. </p>\n\n<p>The snow was like a blizzard now. </p>\n\n<p>They both said in unison, &quot;No we&#39;re not.&quot; </p>\n\n<p>Then, they both transformed and lunged at me. </p>\n\n<p>I took off my clothes and transformed. I collided with them. </p>\n\n<p>They were more powerful, so they tackled me. Allen wrapped his tentacles around my throat and started to choke me. Ralph tried to gouge my eye out, but I fought back. I punched, kicked, and eventually broke free. I slashed my tentacle through the air and cut Allen through the middle. Green blood oozed out. I could hear him shriek. </p>\n\n<p>I ran into the woods, trying to get away, but Ralph caught up to me. </p>\n\n<p>He slammed into me and started to shove his tentacles down my mouth. I gagged and tried to pull them out, but they went in deeper. </p>\n\n<p>Then, I used a force of energy to knock Ralph sideways. He slammed into a nearby tree. </p>\n\n<p>I turned around, just in time to backhand Allen. He fell backwards. I lunged at him and started to choke him, but he was stronger. He threw me off and I slammed into a tree. </p>\n\n<p>A flash of pain went through my side. I looked down and saw a tree branch coming through my skin. </p>\n\n<p>I hopped off the tree and landed in the ground. I tried to get up, but Ralph was on me like a flash. He tried to choke me, but I threw him off. </p>\n\n<p>I got up quickly and saw them both standing there. </p>\n\n<p>They started to morph back into one again. </p>\n\n<p>&quot;How did you guys survive?&quot; I asked. </p>\n\n<p>&quot;We succumbed to the darkness.&quot; They said, &quot;And you will too.&quot; </p>\n\n<p>They lunged at me, but little did they know that I took out the tree branch that impaled me and hid it behind my back. </p>\n\n<p>I brought it out and it pierced the monster in the eye. </p>\n\n<p>I heard loud screeches and I could see the monster on the ground, convulsing. </p>\n\n<p>The shapes of Allen and Ralph were morphing back and forth. </p>\n\n<p>&quot;You will never win! The darkness always wins!&quot; They shrieked. </p>\n\n<p>&quot;I&#39;m out from the darkness.&quot; I said, then, grabbed the branch and yanked it out of the monster. I started to stab the monster with it, and I felt no remorse. </p>\n\n<p>The monster started to disintegrate before my eyes, and I stopped stabbing it. The shapes of Allen and Ralph were still visible, and I knelt beside them. </p>\n\n<p>I could see them crying. </p>\n\n<p>In a quick flash, I felt bad for them, but it went away quickly. They made me into who I was, and there was no forgiving that. </p>\n\n<p>They melted into the snow, turning it black and dark green. </p>\n\n<p>The monster was gone. Destroyed. Demolished, whatever you call it. </p>\n\n<p>I sank to the ground and put my hands in front of my face. Tears leaked down my face. </p>\n\n<p>It was over. </p>\n\n<p>I screamed triumphantly.   </p>\n\n<p>I walked over to where I took off my clothes and put them back on. They were damp from the snow, but I couldn’t have cared less. </p>\n\n<p>I went to the side of the road, and after an hour or so, I caught a bus heading back South. </p>\n\n<p>It took me a few months, but I finally got to the Tennessee border. </p>\n\n<hr/>\n\n<p>It&#39;s snowing here right now. </p>\n\n<p>I&#39;m at a crossroad. There is four ways to go, but I&#39;m not sure where to go. </p>\n\n<p>I don’t think I belong anywhere anymore. </p>\n\n<p>The monster is still inside me, but it doesn’t bother me. I have control over it now, and there is no stopping it. </p>\n\n<p>I could go back to my house and live there, but I would eventually get caught. </p>\n\n<p>I&#39;m still a fugitive, so there is no stopping for me. </p>\n\n<p>I will forever live my life as a rambling man. </p>\n\n<p>It’s sad to think of it, but maybe I&#39;ll find love, who knows right? </p>\n\n<p>The snow is still falling.  </p>\n\n<p>I&#39;m writing this as I stand in the middle of the crossroad. For just a moment, I could have sworn I heard music from a distance. Maybe there is a car coming my way. </p>\n\n<p>Will I ever become normal again? </p>\n\n<p>Will I ever live a normal life? </p>\n\n<p>The chances are low, but who knows, I may get lucky. </p>\n\n<p>But for now, only time will tell... </p>\n\n<hr/>\n\n<p>only time will tell.</p>\n</div>\n","author":"Dan100903"}