{"rank":"34","title":"The North Tower","id":"8lmwxq","url":"/r/nosleep/comments/8lmwxq/the_north_tower/","time":"1527109301000","body":"<div class=\"md\"><p>April 4, 2017</p>\n\n<p>Henry,</p>\n\n<p>I’m back from the mountain. Here’s your update, as promised.</p>\n\n<p>First off, the plantings have taken hold quite well. I’d estimate 80% of them have taken root. Amazingly good for a first effort on such a desolate range. We should do a follow-up planting, I’m going to suggest we take advantage it to add a bit of diversity, maybe some hardwoods and hardy shrubs to reduce the chance of a blight. I know it’s a little early to be saying such things, but with a little luck we could see a young forest on the south side within ten years.</p>\n\n<p>As to the north side, I did as you asked and visited the fire tower. Rick was there, kinda. I can only describe his mood as distant. I mean, for a guy who has spent much of the winter alone you would think he would have greeted us with a bit more, I dunno, excitement? When we got there he barely bothered to greet us. I gave him the box of cookies, just like you said, and he didn’t give them more than a glance. </p>\n\n<p>He eventually loosened up a bit, and we got to talking. Over the next few hours he became more personable, more like the Rick we all know. But, I have to tell you, the whole time, he was distracted, almost like he was listening for something. The only time he showed any energy was a few hours after we got there, when we heard a loud crack out on the north face. Rick all but jumped out of his chair and had the most…well, I’ll call it as I saw it. He looked frightened. Spooked. It’s a wonder he didn’t pull his rifle off the rack. He calmed down after a little while, said something about a bear prowling around. I don’t know why that would spook him. We were all inside a stone tower, after all.</p>\n\n<p>He got a bit edgy when we told him we were staying the night, but that passed as well. Nothing happened. I will say, when we all gathered for breakfast Rick was looking a bit drawn, like he hadn’t slept a wink. Andy told me on the way down the mountain that he’d woke up in the night and saw Rick sitting at the table, drinking coffee. Don’t know what that was all about.</p>\n\n<p>I guess what I’m trying to say is that you might want to get Rick out of there earlier than scheduled. He’s looking pretty worn out.  </p>\n\n<hr/>\n\n<p>April 13, 2017</p>\n\n<p>Henry,</p>\n\n<p>Drew told me after I got back from the mountain that Rick had been getting irregular in his mid-morning radio check-ins. Seems that for the past month or so Rick has missed a good third of them. Drew has had to call him. He tells me that Rick usually answers back right away, no more than a few minutes. When asked if there was a reason for this, all Rick would say was he was busy with other things.</p>\n\n<p>I didn’t know what to make of this. Drew said Rick sounded tired much of the time and wondered if he had been sleeping in. He was writing it off as laziness, but I remembered Andy’s seeing him up in the middle of the night with a cup of coffee. Maybe that bear he mentioned has him up at night on the lookout. </p>\n\n<p>I’m concerned about this. If he’s sleeping while he’s supposed to be on watch then we have a serious gap in our fire safely plan. I don’t want to wake up one day and find out we lost the entire north face of the mountain because Rick was afraid of a bear. We really need to do something about this.</p>\n\n<hr/>\n\n<p>April 17, 2017</p>\n\n<p>Henry,</p>\n\n<p>I wanted to update you on the whole thing with Rick. Andy has decided to head back up to the tower and spend a few days with him. He thinks a little company might do Rick good. But, we also want to keep an eye on him and find out what’s going on. </p>\n\n<p>After I wrote you the last time I ran into the guys who did the last supply run. Did they have a tale to tell! This was back in mid-March, when we had that week between the two storms. The three of them went up there on snowmobiles, one with a trailer full of supplies. When they got they found the tower unoccupied. Rick was nowhere to be seen. The door was wide open, and the place was a mess, like someone had a fight. They called out but got no response. As you might imagine, this worried them greatly. </p>\n\n<p>They were about to call in for help when Rick comes striding through the door, buck naked. Surprises all around! When the other guys asked Rick what was going on he said something about “taking a snow bath”, which they said was bull as he was both dry and dirty. He also claimed not to have heard the sound of three snowmobiles approaching! It was also noted that he bore a number of scars that looked recent. One of the guys described them as “claw marks, too many for a man to have and survive”. They all noted how he seemed unaffected by the cold despite his nakedness. </p>\n\n<p>None of this ever got reported officially because they felt there was nothing to report. “We all go a little flaky sometimes”, one said.</p>\n\n<p>I’m worried about Rick. Everything I’ve seen and heard tells me he’s not doing so well up there. He hasn’t done anything rash or illegal, but if his mind is in decline he might walk out some day and get lost in the woods, even die of exposure. I know, he’s experienced and had all the same training we had. Even so, when Andy said he was going up there, I didn’t say no. </p>\n\n<p>Have you given any thought to my request that we get Rick out of there? I know we’re short-staffed, but this is getting bad.</p>\n\n<hr/>\n\n<p>April 19, 2017</p>\n\n<p>Henry,</p>\n\n<p>I’ve just heard from Andy. We have to do something about Rick.</p>\n\n<p>Andy left here right after breakfast, hiking with a full pack. When I said it seemed a bit much, he winked and said most of it was beer. Okay, fine. He wants to have some bro time with Rick. Even with the half-case in his bag I figured he’d be there by mid-afternoon. When I didn’t hear by sundown I got worried. Drew tried to reach Rick on the radio but got nothing. Wasn’t until right after dark an hour or so later that Andy checked in. Rick wasn’t at the tower. When I asked why he was late in arriving Andy told me he’d had some trouble on the trail, but wouldn’t say what. I bet he was dipping in to those beers a little early. Maybe I should have pressed the matter but I was more worried about Rick.</p>\n\n<p>I was about to call for a search party when Andy got all quiet and said Rick was back. I told him to put Rick on the line but he only whispered, “Later, later. Got to go” and signed off. He actually turned off their radio! I was ready to hike up there and give them both the business when the radio crackled to life again. It was Rick.</p>\n\n<p>“We’re fine here, everything is fine”, he said in this flat tone.</p>\n\n<p>“Put Andy on the line”, I demanded.</p>\n\n<p>“Andy is busy. He is busy.”</p>\n\n<p>“Busy doing what? Rick, what the hell is going on up there? Where were you?”</p>\n\n<p>Pause. “I was busy. Things to do.”</p>\n\n<p>The mike stayed open, like he was holding down the button. Then there was this weird sound in the background. It sounded like someone vomiting.</p>\n\n<p>“Rick, who is that? Is that Andy? Is he all right?”</p>\n\n<p>The mike was held open again. A rustling, like wind. Then, Rick. “Andy is all right. He is all right…it is late. Very late. Good night.”</p>\n\n<p>That was it. We tried raising them several more times tonight, without success.</p>\n\n<p>Henry, are you going to answer any of these email?</p>\n\n<hr/>\n\n<p>April 21, 2017</p>\n\n<p>I don’t know what you’re playing at, Henry, but I have two missing men now. I’ve already called the Sheriff and am cc: this to the regional administrator.</p>\n\n<p>We couldn’t get Andy or Rick on the radio that night, or all the next day. Drew stayed by the set the whole time but only got the morning reports from the other stations. North tower was silent. </p>\n\n<p>We did get something weird at sunset last night. Soon as the stars came out. The radio let out this loud, and I mean loud, patch of feedback for a good ten seconds. I wasn’t even in the room and I heard it. When it stopped there was a long stretch of something like the sound of crinkling paper, then a voice that might have been Andy shouting from far away, “RUN. RUN.” Then the mike went dead. We tried raising them again, no luck.</p>\n\n<p>It’s first light here now, and I’m taking a party up to the tower. I’ve asked the Sheriff to raise a search party and have it on standby in case there’s a problem.</p>\n\n<p>I don’t even know why I’m writing you with this, you’ve been worse than useless. I’ll be filing a grievance with the Commissioner when I get back. You better hope to hell there’s nothing wrong with either of those guys.</p>\n\n<hr/>\n\n<p>April 22, 2017</p>\n\n<p>Blood. Where was the blood?</p>\n\n<hr/>\n\n<p>April 28, 2017</p>\n\n<p>Henry,</p>\n\n<p>I’m writing this to you from my hotel room in Reno. No doubt you’ve been informed of what happened in the last few days, either officially or what was on the news. I figured I should write down my side of the story, if only for my own benefit.</p>\n\n<p>I’m out. Completely. Fired on the spot by that jackass who showed up after it was all over and tried to tell everyone it didn’t happen. The way he treated Andy and Rick, he deserved to lose some teeth. I don’t care. To hell with them all. I didn’t even pack my stuff, I just got in my truck and drove till I got here.</p>\n\n<p>So, what happened.</p>\n\n<p>Four of us left at first light. I brought the satellite phone so I could keep in contact with the ranger station on the trail. I also brought my .45 in case that bear showed up – or, anything else. I had a feeling from the moment we hit the trail that we were walking into something bad.</p>\n\n<p>Was about noontime that we spotted the smoke, thin wisps coming over the mountain. We were less than an hour from the tower, so we pressed on. If there was a fire starting in the woods we’d need to be there, both for its shelter and to coordinate firefighting efforts. </p>\n\n<p>One of the others noted how quiet things had got. He was right. I listened. Not a sound, no birds or wind or anything. All of a sudden I was feeling a chill, right up my spine. That’s when we were attacked.</p>\n\n<p>I still don’t know what it was. Big, and dark, and fast. It came out of the woods to our right. It landed on Holly and tore right into her. She screamed like a banshee. It didn’t make a sound. No growls or roars. All we could hear was her, under it, being ripped to pieces. I drew my gun and fired. It jumped back, let her go. I fired again. It ran into the woods. Jon ran to Holly, but it was too late. She was dead.</p>\n\n<p>Everyone freaked out a bit. Jon wanted to go back, but we convinced him to press on. The others picked up Holly’s body and, wrapped in a poncho, carried it while I kept watch on the woods and wished I’d brought more ammo. Not only had that thing been quiet, it didn’t bleed a drop. I put two heavy slugs into it, would have dropped a bear.</p>\n\n<p>We didn’t run for the tower, not with a body, but we sure walked damned fast.</p>\n\n<p>We arrived at the tower a bit more than a half hour later. First thing we noticed was that the tower didn’t have a roof anymore. The top third was blown clear off, jagged, like an explosion or a really bad lightning strike. Its days as a fire watch station were over. And the smoke we’d seen wasn’t coming from the tower. It was the woods, all right. Big patch about a mile away was gushing up thick, grey smoke. It looked ready to burst into flame. I pulled out the satellite phone and made the call to the county while Jon and Melinda lay Holly under a tree and went into the tower to look for Andy and Rick.</p>\n\n<p>Barely had I got someone on the line when I heard Melinda cry out. I pulled my gun and ran into the tower to find her and Jon staring at what remained of Andy. You won’t need the details. Odds are the official report will say he died in the forest fire, something like that. All I’ll tell you is, I’m glad he had that stupid Star Wars tattoo on his arm. Made him easier to identify.</p>\n\n<p>The main room of the tower was a shambles. It looked like someone had a barroom brawl. Did Rick get drunk, go nuts and do this? There was Andy’s pack, and there was the unopened beer inside. The only person who might know was nowhere to be found.</p>\n\n<p>Next to the overturned table was a notebook, the pocket kind we all carry. It must have been Rick’s. I picked it up as Melanie went outside to get some air, stuffed it inside my shirt pocket for later. The phone rang. It was the county fire marshal. I confirmed the fire in the woods and asked that they get a spotter plane in the air ASAP. That’s when Melanie came back in a panic and said that Holly’s body was gone.</p>\n\n<p>We all went outside. Sure enough, the spot under the tree was bare. None of us wondered if she were still alive and had wandered off. We saw her die. Something had come and taken her while we were in the tower. Something quiet.</p>\n\n<p>I got back on the horn and told the Sheriff that we had a rabid bear on our hands, that it had killed Holly, and to send a team of armed deputies to the tower. I didn’t dare tell him the truth, he might have thought we were panicking and not have sent anyone at all! Then I had Jon and Melanie come into the tower and we barricaded the door. For all I knew, that thing could climb the tower and come in the ruined roof, but we had to do something. I found a tarp to put over Andy’s body, and we waited.</p>\n\n<p>Spotter plane made a pass about a half hour later, and the deputies arrived in a helicopter about an hour after that. I showed them Andy’s body and told them about how the “bear” dragged Holly off into the woods. As for Rick, none of us knew what happened to him. He hadn’t been found by the time I left.</p>\n\n<p>That’s it, Henry. Thanks for all your “help”. Good luck explaining all this to Andy’s family. I’m watching the news as I write this, watching the report on how the fire has spread like mad, burning the whole north face of the mountain. How three members of the Forestry Service have “gone missing”. And how four Deputies barely survived an encounter with a “sick bear” that somehow got away. Good luck with it all.</p>\n</div>\n","author":"TheAncientMarinade"}