{"rank":"79","title":"Simon Says Stop Crying","id":"8lmyrr","url":"/r/nosleep/comments/8lmyrr/simon_says_stop_crying/","time":"1527109692000","body":"<div class=\"md\"><p>Welcome <em>home</em>, Alice.</p>\n\n<p>There are so many surreal things that I am so very excited to tell you that it is hard to hold it in or sit here and wait any longer. </p>\n\n<p>Me, me, me. Enough about me and my problems. </p>\n\n<p>You must be freezing. I may have misplaced your clothes in the scuffle. There is a robe waiting for you in the bathroom, though, and I would like you to put it on. Just down the hall, sweeheart. Put down the paper, go to the bathroom. And put it on <em>right now</em>. </p>\n\n<p>I should warn you at this point. If you don&#39;t put on that fucking robe Alice, the cuts I am going to give your face are going to be so fucking fine that you won&#39;t forget them. Forever kinda cuts, Alice. You want your friends to see you with those kinds of cuts on your face? You think those silly sluts and skanks will be so fucking friendly, then, Alice?</p>\n\n<p>You know I will know if you don&#39;t do it. Look at the camera on the wall.</p>\n\n<p>There. That is better. Do you recognize it? The robe, of course. I want you to nod now, Alice. Nod if you recognize it.</p>\n\n<p>Thank you.</p>\n\n<p>Do you remember when we fell in love?</p>\n\n<p>It was in college. Autumn, of course. In our little neck of the universe the leaves fall down in all the right shades in September. They create this weird color mixture... mashed with a littany of greens and browns and yellows that crunch happily under your feet with every step. I love it. Fall my favorite time of the year. </p>\n\n<p>Do you know why Fall is my favorite time of year, Alice?</p>\n\n<p>Because out of that sunny sea of leaves in the classroom quad, out of a rainbow in the softly falling rain, your face popped up over the hill with that long, luscious red hair.</p>\n\n<p>Alice, I was floored. My feet felt like anvils. You were so young, so fresh and free of heartbreak that it pierced through the sky itself. I looked at the other guys around me and wondered why they did not fall to the floor before you. They were zombies. Aren&#39;t they all? A bunch of idiots who could not even hold open the door for a beautiful woman in heals and an ironic interpretation of her Sunday&#39;s best.</p>\n\n<p>When I grabbed the big oak door ahead of you, it was the first time I heard your voice. Your nervous giggle, one of my five favorite giggles. </p>\n\n<p>&quot;Thank you <em>so</em> much,&quot; you said with a pearly white smile and lit up amber eyes. That was the moment, nothing else. From that very second a year ago, and every single second forward I knew that I had to have you. It ate away at my memory. At my thoughts. Everything I saw was you, Alice. Your red hair, your smile, your giggles. </p>\n\n<p>I knew how to make you love me.</p>\n\n<p>I didn&#39;t go to class that day. No, no, no. What good was class when this fire was inside me? My heart was racing. My stomach turned to butterflies and then acid and then back to butterflies again. I pounded the key into my door. Slammed open the drawer. Powered ony my laptop in a frenzy to find you, sweet you. Your Facebook. Your files. <strong>Everything</strong> I could find that began and ended with you, Alice. </p>\n\n<p>By nighttime it was like I already knew you. Knew about your boyfriend John, your mom, your dad. Your hometown. </p>\n\n<p>I knew that daddy worked in the lumberyard most of his life and mommy was a secretary at the dentist&#39;s office. That was some real blue collar shit, Alice. They could barely afford to send you away to a state school. </p>\n\n<p>Inch by inch, right? </p>\n\n<p>Mile by mile?</p>\n\n<p>I may have gotten a check up or two. I knew that your brother was a fucking junkie who gave up a little too soon. </p>\n\n<p>If you&#39;re wondering whether I knew John was fucking one of your best friends, yes. I knew that too. And I knew about the pot.</p>\n\n<p>Oh, don&#39;t be so fucking surprised by it, Alice. You are in a box in my fucking basement right now, do you really think I did not kill your filthy fucking boyfriend too?</p>\n\n<p>You know how it is these days. Just about everybody wants to smoke, but nobody knows where to get it. It wasn&#39;t hard to follow him, to wait until they until him and his dipshit friends got desperate enough to ask strangers. And there I was, the hero in the Honda Civic. I put some sugar in his gas tank, so to speak.</p>\n\n<p>Stop crying, Alice. It doesn&#39;t take Nostradamus for me to right this letter in the past and still know that you are fucking crying at this point. If this letter is wet by the time I get downstairs, Alice, I am going to cut your fucking eyes out. I am going to cut your eyes out and when I am done, I am going to put some white gauze there so you know not to sully the important things.</p>\n\n<p>We&#39;re going to frame this letter, Alice.</p>\n\n<p>In the kitchen, on the refrigerator maybe. Or in the living room if you like. Women are always the best designers, what can a man know? Our home is bright and bought, paid in full. We can even expand if we like. How many husbands can say that? How many of those horrible guys that you loved in the past? </p>\n\n<p>I want our home to be the union of our lives, Alice. The matching of our destinies. The destination of our dreams. I love you, Alice. This is the only way I know how to give you my love. You will come to love it soon too, you must know that.</p>\n\n<p>Now, please. </p>\n\n<p>Honey. </p>\n\n<p>Darling.</p>\n\n<p><em>Whenever you are ready.</em></p>\n\n<p>Take off the robe. Come upstairs. And have dinner with me. I am waiting, and I am watching.</p>\n\n<p>I will always be watching.</p>\n\n<p>-<em>Simon</em></p>\n</div>\n","author":"iAmMatt1"}