{"rank":"0","title":"The Christmas Eve That Scarred My Life","id":"8ln74w","url":"/r/nosleep/comments/8ln74w/the_christmas_eve_that_scarred_my_life/","time":"1527111502000","body":"<div class=\"md\"><p>(I’m telling this to the best of my ability so some information might be wrong)</p>\n\n<p>Before the event I was a depressed man at the end of my ropes. My life had been a shitty style of events for as long as I could remember. My parents would abuse me, I would get bullied in school, and would always get beaten up or mugged. Like I said, I had a shitty life. The only person I could really trust was my sister because she had helped me through these events, and she even helps me now as I write this. Before this I was an overweight man living in a sad little apartment. That was until I saw the ad in the paper. A local mall needed a Santa to ask children what they wanted for Christmas. Call me a pedophile, but I liked to spend time around children. If anything could get me out of depression this could.</p>\n\n<p>I already loved this job. The children always brightened my day plus I think I was a pretty good Santa. My manager was a German man named Frank. He knew English(which was relief) and had said I was perfect for the job. This was the job that had made my life better. Until one day. There was a little girl missing her front teeth with her mother. As soon as she saw me she had pulled on her mom so she could visit me. She sat on my lap and I said </p>\n\n<p>“Hello little girl. What’s your name?” </p>\n\n<p>She put a big smile on her face and replied with, </p>\n\n<p>“My name is Elizabeth!” </p>\n\n<p>“Well Elizabeth, what would you like for Christmas”</p>\n\n<p>“I want a puppy!”</p>\n\n<p>I quickly looked at her mother and gave her a wink. </p>\n\n<p>“Have you been a good girl this year?”</p>\n\n<p>“Of course I have Santa! Don’t forget I live on 200 Hamilton Road!”</p>\n\n<p>This kinda surprised me. I was confused as to my she had told me where she lived as Santa had known where every kid lived. However my mistake was not thinking anything of it at the time. Her mother pulled her close and quietly scolded her about giving the entire mall their address(she was excited so she screamed it). I then gave her a Ho Ho Ho and Merry Christmas. After my shift Frank approached me and told me I was one of the best employees to work under him and invited me out to drink at 8 pm.</p>\n\n<p>It was 7:48 when I left. I decided to go to the mall and meet him there. I started questioning to why Frank wanted to get a drink. After all, Frank never drank...</p>\n\n<p>I surprisingly meet him there at 11:39 in stead of 8. I got lost in my thoughts and accidentally drove out of town. After I met up with him he walked into the mall. This is where I started to question things.</p>\n\n<p>“Frank why are we going into the mall? We’re going to get fucked my security!”</p>\n\n<p>(Pretend he has a German accent)”I know but at this point there would be no other places to go. Every bar has closed by now.”</p>\n\n<p>We came to the local bar at the mall and I started helping myself to any drinks I could find. Frank of course didn’t drink with me. After a few shots later Frank pulled out a bottle of wine. Frank said it was a family made drink and he said he wanted me to have it as a gift. I took one drink and passed out a few seconds later.</p>\n\n<p>...</p>\n\n<p>I awoke near the area where I worked. I was sitting down in a chair and surprisingly I wasn’t tied up. Frank was around the corner so I decided to confront him about why I was really here. Turns out he was talking in German to a person dressed as Santa holding a sack. They were arguing and I kept hearing the word “Hamilton”. I couldn’t remember what the meaning of it was all I knew was Hamilton was a German swear word. I quickly looked to a clock on the wall and saw it was 11:45. I had been out for nearly 12 minutes. Suddenly, the other man pulled out a revolver and aimed it at me. Frank walked up to the Santa chair and emptied the sack very carefully. I was mortified to see a little girl come out of the bag. It all began to make sense...When the mentioned Hamilton they meant 200 Hamilton Way...Where Elizabeth lived...</p>\n\n<p>In an instant I tackled the man with the gun and then ran up to Frank and punched him in the stomach. I ran to the girl when I heard the cock of the revolver.</p>\n\n<p>Frank had said, “It doesn’t have to be like this! Just step away from the girl.”</p>\n\n<p>I couldn’t believe what I was hearing. He knocks me out, points a gun to my head, and asks me to stay calm?! What the actual fuck!</p>\n\n<p>“No!” I screamed not giving a shit anymore, “What the fuck are you doing to her you six piece of-“</p>\n\n<p>I was cut off by the midnight chime of a clock. Frank quickly pulled me away from the chair and held me back from going to the girl. Suddenly a gramophone turned on and played “Santa’s Coming to Town.” There was something up though, the music was being played backwards and the voice was really distorted. I broke free of Frank’s grip when I ran to the girl. Pain struck me like lightning and I collapsed to the floor. I looked down and I had been shot in the leg. I felt a dark presence and heard growling from the chair. The last thing I remember before passing out was Frank dragging me away.</p>\n\n<p>...</p>\n\n<p>I awoke in a car with Frank driving it. He handed me a thermostat and told me to drink it. The fuck was he thinking?! He kidnaps and innocent girl and expects me to drink out of this fucking thermostat?! That’s when I remembered I had been shot earlier. I took it and started drinking and a warm sensation trickled down my throat. It was hot chocolate. My leg had been bandaged by his friend who was in the backseat. That’s when I decided to ask what happened.</p>\n\n<p>“Frank. What were you doing?”</p>\n\n<p>“It is an old tradition practiced by my father. If we do not follow it we will die along with everyone we love. Once a year on midnight of Christmas Eve, we sacrifice a child to a demon of darkness. This tradition has also been followed through generations for years. We have decided to name this demon Krampus.”</p>\n\n<p>Ever since this event I have been traumatized by anything Christmas related. It also gave me a lot to think about. When Elizabeth disappeared, how would her parents react when they found out their present was a daughter that would never return? Would they keep her presents under a tree forever? Or would they finally grow tired of the grief and finally throw the presents out? Either way I was being taken in for questioning tomorrow about the events and I swear I could hear the distorted voice of the song from that night. I wondered if Krampus was now after me. If so I can only hope that god can save me now...</p>\n</div>\n","author":"Darknezz1234"}