{"rank":"33","title":"Things like this don't happen","id":"8ln70q","url":"/r/nosleep/comments/8ln70q/things_like_this_dont_happen/","time":"1527111478000","body":"<div class=\"md\"><p>&#39;I can&#39;t believe this,&#39; Alice thought to herself. &#39;Things like this don&#39;t happen to people like me!&#39;</p>\n\n<p>Nevertheless, here she was. Alone. In a cell at the county jail, facing DUI and vehicular manslaughter charges. Scared, but still defiant, she paced the cramp confines of her cell as she considered her situation.</p>\n\n<p><em>I refused the breathalyzer test, so they have no way of proving how drunk I was. Daddy&#39;s lawyers will be able  to get this thrown out. Yeah. They&#39;ve made stuff go away before. I just need to stay calm.</em></p>\n\n<p>But the events of the evening kept replaying in her head. She couldn&#39;t turn off the sounds. The honking horn, the screech of tires, and the sound of metal colliding with metal. She&#39;d managed to walk away from her totaled Lexus with a few scratches. The other motorist and his passengers weren&#39;t nearly as fortunate.</p>\n\n<p>She blinked hard and tried to banish the image from her mind. She told herself that if she could take it all back, she would. But that wasn&#39;t possible. Nothing could be done for them now. Now, she had to focus on getting herself out of this mess.</p>\n\n<p>Her thoughts were interrupted by the sound of her cell door unlocking. A guard was showing another young woman into the cell. She appeared to be about the same age as Alice and was dressed in the same orange jumpsuit, but their similarities ended there. Whereas Alice was tall, tanned, toned, and blonde, this girl looked like she could be related to the Addams family with her jet black hair and pale complexion.</p>\n\n<p>The door closed. The girl continued to stand in complete silence. She was eyeing Alice in a way that she found deeply uncomfortable. After what seemed like an entire minute, she made her way over to the bunks and plopped down on the bottom one as Alice was already assigned to the top.</p>\n\n<p>Alice decided to break the uncomfortable silence with an appropriate though cliched question. &quot;So what are you in for?&quot;</p>\n\n<p>The girl looked up at her and smiled. &quot;I&#39;m in for you,&quot; she replied.</p>\n\n<p>Alice was taken aback. &quot;What do you mean you&#39;re in here for me?&quot;</p>\n\n<p>The girl continued smiling. The expression now seemed ominous. &quot;I&#39;m one of the people you killed tonight with your recklessness. The others crossed over, but I chose to stay behind. I managed to possess one of the lookie-loos  who stopped to gawk at the accident and made her commit a crime so that I could be in here with you.&quot;</p>\n\n<p>Alice tried to back away, but soon found herself against the wall of the cell. Before any more could be said, her cellmate crossed the length of the cell with frightening speed and placed her hands around her neck. She began throttling her with more force than her small hands should have been capable of generating. Alice couldn&#39;t breathe, couldn&#39;t budge the hands cutting off her air. &#39;This can&#39;t be happening,&#39; she thought....</p>\n\n<p>Just then the alarm sounded over the intercom near the cell door and Alice was jolted awake. She barely comprehended the message that followed, telling her and the other prisoners on the cell block to exit their cells and line up for head count. She glanced all around the cell for her attacker. But there was no one. Had it all been a dream?</p>\n\n<p>She lined up outside, one of the last to do so. Her neck felt genuinely sore, as though someone really had been trying to strangle her. She couldn&#39;t understand it, but was desperate to believe that the episode had all been in her mind.</p>\n\n<p>Not long after morning count, the breakfast trays arrived from the kitchen. After collecting hers, Alice dropped her tray onto an unoccupied table and sat down on a stool that, like the table, was bolted to the floor. She tried to eat despite not having much of an appetite. &#39;Hopefully, I&#39;ll be able to meet with one of dad&#39;s lawyers this afternoon,&#39; she thought as she tried to force down some scrambled eggs. &#39;Then we can start strategizing for my hearing on Monday morning.&#39; She began to comfort herself with the thought that tonight would probably be the last she spent in a dingy cell.</p>\n\n<p>The sound of a tray being dropped onto the table directly across from her made Alice look up. What she saw made the breath catch in her throat.</p>\n\n<p>The girl from her dream.</p>\n\n<p>The girl, who was now staring deep into her eyes.</p>\n\n<p>The girl, who was now smiling that same evil smile from her dream.</p>\n\n<p>&#39;No, this wasn&#39;t possible. It couldn&#39;t be,&#39; she thought.</p>\n\n<p>&#39;Things like this don&#39;t happen...&#39;</p>\n</div>\n","author":"Yeuh78"}