{"rank":"29","title":"Why you shouldn't go cave diving","id":"8lnm8d","url":"/r/nosleep/comments/8lnm8d/why_you_shouldnt_go_cave_diving/","time":"1527114975000","body":"<div class=\"md\"><p>&quot;A group of cave divers disappeared a few days ago. It is unknown what happened, but foul play was not ruled out.&quot;</p>\n\n<p>I bet some of you saw that news report. Also bet some of you live near The Devil&#39;s Rectum cave. Honestly I have no clue who named the cave, but they must of been weird.</p>\n\n<p>Ah, I&#39;m such a fool. Forgot to introduce myself. I am Jonathan Maxwell, and one of few people who entered the Devil&#39;s Rectum and came back out alive. I feel like I must explain the events inside the Rectum, and how I escaped.</p>\n\n<p>(FFS who named that fucking cave?)</p>\n\n<p>So, I was a spelunker. If you don&#39;t know what that is, basically a guy who loves to enter dangerous caves. So, when I heard of the cave outside Sulfur, Michigan, I really wanted to enter the Rectum. </p>\n\n<p>I&#39;m can&#39;t say that with a straight face, even with all that happened. Jesus Christ, I&#39;m such a weirdo. </p>\n\n<p>Anyways.</p>\n\n<p>So, when I heard about &#39;the cave&#39; I wanted to explore it. So, I went to Sulfur and asked the residents there. &quot;Oh no, you shouldn&#39;t enter that cave, people disappeared when they entered.&quot; </p>\n\n<p>The residents think that it was actually the Devil&#39;s Rectum, and if you entered it, you died and.....</p>\n\n<p>You can guess what happens.</p>\n\n<p>Obviously, I didn&#39;t believe them. Come on, a cave that turns people into shit is so damn stupid. At least, at the time, it looked stupid.</p>\n\n<p>Oh, I wished I listened..</p>\n\n<p>Yep, I survived. Honestly, looking back, I have no idea how. I feel like such a bad person, for leaving them.</p>\n\n<p>Oh shit, was I getting sidetracked? Sorry, I do that sometimes. Anyways, what was I saying? Oh yeah, the Devil&#39;s Rectum.</p>\n\n<p>I hate that name.</p>\n\n<p>Anyways, when I heard of the cave, I went to Sulfur and asked about it. People suggested I don&#39;t go there, and I didn&#39;t listen because of stupid, crackpot stories made by senile conspiracy theorists.</p>\n\n<p>But those senile conspiracy theorists were right, and I shoulda listened. But I didn&#39;t...</p>\n\n<p>Sidetracked again, my bad. So, after learning about the Devil&#39;s Rectum, I decided to go check out the location of the cave. It was a mile outside the town, in a valley between two similar shaped hills. I understood then why they called it the Devil&#39;s Rectum.</p>\n\n<p>The cave entrance was strange, and saw tracks coming out of the cave. I realized that this probably was an abandoned mine that either dug into a cave, or a miner got really bad luck with a cigarette and dynamite.</p>\n\n<p>I didn&#39;t go in too far, because the cave looked dangerous and didn&#39;t want to go in alone. The cave was really weird. It was not like a normal cave. It was.....it was like another world was deeper in the cave, and my body was reacting to it. I thought that maybe something was in the air.</p>\n\n<p>Well, I decided to leave and plan out a way to explore the cave without getting high. I called and old friend of mine, who.....had connections. He knew a few people who could give me the proper equipment I needed at a discount. </p>\n\n<p>He also knew a few people who were professional spelunkers such as myself. We had dove into caves before, and I could trust them with my life.</p>\n\n<p>I wish I never brought them. They&#39;d still be alive if I didn&#39;t.</p>\n\n<p>Well, there&#39;s no point in delaying the story, is there? I know nobody will listen, but the truth must be known. They must not be forgotten. </p>\n\n<p>After I collected my team of daredevil spelunkers, I learned that a person entered the Devil&#39;s Rectum and came back alive. However, she had told strange tales that didn&#39;t make sense. It got to the point that she was put into an asylum, and was forgotten about until now.</p>\n\n<p>Her name was Ashley Montgomery. I was surprised because I actually knew her late cousin. From what I know, he was murdered by a serial killer, or something. I think it was in Colorado,  but honestly I&#39;m not comfortable with that topic.</p>\n\n<p>As I was saying, I arranged a meeting with Ashley, who was really excited about it for some reason. Soon enough, I was in her room, and she was two inches  in front of me.</p>\n\n<p>&quot;Hihihihi!!! I haven&#39;t had a visitor in soooooooooo long! Please, sit!&quot; I was so confused, her speech was that of....</p>\n\n<p>A crazy bitch.</p>\n\n<p>&quot;You&#39;re excited to see me.&quot; She nodded. &quot;Can I ask about the Devil&#39;s Rectum? I heard you entered it.&quot; Her smiling face turned into a face of despair and regret.</p>\n\n<p>&quot;Don&#39;t go inside it.&quot; Ashley was dead serious. &quot;Why not?&quot; She got up and stared at me. &quot;Before I tell you, you need to know the history of the cave.&quot;</p>\n\n<p>&quot;During the gold rush, miners found gold and sulfur, and not long after that, the town of Sulfur was founded. Many mines are outside the town, and a few are still in use today.&quot;</p>\n\n<p>&quot;However, a cave was found with the largest deposit of sulfur known in the United States. That cave helped the town become known, and many sulfur miners entered it. Soon, the town was a key role in the Civil War, supplying any faction who controlled it.&quot;</p>\n\n<p>&quot;Then, something went wrong.&quot; I was eagerly waiting for her to continue. &quot;A miner dug into a cave, a large cave in fact. He went to check it out, and he vanished. The other miners heard screaming, and they tried to save their comrade. They too vanished. Pretty soon, the mine exploded, killing all inside.&quot; </p>\n\n<p>&quot;What was the cause?&quot; I asked Ashley. She started shaking. &quot;A world inside a world. The Demon&#39;s home. He talks to me, you know. He loves to give me nightmares. He says that I have a good body.....&quot;</p>\n\n<p>I left, leaving the poor woman who lost her sanity. I was going to enter the cave. I was going to find out what happened to the people who vanished.</p>\n\n<p>And I did. I wish I didn&#39;t.</p>\n\n<p>I rounded my team up and drove to the Devil&#39;s Rectum. I felt sorry for Ashley Montgomery. Her cousin was murdered and she lost her sanity. Something in that cave made her crazy, and soon I found out why.</p>\n\n<p>Due to the grieving families of the departed members of my team, I am not revealing their names. As I was saying, we had arrived at the cave, and entered it.</p>\n\n<p>We walked cautiously, due to the cave having a strange vibe. It smelled like rotten eggs, not surprising, since sulfur was somehow in the mine after the explosion.</p>\n\n<p>A few hours in, and we had grappled down, jumped over cracks, avoided the occasional snake, and then, a light. An amazing light, as if we had stumbled upon heaven itself.</p>\n\n<p>We found the source of light, and walked through an entrance. The light got brighter, and brighter, and brighter. Then, it vanished. I opened my eyes and was astonished at what I saw. </p>\n\n<p>We were standing on lush grass, as a breeze so heavenly blown through the plains. I was in awe. My team was excited, since this was an amazing discovery.</p>\n\n<p>I could tell this wasn&#39;t Earth. The sky was a light tint between sky blue and red, and in the distance, something was flying. I was walking around when I stepped on something, and it made a snapping noise.</p>\n\n<p>I looked down and fell back in horror. I stepped on human bones. Then, the world changed, the skies turned dark red, streams turned into blood, and out excitement turned into fear.</p>\n\n<p>Creatures came out of the ground around us, and lunged at my team. They tore us apart, ripping at my team&#39;s flesh. I panicked, and ran for the exit. I heard screams and screeches as the demons ran after me.</p>\n\n<p>I don&#39;t know how I escaped, but when I did, I stumbled outside the cave entrance. I turned around and waited hopelessly for somebody to come back. I waited for hours, and nobody came out.</p>\n\n<p>I eventually gave up, and drove away from the cave, crying in fear that my own friends were killed because I left them there.</p>\n\n<p>I write this, to anyone willing to enter the Devil&#39;s Rectum. Don&#39;t enter it. You&#39;ll just discover a world that was never meant to be seen by mortal eyes.</p>\n</div>\n","author":"Exo_Ghost"}