{"rank":"25","title":"Real Life Fairytales aren't so nice (Part 2)","id":"8lnrnp","url":"/r/nosleep/comments/8lnrnp/real_life_fairytales_arent_so_nice_part_2/","time":"1527116291000","body":"<div class=\"md\"><p><a href=\"https://www.reddit.com/r/nosleep/comments/8kswvy/real_life_fairytales_arent_so_nice_part_1/\">Part One</a></p>\n\n<p>-</p>\n\n<p>The thing about Fairytales is that most people only remember the endings - when everything is put to rights and everyone gets what they were after from the very beginning. Very few people remember the middle of the story, where terrible things happen and you wonder just what evils you did in your life to earn something so awful... sometimes I think my evil deed was what happened to my baby brother. </p>\n\n<p>Dad took a job as a contractor, that’s how we ended up in Gentry. Mom was pregnant, and we needed the money, so they packed my whole life into the back of a U-Haul and made me say goodbye to everyone I knew. </p>\n\n<p>I promised my friends I would write to them as I slid into the seat next to my dad, mom was driving the car while he drove the U-Haul. We listened to the radio until the station was lost and static reigned over the airwaves. Radio never worked well when you first got close to Gentry. </p>\n\n<p>The GPS tried to pretend like it didn’t know the way, but as we wound our way through the hills, the GPS suddenly chimed with the correct directions and we finally made our way into town. It’d be years before I figured out that GPS really couldn’t find Gentry – no one finds Gentry unless it’s actively seeking you out, and there was a reason my parents had been chosen. </p>\n\n<p>Our new house was typical for the area, a nice three-bedroom home in a neighborhood of houses that looked pretty much the same. Most of the families there were like us, contractors who came in from outside the town. I didn’t notice it that first day, but I did later – none of the couples on the street let their kids out to play. </p>\n\n<p>The only time I saw other children was when I went to school – otherwise it was like the town had no kids. </p>\n\n<p>After my little brother was born… I knew why that was. </p>\n\n<p>He was less than a week old when things started getting… strange. Static over the baby monitor that would have mom and dad getting up at all hours of the night – but my room was right next to his, I heard what happened in his room when the static took over the monitor. </p>\n\n<p>I’d hear someone singing to him. Sometimes it was a terrible, croaking voice, singing horrible lullabies. Other times… the singing was so beautiful that I was lulled to sleep by it – it was always a man who sang the beautiful lullabies, and a woman who sang the horrible ones. </p>\n\n<p>On that fateful week, the man had been in my brother’s room nearly every night. I should have told my parents what I was hearing, but part of me thought that maybe I was imagining the whole thing. Finally, on that night, I worked up the courage to creep out of bed and peer through the open doorway, into my brother’s nursery. </p>\n\n<p>The thing that stood over my brother’s cradle was nothing more than a shadow – and yet I knew there was more to his form… if I stared hard enough, long enough, I would begin to pick apart the shadows, I would see what no mortal eye was ever meant to see. </p>\n\n<p>I stood there in the doorway as he sang, reaching his hand down towards my brother’s tiny form. All at once, he drew his hand back, as if burnt. Around my brother’s neck was a simple cross necklace that my grandmother had sent him. The creature seemed to dissolve into the very shadows of the nursery itself – I felt like someone was now watching me, the darkness looming, stretching towards me with some terrible intent. </p>\n\n<p>I ran back to my bedroom, locked the door, and turned every light on – not one shadow remained in my room, except in my closet. I didn’t dare open the closet to let the light in. Not even when someone knocked from the other side of the door. </p>\n\n<p>I was restless the next day, debating telling my mom what had happened during the night, but I didn’t. I didn’t tell her about the shadow man or the fact that he and something else were visiting my brother in the dead of night. I stayed silent. </p>\n\n<p>I didn’t know. </p>\n\n<p>I swear I didn’t know that she’d given him a bath that night and forgot to replace the cross.</p>\n\n<p>I woke to the sound of laughter. A high pitched, delighted laughter coming from my brother’s room. But it wasn’t just one laugh, it was hundreds of them – I could feel the sound vibrating the shared wall between our rooms. I lay there in my bedroom, the lights turned on – I didn’t move, not even when my brother began to scream. I heard the sound of my parents footsteps… and then the crying, the screaming just stopped. </p>\n\n<p>The laughter faded as mom got to the nursery and opened the door. </p>\n\n<p>Her scream is still etched into my memory, even all these years later.</p>\n\n<p>The police had to come. They didn’t say much as they inspected the empty cradle and the open window. They spoke to mom and dad in a way that said they were familiar with this. They advised that whoever took him might return him. </p>\n\n<p>They never did.</p>\n\n<p>I dreamt of him often after the hounds.  </p>\n\n<p>I wonder if he&#39;s the reason why my life has been such hell. </p>\n\n<p>“You’re lucky to be alive.” Ian said as he changed my bandages. The hounds had done a number on both my legs before Ian had called them off. I’d been at his house for over a week now, but I knew my wounds were not healing the way they should – I also knew something was weighing heavily on Ian. </p>\n\n<p>“I don’t feel very lucky.” I placed my hand on my bandaged shoulder, the bite mark was festering and I could smell the rot beneath the bandage. “Ian…” whatever I planned to say was lost when the door to the room banged open and O’Malley limped his way in, out of breath and puffing, loudly. </p>\n\n<p>This was the first time I’d seen him since I’d been brought back to Gentry by Ian. </p>\n\n<p>“You bloody bastard!” O’Malley roared at Ian. “Do you know how much energy I’ve been putting into trying to find the girl?” he poked one short, stubby finger against the center of Ian’s chest. “Then I get to hearing rumors that she’s here in town, only she’s in a bad way because of you!” </p>\n\n<p>“O’Malley, I’m right here.” I said, hating how weak my voice was. </p>\n\n<p>O’Malley’s green eyes softened as he turned to look at me. “Ah, me poor girl. Look at you.” He stepped forward, nose wrinkling when he got close. I must’ve stunk if he was acting like that.</p>\n\n<p>“Do something.” O’Malley ordered Ian. “You caused this, now fix it.” </p>\n\n<p>Ian shook his head. “You know as well as I do that if I go against the Hunt, I become the hunted.” He folded his arms against his chest. “I’ve already strained my contract as much as possible.” </p>\n\n<p>“Can’t we sacrifice something?” O’Malley wondered. “A life for a life, yeah?”</p>\n\n<p>“Alice can, sure.” Ian glanced at me. “But she won’t.” </p>\n\n<p>O’Malley faced me again, cold fury in his eyes. “Get off your moral high ground, girl. You’ve no idea what is at risk here.” </p>\n\n<p>I laughed, a weak but bitter sound. “Don’t I?” I said. “I mean, I’m the one rotting.” </p>\n\n<p>“You’ve been marked, stupid child.” O’Malley poked the center of my chest, a sharp pain shooting out from where he touched. “You’re in no shape to flee from the Wild Hunt, Alice. Your only grace has been that Ian has given them other things to hunt, but soon they will turn their sights on you, and you will be gone.” </p>\n\n<p>“What would you have me do?” I demanded. “I already used my coin – they killed the hag. No freebies.” </p>\n\n<p>“It wouldn’t… be free.” Ian said quietly. “If…” he shook his head, obviously troubled by his own thoughts. “Alice, if you choose not to do anything, if you lay in this bed and wait for death… the Hunt will come. They will torment you for as long as they possibly can – the things too terrible to be allowed in any of the Fair Courts will torment you endlessly if they can – and then you die. Your soul will go off to wherever the souls of the dead go.” </p>\n\n<p>“And if I…. what?”</p>\n\n<p>“If you sacrifice someone else in your place, send the hunt to kill another… it only delays it, Alice. Seven years. You’ll gain seven years for every soul you send to the hunt, and those souls are damned. They will join the ranks of the hunt, swelling the numbers. If there comes a time when you do not give a soul for the Hunt, it is your soul they will take - you will be damned. You will join the Wild Hunt.” </p>\n</div>\n","author":"Rosewhisper"}