{"rank":"12","title":"Inch to the Left. PT.1","id":"8lnzo8","url":"/r/nosleep/comments/8lnzo8/inch_to_the_left_pt1/","time":"1527118234000","body":"<div class=\"md\"><p>I am not safe and don’t know when I will be but I have to warn you. That’s right, you. Looking at your screen you. I know I can’t be the first and I won’t be the last so please, I beg of you to pay attention. I came home to something that’s bigger than any stressors you may be dealing with at the moment and it may be in the works to some out there. This all started for me 2 weeks ago, when I came home after mindlessly bagging groceries for the minimum wage that pays enough to drive to a movie once a week.\nThere was something off. You ever have the feeling that someone has moved everything in your house an inch to the left? Well imagine that it was the people who had changed by an inch. Does that make sense?</p>\n\n<p>I was expecting little to no activity and a bellowing from my dad about the dinner that would already be in the fridge. As the only child I am used to being doted on even if its just a favorite meal or maybe a game I had been looking into but both my parents were running around from the second I opened the door.\n“Woah, what king is coming to visit?” There was a second too long of a pause and a faraway look that threw me off in my mother’s eyes. “You okay?” Just like that it was gone.</p>\n\n<p>“Honey, we are almost done. Think you can stay busy for another hour or so? We will call you downstairs soon,” my mother rushed both her words as well as me like she didn’t want me to know what was going on. Granted there was plenty going on in their lives that I was not privy to knowing, there was nothing they could keep from me once I became curious. </p>\n\n<p>“Well don’t wait for my agreement or anything,” I said to a closed door as I stumbled inside. Occasionally I would go to my room without orders or I would leave them be just out of courtesy, but with this weird atmosphere I needed a little bit of information to go on. With an ear to the door I listened and crossed out the possibilities. It isn’t their anniversary, no birthdays coming up, maybe something good happened at work or for a family friend? The next thing I heard brought ice into my veins. Chains. There wasn’t an explanation on this planet that fit this piece into the puzzle. The next thing I knew the door was almost hitting me in the face.</p>\n\n<p>My dad’s face was through the crack, “No snooping son! You don’t want to ruin tonight now do ya?”</p>\n\n<p>“HONEY! No more, come help. Now,” my mom hissed from down the stairs. With a wincing face my dad retreated, and that’s the first the normal thing I had witnessed since I walked through my front door. My father is normally a jolly guy trying to keep everyone happy but there was more behind his eyes. He seemed worried, I think. There was something more that was going on in my house than I could figure but that was going to change.</p>\n\n<p>I tinker with a few things on the tech side and I made a handy gadget to listen in on conversations. When every conversation has adult talk so you have to keep busy, you find a way to stay in the loop. What was essentially a moderately extended microphone crept under my door towards the stairs. Flying blind I slowly continued while hoping the mic stuck to the ground. If I could at least get the mic to the edge of the stairs, it should be powerful enough to give me an idea of what they were setting up. </p>\n\n<p>Static? No…carpet. Shaky hands make for bad spies and unfortunately I couldn’t quell the tremors caused by the sick feeling in my stomach. Through the low-grade headphones I could make out the sound of clinking. Not chains but maybe plates or cups. A nice dinner would be fine but that doesn’t explain the chains or being held prisoner. The weird thing was over the course of ten minutes or so they hadn’t said a word to each other. Like they knew I was listening. </p>\n\n<p>Now I was really worried. I no longer cared about invading privacy and used something I hadn’t in quite some time. A long time ago I had cut a small hole in the wall and the length of the mic puts me in the wall shared by the kitchen and living room. Putting the TV on to cover any extra noise, I moved the movie poster of The Amityville Haunting and prepared to hear the sounds of a goat being slaughtered. What I heard was not far off. I could hear my parents talking in unison but none of it made any sense. I pushed my gadget further trying to get a better idea of what was going on. Then shit went south. Real fast.</p>\n\n<p>The gadget hit the wall, shocked me into dropping it, ripped the ear buds out, and all I could do was put the poster on the wall and pretend I wasn’t losing my mind. </p>\n\n<p>It felt like hours of sitting, waiting for the door to open, and five minutes later there was still no one yelling at me or searching my room. I gathered the courage to try and retrieve my snooping device and noticed the headphone clip at the fork gave me an advantage I didn’t know I had. The dangling headphone was all I needed so I held my breath and listened close. At first I thought I heard the mic scraping against the wall but it was too sporadic and uneven. It was breathing. I could no longer hear my parents moving around doing anything downstairs. Did they take it out of the wall without me knowing? My answer soon came with a muffled whimper. The sound of quiet sobbing and of a whimper came through. \n“Those…a-a-aren’t…your parents honey,” the whispered voice of my mom said.</p>\n\n<p>Before I had a second to understand the door opened. I dropped what I was doing and casually leaned against the poster pretending to look at my phone.</p>\n\n<p>“It’s all ready for you now honey” it said to me in a voice I realized was just an inch different than my mom’s.</p>\n\n<p>You’ll have to wait for an update unfortunately. I have to move again. I don’t know when I will have a chance to give you the rest but as long as I’m breathing you bet your ass I’m going to give you everything that’s saved me so far.</p>\n</div>\n","author":"psneugans"}