{"rank":"5","title":"I’ve never shot a gun before","id":"8lo2ad","url":"/r/nosleep/comments/8lo2ad/ive_never_shot_a_gun_before/","time":"1527118920000","body":"<div class=\"md\"><p>The only guns I know of on my property is the broken B.B. gun our neighbor had given my cousin as a present, and the pistol my grandmother kept locked in her dresser. Of course, my grandmother never exactly told me where the pistol was hidden. I happened upon it’s location when I was 13, and made a mental note of it. Now 15, I’ve never had to use it before. We had a guard dog- Max, a giant German Shepherd- for up to 6 years and when he was moved to the barn, we upgraded to a fancy alarm system. </p>\n\n<p>It wasn’t unusual for me to be left alone for weekends on end. We had family far away and some days I didn’t have it in me to go so I got to stay home. Of course I had to follow the rules. The only one that was most important to follow was the fact I wasn’t allowed to step outside of the house if home alone. Wasn’t the type of kid to break the rules so I never got in trouble when alone by myself. The only time I had ever left the house alone was back in October. I was curled up in my grandmother’s bed, my now retired guard dog sitting at the foot of it. It couldn’t have been no later than 7, considering I let Max out to “do his business” at 6. </p>\n\n<p>That’s when the noise started. \nIt was a low groan of pain, almost as if a cat had just been forcefully kicked into my backyard. Max hadn’t seem to notice the guttural noise emerging from the porch, but then again he was well into his old dog years. I’m a pretty rational person when it came to weird happenings in our town. And even if something was wrong, all of my neighbors carried at least one weapon I knew of, so whatever tried to cause havoc would be shot down in 3.8 seconds. I simply stared out of our sliding door, relaxing back into the pillows. Of course the sound hadn’t stopped. I just did my best to tune out the quite disgusting noise. </p>\n\n<p>Then it started to yell.\nEar piercing cries of terror could be heard from my porch, paws sliding down the glass in attempt to escape whatever had attacked it. I jumped out of bed, dialing my grandmother in hopes she knew what it was.</p>\n\n<p>“It’s probably the neighbor’s cat. Damn thing scares the shit out of me too, but Max will chase it off.”\nAfter hanging up I let out a sigh, hesitating before opening up the door. Max rose to his feet and bolted out, disappearing into the black of night. </p>\n\n<p>I waited.</p>\n\n<p>And waited.</p>\n\n<p>No barking. No growling. Only the sound of the creature and my dog happily relieving himself. As soon as he came back in a slammed the door shut, my breathing ragged. The noise only grew louder throughout the night, driving me to near insanity. After what seemed like the 3rd hour of this predicament, I worked up the courage to turn on the porch light and go out myself. Not without taking the broken B.B. with me. I had hoped it would scare off whatever was writhing in my backyard. </p>\n\n<p>The mass of fat and pus stretched and clawed at the grass, it’s mouth wide as it called out for mercy. I couldn’t tell what it was but it couldn’t be bigger than a house cat. It’s eyes stared back at me. </p>\n\n<p>Then it spoke.</p>\n\n<p>I couldn’t began to even guess what language it was attempting to speak in, all I know is the damn thing /spoke/. It was begging. \nIt was begging for death. </p>\n\n<p>I raised the B.B., shaking as a pulled the trigger. Despite being broken, a pellet shot out and pierced the creature’s head. It exploded into a still fountain of blood and goo, twitching as it pissed and shit on itself. I decided not to tell my grandma. No use really, the thing was already dead. It left behind no carcass or bone for me to prove its existence. The only one that bear witness to it’s murder was Max, and hopefully he wasn’t speaking anytime soon. </p>\n</div>\n","author":"pastypasterie"}