{"rank":"11","title":"I Helped With The Filming of 1 Lunatic 1 Icepick","id":"8lo6fj","url":"/r/nosleep/comments/8lo6fj/i_helped_with_the_filming_of_1_lunatic_1_icepick/","time":"1527119988000","body":"<div class=\"md\"><p>Luka Magnotta was a weird human being. I should know, I was friends with him for all my life. In fact, me and him were each others’ first friends. And even then, his personality seemed...inconsistent.</p>\n\n<p>I had noticed Luka seemed to have 2 personalities. These being:</p>\n\n<ol>\n<li><p>Kind, sweet and friendly</p></li>\n<li><p>Angry, psychopathic, and just straight up insane</p></li>\n</ol>\n\n<p>The latter came up much more in High School. I’m guessing lots of you know that Luka was gay. Because of this, he got bullied a lot in HS. I continued to be his friend, and he seemed connected to me in a way. He talked to me a lot, and I caught him flirting with me on some occasions. </p>\n\n<p>One day Luka worked up the courage to ask me out, which I politely declined, since I’m personally into girls. Luka seemed to show the latter side to me after that for a couple months, before we reconciled and agreed to still be friends. </p>\n\n<p>Me and Luka also went to the same college, which surprised me, since it was pretty competitive and Luka never got good grades. There we met Lin. Many don’t know that Luka and Lin were friends before 1L1IP. Me, Lin and Luka hung out with each other a lot.</p>\n\n<p>Luka seemed interested in Lin romantically, which scared me. I didn’t want Luka to be rejected again. I didn’t know if Lin was straight or not, but I supported Luka anyways.</p>\n\n<p>However, it turns out Lin was indeed straight. Luka showed his 2nd side to him, but longer than it was for me. All through college, Luka hated Lin. </p>\n\n<p>When college was over, me and Luka went our separate ways. In that time between the video, Luka worked as a model, and secretly as a sex worker, which was news to me. What was also news to me was that he was stalking Lin.</p>\n\n<p>One day Luka called me up and asked if I wanted to help him film something (I’m a cameraman), which I agreed to. I took a plane to the city he lived in at the time, and as soon as I got there, his apartment freaked me out. </p>\n\n<p>It was old, and the walls were empty and had a vomit yellow color. He led me to a bedroom with one small, dirty mattress with a naked man, who I knew as Lin tied to it. At first I thought Lin was just the actor, since the thought of Luka kidnapping someone hadn’t even crossed my mind, but Lin looked so scared. Then I put two and two together when I saw Luka pull out a knife and a ice pick and kneel next to the mattress.</p>\n\n<p>I was too scared to run.  Luka gave me an old, bad quality camera, I put it on the stand and hit record.</p>\n\n<p>Cut, cut, cut. Oh fuck, what have I done.</p>\n\n<p>Slash, slash, slash. Luka’s insane!</p>\n\n<p>Stab, stab, stab. ...and Lin’s dead!</p>\n\n<p>Finally Luka stopped. Then he came over to me and grabbed the camera. I saw him drop his pants down and have sex with the corpse of Lin. At this point, I had the chance to run out the room...to safety. But I was just too curious and mortified to leave.</p>\n\n<p>After that Luka pulled out a fork and made a feast of Lin’s skin. Everything in my body told me to run, except for my brain.</p>\n\n<p>After done with his feast, Luka brought his dog in, and that skinny dog looked like it was about to have it’s first meal. After the dog was full, Luka grabbed the bottle, broke it on Lin’s skin, and started penetrating Lin with the bottle. After all this shit, there I was, standing there, dumbfounded.</p>\n\n<p>After watching necrophilia for about a minute, I watched Luka cut off Lin’s hand and watched him masturbate with the mutilated hand.</p>\n\n<p>After that Luka stopped the recording, put his pants back on fully, and thanked me. God, I was so scared.</p>\n\n<p>I haven’t talked to Luka since he’s in jail now. However I am not going to give any of my personal information, since I was involved in the recording. All I can say is, I’m an idiot. I should’ve bolted out of there and told the cops. It’d definitely lift some weight off my shoulders.</p>\n\n<p>Still, I technically helped with the murder of a man, which could put me in prison. Wish me luck in life. Stay safe</p>\n</div>\n","author":"maxbenlink"}