{"rank":"32","title":"Channel 5 Had a Rough Night","id":"8lo8ya","url":"/r/nosleep/comments/8lo8ya/channel_5_had_a_rough_night/","time":"1527120646000","body":"<div class=\"md\"><p>This all happened quite a few years back.  I’m only writing this because at this point, I have grown tired of bearing the story alone, and my therapist said I could only have closure if I just admit the truth. I’ve accepted what happened, but I’m going to share all the glaring issues that have kept me up at night. At this point, I write this to clear my conscience and walk away from that night forever.  </p>\n\n<p>Channel 5 has been around since the 70s.  It had the same studio head since it’s founding.  The station serviced a small area, mostly rural counties and communities. Our viewership was still decent, but by those days we made a lot of revenue by posting links to our social pages... The future of journalism.  </p>\n\n<p>Now, Channel 5 is not the actual channel, and the most of the names will be changed.  It’s probably the only way to tell this legally, or even safely. I’ll also be paraphrasing a lot of the staff, jobs and story in order to save space, so forgive any discrepancies in my explanation.  </p>\n\n<p>The original Channel 5 building was on a main street in one of the smaller towns of our area.  However, a month before the incident, they finished construction on the new location.  They had made enough bad calls on the weather to finally have to relocate the Doppler to the center of the counties.  </p>\n\n<p>The new building was immaculate.  Clean tile floor instead of old, red carpet.  The walls were now a nice beige instead of wood paneling, and the new, expansive Doppler sat atop the roof. Finally predicting the weather correctly.  </p>\n\n<p>There were a few downsides though.  It was located basically in a swamp.  We were *way* off the beaten path, a good distance from any towns or houses (yet still close enough for broadcasts).  We had to take a long road out of the nearest town, make a few turns and finish the last half-mile (closer to around a kilometer) on a dirt road.  They made plans to pave it eventually, but for now that was the only way in.  Marsh was the only landscape in every other direction.  </p>\n\n<p>Next, there was no cell reception. However, the studio did have wifi, so it wasn’t too much of an inconvenience.   We also only had a few employees, due to our small broadcast area. The good news was that we were fully independent, ie, not slaves to the Sinclair Group or other big media corps that wrote all the same scripts for countless networks across the country.  </p>\n\n<p>We had a decent and loyal viewership because of this.  We ran our ad campaigns because of it. “Get your news HONESTLY! We are independent and make YOU and REAL news our priority!”  or something like that.  </p>\n\n<p>We were on a certain local network, but they could have cared less as long as we were consistent and didn’t use profanity. I only saw an executive once, as I had to come in early to rewire some equipment.  A fat, jovial guy. I think it was his demeanor that let us get away with what we wanted.  </p>\n\n<p>The inside of the studio began with two glass doors leading to a lobby.  We had a security desk with a metal detector and sign-in for any guests.  You would be amazed how many threats news anchors get, especially if we miss an area affected by a disaster.    </p>\n\n<p>We once had a man attempt to bring a knife in and assault us because he blamed our coverage for him losing his home in a flood.   </p>\n\n<p>Past the security desk was a wide hallway with dressing rooms and offices.  I shared a room with the two other tech guys.  At the end of the hallway were two heavy, green doors marked “ON AIR. DO NOT OPEN.”  </p>\n\n<p>They stayed open during the evenings spent writing and setting up, and stayed closed from 8-10pm (our time slot).  </p>\n\n<p>Inside was the sound stage.  The center had a crescent moon desk, a screen and classy wooden frames. In front of the desk were cameras and crew.  To the left of the large auditorium was the “weather station.”  The station had a huge green screen and not much else.  We placed the frame directly onto the screen. To the right of the central desk, sat our sports center, a smaller business style desk and an athletic layout with a screen behind it.  </p>\n\n<p>Directly above the stage entrance was the large loft with metal stairs leading up.  It was enclosed and contained all the tech and monitors and screen graphics. There was a window looking down on the set below. This was where I worked with my buddy David and our supervisor Mark.  </p>\n\n<p>On this particular night, things were really not going well for us.  </p>\n\n<p>Half the crew and interns couldn’t make it in, the sports reporter and field cameraman was gone (for reasons soon to be apparent), and three of the worst scenarios possible were happening all at once.  </p>\n\n<p>Earlier in the day, a bomb threat was called in at a local High School. It was horrifying, but was revealed to be a false alarm.  Either way, we had to report it that night. People were in upheaval and wanted word on any updates. I think they had caught the caller who set it up.  </p>\n\n<p>Next, was a homicide in the nearest suburb. The victims were two teenage boys, in what was assumed to be a botched burglary. The parents found them with a bullet in each of their heads. It was probably the worst tragedy the town had ever seen. The suspect was apprehended soon after.  </p>\n\n<p>Now, say what you will about the news being “corrupt,” but again, we were self-owned.  It is not fun, or exciting, or career building to have to stare at the images of dead teenagers for hours on end.  The studio head, let’s call him Darrell, refused to air any pictures of the suspects, and it was decisions like that which is why we all respected him.  He wasn’t about the “juicy” stories. He was about informing the public; one of the last true journalists.  </p>\n\n<p>I digress. Basically, mood and morale was dismally poor.  One of our interns called in due to a family member in the school, they were unharmed, but it was understood. Our sports correspondent was home since the games were shut down across the entire area.  </p>\n\n<p>The other issue, and the reason half of our evening staff weren’t with us, was that storms were forming. These storms were presumed to contain tornadoes.  There was flooding in all of the lowlands where many of our employees lived. Our studio was just high enough to be safe from any flooding, but the same can’t be said for the rest of the area. Warnings were already up before we even went to air.  Only a third of our staff, 8 or so of us, were all that could make it.  It was just those who lived near the studio or had to arrive early.  </p>\n\n<p>So the combination of depression and mind-bending stress had us all in poor states of mind.  We were bickering and rushing about, the atmosphere beyond tense.  Thankfully, there were only three stories that needed to be covered, the bomb, the murders and the storms.  Most of the coverage would be weather alerts, so a skeleton crew could handle it.  </p>\n\n<p>Our lead co-anchor “Susan” walked right to her dressing room and didn’t emerge again until she *had* to go on air.  She was your average female news anchor.  She was in her early thirties with blonde hair, blue eyes and a sharp manner of dress.  Her makeup was great for the camera, but often thick in person.  </p>\n\n<p>The other co-anchor, ”Bill” visibly had a drink or two in his system before getting to the desk. Bill was another example of a model anchor: tanned, late thirties with sculpted black hair and a spotless black suit.  </p>\n\n<p>I was up in the loft with the rest of our team. My tech boss Mark was announcing our jobs in quick succession.  Mark was in his forties, slim, and always wore khakis and polo shirts. His balding hair and black glasses made him look like the embodiment of his job.  </p>\n\n<p>He was pointing and speaking commandingly. I was to watch the weather map like a hawk, and to post all updates to our social media accounts.  I used headphones to hear the radio transmissions from emergency transponders and any direct radio calls.  </p>\n\n<p>The anchors signed on and expressed a brief condolence and encouragement to help the victim’s families.  They then said they have to focus on a current threat.  Tornado warnings were already popping up everywhere.  The dank and thick swamp foliage outside was upsettingly calm.  The calm before a storm, kind of calm. The night was black as pitch already.<br/>\n It was then “Morgan,” our weather woman, took over the broadcast.  She was of Haitian heritage and had long lasting roots in this area.  She dressed in classy dresses, had a complexion so perfect she barely wore makeup on air, and had silky hair past her shoulders. I honestly would have asked her out if she wasn’t so brutally out my league.  </p>\n\n<p>She was warning residents in the affected areas to evacuate or find shelter.  She motioned to every red spot on the green screen behind her.  More and more spots seemed to pop up every moment.  I stared, unblinking, at my screen of the live map. All of us had sweaty palms. At the bottom of the stream was a ticker for every affected county.  </p>\n\n<p>We were on for a solid thirty minutes, afraid to cut away from the weather. I couldn’t hear anything but intermittent code and occasional updates from the different alert centers.  </p>\n\n<p>Then I heard something weird.  </p>\n\n<p>It sounded like commotion and confusion.  I looked up, removing the headphones, to see my boss leering down into the studio.    </p>\n\n<p>“What’s wrong?” I chimed.  </p>\n\n<p>Before I even finished asking, Mark sprinted away from the room and dashed down the stairs.  I ran to the window to see the scene unfolding.  </p>\n\n<p>Mark, the Security Guard, and Darrell were all dog piling on a random person.  </p>\n\n<p>I looked at a buddy David, who read my mind and turned his screen to me.  It was a rewind of what had just occurred.  </p>\n\n<p>The feed, thank god, was cut to commercial.  However, the cameras picked up the clattering and slamming of feet until a young man came into frame, the anchors frozen in shock. The man, was a young black man in a blazer, white button-down and slacks.  He was sharply dressed, but appeared dusty and dirty.  In the same motion of leaping to the stage, he slammed both hands on the desk and screamed into the anchor’s faces,  </p>\n\n<p>“YOU CAN’T STOP IT! THEY ARE COMING! *HE* IS COMING! YOU WIL-“  </p>\n\n<p>He was tackled by the guard.  </p>\n\n<p>The two hosts reeled back, and began coughing for a moment, but recovered quickly. The man had been brought down hard in the meantime.  </p>\n\n<p>They pinned him, and the security guard zip-tied his hands and feet together.  They roughly yanked him up and dragged him to the security area to wait for the police.  </p>\n\n<p>Darrell insisted the anchors cease, but they insisted it was ok.  They were rattled, but still professionals. They said he probably was some sicko who wanted to scare the viewers. It was probable. That’s what we had to tell ourselves.  </p>\n\n<p>Darrell, following the men, shouted to us, “we’re back in one minute! Get it together!”  </p>\n\n<p>Morgan was completely stunned, standing mouth agape.  </p>\n\n<p>“Morgan!” Darrell snapped her to attention, “Are you good?”  </p>\n\n<p>She stammered, “I..”  </p>\n\n<p>“Are. You. Good?” He stared calmly, but sternly.  He really wanted to know.  </p>\n\n<p>She inhaled hard with closed eyes, “Yes.”  </p>\n\n<p>Mark burst back into our booth and checked in on us quickly.  </p>\n\n<p>“Cut to map! Make sure the ticker is updated! Get those headphones on!”  </p>\n\n<p>I obliged, but at this point I had to keep one ear free so as not to miss anything coming from downstairs.   </p>\n\n<p>We kept going.  Morgan managed to stay composed and signed in.  She updated on the storm, but after a brief lull in the updates, she gave the focus back to the anchors.  </p>\n\n<p>“Hello everyone,” Susan began solemnly, “we know in this time of panic and fear that it is easy to overlook the tragedies and horrors that occurred earlier today.”  </p>\n\n<p>“Terror struck today,” Bill calmly said on his time, “while many students were planning a normal day of s-s-school, they were instead met with fear and targedlies.”  </p>\n\n<p>We thought nothing of the stutter or mispronunciation.  </p>\n\n<p>“That’s right Bill!” Said Susan, *way* too cheery, “the birds had sung and the sun is now bright upon our southern landscape!”  </p>\n\n<p>That made us look up.  </p>\n\n<p>Now, what happened next is going to be hard to describe, but I’ll try.  </p>\n\n<p>It was the sound of madness.  Not screaming, not shrieking, but madness.  Their tones did not change from the tones they would have when describing a lifestyle piece. Cheery and well enunciated. If you take a moment now to look up the song “Pena” by Captain Beefheart, it sounded like the beginning of the track.  </p>\n\n<p>One would say a totally random statement, the other would agree or add to it with a completely unrelated statement.  Again, this entire exchange was done with upbeat and campy back and forth.  It began with nonsense statements and mispronounced or nonsense words.  Then things got darker  </p>\n\n<p>S: “Badgers in the brook today Bill!”  </p>\n\n<p>B: “Right, and the rain grows red.”  </p>\n\n<p>S: “they’re eyes close in void.”</p>\n\n<p>B: “In. The. Void.”</p>\n\n<p>S: “(laughing sigh) Your children are scum and probably not yours Bill.”  </p>\n\n<p>B: “I’ll rip your throat out woman,” (pause for smile)  </p>\n\n<p>S: “(chuckling) not if I get my thumbs into your eyes first Bill.”  </p>\n\n<p>She held up her thumbs and looked at bill making the fake threatening “ahhh!” sound and shaking her hands.  She turned back to the camera and news laughed again.  </p>\n\n<p>B: “the blood of the innocent Susan! The. Blood. Of. The innocent.”  </p>\n\n<p>S: “They’re coming for us Bill.  They will overtake us all.”  </p>\n\n<p>B: “And to you viewers at home, you’ll not outrun them!  You’ll rot where you stand!”  </p>\n\n<p>The both did that fake chuckle that newscasters do and ended with a mutual inhaled, “ahh.”  </p>\n\n<p>I left out several of the lines, but they did get worse. After their hellish back and forth, they tapped their papers and sat, staring into the camera with smiles as if waiting for a fade to commercial.  They did not move.  They did not blink.  </p>\n\n<p>“Oh my god,” I said to the room.  </p>\n\n<p>“I cut the feed as soon as I heard Targedly,” Mark said, arms folded and not looking away from the window, “I cued the emergency broadcast alert for the tornadoes and now it’s the map.”  </p>\n\n<p>Mark was smart like that.  It’s why he was our supervisor.  </p>\n\n<p>Morgan was standing in front of her green screen.  One hand over her mouth.  </p>\n\n<p>Mark continued to us, “We’ll keep it to the map and recorded alerts until we figure this mess out.”  </p>\n\n<p>I checked my phone so I could check on my roommate and dog.  There was no wifi.  The storm must have knocked it out.  The studio was soundproof but our booth attached to the roof was deafening with the pouring rain.  </p>\n\n<p>“Hey Mark,” I said, still looking at my phone, “the Internet is out, I’m going to the office to check on my house.  We can take turns if that’s ok.”  </p>\n\n<p>“Sure,” he said, not seeming to care.  He was fixated on the scene before him.  Everyone was.  No one was moving or saying a word.  Just staring horrified at our two hosts.  </p>\n\n<p>I quietly opened the door to the both and made my way down the stairs.  We only had one camera operator. Earlier he was dashing between cameras, but now he was standing between Morgan and the news desk a good distance away.  The studio manager was standing by the lighting board, not sure what to do.  The both had fear in their eyes.  </p>\n\n<p>I quietly opened the studio doors and made my way down the hall.  I was able to see the lobby at the end.  The intruder was tied to a waiting room chair.  The security guard sat across from him in a locked stare.  </p>\n\n<p>Darrell was pacing.  </p>\n\n<p>He kept asking, “what did you do? What did you do?!” The man remained silent. Eyes fixated ahead, staring blankly.  </p>\n\n<p>I entered our office and grabbed the hard-wired phone.  It was completely dead.  I tried in vain on the other lines, but they were all down as well. We were completely cut off.  </p>\n\n<p>It was then I knew why Darrell was pacing.  The cops weren’t coming.  </p>\n\n<p>I decided to tell him that we were cut off, but as I approached he stopped me.  </p>\n\n<p>“We can’t reach anyone.  Go check the server closet and see if you can do anything.”  </p>\n\n<p>The server closet was at the back of the studio.  Our routers and lines for the office were in there. It was right off screen of the anchor desk.  </p>\n\n<p>“Sir,” I stammered, “I don’t want to get that close.”  </p>\n\n<p>“It’s out of the shot.”  </p>\n\n<p>“No,” I replied, “I don’t want to get close to *them*”  </p>\n\n<p>“What are you talking about?” He shot back, confused.  </p>\n\n<p>We stared at each other in silence for a moment.  </p>\n\n<p>“Did you not see it?” I said lowering my gaze.  </p>\n\n<p>“See what?”   </p>\n\n<p>I then noticed all the screens in the lobby were not on.  They usually streamed the broadcast, but I guess he switched them off so the man couldn’t see them anymore.  </p>\n\n<p>The realization made me belt out, “You need to come with me now.”  </p>\n\n<p>He was horrified at the sight.  The anchor’s eyes were growing more bloodshot as they still hadn’t moved.  Hadn’t blinked.  </p>\n\n<p>The other three were in the booth.  </p>\n\n<p>We walked in and Mark showed Darrell the footage.  </p>\n\n<p>We expected leadership.  We expected him to comfort us.  </p>\n\n<p>Instead, our collective leader slammed the door open and rushed back to the hall.  Mark followed close behind.  </p>\n\n<p>“This is a nightmare,” the Cameraman said.  </p>\n\n<p>“What all could you see on the guy?” The studio manager, “Sarah”, asked. She was a short ginger lady who was pretty quiet unless she was giving assignments to the crew. I could see the abject fear in her eyes.  </p>\n\n<p>“Not see. Smelled,” He winced as if still able to sense it, “He had a moldy tinge when he rushed by me.  It was unique, like he made the smell himself. It wasn’t BO or mud. I don’t know, but it was pungent.”  </p>\n\n<p>Morgan cursed under her breath.  She walked out and at this point we followed, not wanting to be separated. Outside the door we heard commotion.  </p>\n\n<p>“WHAT DID YOU DO?!” Darrell was screaming in the man’s face, “WHAT. DID. YOU. DO?!”  </p>\n\n<p>The man remained motionless.  </p>\n\n<p>It was then as we drew closer we witnessed something horrifying.  </p>\n\n<p>Darrell reached into his belt and pulled out a pistol.  The security guard leapt up to stop him but Darrell shoved him hard to the ground.  </p>\n\n<p>He pushed the pistol on the man’s forehead with enough force to leave an imprint and calmly, but coldly said again, “what did you do?”  </p>\n\n<p>“STOP!” Morgan cried out.  </p>\n\n<p>He turned to us, snapping back to reality.  He slowly studied our horrified faces.  His face, which bore the hatred and rage of a maniac, fell quickly to that of shame.  He looked at the gun, then the man, and promptly stormed away to his office.  </p>\n\n<p>We helped the guard up.   </p>\n\n<p>Mark then came from outside.  He was soaking wet and a look of inescapable horror was painted on his pale face. </p>\n\n<p>He looked at us and quietly stated, “Our tires are slashed.”  </p>\n\n<p>We unraveled in panic as a group.  </p>\n\n<p>“What do we do now?”<br/>\n “We’re trapped?!”<br/>\n “Oh god. Oh god. Oh god.”  </p>\n\n<p>Morgan was the voice of reason who calmed us.  </p>\n\n<p>“I’ll talk to him,” she said flatly, “give us the room.”  </p>\n\n<p>We turned to attempt to find Darrell.  </p>\n\n<p>The last thing I heard as we made our way to the offices was a unfamiliar greeting from Morgan.  </p>\n\n<p>“Ey ou menm,” she said calmly to the man.  I couldn’t hear the rest.  </p>\n\n<p>Darrell was in his office.  Bottle in hand. His eyes were bloodshot.  </p>\n\n<p>“You think now’s the best time for that?” Mark asked, disappointment clear on his face.  </p>\n\n<p>“Just make sure the damn broadcast is up,” he shot back, staring at the gun on his desk.  </p>\n\n<p>“The map is up, we’re intermittently running a generic warning and the ticker is updated-“  </p>\n\n<p>“Then go make sure it stays that way,” he said in a low raspy voice.  </p>\n\n<p>We exited the office to see Morgan pacing the hall.  Mark didn’t stop and grabbed the cameraman to return back to the studio.  </p>\n\n<p>“What is it?” David asked, “did he talk?”  </p>\n\n<p>“Yeah,” she said, wishing she didn’t have to explain.  </p>\n\n<p>“He said this is ‘move peyi’,” she said, “‘bad country.”  </p>\n\n<p>“What does that mean?” David pried further.  </p>\n\n<p>“This land is cursed... at least according to him.  He apparently knows about local voodoo legends.  He said we’re all going to die because “They” wish it.  We’re a sacrifice.  We won’t last the night.”  </p>\n\n<p>It looked like tears would stream down her face at any moment.  </p>\n\n<p>“I don’t believe in it,” she continued, choking back fear, “but my mother did, and my grandmother. She was a Godly woman who warned us of the swamps, but I didn’t think about it until him. Until tonight. Now I don’t know what to think.”  </p>\n\n<p>Her hands were shaking and the stage manager told her to go to her dressing room.  She said she would stay with her if she wanted.  She said she’d rather be alone. The guard was back to his post, sitting across from the intruder.   </p>\n\n<p>So now it was David, the stage manager and myself in the hall.  We walked back to the booth to update Mark.   </p>\n\n<p>David told him everything, but Mark only quipped under his breath, </p>\n\n<p>“Hoodoo your Voodoo bitch.”  </p>\n\n<p>He chuckled. No one else did.  </p>\n\n<p>“Mark,” I said concerned, “we have to do something.  We have to get a message out.”  </p>\n\n<p>“To who?” He turned with a cold expression.  Clearly he had already thought it out, “the people hunkered in basements?  The thousands who already tuned out and into the emergency radio stations?  What good would come of it? No one is coming.  No. One.”  </p>\n\n<p>“We should get Darrell and Morgan,” David chimed in.  </p>\n\n<p>This was when I think I let my emotions bubble.</p>\n\n<p>“What is going on?!” I barked as if my colleagues had the answers, “Why are we not helping them?” I stuck an angry finger at the anchors, “Why are we paralyzed to help? What happened to them?! What is happening to us?!”</p>\n\n<p>David gripped my shoulder. “Calm down,” his voice trying to reassure me, “We’ll deal with them in time, but for now we don’t need to go near them, at least until we know what’s actually going on. Right now, we need to get Darrell and Morgan and figure out a next step.”</p>\n\n<p>So the five of us returned to the hall. Neither Morgan nor Darrell wanted to leave their offices. It was then we devised a regretful plan.</p>\n\n<p>“We need to leave,” The security officer said.</p>\n\n<p>“How?” I asked in an irritated response, “Our tires are slashed and there’s floods everywhere.”</p>\n\n<p>“It’s a half-mile to pavement, from there we can hopefully flag someone down, or at the very least walk to cell reception. If we keep the water beneath our knees we should be ok,” He stared at the small group and finally asked, “Who’s coming? We need folks here to watch the guy, so some need to stay.”</p>\n\n<p>David, Sarah, and myself decided to stay in the studio, while Mark, the camera operator, and the guard were going to rough it. These guys all were more fit than the rest of us, so it only made sense.</p>\n\n<p>The donned ponchos and flashlights and left the building. We stared in miserable silence at the tied up assailant. None of us wanted to be within 10 feet of the man. We turned, keeping a wary eye on him. </p>\n\n<p>It was then we heard the chaos coming from the soundstage. It was muffled, but the bitter silence of the building made it audible. We rushed down the hall to see what had happened. I paused to slam on Darrell’s locked office door, exclaiming for him to come out. </p>\n\n<p>He didn’t respond, so I gave up and chased the other two.</p>\n\n<p>I had no sooner opened the doors than I saw the sight that had frozen my peers.</p>\n\n<p>Susan was atop Bill. Both thumbs completely submerged in his eyes. He was shrieking like no human should ever shriek. It was the most unholy sound I think I’ve ever heard. However, Susan was screaming too, or at least she was trying. Blood and spittle came with her muffled cries as Bill was mercilessly gripping her throat. From the looks of it, he had burst several vessels. </p>\n\n<p>With one last sickening “crunch” Susan collapsed, thumbs still encased by Bill’s shattered corneas. Bill was seizing and screaming from the pain, but it was cut short. With one last burst of consciousness, which I cannot explain, Susan pulled one hand free, grabbed a quarter inch cord and slammed it into Bill’s burst socket with force that there’s no way her small frame could muster. </p>\n\n<p>Apparently, a quarter inch can pierce the frontal lobe given an unreal amount of force.</p>\n\n<p>Bill seized violently for a few seconds, and then they lay beside each other in bloody silence.</p>\n\n<p>Sarah began vomiting. </p>\n\n<p>David ran out. </p>\n\n<p>I just stood in horror.</p>\n\n<p>I was about to walk Sarah out of the room, when we heard David scream at the top of his lungs, “DON’T.”</p>\n\n<p>We then heard a “BANG” which resonated throughout the entire building.</p>\n\n<p>We opened the doors to and ran to see what had just happened.</p>\n\n<p>The intruder was on the floor now. He had a thick pool of black-rimmed blood ever expanding around his head. All from a single shot that bore right through his skull, apparently lodging itself in his brain stem.</p>\n\n<p>Darrell, wordlessly pushed past David, who had just experienced two extreme traumas in the course of a few minutes. He entered his office, locked the door, and we never saw him again, or at least David and I didn’t. We grabbed whatever heavy objects we could to barricade him in until the authorities arrived.</p>\n\n<p>We tried one last time to reach Morgan. We told her to give us an indication that she was ok. She didn’t respond.</p>\n\n<p>Sarah beckoned, “Morgan, come out or I’m opening the door.”</p>\n\n<p>No response.</p>\n\n<p>Sarah, who had a keyset for the entire building, opened the door.</p>\n\n<p>Morgan was in there, but she was not “there.”</p>\n\n<p>She sat in her dressing room, lit only by the lights of the vanity mirror. We could see her face reflected in her mirror. She sat, head tilted downward but eyes looking up in a fixed, unblinking stare at her reflection. Her mouth hung agape, not in surprise, but closer to a snarl.</p>\n\n<p>“Sarah,” I muttered, “shut the door. Now.”</p>\n\n<p>We stepped back as Sarah shut the door. </p>\n\n<p>She looked to the entrance and grabbed an old tarp from a utilities closet. She briskly walked over to the corpse of the intruder and draped it over him. When she returned to our side we gave her blank nods. We didn’t need to keep seeing it.</p>\n\n<p>We followed David, who walked wordlessly into our office.</p>\n\n<p>We sat.</p>\n\n<p>We waited.</p>\n\n<p>We did not speak; we just listened to the storm outside. All the while, hoping for rescue from this hellish reality. It seemed like time was ticking away at our hopes.  </p>\n\n<p>The only thing that I realized was in the entire time that we were being horrified, our station was broadcasting a regional storm map with smooth jazz playing. I was somewhat glad that the viewers were spared some of this nightmare. I can’t imagine being one of those stories of a gruesome scene being shown on live TV.</p>\n\n<p>My train of thought was interrupted by a loud bashing noise.</p>\n\n<p>We peered out of the office to see Mark, standing in the entrance, soaked from head to toe. No flashlight was in hand, and no one else was with him.</p>\n\n<p>As we approached, he choked out through exhausted breaths, “There’s, something, out there.”</p>\n\n<p>We stared back, waiting for his explanation. Shock was plain.</p>\n\n<p>He turned to the blue tarp and jumped back. Before he could ask, we told him what had happened. He looked frazzled. In here with us was clearly as bad as outside. He was concerned about Darrell harming us, and we frankly didn’t have an answer. We hope he was trapped and no longer a threat.</p>\n\n<p>We went with him to our office. He sat, shaking all over. Sarah gave him a blanket and some coffee.</p>\n\n<p>“We were about halfway down the trail,” He began staring beyond us into nothing, “[The Guard] and I were in front. The water was well past our knees in a few places. I kept thinking I’d be either swept away or found by a gator. We still had our lights, but it made almost no difference in the rain. We began drifting farther and farther apart. I was in the middle, barely able to see my light in front of me. The other two were completely out of my line of sight.”</p>\n\n<p>We were on his every word. Our breath baited.</p>\n\n<p>“I slowed my pace so I wouldn’t be alone if I went down, but I realized I wasn’t being followed anymore. I yelled out, but with the rain there was no hope of being heard. At least, that’s what I thought until I heard a scream like all hell had erupted. I began wading towards the scream, calling out. “</p>\n\n<p>He breathed deep. Wanting us to believe him, but fearing that we wouldn’t.</p>\n\n<p>“I saw his silhouette in the bog. He was waist deep, screaming at something. Lightning lit it all up for just a moment, then again. Those two split seconds were clear as day. I saw it standing over him. It was impossibly tall. It was black all over. It’s head looked like a horse’s skull, covered in tumors. It was gnarled and ugly. It was reaching out a massive arm; at the end were long fingers, and more fingers, and fingers on top. It was about to take him.”</p>\n\n<p>“Are you sure?” Sarah asked sheepishly.</p>\n\n<p>Mark shot back a look like she had slapped him. She looked at the floor embarrassed.</p>\n\n<p>“I ran like a coward,” He continued, “I turned, dropped my light and ran. I was slow, wading in the muck. I don’t know how I made it back, but I did. The rain was heavy, but it lightened up just enough for me to see the building’s lights. I don’t know what happened to the other guy.”</p>\n\n<p>Suddenly, the doors burst open. We hustled back to the hall</p>\n\n<p>The Guard was standing there in the entrance.  Soaked to the bone.  His poncho ripped and he too was without his light.  His face was beat red, and he was breathing so hard I thought he would faint.</p>\n\n<p>His eyes looked up coldly at Mark.</p>\n\n<p>“You.”  He said through gritted teeth.</p>\n\n<p>He rushed Mark, lifting him by the neck with both hands.  </p>\n\n<p>“You left me.”  He said, his face contorting in hate beyond that of any man.</p>\n\n<p>Before we could move to stop him, Mark slipped his shaking hand into his pocket and drew a straight razor.  He pushed the blade forth and in a fluid motion, slammed the blade into the side of the guard.</p>\n\n<p>He reeled in pain screaming, as Mark fell to his knees choking for air.</p>\n\n<p>We were frozen yet again.</p>\n\n<p>Mark grabbed the blade on the floor and stood to his feet, ready to kill.</p>\n\n<p>The guard pulled forth his stun gun and zapped it once to intimidate. They squared off, no intent on de-escalation. </p>\n\n<p>Before David could yell, “stop!”  They charged at each other. The taser connected with Mark’s neck.  He screamed, but did not fall.  He rammed the razor into the gut of the guard. I’m not sure how much his beer belly protected his organs, but I knew both were in severe pain.  It reminded me of the Biblical story where Ehud stabbed the fat king so hard the blade disappeared in his stomach.</p>\n\n<p>They held each other in this violent embrace, grinding their weapons deeper.</p>\n\n<p>“Run,” David said, seeing the Guard looking past Mark at us.  Rage and violence still burned in his reddening eyes. The same red that Morgan, Darrell, the anchors and the intruder all had in theirs.</p>\n\n<p>We turned and bolted down the hall, yet again.</p>\n\n<p>As I turned to the office, David cut me off.</p>\n\n<p>“They have the keys! Get to the loft!”</p>\n\n<p>We were a few feet from the studio doors when we heard two doors open, almost in unison.  We paused for a moment, until we heard a smashing against our barricade. Then a gunshot rang out.  Then another.  Then another.  A nightmarish, inhuman shriek filled the air, from whom I could only assume was Morgan.  We kept running, not looking back.</p>\n\n<p>We burst through the doors and made an immediate left turn to the stairs.  Sarah ran past us, ignoring our calls.  She ran past the bloodied corpses of the anchors and hid in the closet behind their station.</p>\n\n<p>We closed the door behind us and jammed a metal rod into the push handle.  Even if they had keys, they couldn’t get in.  David immediately began typing on one of the computers. I hid beneath the viewing window as to not draw possible gunfire. </p>\n\n<p>“what are you doing?” I whispered.</p>\n\n<p>“Hopefully saving us,” He responded, not looking up.</p>\n\n<p>I then heard an emergency alert siren blaring over the map, replacing the smooth jazz.  The screen now had text over the map.</p>\n\n<p>EMERGENCY ALERT</p>\n\n<p>FLOODING AND TORNADOES IN AREA</p>\n\n<p>CHANNEL 5 NEWS BUILDING IS FLOODED</p>\n\n<p>SEND HELP</p>\n\n<p>SEND HELP</p>\n\n<p>SEND HELP</p>\n\n<p>We sat, holding our hearts and calming the hyperventilation in our lungs.</p>\n\n<p>After a moment of eerie silence, I peeked out the window.</p>\n\n<p>Smoke.</p>\n\n<p>“David,” I said in horror at the growing black clouds.</p>\n\n<p>He looked and was silent. </p>\n\n<p>We could see light emerging from the corridor, the unmistakable dance of flame.</p>\n\n<p>David, acting much faster than myself, grabbed as many cables as he could carry.  He gave them to me and said, “open the latch!”</p>\n\n<p>Of course.  I thought stupidly.  The roof access latch in the loft was directly above us.  The short metal ladder on the wall led to it.</p>\n\n<p>I climbed up and slammed the metal door open.  The rain immediately beat me mercilessly.  I was climbing out, David close behind.  When I emerged on the roof I realized the intention of the cables.</p>\n\n<p>I began tying them together and used the frame of the Doppler as my anchor.  I looked around in the impossibly dark storm for David.</p>\n\n<p>I called out to no response.  I ran to the latch, fearing he had been injured.</p>\n\n<p>“David!” I screamed as he emerged, holding something in his hand.</p>\n\n<p>“Come on!” He yelled, relieved to see that I had the good sense to tie the cables together.  </p>\n\n<p>We tried to let ourselves down easy from the four-story height, but I fell a good distance into the mud below.  Thankfully I was uninjured.</p>\n\n<p>We ran around the side of the building to our cars.  We hid separately, in the floors of our backseats.  </p>\n\n<p>I lay there all night, praying that no one would emerge from that hellish inferno.  Praying that Sarah was not hurt.  Praying that a tornado would not toss us to our death.</p>\n\n<p>Morning finally came.</p>\n\n<p>I had passed out at some point during the night. The drop in adrenaline combined with the exhaustion had taken its toll.</p>\n\n<p>I awoke to a rapping on my glass. In my groggy state it took me a moment to realize it was police officer. He was looking down at me, relief and concern on his face. Tears welled up in my eyes in that moment.</p>\n\n<p>The next part was a blur. The used a special SUV to traverse the mud and flood and took me to a hospital. After I was examined and placed in a room, an officer came in to speak with me.</p>\n\n<p>“I’m very sorry,” He said genuinely, “I know the past day has been a living hell for you. I know you have a lot of questions and I’m here to answer them. First and most importantly, your friends David and Sarah are safe.”</p>\n\n<p>I heaved a heavy sigh of relief. I was so happy for that brief second.</p>\n\n<p>“But...” he trailed, “no one else survived.”</p>\n\n<p>“What happened?” I asked, still stunned. Not everyone could have died in the fire, and I know foul play had accounted in several instances.</p>\n\n<p>“Well,” he collected himself, obviously unsure where to begin, “we spoke with David, and based off what he told us, and the grizzly state of several victims, we discovered the root of the problem. Especially after the arson investigator confirmed it.</p>\n\n<p>There was a pretty severe gas leak in the building, we think methane from the swamp leaked into the drainage system and burst a line. The violent and manic behavior of everyone was most likely caused by this. The intruder was a local Hoodoo priest yes, but he didn’t have any affect on the night; it was just unfortunate timing. He probably had planned to do something after slashing your tires, but didn’t finish it.</p>\n\n<p>We think the fire broke out when your boss fired off his gun. From there the story seems to resolve itself.”</p>\n\n<p>“What about the guy in the swamp?” I asked, “Mark said they saw something attack him.”</p>\n\n<p>“Yeah,” the cop trailed off, “We found him. That guy drowned, sadly. He must have gotten separated and stuck in the bog. The only thing above him was a damn tree. Your buddy Mark was already too far gone to realize it.”</p>\n\n<p>I hung my head. This was “bad country”. The swamp *was* evil. We should never had built our station there.</p>\n\n<p>All the revolving door questions were answered. </p>\n\n<p>All but one.</p>\n\n<p>“How did you find us? Did our message get out?”</p>\n\n<p>“Son,” he said cooly, “ya’ll stopped being on the air ten minutes into the broadcast. It’s the whole reason we knew to come.”</p>\n\n<p>Then I sat. I sat in silence until he left. </p>\n\n<p>Then I laughed. </p>\n\n<p>I laughed at the tragedy. I laughed at the horror and death we all experienced. I laughed, because if none of us had come to work. All my friends would still be alive.</p>\n</div>\n","author":"SamMarduk"}