{"rank":"48","title":"Case #7- The Village of Lost Souls- Part 5","id":"8loaqi","url":"/r/nosleep/comments/8loaqi/case_7_the_village_of_lost_souls_part_5/","time":"1527121064000","body":"<div class=\"md\"><p><a href=\"https://www.reddit.com/r/nosleep/comments/8l721u/case_7_the_village_of_lost_souls_part_4/\">Part 4 can be read here.</a></p>\n\n<p>“I don’t understand,” Mark said. The events of the past few days were weighing on him, as evidenced by the dark circles under his eyes and the general weariness of his features. “That ghost I’ve been seeing isn’t my dad?”</p>\n\n<p>“I don’t think so. I think it just looks like him.” I wasn’t sure what the best way to convey the news was. It seemed callous to keep an impartial tone but there were dangers in making things too personal. I didn’t have enough experience to understand where the line was between the two.</p>\n\n<p>“So what the hell is it?” Mark demanded. Cracks were starting to show in his composure for the first time since I met him. “On top of everything else, why do I need this shit?”</p>\n\n<p>“I can’t say for sure but I have a theory. Whatever’s going on looks like it’s connected to Kingston Mortuary. You told me about Wren Kingston and how her father thought she was possessed by demons. Well, what if she was? What if they’re still there and Dr. Larson is controlling them somehow? Maybe that ritual I saw in my vision was some kind of binding spell.”</p>\n\n<p>Mark laughed and I was frightened by the hysterical edge to his voice. “If that’s the case I’d say we’re pretty well fucked, aren’t we?”</p>\n\n<p>Moxxy, who’d been listening silently the entire time, chimed in. “We’ve beaten worse things. Mark, can I talk to Emily alone for a moment?”</p>\n\n<p>“Sure. Whatever. I need to go check on Mom.”</p>\n\n<p>He stalked out. Tears were welling up in the corners of my eyes. I sighed and blinked them away. “We’re losing him, Moxxy. We need a win here. Jane doesn’t have much time left.”</p>\n\n<p>“I still think our best chance is to kill Larson now and figure the rest out later. Between you and me, I don’t think our salt and sage is doing shit.”</p>\n\n<p>“You might be right.”</p>\n\n<p>“So let’s do it tonight. We’ll watch Larson today, figure out where he lives. When he’s home for the night, we’ll break in and do it while he sleeps.”</p>\n\n<p>“What if that doesn’t stop the curse though? If he dies, we might lose our best chance at figuring out how to undo it.”</p>\n\n<p>Moxxy considered this. “Well, we could torture the information out of him first.”</p>\n\n<p>“Do I even know you?” My phone chimed and I pulled it out. “Hey! Donnie just emailed me!”</p>\n\n<p>It was my first real ray of hope since we started the case. I retrieved my laptop from the bedroom and Moxxy and I sat down to read what Donnie wrote.</p>\n\n<p><em>Sorry it took me so long to get back to you. I was dealing with some personal shit. Anyway, I looked into what you asked. Most of it was boring but there’s something that stood out about that dead kid you mentioned, Tony Gillespie. A few weeks before he died, his parents filed a police report against a local doctor, claiming he’d molested Tony. They never followed up on it because the kid got sick right after and the investigation was dropped. I looked into the doctor. His name’s Garth Larson. I’ll attach a more detailed file about his history to this email but the big stuff is basically this: he worked as a pediatrician in four different small towns before moving to Dodgerton Village. He never stayed longer than a year or two. That’s all I’ve got so far, but let me know if you need anything else. It’s good to hear from you again. Give Jacob a smack on the ass for me.</em></p>\n\n<p>Moxxy whistled. “Jesus. I guess we’ve got his motive for killing the kid.”</p>\n\n<p>I opened up the file Donnie attached and started reading. It didn’t take long before I got to something revealing. “Garth Larson was raised by his mother, Patricia Larson. His father’s name was Bud Kingston, and he walked out when Garth was eight. I’d bet my fucking left hand that Larson’s related to the same Kingstons who built Kingston Mortuary and that priest who burned everyone in the mass grave.”</p>\n\n<p>“Are you thinking what I’m thinking?”</p>\n\n<p>I grinned at Moxxy. “I think it’s time for a little breaking and entering.”</p>\n\n<p>As it turned out, it was mostly entering with very little breaking involved. After Moxxy called Dr. Larson’s clinic to confirm he’d be there all day, we went to Kingston Mortuary and snuck in through the side entrance. It looked worse inside than it did out. Ashes and burnt wood chips crunched under our feet. Our search didn’t take long, since the walls had burned away to the point where we could see through them. There was an altar set up in one of the larger rooms, which I suspected was where they prepared the bodies. It was the same one from my vision, with the carved bones and the golden bowl filled with blood.</p>\n\n<p>“That’s pretty fucking metal.” Moxxy took her phone out and started snapping pictures of the altar from multiple angles. When she was finished, she picked up the bowl and threw it across the room. Blood spilled everywhere. She picked up a burnt wooden beam and smashed the bones on the altar with it. Then she walked over to the bowl and beat it until it couldn’t be called a bowl anymore.</p>\n\n<p>“Do you really think that’s going to work?”</p>\n\n<p>“Not for long, but it’s worth a shot.” She waved her phone. “I’ll put these pictures out there and see what I can find. If we know exactly what kind of magic it is, we might know how to fight it.”</p>\n\n<p>In addition to trolling the internet, Moxxy also wanted to meet face to face with a specialist back in Milwaukee. We finished searching the mortuary and she called a cab to take her to the city, leaving me to return to Mark’s house alone. I explained what we found and what we did, though it didn’t seem to alleviate his fears any. I spent the rest of the day on the computer, searching for clues about the altar we destroyed and the  history of the town. I didn’t find anything new.</p>\n\n<p>That night, my dreams were filled with visions of the past. I saw Kingston Mortuary as it used to be, before it burned. It was an unseemly building, with yellow walls and carpeting. It was closed for the day and when I entered, I could see why.</p>\n\n<p>A tall, thin man with gray hair and glasses dragged a girl by her arms through the halls. She pulled and wailed the entire way. “Daddy, no! I don’t want to anymore! Let me go!”</p>\n\n<p>“Hush now, Wren. You know how important you are to Daddy’s work. Don’t you want to make your Daddy proud of you?”</p>\n\n<p>“No, I don’t! Let me go!”</p>\n\n<p>I was seeing the past. The man was Dr. Kingston and he was manhandling his daughter, Wren. Mark had said Kingston believed his daughter had a demon in her and abused her in an attempt to get it out. But as I watched the scene play out, powerless to do anything to stop events that had already happened, I came to realize Mark was wrong.</p>\n\n<p>Kingston stripped Wren from her clothes and bound her to the table in the morgue. He beat her, first with a belt, then a switch, then a riding crop. His intentions were to cause pain, not serious injury. When he was done beating her, he went through various other methods of torture, which I was forced to watch.</p>\n\n<p>“You understand why I’m doing this, don’t you, honey?” His voice was soft and contained no hint of malice. That was the worst part about it, his utter lack of emotion. “There’s a darkness in you, daughter. I’m trying to wake it up, to help you bring it out. Then you and I can anything.”</p>\n\n<p>Wren was beyond words and simply moaned and rolled her head. Kingston didn’t wait for her to respond and instead returned to his work, this time with a syringe and a bottle of unknown chemical.</p>\n\n<p>I was so absorbed by the horror unfolding before me that I didn’t what was happening in the house while I slept. Not until it was too late.</p>\n\n<p>(Case #7 will <a href=\"https://www.reddit.com/r/JacobMielke/\">continue in an update.</a> Updates are posted every Monday, Wednesday, and Friday. Mielke Investigations is an <a href=\"https://www.facebook.com/jacobmielkeswriterprofile/\">ongoing account.</a> )</p>\n\n<p>Update: Part 6 can <a href=\"https://www.reddit.com/r/nosleep/comments/8m6dnm/case_7_the_village_of_lost_souls_part_6/\">be read here.</a></p>\n</div>\n","author":"JacobMielke"}