{"rank":"165","title":"It Hurts So Fucking Good","id":"8lomik","url":"/r/nosleep/comments/8lomik/it_hurts_so_fucking_good/","time":"1527123990000","body":"<div class=\"md\"><p>Sundown had long passed. The forest was dark and eerily quiet save for the twigs crunching beneath our feet. The trail we followed led us downhill. The fire in the distance was visible from the top but soon disappeared behind the shadows of the treetops as we progressed further in.</p>\n\n<p>Becca walked in front of me. She was more determined and therefore played the role of pathfinder. The flashlight from her phone illuminated the short distance in front of us. She kept her free arm dangling behind her at all times. Our index fingers locked together while I reluctantly let her lead the way.</p>\n\n<p>There was a faint trickle from a stream somewhere to our right. I couldn&#39;t remember if the trail crossed it at some point and we&#39;d have to jump over. That was going to be hard given how little light we had. I really hoped that wasn’t going to happen.</p>\n\n<p>I had argued ferociously against attending that stupid bush party for an hour before I finally caved in. Emotion always trumped over logic with Becca. And given her recent mental state, I never stood a chance of talking her out of going.</p>\n\n<p><em>Snap</em></p>\n\n<p>The sound came from the darkness just beyond us. Becca froze in place and twisted my finger until my wrist started to hurt. She leaned forward and held her phone further out. Nothing came into view. We stood there completely still for a while in nervous anticipation. We only heard the water flowing in the stream.</p>\n\n<p>Becca lowered her phone and turned to me. I could make out the faint outlines of her facial expression and saw something troubled her. Sadly, it didn&#39;t have anything to do with the sound in the darkness that had just made us stop.</p>\n\n<p>&quot;How long have I been single now?&quot; she asked me. I was so dumbfounded by her chosen topic of conversation it took me a moment to register.</p>\n\n<p>&quot;Three and half weeks.&quot;</p>\n\n<p>&quot;Right. And what was I doing for the first two weeks after Garrett broke up with me?&quot;</p>\n\n<p>I rolled my eyes. Not that she could even see.</p>\n\n<p>&quot;We already went over this, Becca.&quot;</p>\n\n<p>&quot;It’s time for review. What was I doing?&quot;</p>\n\n<p>&quot;Crying in your bed until you passed out every night.&quot;</p>\n\n<p>&quot;Right. And what did that spur me to do last weekend?&quot;</p>\n\n<p>&quot;Drink too much at Mitch&#39;s party.&quot;</p>\n\n<p>&quot;And what did I do after I drank too much?&quot;</p>\n\n<p>&quot;I don&#39;t want to go through this again.&quot;</p>\n\n<p>She grabbed my arm and pulled me towards her. She took a swig of the Jack Daniels bottle she carried in her coat pocket, then offered it to me. She took her next sip immediately after realizing I wasn&#39;t going to accept.</p>\n\n<p>&quot;I don&#39;t want a repeat of last weekend,&quot; she said. &quot;You know Mitch is going to be there tonight. His buddies will be too. You know I&#39;m a little bit loopy right now and this JD is going to be finished within the hour.&quot;</p>\n\n<p>&quot;Then why did we even come? We shoulda just stayed at my place.&quot;</p>\n\n<p>Becca laughed.</p>\n\n<p>&quot;Because we&#39;re still in high school. Because we&#39;re seventeen and can still enjoy the thrill of bush parties in the middle of the night. We&#39;ll have plenty of time to enjoy being old women when the time comes.&quot;</p>\n\n<p>&quot;I&#39;ve never enjoyed these fucking parties.&quot;</p>\n\n<p>&quot;Well, it&#39;s a good thing you&#39;re such a great friend, then. Just hang out for a little while. Keep a good eye on me and don&#39;t let me do anything stupid. Tomorrow, we can do whatever you want.&quot;</p>\n\n<p>She took a third sip and slipped the bottle back in her pocket. She brought the light from her phone up again and started back down the trail. </p>\n\n<p>I stood there in a quiet act of rebellion for maybe a couple seconds before chickening out. I jogged up behind her, grabbed her arm, and let her guide me once again. No way was I going to hike back up on my own.</p>\n\n<p>We continued for another few minutes. &quot;We&#39;re almost there,&quot; she said. I couldn&#39;t see anything at first, but soon the orange light of rising flames started to shine between the trees. I let out a sigh mixed with frustration and relief when we reached the clearing.</p>\n\n<p>A raging bonfire burned in the center. A couple of the boys were acting like idiots, laughing and jumping around it. They had a stack of fallen pine branches they kept throwing on top. Each time they did, the flame would roar upwards and you could feel the increasing surge of heat against your skin. I was honestly amazed that none of these stupid parties ever ended in a forest fire.</p>\n\n<p>I followed Becca right up next to the fire pit. Empty beer bottles were strewn all over the place. The faces around us came into focus. I was not the slightest bit surprised to see the majority of the party attendees were guys. It looked like a five-to-one guy to girl ratio. Absolutely classic high school party demographic.</p>\n\n<p>Many of the eyes honed in on us. Groups of boys that didn’t already have girls to harass shifted in our direction.</p>\n\n<p>Let me be clear, I&#39;m not a total prude. But understand that I had zero interest in having the kind of night the boys were interested in. Maybe under different circumstances. But not in the middle of the fucking forest.</p>\n\n<p>Becca finished what was remaining in her bottle. She wiped her mouth and rolled it along the edge of the fire pit. Her eyelids drooped when she looked back up at me. </p>\n\n<p>Bodyguard duty commenced.</p>\n\n<p>The first barrage of teenage boys was no problem. Becca held true to her word, she didn&#39;t open up any avenue. That, coupled with a lot of one-word-answers and cold-shouldering from me, was enough to convince them to give up relatively quickly.</p>\n\n<p>After their retreat, I promptly steered Becca away from the fire and over to a fallen tree on the perimeter of the clearing. She was noticeably starting to wobble and struggling to keep her balance by that point, so I gently supported her as she sat down.</p>\n\n<p>&quot;Becca, I&#39;m really not feeling this right now. Let&#39;s just go home,” I said after I took my seat beside her.</p>\n\n<p>She looked at me and smiled. Then, she looked back to the crowd of people around the fire and stared for a long time. Her neck kept sinking down and then she&#39;d pull it back up. </p>\n\n<p>Finally, she chuckled –- not in the way I expected.</p>\n\n<p>&quot;You&#39;re just jealous,&quot; she said. &quot;If you would loosen up a little every once in a while, they might pay some attention to you too.&quot;</p>\n\n<p>I was so irate from that response that I honestly would have gotten up and stormed back up the black trail home had there not been a heat-seeking missile of danger headed right towards us. </p>\n\n<p>Mitch and two of his sidekicks, Leo and Gerry, approached us with mischievous grins on their faces. Mitch went right for the spot between me and Becca. Leo sat on the other side of her and leaned in. Gerry took a seat next to me. He was way too close for things to even remotely be considered a casual social encounter.</p>\n\n<p>&quot;Sarah,&quot; Gerry said. &quot;Nice of you to come out. How come I never see you at these shindigs?&quot;</p>\n\n<p>&quot;I&#39;m not really a partier. At least, you know, not in the middle of the woods.&quot;</p>\n\n<p>&quot;You got something against great Mother Nature?&quot; he said. He took a long swig of his beer until it was empty then set it down between my legs.</p>\n\n<p>&quot;I just like to be a little more comfortable,&quot; I said and slid away from him.</p>\n\n<p>&quot;I can make you comfortable, though. Just need you to try being a little more open-minded.&quot;</p>\n\n<p>He put his arm around my waste. I felt his fingers slide across my belt and tug.</p>\n\n<p>I pushed his arm off and stood up. I pointed my finger directly in his face.</p>\n\n<p>&quot;Don&#39;t ever touch me,&quot; I said. &quot;Let me make that very clear to you right now.&quot;</p>\n\n<p>&quot;Why can&#39;t you be more chilled like your buddy?&quot; he said. &quot;You&#39;d have a lot more fun.&quot;</p>\n\n<p>&quot;Not tonight. We&#39;re leaving right now.&quot;</p>\n\n<p>&quot;I don&#39;t think she has any plans to leave,&quot; he said and smiled wide.</p>\n\n<p>I never understood how they managed to pull it off so quickly. The space on the other side of me had been vacated. Becca, along with both Mitch and Leo, were gone. Gerry had created just enough of a diversion for them to sneak off with her.</p>\n\n<p>I was absolutely livid. I did not sign up for that fucking problem. I had both Becca and the boys against me. </p>\n\n<p>I spun around, looking for them amongst the little groups that made up the party. On the far side of the clearing, back towards the trail we came in on, I saw them moving away. Mitch was leading Becca into the brush with both hands as she tilted to either side. Leo followed them with what looked like a tattered blanket rolled up under his arm.</p>\n\n<p>&quot;You fucking assholes,&quot; I said to Gerry. I stomped on his toe then marched in the other direction. Thank god he didn’t try to follow me.</p>\n\n<p>By the time I was past the fire pit, I&#39;d completely lost sight of them. They&#39;d already disappeared into the darkness of the surrounding trees. </p>\n\n<p>I stood at the trail opening and listened for their footsteps. If they were close, I couldn&#39;t hear them. The sound was drowned out by the party behind me. </p>\n\n<p>So, I started to mentally prepare for my blind pursuit into the wilderness. I didn’t see any other choice -- aside from simply abandoning Becca and leaving her with those savages.</p>\n\n<p>Before I could take one step forward, something totally unexpected happened. The entire forest lit up. Long shadows from the trees were cast in all directions. The light was white and blinding, so much that you could hardly see all the way down to your feet. I brought my arm over my eyes to shield them.</p>\n\n<p>A strong wind ripped through and a communal panic fell over the event.</p>\n\n<p>&quot;Fuck man, the cops!&quot;</p>\n\n<p>&quot;Put the fire out!&quot;</p>\n\n<p>The light went out just as quickly as it came. Everything returned to darkness minus the light from the fire. Everyone was silent, in total shock of what just transpired. Only the water moving in the stream and gentle crack of the embers burning were in the air. </p>\n\n<p>The last thing I needed was cops with blinding flashlights on top of the problems I already had. I brought my phone out and made and ventured out onto the path. I was at full attention, looking and listening for anything that would lead me closer to Rebecca and those two pricks.</p>\n\n<p>My heart beat faster and faster. I could feel my stress reaching its breaking point as I got further away from the party. </p>\n\n<p>It was getting harder to hear. A buzzing static rose in my ears and wouldn&#39;t relent. It just kept getting steadily louder, like someone was turning up the volume an old TV left on after a VHS had played all the way through. </p>\n\n<p>There was something so unnatural about it. It was like it pierced your ears and burrowed inside. It hurt once it got inside. Not like any pain I&#39;d ever felt before. It was somehow… inviting.</p>\n\n<p>I started to move uphill. There was still no sign of Becca or the other two. The ringing kept intensifying, continuously making it harder to focus. I felt the urge to just give up and go back to the party. The ringing would be louder down there.</p>\n\n<p><em>Huh huhhhhhhh</em></p>\n\n<p>The unmistakable whimper came from just a little further along the path – the kind of sound only released in moments of intense sexuality. I knew it came from Becca, I could just tell from the way it sounded. A similar whimpering from the two boys followed shortly after. </p>\n\n<p>A surge of anger ripped through me that was so powerful it made that pleasant buzzing become a temporary afterthought. I reconnected with the frustration over searching for my friend who voluntarily snuck off in the dark with the guy she’d told me to protect her from.</p>\n\n<p>The idea that I may be soon intruding on their little forest orgy made me nauseous. So much that I didn&#39;t think I could stomach walking further in if it meant that I might accidentally see what I pictured going on.</p>\n\n<p>But, as it turned, it was them who came to me. Their footsteps slowly sounded louder in the darkness. They were staggered and ununiformed. The three of them came into sight on the boundary of my vision. The crackling beneath their feet grew louder until -- it was drowned out altogether.</p>\n\n<p>A new crackling sounded from behind me and engulfed every other sound in the forest. </p>\n\n<p>It came from somewhere close to the party clearing. It was monstrous. Not just little twigs snapping beneath people&#39;s feet, but more like full trees splitting and being knocked over.</p>\n\n<p>The buzzing returned when the commotion was over. It seemed to be coming from ground level and all around us. It hurt in the best possible way. It made me forget how angry I was again. All I had to do was turn around and go back down. Things would be better there.</p>\n\n<p>Becca, Mitch, and Leo kept walking towards it. Their shoulders were drooped as they looked aimlessly out ahead. Ecstasy on their faces was clearly visible in the blue light from my phone. They continued like zombies right passed me like I wasn’t even there.</p>\n\n<p>There was a powerful part of me that wanted to tag along with them into the deliciousness that lay ahead. But, something deep within me said there was something wrong. It held me up for just long enough for a few rational thoughts to pass through.</p>\n\n<p>I grabbed Becca&#39;s sleeve before she was out of reach.</p>\n\n<p>&quot;Becca,&quot; I whispered. &quot;Something isn&#39;t right. Let&#39;s go.&quot;</p>\n\n<p>She turned her head carelessly back towards me. She looked at me like she’d never met me before.</p>\n\n<p>&quot;Can&#39;t go back,&quot; she said.</p>\n\n<p>&quot;Why... why not?&quot;</p>\n\n<p>&quot;Because it hurts so fucking good.&quot;</p>\n\n<p>She pulled away and continued her stumbling in the direction of the party.</p>\n\n<p>Soon, I found myself in the alone in the darkness once more. I felt a rising gravitational pull in the direction of the clearing. The very place that I had detested not more than an hour earlier, beckoned me like nothing I’ve ever felt before.</p>\n\n<p>I was stuck with two choices. One was very appealing - just give in and go with the others, like I really wanted to. Or, I could listen to that little voice in the back of my head that said something wasn&#39;t right. It was the same voice that reminded me just how angry I was about being in the forest in the first place.</p>\n\n<p>That spark of rational anger was just enough for me to head back up the trail and away from the place that drew me.</p>\n\n<p>I continued to force myself uphill. My brain thought of all sorts of reasons why I should turn back. It searched for any reason to go back into the painful, but alluring buzz which was lessening with each step I took away.</p>\n\n<p>I didn&#39;t dare turn around until I was all the way at the top. Not far from the spot where we had first entered the forest and looked over the raging fire. The buzzing had all but disappeared by then.</p>\n\n<p>I chanced one look back. Just like before, I saw the fire in the middle of the clearing. I saw the outlines of all the people around it.</p>\n\n<p>The differences was that time around they weren&#39;t huddled up in little groups. They were moving awkwardly in one direction. Like sheep, they were herded to one common destination beyond the far side of the clearing.</p>\n\n<p>Something was off about that space as well. It&#39;s like the spiked silhouettes of the treetops glowing in the fire weren&#39;t there anymore. Something else entirely filled that area. </p>\n\n<p>It was in the shape of a giant dome -- perfectly smooth and seemingly unflawed in its roundness. Nothing was natural about. There was no reason anything that looked like that would be found in a suburban forest or anywhere else. It arched way above the trees that stood in its immediate surroundings.</p>\n\n<p>Stranger yet, it seemed to have a pulse. Every so often, it would light up and shine metallic silver. Then, it would fade again and you could only see its outline. Each time it glowed, I&#39;d feel a little of that buzzing again, still compelling me to go back down.</p>\n\n<p>Finally, it stopped. It lit up one time and then didn’t do it again. After a short while of staring into the stillness, tiredness came over me. A complete exhaustion that was so strong I could hardly walk the three blocks back to my parent’s house. It took every bit of energy left inside me to make it up the stairs and collapse in my bed. I slipped away immediately without even pulling the covers over.</p>\n\n<p>My eyes didn&#39;t open again until the next afternoon. I looked outside was surprised to see everything just as it should have been. As if the events of the night before had no impact on what was happening in the world around me.</p>\n\n<p>It was a delightful Saturday afternoon. Children played in the streets, occasional cars passed by. Nothing was out of order. No buzzing calling me back to that area in the woods.</p>\n\n<p>I texted Becca and didn&#39;t get any response. I called and the phone went straight to voicemail. That was the first sign something was very wrong. That girl was constantly glued to her phone.</p>\n\n<p>I went down to the garage and wheeled my little brother&#39;s bike onto the driveway. I rode it all the way back to the forest opening, hoping that I&#39;d feel the buzzing of a text coming from Becca in my pocket.</p>\n\n<p>It never came. </p>\n\n<p>When I arrived at the forest edge, I hopped up on the curb and hid the bike in some bushes near the path&#39;s entrance. I jogged into the spot at the top of the hill, where I had watched the scene unfold just the night before.</p>\n\n<p>The clearing looked just the way I expected it to. It was empty, as was the fire pit, which you could still make out from all the way up there in the light of day.</p>\n\n<p>It was the space behind the party venue that was off. A second clearing that had never existed before lay there. Just as I thought I saw the night before in the darkness, the tees there no longer stood. They were crushed and splintered flat against the earth.</p>\n\n<p>The new clearing was circular in shape. Four black marks were evenly spaced out inside. They looked like something had completely torched the earth.</p>\n\n<p>Whatever made those marks and occupied that space was long gone. Just like Becca, those boys, and everyone else at the party. </p>\n\n<p>No trace of them was ever seen again.</p>\n\n<p><a href=\"https://www.facebook.com/jdmcgregorauthor/\">J.D.</a></p>\n</div>\n","author":"JD-McGregor"}