{"rank":"17","title":"The New Me","id":"8lomxf","url":"/r/nosleep/comments/8lomxf/the_new_me/","time":"1527124091000","body":"<div class=\"md\"><p>Brielle Astor was the most popular girl at Everton High. She had all the attributes of an it-girl, so it was no surprise that she’d quickly risen to the top of the public school food chain. Her closet was extensive; she hardly ever repeated an outfit, and all of her clothes were designer and up to date with all the trends. She had this gorgeous strawberry blonde hair that was shiny, but not in a greasy way. Her blue eyes resembled a Floridian ocean, and they sparkled under the longest, darkest, thickest eyelashes you&#39;d ever seen. Even though her hair was light, her eyebrows were clearly visible, which was something I envied. Not to mention she had a body that could rival Kylie Jenner’s, with curves in all the right places. She was talented at everything from cheerleading to singing, and she never was made fun of. All the girls wanted to be her, and all the guys wanted her. Not to mention she wasn’t too much of a bitch; she was actually quite nice, except to those who’d wronged her. She was practically a living legend, and it was obvious why.</p>\n\n<p>And then there was me. I was barely over 5 foot, and rail-thin, with no curves whatsoever. My face looked devoid of any life, my hair was so blonde it looked white, and my face was peppered in acne. Zits, blackheads, whiteheads, you name it, I had it. Not to mention, I had hobbies that weren’t the most conventional. I was at the very bottom of the social totem pole, to the point where even the Star Wars geeks and horse girls would push me around and steal my stuff. I was nothing at this school, a nobody, the exact opposite of Brielle. No one bullied her, and all the guys I found attractive were fighting for her affections. I wanted everything she had, I wanted her life. I wanted to be her.</p>\n\n<p>At first, I thought this dream would remain just that. I knew that no matter how hard I tried, I could never be her. I was too poor to afford all of her luxuries, and too ugly to ever hold a candle to her radiant beauty. I thought I had no hope. But then, something was revealed to me that changed the game forever.</p>\n\n<p>It was late at night, and I was lying in bed browsing reddit on <a href=\"/r/nosleep\">r/nosleep</a>. This was usually how I distracted myself from this sounds of my parents fighting, and how I blocked out the events of the previous school day. Anyways, I had scrolled down on the ‘hot’ category quite a bit, until I came across a story that piqued my interest. It was about a girl in a very similar situation to mine. There was a popular girl at her school whom she’d envied, so she preformed a ritual to switch bodies with her. It had worked, and now she was the queen bee she’d always dreamed of being. I direct messaged the girl and asked how she’d done it, explaining my situation and how desperately I needed this. The girl happily shared the ritual. It was fairly easy; all I needed was a lock of Brielle’s hair, some of my own, and a little doll.</p>\n\n<p>One of my few talents was that I was a half decent seamstress, so I made the doll. Getting the hair was simple too; I knew Brielle was going in for a trim that Friday, so I got there after her appointment was over and took some of her hair out of the garbage can. Then i pulled out some of my own, and did the deed. However, once I finished, nothing happened. Disappointed and dejected, I went to bed.</p>\n\n<p>The next morning, I woke up in a place I didn’t recognize. The room looked like it belonged to a millionaire. I looked around and saw a ‘wall of fame’, and saw Brielle’s face plastered all over it. I grinned from ear to ear; it worked! My plan had worked! I immediately went to the closet and picked out an adorable outfit, and checked myself out in the mirror. I ventured downstairs, where I saw Mrs. Astor - my mother - cooking bacon. “Good morning mom,” I smiled at her. It felt so natural calling her my mother; it felt as if it was meant to be. </p>\n\n<p>Brielle’s - my - best friend, Madison, picked me up from my house in her BMW.</p>\n\n<p>“So, did you hear?” she asked.</p>\n\n<p>“Hear what?”<br/>\n  “You know that weird girl Gertrude?”</p>\n\n<p>My heart skipped a beat - Brielle had known I existed! - but I quickly regained my composure. “Yeah, what about her?”</p>\n\n<p>“I got a text from her this morning, saying that she was actually you and that she’d switched bodies. I think she’s reached a psychotic break.”</p>\n\n<p>I immediately went white. “You okay Bri?” Madison asked, concerned.</p>\n\n<p>I shook it off. “Oh, yeah, I just don’t want her having an incident or anything.” I was worried at first, but now I knew what to do.</p>\n\n<p>That day during lunch, I cornered the real Brielle and took her to the locker room. When the class came back from lunch, some freshman girl found her in the showers, hanging from the shower head. The police ruled it a suicide. What a shame, really. But at least there’s a constant, the constant of the beautiful Brielle.</p>\n</div>\n","author":"silksunflowers"}