{"rank":"22","title":"The Newspaper","id":"8loupr","url":"/r/nosleep/comments/8loupr/the_newspaper/","time":"1527126024000","body":"<div class=\"md\"><p>I sat down my Chinese food and called for my younger sister and brother, &quot;Leah, Lukas! I have dinner!&quot;\nI saw two blurs of blonde zoom past me and head towards the bag of takeout. I sit down on the couch and pass out the food.\nI glance over and look over their beautiful blonde curly locks paired with their fair, pale skin, and precious green eyes. \nI smile as I see their little hands try to work the chopsticks. &quot;Here, this is how you do it.&quot; \nI explained as I fixing my both my brother and sister&#39;s holding. They giggled and continued to use the wooden tools incorrectly. </p>\n\n<p>&quot;Am I doing it good sissy?&quot; I heard my brother ask. I giggle and just nod my head, the moment was just to cute to ruin.\n He looks accomplished.</p>\n\n<p>The door suddenly swung open and my face dropped. I looked over to see my siblings&#39; faces brighten and they have wide smiles.\n I hear my mom speak, &quot;Give your mommy a hug.&quot; They run up to her and she wraps her arm around them.\n My dad is behind her smiling at the youngest two. After their hug my parents walk into our small, dark, and cramped shack of a house.\n I look only at my noodles as I continue to eat. </p>\n\n<p>I don&#39;t notice but tears start streaming down my face. I sit my empty container on the coffee table. &quot;What&#39;s the matter darling?&quot;\nI hear my dad ask me. I turn to face him with a smile on my face, tears still spilling out my eyes. He comes up to me and wipes my tears away.</p>\n\n<p>&quot;Nothing is Father.&quot; I say. He smiles at my response, but that smile soon fades and he tightly grabs my chin.</p>\n\n<p>&quot;Good, make sure it stays that way.&quot; He said, his grip just getting tighter. I gulp and to the best of my ability shake my head as a response.</p>\n\n<p>&quot;Now, Sarah be a good girl and get your father the mail from outside.&quot; My mom demands. \nThey are never here in the morning so I always go out at night to retrieve the daily paper and bills. I get up slowly and shuffle over to her.\nShe gives me a kiss on my cheek and shows me her grin that took up a lot of her face. I unlocked the door and closed it behind me. \nI felt the coldness hit my skin like bullets being fired at me. I looked down at my outfit seeing my pants that were torn so that they looked like mutilated shorts.\nMy shirt had holes and you could only see a light shade of it&#39;s once pink color. My feet started to move down the pathway and to the gate of our fence.\nI look at the border that surrounded my house and the outside world.</p>\n\n<p>I wish I could go out there but I can&#39;t, I&#39;ve tried. I got the newspaper off of the ground and frowned\nI didn&#39;t understand how Lukas and Leah didn&#39;t see the differences between us three and our parents. But I guess they were just to young to remember.\nI walked to the front door and opened it. I looked at the couch and saw my siblings playing with my mom. \nI also couldn&#39;t find a reason as to why they didn&#39;t see the large age gap between me and them. I handed the paper to my father who sat in his recliner.\nI sat on the floor next to the couch. I looked over to my dad and saw that the side facing me had three familiar faces on it.\nMy siblings continued to play and giggle with my mom as I began to actually see what was written down.</p>\n\n<p>The text read: Local mom, Sarah Collins in her 20&#39;s is reported missing along with her two children.\n Their names being Leah and Lukas Collins. They have been missing for almost three years and still no sign of them.\n If you have any clue as to their whereabouts please contact xxx-xxx-xxx.</p>\n\n<p>I felt a tear roll down my cheek again as my dad turned the page covering up our true story. </p>\n</div>\n","author":"KrisxTina"}