{"rank":"9","title":"The King of Hearts (Part 1)","id":"8lozup","url":"/r/nosleep/comments/8lozup/the_king_of_hearts_part_1/","time":"1527127272000","body":"<div class=\"md\"><p>It was a week before summer vacation, and I had no idea what to do with myself. I have a job, but it&#39;s only a part time fast food position. I&#39;m not really into sports. Most seventeen year old guys are out with their friends all summer. Drinking, smoking, partying, hooking up with hot girls. None of that will be happening for me this summer. I have never been the overly social type. Yeah, I have a small group of friends. But we don&#39;t do much when we&#39;re together. We play video games, and that&#39;s about it. Don&#39;t get me wrong, I love our hours of playing PC games and battling it out on our consoles, but I wanted a change. I wanted to expand mu horizons, and meet new people. Maybe have a chance with a girl. </p>\n\n<p> I thought I&#39;d be in for a boring, shitty summer. I wish I knew then what I know now. </p>\n\n<p>I was scrolling through my Facebook feed one night before bed. Same old, same old. Selfies of girls in my classes, video game posts from my friends, and a group photo of all the jocks holding their beers. I did see one thing that caught my attention. It was an advertisement from a company called <em>Youth Recreation Club Inc</em>. The ad jumped out at my bored, teenage soul. </p>\n\n<p>&quot;Are you looking for something to do this summer? Do you want to meet new friends? Contact Youth Recreation Club Inc. for more information!&quot; </p>\n\n<p>Huh. That seems interesting. I clicked on the link. What have I got to lose? Maybe I&#39;ll meet some pretty cool people and have an interesting summer. The page loaded to a bold, professional looking website. There wasn&#39;t too much information on the company page, but I figured it was a brand new company, and would take some time to build up their website. No where did it say that I had to pay to sign up, which was cool. I looked for any and all small print that could fuck me over somehow, but I found nothing. This website seemed legit. </p>\n\n<p><em>Welcome to YRC Inc., a new innovation in socialization for youth 13-17 years of age. We place participants into groups based on their common interests, and arrange for them to meet and go on some day trips. Please fill in your phone number to get started. Data rates may apply. Due to a high volume of applicants, only those selected will be able to join our current group. Remember to check back for more opportunities!</em> </p>\n\n<p><em>- Your friends at YRC Inc.</em></p>\n\n<p>Okay. Seems pretty cool I guess. I quickly filled in my number and submitted it. No idea if I&#39;ll get accepted, but it&#39;s worth a shot. It was approaching midnight, so I shut down my laptop for the night and went to bed. That night, I had dreams of an awesome summer. I dreamed that I met a whole group of new, exciting people, and that we had beach bonfires and sipped on cold beers by the fire. Although when I awoke, it was back to my average life. </p>\n\n<p>I didn&#39;t tell my parents or my older brother about what I had signed up for. I didn&#39;t want to hear the whole &quot;it&#39;s probably a scam&quot; lecture. At seventeen, you&#39;re invincible, right?</p>\n\n<p>My day was mundane. I attended the same boring classes as usual. I looked down at my phone, and saw a text message from an unknown number.</p>\n\n<p><em>Unknown: Hello, Cody Holloway. You&#39;ve been selected</em> <em>for this summer&#39;s group of ten, called &quot;The Voyagers.&quot; Please reply to this text to confirm your interest.</em></p>\n\n<p><em>-The King of Hearts.</em></p>\n\n<p>I was pretty pumped. I eagerly texted back confirming my interest, and awaited a reply. It came almost instantaneously. </p>\n\n<p><em>Unknown: Cody Holloway, wel</em>come <em>to The Voyagers. Now, there are some rules that we have to enforce.</em> </p>\n\n<p><em>1. Do not tell ANYBODY</em> <em>about this game. We&#39;ve wiped our</em> <em>website, and all traces of the advertisements. No one will believe you anyway.</em></p>\n\n<p><em>2. You cannot back</em> <em>out now. I know where you live. I know who your friends are. I know more than you think.</em></p>\n\n<p><em>3. Do what I say.</em></p>\n\n<p><em>3. If under any circumstances, you break these rules, you will face consequences. Serious consequences.</em></p>\n\n<p><em>Understood?</em> </p>\n\n<p><em>-The King of Hearts.</em></p>\n\n<p>My heart dropped. What the hell had I signed up for? I jumped from my seat and ran to the bathroom, ignoring my teacher when she told me to sit down. This can&#39;t be real, it has to be a scam. It must be some sick prank. I decided to text back. My palms were drenched in sweat, and I felt dizzy. I just kept telling myself that this was all fake, it was just a scam. </p>\n\n<p><em>Cody:  Who the fuck are you? This is some sick scam, dude. Delete my number.</em></p>\n\n<p><em>Unknown: This is The King of Hearts. You signed up for our service. You wanted a fun summer, remember?</em></p>\n\n<p><em>Cody: Yeah, but now I know it&#39;s a scam. A total scam. If you text me again, I&#39;m calling the cops. Sicko.</em> </p>\n\n<p>I was paralyzed with fear when the sick bastard sent me a photo of my own house, taken from the front. Inside, you could see me in my window at my computer. I panicked, and threw my phone on the ground. I backed up against the wall, and had to hold on to keep from falling over. I felt so lost and helpless. What could I do? I was stuck, and I didn&#39;t want to face these &quot;consequences.&quot; My mind was racing. Maybe if I ignored it, it would go away. The threats seemed pretty serious, though. This guy knows where I live! I couldn&#39;t risk my family or friends. They were innocent, and I was the idiot that fell for a scam. I had to comply with whatever this dude wanted. I picked up my phone, which now had a large crack down the screen.</p>\n\n<p><em>Unknown: Feisty, are we? Well, I wouldn&#39;t do that if I were you. Now, are you ready for your first task, Cody?</em></p>\n\n<p><em>Cody: Look man, I can give you money. I can sell everything I have and give you every last dime. Just leave me alone.</em></p>\n\n<p><em>Unknown: Pleading won&#39;t help, and I don&#39;t want your money. I want participants.  Now, let me give you some information. You&#39;re one of ten participants from your area. These participants are the only people you may discuss this game with. Do not mention my name or &#39;The Voyagers&#39; to anyone else. Be careful what you discuss with the other participants, and keep in mind I am everywhere. Now, for your first task...</em></p>\n</div>\n","author":"falling_into_gravity"}