{"rank":"0","title":"In umbra Truci Messorem","id":"8loz49","url":"/r/nosleep/comments/8loz49/in_umbra_truci_messorem/","time":"1527127104000","body":"<div class=\"md\"><p>I’m running, trying to dodge every branch that came in my way, not looking back. I go behind a tree to catch my breath, trying not to breathe too loudly for it might hear me. I climb up into a tree to try and hide myself from it.<em>\\</em>Crack**. I look down and there it was, walking slowly. I look down as it passes the tree and then it stops, turning around searching for its prey. I’m able to see it clearly now. Its human like body, two times my size. It’s skull visible on the top right side of its face. Where its eye should be; was just cold, dark emptiness. I become entranced and for a second I forgot what was happening.</p>\n\n<p>I blink my eyes a couple times and snap back to reality. It turns around and walks away. I climbed down looking around for it, my heart beating; faster than i’ve ever experienced. I take one last look and it was nowhere to be seen. I look around not knowing where I was.</p>\n\n<p>I start walking trying not to make too much noise so that I don’t run into it again. About an hour of wandering I see a road. I get to it and see a sign. “<em>Leaving Willow Woods”.</em> I had made it.</p>\n\n<p>This was supposed to be a break from reality, a time to myself where I could relax, but it didn’t stop there. I keep reliving that moment of me in that tree looking down, trying to hide. Every night I wake up screaming. That face scarred into my mind. And now I’m going back, ten years later. I need to make sure it was all real, not just my imagination. And if it was real, then I need to stop it. I need to kill that thing. Then maybe the nightmares will be over.</p>\n\n<p>Tonight is the night. I pack a knife, a pistol, some water, clothes and a sleeping bag. I drive to a gas station to fill up my car. I go in and get some snacks and pay for the gas. As I continue driving the road becomes more familiar. Then there I see a sign, <em>“Welcome to Willow Woods”</em>. I was here. I take a off-road path into the woods. At the end of the road was the cabin I was going to stay in.</p>\n\n<p>I park up front and get out of my car. I go to unlock the door but it was already unlock. Hesitant at first, not knowing what layed on the other side of the door. I take a deep breath then open the door. <em>\\</em>Surprise**. “Jake what are you doing here”. “What man, we knew that you were coming up here so we thought that we’d beat you here and surprise you” Jake said. “Me and Jess are gonna be staying here with you, Nate for the weekend”.</p>\n\n<p>I tried to get them to go back home but they didn’t listen. “ Hey Jake if you guys are gonna stay here, just be careful alright”. “Don’t worry Nate, we’ll be fine”. I bring my stuff in and unpack. I take a look at the clock, already 11:00 pm. I go to bed and try to get some rest for tomorrow.</p>\n\n<p><em>\\</em>AAAAAAH**</p>\n\n<p>I jolt up from my sleep and listen. Then I hear the scream again and realize that it was Jess. I grab my knife and go out of my room. I see her on the counter in the kitchen. “Jess what’s wrong?”. “There’s a rat on the floor”,she says. “A rat really, you screamed about a rat”. I find the rat and get it out of the kitchen. “Thank you”,then she hugs me. I tell her to try and not freak out about that stuff.</p>\n\n<p>After a few minutes I head back to bed. I get into my room and my window is opened. I shut it and get into bed. As I cover up I hear the window creak open. I look over and it was opened again, then <em>\\</em>Crack**. It came from outside the window. I look out to see that it was just a rabbit. I close the window and go to sleep.</p>\n\n<p>I wake up, the nightmares are more intense now. I get into my car and head out to get some milk while Jake and Jess are asleep. On my way home I see a car on the side of the road, I pull over to see if someone needed help, but no one was around, I turn around and there Jess was, in the middle of the road, a pole jammed right through her torso.</p>\n\n<p>I jump up out of bed, it was all a dream. Then I hear Jack scream. I run to go check on him and I slip. There was blood on the floor. I go into the bathroom and Jess was there with a pole through her torso. I threw up, then I hear the front door slam close. I go to chase after Jack. I trip and fall, I get up and there it was. The tree I had climbed, and all of a sudden flashback after flashback hits me, over and over and I just pass out.</p>\n\n<p>I wake up. It’s dark out. I go to get up then I get pulled down. It was Jack. He told me to be quiet, that something was out there. We start moving slowly trying not to make a noise. We get back to the cabin. We get into my car and drive away. As we reach the road I had seen it. It was just standing in the middle of the road taunting me. I quickly go into reverse and drive back to the cabin. “Nate what are you doing, we need to get out of here”. I tell him to calm down and that we will be safe in the cabin for the night. When I go into the cabin I get some paint and start drawing symbols of protection on the walls. Then I pass out.</p>\n\n<p><em>\\</em>CRASH!** I Wake up. I take a look at the clock its 2:27 am. I go out to see what happened. I get to the main room and see that the window is smashed. I turn on the light. Broken glass is everywhere. I quickly go to the kitchen to grab a knife, but when I get to the kitchen I see Jake standing there. “Jake c’mon we need to go… Jake, are you ok?”. I go to grab him and then he just falls down. I look down to see that his eye was missing and that his face was bloody, he had multiple stab wounds in his chest.</p>\n\n<p>Then the lights go out. I look around. <em>\\</em>Crack*<em>. There it was, right outside the window. I can see it and it can see me. But then I hear a faint voice. Chanting something. *“From the dead you have risen, brought here by me. Do my bidding and at rest you will be”.</em> I see light in the bathroom. I open the door and see candles in a big circle and at the center was something unbelievable. “How are you here, I saw you, you were dead?”. “Well Nate I have a few tricks up my sleeve, but you wouldn’t understand”. It was Jess, she was somehow alive. “Jess we need to go, it’s out there”. She points behind me, I turn around and there it was. “See Nate, I’m not just some average girl, I summoned him. <em>In umbra truci messorem.</em> It’s Latin. It means; in the shadow of the Grim Reaper.</p>\n\n<p>He was imprisoned by Death herself, but I freed him and I placed him here to live, but then you came along and screwed everything up, so now I have to kill you”. “What about Jake, why did you have him killed?”. “Because Nate, he was just so annoying, all he cared about was work, he didn’t love me. Every night he’d come home and that’s all he would talk about”.”That was my friend, he was like a brother to me and you took him away”. I couldn’t believe it,my best friend was dead and I was about to be next. “Kill him”. It lifts its arm up, knife in hand.</p>\n\n<p>As it goes to kill me a chain out of nowhere wraps around its arm, then another one around his other arm. A third one wraps itself around its neck and it gets pulled into this shadow. From the shadow emerges a shadowy figure with a cloak. It was then I realized it was her, It was Death. She turns to Jess. “You stole my prisoner, you shall pay”. Jess was screaming now,”no you can’t do this”. Then she points at Jess and a bunch of chains come flying from the shadowy portal, wrapping themselves around Jess and they drag her in. I look at Death and she looks at me. She goes back to the shadow, winks at me, then disappears. At last the nightmare was over… For now.</p>\n</div>\n","author":"deathsshado"}