{"rank":"44","title":"I have a family.","id":"8lp5rd","url":"/r/nosleep/comments/8lp5rd/i_have_a_family/","time":"1527128674000","body":"<div class=\"md\"><p>As far as I could remember, I was brought up by my brother, William.\nHe was maybe 15 years older, and we only had each other as family.\nWe never knew our father, but Will spoke fondly of our mother, who had died in a car accident when I was a few weeks old. My brother, being just a boy, had sold the mediocre house we had to sustain ourselves till he could earn to support us. We lived in a little cottage outside the city, my first house that I can actually remember.</p>\n\n<p>We moved out into a second floor apartment in the middle of the city when Will got himself a job at a local newspaper as a photographer. I sometimes missed our cottage at the edge of the woods. At least I had all of my possessions: the warm scratchy blanket, my tricycle, and few rattly toys. I was in middle school and too old to play with them now, but they carried a sense of familiarity that was comforting in this new, alien place.\nOne thing I definitely noticed was a grainy photograph that Will hung over the mirror on the old house was missing. Apparently it was a photograph of our mother, William said he lost it during the moving. He seemed not too bothered by this, but it was the only article that had a link to my parentage. I soon forgot about it though, as 6th grade in a new school beckoned.</p>\n\n<p>My brother meanwhile, had managed to work his way up to become a reporter for a national news agency. He was a no-nonsense kind of lad, and that won him the praise of his superiors. He began traveling cross country a lot more, and this meant I was home alone for close to four days a week. I was pretty self sufficient and quickly adjusted to living alone, but I did miss the big guy at times.</p>\n\n<p>One day, I had a bit of a curious streak and started rummaging around in Will&#39;s wardrobe. To my dismay, I found the photograph of my mother in Will’s blazer pocket. It had been five years since I&#39;d seen it, but I remembered the blank, sort of glazed over expression on her face, like a plump Mona Lisa.\nOn the back of the photo, at the top border, written in blue ink, was the word &quot;<em>MARGARET</em>&quot;. I recognised immediately that this wasn&#39;t my brother&#39;s handwriting, and judging by the fading text, it wasn&#39;t a recent addition to the picture either. I replaced the photo back into the blazer and waited for Will to return home later that day.\nIt was pouring with rain when he finally knocked on the door and gave me a wet, sloppy hug with a wide smile on his face. &quot;I&#39;ve been promoted to presenting the morning news! I don&#39;t have to travel any more!&quot;, He said. The rest of the evening was spent in celebration with cake and pizza, and I forgot to enquire about my discovery.</p>\n\n<p>I was now in my final year of high school,my brother was doing very well for himself and indeed, both of us. I wasn&#39;t the brightest kid in my class but I got by, and the future looked promising. One fine day, uncharacteristically for his usually organised self, Will forgot his phone at home.\nI could see he was in a big rush, what with the big early morning job and all, and I didn’t think too much of it, until his phone rang that afternoon. I missed the call as I was in the washroom, but the caller had left a voicemail. I opened it up, thinking it must be my brother asking me not to mess around with his phone, but no. The voice on the other end was of a man, roughly middle aged, and he only said “Margaret”.\nWill got home late that evening, and I immediately informed him about the mystery caller and the contents of the message she had left. Now, he was a professional, calm, and collected person, and bringing up a brother had taught him all about life that life could ever teach, but the look of shock in his eyes was something I will never forget, a mixture of defeat and hopelessness.\nWill quietly left the room, went to wash up. I wanted to ask who this caller was, but I could see this affected him greatly. The next morning, I found him still in bed at 8 o’clock.</p>\n\n<p>“Aren’t you going in to work today?”</p>\n\n<p>“No.”</p>\n\n<p>“Why?”</p>\n\n<p>“I got fired.”</p>\n\n<p>“Oh.”</p>\n\n<p>This turn of events puzzled me a great deal as Will was the perfect employee: tidy, professional, and punctual. The next day, he went out to get groceries. He gave me a long stare before leaving, which I thought was quite weird. I only wish I ever get to see him again.</p>\n\n<p>Will was nowhere to be found over the next few days. I could not eat or sleep. Police searches had turned up empty. Nobody saw him anywhere, even in the grocery store which he frequented.\nThe ninth day of being by myself, I was confronted on the street by the grocery store owner, and he asked me what my name is.</p>\n\n<p>“My name’s Michael”</p>\n\n<p>“Ah. William’s brother. Terribly sorry about him.”</p>\n\n<p>“I’ve not lost hope yet, Mister..?”</p>\n\n<p>“William. My name is William too.” said the grocer, with a sad smile on his wrinkly face.</p>\n\n<p>“Your brother was a fine young lad” he continued, and motioned me over to his house for a cup of tea.</p>\n\n<p>As I walked up the dimly lit stairway, I couldn&#39;t help but feel I had met this man somewhere before.\n“Have a seat, I’ll be right over.” he said, tending to the boiling pot of water.\nI sat down on a victorian style armchair, one of two in the little sitting room. When he came back and sat across me on the other chair, his expression was firm.\nHe slid an envelope across the table, which I opened hurriedly. The letter inside was a foolscap sheet, yellow with age. The text on it was equally old, but I recognised the handwriting which sent a chill down my spine.</p>\n\n<blockquote>\n<p><em>Dear Michael,</em></p>\n\n<p><em>Leave home. Leave everything behind. You can trust Mr. William. Take his help. Please do as he asks you to. I have money saved up for you in the</em> <em>bank. Mr William will help you gain access to it. Change your identity. Do not attempt to seek me out.</em></p>\n\n<p><em>Love, Will.</em></p>\n</blockquote>\n\n<p>I felt myself spiralling, but held my composure and asked the old grocer “Do you know where he is?”\nMr William got up from his seat and walked into his bedroom, closing the door behind him as he said “You leave tomorrow at dawn. Close the door on your way out.”\nThe night was a blur. My head felt light and heavy at the same time. My thoughts had left the plane of rationality and I couldn&#39;t think straight.</p>\n\n<p>The next morning, Mr William saw me off at the train station, handing me two envelopes, one of which was the one my brother had left for me, and another newer envelope.</p>\n\n<p>“Show this to the manager at the Lloyd’s Bank, there’s enough there to help you get on your feet.”</p>\n\n<p>“Thank you, sir, but I still have many questions. Can I call you up once I reach there?”</p>\n\n<p>“Absolutely not” said the old man, smiling, “you can not contact any of your friends anymore.”</p>\n\n<p>“I don&#39;t have many friends”, I replied, just as the train started to move.</p>\n\n<p>“Your brother would be very proud of you, god bless his soul.”</p>\n\n<p>“My brother is dead?!” I screamed, feeling my heart sink to the depths of my stomach.</p>\n\n<p>The old man waved me off as we left the station. I could not bear to look at him. He had something to do with Will’s disappearance. He had something to do with his death. The thought of losing my only family member made my knees weak, and I felt nauseous. The 200 mile journey felt like a roller-coaster ride. Upon arrival, I headed straight to Lloyd’s bank, desperate to learn anything about my brother. However, the bank staff were professional, and the manager signed over 20000 pounds to my new name : Richard.</p>\n\n<p>I joined the local university and stayed in the hostel for a year until I met this girl, Jane, and we moved in together into a little apartment in the town. She was the loveliest girl I had ever met, and she helped me forget my past. I never told her about it, though, and she did not ask.\nAs we completed our degrees, we found well-paying, albeit boring desk jobs, but our love for each other remained unwavering.</p>\n\n<p>We got married when we were both 29. The ceremony was small, but beautiful. I finally had someone to call Family. We found out Jane was carrying our child a few weeks later. The next eight months were a whirlwind of planning, baby proofing, and redecorating the house.</p>\n\n<p>Today, Jane was admitted to the maternity ward a few hours before she was expecting, and I ran out to get a box of chocolates. Finding an open sweet store was hard at this hour, and it started raining heavily by the time I had to head back. I found shelter in a newsstand where I started reading the headlines while waiting for the storm to die down.</p>\n\n<p>Flipping through the pages, a familiar face caught my eye. It was the grocer.\nThe headline read : “<em>Elderly man hacked to death, suspect still at large</em>”\nI dont know why this made me feel hollow inside. He was a man who knew about the fate of my brother and never told me. He sent me away from my comfortable home to fend for myself in a completely different part of the country.\nJust then, my phone rang, and as I pulled it out of my pocket, a square piece of paper fell down, and got soaked on the wet pavement. I quickly lifted it up, and saw that it was the photograph of my mother, which I always had with me. I flipped it around, but there was no longer just one word on the back. The water had washed away whitener used to conceal a message written in blue ink.</p>\n\n<blockquote>\n<p><em>Margaret’s curse :</em></p>\n\n<p><em>You may only have one as family.</em></p>\n</blockquote>\n\n<p>This terrifying discovery made me go numb all over, but I managed to gather my bearings and pick up the call. I felt realisation hit me like a train when i heard the doctor say “I’m terribly sorry Mr. Richard....”</p>\n</div>\n","author":"Arjun_Sindhya"}