{"rank":"2","title":"I found a strange poem in my great grandfather's closet","id":"8lp6th","url":"/r/nosleep/comments/8lp6th/i_found_a_strange_poem_in_my_great_grandfathers/","time":"1527128946000","body":"<div class=\"md\"><p>Hi all. So my great grandparents just recently passed on and I, being their favorite grandkid, was given their house. It&#39;s not very large, being two stories with a very small attic but there is a lot of wasted space due to design error and wall placement etc. Anyways, I was looking in my great grandfather&#39;s closet and came across this very strange poem. It&#39;s strange because neither he or my great grandma wrote much and I&#39;m actually almost convinced that he was illiterate. Its also in this strange font and the paper looks extremely old and stained. Here it is.</p>\n\n<p>Ith&#39;gild Part I\nA cacaphonous screech\nHeard across the night\nHis mind ripped back to its resting place\nShattered\nBroken\nWinter was cresting\nThe cold,\nThe death,\nAnd with it, the screech\nThe one heard long ago\nOn the tallest mountain\nCapped with snow\nWhen the rocks had lived\nThe trees had had eyes\nAnd the mind of all\nWere unclouded\nIn their own basin of madness\nUncracked</p>\n\n<p>Uncracked was the sunrise\nSeen on the frozen pallet of farmland\nIn from where he came\nThe wanderer\nHe who wore nothing of brightness or luster\nLuster, or the lust of the vain\nPutrid, in the eye of man\nIn his infantile mind\nHe was not putrid, man was putrid\nAnd so he sought to feed</p>\n\n<p>Feeding in late January\nThe month at the time\nwas uncommon \nFor he\nHe, the man of many stories of trials and his wanderings\nClad in his road trodden attire\nSeeming as if he could sift through \nAny one body or mind he traveled nearest</p>\n\n<p>One of a certain esotericism would know this creature to be one of times past\nWhen the rocks had lived\nAnd the trees had had eyes\nAnd the screech\nThe yell that clouded the sky and the sunrise\nOn this day\nIn late Januaray</p>\n\n<p>He was one of the highest regard\nRegard to esotericism</p>\n\n<p>A soul of knowledge\nAnyone who had approached he would receive\nTo learn of the tales of the ancient wood and rock\nA song\nTo see, to feel the grinding, penetrating, ever present beat\nThe beat, the rhythm, the screech\nIt was this song that drove the infant to insanity\nBabbling to itself and making as if the world\nThough unaltered yet\nWas turned upside down\nA fraction of a thought\nIn the crux of his mind</p>\n\n<p>In the irrevocable heat of the Iraqi desert is where he was first experienced\nSpeculative, however this is, for this was only the introductory writing of He\nThe screeching man\nBeing discovered by the Babylonians\nAs they established routes of trade\nHe sat, cross legged, atop a rock\nOh which several sigils of arcane nature were carved\nHere he sat as if he was apart of the stone\nThe people of Babylon then built a ziggurat round him\nSo as not to disturb his trance; his meditation</p>\n\n<p>This ziggurat being of a mighty tower\nAnd he being named their God\nThe Wise Man of the Stone\nHere he sat for seventy years, entranced\nIn this trance, he dreamt\nOf leaves\nOf herbs\nOf metal\nAnd so the stone&#39;s glyphs changed slightly</p>\n\n<p>The tower then burst with rich, refracting beams\nBeams of deep cyanic and lavender hue\nAnd so the Babylonians approached with orchid petals, myhr, and heavily ironed blood\nUpon receiving these gifts, the traveler opened his eye\nAn ovate, viridescant, iris greeted the congregation\nSlit like a feline&#39;s</p>\n\n<p>The tower then\nNoticing this intrusion\nOne of great might and evil\nBegan to dismantle itself\nAnd as the bricks were feld\nThe horror extended his wings\nVertically into the air he went, expelling only what could be thought of as smoke\nAs the Babylonians on the ground breathed this\nThis oppressive inhalant\nThey began to dream\nTo dream of the stars\nAnd the lines betwixt them\nAs well as the angles that made up the universe </p>\n\n<p>And so Babylon\nClad in its desert\nIn its irrevocable heat\nWould be known as masters of the stars\nForevermore</p>\n\n<p>So what could any of this mean? I&#39;m not really into Babylonians so I don&#39;t really get it. But I also have no idea where it even came from? It was hidden behind a box in the bottom corner like it was trying to be hidden. Anyways, spooky. I&#39;ll post anymore if I find anything else like this. So stay posted.\nThanks,\nThomas</p>\n</div>\n","author":"Spupid_Stoonerism"}