{"rank":"0","title":"The blood coursing through my veins","id":"8lpfqf","url":"/r/nosleep/comments/8lpfqf/the_blood_coursing_through_my_veins/","time":"1527131129000","body":"<div class=\"md\"><p>I’m sitting here on my couch in the dark sipping whiskey, I can’t sleep. Maybe if I drink enough whiskey I can pass out on the couch and not have any more nightmares, it also helps ease my pain. I was in a motorcycle accident three weeks ago and was in the hospital recovering for two weeks. The pain meds I got aren’t working anymore, I feel like I’m in hell every day.</p>\n\n<p>My wife Amanda is sleeping in our bedroom, she’s been so supportive throughout all this but I feel like she’s having a hard time seeing me like this. I feel like my personality has changed since the accident, I can’t explain it and I don’t understand why this is happening. I’m also starting to have visions throughout the day, I think I’m going crazy.</p>\n\n<p>My wife who’s a nurse thinks I’m suffering from depression. I barely eat, I don’t sleep much, and I constantly feel tired. If I’m up half the time I feel anxious and can’t concentrate. I feel like I’m always in my head, thinking about the accident and my nightmares and trying to figure out what’s wrong with me. I know Amanda only wants to help but I end up lashing out at her and putting her down when she is only trying to help. Her nurturing instincts as a woman and a nurse always kick in and she is always patient with me and helps me through it. She’s so selfless and never asks for anything in return. I just feel terrible after I have one of my mood swings and yell at her out of nowhere, it’s not like me.</p>\n\n<p>The sun is coming up I can hear Amanda coming downstairs “Babe how long have you been up?” She looks worried yet upset at the same time “Alex you have to snap out of this, I hate seeing you like this”. “Amanda I don’t know what to do, I keep having those nightmares and now I’m starting to have these visions throughout the day, It scares me, it feels so real”. “Lay down and get some rest, I’m going to sit down next to you and if I feel you moving or dreaming I’ll wake you up” “Ok, I’ll try, I feel exhausted”. I felt comfortable knowing Amanda would be next to me, I slowly laid down and closed my eyes.</p>\n\n<p>I’m walking in a park that seems to be barely lit by any lights but there’s enough moonlight to light my way. I keep walking and can smell the petrichor in the air, the grass is still a little wet. It feels warm outside. I’m suddenly feeling really anxious, my body is tingling all over. I see an athletic looking woman in black leggings and a pink sports bra jogging towards me but she doesn’t see me yet. There’s a man in the bushes kneeling ahead of her wearing all black, she doesn’t see him either as she jogs closer to him. The man stands up and reaches from out of the bushes and grabs her by the throat with his left arm, I run towards her as fast as I can “STOOOOOP!” I see the man lifting up a large straight edge knife with a long black blade with his right hand ready to stab her in the neck.</p>\n\n<p>She bites, scratches and hits him in order to get free. She manages to escape for a second and runs towards me she sees me with wide eyes “HELP ME”. The man reaches her from me behind, I see the large knife cut into her neck. She screams and starts to spit out blood as reaches out for me but it’s too late. I’m frozen and can’t move, I feel like I’m outside my body. I see the killer stab at her body repeatedly, what seems like 7 inches of the black steel blade gets covered in blood over and over again. She falls to the floor face first. She’s dead.</p>\n\n<p>“BABE WAKE UP! You kept punching the couch with your fist like you were stabbing something” I sit up on the couch next to Amanda. “I can still hear her screaming out to me” I begin cry and can feel my body shake as I feel helpless and scared to these nightmares, they feel so real. I told Amanda all about my dream, every single detail. My past nightmares weren’t this gruesome. But it always included the same man in my dreams. That can’t be a coincidence, can’t it? “We need to figure out what’s going on, maybe you can see a therapist so you can figure out why you have these nightmares” “Maybe, It’s weird though I don’t remember having these dreams before the accident.</p>\n\n<p>Even when I was in the hospital I didn’t have these nightmares until…It’s going to sound weird but, after the blood transfusion I started feeling like I wasn’t myself anymore. Do you think the blood might have something to do with it?”. “That sounds crazy, a blood transfusion can’t do that” “I know but there’s something wrong, and yesterday I didn’t tell you but I felt like I had a vision or hallucination while I was awake, I couldn’t control it”. “Alex you haven’t eaten or slept at all, of course you’re going to feel like you’re having visions or hallucinations” Maybe she was right, I need to get some rest and eat something. Maybe then the nightmares will go away and I’ll feel better.</p>\n\n<p>I spend the rest of the day trying to keep my mind busy by reading and watching movies. I’m eating a little here and there trying to put something in my stomach. I know it makes Amanda feel better knowing that I’m eating and feeling in a better mood. We go to bed and I’m actually able to get some sleep, I slept the whole night with no nightmares at all. This goes on for two more days and I start to feel like my nightmares are all in the past. I wake up feeling better rested and with an appetite. I make myself a coffee and one for Amanda. I sit down on the couch and open up my laptop and check my emails and balance on my bank account. I check a news website and click on ‘local’ to see what’s going on around my area. The circus is in town as well as a rock band playing at “Whiskey’s” a local dive bar not too far from where I live.</p>\n\n<p>As I continued to view different links from the past few days I see a titled link that send chills down my spine, “Female jogger found murdered at Cullen Park”. The article shows that it was published three days ago. “AMANDA!” Amanda runs from upstairs “OMG, what is it? You literally scared me” “You need to read this article, this can’t be real”. I was too much of a chicken shit to read the article myself, I needed Amanda to read it and tell me that I wasn’t crazy. Maybe it was all a coincidence, maybe I saw it on the news or saw the titled article before and made up a dream about it in my head. I haven’t been myself lately. As Amanda was reading her eyes got wider and wider, the anticipation was killing me. “WHAT IS IT?!” “Don’t yell at me!” “I’m sorry, I’m sorry. This is just crazy, this is all a coincidence right?”</p>\n\n<p>Amanda’s face starts to look almost pale and terrified. “The dream you recently told me about…..it&#39;s here in this article almost to the last detail, there’s a picture of a woman. Her name is Kelly”. Amanda slowly turned the laptop screen towards me and as I saw the woman’s picture for the first time I could feel the blood draining from my face. “Holy shit, that’s the woman from my dreams!” I started to have trouble breathing, like I couldn’t catch my breath. “This can’t be real, this is so fucked up!” Amanda grabbed my face and looked me straight in my eyes “Breathe babe! Slow down your breathing, you’re ok”. I slowly began regaining control of my body by breathing slowly catching my breath.</p>\n\n<p>Amanda always knew exactly how to bring me back to reality. But I still couldn’t get the woman’s face out of my mind. “ Amanda, I know it’s going to sound crazy but I really think there’s something in my blood from the transfusion that is causing me to have these visions and dreams, it seems too real” “Ok, say I believe you. How would you even go about finding out who the original blood donor was?”. “I don’t know, maybe I can call the hospital and find out who the blood donor was or if they got their blood from another blood bank. I remember it was AB negative blood so there can’t be that many donors with that blood type” “Alex the hospital or blood bank isn’t going to give you that information, it’s against HIPAA regulations”. She was right, but I at least needed to find out what blood bank the hospital uses or if they did at all.</p>\n\n<p>I called the hospital and after getting transferred several times over I was finally able to talk to someone in the Pathology department. It turns out the hospital usually get their blood from a blood bank called ‘United Blood’. I called the blood bank and explained that I wasn’t feeling well and if they could provide the name of the donor and of course they couldn’t give me any information at all. I was getting desperate and couldn’t think of anything else.</p>\n\n<p>I called my buddy Paul to see if there was anything he could do, he was an Information Security Analyst for the Department of Veterans Affairs. Maybe he could help or knew of someone that could help me get the donors name, even if it was illegal to do so. I needed that name, maybe then I could get some answers. I know it sounds irrational but this is the only thing that makes sense right now to me. I told Paul I hadn’t been feeling well, that I wasn’t myself. We’ve been friends for a long time so I know I can trust him. He seemed hesitant at first but said he’d be willing to try and see if he could get the donors name off the blood banks registry somehow. He called me later that night as I was sitting downstairs ready to stay up all night watching movies, I was afraid after what I witnessed today I would have more nightmares. Amanda was already asleep on the long side of the sectional, she tried to stay up with me but fell fast asleep.</p>\n\n<p>I quietly moved away to and sat at the dining room table so I wouldn’t wake Amanda. I whispered “Hey Paul what’s up, sorry Amanda’s sleeping I don’t want to wake her” Paul for some reason whispered too “So I was able to get the password to the blood donor registration list, luckily the blood bank uses a Password Vault Manager that stores all their passwords for easy use” “Ok, so what did you find?” “Well I need to know what blood type you got first”. ”AB negative” I could hear Paul typing, “Ok, let me see...” I was getting impatient “Come on already!” “Hey man its ok, I found your name here. You’re not going to believe this. Your blood Donors name is Daniel and I think his address is pretty close to where you live”. I finally knew the name of my donor but that still didn’t explain everything. My nightmares, why I felt like a different person, and the fact that I saw Kelly.</p>\n\n<p>I can see her face in my mind plain as day, I can still hear her screams and reaching out for me as she was repeatedly getting stabbed over and over. Her lifeless body falling to the ground. Daniel holding that bloody knife with that black blade, smiling down at Kelly’s lifeless body……”ALEX!” Paul yelled. “What”….”Dude, I’ve been calling your name for a while now, you were just quiet and breathing really hard, are you ok?” “Yeah, yeah I’m ok. What’s the address?” “370 Harbor key Circle”. “Paul, thanks man, I really appreciate it” “No, problem bro, just get some sleep. Talk to you later.” As I hung up the phone I searched for my maps app and typed in the address. “Holy shit it’s less than two miles from here”. I didn’t mean to speak out loud, but I was just surprised at how close he lived to me. I also noticed that across the street from his house was a jogging trail that led to Cullen Park. “Is that where he killed Kelly?”</p>\n\n<p>This was all feeling like a real life nightmare, my mind was racing with so many thoughts, I didn’t even realize that Amanda had woken up and was walking my way. “Is everything ok” I looked up at Amanda who was still trying to wake up. “I just talked to Paul and he gave me the address to my blood donor, Daniel”. “Oh my god, are you serious!?” Amanda sat next to me and I handed her the phone showing the map of Daniel’s address. “This is where he lives, the park in my dreams is literally across the street from where he lives”. Amanda looked deep into my eyes “What do you want to do”. “I don’t know, I think I want to go to this guy’s house right now and see if he’s up to anything”. “You really think we’re going to see anything?” “I don’t know, it’s worth a try”.</p>\n\n<p>We both got ready to go, we didn’t know what to expect. I grabbed a small flashlight and my gun out of my small safe from under the bed. “Alex, do you think you’re going to have to use that?” “I don’t know, but it might come in handy”. We left and parked across the street from the address that Paul gave me. It was only 10:37, the park next to us was dimly lit just like in my dreams except this time there was no moonlight to light up the park. We could make out the entrance to the trail but after a 10 feet or so we couldn’t make out where the trail was anymore. After thirty or so minutes of waiting I was getting restless and couldn’t wait anymore. “What if we go walk by the trail, maybe I’ll see the same trail I did in my dreams.</p>\n\n<p>Maybe then I’ll know I’m not going crazy” Amanda was looking at me through tired and sad eyes, I was starting to think she was doubting me and thinking I was actually crazy. “Ok, let’s go. But if we don’t see anything can we just go home?”. “Yeah we can”. We made sure to quietly shut the car doors and quickly made our way over across the street onto the park, we were on the left side of the trail. I could only see two dimly lit lamp posts on the distance between the trees.</p>\n\n<p>We slowly walked in that direction in the grass as I examined every inch of what I could see around me. Amanda grabbed my arm and pulled me near her, “look”. She pointed me in the direction of Daniel’s house. We could see a male figure slowly walking out of the house and looking around as if to make sure no one was following him. ”Amanda, that’s him”. I could feel her grip on my arm tighten as she got closer to me. “Oh my god Alex, what are we going to do?” “We’re going to watch him and make sure he doesn’t hurt anyone”. For the first time in a long time I felt focused and energized, it was the adrenaline coursing through my veins. As well as Daniel’s blood, did this mean we had some sort of connection? That I could see what he was doing? There was no time to figure it out right now, I needed to stalk him and watch his every move.</p>\n\n<p>We kneeled down and hid behind a tree and watched as he quickly made his was across the street into the park, he walked on the right side of the trail just far away from us so he wouldn’t be able to see us. The darkness and the trees provided the perfect cover for us to stalk him. We slowly walked as we kept our eyes on him, we would lose him for a few seconds but he would reappear again in the shadows. He stopped behind a big tree just overlooking an open grass field and an oncoming trail field that connected to the trail we were parallel to. As I looked out into the grass field it felt oddly familiar, like I’d been there before. Daniel slowly started walking crouched down like he had seen something or someone. I looked out and couldn’t make anything out just yet, it was too far and too dark for me to see. I slowly moved closer with Amanda right behind me.</p>\n\n<p>I could hear footsteps in the distance. I whispered to Amanda “I hear someone, who the hell is out jogging this late!?” I walked up near the trail and stood behind a tree. I could make out a shadow and could hear running shoes crunching against the dirt trail. “AAAAAAAAAAAAAAAHHHHHH” Daniel had grabbed another woman as his victim. I ran towards him with all my strength wanting to save this woman. He had his left arm around her neck, I could see his right arm lifting up. There was the black blade he used to kill Kelly. The woman jabbed his ribs with her elbow and kicked his shins, grabbed his right arm just in time to prevent from getting stabbed, but Daniel punched her in the face with his left fist. She fell to the ground.</p>\n\n<p>Daniel didn’t even see me running towards him as I grabbed his right arm holding the knife and elbowing him in the face with my right elbow, we both fell hard to the ground with him dropping the knife. He got on top of me and grabbed my throat with him squeezing with all his strength, I punched him in the throat rolled him over and kneed his ribs as I got on top of him. I could hear the woman on the ground saying “MOVE IN, MOVE IN”. Daniel found his blade on the ground and as he brought it up he stabbed me in my left arm cutting me deeply. “AAAARRRHHH”, I could feel my muscle being ripped from my arm as he pushed the knife in deeper. I grabbed the knife and fought to pull it from my arm and his grip. I elbowed Daniel in the face once more as I fell onto him. I grabbed the knife from his hands and without looking I tried to stab into him, I stabbed over and over and over.</p>\n\n<p>I must’ve blacked out. When I came to I looked up to see two police officers and Amanda around me. I was on the ground laying in a pool of blood next to Daniel. He was dead. “You’re really lucky you survived” said the cop. His name tag read ‘Brian’. Amanda sat me up and hugged me tightly, “I’m so glad you’re ok, I thought you died!” I could see the tears streaming down her face “I’m ok, I’m ok”. I tried to get up but the woman jogger stopped me “You need to sit there until the paramedics get here, they’re on the way”.</p>\n\n<p>“What happened?” The woman jogger began to explain that she and the other officers were a part of an operation and she was the bait. The cops were stationed close by and when called upon they would move in and help her take down the killer. They were going to take down Daniel. “You just happened to be here late at night and saved my life”. I had to play dumb as my story would sound ridiculous, no one would ever believe me. Except Amanda. “I’m just glad I was here to help”.</p>\n\n<p>The only thing on my mind now is that fact that I know I have a killers blood coursing through my veins. I haven’t told Amanda but I actually liked the feeling when I was stabbing Daniel over and over again. Almost euphoric, my body was tingling and I felt a power I’ve never felt before. It was such a rush like a drug that I need to have. I’ve started to walk the park near my house late at night, I know I would never hurt anyone but it doesn’t hurt to fantasize.</p>\n</div>\n","author":"Kingcentaur"}