{"rank":"0","title":"Arizona trip","id":"8lpq33","url":"/r/nosleep/comments/8lpq33/arizona_trip/","time":"1527133995000","body":"<div class=\"md\"><p>It was spring break and after what seemed like an eternity fundraising, we finally had enough money to go. The flight there was incredibly boring and long. We finally get there at around 3. We drove to the place we would be staying at for the next week. The view was beautifully followed by a nice cool breeze. The day was normal and then we met up in the music room. We were not expecting to learn about the previous owner but we did.</p>\n\n<p>Her name is Gigi and she brought this land to spend her days relaxing. She was kind and incredibly giving. After the councilors gave a long bio of her...something came up. Since most of my group were super into the paranormal we asked where she died and if past students that have come to this place said they have felt her presence. </p>\n\n<p>Too much to our surprise, there have been cases of students feeling her in their rooms. They described it as chill all of a sudden along with tapping from the window. Intrigued we asked which room. It was the room the girls were sleeping in which including me. Thinking nothing of it and just assuming they were trying to scare up we all got cozy in our room. </p>\n\n<p>At 2:59 the room was filled with cold air. Since this was the first time we were miles away from our homes we, of course, stayed awake. We were surprised by the cold air. thinking that it was just because it was nighttime and maybe we just started to feel it we brushed it off. </p>\n\n<p>We were on the far side of the room away from the windows just talking....out of nowhere there was a tap on the window. We assumed it was the boys trying to scare us we called them and told them to stop...but they said they haven&#39;t left their beds and to prove it they sent a picture of all the boys in their room. We said they should stop joking and just tell us the truth.</p>\n\n<p>We started to video chat with them and they were all there in the video call when we heard another tap on the window at 3:00 am. We were scared out of our minds we open the windows and no one was out there. It wouldn&#39;t of have been possible for anyone to hide because 1 there was light outside and 2 there was nowhere to hide. Mind you we were in the middle of nowhere. We brushed it off turned off all the light and just thought it was because we were paranoid and tired. </p>\n\n<p>I am an insomniac and my medication wasn&#39;t working so I sat up and took out my camera. The room was incredibly beautiful so I took pictures. I looked back at every single one of them and they all seemed normal..until the last picture. There was a painting near the window so I took a picture, and on the window was a gold and blue ord like thing. I just brushed it off thinking it was a glare or dust I took another one from the same spot and the orb was gone. </p>\n\n<p>The chance of it being a glare is now crossed off the list of what it could have been I just through it was dust. </p>\n\n<p>at around 4 I fell asleep but I had a sleep paralysis which was not normal. Usually, I get it when the next day something bad was gonna happen. Every time I have had it, someone, I knew or my family knew died. I was also very sudden deaths... I brushed it off just thinking I was really paranoid. </p>\n\n<p>The next day when I looked at the picture again I felt weird, I threw up. I ended up looking up orbs and only spiritual orbs had to color to them that are bright and it was weirdly misshapen as well. I was somewhat convinced it was an actual orb but I was still doubting my self. We were hiking through the borderlands (places very close to the Arizona Border and Mexico). To say the least we saw the most gut turning things. </p>\n\n<p>We found shoes of little kids that were either from 2 years ago or even a few months ago. We also found a doll that looks like it has been left for maybe half a year. It was truly spine-chilling a few moments later helicopters started to circle around the land and once we left Arizona we found out they were looking for a mother and daughter that have been missing for half a year and they were found a mile away from where we found the doll.</p>\n\n<p>That night was even more strange we learned more about the previous owner and that the music room was her favorite place when she was alive and before she donated her house to this program. Us as the student were just hanging out there since it was one of the common places. All of a sudden the power went out and the posters and board games in there fell and there was a huge crash. Or at least that is what we thought. The lights turned back on 3 seconds later and....nothing was out of place. </p>\n\n<p>I took out my camera to take a picture and in the picture in the far right near the instruments, there was a light shadow. None of us could sleep that night. </p>\n\n<p>We started to hang out in her library the next day though nothing happened.....we all got strange feelings. </p>\n\n<p>The next few nights we were their blankets were pulled off beds, we all hear scratching whenever we passed the music room. even though nothing bad happened...it was sure creepy. Especially when we left the same doll we saw on the hike was in the middle of the music room when we all were there to pay her tributes then, the second adults came in...it was gone...</p>\n</div>\n","author":"Suicidal_Melody"}