{"rank":"0","title":"The Woods","id":"8lq4it","url":"/r/nosleep/comments/8lq4it/the_woods/","time":"1527138316000","body":"<div class=\"md\"><p>October 13, 2005</p>\n\n<p>&quot;C&#39;mon man are you really that scared?&quot; Said John, &quot;Well I mean you never know what will be in these woods!&quot; Shreaked Will. I never really gone in the woods of Arkansas, I really just went for family but I was with my friend John and his friends Will and Jack, we had the bright idea of going into the woods and seeing what was there. &quot;Goodness it&#39;s cold,&quot; said Jack under his breath, and I agreed with him. &quot;Look!&quot; said Will, an old tree collapsed. &quot;So what?&quot; I said. &quot;Let&#39;s go check it out,&quot; said John. </p>\n\n<p>Now a little back story to all these kids, Will was the smart guy with glasses who really loved reading and hated the heat. Jack was that kinda &#39;meh&#39; kid, but he was cool and really liked video games and school (He acted like it any way). Last but not least John, he was the dare devil of the group and loved adventure, these kids where either 11 or 12.</p>\n\n<p>We looked inside and there was a note, it had a ring of 4 kids and sang the song &#39;Ring Around the Rosey&#39; written on it. Will (being the smart one) said that Ring Around the Rosey was a devil game that kids played. &quot;Why would kids play it then?&quot; Asked Jack, &quot;To adventure and see the evil depths of hell!&quot; said John, &quot;no, it&#39;s actually a game that kids played and didn&#39;t know what they doing pretty much,&quot; said Will. <em>Crack</em> &quot;What was that?!&quot; I asked, &quot;OH CRAP RUN!&quot; screamed Will. A tree was tumbling down, <em>Boom</em> and it crashed to the ground, &quot;What the hell was that?&quot; Screamed Jack, we all turned to the tree, &quot;WHAT THE HELL IS THAT?!?!&quot; I screamed. Behind the tree was a creature with blacked out eyes, body whiter than the snow and my body (I&#39;m pale), and had the sharpest claws. &quot;RUN, GO GO GO GO GO!&quot; screamed John.</p>\n\n<p>We all ran with our hands together so we don&#39;t lose each other, &quot;WHAT WAS THAT!?&quot; Asked Jack, &quot;I DON&#39;T KNOW AND I DONT CARE JUST RUN!&quot; I screamed, we turned around and it was gone,&quot;What was that?!&quot; John asked, &quot;Will what was that?!&quot; asked Jack, &quot;I have no clue,&quot; said Will, Then we found a cave, it was like a normal cave, you know like a usual cave gloomy,and dark, but it had a weird smell like something died in it. We look and there was a man that was cut in half, Jack started to throw up, we looked on the walls and there where scratches on the wall and blood.</p>\n\n<p><em>OHHH</em> &quot;WHAT WAS THAT?!&quot; I said in a paniced voice, <em>OHHH</em> &quot;THERE IT IS AGAIN!&quot; I said. It was a moan like a mating call but more dead in the moan, &quot;OH GOD RUN!!!&quot; screamed Will, and there it was the creature whiter than snow with sharp claws and blacked out eyes, we ran out of the cave, and out into the forest. &quot;We lost it,&quot; said John. </p>\n\n<p>&quot;What the hell?!&quot; Jack said concerned, <em>Crack</em>\n&quot;NOPE, JUST RUN, RUN RUN RUN RUN RUN RUN!!!&quot; I screamed. We ran and ran as far as we could, then we finally made it to the city where we started. After we got back to the house where are parents where we told them about it, of course they didn&#39;t believe us but it was worth a shot. We all went back home. My home was hours away, the rest of the guys went back to there houses in the city. We went on, never really saw them for a couple of years, sometimes we would chat with each other online. We always remembered that creature and never went in the forest again.</p>\n</div>\n","author":"Jaxonkage1"}