{"rank":"58","title":"Another Weird Story From Backpacking Australia (Part 2)","id":"8lqb8y","url":"/r/nosleep/comments/8lqb8y/another_weird_story_from_backpacking_australia/","time":"1527140527000","body":"<div class=\"md\"><p><a href=\"https://www.reddit.com/r/nosleep/comments/8l86cr/weird_story_from_backpacking_australia/?st=JHK421TE&amp;sh=f8859ce8\">Part One</a> </p>\n\n<p>Ok so I’ve been up all around the down under, from Cairns to Perth, from Gold Coast to the Rock, but the longest I’ve stayed anywhere here was in good ol’ Sydney. Big cities always have plenty to see, and while I wouldn’t recommend staying there for a long time if you’re a backpacker, Sydney is a gorgeous city. I couldn’t even count the number of people from all over that world that I’ve met who agree that there’s nothing quite like seeing the Sydney Harbour Bridge from the shadow of the Opera House. There’s something there for everyone; Luna Park and ferry rides for families, great nightclubs and pubs for partying, museums, beaches, tours, you name it. Also, if you’re into the darker side of things, there are heaps of urban legends and bizarre happenings in the city going on for decades. </p>\n\n<p>I’ve heard all kinds of stories of weird shit going down in the city. A good friend of mine I met at work swears he saw ghost lights, like giant fireflies, circling the supports under the Sydney Harbour Bridge late at night. When he went to look up if anyone else had seen something similar, he found reports of people dying during the construction of the bridge  and being buried in the pillars.</p>\n\n<p>Later on, a flatmate told me of an unsettling  legend where sometimes, a man wearing a mask with huge horns would show up at the harbor or the city central hours before tragedy struck. He’s been sighted before fires, train wrecks, and car accidents, and is mostly know as the Devil Horned Man. Along with him, and an unbelievable amount of supposedly haunted roads, Sydney and it&#39;s sprawling suburbs are as good a place as any if you’re trying to catch a glimpse of something supernatural. </p>\n\n<p>My only real unexplainable experience in Sydney was actually in the Blue Mountains which is about an hour and a half train ride from Sydney Central. At the time I was living in a flat there and working in the city, so I had about a twenty-minute walk through a scarcely populated neighborhood to the train station then a long ride to the city center. I didn’t really mind the long commute because I could read, write, or whatever on the train, but sometimes when I would get back late at night and have to walk home, it could be a little freaky.</p>\n\n<p>The thing is that the Blue Mountain area is very much so surrounded by kind of jungly forests that, at the time, I was not used to at all. The natural landscape is seriously beautiful but relatively foreign for me. The Rocky Mountains is where I grew up and I know just about everything there is to see and avoid in the woods up there, but the Australian Bush was a lot different. So, when I first had to take a walking path that led me away from the road and a little more into the bush, I was a little nervous. Turns out I had a pretty good reason to be. </p>\n\n<p>I was at that place about a month before I saw anything, and at first,, I didn’t see anything, I just would get a bit of a weird feeling when I was walking home at night. The path I took home went along a residential street for a while, curved into the woods, then back onto the road. Where the path went into the woods, there were no lights, so I took to bringing a little flashlight with me on the days I knew I wouldn’t get home before dark. Usually, I was perfectly fine up until the sidewalk turned into a dirt path and curved into the bush. When that happened, I would get this feeling I can’t really explain. It was the feeling of being watched, but almost tangible, like whatever was watching me wanted me to know. Most of the time I could just wave the feeling off, I mean it was a pretty well-used path that people walked all the time, although only really during the day.</p>\n\n<p>After a few weeks of just general unease, during one of my night walks home, I decided I was just a little afraid of the dark, and there really wasn’t anything to worry about. Pretty much seconds after I came to believe that, I caught a bit of movement off of my peripheral vision, and my newfound confidence vanished. I quickly turned around and shined my flashlight in the direction of the movement, and scanned the brush in a panic, but couldn’t see anything out of the ordinary. The woods in the blue mountains are filled with lots of small animals; possums, quolls, all kinds of lizards, and even kangaroos, but I thought I saw something quite a bit bigger than any of those. Then I went back to thinking that I probably just imagined it, and continued a little quicker on my way. When I reached the end of the forest path, thankful for the light of the street lamps that covered this end of the road, I turned back to look the way I came. Peering into the dark bush, I got that feeling of being watched worse than I ever had before. Whatever I was trying to see was looking back at me, and for a moment, I thought I got a glimpse of the light reflecting off of something, maybe eyes.</p>\n\n<p>At this point, I was hesitant to keep walking that path at night and started trying to walk on the side of the road instead. The reason I hadn’t been walking on the road in the first place is that it makes for a bit of a longer walk, and I always worried about getting hit by someone taking the small hills that make up most of the streets around those parts way too fast. While walking on the road made me feel a lot less isolated late at night, it was still right up against the bush, and I just couldn’t shake that weird feeling.</p>\n\n<p>Not knowing what was out there was the thing that really bothered me, so I mentioned my experiences to my landlord Michael, who has lived in the Blue Mountains area going on 20 years. Michael is a pretty open-minded guy and listened to me intently. After I was done, he nodded and grinned, saying </p>\n\n<p>”Ah, it sounds like you&#39;ve been having a run in with the Panther mate, ” </p>\n\n<p>I gave him a bit of surprised look and asked him what the hell ”the Panther” was.\nHe explained to me that the Blue Mountains area has always had a bit of an urban legend about a big cat that roams around the woods at night. Confused, I asked him if it was dangerous, having always grown up wary of mountain lions and bobcats, I didn&#39;t know what to think. Michael laughed and slapped me on the back,</p>\n\n<p>”I don&#39;t think you got anything to worry about Sunshine. Even if it is real, it&#39;s been around so long, I doubt it&#39;s an actual animal. Far as I know, there&#39;s nothing flesh and blood in the bush that can hurt you, except maybe the snakes.”</p>\n\n<p>Unsurprisingly, I was not particularly reassured by that little chat, but I didn&#39;t have much choice but to make that walk. My job needed me to work nights, and I couldn&#39;t afford a car or to take a taxi every day, so I resigned myself to having to deal with it and hope that I was just a little bonkers. I did everything I could to only walk through the woods during the day, but more often than not I still had to walk along the woods most nights. </p>\n\n<p>I almost always felt uneasy at the same stretch of wood, and would occasionally see or maybe trick myself into seeing something walking deep in the forest beside me. However, it was about another two months until I saw what essentially chased me out of the Blue Mountains. </p>\n\n<p>It was a regular night; I had just worked an eleven-hour shift and had slept the train ride home, so I was walking home really drowsy. I was super tired and it was a long time since I&#39;d seen anything in the bush, so I decided to take to shorter walk through the woods. I had my flashlight with me, and at first, everything seemed alright. By then, I was used to to the weird feeling that stretch of forest always gave me, and I didn&#39;t notice anything out of the ordinary until I heard a noise out to my right, where there was nothing but woods for miles. It sounded like a soft purr that slowly got louder and then suddenly stopped.</p>\n\n<p>Startled, I turned toward the noise and shined my flashlight in the direction it came from. I didn&#39;t see anything at first, but after few seconds, I saw some movement about ten yards away from me. And then, I caught it with my flashlight, a huge pair of big, yellow eyes. At that movement, it began to move slowly towards me, and me, not being particularly courageous, began to book it down that path in the direction of my house. As I started to run, so did it, matching my pace and gaining on me, noticeable only by the soft shifting of brush and branches. It was unnaturally fast, and I knew if stayed on the path it would get me, so I did my best to barrel through the woods in the direction of the road. </p>\n\n<p>The ground underneath me was rocky and uneven and the trees posed a difficult obstacle, but I was somehow able to weave around it all using my flashlight as a guide. However, whatever it was, continued to gain until I could sense it only feet behind me. I thought I was a goner, but right as I heard it closing in, I felt the ground fall out from under me as a tumbled onto and across the road. Suddenly the slope I was sitting on filled with light as a car rounded the hill at the exact moment as something burst from the woods. It was huge, and while it was vaguely feline-like, it definitely was not a panther. Whatever it was seemed to be made out of living shadow with eyes of yellow fire, and it uttered a soul-wrenching yowl as the car, unable to slow down, hit it full on.</p>\n\n<p>The driver stopped his car with a screech of burning tires and got out to check on me and whatever it was that he hit. I was scratched up but fine, and when we went to check on the creature, we were amazed to find nothing was there. No damage on his car either, no evidence of its existence at all. The owner of the car offered me a ride home, not sure what to believe himself. I thanked him, and over the next couple of days, I arranged to move back to the city and haven&#39;t been back to the blue mountains since. </p>\n\n<p>I&#39;m not sure exactly what it was a saw, but I know that it&#39;s definitely not a part of my trip I will ever forget. I&#39;ve definitely believe that pretty much no matter where you go, you can always run into weird shit whether you want to or not. </p>\n</div>\n","author":"PotatoTruth"}