{"rank":"42","title":"Just Checking In.","id":"8lqce7","url":"/r/nosleep/comments/8lqce7/just_checking_in/","time":"1527140923000","body":"<div class=\"md\"><p>I don&#39;t know why I didnt think of posting my story on this page sooner. I tell my friends about this all the time, mostly because it&#39;s the only real &quot;creepy&quot; thing thats ever happened to me. Makes for a great conversation. </p>\n\n<p>This happened probably 4 years ago. My mother and I were sitting on the couch watching funny videos and talking, we had the whole house to ourselves. -My dad&#39;s a plumber and had gone out of town for a few days to take a licensing test or something.-  So it was just us. </p>\n\n<p>Anyways, we stayed up until about 2:30 in the morning talking about family and other things, watching FailArmy. It&#39;s a favorite in this house. And after a while decided to go to bed. </p>\n\n<p>Our rooms are right next to each other in a long hallway that connects everything in our house, my parents room is the last door on the right, and down one is mine. I gave my momma a kiss goodnight and went and layed down and started scrolling Facebook, Instagram, whatever. </p>\n\n<p>Living in a house long enough you recognize the certain sounds and creaks it makes, whether it&#39;s the old pipes clanking, the house settling, the clinks from the old air conditioner, or footsteps... \nAnd footsteps in this house were very easy to recognize. </p>\n\n<p>My house is pretty old, and the lady who owned it before us had a crap ton of cats, so to protect the baseboards of the house she layed a thick layer of plastic all through the house, underneath the carpet, so whenever you stepped not only did the floorboards creak, but the plastic crunched. </p>\n\n<p>So, back to me laying in bed, I could hear the footsepts in the hallway, and I assumed it was my mom going to get a cup of water. I didn&#39;t hear her door open, so I figured I just wasn&#39;t paying attention. I heard the footsepts come up the hall past the bathroom, and stop at my room. And then I heard my door open. She didn&#39;t say anything, and I didn&#39;t either. - My parents regularly checked on me at night to see if I was sleeping, or if I was home.- So I just thought that&#39;s what she was doing. I heard my door close and then heard the last few footsteps up to my parents room, then a long pause, followed by the door opening and closing.  </p>\n\n<p>I laid there for a few minutes.. just thinking. You know, that guy feeling when something doesn&#39;t feel right. I decided to go see if my mom needed something.  I sat up in bed and took a breath before I walked out of my bedroom, my heart was pounding. I was almost certain it was just my mom going to the kitchen, and then checking on me. I don&#39;t know why I was working myself up. I tend to over think everything, and have always been an extremely paranoid person.  I opened my door and looked into the hallway and right when I did, my parents door opened and my mom poked her head out of the door. </p>\n\n<p>We kind of just stared at each other for a minute, and then she asked me: &quot;Did you just come open my door?&quot; </p>\n</div>\n","author":"a-simplepinetree"}