{"rank":"835","title":"2nd UPDATE - Has Anyone Ever Heard of Phantom Social Workers?","id":"8lqdck","url":"/r/nosleep/comments/8lqdck/2nd_update_has_anyone_ever_heard_of_phantom/","time":"1527141273000","body":"<div class=\"md\"><p><a href=\"https://www.reddit.com/r/nosleep/comments/8jsd6s/has_anyone_ever_heard_of_phantom_social_workers/\">In 2003</a>, my mother disappeared with my six-year-old brothers, Phillip and Patrick. They left me behind. No one ever found them.</p>\n\n<p>I guess things turned out okay. I’m a therapist at a county detentions facility, where I work with violent offenders.</p>\n\n<p>Naturally I never got over my family, but eventually I got used to it. I haven’t heard anything from or about them since they disappeared.</p>\n\n<p>Until a few days ago, when I got a letter that read: <em>One is still alive.</em> An old photo of my brothers was inside, so I naturally assumed the worst and called the police.</p>\n\n<p>The day after that, <a href=\"https://www.reddit.com/r/nosleep/comments/8kqgfo/update_has_anyone_ever_heard_of_phantom_social/\">one of my patients claimed one of my brothers was dead</a>. Her name is Molly, she isn’t well, and she’s been incarcerated for years for killing her baby. She has no way of knowing anything about my brothers. But somehow she knew about them and their imaginary friend, Mr. Ball.</p>\n\n<p>Law enforcement isn’t helping, so I hired a PI. It took him a day to find out my mother’s remains had been located and identified less than two years after she disappeared. </p>\n\n<p>With that, my world came crashing down. My family isn’t out there somewhere. My mom’s dead, my brothers are missing, no one ever told me, and no one’s doing anything about it. </p>\n\n<p>I’ve been trying to change that.</p>\n\n<p>First, I unearthed my birth certificate. The PI, Dusty, told me I didn’t have a father listed, but he was wrong. The certificate read Elliott Hammon, as it should have.</p>\n\n<p>With that, my blood pressure went down a little. If Dusty was wrong about this, maybe he was wrong about other things.</p>\n\n<p>I texted him a photo of the certificate, asking him to explain. Then, the moment 8AM rolled around, I called the detective in charge of my case. His name is Moser, and so far all he’s done is ignore me.</p>\n\n<p>After a couple more failed calls, I dialed the general office number. A receptionist picked up right away. “Detective Moser is in,” she said chirpily. “I’ll transfer you.” After a minute or two, she returned to the line. “He’s with someone else at the moment.”</p>\n\n<p>I quickly tried to explain my situation. This was a mistake; I was exhausted and scared, and none of it made sense.</p>\n\n<p>“Ma’am,” the receptionist said, “if this is an emergency, call 911.”</p>\n\n<p>“I did, and they told me to call Detective Moser!”</p>\n\n<p>Sounding decidedly less cheerful, she said, “I’ll transfer you to his voicemail. How’s that?”</p>\n\n<p>“Don’t bother.” I hung up, right in time to see a text notification from Juli.</p>\n\n<p><em>Sarge approved my field trip. I told him I need to cross reference an indexing error. You good to go?</em></p>\n\n<p>Torn between uneasiness and admiration – Juli’s way too eager to break the rules, but damn if she can’t open any door – I typed back: <em>You’re a miracle worker. What time?</em></p>\n\n<p><em>Coroner will be ready for us in an hour.</em></p>\n\n<p>I drove over immediately and parked. I checked my phone – no service, figures I’d be in the only part of the city outside my coverage area. Luckily, she arrived quickly.</p>\n\n<p>I got out to meet her. She pranced over, waving a sheaf of printouts in my face. “Look what I found!” She flattened the paper against the driver side window and tapped the top of the page. “Miss Molly has related cases.”</p>\n\n<p>I fought a surge of irritation. “What does that mean?”</p>\n\n<p>“It means her baby’s death is related to four other deaths. I printed them up for my reading pleasure, and made copies for you as a professional courtesy.”</p>\n\n<p>“So…what, did she kill other kids or…?”</p>\n\n<p>“Doubt it.” For the first time, Juli looked somber. “Might be an indexing error, but interestingly enough, all their digital supplements are messed up, too.”</p>\n\n<p>“Is that usual?”</p>\n\n<p>“Yeah, at best deputies upload like half the photos correctly. The rest end up corrupted. That’s why they keep hard copies here.”</p>\n\n<p>Juli folded the papers and shoved them unceremoniously into my purse. I headed toward the coroner’s public entrance, but she pulled me around back and used her key card to waltz into the employee area.</p>\n\n<p>Within minutes, we were in the warehouse. Just for context, one of the coroner’s major duties is handling the estate of decedents. So, the warehouse was enormous: a drab grey monstrosity the size of a department store, filled to the brim with everything from boats and monster trucks to ancient desks and battered cardboard boxes of unclaimed belongings dating back to the 1920s.</p>\n\n<p>The back corner was dedicated to files. To my mild horror, their filing system consisted only of reinforced cardboard boxes marked with approximate date ranges.</p>\n\n<p>Juli grabbed a ladder and found the appropriate box in record time. It occurred to me that if I had half her drive, I probably could have solved this entire thing before I graduated high school.</p>\n\n<p>“These boxes are literally arranged backward and stacked upside down. Deputy coroners,” she complained, “are supposed to be the smart ones. If this is what our best has to offer, no wonder the agency’s in deep shit.” She hauled the box out and dropped it to the concrete floor. The booming echo made me wince.</p>\n\n<p>“Hey,” she called down, “real quick, what are the related case numbers?” </p>\n\n<p>I read them off. To my surprise, they were all old: 2003, 1988, 1973, and 1958.</p>\n\n<p>“What? Give me that paper.” She scanned it quickly. “Damn. Molly’s either a time traveler, or this really is a top-shelf index clusterfuck. Either way, we’re going to find out.” She tucked it into her shirt pocket and started hunting.</p>\n\n<p>I took a deep breath and turned my attention to the file box. It was bulging with paperwork and badly disorganized. It took several pass-throughs to locate the file for Molly’s daughter. By the time I found it, Juli had already found three of the other files.</p>\n\n<p>Now, I’d scanned the digital report just the day before. The report referred to Molly by her last name, and to the baby as “infant” and “decedent.” But never by her name. </p>\n\n<p>The coroner file, of course, had her name: </p>\n\n<p>Sarita Hammon.</p>\n\n<p>Infant child, remains recovered in at a ranch in the Tehachapi mountains with “unusual markings” on her bones. Behind the yellowing report were hard copies of the crime scene photos. Several were missing. The only testaments to their existence were scraps of paper clinging to the mangled staple.</p>\n\n<p>I hesitated, then had a look.</p>\n\n<p>The photos showed closeups of the infant’s skull and her femur. Each was clearly etched with symbols: crescents, six-pointed stars, triangles, rudimentary eyes, horns, and multiple combinations thereof.</p>\n\n<p>Juli came up behind me and dropped the final box with a deafening boom. I whirled around and gasped.</p>\n\n<p>She laughed. “Is this that bad?” She snatched the file flipped through, stopping when she saw the skull photo. “Did Molly carve that shit into her skull?”</p>\n\n<p>While Juli marveled over the sheer insanity of that file, I found the others. The 2003 box was stuffed, but the other two were only half-full.</p>\n\n<p>I started with 1958.</p>\n\n<p>My stomach dropped right to the center of the earth.</p>\n\n<p>Male child of indeterminate age, found on a ranch in the Tehachapi mountains. No photos, but the file described “unusual etchings” in his “skull, femurs, and shoulder blades.”</p>\n\n<p>His name was Peter Hammon.</p>\n\n<p>1973.</p>\n\n<p>Petra Hammon. Female child of indeterminate age, skeletal remains located in the upper elevations of the Tehachapi mountains. Perpetrator had “carved symbols into her ribs and skull postmortem.”</p>\n\n<ol>\n<li>Philippa Alder. Female child between four and seven years. Skeletonized remains “desecrated with post mortem carvings” discovered in the Tehachapi Mountains. </li>\n</ol>\n\n<p>2003.</p>\n\n<p>Philip Alder. </p>\n\n<p>For a long moment, I thought I would faint.</p>\n\n<p>Juli slammed Molly’s folder down and riffled through the others while I struggled to maintain equilibrium.</p>\n\n<p>“So what is it, like a cult thing? And two of them have your last name.” She reached for Philip’s, but I snatched it away. She gave me a very guarded look. “What’s going on?”</p>\n\n<p>That’s all it took for the dam to break. I told her everything, right down to Philip’s birth father being called Alder. Her eyes got wider every minute, and her hands slowly drifted to her mouth.</p>\n\n<p>When I finished, she said, “I don’t know if I believe you, but okay.” She crossed the floor. She was very bright against the drab grey warehouse, almost too alive, somehow. “Okay. So look, we never toss homicide evidence. We keep it all in boxes in the basement. If there’s anything left for these cases, then it’s at the property room. I’ll check it out.”</p>\n\n<p>She helped me take pictures of each file – police reports, autopsy reports, pictures, and all – before putting everything back.</p>\n\n<p>We’d barely put the last box back in place when the office manager came in. She glanced at the boxes. “Find what you need?”</p>\n\n<p>“Sure did,” Juli said. </p>\n\n<p>The manager squinted, then sighed and tapped the 1973 box. “I hate to be like this, but please put them back in the right order. This one…” she trotted several yards down, to where we’d put the 1988 box, “goes here. And vice versa.”</p>\n\n<p>“Well,” Juli said. “Since everything’s backward and upside down, that’s probably where they’re actually supposed to go.”</p>\n\n<p>I couldn’t get out of there fast enough.</p>\n\n<p>The moment I left the parking lot, my phone reception returned and I received several notifications: four missed calls, two voicemails, and two text messages.</p>\n\n<p>Feeling sick, I pulled over and checked it out. Dusty called and left a text message and a voicemail.</p>\n\n<p>Everything else was from my boss.</p>\n\n<p>More than anything, I wanted to ignore it. But I couldn’t afford to. I was on vacation in lieu of suspension. It was the absolute thinnest of ice.</p>\n\n<p>So I called her back.</p>\n\n<p>She picked up immediately and didn’t bother with pleasantries. “I need you to come in. Molly is having a breakdown because she thinks you don’t want to be her therapist anymore. She needs to see you today.”</p>\n\n<p>Excitement briefly overwhelmed me. This was it. This was what I needed. I quickly agreed and sped over to the jail.</p>\n\n<p>I heard Molly before I even stepped into the pod. </p>\n\n<p>She lay in front of her cell, rocking and screeching.  My supervisor stood nearby with a nurse and a detentions officer, anxiously watching Molly.</p>\n\n<p>This was such a massive breach of protocol, letting her writhe around on the filthy floor. Then again, it could be so much worse. At least they weren’t harming her.</p>\n\n<p>I strode over, ignoring the miserable heat in my face. This was my fault. Whatever else was going on in my life didn’t matter, not to Molly. I’d punished her for my own problems.</p>\n\n<p>And this was the result.</p>\n\n<p>I approached, wondering how the hell I’d be able to ask her about my brother with my supervisor watching.</p>\n\n<p>Fortunately, Molly saved me the trouble.</p>\n\n<p>Her screams abruptly cut off when she saw me. She sat up, palms slapping against the floor, and smiled through her tears. “I’m glad to see you. I felt bad.” </p>\n\n<p>I tried to apologize to her, but she interrupted: “Richard. Mr. Ball says his new name is Richard. Richard, Richard, Richard. Altair. Alter. Alder.” Her lip quivered. “Don’t tell on me, okay? Don’t tell them I told you.”</p>\n\n<p>“I won’t,” I said. “I would never.”</p>\n\n<p>Since my boss was listening, I made sure to loudly apologize and reiterate my commitment to her treatment. </p>\n\n<p>After a few minutes, the nurse said, “Okay, Molly. Are you feeling better now?”</p>\n\n<p>Molly nodded.</p>\n\n<p>“Then let’s let Ms. Hammon go. She has other work.”</p>\n\n<p>I stepped back, but Molly struck out and grabbed my arm.</p>\n\n<p>The nurse froze while the officer reached for his taser. </p>\n\n<p>Molly smiled, even as tears welled in her eyes. “All the world’s a stage. He’s not a player yet, but he will be. He <em>wants</em> to be.” That smile soured into a broken frown. “Don’t tell them I told you.”</p>\n\n<p>Then she let go, shuffled back into her cell, and crawled onto her bunk.</p>\n\n<p>I wrote up an incident report, then left.</p>\n\n<p>Once I reached my car, I called Dusty. He answered immediately. This was clearly not a day for phone tag.</p>\n\n<p>“Glad to hear from you. Okay,” he said. “I found Alder. Only…the name’s wrong on the birth certificates. The guy who cashed the insurance policy isn’t Michael Alder. It’s Michel Altaire.”</p>\n\n<p>“Are you sure it’s the same guy?”</p>\n\n<p>“Has to be, or he couldn’t have cashed the policy. I still have a long way to go, but here’s what I got. Ready to fall down the rabbit hole again?”</p>\n\n<p>“Sure.”</p>\n\n<p>“He’s retired. Expensive house, several vehicles, trophy wife. The wealth seems disproportionate. He was in the military for seven years, both active duty and as a psychiatrist, which doesn’t make sense for a couple reasons. The biggest one being he’s a Belgian citizen. He couldn’t have been active duty. He also cropped up out of nowhere. No birth or medical records, no college, no work other than that weird stint in the military. He didn’t own a house or have an apartment lease before 2004. Now, <em>Michael Alder</em> was a co-owner on a vehicle title. It was a van that crashed in Virginia in 1988. The driver, an as-yet unidentified male, died on impact.”</p>\n\n<p>I fought my rising temper. “Okay…?”</p>\n\n<p>“Listen. There were <em>kids</em> in the van. Boys and girls, all under age ten. No one knows where they came from or who they were. They all went into foster care. But guess what? Every last one of those kids ran away from their foster homes and that’s it. No other information. None of them ever resurfaced, none of them are working or doing anything. They’re just gone.”</p>\n\n<p>“Okay, so…what does this mean?”</p>\n\n<p>“I don’t know yet. But –”</p>\n\n<p>My temper flared. “Then why are you calling me?”</p>\n\n<p>A long pause, filled with the feverish click of the keyboard. “Please just listen. I know you’re upset. I’m sorry. This is why I like doing this in the office. But here’s the last thing. Michel Altaire only has one kid. A twenty-one-year-old son named Richard.” </p>\n\n<p>Everything around me simultaneously became too bright and too still.</p>\n\n<p>I tried to swallow, but my throat caught. I kept thinking of the files – Peter, Petra, Philippa, Philip. </p>\n\n<p>“Ms. Hammon? Are you there?”</p>\n\n<p>I tried to swallow again, and ended up gagging. That broke the spell, somehow. “Can I come in? Now? I have some things – some information -”</p>\n\n<p>“Uh…I can’t today. I’m booked for a couple days. I…how’s Thursday morning?”</p>\n\n<p>My phone gave off the distinctive chime that signals incoming text messages. </p>\n\n<p>“Yeah,” I said thickly. “I’ll be there. Thanks.”</p>\n\n<p>I hung up, and stared at the screen. My thumb hovered over the text icon for what felt like a long time.</p>\n\n<p>Finally I opened the thread.</p>\n\n<p><em>I don’t think I can save him</em></p>\n\n<p><em>I helped make him what he is</em></p>\n\n<p><em>She won’t let me tell you more</em></p>\n\n<p><em>Please come for him we love him</em> </p>\n\n<p><em>Balder 9382</em></p>\n\n<p><em>Wrong number again sorry :D</em></p>\n\n<p>And that’s it. That’s all I’ve heard for a couple days.</p>\n\n<p>I’ve been trying to find Richard Altaire online, but no luck so far.</p>\n\n<p>Dusty’s checked in from time to time, promising that our appointment will be worth the time. Detective Moser finally called back this morning and agreed to see me tomorrow afternoon. That’s good; it’ll be after I talk to Dusty. I should have a lot more information.</p>\n\n<p>But I guess we’ll see.</p>\n\n<p>In the meantime, I’ve been waiting for something, anything, from that unknown number. Texts, calls, I don’t care. Just something.</p>\n\n<p>But it hasn’t come yet. </p>\n\n<p>I don&#39;t know if that&#39;s good or not.</p>\n</div>\n","author":"Dopabeane"}