{"rank":"2","title":"The Village of Nightmare: Fisherman's Death Part1","id":"8lqpk4","url":"/r/nosleep/comments/8lqpk4/the_village_of_nightmare_fishermans_death_part1/","time":"1527145632000","body":"<div class=\"md\"><p><a href=\"https://www.reddit.com/r/nosleep/comments/8iuldy/the_village_of_nightmare_horror_town/\">The Village of Nightmare: Horror Town</a></p>\n\n<p>Usually, I don’t read newspapers. Who does it these days anyway? But in the small village, such as the Village of Nightmare, people still use this archaic method of getting news. So, when one day I was going out, I saw a newspaper on the receptionist’s table. I took it. Don’t know why, but I just wanted to.</p>\n\n<p>On the first page, there was news about a man drowned in the river.</p>\n\n<p>Almost every week such news appear in the Village of Nightmare. However, after some week or day, or month everyone forgets about the events and the dead ones appear live again. I still can’t figure out what pattern this village has because every event of someone dying has a unique time of resetting.</p>\n\n<p>Sometimes I think about how exactly this happens. Does the person just pop out from the blue sky into the existence once again? Or does he or she appear smoothly in their bed at night bit by bit? At first, their body being transparent and then materializing more and more. This is a mystery for me just like this whole hellish place.</p>\n\n<p>But sometimes I have dreadful thoughts about me resetting again and again. Maybe I’ve died hundreds of times already, I just don’t know it. Maybe I drowned in the river as this man in the newspaper or maybe I slipped and fell from the cliff, but maybe I died in my bed from some terrible disease. There is no way of knowing it. No one who dies here remembers about him dying and no one else remembers too. I’m the one who knows about all this. But if I remember everyone who dies here then I would remember something about me dying. Wouldn’t I? I can’t really tell.</p>\n\n<p>Anyway, I would like to talk about the man who drowned in the river. This is his story I want to tell you about this time.</p>\n\n<p>After leaving the asylum, I went to my usual place at the lake where I liked to read books from the library. However, that day I read my book only afterward reading the newspaper.</p>\n\n<p>There were weird circumstances about the man’s death. He’d been fishing and had fallen from the bridge above the river. I knew that this river was shallow so how could he have drowned? But I continued to read.</p>\n\n<p>Because of the rocky river bed, he’d broken his back on some rock, and that had made him paralyzed. Without moving legs, in the strong stream of the river, he’d drowned.</p>\n\n<p>This must have been terrible. Depriving someones ability to move while in the water. Liquid streaming into the lungs while just now moving legs not obeying anymore.</p>\n\n<p>I put the newspaper aside. This was nothing unusual in this place. As I’ve said before the Village of Nightmare has a perfect pattern of killing someone; every tiny thing paces perfectly for a person to die…</p>\n\n<p>I looked over the lake. Sun rays were reflecting from its surface and playing in the little waves. Some ducks were swimming there in a leisurely manner emerging their heads into the water from time to time to pluck the seaweed. A light wind was stroking my hair and the sun was warming my body and soul too.</p>\n\n<p>A sigh came from my chest. I really didn’t want to investigate this case. No matter how badly I wanted to break the curse of the Village of Nightmare I needed to rest, to not think about all this horror. The peaceful view ahead of me was praying for oblivion. Just for a day.</p>\n\n<p>I took my romance book and opened the first page. I’d never heard of this fisherman…</p>\n\n<p>The time went by and nothing really happened in the village. As I pretended that I hadn’t heard of the man I even could imagine that everything was fine. But in reality, this man was dying again and again…</p>\n\n<hr/>\n\n<p>Peace was disturbed when someday my doctor came into the room.</p>\n\n<p>”How are you doing today, Hashimoto-san?”</p>\n\n<p>”I’m okay, Okada-san.”</p>\n\n<p>”No weird dreams, hallucinations and these sorts of things you suffer from?”</p>\n\n<p>”No, I feel great.”</p>\n\n<p>I obviously lied because I’d given up hope of someone listening to me a long time ago. No one believed that there was something seriously wrong with the Village of Nightmare.</p>\n\n<p>”Good, good,” doctor said. ”You have a visitor today.”</p>\n\n<p>”A visitor?” I was startled. No one was coming here; I had no live relatives who’d be interested in visiting.</p>\n\n<p>”Yes, a visitor.”</p>\n\n<p>”Who is he?”</p>\n\n<p>”He’ll introduce himself, but I advise you to not get too concerned about the things he’s about to say. Bad things happen all the time and you’ve got nothing to do with it.”</p>\n\n<p>Then the doctor went out and I heard behind the door that he allowed someone to see me. A man came into my room.</p>\n\n<p>He was young, a little bit older than me, I was twenty years old, and wore glasses with black, thick frames. He also had a boring gray suit with his white shirt buttoned all the way up. I immediately could tell that he wasn’t from here.</p>\n\n<p>The glasses suited him, but at the same time, they didn’t. I know it sounds weird but that was the impression he left. You see, the man looked very serious, too serious for his young age. The glasses only strengthened this position, suiting him well but making the look even more grave.</p>\n\n<p>The man looked at me with his deep, dark eyes and said, ”Hashimoto-san, am I correct?”</p>\n\n<p>”Yes, it’s me.”</p>\n\n<p>”I’m detective Takeshi Matsui.”</p>\n\n<p>”Nice to meet you, Matsui-san.”</p>\n\n<p>”I’ve come in order to ask you some questions.” He cleared his throat and started the speech. ”You probably have heard already about this, but three days ago a man died in this town. He was a local postman and loved fishing. His case isn’t complicated. The man died of falling from a bridge and drowning while he was fishing. Most likely it was an accident, at least nothing suggests otherwise.”</p>\n\n<p>I immediately could tell that the detective was talking about the poor fisherman about who I’d read in the newspaper. The weird thing about this was that I’d taken the newspaper from the reception about a month ago, but the detective came only now.</p>\n\n<p>It meant that this man had died many times already, but the last time something had changed in the flow of events. Something had disturbed the village’s great plan, causing this detective to come to see me.</p>\n\n<p>”Although there is nothing suspicious about the man’s death itself, the local police found something strange in his pocket. They called Tokyo for help and that’s why I’m here.</p>\n\n<p>”I talked to a lot of people in this town, but no one knows anything about this man Suiyama-san. Apparently, he was a very mysterious and lived alone. When I asked about who might know something, many people pointed to you, Hashimoto-san. They said that you have a lot of free time and often are taking long walks around the town. Is that true?”</p>\n\n<p>”Yes, it’s true.”</p>\n\n<p>”Okay, so I would like to ask do you know anything about Suiyama-san?”</p>\n\n<p>”I’m sorry, Mr. Detective, but I don’t know anything. The only thing I can remember is this one time I met him while going out when he was delivering the mail to the asylum. He asked me something about what to buy his daughter as a present for her birthday.”</p>\n\n<p>The detective’s eyes sparkled at that moment. ”What do you know about his daughter?” he asked. ”Have you seen her?”</p>\n\n<p>”I’ve never seen her. What about her?”</p>\n\n<p>”He doesn’t have a daughter… At least everyone thinks that he doesn’t have one, but I’m getting more and more convinced that he does.” Then Matsui-san took out of his wallet a carefully folded note. ”This is what they found on the man. Of course, this is not an original, but it bears the meaning.” He gave the paper to me.</p>\n\n<p>This is what was written in the note:</p>\n\n<p><em>I don’t know why I’m writing this. Some strong urge suddenly came to do it. Maybe because my emotions are on the edge. I know I’ll never see her again…</em></p>\n\n<p><em>This village is cursed. I know it because people are dying here again and again. No one seems to know about this, but it’s true. I don’t even know how to describe these things without sounding crazy. That’s why I decided to not tell anyone. I was afraid that I would be put inside some institution because of this. Although I don’t care about myself, I have my little girl to protect. I would like to send her away, but I’m afraid that if someone in this village finds out about her this place will kill her too. No one knows that she exists, even this fucking village itself.</em></p>\n\n<p><em>She doesn’t have a name. It’s done to protect her. I once read that curses don’t work if the name of a person is unknown. That’s why I can’t take any legal action because that would demand a name. If someone in the village gave her a name then she’d be in danger because this place doesn’t ever let you leave for real. I knew several people who left and all died terrible deaths.</em></p>\n\n<p><em>But now I think my time is up. I’m having these strange deja vus. Like events seem to have happened before. It can only mean one thing… But it doesn’t matter. What matters is that I’ll take my girl away. For three days I haven’t seen her because I had to prepare my old car which I haven’t driven for five years. Also, I had to pack her things. Tomorrow I’ll get her, drive away from this place and leave her on the highway. Someone will definitely take care of her…</em></p>\n\n<p>My eyes widened when I was done reading. This meant that I wasn’t the only one who could sense the wicked things happening in the Village of Nightmare. This was something that proved my sanity which I even myself sometimes doubted.</p>\n\n<p>”Hashimoto-san, what are your thoughts about this? Did Suiyama-san seem delusional to you? The official police version is that the man had thought up his daughter. He was so antisocial it was unbelievable he could have a daughter. That’s why the office in Tokyo decided to let go of this case, only I wasn’t convinced.”</p>\n\n<p>”Why’s that?”</p>\n\n<p>”After finding his note, the local police rummaged the man’s house. They didn’t find any girl, and there were no documents suggesting her existence whatsoever, but there were many woman things left. Like dresses and blouses. The suitcase packed with them. Probably the thing he was talking about in his note.</p>\n\n<p>”They accounted it to that the man had done this to make his illusion of him having a daughter even more convincing. There were no fingerprints of other persons, only his own. However, would he go that far to buy tampons and food rations for two just because of this fetish? That was the reason they contacted Tokyo, but our office decided the same thing of delusion. However, I’m still not sure, something is wrong. I can feel it.”</p>\n\n<p>”I’m sorry, Matsui-san, but I can’t help you. I didn’t know Suiyama-san that well…”</p>\n\n<p>”I see… Sorry for bothering you, Hashimoto-san.”</p>\n\n<p>After a few additional courtesies, he left, leaving me thrilled; my head full of many different thoughts about all this. Dumbfounded I was blankly staring at his business card he’d left.</p>\n\n<hr/>\n\n<p>The very next day I came to Suiyama-san’s house. I didn’t know if he’d reset already, but now when I knew about him knowing what was happening in the Village of Nightmare I had to investigate what exactly he knew. Maybe I could gather some pieces of information, although I probably wouldn’t be able to save Suiyama-san.</p>\n\n<p>His house was the last house in the village’s borders. It stood further away from other houses. When I came over, it seemed quiet and abandoned, but I couldn’t see the police tape anywhere. Had the events really reset already?</p>\n\n<p>I went around the corner and saw a small garage. Its doors were closed, but I could hear noises coming from inside.</p>\n\n<p>I went to the doors and knocked, ”Suiyama-san, I know you’re there, please open. It’s Hashimoto… I’m the girl from the asylum. We met in the spring.”</p>\n\n<p>Noises behind the door ceased. I heard steps coming over.</p>\n\n<p>”What do you want?” he said behind the door.</p>\n\n<p>”Suiyama-san, I know what’s happening in this village. I came to talk to you about it.”</p>\n\n<p>A deep silence prevailed for a moment then he said, ”Of course, I know that you know about these things. You’re blabbering about them all around. That’s the reason why you’re in the asylum in the first place. And what do you want to discuss? There is nothing we can do about this.”</p>\n\n<p>My heart was beating fast. So, it was true. He really knew too.</p>\n\n<p>”But there always is some solution. Maybe we can figure something out together.”</p>\n\n<p>I heard a lock turning behind the door. Then Suiyama-san showed his face. He was a pretty bulky man, especially for Japanese. The man’s age was about forty, but his face already was adorned with little wrinkles around his eyes and mouth. These kinds of lines usually are caused by smiling, but his face was grave serious and emaciated.</p>\n\n<p>Behind him, I could see an old Toyota Corolla which he probably was trying to repair because it was lifted on the jack.</p>\n\n<p>”You don’t understand anything, girl,” he said. ”We’re not priests or exorcists. No matter what we do this place will never change, and no one is going to believe us. We’re damned, that’s the curse.”</p>\n\n<p>I was looking into his face and saw that he really had lost all his hope, but there still was his mysterious daughter. He wouldn’t be able to take her away as he’d wished to do in his note because by then he’d be dead. Of course, if this daughter was real… But I had to warn him. That was the least I could do.</p>\n\n<p>”Suiyama-san, if you don’t want to do anything, I can’t make you, but there is one thing you should know about your daughter…”</p>\n\n<p>”What are you saying?” he interrupted me. ”How do you know about her? Who told you?”</p>\n\n<p>I was confused. ”When we met in the spring, you asked me what to give her on birthday.”</p>\n\n<p>He gripped his head as if having a headache. Then he started murmuring. It seemed that he was talking to himself. ”Such a fool… such a fool I am! How could I be so careless, engaging myself in these small talks? And I tried to limit myself to only most necessary conversations.”</p>\n\n<p>”What’s the matter, Suiyama-san?”</p>\n\n<p>He ignored me and continued the murmuring. ”So, she knows now… There’s only one way how to hide this. No one can know. If someone found her, then all my life would be for nothing.”</p>\n\n<p>Suiyama-san lifted his head and looked straight at me. His eyes were bulging, blood pumping to the capillaries making them visible. These were the eyes of a madman ready for everything.</p>\n\n<p>I took a few steps back.</p>\n\n<p>”You, little bitch, why did you have to nose around?” he growled.</p>\n\n<p>I looked at his hand. He had a big wrench clenched in it. I didn’t wait any longer but turned around and ran. From the noise behind me, I knew that he was following.</p>\n\n<p>I saw a car slowly driving out of the village. The road was making a bend around a rice field. If I ran straight across this field, I could catch the car. I made my way into the field; so did he.</p>\n\n<p>I was running as fast as I could, but my feet were sinking in the moist mud in which rice grew. It made me tire fast. He was stronger, and I sensed him closing in. Few more steps and he&#39;d catch me. It probably was my end.</p>\n\n<p>Just right ahead, there was a small stake protruding from the ground. It indicated the end of the field which belonged to one family and start of another field with different owners. The stake had a red ribbon tied around it, so everyone could notice it better.</p>\n\n<p>I gathered my last strength and ran past this stake. I could almost feel Suiyama-san’s breath on my nape. Then I heard some noise and a loud thump, also cracking and mushy sound. I turned my head and saw an unpleasant view.</p>\n\n<p>Suiyama-san had tripped and fallen. The small stake had been in the way of his head. Although it wasn’t sharp, the inertia, which Suiyama-san’s body had, had been great enough for the stake to go straight through his eye into the brains and impale his skull on the back of his head. The water in the field <a href=\"https://www.sebastianwinterwriter.com/\">became red.</a></p>\n</div>\n","author":"SebastianWInter"}