{"rank":"22","title":"Dinosaurs shouldv'e stayed dead","id":"8lqujz","url":"/r/nosleep/comments/8lqujz/dinosaurs_shouldve_stayed_dead/","time":"1527147394000","body":"<div class=\"md\"><p>I’ve always been obsessed with dinosaurs.  I’ve been that way since I was a kid, and now that I have my own apartment, I have several shelves full of various dinosaur toys.  You see, I have nervous breakdowns sometimes, and it helps to have a crew of friendly faces smiling at me as I try to calm down.  Well, they’re all friendly except one toy, the <em>Carnotaurus</em>.  It was a gift from a cousin at a family reunion years ago, and every time I look at it I wonder why I haven’t thrown it out.  Its skin is a dull, muddy brown, and the paint is peeling on the tail. </p>\n\n<p>I’m not sure why the box even called it a <em>Carnotaurus</em>, They arms were too long, and the face was too flat, almost to the point of having a human-like face. This “face” was twisted into a horrific scowl, one that seemed to disapprove of everything I did around the house.  I could see it from the kitchen, the single bedroom, and the couch, and looking at it always made me uncomfortable. </p>\n\n<p>Yesterday, I had a long day at work, and I just wasn’t feeling ready to put up with his shit.  I walked over to the shelf, turned him around to face the backboard, and fell asleep on the couch to reruns of M<em>A</em>S*H.  When I woke up, I felt very stiff.  My spine felt like it was on fire, and pins and needles raced up to my neck.  Guess I can’t sleep on the couch again, I thought.  With many regretful thoughts at how old I’ve become, I stumbled over to the kitchen to make some breakfast.  </p>\n\n<p>I looked at the shelf across the room, and to my surprise, 3 of the toys were on the floor, with the <em>Carnotaurus</em> looking out at me.  Quickly, I put them back on the shelf with a shudder.  The whole thing was creeping me out, but at this point I was late for work and tried to pretend it was just a fluke.  I walked out the door with one last check to make sure it hadn’t moved.  I was almost a little surprised to see it was still in the same spot as I had left it, and yet I was relieved.  Maybe I was imagining things, or some small earthquake knocked them loose.   Anyway, I left the apartment and locked the door.  </p>\n\n<p>Nothing out of the ordinary happened at work, except for my back hurting and having to sit in an uncomfortable chair all day.  Even when I got home, everything seemed normal.  All the dinosaurs were on their shelves in their correct spots according to evolutionary order, nothing had moved.  After a short poor-man’s dinner involving Oreos and a peanut butter sandwich, I took some ibuprofen and headed to bed in my actual bed and was asleep in seconds.  </p>\n\n<p>At around 2:30 AM, I was awoken by a loud crash coming from the main room.  All four of the toy shelves had been knocked over, creating a huge mess in my normally pristine apartment.  As I bent down to clean up the debris, I noticed a putrid smell, faintly at first, but steadily growing strength, similar to how darkness gains strength in the night.  The smell was horrible, and can only be described as a cross between rotting meat and the smell of sweaty armpit after a long day of walking through sewage.  As I struggled to hold back the vomit that the sulfuric stench was inevitably going to cause, a hissing sound began to come from the shadows in the kitchen.  </p>\n\n<p>As I peered into the dark, a shape began to “unfold”, as though it were an origami swan turning into a blank sheet of paper.  The shape became that of a man, and yet not like a man, unless men have reddish brown skin that seems to shimmer in the moonlight.  The creature was naked, and yet no obscene parts were anywhere on its body.  Suddenly, it dashed towards me, and as it did so, it seemed to change.  Its arms became shorter, and yet claws extended from them.  Its feet grew bigger, and propelled it towards me at an unbelievable speed.  There was no sign of intelligence or reason behind the monster, all I could see was pure, raw hunger.  </p>\n\n<p>People often talk about being frozen in fear when terrible things appear before them, but nothing of the sort happened to me.  I bolted the fuck out of there, running for the front door.  I managed to escape and slam the door in the things face, but not before it slashed my back deeply, and I cried in pain.  Fortunately, cars move faster than evil things, and I drove as fast as I could from the scene.  I type this about 100 miles from my apartment, hoping someone knows how to stop it, or if anyone knows if it has attacked anyone else in the Atlanta area.  Please, for the love of god, don’t let it get anyone else, I think this wound is spreading.  My arms are turning black and veiny. </p>\n</div>\n","author":"Papayarrhea"}