{"rank":"51","title":"I.... I just don’t know","id":"8lrjsi","url":"/r/nosleep/comments/8lrjsi/i_i_just_dont_know/","time":"1527157309000","body":"<div class=\"md\"><p>So I’m 24 now and I work as a security officer and do all kinds of shifts. From morning shifts to the graveyard. And always I have always read these stories and I listen to them all the time so I figured I’d tell my little story. I apologize if it’s not as long as other stories. Just thought I’d share and see what happens. Thank you for listening. </p>\n\n<p>But this happened to me when I was around 5 or 6. I don’t remember my childhood too much because of past events but this ONE thing will always be embedded in my skull. </p>\n\n<p>So I use to live in Kentucky with my mom and dad in the very first house I’ve ever known. I distinctly remember the back part of the house since this is where my room was and a guest room where my grandparents normally stayed when they wanted to visit and in this case they did. I’ll do the best I can to give you a clear picture of the back part of the house. </p>\n\n<p>So there is a door that leads to a hallway and as soon as you walk in, you look to the left and it’s just a wall, look to the right there is an office, go a bit further and look right  there is a guest room and then you look left and look forward there is my room. </p>\n\n<p>As you walk into my room and look right, my bed is setup in a corner, look to the left and my desk and books and little Knick-knacks everywhere (anything a 5 year old would have on a desk). I did have a lot of books and school stuff on the desk because my mom was adamant on me being the best there was in school. I also had a projector type night light that projected light up and had a star like design that rotated around. </p>\n\n<p>Anyways, my grandparents were over and we all had dinner and played some games. My grandparents retired for the night and my parents stayed up a bit then they put me to bed and then they retired to bed as well. (Mind you my parents bedroom was on the other side of the house.) My dad puts me to sleep and turned on my night light that rotates. </p>\n\n<p>I remember falling asleep for a few hours and woke back up because I had this uneasy feeling (being 5 years old I had no clue what to think), but I had the feeling something was wrong (but I know now that this was the feeling you get when you’re being watched). </p>\n\n<p>I woke up a little groggy and I remember looking around the room and seeing a dark figure peaking around the corner. </p>\n\n<p>(I still get chills thinking about this)</p>\n\n<p>Let me try and describe this figure to you....</p>\n\n<p>I remember seeing long fingers that were wrapped around the white door frame and a pitch black face I don’t know if it had a face or not. I just remember the fingers because they were so long and the way they were wrapped around the door frame made it even creepier for me. </p>\n\n<p>He.... she.... it, was just staring. Just. Staring at me. Being 5 years old I wasn’t to sure what to think about this, so I tried to say something, but for some reason...... my voice was gone. I couldn’t speak. I could barely breathe. I tried to call out grandpa cause I thought it was him checking in on me. But it wasn’t. Instead, the figure shook it’s head no as I tried to speak. I sat there with wide eyes and just shaking. I tried again, “Grandpa!”  No sound came out. The figure again shook its head no. </p>\n\n<p>I sat there staring at it and I then tried to say go away but once again..... nothing. And the figure shook his head no. I was so scared that I tried to hide to underneath the covers but the blanket was so thick that my troubled breathing become more troublesome. </p>\n\n<p>So I poke my head back out to see if the figure was gone and guess what, it was still there just staring at me. I had no clue what to do. I tried to scream, I tried to talk, I tried to do something but I had barely any air in my tiny lungs. I remember seeing the night light just spinning star non stop. I looked over on my desk and tried to keep my mind occupied in hopes that it would go away. </p>\n\n<p>A few hours passed (I know this because I had a buzz lightyear alarm clock on my desk), I looked back over......... it was still there. Staring with it’s fingers wrapped around the door. But now....something changed.... something I didn’t see before. It was smiling. The thing was smiling at me. I tried to speak still nothing. And the thing shook it’s head no once again. </p>\n\n<p>By this time I kind of just said screw it and put my head underneath the covers and tried to fall asleep. I think I eventually fell asleep a few hours later. </p>\n\n<p>It was morning and I was awoken by my parents saying good morning. I wanted to say good morning back but I was so exhausted and so scared to do anything that I just hugged my mom so tightly and tried to say I love you but again was afraid that I couldn’t speak so I didn’t. </p>\n\n<p>At the breakfast table, my grandparents and parents were talking and then my dad asked me if I was ready for school. I was able to say yes sir I am. I felt so relieved that I could speak again and breathe. I went to ask my grandpa if that was him checking in on me last night and my grandma said, “ Oh no honey he was passed out right away.”  </p>\n\n<p>To this day I have no idea what that figure was or why it was there. If anyone has any ideas please let me know. </p>\n\n<p>Again thank you for listening and sorry if grammar sucks. It’s 5am and I’m on the graveyard shift. </p>\n</div>\n","author":"BLazeking558"}