{"rank":"666","title":"My Sex Dolly’s Are Saving The World.","id":"8lrkbo","url":"/r/nosleep/comments/8lrkbo/my_sex_dollys_are_saving_the_world/","time":"1527157481000","body":"<div class=\"md\"><p><a href=\"https://imgur.com/gallery/pQCqwUx\">F</a>or the past ten years I’ve been making and selling sex dolly’s for one soul purpose, to save the world. You might not think this is life saving but I will explain further later. Now my sex dolly’s are not your average fleshy delights that you can find on the internet by any means. Mine are special and as such I only supply to a select few</p>\n\n<p>I got the idea when my daughter came to work on a, “bring your daughter to work day.” I can’t actually tell you what I do for a living, but I can say that at that particular time I was experimenting on a new molecular substance for the government, the substance - let’s called it Compound C-O-3-11-R-15-20 - had the same consistency as the lubricant used for sexual experiences. </p>\n\n<p>As labs can be quite dangerous places, we only went down there for a few minutes at the end of the day, just to show my little four year-old girl the cooler part of my job and the badass equipment that we use. </p>\n\n<p>That night I sat and watched the TV after dinner and was shocked when the news anchor told us a recent static. The child-sex attack rate had sore in the past two years and the government were at ends to stop it, so as a new law and deterrent, anyone caught for a sexual related crime was to be put on a sex offender list. Good, I though. </p>\n\n<p>Anyways. The next day I found my daughter’s dolly left on the table in my laboratory, and it got me thinking. If I could cross a flesh light sex toy with my daughter’s dolly I could make a whole new sex doll for the pedophiles out there to use in place of real children.</p>\n\n<p>Now, before you get out your pitchforks and overreact let me explain my reasoning. I don’t do this for money and what money I get after materials and deliveries goes to children’s charities to help fight the real monsters out there. I do this because, I theorised that by supplying what these prevented scummy bastards needed, it would stop them from snatching our children and destroying the young lives of numerous innocents. </p>\n\n<p>And I’m pleased to announce that I was correct. Within my first year of manufacturing these sex dolly&#39;s the child-sex attack rate in my city alone dropped by four percent. It’s wasn’t a lot but it was working. The second year I estimated a drop of double that at fifteen percent. </p>\n\n<p>I told a few of my good friends and started to distribute to them in different cities, and over the years that network has grown. Now I - I mean - we, have collectively supplied over one hundred thousand sex dollys to the low life’s that needed them the most and have recorded a overall dropped of fourth-seven percent in a 150 mile radio within our areas. </p>\n\n<p>It’s funny how these life changing ideas can come from obscure places. Just a on market sex toy, a child’s dolly and my gel like lubricant that once exposed to air will eat through steel. </p>\n\n<p>Like I said. I’ve been sending my sex dollys to those who need them the most and they’ve been saving the world.</p>\n\n<p><a href=\"https://www.facebook.com/granthintonauthor\">X</a></p>\n</div>\n","author":"granthinton"}