{"rank":"25","title":"A Pale Death I Don't Deserve","id":"8lrs6y","url":"/r/nosleep/comments/8lrs6y/a_pale_death_i_dont_deserve/","time":"1527160112000","body":"<div class=\"md\"><p><em>God, It&#39;s such a mess.</em></p>\n\n<p>Trash and rotten piles all about my home. The mountains of filth pressed against the ceiling, the pathways throughout my home narrow and dangerous. Clutter infested every cubic inch of the place, the stench of breeding and rotting rodents wafting into the insect-laden air. To breathe here is to choke on flies and the putrid stink of 8-year-old trash bags long torn open from the weight of their brothers and sisters crushing them against the floor. </p>\n\n<p>I can&#39;t say I haven&#39;t tried to clean it, but I will say I won’t. When you&#39;ve tried as many times as I have you realize some things are cursed to be stagnant. Like the inflatable pool you filled eight years ago, which now just sits mere feet from your nicotine-covered porch, algae and mosquitoes thriving in the summer heat. Time froze here, and as the world kept moving, it kept leaving things behind, things that stay here with me. Home with me.</p>\n\n<p>But god, it&#39;s such an awful mess. </p>\n\n<p>What are the cleanest things in life? </p>\n\n<p>Air is filled with the smog of pheromones and spores, pollution from flora and fauna and man alike. It may be clear, but just like pond water with deadly amoeba it isn&#39;t clean. Water is absolutely rancid with bacterium and trace minerals. We treat it with our cleaning chemicals and boil it but water is sticky and it loves poison. Soil is of course nothing but filth itself. Critters and roots and death.</p>\n\n<p>The only element that is clean is flame. The righteous fires of red leave nothing behind but ash and soot, barren wastes that leave no hold for the molesting and the multiplying for what some call a lifetime. Even man is cleansed of its sins in fire. Why else is hell aflame?</p>\n\n<p>I wasn&#39;t going to squeeze past the broken furniture again. I haven&#39;t had what felt like a good clean from my mildewy, rusted shower in years. I&#39;m so filthy. </p>\n\n<p><em>I&#39;m the mess.</em></p>\n\n<p>I reached into the bedside stack, carefully plucking the only object I needed from the ancient coat that for four years it had called home. I lit the match.</p>\n\n<p>I sat up in the squeaking mattress and sent the stick into the corner of my dilapidated bed frame. I lit another one, and tossed it behind me. Again and again, I spread the best custodians on the planet after my mess, until the box was empty and my home was hot with the red fires I so desperately loved.</p>\n\n<p>The mess burned. The rot burned. And I burned. Above the sound of the sirens and the screaming mice was my laughter, for I was <em>finally</em> cleansed of the prison I&#39;d stacked around myself. Eventually the heat burned my eyes, and all I could see was the char of my own burnt flesh as it coiled into ash. Blinded by the darkest cleanse I could manage.</p>\n\n<p>And just like that I laughed myself awake.</p>\n\n<p>I howled in despair. I was tired of the dreams, I was tired of the mess, I was tired of being disappointed I was still breathing. I stood in what little room my pathway between the stacks allowed and twisted my unwashed arms into opposing walls of decay and clutter, and pulled them toward my chest.</p>\n\n<p>The piles crumbled, crushing me under years of regret and anguish, the memories I tried to cling on to to forget <em>her.</em> To bury <em>her.</em> I felt my ribs splinter and my bones crush, the fantastic popping of blood vessels bursting and organs rupturing, until finally a container of overdue books crashed into my skull and crushed it thin.</p>\n\n<p>Again, I awoke laughing.</p>\n\n<p>How many times has this been a dream? How much longer until I can truly end my pitiful existence?</p>\n\n<p>Again and again, I flashed it away. Again and again, I awoke uncharred, uncrushed, unbroken. And I couldn&#39;t destroy the rot. The memories. <em>Her.</em> Eight years of missing <em>her,</em> eight years of filling the void with useless trinkets and trash and collectables and unpaid bills. The reminders of a life I chose to waste can&#39;t go away, won&#39;t go away. </p>\n\n<p>This time I&#39;d try something new, because burning to death wasn&#39;t fun anymore. I punched a hole in my rotting ceiling, and earned a mouthful of spores and dust and vermin shit. I choked to death.</p>\n\n<p>To think I ever wanted to be a father. My son would be seven years old by now. I wish the memories would die with me.</p>\n\n<p>This time I walked outside and drowned myself in the pool. The algae almost tastes sweet.</p>\n\n<p><em>Alan, the baby hasn&#39;t kicked in a week. I don&#39;t think he made it.</em></p>\n\n<p>I should have been there for you after that. I couldn&#39;t stand the sight of you instead. All I could see was rot. And now it surrounds me again, now I can see it and it won’t leave, not like you.</p>\n\n<p>Forgiveness is a fire that I&#39;ve never liked the color of. It&#39;s pale and undeserved. I can&#39;t deny the efficacy of its cleansing power, but you can&#39;t strike a match with a happy ending.</p>\n\n<p>But now I&#39;ve died two thousand deaths, and the itch of disgust and despair are growing numb. Maybe I should. The next time I wake up, I&#39;m going to fall asleep and really try to dream.</p>\n\n<p><em>I don&#39;t think he made it.</em></p>\n\n<p><em>Oh god. Oh no, oh god-</em></p>\n\n<p><em>We will pull through, Alan.</em></p>\n\n<p><em>Do you think we should… try again?</em></p>\n\n<p><em>I don&#39;t know.</em></p>\n\n<p>That&#39;s not what really happened. I blew up at her. Blamed her for the child&#39;s death, kicked her out of my home. I was going to propose that day. I should&#39;ve done it when I found out she was pregnant but I kept putting it off. I used to be so goddamn nervous.</p>\n\n<p><em>I don&#39;t think we have to try again, Amy.</em></p>\n\n<p><em>Neither do I.</em></p>\n\n<p><em>I don&#39;t think this is your fault.</em></p>\n\n<p><em>Then why did you abandon me?</em></p>\n\n<p>She caught me off guard. This was my dream, my relief. But maybe this means I&#39;m on the right track.</p>\n\n<p><em>I was angry at you. I thought you killed the child. I realized that I was wrong a long time ago.</em></p>\n\n<p><em>Is that enough to forgive yourself?</em></p>\n\n<p><em>I don&#39;t know.</em></p>\n\n<p><em>Then it&#39;s not. What is your true sin?</em></p>\n\n<p><em>I shouldn&#39;t have tried to bury the memory. I should&#39;ve tried to rebuild. Instead I froze time, froze myself. Everything stopped and died around me and you moved on. I&#39;m sorry. Oh, god, Amy, I&#39;m so sorry...</em></p>\n\n<p><em>I know you are. But that doesn&#39;t change what you did. What you&#39;ve done.</em></p>\n\n<p><em>Forgiveness is a pale flame that turns regret to ash in the breeze. I don&#39;t deserve it.</em></p>\n\n<p><em>Then stop trying to burn your house down, you twat.</em></p>\n\n<p><em>I&#39;ve turned my home into a living hell. Maybe that&#39;s more literal than it should&#39;ve been… maybe I&#39;ve been punished enough.</em></p>\n\n<p>My tears made my cheeks warm. Amy smiled, and handed me a small white stick.</p>\n\n<p><em>When you&#39;re ready, it&#39;ll be useful to you.</em></p>\n\n<p>I awoke again. This time, I was holding Amy’s gift. A white lighter. I struck it but nothing sparked. </p>\n\n<p>Nothing leaves until you let it go. Memories can&#39;t be buried, for they are unearthed in the attempt. All that can happen is forgiveness.</p>\n\n<p><em>“Amy, I chose to push you away. You chose to leave. I chose to bury everything. And these choices didn&#39;t matter. The only choice that does is the one I&#39;m going to make. To forgive myself of my sins.”</em></p>\n\n<p><strong>Click.</strong> The lighter released a small, white flame. My face hot with the only happy tears I&#39;ve had in 9 years, I died one last time.</p>\n</div>\n","author":"Warlokthegreat"}