{"rank":"89","title":"The dogman","id":"8ls06e","url":"/r/nosleep/comments/8ls06e/the_dogman/","time":"1527162509000","body":"<div class=\"md\"><p><a href=\"https://www.reddit.com/r/nosleep/comments/8m1rhv/the_dogman_update/\">Part Two</a></p>\n\n<p><a href=\"https://www.reddit.com/r/nosleep/comments/8molkd/the_dogman_final_update/\">Part Three:</a></p>\n\n<p>Part One:</p>\n\n<p>The walls of the new house crawled. Mom said it was just the heat warping the old wallpaper. We moved from Oregon to Louisiana when I was twelve, a 35 hour drive littered with gas stations and motel rooms. I missed the rain and the soft skies and our green back yard with the tire swing. I missed my Dad, left behind with the swing in Oregon. The house we moved to was on the edge of the woods, mosquitoes the only thing that stirred in the trees that seemed too tired to move in the heat. We unloaded our lives from the backseats of the car, the house a strange and echoing thing without any furniture except the kitchen appliances and the beds upstairs. We unpacked until the sky turned pink outside, sun slowly melting into the tree tops. Mom and my little sister Jamie sat either side of me on the back porch, cross legged without any chairs. We watched the light change, so different from the pale sunsets back home; then I realised that this new sky <em>was</em> home. A rustle in the long grass growing head high round the side of the clapboard house turned us away. A man walked towards us, shirt sleeves pushed past his elbows. Mom’s face lit up with recognition as he raised one hand in greeting.</p>\n\n<p>“Bill! Hi, come join us,” she said to him, standing to her feet and cocking a hip.</p>\n\n<p>“Evenin’ Lila, thought I’d come and check you and the girls were all settled.” His voice rolled with a Louisiana lilt, all bayou vowels. Me and Jamie looked at each other. Bill reached the porch and bent down to our level, hands on his denim covered knees.“Hey there girlies.” He got no reaction from us and chuckled over his shoulder to Mom, who smiled back. “Why,” he continued, “both almost as pretty as your mama here.”</p>\n\n<p>“Bill is the nice man who sold us this house,” she explained. Was she blushing? Jamie scowled, freckles scrunching on the bridge of her nose. Bill and Mom talked a while on the porch, and eventually we were sent to bed. Me and my little sister now shared a room painted white. The pink bunk-bed in our old house wouldn&#39;t fit in the car, so we now slept in the twin beds already there when we arrived, pushed to either side of the room with a cross hanging in the middle of the wall between them. We grew up sleepless and afraid in those first few days, in the dark, Mom too absentminded to fill the empty light fixtures in the house until a week after we arrived. When the sun set all that separated our bedroom from the river outside was the window, lace curtain adrift in the breeze that pushed through the gaps in the frame. Jamie, long haired and the braver of us, would watch our bedroom door every night until her eyes fell shut. Jamie was the only seven year old I knew who slept without a stuffed animal; instead she cuddled the baseball bat our Dad had given her the year before. Jamie missed her little league team almost as much as she missed him. I slept with my back to the door, terrified if I joined her I’d see something too. Jamie finally told me why over breakfast a few weeks later, milk dribbling down her chin from the Lucky Charms she was cramming into her mouth.</p>\n\n<p>“He was there again.” Mom sang softly to herself in the background as she poured more coffee. I had always loved the smell of it, had begged Mom to let me have a cup. She laughed when I spat the bitter liquid straight back into the cup. Mom hadn’t laughed much lately and the room had seemed lighter, sunshine creeping slow and hazy up the countertops in the late morning. Jamie’s words brought that dark feeling right back in, the one that kept me sleeping with my back to the door.</p>\n\n<p>“What?” Fear fluttered in my stomach but I didn’t know why. Jamie tilted her head. I was expecting her to giggle and tell me the punchline, or the story she had evidently made up. Instead she stared right at me, tucking her hair behind her ear, serious and small at the kitchen table.</p>\n\n<p>“The dogman. He was watchin’ us all night, but I wouldn&#39;t let him in.” She scrunched her nose, crushing her freckles and ran out into the back yard, Mom calling after her not to stray too far into the trees.</p>\n\n<p>“I have to drive into town to get some things. Why don’t you go with her, baby?” Mom asked me, brushing my cheek with her thumb. The thought of being on my own in the house made my skin crawl so I ran after Jamie, back door still swinging. She was standing right on the edge of the grass, rusted chain link fence marking the border between our house and the woods. She was staring into the trees, so still I had to look twice to see if she was breathing. The air hung silent. I reached for her, suddenly afraid if I didn’t touch her she would never move again and I’d be left alone.</p>\n\n<p>“Jamie!” I called, hands outstretched like I was praying. She turned suddenly, hair falling into her eyes she moved so fast. “What were you looking at?” I asked, pushing it from her face. I lifted my eyes past her, into the trees. Shadows fell dark green to the tangles of plants growing at their roots, bugs singing in the swamp grass. There was nothing else there.</p>\n\n<p>“It was the dogman Kenna. He was waving at me.” She shrugged, soft cotton of her Care Bears t-shirt slipping off one sun-brown shoulder. “I didn’t wave back.” I dragged her inside and locked the back door with the keys Mom kept on a hook by the window. Jamie argued with me the whole time, desperate to ride her bike around with the kids from neighbouring houses down the red dirt roads. I refused and kept the door locked until mom came back, even when Jamie pulled my hair. It was past dinner time when she finally came home, arms full of groceries in brown paper bags. Jamie ran to her, yelling and waving her hands. She pulled up short in the hallway before she could reach her, as Bill stepped into the kitchen with a smile, bone white.</p>\n\n<p>“Hey there girlies”, he said, dumping more paper bags on the counter. “What’s all this fussin’?”</p>\n\n<p>“Mom, mom, Jamie said she saw-“ Behind him, Jamie shook her head. Just once, but it was enough. “- something in the woods…” I trailed off. Bill laughed and ruffled Jamies hair. She ducked out from under his hand, and moved across the room to stand next to me, tucking her fingers through the belt loops in my shorts like she did when she was nervous. When she needed something to hold on to.</p>\n\n<p>Mom smiled apologetically at Bill. He chuckled, slow and loud in our small kitchen. Outside, june bugs twirled through the night air.</p>\n\n<p>“I’m sure these two jus’ saw a critter or a hunter after it out there in the woods. Nothin’ to concern yourself with Lila,” he said. He stayed for dinner that night and sat on the porch with mom long after we were sent to bed. I woke up in the blue dark, sheets sticking to my back. I needed water. I looked for Jamie, curled around her baseball bat, hair a tangle of blonde on the pillow. I turned to the door way. Mom would leave the now replaced hall light on for me at night, knowing I was scared of the dark but too proud to admit to at twelve. Silhouetted in the yellow was the figure of a man. Its body was tall and filled the frame, nothing out of the ordinary, except for the fact that it was standing there. But its head. Like a wolf, outlined in the dark. Two white eyes stared at me, passive and still. I could hear it breathe, panting. Like a dog.</p>\n\n<p>Footsteps on the stairs stopped half way, tell tale creak of the old boards. Too scared to do anything but lie still, I fell back asleep, uneasy. My pillow still smelled like the detergent mom used back home. I dreamed of running through the woods in my bare feet. I told no one. Every night Jamie still watched our bedroom door, green eyes wide in the dark. And now I joined her.</p>\n\n<p>The days kept coming, sun drenched and slow. Jamie, loud and brave with dirt under her nails, made friends with the kids in the houses around us and everyday would run wild with them in the woods, warnings from parents about the dangers of the river always ignored. I spent my days with the boy who lived in the one-story house opposite us. Jake. He was soft spoken and a year older than me. We met when his mom, Amy, banged on our door one Wednesday afternoon, dragging him by the hand. She had an infectious laugh and and would often come over unannounced after that, bringing mom sweet tea and cigarettes. They would sit on lawn chairs and talk until the moths came out to kiss the porch lights. Jake loved to draw and I would sit with him for hours by the river, watching him capture the catfish that dreamed beneath the surface, or the dragonflies with their hum of wings. Louisiana was growing on me and Jamie, finally settling in amongst the hazy summer nights and cricket sounds. That was until she disappeared.</p>\n</div>\n","author":"Coney-IslandQueen"}