{"rank":"180","title":"Canadian Paranormal Encounters: The Man with the Hat","id":"8ls3du","url":"/r/nosleep/comments/8ls3du/canadian_paranormal_encounters_the_man_with_the/","time":"1527163429000","body":"<div class=\"md\"><p><em>This is the fifth instalment of a series where I investigate real paranormal encounters in my home and native land. You can read the first three instalments here: <a href=\"https://redd.it/8jblkr\">Panic at Manic-5</a>, <a href=\"https://redd.it/8jkzyz\">Vision in the Rare Books Collection</a>, <a href=\"https://redd.it/8jwfma\">The Spectres of Sparks Street</a>, and <a href=\"https://redd.it/8l9pt5\">Last Ride of the Night</a> . These encounters are all stand alone, so you can also jump in any time without needing to read the rest.</em></p>\n\n<hr/>\n\n<p>I’ve got to say, for some reason, this next story really shook me…which is kind of odd, given I was twice removed from the events. What I mean by that is that I didn’t even hear about it from the source, I heard about it from his widow. I really hesitated on sharing this one with you guys since I couldn’t interview the person it happened to, but it was too creepy not to share it, so here it is.</p>\n\n<hr/>\n\n<p>“There’s a man with a hat staring at me from the sidewalk.”</p>\n\n<p>Ashley, Johnathan’s widow, remembered him speaking those exact words. It’s not that they were so striking or so outside the norm that she committed them to memory, but he spoke them every time she saw him over the course of an entire week.</p>\n\n<p>“That’s just the streetlight,” she’d reply patiently, as she fluffed his pillows and gave him his meds.</p>\n\n<p>“Streetlights don’t wear hats.”</p>\n\n<p>It was a game, she figured. She didn’t know what he expected from the exchange, but it had to have been some sort of game.</p>\n\n<p>He’d been diagnosed with dementia not even a year prior, after she’d started noticing little things, like him trying to eat using the wrong side of his fork. His condition had degenerated rapidly. She’d caught him cussing out a coat hanger once, and cowering in fear at the sight of their eldest son. She could usually, if not shake him from his delusions, at least calm him down. When it came to the man with the hat, there was no emotion, no wild look in his eyes, just a flat statement of fact, as though he were testing her…or maybe himself.</p>\n\n<p>Mistaking an object for something else was one thing, but no amount of books and research could have prepared her for the day Johnathan changed his tune.</p>\n\n<p>“The man with the hat is on the grass now.”</p>\n\n<p>She tried not to let her apprehension show on her face. There was nothing in the yard that could have been mistaken for a man in a hat. No streetlight, no bus, no fountain, nothing. She wasn’t afraid of the idea of the man in the hat, but of the fact that it was a sign his condition was deteriorating even further. At her age, it was tough to take care of herself and him, so she when he said that, it reinforced her fear she was going to have to place him into a care facility, and that meant <em>she’d</em> be left in that big house all alone.</p>\n\n<p>Ashley couldn’t bring herself to do it. She wanted to delay the inevitable for as long as she could, so she just calmly told him there was no man with a hat in the yard, and she continued to tell him this over and over and over again.</p>\n\n<p>“The man with the hat is by the garden now,” he said, a few days later.</p>\n\n<p>She told him there was no man with a hat.</p>\n\n<p>When the imaginary man moved from the garden to the foot of their back porch, Ashley stopped correcting Johnathan and simply pulled down the blinds. He can’t mistake anything for a man with a hat if he can’t see outside, she figured.</p>\n\n<p>Ashley checked on Johnathan a few hours later, and his usually monotone comment about the man in the hat suddenly because laced with fear.</p>\n\n<p>“The man with the hat is on the bottom step.”</p>\n\n<p>He couldn’t <em>see</em> outside, the blinds were still pulled, which was proof enough he was making it up. As the day progressed, Johnathan became more and more distraught.</p>\n\n<p>“The man with the hat is on the second step.”</p>\n\n<p>“The man with the hat is on the third step.”</p>\n\n<p>When she wasn’t in the room to hear him say it, he’d scream it at the top of his lungs until she came and acknowledged she’d heard him.</p>\n\n<p>One night, he woke up screaming that the man with the hat was at the window. She was shaken, not sure how to handle her husband. He kept repeating it over and over and over again, like a broken record.</p>\n\n<p>“The man with the hat is at the window, at the window, at the window. The man with the hat is at the window, at the window, at the window…”</p>\n\n<p>The fear in his cataracted eyes was real, but the man in the hat couldn’t be. She opened the blinds and showed him the empty window, but he insisted he could see him, and that he was staring back in anger.</p>\n\n<p>She sat at his side, trying to soothe him until he fell asleep, and come morning, she made an appointment with a nursing facility.</p>\n\n<p>“The man with the hat is in the room,” he told her, as she tried to spoon-feed him breakfast. He hadn’t been eating much, not since his imaginary friend had reached the back porch.</p>\n\n<p>She didn’t like to leave him alone, not in his condition, but they needed groceries, and none of their kids could come over and watch Johnathan. Ashley checked on him one last time before she left. He was trembling, eyes locked on the wall in front of him.</p>\n\n<p>“The man with the hat is at the foot of my bed,” he whispered, in a stressed hush.</p>\n\n<p>She promised she’d be back soon and put the phone on his bedside table. Her son, the smart one, had rigged it so that if she called, it would pick up automatically and go on speaker. Like a long-distance baby monitor, she explained.</p>\n\n<p>Ashley hadn’t been gone for even half an hour when she got this terrible feeling at the pit of her stomach, like something was wrong. She fumbled through her purse trying to find her phone, and then called home. The call connected, but before she could even say anything, she heard her husband screaming.</p>\n\n<p>“The man with the hat is standing over me!”</p>\n\n<p>His words were followed by a guttural, almost animalistic scream.</p>\n\n<p>The line cut abruptly, and when she tried to call back, she got a busy signal. She abandoned her shopping cart and drove back home, speeding the whole way there. Johnathan was already cold by the time she arrived. The paramedics soon whisked him away, and the hospital pronounced him dead of a massive coronary heart attack, unrelated to his dementia.</p>\n\n<p>Ashley doesn’t believe the man with the hat was real per se. She was quick to dismiss the idea of him being a ghost or a demon or anything of the sort. When I pressed her and asked what she thought he was, she looked out the window and went quiet for a bit.</p>\n\n<p>“You know how animals know when they’re about to die?” she asked, not giving me time to answer, “My cats all found a warm little space to die when their time came. Maybe they can <em>see</em> death coming. Their bodies know it’s time, and it makes them see something so they know to get ready. Maybe every living thing has their own version of man in a hat, but most of us can’t see it.”</p>\n\n<p>Maybe <em>that’s</em> what the reaper is. Not a monster, not an entity come to take you away, but a vision – a sign – we see on the highway of life, letting us know it’s time to get off at the next exit.</p>\n</div>\n","author":"manen_lyset"}