{"rank":"61","title":"Dr. Coffman's Miracle Cure","id":"8lsgr1","url":"/r/nosleep/comments/8lsgr1/dr_coffmans_miracle_cure/","time":"1527167011000","body":"<div class=\"md\"><p>I don’t remember how I heard about Dr. Coffman’s wellness clinic. Probably from a blog or Reddit post during one of my many late-night hunts for a solution to my problems. I’ve always been sick. Ever since I was a child, I’ve been in and out of hospitals. Despite blood tests and CAT scans and who knows what there’s never been an explanation. Sometimes, I just double over in pain and for the next few days, I’m stuck in bed wishing I could just die already.</p>\n\n<p>Dr. Coffman was a last-ditch effort. I tried teas and Chinese remedies after medical science failed me, so why not the charming snake-oil salesman whose ads promised: “Any maladies cured with three simple treatments”? </p>\n\n<p>When I first walked into the little office inside a strip mall off Baker St., I didn’t know exactly what I was expecting. The door and windows were heavily frosted and only a small wooden sign above the door told me I was in the right place at all. The main lobby was a small room filled with comfortable, thickly-padded chairs. Against the back, a nurse’s station was manned by a pretty blonde who smiled at me as I entered.</p>\n\n<p>“How can I help you?”</p>\n\n<p>Someone burst out of the closed door next to the nurse’s station. I jumped back in a panic, catching glimpses of a man in a hospital gown stained red with blood. He was screaming something incomprehensible, a mix of words that might have been German. “Fuck!” I yelled as two hands pulled him back through the door and, just as quickly as he appeared, he was gone.</p>\n\n<p>“I’m sorry about that,” the nurse said. She wore the same smile as before and I was sure it never faltered to start with. “We treat some difficult cases. You understand. That’s why you’re here, right?”</p>\n\n<p>“Yes, sorry,” I said, my eyes locked on a dribble of blood that had somehow splattered against the wall and was now making its way to the floor. “Yes. I saw Dr. Coffman’s ads on a website. I’m hoping he can help me.”</p>\n\n<p>“I’m sure he can,” the nurse said, “Just fill out this form. You’ll hand it in to me and I’ll consult with Dr. Coffman on your case. After that, we’ll give you a call and schedule your treatment.”</p>\n\n<p>The form in question contained more than a hundred questions. There were the standard medical questions, patient information, and payment section. I filled these out without thinking about it twice, so used to filling out medical documents at that point in my life that I was on autopilot. </p>\n\n<p>It wasn’t until I hit a section subtitled History and Personality that I paused. “Excuse me. What’s this about?” I took the form up and pointed to the first question. “Have I been diagnosed with any phobias? And this one, am I currently dating or otherwise sexually involved with anyone?”</p>\n\n<p>“It’s nothing to worry about, sir. We take a holistic approach here, treating the body and mind simultaneously. It’s just a way to evaluate your current mental state.”</p>\n\n<p>Nodding, I returned to the form, answering a series of personality questions that only grew stranger as I went on. It wasn’t my first time with holistic treatments, but it was the first time I had ever been asked if I locked my windows and doors when I went to sleep at night. <em>Whatever it takes</em>. </p>\n\n<p>I turned in the form and headed home with a promise that I would hear from them by next week. </p>\n\n<p>Only three days passed before I received a call. Dr. Coffman was interested in my case, I was told, and could I come in next Tuesday? I could, and I asked if there was anything special I needed to bring. </p>\n\n<p>“No, but if you could make sure to get eight full hours of sleep the night before, it would help the process along!” She smiling nurse, even her voice smiled, told me.</p>\n\n<p>Monday came and went, and I went to bed early that night. Once upon a time, sleep was difficult to come by the night before a medical procedure. I would spend hours lying awake, running over all the worst case scenarios in my mind. By the time I turned twenty-one, it was too commonplace to worry about. I closed my eyes and drifted into a gentle, dreamless sleep. </p>\n\n<p>I woke up in the middle of the night, my muscles burning and the pain in my stomach, the very illness that sent me to doctor after doctor, had returned. It was dark and I reached toward the bedside expecting to find a bottle of pills, painkillers that were never far out of reach. </p>\n\n<p>“Shhhh,” a voice whispered, “Rest.” </p>\n\n<p>Something moved out of the corner of my eye at the same time my hand hit empty air where a nightstand should have been. I tried to focus through the haze of pain that pushed me to the verge of unconsciousness. “What?” I grunted, not sure if the words came out entirely. “Where am I?” </p>\n\n<p>The room around me was not the one I went to sleep in. White plastic hung around me, but I sensed a much larger space beyond the small square that contained the gurney I lay on. Two people shared the small make-shift room, one the blonde smiling nurse who took my form. The other was a tall, older man with black hair barely graying at the temples. Both of their faces were hidden behind surgical masks, and their eyes ignored me in favor of a strange machine sitting next to the metal bed. </p>\n\n<p>“Go back to sleep,” the nurse said, looking back. </p>\n\n<p>A fresh wave of pain hit, the muscles of my stomach convulsing and forcing me to double over in bed. Finally, thankfully, the darkness took me as my mind retreated from the pain.</p>\n\n<p>I awoke in my own bed, comfortable except for the soreness in my abdomen caused by the overnight attack. It was a familiar feeling and, in the light of day, I found myself convinced that the previous night’s strange events were simply a hallucination brought on by stress and pain. It wasn’t the first time I’d suffered such delusions, I remember thinking as a child that the pain was caused by a creature that crept from my closet at night and burrowed into my belly to steal that night’s dinner, but it was the first time in a long time.</p>\n\n<p>Still determined to put an end to my suffering once and for all, I headed to the clinic for my appointment with the enigmatic Dr. Coffman.</p>\n\n<p>The nurse greeted me with that same, now familiar smile. With the vision of that strange, plastic-wrapped room in my head the smile looked more plastic than I remembered it, but her voice was a pleasant sing-song that reminded me bad dreams can’t hurt you. I passed through the door and into a small hallway lined with perhaps a half-dozen doors.</p>\n\n<p>“Just at the end and on your left,” she told me, sending me on my way.</p>\n\n<p>The room I found there was surprisingly cozy. Not the sterile, personality-free room I was used to, but a comfortable office with a chaise lounge and rich, oak desk that looked more like a personal study than an examination room. </p>\n\n<p>Behind the desk sat Dr. Coffman. He was an older man, handsome, but not at all like I’d dreamt him. His hair was short, silver-white and professional. Not the strange, wild hair of a quack selling fake cures to the hopeless but of a man who put pride in his image and his practice. “Please, come in. Judy’s told me all about your case.”</p>\n\n<p>My muscles still screamed and I collapsed rather than sat in the comfortable, heavily padded chair across from the big desk. “You’re pretty much my last shot, doctor.” </p>\n\n<p>“Well, I’ll need to ask a few questions before we get you taken care of, but I think there’s a very good chance I’ve got just what you need.”</p>\n\n<p>“Fire away.”</p>\n\n<p>The doctor rifled through some papers, pulling out a file with my name printed in bold at the top. “You say you’ve been having these attacks since you were a child.”</p>\n\n<p>“That’s right. I was nine when the first one struck. My parents thought I was dying.”</p>\n\n<p>“And do your parents live nearby?” He asked, sitting down the paper and looking me dead in the eyes.</p>\n\n<p>I squirmed, uncomfortable despite the chair. “My mother died when I was in high school, my dad a couple of years ago.”</p>\n\n<p>“I’m sorry for your loss. Is there anyone who knows that you’ve come to us for treatment?” He stopped, noticing my panic-stricken look. “I’m sorry, that came out wrong. Is there anyone you know who could monitor your treatments when you’re not at the clinic?”</p>\n\n<p>“Uh, no. I bounce around a lot. I’m a freelance journalist, so I never stay in one place too long.”</p>\n\n<p>“Hmm, well, that’s okay. We can have Judy check in with you by phone from time to time, just to make sure everything’s going well.” Dr. Coffman stood up. “We’re going to have to draw a little blood, is that okay?”</p>\n\n<p>“Whatever you need, doc,” I said, rolling up my sleeve.</p>\n\n<p>The needle was small and Dr. Coffman surprisingly skilled. I’ve given blood often enough, usually at the hands of underpaid and overworked nurses, to know that particular talent when I saw it. The Dr. took the vial of blood and walked over to a strange curio set against the far side of the wall. When he opened it, I nearly jumped out of my chair then and there. Inside was a small, metal machine covered in lights and switches. I recognized it, how could I forget it? It was the same machine the strange doctor and smiling nurse examined in my dream.</p>\n\n<p>“The best way to fight a disease, especially one modern science can’t explain, is with the body’s own weapons,” Dr. Coffman was saying, his back turned to me. “I’m just going to separate out your blood here.”</p>\n\n<p>The machine whirred to life and, moments later, I heard a quiet ding as it stopped. Dr. Coffman grabbed a small glass bottle with a brown sticker attached to the front and held it up to the machine. It was impossible to make out what exactly happened from my seat, but the distinctive sound of liquid filling a glass container told me that he was finished.</p>\n\n<p>“Here you go.” Dr. Coffman shut the curio and crossed the room, holding out the round bottle to me. It was filled with a dark green, almost black liquid that clung to the sides of the bottle like a viscous ooze. “This should take care of you.”</p>\n\n<p>I took the bottle and read the printed label. <em>Dr. Coffman’s Miracle Cure</em>. On the back were instructions printed in small, crisp text. Take one teaspoon before bed.</p>\n\n<p>“I just take it every night? Will I need a refill?”</p>\n\n<p>“Finish the bottle and you’ll be cured, son. That’s what we do here.”</p>\n\n<p>I thanked the doctor and hurried out, clinging to the glass bottle as if it might hold the answers to all of my questions.</p>\n\n<p>So many questions. What was the machine? Had I dreamed about the strange plastic room? How did my blood hold the key to an illness that plagued only me? Was it safe? I tried to search for Dr. Coffman on the internet that night, but as far as I could tell, he never existed. No registration with the medical board, no one practicing by that name anywhere in the tri-state area. </p>\n\n<p>That night, I took my first dose of the Miracle Cure before bed and was plagued with terrible dreams. Judy, the doctor’s nurse with the plastic smile, stood over my bed with a needle far too large to draw blood. She pressed it against my stomach and, though I felt no pain, the needle pushed deep into flesh and organs before filling with a black, bile-like substance. I awoke feeling refreshed, but vague memories of those nightmares made me wonder if the cure was worse than the disease.</p>\n\n<p>Three doses and three dream-like visits by the smiling nurse later, I could not stand to sleep anymore. Instead, I sat by my window awake and waiting, skipping my nightly treatment. Nothing came. No dreams, no Judy. Throughout the night someone waited with me. A white van sat parked across from my bedroom window, its occupants not as invisible as they believed. </p>\n\n<p>As the sun rose I suffered another attack, this one throwing me to the floor. The pain was shocking and my entire body convulsed but, like all the other attacks, it subsided leaving only sore abdominal muscles and the dust bunnies staring at me from under the bed as evidence it had ever happened. By the time I pulled myself up by the window sill, the van was gone.</p>\n\n<p>Now, the bottle sits next to my bed. The attacks are coming more frequently than before, perhaps a result of my aborted treatment? If I take another swallow of Dr. Coffman’s elixir I know the pain will go away.</p>\n\n<p>There’s no way I can keep this up. The last attack lasted for hours and left me crawling even long after it was finished. If I can’t be cured, I’m sure I’ll die. And the only hope lies in the bottle with a little brown label sitting next to my bed. In <em>Dr. Coffman’s Miracle Cure</em>.</p>\n</div>\n","author":"JackBixby"}