{"rank":"2467","title":"Satan Offered Me a Job. I took it.","id":"8lskol","url":"/r/nosleep/comments/8lskol/satan_offered_me_a_job_i_took_it/","time":"1527167991000","body":"<div class=\"md\"><p>“I’m sorry, did you say Satan?”</p>\n\n<p>The young man standing on my porch nodded eagerly.</p>\n\n<p>“Yes, sir!” he said. “We have come to spread the message of our lord and savior Satan.”</p>\n\n<p>I looked from him to his companion. Both were dressed in ill-fitting white button down shirts and black slacks, with gelled up side part haircuts and slightly manic smiles. </p>\n\n<p>“Okay...” I said. “Well, I’m not really into the lord and savior thing so I think I’m gonna have to pass.”</p>\n\n<p>I closed the door only to find the young man’s foot obstructing it. I opened it back up and sighed.</p>\n\n<p>“Just a moment of your time, sir,” the young man said. “Perhaps a look at our literature could convince you.”</p>\n\n<p>The other young man lifted up his suitcase and popped open the latches. When I saw what was inside, my heart nearly jumped out of my chest.</p>\n\n<p>“Is that...real?” I asked. </p>\n\n<p>“Oh yes sir,” the first man said, “Go ahead and take a closer look.”</p>\n\n<p>I slowly reached out and picked up one of the bundles and inspected it. I’m no expert, but it certainly looked like a real stack of hundred dollar bills to me. </p>\n\n<p>I looked from the money, to the creepy but overall harmless seeming young men, and then I waved them inside. We sat down around my coffee table and there was a moment of awkward silence.</p>\n\n<p>“So uh...” I began, clearing my throat, “My name’s David. And you two are?”  </p>\n\n<p>“Oh, forgive my rudeness, sir,” the first young man replied. “I am acolyte Paul, and this is acolyte Stephen.”</p>\n\n<p>“Uh... well, would you like anything to drink?”  </p>\n\n<p>“Oh no, sir. We do not require sustenance as mortals do,”said Paul.</p>\n\n<p>“...Right,” I said. </p>\n\n<p>I picked up my half-finished beer from the night before and took a swig.</p>\n\n<p>The two young men just sat in silence, grinning at me as I drank. I coughed a little bit and the end of the beer and wiped the foam from my lips.</p>\n\n<p>“You said you came to spread a message, right?” I asked. “So what’s the message?”  </p>\n\n<p>“We’re really glad you asked,” said Paul. “Satan is recruiting for skilled labor positions in Hell, and we’ve identified you as a top candidate! Congratulations, sir--this is fantastic news for you.”</p>\n\n<p>My eyes wandered to the suitcase full of money. </p>\n\n<p>“And uh... what does this job consist of?” I asked. </p>\n\n<p>“Asking all the right questions,” Paul replied. “You’re a sharp guy, David. The details are all laid out in this contract here. Stephen?”</p>\n\n<p>Stephen produced a single piece of paper from somewhere I couldn’t see and laid it on the coffee table. </p>\n\n<p>I picked up the paper and stared at it. </p>\n\n<p>“This is a contract?” I asked.</p>\n\n<p>“Oh yes sir,” said Paul.</p>\n\n<p>“What language is this?”</p>\n\n<p>“It’s written in Old Enochian, sir, the language of angels.”</p>\n\n<p>I set the contract back down on the table.</p>\n\n<p>“Well, what’s it say?” I asked.</p>\n\n<p>“I’m sorry sir,” said Paul. “I can’t read Old Enochian. We were just instructed by our superior to deliver the contract along with your signing bonus.”</p>\n\n<p>“Signing bonus?” I asked.</p>\n\n<p>Stephen popped open the latches to the suitcase once again.</p>\n\n<p>“So you’re telling me,” I said, setting down my beer, “that if I sign that piece of paper, you’re just going to give me a suitcase full of money.”</p>\n\n<p>“Yes sir, that’s the deal!” Paul said enthusiastically.</p>\n\n<p>I took another swig of beer.</p>\n\n<p>“Got a pen?” I asked. </p>\n\n<p>Paul handed me the pen and I scribbled my name messily on the bottom of the paper, which Stephen promptly snatched up and stowed away somewhere I didn’t see. </p>\n\n<p>“Wow, that’s great,” said Paul. “I guess we’d better go now.” </p>\n\n<p>“Alright,” I said. “I’ll see you later.”</p>\n\n<p>“Very funny sir,” said Paul. “Of course I meant we three had better go.”</p>\n\n<p>“What do you mean by---”</p>\n\n<p>My voice was cut off by a roaring sound as the three of us fell through the floor. Hot air rushed past us as we fell towards a distant red glow below us. Paul and Stephen’s faces remained frozen in their manic grins as their ties flapped up and whipped  around their faces. </p>\n\n<p>We fell hard on the glowing red dirt below, sending up a cloud of dust around us. When the dust cleared I found myself in a strange cross between a cave and an office, facing a large obsidian desk behind which sat a high backed leather chair. </p>\n\n<p>The chair slowly swung around to reveal a smiling red demon in a suit.</p>\n\n<p>“Hi David,“ he said. “I’m Satan. Now let’s talk about that job.”</p>\n\n<p><a href=\"http://www.davidmaloneystories.com\">x</a></p>\n</div>\n","author":"lifeisstrangemetoo"}