{"rank":"148","title":"It followed me home.","id":"8lsmcw","url":"/r/nosleep/comments/8lsmcw/it_followed_me_home/","time":"1527168422000","body":"<div class=\"md\"><p>Something followed me home last night, and I have been locked inside my bedroom ever since. </p>\n\n<p>Let me start from the beginning, I was working the late shift at my local pizza shop last night. It was a pretty slow night, and I was exhausted and excited to clock out at 12:30. I couldn’t wait to get home and settle in with a cold beer, but I never got that chance. </p>\n\n<p>Unfortunately, as a poor college kid I can’t afford the luxury of driving. Instead, I get to hoof it the mile to and from work. Normally, I would complain about this, but it was such a nice night that I was actually happy to get some fresh air. I was enjoying my walk through the warm spring air, when I first heard it. A twig snapped in the yard next to. I stopped in the middle of the sidewalk and looked into the fenced in yard; I couldn’t see anything, but I chalked it up to some neighborhood cat and kept walking. As I walked I noticed that the air was starting to get a little colder. I rubbed my forearms with my hands and felt the goosebumps rising on my skin. Again, it was a late spring night, so I assumed the chill in the air was normal. I pushed forward, hoping to be home soon. </p>\n\n<p>BBEEEPPP!!! WOOOOOO!!!! I nearly jumped out of my skin as the sound of sirens wailed through the air. I leapt forward and sprinted about half of the block before stopping to look for the source of the sound. Sirens wailed on in the background as I realized they were coming from a car alarm about half a block behind me. </p>\n\n<p>Dumbass, I thought. I must have bumped the car as I was walking past without realizing it. I shook my head and chuckled at my own stupidity. I pushed forward, knowing that I would be home soon. </p>\n\n<p>I didn’t have the chance to take another ten steps when I saw it. Well, I saw its shadow under the moonlight. I stopped in my tracks, frozen. Out of the corner of my eye I saw something moving across the street, moving away from me. I swung my head around to meet the movement, but all I could see was a shadow disappearing behind a house across the street. I kept my eyes trained on the spot it disappeared. I tried to tell myself it was just an animal, but I knew what I saw was too big to be an animal. The shadow that disappeared behind that house seemed too big to belong to a person, let alone some type of animal. I felt like a coward, but I was scared. Something didn’t feel right. I air kept getting colder as I tried to push forward towards my apartment. The hair on my arms was standing up as I quickened my pace. </p>\n\n<p>I froze in my tracks again. There was a scrapping behind me. I want to describe the sound as nails dragging along a chalkboard, but it was somehow far worse. The screeching and scrapping was tearing into my eardrums. I closed my eyes and begged for the sound to stop. My feet were frozen in place. I felt like I was standing in quick sand. </p>\n\n<p>Finally, I took a deep breath and forced myself to turn around. I twisted myself around, as slowly as I could manage, and I saw it. </p>\n\n<p>The dark, hulking figure was coming down the street, moving slowly, but moving towards me. The creature was hunched, and I could see its spine protruding through its skin. Its knuckles were scrapping the ground as this monster drug them at its sides. My eyes grew wide. The mere sight of this creature made the sound of its scrapping knuckles seem like a distant memory. This ugly creature was stomping its way towards me. \nI could feel my breathing getting heavier and harder as I stood frozen. Almost waiting for this monster to come for me. It was like I wanted it to reach me. I couldn’t move. </p>\n\n<p>I finally snapped out of my trance. The screeching returned to my ears at full force, and I swung my hands up to my ears in a fruitless attempt to protect my hearing. I swung myself around and ran. I ran as hard and as fast as I could force my legs to move. My feet were slamming into the pavement as my heart pounded into my chest. I could still hear the screeching, but it was becoming background as I pushed myself closer and closer to my apartment. </p>\n\n<p>I finally saw the building. I pushed harder and harder, hoping to put whatever was chasing me far behind me as I slammed into the front door of the building. My body bounced off the door as I frantically scrambled for my keys. The screeching was getting closer. I needed to get inside. Finally, my key slipped into the lock, and I slammed the door behind me. I scrambled up the steps to the third floor. I sprinted down the hall and slipped quickly into my unlocked apartment. I slammed the door shut behind me and threw the deadbolt. That’s when I heard it. \nHowling. Whatever that creature was, it was angry. It was howling and howling from the street below. I put my hands to my ears and begged the noise to stop. I didn’t feel safe. Not even in my own apartment. So, I quickly moved to my bedroom and slammed the door shut. I leaned my back against the door, and slid to the ground, my hands still covering my ears. </p>\n\n<p>The howling stopped around 5 AM, but I haven’t dared to leave my bedroom. I haven’t even had the courage to look out my window. I am ashamed to admit that I am a coward, and I hope that someone here can help me. I hope that someone reading this can help me find out what followed me home last night. \nPlease. </p>\n</div>\n","author":"fearfulthrowaway2"}