{"rank":"136","title":"The Orgy Started Without Me","id":"8lss22","url":"/r/nosleep/comments/8lss22/the_orgy_started_without_me/","time":"1527169823000","body":"<div class=\"md\"><p>A mass of bodies, writhing about in pleasure — I’ve always fantasized about orgies. Unfortunately, my awkward mannerisms and less than average looks all but ensured that I’d never experience such a thing. I’ve had girlfriends here and there, but my fetish would eventually drive them away. Even I can acknowledge that I was obsessive and oppressively persistent, like a young child begging for sweets.</p>\n\n<p>Around Christmas of last year, I received an unexpected package, a small box wrapped with a red-satin bow. Inside, an invitation addressed to me from “Ken’s Den of Pleasure” for an upcoming adults-only party. Initially, I was rather sure the whole thing was a scam or some cruel practical joke perpetrated by a vindictive ex-girlfriend. After several email exchanges, I was shocked to learn that I had been invited by an anonymous VIP member — it was real.</p>\n\n<p>The party was hosted several months later at an unassuming house in rural Illinois, they explained that it was part of their commitment to discreetness and the privacy of their members. I arrived at 8 pm sharp, dressed in a red satin robe. Gravel crunched under my feet as I stepped out of my beat-up sedan, the cool spring air washing over me. </p>\n\n<p>Walking up the driveway, I could hear loud moaning and grunts echoing from inside — telltale sounds of an orgy. Thick black curtains obscured the inside from view, but I had already painted a vivid picture in my mind. Half erect, hands shaking from nervousness and excitement, I twisted the doorknob and strode in.</p>\n\n<p>To my surprise, the downstairs was barren, a decaying concrete floor sparsely filled with raggedy furniture. To my right, a flight of stairs covered in white shag carpeting led to a much more ornate upper floor. I could hear loud sounds of pleasure tumbling down from an upstairs bedroom, so I hurried up the stairs with excitement, gripping the banister tightly. Visions of beautiful, scantily clad women fulfilling my every desire flooded my brain — I couldn’t believe it was finally happening. </p>\n\n<p>My heart sank as I entered the room where I believed the orgy to be occurring, there was nothing there. In the middle of the room was a heavily stained mattress, a laptop hooked up to speakers laying precariously on top.</p>\n\n<p>A pair of large hands grabbed me from behind, flipping me to the ground. A trio of hooded figures loomed over me, peering down with expressionless faces. One assailant pulled out a curved knife from his waistband, a smile of devilish intent crossing his face. The others began chanting some unknown language in unison, voices reaching a fever pitch. </p>\n\n<p>Acting purely out of instinct, I kicked the knife wielding man squarely in the testicles. This action afforded me a brief window, which I took to scramble out of the room, down the stairs, out the door, and into my car. Feet glued to the accelerator, I left a trail of dirt and gravel in my wake as I sped furiously away. </p>\n\n<p>I’ve moved more times than I can count since that day, and no matter where I go, the invitations won’t stop coming.</p>\n</div>\n","author":"SpookBrain"}