{"rank":"55","title":"I let a demon out of a trunk and I need help.","id":"8lsxsd","url":"/r/nosleep/comments/8lsxsd/i_let_a_demon_out_of_a_trunk_and_i_need_help/","time":"1527171081000","body":"<div class=\"md\"><p>This is my fist time posting here. I have no one else to talk to about what happened, I can’t tell my friends or family. They’ll think I’m insane, or worse. Thing is, I’m at the end of my rope and I really need some advice. So I thought I ask you all for help. </p>\n\n<p>Anyway, let me start from the beginning. </p>\n\n<p>It all started when my family and I took our annual family vacation. It was me, mum, dad and my older sister. We’d decided to take a more nature based vacation this year, much to my dismay. I’m not an outdoor kindda girl, if you get my drift, but everyone else was excited and I wasn’t going to ruin their fun, so I went along. It would also be my last vacation with them before I moved out to start my masters and I wanted the quality time. The pictures of the hiking trails looked really scenic too, so I figured it wouldn’t be so bad. </p>\n\n<p>Well, I wasn’t exactly wrong…</p>\n\n<p>The trip was going great so far. We were staying at a lodge resort that catered to people wanting to spend their days hiking and taking in nature. I’m not going to name it or anything just to be safe. All you need to know is that the resort was nestled in the forest and we had our own cabin.</p>\n\n<p>I was right; the place was gorgeous. Bright blue, cloudless skies, red rock and big leafy trees, birds chirping, the whole nine yards. My family and I spent our days hiking, going on nature walks and eating the fabulous resort food. I ended the days with my legs aching form hiking, but it wasn’t as bad as I had worried it would be. </p>\n\n<p>Anyway, let me get to the meat of the matter. The resort offered tours of near by points of interest in the surrounding landscape. The tour that put me in my current situation was one I was actually looking forward to. It was a tour of these natural caves that featured huge stalactites and stalagmites. The pictures online looked beautiful so I was excited to go. My mum and I went on the tour alone as my dad and sister wanted to do something else.  </p>\n\n<p>My mum and I got to the site on time and joined a group of about twenty other people waiting to explore the caves.  We were given hard hats, neon safety vests, and flashlights and told to stick together. The caves were just as pretty as the pictures. Inside was massive and filled with towers of pale, damp rock. My mother and I were in the middle of the group as the guide took us through the cave, explaining that this was the first cave network ever discovered in the area and how ancient it was. I can’t remember details as I’d tuned out the guide in favour of just looking around.</p>\n\n<p>At this point we’d gotten to an area where the path narrowed and the ground fell away in a steep drop. A metal railing had been erected at the edge of the drop and the guide invited us to look over the edge and admire the rock formations in the valley below.</p>\n\n<p>One thing I should mention is that this part of the cave was dark. All along the path before, tiny lamps had been bolted to the wall as a way to mark the path. I guess it was also a way for people who wandered off to find their way out again. This valley of rock had no such lights though, all we could see was the faint glisten of the damp rock when we swung the flashlights around. </p>\n\n<p>At the time I considered myself lucky that I’d managed to get a spot right in front of the metal railing. Now I wish I’d hung back…</p>\n\n<p>As the guide launched into another speech I leaned against the railing and peered into the void below. It was pitch black and shining the flashlight into the space made no difference at all. At the time, leaning over such a drop with nothing in font of me but a rusty piece of metal was exhilarating in an odd way. I can’t explain it; all I know is that pressing against the metal and leaning over nothingness made my toes curl and scalp prickle. </p>\n\n<p>The boy next to me probably felt the same way. He was leaning over and staring just as intently as I. Everyone else was turned to the tour guide as he gestured to a particular rock formation further along the path, which left just the two of us pressed against the railing. </p>\n\n<p>That’s when it happened. The boy next to me suddenly lurched forward, hooking his feet onto the bottom rung of the railing so he could bend further over it. I opened my mouth to tell him to be careful when the metal let out a loud groan and shuddered. The boy leaned over even further, ignoring the protesting metal, his eyes intent on the darkness below. </p>\n\n<p>The tour guide shouted something at us as the railing shuddered and began to buckle. I let out a yelp and reached forward to grab the idiot, when the metal gave way sending us both plummeting over the edge.</p>\n\n<p>The scream I let out was inhuman as we cut through the darkness for a stomach lurching amount of time. The drop narrowed on the way down, causing me to bang into the cliff wall and roll down to the bottom, sharp rock shredding my arms and legs all the way. When I finally hit bottom, I landed hard on my side. The wind was knocked out of me and a burning pain shot down my left side. </p>\n\n<p>I don’t know how long I lay there, curled up and gasping for air. My chest was on fire and my world had narrowed to a pinprick. After what felt like an eternity I could finally inhale. The air felt sweet and I’m not ashamed to say I let out a sob or two. Slowly I uncurled and tried to sit up, but the pain I my side flared causing me to whimper and clutch at my ribs. </p>\n\n<p>After taking a few shallow breaths (breathing deep was painful) I managed to prop myself on my right arm and look around. I don’t remember what my surroundings looked like, apart from sheer rock on either side because two feet away from me was a body. </p>\n\n<p>It was boy who’d been leaning over the railing. I let out a shriek and scrabbled backward on all fours, my pain forgotten in horror. He lay sprawled on the cave floor, his neck twisted at a grotesque angle and blood pooling around his skull. I gagged as I wobbled backward. My back hit something hard and cold and I leaned against it, trying not to vomit. My ribs screamed in protest as I panted hard, struggling not to vomit on the cave floor. </p>\n\n<p>Once again I don’t know how much time passed as I lay staring at the body before me. Luckily, survival instincts kicked in and I was able to tear my eyes away and look around. That’s when I noticed something odd. </p>\n\n<p>I could see.</p>\n\n<p>To clarify, I was at the bottom of a precipice, no flashlight in sight and yet I could see the body lying five feet away with ease. I could even make out details of his shirt. I looked up, hoping I’d be able to see the tour group on the cliff above, but there was only blackness. The eerie glow illumining the area around me crept up the wall for a few feet and then abruptly cut off into pure darkness, as if someone had draped a blanket on top of the precipice. </p>\n\n<p>I frowned it made no sense. Where was the light coming from? There weren’t any lanterns mounted on the wall, no cracks in the rock, nothing. I sighed, wincing at the throb it caused my ribs and looked around again. Darkness yawned a few feet away from the body. Just like above, it was an abrupt darkness, total and absolute. </p>\n\n<p>It was then the reality of my situation hit me. I was stuck at the bottom of a precipice, injured and alone, with no idea how long it would take anyone to find me. I didn’t know whether I should stay where I was, or try to find my own way out. The thought of wandering into the darkness terrified me. As did the thought of staying holed up with a dead body. </p>\n\n<p>In the end, fear of the dark won out and I decided the smart thing to do would be to stay put, at least for the time being. I had another break down then, crying into the weird gloom. I felt calmer after, a sort of numbness coming over me. At the time I thought I was going into shock, now I think it was something else. Looking around the cave for the hundredth time, I decided to take stock of my injuries (I know I know, I should have done that earlier, but you have to understand I was in shock).</p>\n\n<p>I looked down and took stock; my left ribs were definitely injured, broken or fractured I wasn’t sure, and decided not move around too much incase I punctured my own lung. My legs were cut up pretty badly, most likely from my roll down the cliff side. I was lucky my legs weren’t broken. </p>\n\n<p>Other that I was banged up but ok. At that time I thought it was a miracle, now I know better…</p>\n\n<p>I slid off the neon safety vest, shook out what dirt I could and pressed it over the cuts on my thighs that seemed the deepest. I tried to focus on what I was doing to quell my rising panic.</p>\n\n<p>Sitting on the cold hard ground my hips and back began to ache, and here is where the shit got even weirder. I put my hands on the rock (or what I thought was rock) behind me, and pushed up slightly to shift my wait. But it wasn’t rock under my hands, oh no, it was metal. </p>\n\n<p>I twisted around as best as I could to see what was behind me and blinked at what I saw. It was a trunk…a large metal trunk wrapped in chains and sitting on the cave floor behind me. I craned my head over my shoulder to see as much as I could, then gave up and slowly and carefully turned around so I could see better.</p>\n\n<p>The trunk was about two feet long and three feet tall, thick rusty chains wrapped around its length and width, holding it shut. The huge, ornate padlock that held the chains together glinted in the dim light. My brow furrowed in confusion; how the hell did this get here and what could be inside. </p>\n\n<p>I touched the padlock; it was cold under my fingers. Not just chilled form the damp, but cold enough that I pulled back, shocked. The cave itself wasn’t that cold at all. Blood from my fingers left smears on the metal, and here’s where the weird shit hit the fan.</p>\n\n<p>The lock began to glow. I could do nothing but stare dumbfounded as the blue light spilled out from the keyhole and the crack under the lid of the trunk. The whole thing began shaking, making the chains clang loudly. I dragged myself backwards as the trunk shook harder, until it was rattling off the floor. </p>\n\n<p>Just as soon as everything started, it stopped. The trunk crashed to the ground with a loud clang and was still. I stared at it, my heart in my throat, then there was a gentle click and the padlock opened. I swallowed hard, too scared to move as the chains slowly slid away. The lid opened a crack and black mist began leaking out.</p>\n\n<p>No, leaking is the wrong word. Whatever this was, it moved with purpose, as if it were alive. </p>\n\n<p>It slid out of the trunk and paused. I had the distinct impression it was looking around, although with no eyes or discernable features I have no idea how I knew that. It began to slowly move forward, floating over the ground like some demented fog. I scuttled backwards as fast as I could, ignoring the pain in my body. The fog noticed me then and I froze as it slowly glided toward me. An inch away from my toes it stopped and seemed to regard me. I lay there panting in pain, with sweat dripping down my face.  </p>\n\n<p>Then it noticed the body behind me. I swear if the thing had ears they would have pricked. It moved away from me and glided quickly over to the poor dead boy behind me. I twisted around and watched as the fog began to cover him. </p>\n\n<p>It stopped, thinking, then it began to seep into the body through it’s eyes and nose.</p>\n\n<p>When all the fog was absorbed the body sat up.</p>\n\n<p>I think I screamed louder than I ever have in my life as the corpse slowly sat up, blond hair flopping over one eye. When he began to stand I lost it. </p>\n\n<p>Without thinking I surged to my feet, pain lanced through my legs as I staggered back a step. The creature walked toward me slowly, a wide grin spreading over its face. </p>\n\n<p>I managed to stagger a few steps back before my legs gave out and I fell to the ground hard, crying out in pain. Through blurred vision I watched the thin get closer and closer, to my surprise the grin was gone and it looked concerned.</p>\n\n<p>“Are you alright?” it said in a thick Russian accent.</p>\n\n<p>I flinched as it held out a hand.</p>\n\n<p>“Fear not, I won’t harm the one who freed me.”</p>\n\n<p>“What…what?” I whispered, staring up at the thing, man, before me.</p>\n\n<p>He grinned again, too sharp and too wide to be friendly, “You freed me, that’s what happened. You and your friend that is.”</p>\n\n<p>I blinked stupidly at him, a million questions flying around in my head, the most prominent being ‘What the fuck?’</p>\n\n<p>Stupidly, what came out of my mouth was; “He wasn’t my friend, I didn’t know him.”</p>\n\n<p>“Ah.”</p>\n\n<p>We looked at each other a moment. </p>\n\n<p>“You’re hurt,” he said, crouching down next to me and resting one hand on my bloody leg. </p>\n\n<p>I flinched again and tried to move away, but his grip was strong. </p>\n\n<p>“Let me help,” he said quietly. </p>\n\n<p>The same strange blue light from the trunk leaked out of his finger tips and glided over my leg. As it moved the worst of the cuts and scrapes healed over, leaving flawless skin behind.</p>\n\n<p>I gaped, feeling sure I’d hit my head and was currently hallucinating. </p>\n\n<p>“I can’t heal everything,” he said apologetically. “When I get us out of here it will be to hard explain how you fell off a cliff and sustained no injuries.”</p>\n\n<p>“What what are you?” I croaked, glancing from him to my leg. </p>\n\n<p>The sharp grin was back with teeth too pointed to be human. </p>\n\n<p>“I’m a demon. You may call me Ivan,” the gestured to his body, “that was his name.” </p>\n\n<p>I blinked at him.</p>\n\n<p>“Your blood set me free, we are now bound together. I shall be your guardian.”</p>\n\n<p>I blinked again. </p>\n\n<p>Miss eloquent that’s me.</p>\n\n<p>“Come.”</p>\n\n<p>He held out a hand that I hesitantly took. He smiled at me, his teeth morphing into something more human, and his red eyes turned grey. The blue light enveloped us and everything went dark.</p>\n\n<hr/>\n\n<p>I’m recovering in the hospital as I type this out on my phone. Apparently Ivan and I were found wandering down a tunnel off the precipice we had landed in. Well, he was wandering while carrying me over his shoulder. </p>\n\n<p>My mother was distraught, blaming herself for everything. She only clamed down when Ivan walked over to her and put a hand on her shoulder. I think I’m the only one who saw the blue light shining under his palm. </p>\n\n<p>‘Ivan’s’ father wants to sue the resort and he’s been talking to my dad about it. They all seem to get along surprising well. When I said as much to Ivan, he just smiled at me, his eyes flashing red. </p>\n\n<p>Ivan visits a lot. At first I was surprised that my parents let a strange boy, saviour or not, spend so much time alone in their injured daughter’s hospital room. I asked Ivan if he was manipulating them and got that red eyed smile again. I snapped at him to leave my family alone. He actually looked contrite and promised to stop. </p>\n\n<p>He keeps asking me what I want, anything at all and he’ll give it. At first I resisted, he’s a demon after all, but lately, as I’ve spent more time with him, I’m starting to waver. </p>\n\n<p>Like many people I have a list of this I wish for, trivial and serious. I mean, asking a demon for something simple shouldn’t end so badly right? It’s not like I’ll ask for something terrible, like an enemy to die or anything…</p>\n\n<p>Who knows, maybe a deal with a demon won’t be so bad.</p>\n\n<p>So here’s my question nosleep. What should I ask for first?</p>\n</div>\n","author":"VampireSherlock"}