{"rank":"14","title":"One of the Reviewees is Afraid of People","id":"8lsx0a","url":"/r/nosleep/comments/8lsx0a/one_of_the_reviewees_is_afraid_of_people/","time":"1527170905000","body":"<div class=\"md\"><p>I first noticed Rick during the second of the five preboard examinations of our review school. Our seats had been rearranged alphabetically to simulate the actual board exam and I was seated directly behind him. He sort of stood out among the 614 students because he came from a popular university; and because out of the 33 students from his school, only he decided to review here.</p>\n\n<p>During the entirety of the last day of the second preboards, Rick kept glancing at the girl beside him. Initially, anyone would get the idea that he’s attempting to cheat. But after the first subject that day I realized he wasn’t looking at his seatmate’s test paper. Rick was looking at his seatmate’s face.</p>\n\n<p>The girl was comely, but not enough to warrant a hundred stares per minute. And Rick’s expression wasn’t that of admiration—he had the quizzical look of a guy who’s seen something rather out of place.</p>\n\n<p>The next review meeting, I incidentally arrived at the review room with Rick. We were 2 of the 614 students reviewing, so I supposed neither of us expected a greeting from the other. Rick was walking ahead of me when another guy coming from inside the room almost bumped at him at the door.</p>\n\n<p>Rick’s face looked like he just saw a ghost. He gasped audibly, his veins tensing in his neck. The random guy stared at him before heading out, but Rick remained glued in his position, beads of sweat starting to form on his forehead.</p>\n\n<p>“Did you...did you just see his face?” he asked me, his voice shaking.</p>\n\n<p>I said yes as I tried to imagine what might have startled Rick. The other guy’s face was simply unimpressive—no distinguishing detail to note.</p>\n\n<p>“His eye,” Rick continued, his stare fixed at the other guy. “His eye and his noses were...wrong! Didn’t you see? Bloody pigs. They were almost the same as my seatmate during the preboards.”</p>\n\n<p>I had to laugh to show my bewilderment, but Rick continued swearing. He was actually pleading at me to understand; kept on pressing me that something was wrong with the previous guy’s face.</p>\n\n<p>I continued observing Rick that day. During the first part of the review, he kept stretching his neck as if searching for someone amongst the reviewees. When he seemed to have spotted what he was looking for, stark fear registered on his face.</p>\n\n<p>The days after that were no better. Each day, Rick seemed to grow more agitated and paranoid. He would always keep glancing around, at times muttering stuff his seatmates seemed to find incoherent. More and more reviewees got concerned about his state, but none dared approach him.</p>\n\n<p>After a week, Rick came to me.</p>\n\n<p>“Your friend, Al Justin, is it not? Why did his face become like that?” Rick asked me directly.</p>\n\n<p>“Oh. I don’t know?” I hesitated, searching for an appropriate reply. There really was, after all, nothing wrong with Al’s face. It was the same plain tomboyish look as before. “What’s wrong, Rick?”</p>\n\n<p>“His nose, his...his nose, eyes, and ear…bloody pigs,” he began stammering, eyes glued at Al, three seats away.</p>\n\n<p>“What’s wrong with his face?”</p>\n\n<p>Rick shook his head, then grabbed my pen and one of my review materials. He began drawing something on them quickly.</p>\n\n<p>“That’s his face right now.”</p>\n\n<p>Scribbled upon the sheet was a shape I knew was meant to be a head, with a crude neck supporting it from the south. What’s unsettling, however, were the features. Rick had drawn one of the face’s three eyes on a vertical position and placed it on the right cheek, the other two eyes an inch above the jaw line. Instead of ears, what appeared to be teeth jutted from the sides of the head. The drawing had no mouth, but an ear above the right eye and the nose at the corner of his left cheekbone.</p>\n\n<p>“Am I supposed to laugh?” I voiced out, although I could already feel goose bumps crawling all over my skin.</p>\n\n<p>Rick shook his head again. He grabbed the material and started sketching a second time. When he showed it to me, two more faces were added. One was obviously that of a girl’s, with the hair shoved dirtily to one side. Her two eyes were vertically placed atop her vastly misshapen forehead; her mouth, her four mouths scattered all over. A supposed nose (I never would’ve guessed if not for Rick’s talented strokes) hung inverted beneath his right cheek, while her two pointed ears crowned her brow. There were lines crossing the face which I supposed were facial creases—and protruding cysts just below one of the eyes. The next head showed noses so numerous I didn’t bother to count, surrounding an eye so big it dominated half the face. There were dots all over which I assumed were either pimples or moles, and hair striking out of the mouth placed at the side of the head.</p>\n\n<p>I inhaled loudly as Rick spoke: “That’s the girl beside me during the preboards, the one I kept glancing at. That’s the guy the other day I almost bumped into. Now, please tell me they also look like that to you.”</p>\n\n<p>“No, they don’t look like that to me,” I confessed, still expecting everything to be some sort of a joke.</p>\n\n<p>“Bloody pigs,” Rick cursed loudly.</p>\n\n<p>“May I ask if they still look like that today? Those three?”</p>\n\n<p>It was on that point I cringed. Rick chortled like a maniac, gritting his teeth dangerously. “Three? Almost half of the entire room has twisted faces now.”</p>\n\n<p>After that, I tried avoiding him. Rick didn’t seem to mind, but I still see him aggravated by every reviewee around him. I may blame stress for it—of course, the human mind can only take in so much and not bleed out. I may say Rick himself is screwed up—but he’s evidently smarter than the average reviewee. I couldn’t put anything rational to it so I decided, quite logically, that it is drugs. Which I should add is largely prohibited these days.</p>\n\n<p>Until a week after the third preboards. I was sitting with my classmates checking our preboard examination papers when I heard a commotion behind us. When we turned to look, we saw Rick being held by other reviewees. Apparently, he had hit his seatmate with his calculator square in the jaw. He was about to stab the poor guy with a pen if not for the other reviewees holding him back.</p>\n\n<p>The owner of the review center, an attorney, sent Rick home with a warning that if he ever comes back, they’ll sue him in court. Everybody theorized that, yes, he’s probably on drugs.</p>\n\n<p>What irked everyone, however, was Rick’s drawings. During the commotion, he accidently dropped some of his review materials and notebook. He never had the chance to retrieve them as the review center’s security herded him outside. During the break, one of Rick’s seatmates found his things and opened them. He then showed us Rick’s drawings—tens and tens of faces screwed up and distorted in a hundred ways. Not different from his drawings on my review materials. Curses also went with the faces, and there were a few with an inscribed name upon it.</p>\n\n<p>Our review continued its course until a week before the final preboard examinations. It was a Thursday, and we were tackling Management Advisory Services. Eight of the ten air-conditioning units were operating unusually loud, emitting a thin, wispy vapor that added another level of chill in the room. I vaguely remember Ed remarking that he needed his jacket because of the damnably low temperature.</p>\n\n<p>Then it happened. At first, I noticed I was becoming a bit groggy. The entire room was of course sleepy—hell, most of us probably slept for only 4 hours a night because of the impending final preboard exam. After another hour inside the review room my vision began to cloud; spiraling and twisting in fogs and fireworks. Another few minutes, I felt myself drowse and I surrendered to sleep.</p>\n\n<p>Little did I know, the entire 613 of us reviewees felt exactly the same thing.</p>\n\n<p>I woke up to the sound of gurgling chokes and curses. There still wasn’t proper strength in my joints, so it was a struggle to even crane my neck to look at the room. Around me were a number of heads skinned; their eye sockets, nasal cavities, and gum line scarlet and visible. The nearest mutilated reviewee to me had half the skin of her face removed and I could see the strings of muscle on her cheek outlining her molars. Her left eye had been carved out of her, and pockets of skin had been peeled from her scalp. Rick was still at work on a guy somewhere in front, brutally pulling the skin off the guy’s head using his own hands. Other reviewees were also waking up, shrieking in terror at the sight they’ve opened their eyes to.</p>\n\n<p>Up on the stage slumped that day’s lecturer, his face untouched. Beside him, however, lay three to four bodies with faces mutilated in different ways. An electric saw still whirred near them, clicking and groaning with gore.</p>\n\n<p>Further to the right I saw a headless body, its blood spurting in intervals of crimson sprays. I began to realize that it wasn’t the only headless body in the room.</p>\n\n<p>I started feeling my joints, doing my best to put back energy to my limp frame. Whatever it was he used to drug us to sleep (I later learned Rick had placed sedative drugs behind the air-conditioning units’ vents) was slowly receding from our system, and I began to feel my body. It was then that I looked up and saw Rick striding towards me amidst the bodies, some with faces, some without. He had a scalpel on one hand and an operating scissor on the other. He stopped in front of me, and cursed.</p>\n\n<p>“Bloody pigs. I couldn’t sleep. I couldn’t bloody sleep thinking of all the faces,” Rick’s body was covered with all sorts of human matter. “I had to get rid of them. I had to fix them myself. Nobody noticed except me.”</p>\n\n<p>I couldn’t say anything. My tongue twisted, daring to form coherent words but what came out were only croaks. Rick shook his head and raised the scalpel to my face.</p>\n\n<p>That was when the police arrived and tranquilized Rick. He slumped readily, his body giving in to their sedative. Seeing them enter the scene, I allowed myself back to slumber.</p>\n\n<p>It should’ve been a hell of a news for the country, but the state did not want to raise copycats amidst the chaos. I heard from the owner of the review center that incidents like this tend to create replicas out of mundane and twisted minds, and so to avoid that the police deemed the case a state secret. All of us were brought to different hospitals and were treated by different psychiatrists. The trauma it caused for most of the reviewees were substantiated by the government, and over time a large fraction of us recovered.</p>\n\n<p>Later on, the owner of the review center gave us subtle information over the incident. Out of the 613 present reviewees, only 22 died, 17 were in critical stages but were medically saved, and another 51 suffered major wounds. Recovery of the traumatized reviewees had been quick, and he half-jokingly added that “accountancy students tend to have stronger willpower”.</p>\n\n<p>I heard Rick was sent to a state mental health facility to be tested if fit for trial. Through the owner of the review center (we became friends after the incident), I learned that Rick was then taken to a more accredited mental hospital in Metro Manila. The psychological profile the doctors had about him were largely absurd—Rick did not suffer from any mental disorder, he wasn’t on drugs, all of his hormones were perfectly normal, and he even came from a good family. There was no indication of psychological impairment, and during his tests, when he was asked about the distorted faces he claimed he knew he was only fantasizing. Simply put, he murdered and mutilated close to a hundred students for almost nothing.</p>\n\n<p>It was over two years now from that incident. I’m already a CPA after taking the board exam that October, albeit with complaints from my seniors. I wasn’t the only one who braved the examination despite what happened, though—33 of us from my university took the exam and passed. I soon found out other reviewees recovered fast enough to still venture the board.</p>\n\n<p>Right now, I’m working in a reputed audit firm in Makati City. And just this morning as I was walking to my office, I saw in the news flash that around 200 families were protesting in Visayas about that certain incident last October. A segment of the flash report even showed the review center’s owner, siding with the victims.</p>\n\n<p>“Figured even the government won’t be able to keep that a secret forever,” I commented as I jogged to my firm. These past weeks had been overwhelmingly stressful, with all the audit reports due in two weeks. Last night, I only slept for an hour before I went back to my working papers until dawn came.</p>\n\n<p>The guard at the entrance greeted me with a smile. I took the elevator with two junior accountants and an IT staff, and we all greeted each other with tired beams. When I reached my space, one of my office co-workers came up to me and handed me a file.</p>\n\n<p>“A hell of a week?” she chided, smiling. One of her mouths at the side of her head pursed a laughter. She left with a wink from her fifth eye.</p>\n\n<p>I cursed under my breath.</p>\n\n<p>“Bloody pigs.”</p>\n</div>\n","author":"AdvancedAccounting98"}