{"rank":"89","title":"It Didn't Move.","id":"8lt4l5","url":"/r/nosleep/comments/8lt4l5/it_didnt_move/","time":"1527172626000","body":"<div class=\"md\"><p>I turned 22 today, and the darkness didn&#39;t move.</p>\n\n<p>For as long as I can remember It always moved. I can still recall laying in bed as a child and watching the darkness dance. It twisted, writhed, and contorted. A seemingly endless dance of shapes made from black nights and long shadows.</p>\n\n<p>My parents thought I was kidding when I told them about the darkness at age 10. They assumed it was my over active imagination, or some coping mechanism from my grandfather having passed that year. My therapist (more of a grief counsellor really) corroborated my parents thoughts.</p>\n\n<p>They all forgot about the darkness. I didn&#39;t.</p>\n\n<p>By age 12 I started to hear the voices. They called out to me, like someone shouting at you from across a busy street. The voices seemed to carry themselves on the darkness straight to my ears. Speaking to me, educating me, enlightening me. At first I couldn&#39;t really understand what they were asking.</p>\n\n<p>At age 16 I could finally hear them clearly.</p>\n\n<p>The darkness had taken on forms for me, figures that resembled people. The visages swallowed up all the light around them, but still I could see the movements. The twisting darkness bringing instructions to me every night had become expected. I listened intently, nodding along as the darkness caressed my face, tousled my hair, and held me.</p>\n\n<p>I turned 20 and things became different. The darkness had begun following me. I saw it in people&#39;s shadows, in the corners of bleak alleyways, always I saw the darkness. It was playful and called out to me regularly, coaxing me to come closer. It regularly dragged me into janitorial closets, dank basements, and crushing tight spaces. Once when the darkness wanted to chat I had to crawl into a trunk (The large kind that old people normally have in their homes. The kind that lock.). It said we could only speak in private from now on.</p>\n\n<p>My 21st birthday went uncelebrated. My parents both worked and I did as well. I spent my 21st birthday bent over a sink pulling a double shift at the sandwich shop where I made my living. As I washed the dishes I vividly remember the shadows in the water. They held my hands, caressed my fingers sweetly. They wanted me, and I knew why.</p>\n\n<p>I turned 22 today, and the darkness didn&#39;t move. I set about completing my task, I only needed a few things.</p>\n\n<p>It was a brisk early morning. The sun was still behind the horizon. The moon cut through the silence of the environment. It was eerie to see the night so still. I had never seen what everyone else saw. The absence of light, and nothing more. I set about my task.</p>\n\n<p>My parents were suprised by my birthday request the previous day. We would all be working the day of my birthday and they asked in advance what I wanted. I told then I wanted a pallet of boards from the hardware, 1x10 oak boards were required. They laughed at first, but my stony expression seemed to make them uneasy. They asked if I was serious, and I told them yes.</p>\n\n<p>I walked into the backyard to where my pallet was. I strode across the dew covered grass through the silent morning. The air was completely still as I pulled the tarpaulin off of the boards. I had brought a hammer and some nails with me before I had walked out of the front door. I was raised to be prepared.</p>\n\n<p>It took me 3 hours to assemble what the darkness asked for. My entire life had built up to this moment. That whispered set of instructions rang in my ear as I hefted my creation into the bed of my beat up ford pickup. I hopped in the front seat and jammed the keys into the ignition, cranking them until the engine turned over and coughed to life.</p>\n\n<p>The truck was my 16th birthday present. My dad had saved it from a scrap yard for the low low price of free as is. He turned the truck over to me and told me to fix it up. It would build my character and teach me to work with my hands. I didn&#39;t argue. I needed the experience.</p>\n\n<p>Rolling along the road it was still dark. The sun was cresting the horizon now, bearing a pink and orange strip of sunrise that left the dark blues of the sky wounded. I knew all the roads well around here. This was my hometown, but without the moving and shifting darkness. I felt like an alien, or a ghost. A thing out of place. I flipped on my right turn signal and began the final leg of my journey. My mind drifted again.</p>\n\n<p>When I was 12 I got lost in the woods during a camping trip. My dad had given me a flashlight to play with at the camp fire. In his drunken stupor he didn&#39;t see me wander off into the woods,  he couldn&#39;t hear the voices either, even if he was sober. They pulled me out into the forest, my flashlight beam cutting through swathes of dancing blackness until I came upon a clearing. My flashlight beam hit a patch of black that it could not disperse. I was enveloped in a hug by It, a freezing hug. Cold pain rested deeply in my soul. I was so incredibly cold, but more comfortable than I had ever been. By the time my dad had found me, It had left, and I knew all I needed to know.</p>\n\n<p>I threw the gear shift into park and turned off the truck. The engine cut off and left only the sound of ticking as it cooled. Walking around to the bed of the truck I retrieved a brand new spade and a small flatbed. I slid my creation on to the bed and pulled up to the wrought iron gate. The gate was padlocked of course, but a few swings of my spade made short work of it, and I was able to get the gate open.</p>\n\n<p>I rolled the flatbed along the gravel drive. The sun was peeking it&#39;s head out now, which means I was running out of time. I quickened my pace, hurrying to find the spot the darkness had instructed me to find. At last I found it, and began digging furiously. There was no time to waste as I tossed clods of dirt and roots over my shoulder. The work eased my mind.</p>\n\n<p>When I was 10 I told my parents about the darkness, and they didn&#39;t believe me. The darkness told me they didn&#39;t want to believe. It told me they weren&#39;t like me. I was an oddity, someone who wasn&#39;t supposed to happen, someone who was to be stillborn, or hit by a car leaving the hospital in my mothers arms as a child. I was supposed to fall out a window, or drown, or be struck by lightining. Hell, the darkness even said I should have been murdered.</p>\n\n<p>So it gave me instructions, and it comforted me. It held me when I was afraid of what I needed to do on my 22nd. It calmed me when I panicked or screamed at it. I told It I hated it and wished It would cease to see me, and I It. None of my protests helped. They couldn&#39;t help, because I was not to be.</p>\n\n<p>The sun cracked the sky as I shoved my creation: a large wooden box, into the hole I had dug. It lay in the hole perfectly and I observed my handy work. I used oak wood inlaid with ash planks, an eye pleasing combination. A few blankets and pillows were stuffed in the bottom so I wouldn&#39;t be horribly uncomfortable. </p>\n\n<p>Climbing down and lying in my coffin was strange at first. The lid left a small shadow on me, and that&#39;s when I saw the twisting shapes. I knew what would happen next. I will close the lid and wait a few moments. Then I&#39;ll hear the dirt plunking on top, sealing me in, below the earth. Then it would be just me and the darkness, that&#39;s what we both wanted. I am to be buried on my 22nd birthday. I know that because the darkness told me. It was always the same set of instructions every night since I could remember:</p>\n\n<p>Become unborn, start with the coffin.</p>\n\n<p>As I closed the lid I could feel it surrounding me, and suddenly it was moving again. This time It looked ravenous.</p>\n</div>\n","author":"willweis2020"}