{"rank":"233","title":"122","id":"8ltb0b","url":"/r/nosleep/comments/8ltb0b/122/","time":"1527174060000","body":"<div class=\"md\"><p>Adulthood fucking sucks. Bills to pay, food to buy, jobs to hate, boyfriends to dump. What a rut to be stuck in.</p>\n\n<p>Alex is pissed that I&#39;ve dumped him. Super pissed. He&#39;s been texting me non-stop ever since, insisting that he deserves &quot;closure&quot; and I &quot;can&#39;t just leave him like this&quot;. Well guess what, Alex? If you hadn&#39;t been messing around with that bitch from the office we wouldn&#39;t be in this situation now, would we? Of course, he doesn&#39;t know I know about her. I wouldn&#39;t wanna give him the satisfaction of knowing why I went to all that effort arranging a date in our favourite restaurant, only to tell him it&#39;s over during dessert. He&#39;s playing innocent little lost boy who doesn&#39;t know why his mean old girlfriend would dump him for no reason. It&#39;s been two days since then and he&#39;s still blowing up my fucking phone. Get a grip, boy.</p>\n\n<p>I&#39;ve had a long-ass day at work and I&#39;m more than a little done with the incessant texts I&#39;ve been getting, so the last thing I wanna do is make one of the shitty microwave meals I bulk-buy. Instead I order a pizza from my favourite place in town. It doesn&#39;t take long to arrive, and I open the door to this sweaty-looking teenage delivery boy who doesn&#39;t even hide the fact that he&#39;s looking me up and down. As if he&#39;s got a shot. I hold my hand out for the pizza, toss him the cash, tell him to keep the change and slam the door, entertaining the fantasy of gouging out his dumb pervy eyes. The pizza is good enough to make up for it though.</p>\n\n<p>..........</p>\n\n<p>It&#39;s only been two days since I last ordered pizza but I&#39;m doing it again. Fitness never mattered much to me anyway. Alex is still texting, my job is still a nightmare, I&#39;m still too lazy to press a couple buttons on that microwave. It&#39;s the same delivery boy again, and he&#39;s still got that vulture look on his face. Disgusting. This time I keep the door open a little longer so I can show him just how much I disapprove with a glare. It doesn&#39;t quite have the effect I want though, if anything it makes him look more excited. A predatory smile comes up on his face to meet my scowl. I raise an eyebrow at - Dex, according to his name tag - and pull some money out of his tip. Bitch move, yeah, but I never claimed to be decent. Infuriatingly, he just smiles more, at which point I give up and slam the door on him again. I still can&#39;t fault the pizza, though.</p>\n\n<p>..........</p>\n\n<p>It&#39;s been a month since I dumped Alex. His texts are less frequent now but every now and then he gets blackout drunk and wants to know why I&#39;m such a cold-hearted bitch. According to my occasional social media tracing he hasn&#39;t made it official with Bitch From The Office, which is a bit of a surprise but I guess if she knows what a cheating scumbag he is, she might be smarter than to go there. In any case, I don&#39;t care. He&#39;s not my problem.\nI&#39;ve seen Dex three more times now - I eat a lot of junk food, sue me. Each encounter is the same - I dial up the aggression and he dials up the whole undressing-me-with-his-eyes thing to match. I&#39;d definitely love to gouge those eyes.</p>\n\n<p>..........</p>\n\n<p>Alex has crossed the fucking line. It&#39;s been three months since we split and he&#39;s turned up on my doorstep. With a bouquet of flowers, no less. I wonder how many rom-coms he had to watch to come up with this one. I finally cracked in my resolve, though. Somewhere between throwing the flowers at him and calling him a cunt, I screamed about THAT FUCKING SIDE CHICK OF YOURS. He even had the audacity to look shocked, and ask me who I&#39;m talking about. At that point I just told him to find a rock to die under. He skulked away looking all hard done by, and I was just about to slam the door when I heard a chuckle. I snapped my head up to glare at the offending onlooker and looked straight into the eyes of that godforsaken Dex leaning on the wall just outside my apartment door.</p>\n\n<p>&quot;What the fuck do you want?&quot; I tried to sound angry, but my voice cracked a little. I didn&#39;t want him to know I was afraid. He didn&#39;t answer, he just smirked a little longer before walking away. </p>\n\n<p>I hadn&#39;t really needed to ask. It&#39;s the same spot he&#39;s been standing in for 3 weeks now. Ever since I stopped ordering pizza from that place - and told the manager it&#39;s because their delivery guy is a fucking creep - he&#39;s been hanging out near me. By my apartment, by my job, sometimes by the gym I go to on the regular. I should probably have called the cops by now but I can&#39;t stand to be seen as someone who can&#39;t take care of herself.</p>\n\n<p>..........</p>\n\n<p>Four months. Four months since I dumped Alex and since that idiotic stalker Dex popped up into my life. But I&#39;ve finally found the trick to making them both leave me alone. </p>\n\n<p>I&#39;m in my bathroom when the doorbell rings, cleaning. I quickly strip off the rubber gloves and answer it to my best friend, Tania. Tania and I have been friends since we popped out of the womb. She lived on the same street as me growing up, we dropped out of school together and now we work together at that job I hate so much. \nWe&#39;re hanging out on my sofa when she drops an absolute bombshell on me.</p>\n\n<p>&quot;So, I guess I owe you like, an apology or something.&quot; She&#39;s looking into her coffee mug and not quite meeting my eyes.</p>\n\n<p>I laugh and throw my arm around her. &quot;What have you done now?&quot;</p>\n\n<p>She looks uncomfortable. &quot;Well... It&#39;s just, you know that chat we had a while back? About Alex and that girl from his office? So, I like, spoke to my friend who works there, the one who told me about them? Turns out she got the wrong guy.&quot; The last words come out as barely a whisper, she stares down at her trembling hands.</p>\n\n<p>&quot;What do you mean, got the wrong guy?&quot;</p>\n\n<p>&quot;Well like, I guess theres a guy there who looks like Alex? And she thought she saw Alex snogging some other chick, but turns out it wasn&#39;t him.&quot;</p>\n\n<p>I stare at her. Is she fucking serious? Four entire months of hell, dealing with this stupid breakup, and this dumb bitch fed me false information all along? She lied to her best friend?\nA second round of anger washes over me when I realise, if this had never happened then I&#39;d never have ordered that pizza, and Dex would never have been on my doorstep, and I&#39;d never have had to put up with his disgusting stalking.</p>\n\n<p>This is all. Her. Fault.</p>\n\n<p>She&#39;s looking at me now, with dread in her eyes. I rearrange my features and give her a smile. &quot;No worries, babe. No harm done, right? I&#39;ll get in touch with Alex somehow and fix it.&quot; Tania looks so relieved, I note. &quot;Besides, its done me some good! With all this time to myself I&#39;ve been working really hard on cleaning! Wanna see?&quot;</p>\n\n<p>Tania nods - she probably couldn&#39;t care less, but she&#39;s so glad I&#39;m not mad at her that she&#39;d walk to her death for me right now. Funny, that.</p>\n\n<p>&quot;Let me show you the bathroom.&quot; I take her hand and lead her toward it. I open the door, and she gasps, awe-struck by my handiwork. </p>\n\n<p>The surfaces are spotless. The sink and toilet are gleaming. The bath, not so clean, but it&#39;s a work in progress, right? Besides, the bath is harder to clean. The two boys are just so big, it&#39;s hard to get around them. </p>\n\n<p>Tania&#39;s eyes are wide as she takes it in. I&#39;m still holding her hand, her skin is so soft and warm that even though I&#39;m barely touching her, my nails are drawing blood. I&#39;ll have to be careful. I worked hard to get this floor so clean.</p>\n\n<p>The bath is the only place where blood can go. Alex and Dex are sat next to each other, cramped up inside my tiny tub. The bruises make pretty trails down their necks. Dark rivers on a pale backdrop.\nThey wear their sins on their sleeves. Or rather, on their faces. Alex has such a good face, chiselled bone structure. It made it so easy to write on with my little pocket knife. CHEATER, scrawled over his forehead in my finest penmanship. CHEATER, CHEATER, CHEATER, written all over his naked body, though none as neat as the one on his forehead. That one was my centrepiece. Dex, his crimes are less obvious, but I know. There&#39;s no smirk on his face now, no predatory look in his empty eye sockets. I&#39;m not sure what the look in his eyes is now, the pocket knife did too much damage to tell. </p>\n\n<p>It only takes Tania a few seconds to take my artwork in, which annoys me a bit since it took me so long to put it together. Her eyes are still wide, face pale. I&#39;ve no doubt that it&#39;s awe on her face. </p>\n\n<p>&quot;See, isn&#39;t it pretty? I worked so hard. It was so easy, too. Both of them were so desperate to get into my bed!&quot; I giggled at the memories. &quot;Once they were there, you wouldn&#39;t believe how easy it was to get a cord around their necks. Dex thought it was part of the fun!&quot;</p>\n\n<p>Something about that last bit snapped Tania out of her reverie. She tore her eyes away from my masterpiece,  and I felt her yank her hand from mine. She turned to walk away, but that only made my job easier. From behind I could easily slip my cord around her neck, from where it hung beside the door. She screamed for a while, but I don&#39;t think anyone would have heard. It&#39;s a good job I&#39;ve been spending so much time at the gym.</p>\n\n<p>..........</p>\n\n<p>Four months, and two days. I just got off the phone to Tania&#39;s mum, apparently she&#39;s disappeared and nobody knows why. They&#39;re gonna be starting searches for her soon, which isn&#39;t ideal for me. \nShe&#39;s part of a bigger purpose now, though. I&#39;m sure her parents will understand. Her contribution to my artwork is vital.</p>\n\n<p>I couldn&#39;t fit her in the bath. Alex and Dex just wouldn&#39;t move over enough. Instead she sits beside it, leaning against the wall, legs outstretched parallel to the tub. It&#39;s inconvenient as she bled out onto the floor, but I was diligent with my mopping and she&#39;s pretty much stopped doing that now anyway. Her and Alex are somewhat of a match. Except, instead of my pocket knife I used a much bigger one. I spelt out LIAR down her torso. Across her legs, a tally. 122. 122 days for this art piece to come together, from its inspiration, conception, through to it&#39;s execution. 122 days from the day she lied to the day she died.</p>\n\n<p>But it&#39;s okay now. She&#39;s forgiven, redeemed by the role she plays in my work. Alex is mine forever now anyway so, no harm no foul. Dex plays his role well too, as redemption for the stalking he put me through.</p>\n\n<p>They&#39;re starting to annoy me, though. The colour changes in their bodies, and the way they&#39;ve started to droop is ruining the aesthetic I worked so hard for. </p>\n\n<p>But I guess, everything is temporary, even masterpieces. Let&#39;s see how long I can preserve mine. </p>\n\n<p>..........</p>\n\n<p>(Edit: formatting)</p>\n</div>\n","author":"humhallelujahh"}