{"rank":"48","title":"Cats, and Mental Disorders","id":"8ltgio","url":"/r/nosleep/comments/8ltgio/cats_and_mental_disorders/","time":"1527175200000","body":"<div class=\"md\"><p>So, do you love weird mental disorders? Because <em>I</em> sure do!</p>\n\n<p>I am absolutely <em>fascinated</em> by this stuff, I can gobble it up all day. Like that story about the guy who thought that he was actually his left ring finger, and perceived all of the rest of his body as some grotesque gigantic outgrowth sprouting from his backside. Or the one about the woman whose brain hemispheres got separated, but only one hemisphere got the language centers and so only one hemisphere could talk, and so it was nearly five years until they realized that her right hand&#39;s constant trembling was her left hemisphere endlessly <em>screaming</em>.</p>\n\n<p>I mean, that&#39;s probably why I got a girlfriend who studies psychology. (Just joking here. I love Anna because she&#39;s smart, beautiful, and funny. Though even so - how many girls do you know that&#39;ll be up for a multi-hour library spree on an obscure mental illness with, like, ten recorded cases, at a moment&#39;s notice?)</p>\n\n<p>Anyway, though, this is not really a story about weird mental disorders. Except that they seem to work their way somehow inside every story I ever tell, and so every story I ever tell ends up being at least partly about that. But no, no, let me get back on track. This is the story of how Anna and I got our new cat.</p>\n\n<p>It&#39;s also a story about <em>fate</em>. You know, the subtle workings of the system of the world gently guiding you towards the one path that is right for you, looking like aimless coincidences from ground level but revealed to form an intricate chain of interlocking events once you look at them with the benefit of hindsight. Or did I mix together one too many metaphors here? Sorry, sorry, that&#39;s just me, an unceasing fountain of barely-tolerable-to-screech-inducing prose.</p>\n\n<p>So here&#39;s the first link in that chain that I&#39;ve been babbling on about: Anna didn&#39;t actually go to visit her parents.</p>\n\n<p>I hadn&#39;t expected her to be home - she&#39;d caught a taxi for the airport in the very early morning, while it was still dark outside - and so I got a bit creeped out when I got back from my morning classes and I heard someone making quiet rustling noises inside, before I realized that it had to be her. Yeah, well, I may have been creeped out, but you should have seen her - she almost jumped out of her skin when I suddenly threw my arms around her and clamped her in a big tight hug from behind. She actually <em>screamed</em>, as if all of Hell&#39;s demons had caught up with her.</p>\n\n<p>I must have moved very quietly to startle her like that, like a cat (See what I did there? It&#39;s called <em>foreshadowing</em>, and all of my favourite authors do it, like Gene Wolfe), or she must have been very deeply focused on what she was doing - sorting through her stuff, judging by the connoisseur&#39;s selection of postcards and charcoal drawings suddenly all over the floor.</p>\n\n<p>&#39;Hey, it&#39;s just me! Anna, it&#39;s just me, it&#39;s okay&#39;, I said hastily.</p>\n\n<p>She stood perfectly still for a second, then wiggled free with uncharacteristic ferocity and turned around to face me. She looked so lost and confused for a moment there; God, I must have really scared her out of her wits.</p>\n\n<p>&#39;Sorry for sneaking up on you like that&#39;, I said. &#39;And anyway, I&#39;m pretty sure that you scared me a lot more than I scared you, you know. I imagined by now you&#39;d be chatting comfortably with your mom over green tea about the latest developments in the diagnostic criteria for aibohphobia; I thought that we were being burgled!&#39; Still, she wasn&#39;t saying anything, just looking at me intently, in a way that I wasn&#39;t quite able to parse. &#39;Look, sorry, okay? I&#39;ll make it up to you. And, uh, what happened, actually? Why <em>aren&#39;t</em> you with your parents?&#39;</p>\n\n<p>&#39;Do you prefer that I were?&#39;, she said. Then, seemingly making up her mind to forgive me, &#39;Sorry, that was mean. Well, it&#39;s not going to be this weekend, they had something come up unexpectedly and they called it off. I&#39;ll tell you all about it once I&#39;ve got over getting up so bitterly early in the morning for nothing and I&#39;m able to tell the story without cursing at them, okay?&#39; And then she kissed me on the cheek and went back to what she was doing, picking all of her stuff off the floor like a child collecting marbles by the river.</p>\n\n<p>So that was that: Anna was home, and we had the whole weekend ahead of us. Exhibit one!</p>\n\n<p>Exhibit two: Anna was vehement that we were <em>not</em> going to hang out with the neuroscience guys that day. Ordinarily, she&#39;s mad about them, to the point where I often joke (only not <em>quite</em> jokingly) about fighting them in a duel of honour over her intellect. (Not her heart, though, as that&#39;s unquestionably mine.) They go into those endless discussions together about the interplay between the physical substrate of the brain and the subjective experience of the mind that inhabits it; you know how it goes, burst that blood vessel over here and for the rest of your life you can only remember the names of things that are red, or ruin that bundle of axons over there and you are stuck suffering an uncontrollable urge to preserve a scarred woman in clear plastic whenever you see one.</p>\n\n<p>Not today, though. Could use a break from them, she said, and don&#39;t I have any better ideas? And, as it happened, I did. Anna had been putting off going to the library to research recurring autophalophagia for her thesis for a couple of weeks already, and here we&#39;d found ourselves with two whole days ahead of us. Why not get a little work done and then let our clear conscience inspire us towards more fun things to do with the remainder of the weekend? She agreed immediately.</p>\n\n<p>Exhibit three: I walked her to the library and back. Well, that one calls for some explanation that I&#39;m really not all that delighted about wading into, but what can you do? It&#39;s part of the story, and I&#39;ll try to get it over with quickly.</p>\n\n<p>So, the long and the short of it is, Anna had been stalked. It all happened about a month back, and it was never quite <a href=\"/r/LetsNotMeet\">/r/LetsNotMeet</a> material, but it was troubling enough that I still tended to escort her whenever she went to relatively faraway corners of town; and the library was very nearly <em>out</em> of town.</p>\n\n<p>It was some teenage girl who had become obsessed with her, and she&#39;d been writing her a long series of incredibly disturbing Facebook messages - how she&#39;d burned Anna&#39;s name into her skin, dozens of times, all over her thighs and torso, some blood-curdling descriptions of all the stuff that she was going to do to me for taking Anna away from her (featuring hot wax and a non-insignificant number of dinner forks), you know the drill.</p>\n\n<p>I told Anna it was all hilariously over the top, and that people never <em>actually</em> did anything like that except in scary stories, but I&#39;m not so sure in retrospect whether I was trying to persuade her or myself. Anyway, though, the stalker never <em>did</em> anything (or, if she did, then Anna never told me), one day the messages stopped, and that was that. Anna insisted that I accompany her just so that we&#39;d be on the safe side, but we didn&#39;t really expect anything bad to happen.</p>\n\n<p>Still, maybe I wouldn&#39;t have walked with her if I hadn&#39;t misplaced my phone. I could have sworn that I remembered where I put it last night with perfect clarity, but, what do you know, it just wasn&#39;t there, as if it&#39;d come alive at midnight and crawled maliciously away in a dark corner somewhere. Until I found it back, we had no long-distance means of communication available to us; and I definitely didn&#39;t want to leave her completely cut off while she went to the library and back. All for the best, really - otherwise, we&#39;d never have met our new cat! So I guess I&#39;ll have to chalk that phone thing up as Exhibit three and a half; or, come to think of it, maybe three and a quarter at best - quite likely, we&#39;d have gone together anyway.</p>\n\n<p>While Anna was busy doing serious work in the library, I positioned myself on the table next to her and I dived deep into some random psychology journal that&#39;d been left lying about with the joint purpose of educating and entertaining myself. And that&#39;s how I learned about the <em>Grapcas delusion</em>.</p>\n\n<p>It&#39;s fascinating stuff, really, though you&#39;d never have guessed that from the way it was written up in the journal; I must have seen millipedes shorter and more pleasing to the eye than some of the technical jargon that was in there. Anyway, though, luckily here I am to translate it for you, and I&#39;ll do my very best to make it fun too.</p>\n\n<p>Imagine that you are a patient who suffers from the Grapcas delusion!</p>\n\n<p>On the plus side, you are exceptionally optimistic about everything; you never really expect anything bad to happen. (&#39;Unreasonably&#39; optimistic was how they put it in the journal, though what could possibly be unreasonable about it?)</p>\n\n<p>On the so-so side, you are also exceptionally talkative, babbling on and on about everything, always going off on tangents and always sprinkling your speech with assorted and peculiar vocabulary; and you also tend to significantly overestimate your own smarts. (Though that&#39;s likely mediated by your general tendency to optimism.)</p>\n\n<p>And, on the decidedly negative side, you suffer from the Grapcas delusion. Alas.</p>\n\n<p>What it comes down to is, you don&#39;t actually recognize the people closest to you. You think you do - &#39;Yeah, of course I know what my child looks like&#39; - but, in fact, you just constantly deduce their roles in your life from context.</p>\n\n<p>The utterly horrifying thing about the condition, however, is that you <em>aren&#39;t even aware</em> that you&#39;re doing that. You are unshakeably convinced that you are talking to, say, your brother, or your boyfriend, or whoever, just so long as you encounter them in the correct situation, where it&#39;d only make sense for that particular person to be.</p>\n\n<p>You can&#39;t rely on appearances at all - you&#39;d just believe that that person always looked like that, because your brain processes appearances in a completely off-kilter way compared to the rest of us. And if some other detail doesn&#39;t fit, then your brain will just cheerfully rationalize it away, no matter how contrived the reasons that it has to make up. There won&#39;t be any inconsistency that you can&#39;t talk yourself out of (like walking off a plank), ever, at all.</p>\n\n<p>Even more disconcertingly, you could go undiagnosed your entire life. After all, even if you don&#39;t recognize others the way that we normal people do, they recognize each other just fine. So it would be really very difficult for an impostor to take advantage of you. Come to think of it, that hypothetical impostor would have to luck in on a long chain of very carefully arranged circumstances. (Like, say, the ones that led us to come across our new cat!)</p>\n\n<p>He&#39;ll have to get to you in some moment when you are alone, and no one else that you know is around to resolve the confusion. He&#39;ll have to keep away from others close to you - such as family and friends - and he&#39;ll probably have to cut off your connection to them so that the real item doesn&#39;t expose him and implode the charade.</p>\n\n<p>All in all, the chances are stacked so hard in your favour that you have absolutely nothing to worry about.</p>\n\n<p>Oh, fuck, sorry, I&#39;ve done it again, haven&#39;t I? I mean, I&#39;ve been doing that thing where I just can&#39;t shut my mouth up about one improbable mental disorder or other, with complete and utter disregard for what you&#39;re really here for: Cats! Inexcusable.</p>\n\n<p>So okay, then, let&#39;s recap. If Anna hadn&#39;t skipped going to her parents; and if she wasn&#39;t hell-bent on avoiding the neuroscience gang today; and if I hadn&#39;t lost my phone, and I hadn&#39;t walked her to the library; then we wouldn&#39;t have just stumbled upon the most <em>exquisite</em> stray cat on our way back, as perfectly and uncompromisingly black as if it&#39;s just slithered out from between the pages of a book of scary stories.</p>\n\n<p>I&#39;ve always dreamed about us getting a cat. Until today, though, Anna has always been as bitterly stubborn concerning that matter as a mountain of granite that you&#39;re trying to move away by bashing against it your frail naked flesh. This time around, however, she was up for it at once! And a stray! My best attempt at an explanation is that it&#39;s because of that unfortunate stalking episode - perhaps a cat, at her side at all times, will give her a comforting sense of security; cats used to be worshipped as sacred animals in ancient Egypt, after all. A silver lining to every cloud, that&#39;s what I always say!</p>\n\n<p>Our new cat is at home with us now, and we&#39;ve got the whole evening to look forward to.</p>\n</div>\n","author":"platypus_rising"}