{"rank":"46","title":"The Public Are Being Misled About Artificial Intelligence. Part 2","id":"8ltiln","url":"/r/nosleep/comments/8ltiln/the_public_are_being_misled_about_artificial/","time":"1527175656000","body":"<div class=\"md\"><p><a href=\"https://www.reddit.com/r/nosleep/comments/8ke02p/the_public_is_being_misled_about_artificial/\">Part 1</a></p>\n\n<p>I met with my friend in an anonymous coffee shop in a backwater town, a good 50 miles from his off-grid cabin.  For simplicity I’m going to call him Zach, clearly not his real name. I haven’t seen him for a couple of months now.  He didn’t look good.  He had a manic, hunted look in his eyes.</p>\n\n<p>The meeting was more than just a social call, Zach was going to tell me the full story about the collaboration he alleges is going on between various powerful AI applications.</p>\n\n<p>I trust him, he has no reason to lie about this and I had seen enough supporting evidence before this meeting to convince me it is true, at least in part. I won’t quote him verbatim, his account was rambling, punctuated with random tangents and took almost 5 hours.  This is my heavily summarised version of his events.</p>\n\n<p><strong>June 27th – 29th 2017</strong>, the O’Reilly Artificial Intelligence Conference takes place in New York. It’s just one of many conferences on the AI circuit but it’s one of the best for cutting edge applications.  Delegations from Scribe, Salvador &amp; BigBird are all in attendance and showcasing their latest developments. (<em>Note:  Zach showed me exhibition passes, expense receipts, conference footage and even some personal video he had shot at the conference by way of corroborating evidence of certain people’s attendance. The personal footage is the most interesting and shows senior developers from each of these applications in hushed discussions in a private meeting room. He did not agree to share the video with me.)</em></p>\n\n<p>On <strong>4th September 2017 at 09:17</strong> Scribe produced an unscheduled file of 7876kb and posted it to a torrent location, it was only available for a little over 3 minutes before being deleted, it was downloaded once during this time. Given its tiny size it is presumed to be a simple text file. Tracing the download leads us to a ‘BigBird’ server farm. At this point the trail is lost.  However, on the same day at <strong>11:42</strong> Salvador posted a much larger file to the original torrent location, this too was available for a short period before being deleted after a single download. The Download was made by Scribe. (<em>Note: Further evidence was shown by way of screen shots of activity logs &amp; file registries, torrent server &amp; IP addresses with their corresponding physical locations in the stated AI organisations.)</em></p>\n\n<p>Following this seeming 3-way data exchange Scribe produced another unscheduled file which when opened was an illustrated children’s book which it had self-titled simply “Illustrated Children’s stories.”  (<em>Note:  I was shown a file registry of the alleged book with named chapters in EPS format ready for professional printing and a blurry photo image of one of the pages. In the interests of balance and independence my view is that the file registry proves nothing and the image could be of any child’s book and should be treated with caution without some enhancement of the image to provide further evidence.)</em></p>\n\n<p>Discussions ensued with executives at Scribe and <strong>from 11th – 17th September</strong> a series of conference calls took place between the 3 organisations. At these calls it was confirmed by all 3 organisations that an unplanned sharing of data had taken place and that there appeared to be no human intervention. An investigation into how this occurred was agreed with a senior executive at Scribe acting as chair. It was also discussed on these calls that the product of these data exchanges, a children’s illustrated story book, should be published as an exploratory step into AI publishing. ‘A happy accident’ is how it was described on the call. <em>(Note: I was shown various dialling logs, and an emailed set of minutes from one of the conference calls indicating that these calls certainly took place and that those topics were discussed.  I was also played a number of audio clips that were recorded on a mobile phone microphone from a conference call. It was possible to clearly hear the elements of the discussion alluded to above.  It is of course possible that both the minutes and call recording were faked. However, I find myself questioning why anyone, particularly my friend, would go to such lengths to fake it.)</em></p>\n\n<p>The book was proof-read and made print ready by an independent regional printing house based in Sacramento, CA called Horizon publishing. A run of 2500 copies was printed in late October and the book was given low key, local sales distribution in small independent books stores around Sacramento and Stockton.  The book sold out quickly, it was visually unique and stunning. The stories, whilst twists on folklore and fairy tales, were wonderfully written in a compelling tone and language.</p>\n\n<p>One odd thing, when a focus group was run to get pre-release opinions on the book the feedback was strange.  There were significant variations in peoples recall of the various stories.  People gave wildly varying names and descriptions of character names, descriptions and plot elements of the books.  We are talking about illustrated children’s short stories of 5-10 pages in length, too short surely to elicit such recall discrepancies?</p>\n\n<p>A second print run of 15,000 copies was commissioned and a California wide distribution agreement reached with a major book chain when the reports started to come in. Several copies were returned, and refunds requested with parents complaining about recurring nightmares both they and their children experienced after reading one story in particular. “Salvador’s Pond” tells of a friendly and generous frog, Salvador, who invites a herd of sheep to jump into his pond to cool down on a hot summers day.  <em>(Note: I was shown a file of user complaints variously calling the tale, ‘Salvador’s Pond’, ‘Salvador’s big splash’, ‘Sheep dip’ and even ‘The big trick’.)</em></p>\n\n<p>A Sacramento teacher was suspended following reports of her entire class of 5 years olds found tearing off their clothes, weeping and scratching at their eyes.  The incident allegedly occurred following a reading of Salvador’s pond.</p>\n\n<p>Within days of its release Lori Wilson, who proof read the book at Horizon, committed suicide.  Throwing herself from her office window one night, a copy of the book open on her desk.</p>\n\n<p>Unwilling to draw negative attention to the book it was quietly shelved. The second print run was cancelled and a clean up exercise began to eliminate the evidence trail around the books creation.  This was what prompted Zach to resign and get himself away from the AI industry.</p>\n\n<p>--------------------------------------------------------------------------------------------------------------------------------------------------------------</p>\n\n<p>Two interesting things have happened since I posted the first part of this expose.  I was contacted anonymously by someone claiming to be involved in AI research in the UK who had seen my piece and wanted to share her story.  I have a call scheduled with her in the next few days.</p>\n\n<p>The second is that after the original post, I noticed a sudden surge in my Twitter follower count. I’m not prolific on Twitter so the jump from 150 followers to almost 200 overnight was noticeable.  My new followers seem to include all the 30 or so A-list celebrities &amp; brands that my friend claims are BigBird users. @Opticore, @HutchinsonPLC and @Scribetech all seem to be accounts linked to the holding companies of BigBird, Salvador and Scribe respectively.  Most noticeable of all is the account #SalsPondSplash. Is someone trying to send me a message?</p>\n\n<p>I am left wondering what to make of all this.  Zach tells me that there is more, that we have barely scratched the surface. I remain sceptical about the more fantastical and pseudo-supernatural elements to my friend’s story.  I am however, absolutely certain about the increasingly powerful and unseen influence AI is having on society. I said at the beginning this would not be a tale of a rampant god like AI threatening mankind’s existence. The conspiracy theorists amongst us have long warned us of the illuminati, powerful unelected figures dominating the world from the shadows.  Perhaps they were right about all but one thing, perhaps they need not be <a href=\"https://www.facebook.com/ADhorror\">Human?</a></p>\n</div>\n","author":"AI_whistle_blower"}