{"rank":"7","title":"I killed because I couldn’t control myself.","id":"8lts6m","url":"/r/nosleep/comments/8lts6m/i_killed_because_i_couldnt_control_myself/","time":"1527177739000","body":"<div class=\"md\"><p>It has been 2 days. 2 terrible, nightmare soaked days.</p>\n\n<p>2 days since the fog lifted and “I” returned.\nLet me explain. 17 days ago I was bit. I remember feeling his teeth sink into my arm as I screamed. The pain was sharp and abrupt, but the scream that tore out of me was anguished, not because of the pain but because of the knowledge of what that bite meant. My fate was sealed. I knew that in 24 hours, my heart rate would quicken. My eyes would glaze. The thirst would deepen. And I would be gone.</p>\n\n<p>But I couldn’t kill myself. I couldn’t end it like so many incredible and brave individuals had done before me - to reduce the ‘bitten’ population. That’s what we called those who contracted the virus - the bitten.</p>\n\n<p>Biters probably would have been a more suiting term. Because that’s what they did - bite. And fuck did it hurt.</p>\n\n<p>The blast of a gun rang through my ears.  I lost my balance as the force of the bullet hit the bitten (let’s call this one Frank) and we both fell to the ground, Frank’s jaw still firmly clamped on my arm.  Prying his jaw open, I stared at my arm, not wanting to admit what was coming.</p>\n\n<p>Frank’s shooter was my partner – Zoe.  I say ‘was’ my partner because I don’t know where Zoe is.  I don’t actually know exactly where I am. \nAs I type this, tears stream down my face remembering what I did to Zoe.  I couldn’t kill myself and she promised she would take care of me. She wanted to be there right until the end.  We timed it to 20 hours just to be safe.  Then I would be chained until I changed and Zoe would take the required precautions.  </p>\n\n<p>We decided to take time to ourselves before going back to the others.  Seeing the grief and pity on their faces would have been too much to endure right away. </p>\n\n<p>We went back to our loft. Zoe was kissing my neck, her hands sliding up my body when I felt the first flash of heat.  I shook it off as anxiety.  I inhaled her as she pressed her lips to mine and pressed herself harder on me.  We were both desperate to soak up everything.  I flipped Zoe on her back and felt another flash of heat.  My heart was pounding and racing.  I should have known then.  I should have stopped.  I shook it off as desire and anticipation – anxiety over this being the last time I would hold Zoe.  The last time I would feel her.  We were so desperate to feel everything, to touch, to taste, that we missed the moment my eyes glazed.  I felt myself being pulled away, almost as if I was watching myself, but not controlling my actions.  I tried to warn her.  I tried to tell her to escape now, but my throat was no longer my own.  I was pushed into a cave – where all I could feel around me was frenzy.  My body hummed with a hunger, with a thirst I couldn’t identify.</p>\n\n<p>I was supposed to have 24 hours.  I changed in 2. </p>\n\n<p>The change doesn’t happen like you see in movies.  You don’t rot.  You don’t have superhuman speed or superhuman strength.  </p>\n\n<p>You just are no longer you – you can’t be reasoned with.  It’s like you are on autopilot with one goal in mind.</p>\n\n<p>I remember the scream.  I remember her cries \nof fear and despair as my teeth sank into her thigh.  I remember feeling her blood flow into my mouth.  She tasted like warm copper had melted in my mouth.  I felt sick and satisfied.  I remember locking my arms around her and refusing to let go as my mouth sank deeper into her thigh.  She flailed. She fought.  Searing pain flew through my head and everything went black. I woke up with blood in my mouth and ringing in my ears. </p>\n\n<p>I did so many terrible things after that – terrible things I need to work through but I can’t bring myself to move past what I did to Zoe. </p>\n\n<p>There are others here.  With stories worse than mine.  Their screams echo through the night as they remember what they’ve done.  The people they killed.  The way they killed them...</p>\n</div>\n","author":"caffeinated_af"}