{"rank":"14","title":"Why I Hold it in Until I get Home","id":"8ltvkn","url":"/r/nosleep/comments/8ltvkn/why_i_hold_it_in_until_i_get_home/","time":"1527178441000","body":"<div class=\"md\"><p>Im a junior in high school.  In this day and age, everybody in the school either vapes or, don’t judge me, Juul.  I’m on the Juul side of the spectrum. </p>\n\n<p>Let me preface this by saying I know it’s bad for me, and I don’t do it because everyone else does, I just like the feeling of smoke rolling down my throat and into my lungs.  I like holding it in until my lungs get sore, and the smoke is satisfying to me.  No I’m not addicted to nicotine.  </p>\n\n<p>I was in my math class, second hour.  I said I had to go to the bathroom, but it was just a “Juul break”.  Figured it wouldn’t take longer than ten minutes to just chill in there. </p>\n\n<p>The bathroom closest to my math class is hardly ever used by anyone.  It’s a pretty secluded part of the school, with only two classes there during my second hour, including mine.  Also, while all the other restrooms in the school have been upgraded, this one is still old and crumbly, all of the lights are sill manual, not motion sensing, so people go to the better rooms.  </p>\n\n<p>The layout of the room is when you walk in, there are four urinals on the left, and three mirrors and sinks directly parallel to them.  Right past that is the stalls on the left.  The doors leg (the little arm that has rubber on the end to keep the door open) is loose, so whenever it’s opened, it falls down and keeps the door open. Sorry if that’s at all ambiguous, but I’ve never been good at giving directions.  </p>\n\n<p>When I walked in, I went to the urinal and pulled out my phone and Juul.  Sent some snaps, and hit the Juul a few times, and to my surprise someone came in.  So I went to the stall, and the person left, but I didn’t hear the door close so I assumed the leg was down.  As to be expected.  </p>\n\n<p>I sat in the stall for an additional two minutes maybe.  Then I heard the door shut.  I didn’t hear footsteps, so I didn’t think much of it other than someone walked past and closed it.  Then the lights turned off.  </p>\n\n<p>I guess reason to many posts on this sub has made me paranoid.  I instantly thought the worst of it.  What ungodly creature straight out of hell Is coming for me?</p>\n\n<p>Since I was just sitting on the toilet seat with my pants up I stood up to look over the stall.  I’m 6’ 2”, so it was no problem.  </p>\n\n<p>Darkness. </p>\n\n<p>I pick up my phone to use the flashlight.  As I shine it over the stall, something grabs me.  Not physically, but emotionally.  I’m overrun by. A mix of emotions, and I can’t move.  I pull myself to shine it over the stall, but I can’t do it.</p>\n\n<p>Instead I reach for the door.  As I open it, a sense of dread overcomes me.  </p>\n\n<p>“What the fuck is wrong with me?!” I exclaim quite loudly.  I’m so scared I’m shaking.  I say fuck it and shine be light over the stall.  </p>\n\n<p>To my dismay, there’s a face looking back at me.    It’s a weird kid at my school.  Big, offset glasses, blonde and dirty, greasy hair, and a crooked nose from where my buddy knocked him out from trying to get nudes from his girlfriend.  </p>\n\n<p>He quickly ducks away.</p>\n\n<p>The fear mostly leaves after the initial shock.  I think nothing of it except why was he staring over the stall.  I don’t talk to him, I just open the door.</p>\n\n<p>The pain was excruciating.</p>\n\n<p>Another weird kid, one that I catfished when I was in eighth grade.  I felt bad and I apologized, because it was really messed up.  I’ve changed my ways, but the past doesn’t leave.  I still feel bad.</p>\n\n<p>He came at me with a knife and sliced open my arm.  He didn’t stab at me, just swung.  I fall back into the toilet.  </p>\n\n<p>P.S. I am a black belt in Tae Kwon Do.  I’ve been in it since fifth grade.  </p>\n\n<p>I push him away with my foot hard enough for him to hit the wall.  Then I got put in an arm bar.  The other kid snuck under the stall and put me in a headlock.</p>\n\n<p>As I’m blacking our, and the kid who cut me comes towards me, the door opens and the lights come on.  The kids quickly run out, but one gets stopped by the principal.  When I come out with a gash on my arm, shit hit the fan.</p>\n\n<p>That’s basically the end of the story.  Nothing supernatural or anything, just kinda scary.  The kids got expelled.  I’m fine, got stitches and the whole works.  </p>\n\n<p>So now I hold it until I get home.</p>\n</div>\n","author":"sgnve12345"}