{"rank":"1661","title":"My parents run a successful business in the Black Market.","id":"8lu1nl","url":"/r/nosleep/comments/8lu1nl/my_parents_run_a_successful_business_in_the_black/","time":"1527179724000","body":"<div class=\"md\"><p><a href=\"https://reddit.app.link/64VEKkczdN\">PART 2</a> </p>\n\n<p>Part 1: The House</p>\n\n<p>My parents always bought me the best of the best. The best clothes, the best toys, and they sent me to the best schools. Even though they weren’t extremely cuddly and affectionate They took care of me. They were good people....or so I thought. </p>\n\n<p>My dad was an orthopedic surgeon and my mom was an architect. Everyone was always so surprised my mom was a successful architect. I guess in retrospect it was fairly rare back then? </p>\n\n<p>Anyways, our house was very unique. My mom designed it and my dad paid for it. She wanted a house unlike any other house and she got it. When I was about 4 or 5 they built an addition to the house. </p>\n\n<p>Instead of busting down a wall and building an extension my mom designed a sky bridge connecting from the top floor of our house to the top floor of the addition. To help you better understand imagine the size of a guest house. The addition was that size but the only way in or out was through the sky bridge. You could only get into the addition from the very top floor of the house. It looked like a long white hallway with a door at the end. </p>\n\n<p>There were no windows on the bridge and no windows in the addition. When I was little I didn’t ask many questions but I knew I was to never go down the white hallway. I couldn’t have anyways. The door at the end of the hallway was a sterile metal door that was always locked. </p>\n\n<p>Honestly I had no interest. We were wealthy and I had everything I needed in the main house. I remember when I turned 7 we had a birthday party for me. Somehow one of the kids got separated from the clan and made their way upstairs. They found themselves in the white hallway. My Dad bolted like I’ve never seen once he knew one was missing. He found her at the hallway. </p>\n\n<p>“What’s that room?” </p>\n\n<p>“That’s my office sweetie. Come on. Let’s get you some cake.” My dad said as he took her hand and guided her back down the stairs </p>\n\n<p>I guess at that moment I realized it was weird. But still I said nothing. </p>\n\n<p>My parents always had packages coming in. Dad always said they were medical equipment that he kept in his office. Sometimes I saw bits and pieces of what was in them but it was always smaller parts of something that looked as if it had to be assembled. Occasionally he’d get surgical instruments. </p>\n\n<p>“Honey, they are for my collection.” \nHe’d say. </p>\n\n<p>And just as there were packages coming in, there were packages going out. The packages would always be by the front door and my Dad or Mom, depending on who left first, would take them on their way out. Still, I asked no questions. </p>\n\n<p>One day when I was about 14 my mom was out on a job site designing some house for a millionaire and my dad had got called into emergency surgery. Car wreck. A broken femur, right through the skin. </p>\n\n<p>It was a Friday and I had stayed home from school because our cat had surgery and I was an emotional teenager and couldn’t bare being away. My parents reluctantly let me stay home. Dad was watching me but got called in. </p>\n\n<p>Potato, our cat, was on some drugs so she was all over the place. I was reading a Cosmo when I realized Potato was gone. I hopped up and started to frantically look for her. I looked everywhere. Except the white hallway. </p>\n\n<p>Potato slept in the white hallway a lot. Maybe it was the lighting? Maybe it was the way the cool marble felt on her skin? </p>\n\n<p>I ran upstairs to the white hallway and to my surprise the door was ajar. Then it hit me. This was the first time in my life I had ever seen the door open. </p>\n\n<p>Potato had to have gotten in. I’d checked the whole house and the door was cracked just enough for a skinny,drugged up cat to slide through. </p>\n\n<p>I hesitated. </p>\n\n<p>No. Absolutely not. I couldn’t go through there. </p>\n\n<p>But Potato....</p>\n\n<p>If I got caught I’d just say I had to save her. She doesn’t know where she’s at. </p>\n\n<p>I walked towards the metal door. As soon as I touched the door the temperature dropped dramatically. The metal door was like ice. I pushed through. It blew cold air directly above me. Had to be in the 60’s. </p>\n\n<p>I shivered. Why is it so cold in here? Then the extravagant spiral staircase caught my attention. My mom had such an eye for beauty. I knew this was her style. </p>\n\n<p>I came in on a landing. Immediately the only place you could go was down the spiral staircase. The black marble staircase stood out in a totally white and bright room. I slowly made my descent. At the end of the stairs was another door. </p>\n\n<p>“Meow”</p>\n\n<p>I whipped around. Potato was behind the staircase. Loopy as ever. </p>\n\n<p>“Potato! You are gonna get us in trouble! We can’t be down here!” </p>\n\n<p>I started to walk for her and then heard a noise from within the room. I stopped. </p>\n\n<p>I turned my focus back on the room and stared at the door. </p>\n\n<p>“Mom..?”</p>\n\n<p>I  waited. </p>\n\n<p>Another bang. I jumped. I guess the bang and my sudden movement scared Potato and she went flying up the stairs. Damn cat. </p>\n\n<p>Another bang. I reached for the door and it was unlocked. I guess they figured a metal bolted door was enough and it wasn’t necessary to lock this one too. I pushed the cold metal door open and that’s when I found out what my parents were involved with. </p>\n\n<p>That’s when my innocence was stolen. That’s when I learned of the evil in this world. I had discovered their play room. I wanted to scream. I wanted to cry. I wanted to run. I wanted to wake up from this nightmare. </p>\n\n<p>I entered the play room. </p>\n</div>\n","author":"GlitterKricket"}