{"rank":"13","title":"Hell Adjacent Hotel: Part 13","id":"8lu2cv","url":"/r/nosleep/comments/8lu2cv/hell_adjacent_hotel_part_13/","time":"1527179868000","body":"<div class=\"md\"><p>It&#39;s been a long time, apparently. I think the longer we&#39;re in Vincent&#39;s dark bubble, the worse the discrepancy in time is. Charles, if you&#39;re reading this, even if you don&#39;t realize I&#39;m talking to you, I&#39;m so sorry I missed your birthday. I hope you had a great time at the concert. </p>\n\n<p>Part 13. You&#39;ll have to decide for yourself what kind of luck the number held for us. There will be a Hell Adjacent Hotel Part 14, a sort of epilogue, and then no more. I don&#39;t think you&#39;ll hear about this in the news. </p>\n\n<p>Thanks for coming along for the ride. Your support and encouragement and insight while we have been fighting for our lives... I can&#39;t express how important it&#39;s been. Really and truly. Thank you. </p>\n\n<p>Let&#39;s do this. </p>\n\n<p>[Part 1] <a href=\"https://www.reddit.com/r/nosleep/comments/82uwtg/hell_adjacent_hotel/?utm_source=reddit-android\">https://www.reddit.com/r/nosleep/comments/82uwtg/hell_adjacent_hotel/?utm_source=reddit-android</a></p>\n\n<p>[Part 2] <a href=\"https://www.reddit.com/r/nosleep/comments/838avz/hell_adjacent_hotel_part_2/?utm_source=reddit-android\">https://www.reddit.com/r/nosleep/comments/838avz/hell_adjacent_hotel_part_2/?utm_source=reddit-android</a></p>\n\n<p>[Part 3] <a href=\"https://www.reddit.com/r/nosleep/comments/840hiq/hell_adjacent_hotel_part_3/?utm_source=reddit-android\">https://www.reddit.com/r/nosleep/comments/840hiq/hell_adjacent_hotel_part_3/?utm_source=reddit-android</a></p>\n\n<p>[Part 4] <a href=\"https://www.reddit.com/r/nosleep/comments/84a6sn/hell_adjacent_hotel_part_4/?utm_source=reddit-android\">https://www.reddit.com/r/nosleep/comments/84a6sn/hell_adjacent_hotel_part_4/?utm_source=reddit-android</a></p>\n\n<p>[Part 5] <a href=\"https://www.reddit.com/r/nosleep/comments/84zchr/hell_adjacent_hotel_5/?utm_source=reddit-android\">https://www.reddit.com/r/nosleep/comments/84zchr/hell_adjacent_hotel_5/?utm_source=reddit-android</a> </p>\n\n<p>[Part 6] <a href=\"https://www.reddit.com/r/nosleep/comments/85prvy/hell_adjacent_hotel_part_6/?utm_source=reddit-android\">https://www.reddit.com/r/nosleep/comments/85prvy/hell_adjacent_hotel_part_6/?utm_source=reddit-android</a> </p>\n\n<p>[Part 7] <a href=\"https://www.reddit.com/r/nosleep/comments/868tnu/hell_adjacent_hotel_part_7/?utm_source=reddit-android\">https://www.reddit.com/r/nosleep/comments/868tnu/hell_adjacent_hotel_part_7/?utm_source=reddit-android</a> </p>\n\n<p>[Part 8] <a href=\"https://www.reddit.com/r/nosleep/comments/86yypu/hell_adjacent_hotel_part_8/?utm_source=reddit-android\">https://www.reddit.com/r/nosleep/comments/86yypu/hell_adjacent_hotel_part_8/?utm_source=reddit-android</a> </p>\n\n<p>[Part 9] <a href=\"https://www.reddit.com/r/nosleep/comments/89851b/hell_adjacent_hotel_part_9/?utm_source=reddit-android\">https://www.reddit.com/r/nosleep/comments/89851b/hell_adjacent_hotel_part_9/?utm_source=reddit-android</a> </p>\n\n<p>[Part 10] <a href=\"https://www.reddit.com/r/nosleep/comments/8b1p99/hell_adjacent_hotel_part_10/?utm_source=reddit-android\">https://www.reddit.com/r/nosleep/comments/8b1p99/hell_adjacent_hotel_part_10/?utm_source=reddit-android</a> </p>\n\n<p>[Part 11] <a href=\"https://www.reddit.com/r/nosleep/comments/8c9qc2/hell_adjacent_hotel_part_11/?utm_source=reddit-android\">https://www.reddit.com/r/nosleep/comments/8c9qc2/hell_adjacent_hotel_part_11/?utm_source=reddit-android</a> </p>\n\n<p>[Part 12] <a href=\"https://www.reddit.com/r/nosleep/comments/8fd6jp/hell_adjacent_hotel_part_12/?utm_source=reddit-android\">https://www.reddit.com/r/nosleep/comments/8fd6jp/hell_adjacent_hotel_part_12/?utm_source=reddit-android</a> </p>\n\n<p>“We have no recollection of the earth being born.”</p>\n\n<p>The voice was as familiar as it wasn&#39;t. Like hearing a song played on the guitar instead of a pipe organ. It was the same but strange. At least at first.</p>\n\n<p>“Hello?” </p>\n\n<p>I was in a greenhouse. Not our pool room greenhouse, but a beautiful and elaborate glass room with all sorts of plants. Orchids and hostas and lilies and roses. Fuschia dripped from hanging baskets. Flowers I didn&#39;t recognize lazed in the humid air. Glossy green leaves as big as both of my hands bobbed gently as I passed. </p>\n\n<p>“Hello?” I called out again. </p>\n\n<p>“Over here, child.” Spoken like rolling waves. </p>\n\n<p>I headed towards the voice wondering why it was so different. I stopped, though, when I came upon a small, terracotta pot sitting on a pedestal. The plant tucked into the dark soil was very young but familiar. I couldn&#39;t resist the compulsion and I picked up the plant before continuing through the greenhouse until the aisles of plants opened into a sitting area. On a white painted wrought iron bench sat one of the three fates. She had a weft of raw wool in her lap and she smiled up at me before motioning to the matching chair nearby. I sat and held my pot in my lap.</p>\n\n<p>“Gloria. You&#39;re late.” She didn&#39;t stop smiling. </p>\n\n<p>“I&#39;m never late or early… I arrive precisely when I mean to.”</p>\n\n<p>“Ah. A wizard, are you?” She chuckled and I realized what was different. She was speaking to me with her mouth, rather than inside my head. “You have such lovely bits of things stashed away, do you not? Books and songs and movies.”</p>\n\n<p>“Is this real?”</p>\n\n<p>“You are dreaming. Fast asleep.”</p>\n\n<p>“But is it real?” </p>\n\n<p>Her white eyes shone in the sunlight and she considered me for a moment. I stroked the lip of the pot with my thumbs repeatedly.</p>\n\n<p>“Does it matter, Gloria? If a dream tells you it&#39;s not a dream? You&#39;ll think about it later.”</p>\n\n<p>“Oh. Okay.”</p>\n\n<p>We sat in silence for a bit. She worked on making a length of thread and I looked around. The sitting area looked out onto an immaculately manicured lawn. It stretched out in perfect stripes until it reached a forest. It was dense with pine trees like home. Dark and inviting. I could smell the earth and pine needles and mushrooms from memory. It seemed like something moved between the trees. </p>\n\n<p>“Sarah. She wants you to know she is well. She is happy.” </p>\n\n<p>“Is she really?”</p>\n\n<p>“Truly. Sometimes gifts look like nightmares to other people. Sometimes nightmares look like gifts, too.”</p>\n\n<p>“Where are your… sisters?” I couldn&#39;t see anything in the forest anymore so I focused again on the old woman.</p>\n\n<p>“Sisters?” She laughed. “I like that. They do not approve of this.”</p>\n\n<p>“Thank you.”</p>\n\n<p>“For what, child?”</p>\n\n<p>“I&#39;m not sure yet. This? Everything?”</p>\n\n<p>“That is not necessary. Look here.” She held up her thread. “What color is it?”</p>\n\n<p>I leaned in to get a better look. It was a thread that reminded me, at least in width, of the wonderfully soft baby yarn sold in pastels. I wanted to reach out and touch it to see if it was similarly soft but I didn&#39;t. I didn&#39;t want to do anything I shouldn&#39;t.</p>\n\n<p>“Focus, Gloria. What color?”</p>\n\n<p>I looked hard but I couldn&#39;t decide. It was like yellow but more complex and not as bright. But with the depth of blue. It wasn&#39;t blue, though. It was harder than choosing a single color to describe the ocean. Or a sunset. It was silvery or goldish. Maybe copper but richer than copper. I shook my head. </p>\n\n<p>“I don&#39;t know but I think it&#39;s beautiful.”</p>\n\n<p>“Beautiful.” She patted my hand. “I like you very much.” I felt a warmth inside that seemed I hadn&#39;t felt in ages. “Look at your plant.”</p>\n\n<p>“The dandelion?” I brushed one of its leaves with my fingertips. “What&#39;s it doing in here with all these fancy plants? There aren&#39;t even any on the lawn out there.”</p>\n\n<p>“Because is is your favorite.”</p>\n\n<p>“I don&#39;t think it counts since it&#39;s a weed.” I couldn&#39;t count how many people told me that. So many that I started saying my favorite flowers were irises just to avoid being told how wrong I was.</p>\n\n<p>“It is your favorite so it counts. You do not love these things for other people to approve of. Now watch closely.” </p>\n\n<p>She picked a bit of wool from her lap and added it to one end of the string. She twisted it between her fingers to lengthen the thread. </p>\n\n<p>“The flower.”</p>\n\n<p>I looked down at the pot and the tiny dandelion plant grew. Its leaves stretched out and its stem lifted its budded head higher. </p>\n\n<p>She plucked some more of the enigmatic fiber, added, and the dandelion began to open. I lifted the pot to my face and the fuzzy yellow bloom tickled my nose. It smelled fresh and green and a bit sharp. I loved it. The first sign of spring. I was anxious for those little guys to appear after every long Michigan winter that passed.</p>\n\n<p>“The string is life. All life? Plants and bugs and animals and bacteria? Made from wool? You control it all?”</p>\n\n<p>“Wool? Oh, that is lovely. We shall call it wool. It is life. No more, no less. It is not luck or chance or God or anything else. It does not have any other category. We do not control anything.”</p>\n\n<p>“Okay. Just life.” The dandelion reached its peak, the shreds of yellow petals fully splayed, and I smiled to myself. </p>\n\n<p>“These things aren&#39;t easily toyed with. Here.” she picked up more wool and tried to affix it to the thread. It wouldn&#39;t stick, though. It just frayed uselessly between her ancient fingers. “We do not choose every individual path. Life has its own rules and we abide by them. We manage the flow of life. We do not edit it for our own gain. For the benefit or downfall of anything.”</p>\n\n<p>“You said not easily toyed with. But not impossible?”</p>\n\n<p>“Things happen. This is not the time or place to open old wounds.” Her milky white eyes seemed to darken for a moment.</p>\n\n<p>“I&#39;m sorry. But isn&#39;t what you&#39;re doing right now kind of… meddling?”</p>\n\n<p>She shot me a look. </p>\n\n<p>“Now, then.” She held the thread with one hand and seemed to pull her sister&#39;s silver scissors from thin air. “We follow the flow. Not of time, but life.”</p>\n\n<p>She snipped the thread in half and I looked down at my dandelion. The yellow head shriveled and I watched the seeds push off the spent blossom to burst forth with white fluff. The stem grew wane and the leaves shrunk and lost their brightness. I hated to see the happy little bloom gone so quickly but the truth was that I loved this stage, too.</p>\n\n<p>“It&#39;s a little sad. There&#39;s nothing we can do. The thread. Life. It&#39;s over when it&#39;s over. We&#39;re all pretty helpless, I guess.” I thought of Grace and felt my lip tremble just a little.</p>\n\n<p>“Come, child.” She hefted herself up from the bench and I stood to follow her. She opened the French doors that lead out onto the lawn and we stood at the threshold. “You have never been burdened to hold the scissors. Or the thread. It does not make you powerless or at fault.” </p>\n\n<p>“It&#39;s not that simple.” I held the pot close to my chest, careful not to breathe on it and disturb the seeds. </p>\n\n<p>“Yes it is. You carry a weight that is not yours. You think you wear my mantel or a hundred others. You do not. You are human, Gloria. A perfectly wonderful human. Who thinks she is at fault for everything but not able to do anything at the same time. It cannot be both, child. You are capable.” She reached up to put her hand on my shoulder and a tear slid down my face.</p>\n\n<p>“I don&#39;t know what to say.”</p>\n\n<p>“Blow.”</p>\n\n<p><em>“What?”</em></p>\n\n<p>“The seeds. Blow them away.”</p>\n\n<p>I looked out onto the lawn. Not a dandelion or blade of crabgrass in sight. I wondered if someone out there was not going to appreciate my weed propagating. I held up the little pot and the dandelion’s white head wavered slightly in a gentle breeze. </p>\n\n<p>“Do I make a wish?”</p>\n\n<p>“If you like. I think that would be nice.”</p>\n\n<p>I closed my eyes and made a wish before blowing the seeds away. They scattered and danced on the breeze. The tiny specs swirled away and soon I couldn&#39;t see them anymore. The naked stem slumped into the pot.</p>\n\n<p>“It is a little sad like you said, but nothing is over so easily.” She held up her hands that were cupped together. Inside were the two segments of thread she had cut. “Everything goes on in some way. Everything plants seeds. Watch.”</p>\n\n<p>I leaned in and looked. The pieces of string seemed a  dull and lifeless grey which was fitting. Then there was a shimmer. A flare of that strange but beautiful color. They shuddered and began to segment themselves again and again until it was divided into dozens of separate, minuscule pieces of thread. </p>\n\n<p>“It is a process of renewal. Throughout life. Even in death. Everyone casts off seeds. Sarah in her forest. You. Grace.”</p>\n\n<p>“Ben?”</p>\n\n<p>“Ben, too.” She nodded and sighed. “Some seeds are insidious. But they are vastly outnumbered. Ben did some good in this world, too. It is never all one or the other. All good or evil, black or white.”</p>\n\n<p>I set the pot on the ground and hugged myself while I thought about that. Ben doing good in the world? It seemed impossible with all the bad. The files, those faces, the families he tore apart.</p>\n\n<p>“Are you saying reincarnation is a thing?”</p>\n\n<p>“Do you believe in reincarnation, child?”</p>\n\n<p>“No. I don&#39;t really believe in anything like that.”</p>\n\n<p>“Then no. Come, we do not have much time left.” She lead me back to the sitting area. I noticed a circular mosaic on the floor as she had me sit next to her on the bench. In small, colorful tiles a snake was rendered in greens and blues. It was curled and biting its own tail. I knew it meant something but the thought eluded me. The old woman pulled the wool from her skirt pocket and set to worrying a different thread between her fingers.</p>\n\n<p>“Do you have a name? I feel strange not calling you anything.”</p>\n\n<p>“I have a name but it is very old. I would like it if you chose to name me for yourself. If you do not mind.” </p>\n\n<p>It seemed like an odd request but was it really? <em>There are people in my life who don&#39;t even know me as Gloria, only Glo.</em> She wanted a nickname. I had to stop myself from laughing a little. Not because it was a silly request, it was quite endearing, but because she was so much different from her sisters. Firm but kind. Wise but gentle.</p>\n\n<p>“You remind me of my favorite principal. She was in charge of my grade school most of my time there. She was a nun and her name was Sandra. Can I call you that?”</p>\n\n<p>“I would be honored. Sandra.” She laughed and patted my leg before going back to her work. “Oh, how delightfully funny.”</p>\n\n<p>“What do you mean?”</p>\n\n<p>“It just is. Do you understand why I came, Gloria?”</p>\n\n<p>“To show me that… life is beautiful. And simple. And none of this is your fault? I&#39;m sorry that I got so upset with you and your sisters.”</p>\n\n<p>“Close. None of this is <em>your</em> fault, child. You do, however, continue to sew seeds.”</p>\n\n<p>“Mostly good ones, I hope.”</p>\n\n<p>She considered that for a moment and I felt a spike of anxiety. Was she calculating the balance of my influence? I didn&#39;t think I could handle that knowledge even if it was mostly good. </p>\n\n<p>“I did not bring you here to show you that life is beautiful. I had no intention to persuade you with that given everything you have seen. That would have been cruel. You saw my string as beautiful on your own. A choice in perception. Akin to loving little, yellow flowers despite most people calling them weeds. You already appreciated life down to the things that stubbornly grow from even the most forlorn ground. What kind of seeds would you think a person like that would shed?”</p>\n\n<p>I nodded but remained silent. Appreciating dandelions wasn&#39;t something that would get us home. It was so small. I was so small. I felt like a person growing weeds in a world that needed redwoods. Good and beautiful weren&#39;t enough no matter the volume. Instead of planting seeds, I needed to be doing something real. Something that would make a real difference.</p>\n\n<p>“Poor child. So beaten down.” She shook her head and I cringed a little at the pity in her voice. “So much in this world depends upon such small things.”</p>\n\n<p>“Can you tell me how to get us home?” I held onto a spec of hope. Maybe that&#39;s why her sisters didn&#39;t come. “Sandra, please.”</p>\n\n<p>“What do you think I&#39;ve been doing?”</p>\n\n<p>“Explaining… life and… trying to give me some self esteem.” I laughed a at that. Lord knows people had tried before.</p>\n\n<p>“Trying to give you hope in the future and faith in yourself. An understanding that even at its worst, not all is lost. It will serve you well if you let the roots flourish.” She gathered the thread into a neat little hank. “There is a battle on the horizon and the outcome depends upon you being able to accept how strong you are and letting go of your misplaced burdens. Otherwise you shall be lost. Maybe your friends, too.”</p>\n\n<p>“A battle.” I stared at the snake on the floor. Around and around and around my eyes traced the tiles. “How do I just stop feeling the way I&#39;ve felt my whole life?” I wanted to curl in on myself and disappear. It was like counseling sessions all over again.</p>\n\n<p>“Let yourself. No one is telling you to hate yourself anymore. You took up that task. Let it go.”</p>\n\n<p>“Is it really that easy?”</p>\n\n<p>“And just that difficult.” She turned to me and her face was as kind as ever. Her blank eyes no longer bothered me.</p>\n\n<p>“I&#39;ll try.”</p>\n\n<p>“You are up to it. I know this as I know the rhythm of the universe.” She placed the little bundle of string in my hand. “Hold onto this for me. It is extremely important. I hope it serves to remind you, in the end, that you are not responsible for life&#39;s every tragedy.”</p>\n\n<p>I accepted it and felt the gravity of the thing in my palm. So ordinary yet so strange. So necessary. It wasn&#39;t soft like the baby yarn exactly. It was but it was also like steel wool. Like silk and and static shock. I slipped it into my pocket and with that, we fell into silence. The greenhouse and everything around me faded from sight. </p>\n\n<p><em>(</em><em>(</em><em>(</em>* N’s Chapter Continued <strong>)</strong>)*<em>)</em></p>\n\n<p>We ran up to the chapel and I was a bit shocked that Mr. Nowak pulled ahead of me as we bounded up the stairs. I sulked for just a moment, cursing my days old legs, then pumped them harder. Vincent absolutely could not kill himself. If he died, I&#39;d lose Glo. That was not an option. </p>\n\n<p>“Eh! What you doing?! Stop that. You being crazy!” Mr. Nowak was charging up the aisle to the altar. I was just staring up at Vincent. </p>\n\n<p>He was at the altar with a heavy, golden chalice raised above his head. He looked wild. His eyes were wide and his thin faces made it easy to see his clenched jaw muscles standing out. <em>tha-thump</em> My heart beat so hard I could nearly feel it pound against my ribcage. He focused on the old man. </p>\n\n<p>“I need the relic!” Vincent brought down the chalice into the altar and we heard another crack. “St. Michaels feather.” He beat the altar again then slumped against the marble. </p>\n\n<p>“Boy, why you not tell me?” Mr. Nowak approached Vincent put is hand on his back. “Why you not ask for this?”</p>\n\n<p>“I didn&#39;t… think… you’d give it… to me.” It was hard for him to speak between heaving breaths. The desperate, defeated tone in his voice broke my heart.</p>\n\n<p>“You need, I give.” He gave Vincent’s back a rub so hard that rocked his body back and forth. “I… am sorry. Boy is not crazy. Old man just worried. Stay. I get right tool.” Mr. Nowak leaned in close and squeezed the back of his neck firmly. It scared me a little. The old man was strong. He said something and Vincent did his best to nod, though. </p>\n\n<p>As Mr. Nowak left, I finished approaching the front of the chapel and sat on a pew. It was a strange room that seemed out of place with the rest of the house. Though, I guess the whole place was a kind of weird patchwork. Even before the whole decent almost into hell thing. I wanted to laugh just then but I didn&#39;t let myself. I didn&#39;t understand why I did either thing. I looked at Vincent.</p>\n\n<p>His arms were folded around his head that still rested against the altar. His breaths were short and shallow. I wanted to go to him like Mr. Nowak had but I couldn&#39;t make my legs move. </p>\n\n<p>“What did he whisper?” I couldn&#39;t help asking. He stayed quiet for a moment then turned his head. He looked at me, resting on his arms, and my heart thu-thudded again. It wasn&#39;t very pronounced, but he smiled. </p>\n\n<p>“He said he knows I&#39;ll do the right thing. He believes in me.” His blue eyes seemed to shimmer in the warm light from the old chandeliers.</p>\n\n<p>“I do, too.” I nodded. “I do.”</p>\n\n<p>Vincent just kept looking at me with that strange expression. Smiling a little. I felt like I should look away but I couldn&#39;t. </p>\n\n<p>“I&#39;m sorry about earlier. I&#39;m not great at being a person yet.”</p>\n\n<p>He laughed at that. <em>thu-thud</em></p>\n\n<p>“Nobody&#39;s great at being a person. </p>\n\n<p>“That&#39;s comforting…” I rolled my eyes. </p>\n\n<p>“Isn&#39;t it, though? Nobody&#39;s perfect. So you don&#39;t have to be.” He propped his chin on his folded arms. “I&#39;m going to make up for… myself.” His slight smile faded. </p>\n\n<p>I wanted to tell him that he didn&#39;t owe anyone anything. That he deserved a break because of everything. I wanted to help. I wanted to reassure him. But my best friend was tied to a bed downstairs. She was my priority. I had to be careful not to sway him from whatever he was doing to help. <em>Maybe that makes me a monster.</em> I cleared my throat and tried to push away the guilt I felt.</p>\n\n<p>“Why do you need a feather?” </p>\n\n<p>“It&#39;s an angel&#39;s feather. <em>The</em> archangel that banished Lucifer to hell. It&#39;s powerful.”</p>\n\n<p>“You&#39;re not still bent on that whole summoning satan thing, are you?”</p>\n\n<p>“No. I&#39;m hoping heaven is on my side this time. Maybe God will help me out even after… everything.”</p>\n\n<p>“Vincent. You can do this yourself. You just have to believe -&quot;</p>\n\n<p>He laughed. It was a kind of laugh that made me sad. It felt like all my insides got pulled downwards. He stood up and rubbed his face with both hands. </p>\n\n<p>“I can&#39;t do that, N. N-tasha. I can&#39;t believe in me. But I&#39;ve got faith. I don&#39;t think it&#39;s misplaced anymore. That got us here. It&#39;ll get us home.”</p>\n\n<p>We looked at each other. I wondered what his face felt like but I pushed the thought away and just twisted my fingers together in my lap. <em>thu-thud</em></p>\n\n<p>“Are you going to kill Gloria? Like she asked you to.”</p>\n\n<p>“No.” His response was quick and firm. Comforting. “I promise. She doesn&#39;t know what she&#39;s asking for. Not with that monster inside her.”</p>\n\n<p>Now it was my turn to use the sad laugh. I didn&#39;t know that was something I was capable of until it left my throat. </p>\n\n<p>“She&#39;s been ready to die for all of you since nearly the beginning. Why do you think she kept fucking running towards destruction?”</p>\n\n<p>It got quiet again. </p>\n\n<p>“Vincent, do you promise not to hurt any of my friends?”</p>\n\n<p>“Yes. I promise.”</p>\n\n<p>I felt tears welling up no matter how hard I scrunched my face up to stop them. </p>\n\n<p>“Are… are you my friend?”</p>\n\n<p>He gave me a pained look for what seemed like a long time before he opened his mouth. </p>\n\n<p>“GOT IT!”</p>\n\n<p>Mr. Nowak was heading up the aisle and Vincent and I tore our eyes away from each other. I hadn&#39;t even heard him climb the stairs. </p>\n\n<p>“Sorry, sorry. Took long to find. Had to ask wife. Is good now.”</p>\n\n<p>He held a tool I didn&#39;t recognize. It was black and chunky but fit in his hand. A little toothed wheel stood out horizontal to the body at the front of it. </p>\n\n<p>“Move, boy. I cut plastic glass. Get feather.”</p>\n\n<p>Vincent stepped back and Mr. Nowak hunched over the altar. The tool emitted a horrible buzzing, grinding squeal as he turned it on and plunged it into the altar. I got up and approached them from the opposite side. There was a little, clear window set into the marble. It cracked and chipped as he cut into it and it seemed very thick. I could see where Vincent&#39;s missed hits with the chalice gouged the stone.</p>\n\n<p>“IS IT REALLY AN ANGEL FEATHER?” I yelled over the horrible noise. </p>\n\n<p>Mr. Nowak glanced back at Vincent.</p>\n\n<p>“YES. IS ANGEL. PASSED DOWN THROUGH FAMILY FROM WHILE AFTER BIBLE TIMES. WAR SPOILS.”</p>\n\n<p>I couldn&#39;t read Vincent&#39;s face. Maybe he didn&#39;t even hear us as he was intently watching the altar being desecrated. Before long, the old man tossed away chunks of the little case and stepped back. I was relieved that the noise was over and that Vincent had what he wanted but I couldn&#39;t help feeling… scared. And worried. And nervous. So many things all at once and it felt like too much inside me at the same time. I wanted to scream to relieve the pressure but I just stood there. Watching. Frozen. </p>\n\n<p>Vincent stepped forward. I leaned over the altar to watch. The marble was smooth and cool and I wanted to press my cheek to it. Maybe my face would stop burning then. I looked up to Vincent but he was already looking at me. <em>thu-thump</em> We looked away. </p>\n\n<p>With the glass removed I could see the relic. The feather. I expected a whole feather, like something you&#39;d find fallen from a dove&#39;s wing, but this was a tiny fragment of a feather. Just a section of the vane about as big as my thumb nail held together by a shred from the shaft. It was white, though. Brilliantly white after all this time. Was it from St. Michael, the archangel? Did them believing in it mean it was anyway? It sat on a tiny, red velvet cushion. The interior of the compartment was edged in gold.</p>\n\n<p>I looked at Mr. Nowak who was still standing to the back of the altar. I wished more than ever that In could read someone&#39;s mind. Was the feather real? Did he really believe in Vincent? Did he know what the plan was? I desperately needed some kind of reassurance. He looked at me but his face may as well have been solid stone like the altar. He turned away and busied himself fiddling with his little saw. </p>\n\n<p>Vincent carefully took the relic from its home. And placed it in the palm of his hand. He touched it very carefully with the tip of his finger and smiled. </p>\n\n<p>“It&#39;s real.”</p>\n\n<p>“How can you tell?” I spoke before I thought better of it. “I mean, it really is beautiful…”</p>\n\n<p>“I can feel it.” He looked at me. His eyes seemed a little wild. His smile was a bit too wide. “I can feel it. It&#39;s real.”</p>\n\n<p>He clasped his hands over it and bent his head in prayer. It felt so private. He seemed so vulnerable and raw as he frantically whispered into his folded hands. Mr. Nowak must have felt the same way because he walked with me down the altar and we sat together in a pew. I whispered to him. </p>\n\n<p>“Should we pray, too?”</p>\n\n<p>“I never stopped.”</p>\n\n<p>“Do you think it would do any good if I prayed? I&#39;m still really confused.”</p>\n\n<p>“Yes, girl. It do good. Even if just keep mind calm.”</p>\n\n<p>I leaned my head on his shoulder and he let me. He smelled a little musty but not in a bad way. Coffee and dirt and cedar.</p>\n\n<p>I closed my eyes and prayed the best I could.</p>\n\n<p><em>(</em><em>(</em><em>(</em>* End of N’s Chapter <strong>)</strong>)*<em>)</em></p>\n\n<p>I heard murmuring and it took a moment for me to decide whether it was coming from inside my head or outside. My mind swam and the image of the fate danced in my head. Sandra. What had she told me? Fragments of my dream came into focus. I pieced together our conversation but kept my eyes closed. One step at a time. I pictured the perfect lawn from my dream decorated with a smattering of dandelions. Where did that come from?</p>\n\n<p>I could hear the voices around me better. My friends. My weird family in this strange place. I was overwhelmed just then with how much I loved them. The Nowaks and N. John and Megan. We&#39;d been through so much together. I had to get them home. There was no other option. We had to get home. </p>\n\n<p><em>”never never never never never never…”</em></p>\n\n<p>My eyes snapped open. It was still there. The thing. </p>\n\n<p><em>”forever forever forever forever until you die die die die die…”</em></p>\n\n<p>I thought about dandelions and string and life. A forest with a loving new resident. Three old women. A snake that called me a warrior. </p>\n\n<p>“Gloria, honey.” I felt someone sit on the bed beside me and I looked over at Megan. “You awake now?”</p>\n\n<p>“Yeah. Hey. Hi.” My tongue felt a little too big and my mouth was bone dry.</p>\n\n<p>“How are you?”</p>\n\n<p><em>”hahahahahahahaha…”</em></p>\n\n<p>“Fuzzy. Thirsty.” I tried to rub my face but I found myself tugging against restraints. “Were you planning a wild time? ‘Cause I&#39;m into it.”</p>\n\n<p>“Ha!” She snort laughed. Then she looked at me and her face got serious again. “I&#39;m sorry.”</p>\n\n<p>“It&#39;s okay.”</p>\n\n<p>“Are you still... ?”</p>\n\n<p><em>”crazy crazy crazy crazy crazy crazy…”</em></p>\n\n<p>“My head is still inhabited. But the thing seems to be a little bitch at the moment.” I winced as the monster roared inside my head. \n“I don&#39;t know what to say about that.” She reached up and put her hand on my forehead as if she could detect brain monsters with a fever. “Are you okay to be untied?”</p>\n\n<p>“<em>yes yes yes yes yes yes yes…”</em></p>\n\n<p>“No. Not yet. Where&#39;s N?”</p>\n\n<p>“She&#39;s speaking with Vincent. Mr. Nowak is with them so don&#39;t worry.” She gave me a mom patented concerned glance again. “What can I do, hon?”</p>\n\n<p>“Something to drink? Please?”</p>\n\n<p>She nodded and left. </p>\n\n<p><em>”she&#39;s going to give you poison poison poison poison…”</em> </p>\n\n<p>“No she&#39;s not. Shut up.”</p>\n\n<p>Barb and John came to talk to me. Just strained pleasantries while I mentally chastised the voices in my head. After Megan gave me a drink of water and I assured everyone that I didn&#39;t need to be drugged again, they left me to rest. I wondered what was taking N so long. I had been out for quite a while. I focused on the things inside my head.</p>\n\n<p><em>”she&#39;s gone gone gone gone left you left you left you…”</em></p>\n\n<p>“She&#39;d sooner eat glass.”</p>\n\n<p>“<em>screaming</em>”</p>\n\n<p>“Are you my battle?”</p>\n\n<p><em>”already won already won ours ours ours ours…”</em></p>\n\n<p>I thought about that and the thing churned inside my head as my mind cleared by degrees from Barb’s pain pill. I thought about Sandra telling me to believe in myself. </p>\n\n<p><em>”HahaHahaHahaHaaaaa…”</em></p>\n\n<p>“That&#39;s certainly not what you want, is it?”</p>\n\n<p><em>”DISABLED! JOBLESS! ALONE ALONE ALONE HOPELESS HOPELESS GIRL!!!!”</em></p>\n\n<p>I recoiled with the impact of that hit. I felt the darkness creep further. I had originally thought this trip was finally going to be the start of my new life. Instead, everyone got trapped in an abused man&#39;s version of almost hell. I couldn&#39;t imagine anything else that seemed more hopeless. I wasn&#39;t sure who exactly I was anymore after everything.</p>\n\n<p><em>”give up give up give up give up give up….”</em></p>\n\n<p>I turned my head and looked at everyone. They were talking quietly. Marcus had brought in his cards. Glasses of iced tea that Mrs. Nowak had no doubt made littered the table.</p>\n\n<p><em>”better off without you without you without you…”</em></p>\n\n<p>“I&#39;ve planted seeds here. I hope most of them are good ones.” Tears pooled in my eyes as i turned my face toward the ceiling. </p>\n\n<p><em>”bad baaaddd bad bad bad seeds…”</em></p>\n\n<p>“You&#39;re not a very good parasite. Aren&#39;t you supposed to keep me alive? What good is it to you if I die?”</p>\n\n<p>The static in my head down out my thoughts for a few moments and disoriented me. I tried to focus but my skin started to crawl. I felt like I was on a roller coaster spiraling down, down, down and I couldn&#39;t catch my breath. My stomach lodged between my lungs. </p>\n\n<p>“Gloeee!” </p>\n\n<p>I felt someone get on the bed next to me again. All the intense feelings inside me ebbed a bit and I looked up at N kneeling beside me.</p>\n\n<p>“N.” I felt clammy and nauseous but I smiled at her. “What do you think about dandelions?”</p>\n\n<p>She brushed her wavy hair behind her ears and smiled back at me. </p>\n\n<p>“Still your favorite, right? I love them. We made dandelion-mud soup in a bucket. More than once. We&#39;d use the heads as petit fours during tea parties in the grass. You’d make wishes…” her smile faltered. </p>\n\n<p>I remembered the wishes I made as a child. Dandelions, birthday candles, stars… all the same wishes. The wish evolved as the years passed.</p>\n\n<p>-“I wish he loved me enough not to hurt me.”-</p>\n\n<p>-“I wish he&#39;d just stop hitting me.”-</p>\n\n<p>-&quot;I wish I&#39;d never been born.”-</p>\n\n<p>-&quot;I wish I&#39;d just disappear.”-</p>\n\n<p>“They&#39;re still my favorite.”</p>\n\n<p>I finally noticed someone was standing nearly beside her. I looked up at Vincent and the thing inside me recoiled. I took a deep breath as it felt like it tugged at my insides and my mind. It&#39;s little barbed tentacles digging in deeper.</p>\n\n<p>“What about you? What do you think of dandelions?”</p>\n\n<p>His face took on a quality that I&#39;d never seen before. His eyes lit up as he thought about something that must have been wonderful. The thing inside me receded further. I could think more clearly. I hoped Vincent would look like that a lot more in time.</p>\n\n<p>“I love them, too. And they&#39;re important. Bees’ first food after the winter. They&#39;re tough and versatile. You could be walking along in the city, nothing but cement as far as the eye can see and then… pop! A crack in the sidewalk and dandelions coming up through it.” His face fell a little and his gaze got distant. “They were all the flowers I saw for a long time.”</p>\n\n<p>I noticed N looking up at him. Affection was written all over her face. They would be really good for each other. I wondered what they had been talking about all this time. Such kids in adult bodies feeling their way around new thoughts, truths, emotions. I scoffed at myself. Was I much different?</p>\n\n<p><em>”getting rid of you getting rid of you getting rid of you…”</em></p>\n\n<p>“The thing in my head says you guys have been plotting to off me.” They both looked startled. “It&#39;s hard to sort out… my thoughts and its stuff.” I shook my head as it tried to flood my thoughts with their static screams. “Ugh. But honestly. My brain was kinda messed up to begin with.”</p>\n\n<p>“I get it.” Vincent nodded solemnly. “I didn&#39;t… I was afraid to say anything. Acknowledge it. I thought it was just me.”</p>\n\n<p>“That you deserved it.” I understood, too.</p>\n\n<p>“Yeah.” </p>\n\n<p>N-tasha grabbed his hand in one of her own and put the other on my shoulder. </p>\n\n<p>“Vincent has a plan.”</p>\n\n<p>I looked up at him and he looked like a kid getting picked on in class for just a moment but he lifted his head and his shoulders went from slumped to thrown back. He held out what looked like a tiny torn piece of paper. I squinted without my glasses. </p>\n\n<p>“I&#39;m sorry. I don&#39;t get it.” </p>\n\n<p>“It&#39;s St. Michael&#39;s feather from the altar. He&#39;s going to use it to get us home.” N sounded happy. Proud. But her face looked worried. </p>\n\n<p>I was about to say something when Vincent clasped the hand with the feather to my forehead. The contact made the sounds and pain in my head explode. I screamed and my body convulsed against the restraints. I felt N wrap her arms around my body. I could hear his voice speaking Latin. Then shouting. I didn&#39;t recognize anything and I couldn&#39;t focus on any one thing as white hot pain flared through my body. </p>\n\n<p>The voices used every horrible thing I had ever said or done against me. It used every awful word in existence to taunt me. I felt it getting darker and darker around me as it pulled me farther and farther away from my friends.</p>\n\n<p>“There&#39;s a battle on the horizon…” The fate’s words bubbled up in my head. “You are capable… hope in the future and faith in yourself.”</p>\n\n<p><em>”WORTHLESS WORTHLESS WASTE! BETTER OFF TO EVERYONE DEAD!”</em></p>\n\n<p>“NO! I&#39;m not worthless! I&#39;m a dandelion! You think you&#39;ve beaten me down but I come right back to fuck up your shit!”</p>\n\n<p>The ropes bit into my wrists and ankles. Vincent&#39;s hand didn&#39;t leave my forehead. I thought I heard N crying but it was so hard. The things were screaming and pain sizzled in every nerve. I couldn&#39;t form words anymore so I just yelled. Every time a thought was pushed out of my head by the thing I thought of something else. Dandelions. N. Sandra. The Nowaks. My people back home. Charles and my family and the stray cat that frequented the yard. Megan. Being called a warrior. Gummy bears. Painting. Vincent&#39;s casual smile. It was time to fight for everything. For myself. </p>\n\n<p>I felt like I was going to throw up. My stomach churned. I stopped yelling to catch my breath and I gagged. Something was working its way out of me. My scream was cut short as it slithered into my throat then out of my mouth. I could see it reach from my face. A thick, black tentacle. It oozed and whipped around until it got ahold of Vincent&#39;s wrist. He screamed. Oh, God he screamed. I&#39;d never heard a living thing make a sound so utterly terrified. </p>\n\n<p>I could hardly breathe through my nose. I wanted to tell Vincent not to let it get him. Not to let it crawl back into his head. It just wanted to get passed between us. Feeding on us then killing us one by one. I needed to tell him that. I needed him to know that but I choked on the thing suffocating me. </p>\n\n<p>The Latin words got louder. Faster. He didn&#39;t pull his hand away and I had to close my eyes as I felt another tentacle wriggle out of the hole in my arm. I couldn&#39;t yell so I hurled my thoughts at the monster. </p>\n\n<p><em>You&#39;re the one who&#39;s nothing! You can&#39;t live without a miserable host.</em></p>\n\n<p>“Miserere nobis!” Vincent cried out something that seemed familiar. I got caught in a scent memory of the church I grew up in. Maybe things were a lot different now, but a long time ago it was a sanctuary. I clung to that feeling. </p>\n\n<p><em>You&#39;re useless! So vile but you can&#39;t even kill me in my sleep!</em></p>\n\n<p>“Miserere nobis!”</p>\n\n<p><em>I&#39;m stronger than you! I&#39;ve always been stronger than you! I&#39;ve always been stronger than I could ever admit!</em></p>\n\n<p>“Miserere nobis!”</p>\n\n<p>I could feel the thing try to slither back down my throat so I clenched my teeth to keep it from receding further. The taste was more noxious than ever as my teeth bit into its slippery flesh. It was rubbery and strong. I thought my teeth would wiggle loose as it fought back. </p>\n\n<p><em>Not so fast! My body, my rules!</em> It struggled and flailed and screamed in pain.</p>\n\n<p>“Miserere no… AUGH!”</p>\n\n<p>The tentacles surged forth from my face and my arm. Before I knew what was happening N screamed and the monster had Vincent pinned to me. I could feel it moving out of me. Uprooting itself. It was trying to get back into its old home.</p>\n\n<p>“What do I do?!” N was hysterical. I couldn&#39;t speak but I tugged at ther rope at my wrists hard and hoped she got the message. “Somebody cut her free!” She yelled as she scrabbled in vain at a knot on my wrist. </p>\n\n<p>Somebody listened and one then the other my hands were freed. I wrapped my arms around Vincent. I hugged him as tight as I could as the monster struggled between us. I closed my eyes and willed him to understand that he was strong enough, that we could do this, that he was good. </p>\n\n<p>“Mea culpa, mea culpa, mea maxima culpa.” He almost whispered these words to me right before the thing surged forth and completely left my body. The oily tentacles let go of me and I felt strangely empty but incredibly relieved. Only for a moment, though. </p>\n\n<p>Vincent staggered back as the monster writhed around him. Thick, black leeches searching for their way in. N tried to pull them off. So did some of the others desperately. I could finally sit up and see the whole room frantic. He looked at me with sad eyes as the sharp cups on the tentacles opened healing wounds and made new ones. </p>\n\n<p>“Get them home.” He choked back tears and struggled to hold out his hand. I reached out, straining against my ankle restraints. </p>\n\n<p>“I will. I promise. I know I can.”</p>\n\n<p>He dropped the tiny piece of feather now stained with blood into my palm.</p>\n\n<p>“I believe in you.” A tentacle dove into his open mouth as the room filled with a brilliant, white light.</p>\n\n<p>…</p>\n\n<p>…</p>\n\n<p>...</p>\n\n<p>I was lying flat on my back looking at the sky. Brilliant blue scattered with tufts of clouds. It was warm. I felt grass underneath me. Slowly and painfully I sat up. Everything hurt. My head throbbed painfully with my heartbeat. There were loops of yellow rope hanging from my wrists and ankles. Around me were the others in similar states of confusion on the ground. </p>\n\n<p>“Vincent?” N’s voice rang out and I spotted her. She was the only one on her feet. </p>\n\n<p>“Vincent!” She continued to search. I tried to hold onto the sense of urgency in her voice to motivate me. </p>\n\n<p>I struggled to stand. I wished I had my cane. I felt weak. Completely rung dry. I managed, though, and swayed a little as I surveyed the area. We were in the clearing I remembered surrounded by forest but it was empty. No Victorian. No hotel. No chapel. Just our luggage and belongings scattered around like a tornado came through and dumped us and our stuff in a field. Below us in the gravel lot were our pollen dusted cars.</p>\n\n<p>“VINCENT!”</p>\n\n<p>Dread crept into the pit of my stomach right before I heard N scream. I wobbled for a few steps but ran to her as best I could. Her and the form that was still lying on the ground. I wished with every fiber of my being that my horrible thoughts were wrong. I pleaded with my thoughts every step. <em>Don&#39;t be dead, don&#39;t be dead, don&#39;t be dead!</em></p>\n\n<p>I made it to them and N collapsed to her knees. Vincent was staring blankly at the sky with dull eyes. Pale and motionless with a trickles of dried blood trailing from his mouth, eyes, and ears. He was long gone. I knew in my heart that he had traded himself for us. He sacrificed himself to flip the switch in his head.  </p>\n\n<p>The others wandered over but nobody said anything. I held my friend as she wept. </p>\n</div>\n","author":"Gloeee"}