{"rank":"17","title":"To The Grave","id":"8lu60l","url":"/r/nosleep/comments/8lu60l/to_the_grave/","time":"1527180668000","body":"<div class=\"md\"><p>Funerals; It seems no matter what type of service, religion, or circumstance, there are always the typical attendees with typical responses. There’s the close relatives, most of which, if the deceased is lucky, will be absolutely shattered by their death. The friends of the families’, who, like the family are equally just as distraunt. Then, there are the polites, the people who come to pay their respects to the deceased even though their death has little to no effect on their existence. Of course there&#39;s always one or two who manage to flow along the service without shedding a tear. Those are the people I wonder about while standing in a line of other attendees, glancing over the lifeless corpse while paying respects to the grieving widow and/or parents. Eyeing the suspicious mourners, or lack thereof causes me to question their place in the solemn atmosphere. Are they still in shock? Are they just out for an inheritance? Did they somehow assist in the death? Do you ever wonder what your own funeral will be like or who will be the suspicious mourners?</p>\n\n<p>The visitation ceremony is set to start in ten minutes as I pull into the chapel parking. I smooth my suit, check my pockets for my phone, cigarettes, and wallet. All here. I take the keys out of the ignition and pocket them as well before shutting the door to my old suburban and make my way towards the entrance. Ferns. I hate the smell of ferns. I honestly dont think Ive met anyone who likes the odor. But then again, if it weren&#39;t the smell of flowers set to die just as the soulless in the casket, who knows what putrid wafts of wind might invade these rooms instead. I gulp and open the door.</p>\n\n<p>In the foyer, decorated with stained glass windows, a mirror above a small chestnut table holding a bible, I am greeted by his mother. She sniffles as I enter and opens her arms for a hug. As I hold her, I breathe in her scent. It never changes. She thanks me for coming and offers the words I feel is customary for mothers to say to their children’s friends; “He thought the world of you.” That’s not true. Still, I smile and thank her while embracing her once more, taking in her citrus perfume again.</p>\n\n<p>I make my way to the break room for a cup of coffee. Around a small table sit two other friends of the deceased. They don’t recognize me and nod their heads as they continue their conversation about politics. I&#39;m glad they don&#39;t. I&#39;m not one for political debates. I grab my coffee and head outside for a cigarette. As I step into the same lot my vehicle waits in, my cell rings. My wife’s name displays on the screen. Upon asking her to come with me, she only stated “I hate funerals.” I&#39;m not sure what I was expecting. I&#39;m not even sure why I asked. Since she fell into selling weight loss products from home, she hasn&#39;t noticed much else. I send the call to voicemail and stomp the lit filter into the cement.</p>\n\n<p>I return and make my way inside the room holding my dear old friend. As I approach the casket, his body comes into view; frail, powder white, lifeless, fingers folded over his sternum. I reach out to touch his hand. The frozen stiffness forces visions of a body lying in an alleyway into my mind. I shake away this thought and remove my hand from his.</p>\n\n<p>The next few hours before the service consisted of dodging questions and speaking in hushed polite tones to those who thought I looked faintly familiar but couldn&#39;t put their finger on it. Fortunately, the deceased’s mother was preoccupied with the other guests so I avoided the grand introduction to everyone else in the building. I managed to slip away and grab one more cigarette before snagging a seat in the back of the sanctuary.</p>\n\n<p>The funeral director thanks everyone on the behalf of the family for coming and allows the preacher the floor. I&#39;ll admit I didn&#39;t hear most of his sermon. I fought my heavy eyelids to stay open and held back repeated yawns however I do recall one segment: “We can not understand when or why our father chooses to bring us home, only that we are prepared for the journey when he calls our names.” A smile crept across my face. Some people are well aware of when they are going to die.</p>\n\n<p>When I met Rick in college, I immediately noticed our resemblance. Both about 6 ft, brown hair, green eyes, strong cheekbones, and dark skin. We quickly became friends. He even met my mother a few times. He would comment on her sweet, tangy smell and how it lingered throughout my childhood home as I showed him around, pointing out pictures and trophies from my younger days, teasing his awkward ways and inquiring if boys were allowed to join the sewing club.</p>\n\n<p>Around 3 am, after a night of heavy drinking, I stumbled into my dorm room and collasped in bed. Not long after, I felt Rick climb in behind me. In my drunken stupor, it was impossible to stop him and eventually the pain pinged with guilt and vodka caused me to lose consciousness. As I hugged the toilet the next morning, he offered a few words of advice, “Don&#39;t tell anyone or i&#39;ll turn your mother’s scent into one of rot. Take it to the grave, I mean it.” and he walked out. I continued to be Rick’s friend, terrified cutting him off might cause him to pay my family a visit.</p>\n\n<p>We both graduated and became engulfed in our careers. We would meet occasionally for a beer or something to eat, reminding me of that night and bubbling the shame to the surface once more before parting ways again. A few years passed by before Rick decided to use me as a primary dentist. Rick had a million dollar smile, all his teeth perfectly aligned and gleaming white. On his first visit, I made a plaster mold of his teeth. “For teaching purposes” I lied. On his second visit, I closely examined his mouth and the mold to make any necessary changes.</p>\n\n<p>On the day of Rick’s third visit for the free teeth cleaning I promised him, he was the only patient in the waiting area. I could tell he was aware of this and planned to take advantage when I met him in the lobby. I presented myself in the doorway. “Got a little work done yourself, huh, Doctor? You look really great.” he inquired with a grin while eyeing my body meticulously.</p>\n\n<p>Do you know how you&#39;re going to die? It was fairly simple for myself. I woke up a week ago and decided it was the day. My friend from college came into the office and what was supposed to be a simple teeth cleaning turned into an extensive procedure. After work, I drove out to a local bar and had a few drinks before stepping outside for a cigarette, just out of the security camera’s view. I was pulled into the alleyway, beaten and left dead. The only thing identifying my swollen, pulverized remains were the teeth left beside my corpse.</p>\n\n<p>When going to a funeral, we always look for the suspicious mourners. We pay close attention to the ones weaving in and out of the crowds, avoiding everyone at all costs. Our eyes follow those in the family that seem a little too eager to get the event over with. We glance over the casket and avert our eyes in fear of offending the dead and their survivors but noting something is off.  We cast our judgements and make assumptions of the living. We depart the funeral home, drunk on the idea of a life gone in a instant taking with us the questions that tormented us at the service. My funeral was just as predictable as the ones I’ve attended before, with no one having the slightest idea that we buried Rick’s body.</p>\n</div>\n","author":"jadednicole"}