{"rank":"6","title":"Yipping and Yapping","id":"8lud5r","url":"/r/nosleep/comments/8lud5r/yipping_and_yapping/","time":"1527182141000","body":"<div class=\"md\"><p>This happened about 6 years ago. </p>\n\n<p>At the age of 15 I was offered a job working at a scout camp. Not having any real plans for the summer, and needing some source of income,(though it didn’t pay a lot) I decided to go. This was the first time I had really been away from parents so the first few days were rough. Stress and homesickness were prominent. But as the days went on, friendships formed with scouts and other camp counselors. One of said counselors names was Michael. Michael was a counselor on the aquatics crew whereas I was with the nature program. But we got along quite well. We ended up being assigned to the same tent about halfway through the summer and it was nice. </p>\n\n<p>Things were going well. A nice tentmate and plenty of outdoor air. I felt great. Until of course this one night. </p>\n\n<p>I finished up my kitchen duties and headed for the tent. Michael wasn’t there yet so I decided to get my scripture study done. (yes I am religious). I kept the tent flap open as I read. Our tent was on a hill and the sunsets at camp were legendarily beautiful. So I got my studies done by the last sunlight of the day. A great way to end the day if you ask me. The sun set about half an hour later and darkness enveloped the camp. I closed the tent and laid down. I fell asleep pretty quickly for a few hours but was awakened when Michael entered the tent. </p>\n\n<p>“Hey man,” I said “How was the fire?’ The aquatics crew had a fire once or twice a week. Usually went pretty late into the night. </p>\n\n<p>“Fine.” he said </p>\n\n<p>Immediately I could tell that something was wrong. He got in bed. But kept sitting up. Looking like he had heard something. For an hour he did this. Not even coming close to sleep. Eyes wide. Hands shaking. Something had happened. I figured the aquatics crew had been telling ghost stories and Michael had gotten scared. It wouldn’t be the first time. \nI decided to let him go through it and try to get some sleep. We both had a staff meeting early the next morning and I needed to be alert. Again I fell asleep. </p>\n\n<p>“Ivan!” Michael whispered loudly “Wake up dude!”\nI woke up and immediately heard it. \nYipping and yapping. </p>\n\n<p>Coyotes were common in the area so It didn’t really scare me all that much. </p>\n\n<p>“What’s up?” I asked\n“They’re getting closer.” Michael replied. </p>\n\n<p>I assumed he meant the coyotes so to satisfy him I listened for a moment. \nHe was right. </p>\n\n<p>They were getting closer. </p>\n\n<p>If I had to guess I would say that when I first heard them that they were  maybe a mile or so away. A distant sound that wasn’t of concern. But as I listened, the yipping and yapping got louder as they got closer and closer. This was odd. Normally they stay a comfortable distance away.  I still wasn’t too worried. Coyotes were normally very timid. Pesting but timid. </p>\n\n<p>I waited some more. Listening. And the sound just kept getting louder. After a few minutes I could hear their footsteps as their claws scratched the dirt and their heaving and labored breaths. They were surrounding the tent. They started scratching the tent. Scraping against the fabric. My heart was racing as fear settled in. This was crazy! The noise was constant. Almost like a white noise that continued for a few minutes. The walls of the tent moving with it as they scraped the tent with paws and snout. We kicked the tent walls and made noises as loud as we could in an attempt to scare them off but to no avail. They continued. Until about 15 minutes after the scraping started,everything went quiet. </p>\n\n<p>A chilling silence that lasted only a few seconds but felt like an hour, when the screaming started. </p>\n\n<p>“IVAN PLEASE HELP ME!!!!! PLEASE THEIR HURTING ME PLEASE!!!!” The voice was that of my mothers. Screaming in pain. So loud I could hear it echoing throughout the camp. It sounded so real.. I was halfway to the flap when common sense kicked in. My mother lived about 2 hours away and it was midnight at a scout camp. Why on earth would she be here? I looked at Michael, who jumped up and went for the zipper of the tent flap door. I grabbed him and told him that it wasn’t real.</p>\n\n<p>“There is no way my mom&#39;s here dude. It can&#39;t be her.” </p>\n\n<p>“That’s my sister!” He said “She needs me. She needs help!!”</p>\n\n<p>I couldn’t believe it for a second.. That was most definitely my Mom’s voice screaming outside the tent. This had to be a trick. I decided to try and break it down logically with him . </p>\n\n<p>“MICHAEL why would she be at camp at midnight??” I said “This can’t be real.” </p>\n\n<p>Michael stopped and thought about it for a minute. “Yah.. You’re right” \nHe sat back down on the floor.</p>\n\n<p>We listened to our close relatives scream in pain and agony for the next hour or so. My dad, my sister, my little brother. Even a close cousin at one point. All of them. Screaming in pure terror  and begging for my help. It was the hardest thing I had ever gone through not to open that tent and help them. \nThen they just stopped. Again silence came to our ears. And then footsteps. But this time they weren’t coyotes. These ones sounded human. Multiple people walking around our tent in circles.</p>\n\n<p>Step after step. </p>\n\n<p>And then a voice said something I would never forget.  It was a low and dark voice. </p>\n\n<p>“Never come back.” It said. </p>\n\n<p>I looked at Michael. He was petrified. His skin was white. And tears slowly dripped down his face. </p>\n\n<p>“NEVER COME BACK OR YOU’LL PAY THE PRICE” The voice said again much louder this time. And with a force that threw us back into our pillows. Whether it was a jump back in fear reaction or the voice actually threw us I couldn’t tell you. To me it felt like the latter. We heard the coyotes again. Right next to the tent start to run away from us. Their yipping and yapping began to fade into the night. </p>\n\n<p>I checked my phone to see what time it was.. 5:30am.. This had gone on all night. </p>\n\n<p>Thinking about what the voice had said I asked “Michael? Where did the aquatics team go last night and what did they do?”</p>\n\n<p>He ignored me for a minute. Still shaking from what we had just gone through. </p>\n\n<p>And then he looked at me and told me what had happened the night before.  </p>\n\n<p>“The aquatics crew went on a night hike.” He said “We had hiked a couple miles when we stumbled on some old grave markers. They looked super old and they and had a language scratched on them that none of us could read. They looked almost native american..” </p>\n\n<p>His head drooped as what appeared to be guilt flooded his conscience.  </p>\n\n<p>“We dug into the dirt where the markers were… We messed with the sites.. We just thought it would be cool if we found something..” </p>\n\n<p>They hadn’t. </p>\n\n<p>“But then we hear someone walking through the woods. Coming towards us. So we ran back to camp as fast as we could.” </p>\n\n<p>Though scared and exhausted as we were, we decided to get ready and head to the early morning staff meeting. </p>\n\n<p>When we sat down the entire aquatics crew were pale and had bags under their eyes. They kept looking over their shoulders like someone was following them. </p>\n\n<p>We were then made aware that we would be evacuating camp due to a nearby forest fire. It was quite a ways off but it was coming this way and we wanted to be safe. So after evaccing the camp, getting all the scout troops and staff out we headed home. </p>\n\n<p>When I got home I got on my computer, still haunted by the events of the previous night and started doing some research. I searched the area and any records of cemeteries there but came up with nothing. Then, remembering what Michael had said about the markers looking native american, I searched Native Americans Burial Grounds in Utah and after clicking on a few of the links came up with some information about supernatural findings and happenings at those locations. </p>\n\n<p>They were called Skinwalkers. Native american burial ground guardians who protect the sites of their ancestors. Who can shapeshift into animals and mimic loved ones. Who have been known to kill those who mess with gravesites or disrespect their tribes tradition. When I read this, I knew. What we had heard and experienced that night. What we had felt. Were Skinwalkers. </p>\n\n<p>To this day I am careful with the history of the native american people. I show as much respect as possible when even discussing their history. </p>\n\n<p>Believe me or don&#39;t. But everytime I see anything that has to do with Nat8ve Americans, something in a museum, or maybe wall paintings. I hear the screams of my family in agony as they beg for my help. And the feeling I had being able to do nothing for them. The feeling I had as that Dark and low voice said that If I messed with that stuff that I would pay the price. </p>\n</div>\n","author":"goceltics556"}