{"rank":"0","title":"The Return of the Skateboard Man [PT.2]","id":"8luj45","url":"/r/nosleep/comments/8luj45/the_return_of_the_skateboard_man_pt2/","time":"1527183368000","body":"<div class=\"md\"><p><a href=\"https://www.reddit.com/r/nosleep/comments/8lkrtv/have_you_ever_heard_of_the_skateboard_man/\" rel=\"nofollow\">Part 1</a></p>\n\n<p>I’m writing this the morning after when the Skateboard man said he was going to come back. Here’s how I’m not dead yet.</p>\n\n<p>So, during the day, my first priority was alerting the police. Apart from taking my sister’s corpse away, they told me they’d keep a squad in the area and to give them a call if anything happened. Next, I made a makeshift weapon from a pitchfork with my sharpest kitchen knives on the end. I wasn’t going to let my sister go unavenged. Tonight, the Skateboard Man’s reign of terror ended. Thanks to the commentators on my previous post about what happened yesterday, I worked out that I should find a vantage point. I decided to use my bedroom wardrobe. I put the landline phone up there and made sure that the number the cops told me to call was on speed-dial. I was ready to face the inhumane being that called itself “The Skateboard Man”. Around 21:00, I hopped up onto my wardrobe. I had a sheet of paper up there that contained my plan.</p>\n\n<p>The first step was that I left the back door open. This would make him think that I made a mistake, and he would come in through there. That was the trap. From there, a brick was positioned to fall on his head when the door opened. Yes, I know, how very Home Alone-esque of me.</p>\n\n<p>Around midnight, I heard the back door open and then the sound of the brick falling with a satisfying thud. I rejoiced, I was sure he was dead. That’s why I was so surprised when I heard his gut-wrenching sound.</p>\n\n<p><em>Tk chhhhhhh, Tk chhhhhh, Tk chhhhhh</em></p>\n\n<p>I froze. How was he still alive, hearing him getting closer, I grabbed the phone and called on the police. I was met with the buzz of a dead phone. Dammit! This <em>creature</em> was smarter than I thought. He’d cut the phone line. I started panicking, but then remembered my mobile phone was on the other side of the room. Without a moment of hesitation, I jumped halfway across the room from my perch and nearly tripped over myself as I lunged for my phone. I snatched it from the desk and turned around only to be met with the door creaking open. And out from behind it, he appeared. I expected him to be on the verge of death, but instead he just had a large brick-shaped divot in his head. That confirmed my suspicions that this was not a human I was fighting.</p>\n\n<p>No way out for me now, with my weapon lying by him next to the wardrobe. And just like that, I knew that I only had one way out of this. I dove forwards and grabbed my pitchfork just as I felt the cold metal of one of his knives penetrating my back. I reeled in pain, and now with thoughts of my sister attacked him with a rage I thought was impossible. I rolled over and tried to stab him with my weapon, just as he took his knives and started hacking away at me. As I felt myself fading away from the blood loss, I realised that he seemed to be dying too. It was now a question of who would bleed out first. The strange part was that he seemed to be dying voluntarily, as if he was done with this life and move on. I hoped he knew he was going to hell and was going to burn forever. I felt my eyes begin to close as I pierced him one last time with the force of a million burning suns.</p>\n\n<p>And with that, I watched him stop struggling. But instead of dying, he disintegrated into a brown smoke. He’d cut off my legs and most of my right arm. I was going to die. I took one last parting breath with the world, and with that, I breathed in some of the smoke that he had become. </p>\n\n<p>I felt myself gain a new consciousness. A new life. I realised this world needed an arbiter. An avenger. I picked up the knives of my predecessor. And pulled myself onto the old skateboard. My sister’s life would not be taken in vain. I began to pull myself along. I know now who my first target is.</p>\n\n<p>Spread the word. I am coming. Try to hide from me, try to fight me, try to stop me. Consider this your head start. The time is ticking away, hurry up, little sheep. Or else the shepherd will come. </p>\n\n<p>*Have you ever heard of the Skateboard Man? *</p>\n\n<p>Oh, I am so much more than just someone lying on a skateboard.</p>\n</div>\n","author":"themattmace"}