{"rank":"26","title":"Don't Answer Strange Voices in the Night","id":"8lull4","url":"/r/nosleep/comments/8lull4/dont_answer_strange_voices_in_the_night/","time":"1527183889000","body":"<div class=\"md\"><p>“Nancy…” it whispered.</p>\n\n<p>I lay still in bed, sweat covering my body, terrified to move. I imagined that voice. It had to be a dream.</p>\n\n<p>“Nancy,” it breathed into the dark, “come out here.”</p>\n\n<p>Petrified, unable to move, it’s presence is palpable now.</p>\n\n<p>I didn’t answer. Call it superstition. I recalled a story my brother told.</p>\n\n<p>“Don’t ever reply to voices at night time. It’s evil spirits that want to come in,” my oldest brother had said.</p>\n\n<p>This was a dumb Thai superstition he had been trying to scare our middle brother with. Instead, he scared me.</p>\n\n<p>I had heard him through the wall, failing to whisper. I clutched my blanket around my head and tried to ignore the house speaking in creaks and groans that night. All to no avail.</p>\n\n<p>&nbsp;</p>\n\n<p>That was years ago, long since forgotten, only now the memory has resurfaced. Whatever this is, it doesn’t sound like the usual voice of our house. </p>\n\n<p>It sounds human, or as though it’s trying to be. It chitters as it paces in the moonlit hallway. </p>\n\n<p>Muttering words that sound stolen from overheard conversation. </p>\n\n<p>I can hear it&#39;s nails tapping and dragging, and I don&#39;t dare to breathe more oxygen than the bare necessity. Fearing what could happen if I accidentally communicate with it.</p>\n\n<p>I learned years ago that the story wasn’t something my brother made up. It was a commonly held superstition in Thailand. </p>\n\n<p>My mother confirmed as much the following day when I’d asked about it.</p>\n\n<p>“It&#39;s true darling, but your brother shouldn&#39;t say these things. You don’t have to believe, but never offend the spirits” she stated, holding my young hands in hers.</p>\n\n<p>She never found spiritual things funny, they were always serious. I understood now that to joke about them was to offend them. The consequences of offending a spirit weren&#39;t worth laughing over. </p>\n\n<p>&nbsp;</p>\n\n<p>Even if she had never revealed this superstition to me, I wasn’t going to reply. That’s for damn sure. Nobody spoke English in this village, except for my family. None of which were supposed to be home. </p>\n\n<p>And unlike the one that was slowly growing louder and closer to my door, I knew all their voices.</p>\n\n<p>The hair on my neck prickled and I felt my skin ache in fear.</p>\n\n<p>Praying to Gods I never worshipped. Making promises to them of devotion if they only helped me through this night.</p>\n\n<p>Then my prayer worked. Help came in the form of my panting guardian scratching at the bed. Asking permission to join me.</p>\n\n<p>I finally felt some of the fear lift. If he wasn&#39;t barking, then I was imagining things. </p>\n\n<p>I ignored the previously perceived threat and patted beside me, “here boy”. My goofy hound jumping up at the invitation. He joined me on the blanket near my feet.</p>\n\n<p>Only now I’m stuck here, blanket still over my head like when I was younger. Humidity rising, as I refuse to move anything but my thumbs to type. I haven&#39;t dared to look away from my phone.</p>\n\n<p>It turns out that whatever I heard, is not my imagination. It knows I’m awake. It knows I can hear it murmuring.</p>\n\n<p>And I think I just invited it into my bed. </p>\n\n<p>Because I hear my dog barking. Loud and menacing, and I can hear him running outside my window.</p>\n\n<p>Whatever is at the foot of my bed just whispered: “thank you for letting me in…”</p>\n</div>\n","author":"TepidlyThai"}