{"rank":"643","title":"Every Day I Die","id":"8lut2n","url":"/r/nosleep/comments/8lut2n/every_day_i_die/","time":"1527185458000","body":"<div class=\"md\"><p>Every day I live a life just like you perhaps might. I wake up and eat breakfast, go to work then eat lunch, finish work and eat dinner. I might enjoy drinks or movie out, but at some point, I crawl into bed and I eventually sleep. The varied details are not relevant to my predicament, my day is generally like many other days in many other lives. What differs is that every time I drift off to sleep, I immediately awaken.</p>\n\n<p>I used to think they were elaborate dreams. I remember being a child discussing dreams with friends and witnessing their confusion when I asked “Who were you last night?” Blank stares were followed by their continued conversation of nightmares, monsters, flying a jet plane or exploring magical worlds. It sounded fun and incredible, and I envied them. My dreams, every one of them, were reliving the final moments of a stranger before their life was extinguished.</p>\n\n<p>I’d awaken in a hospital bed, my skin spotted and wrinkled, unfamiliar family members at my side and tubes shoved deep in my nostrils. The family would call me Barbara or Janice or Nana, tears streaming down their faces as they told me they loved me and heaven awaited. I’d ask where I was and who they were. I’d explain my name was Michael and I was eight, and they’d break down into fits of tears and mumble words I’d first hear then. Words like dementia, Alzheimer&#39;s and Huntington’s disease. They’d weep and whimper as I faded away and then I’d wake up drenched in sweat, back in my bed and back in my young body.</p>\n\n<p>Other days I fell asleep and woke in automotive plants or car repair shops. Some large, tanned men with oil-stained overalls would shout a name repeatedly before I realized they were speaking to me. Angry faces confronted me, accusing me of drinking on the job, threatening my termination and I’d be ordered to get back under a suspended Chevy or remove the loose, steel part clogging a conveyor belt and the likes. Soon after a four ton car would drop down, crushing my chest with an excruciating crack, or my uniform’s sleeve would catch in the belt as it was accidentally turned on, yanking me inward to be mangled with white hot pain as I screamed. Panicked shouting would fill the space as I bled to death, and I’d then wake up, damp and feverish in my bed once again.</p>\n\n<p>I talked to my parents, and they explained dreams were simply that. They were the mind’s playground of coping mechanisms, and maybe I should focus on figuring out what I wanted to do with my life rather than fixating on death, but I couldn’t control it. Every night I dreaded falling asleep. I’d even sneak into my parent’s coffee beans and chew them to stay awake, but eventually, even if a day later, it would happen all over again.</p>\n\n<p>I’d be floating in warm fluid with fleshy walls, my fingers tiny and warm. I breathed underwater somehow, by some tube from my belly, and I smelled what my mother smelled outside. I felt shivers as she grew distressed, and I felt the cord around my neck, strangling me as my blood flow stopped until I awoke.</p>\n\n<p>I’d be surrounded by other children, playing in the sand as strange music played, wearing a long, white shirt that extended to my shoes. They kids spoke a language I didn’t understand, and when I asked them what they were saying I received peculiar looks. An explosion deafened me as clouds of dust and red spray burst out, and fragments of bodies littered the ground as screams wailed. I looked to my feet but they were gone, only red flesh spilling from my chest as I faded away to wake in my bed, once again in the warm beams of the sun. </p>\n\n<p>This happened every single night, a new death awaited me, and each day I remembered details of these dreams that I couldn’t have possibly known. I’d wander into the living room as my parents watched the news and I’d see familiar adult faces from the background of a drone strike. I’d peek at my father&#39;s paper and see obituaries of people whose name I had been called by tearful relatives on my deathbed. I’d remember urgent words and tearful goodbyes in Lao, Urdu, German and Japanese. I could recall particular words and details, and when I looked them up later to confirm them, I began to understand these dreams were real.</p>\n\n<p>By the time I was a teenager, I began attempting to intervene with fate by avoiding death. They mostly seemed inevitable, like a dead fall from miles up, wind rippling my skin as I skydived with a defective shoot. I’d try and yank the cord, try to slow my descent to that surreal, expanding Earth below but nothing worked as I slowly plunged to finally slam down on the solid ground with an agonizing crunch. </p>\n\n<p>Another day I was alone in an apartment, seeing my naked, female body in the shower wet from the beating faucet and I slipped out as quickly as possible. I searched for a bed to hide under, but a large, abusive ex still yanked me out by my bruising arm. I smelled the whiskey on his breath as he began spewing horrible curses and demeaning insults before pressing that cold steel to my temple, waking me with a ringing gunshot. </p>\n\n<p>I tried screaming <em>run</em> to those near me as I walked down a tile hall surrounded by lockers. The students stared and sneered at my outburst, but a kid with the rifle burst through those doors nonetheless, mowing them down just before my chest thumped hard and I crumbled to the floor to fade out. I’d read a survivor’s account the next day, that a student had tried to warn them. I knew then I wasn&#39;t simply reliving these deaths, others could hear me.</p>\n\n<p>I read in amazement the detailed accounts from my filling in that made their presence known online. A missionary in the Amazon reported hearing an indigenous tribesman flawlessly recite a new, English-language song he couldn’t have possibly have known about as he lay dying from a snake bite. A news report interviewed a mother who swore her four-year-old child recited Poe’s “The Raven” as fever cooked his brain. That was me in their final moments, experimenting.</p>\n\n<p>I almost began to welcome this useless, unique ability, though every day I had to suffer a very real and often very painful death in someone’s place. I tried to think of ways to somehow benefit from it or help others, but then two nights ago I saw a face as I lay on the bottom of a stairwell, my wrinkled skin bruised purple around my backwards-bending leg as I bled internally. A man peered from over the top of the stairwell, a man with pale skin and meticulously combed black hair who looked not at her, the senior who’d fallen, but through her pupils and into mine. I faded out from my painful injuries and awoke with panic, unable to forget those glaring eyes.</p>\n\n<p>The next time awoke, I lay in the back of an ambulance and a plastic oxygen mask was placed over my mouth and nose. My heart throbbed painfully in my large chest, clearly struggling to function. Before the EMT shut the door to the truck, I saw that tall man once more, closer still, standing in the crowd but staring through me with those ice blue eyes. His narrow face hung slack and his mouth hung slightly open as he leered at me. He was watching me intently as if fully aware I did not belong there.</p>\n\n<p>Yesterday I tried not to sleep as fear grew in the back of my head. Not of the agony of suffocating in an avalanche or snapping bones a dump truck crushes accidentally, but of him. He noticed me, that I tried to change things, to affect things and he now knows I exist. I no longer fear dying those tear-filled, agonizing deaths. I now fear only him. I fear that pale man is going to catch me, and stop me from waking up at <a href=\"https://www.youtube.com/watch?v=EpmlqusgsQc&amp;feature=youtu.behd%3D1\">all.</a></p>\n</div>\n","author":"mrmichaelsquid"}