{"rank":"307","title":"The Corpse Behind Piggy's","id":"8lutl0","url":"/r/nosleep/comments/8lutl0/the_corpse_behind_piggys/","time":"1527185565000","body":"<div class=\"md\"><p><em>911, what is your emergency?</em></p>\n\n<p>“Uhh… there&#39;s like… umm…”</p>\n\n<p>“Sir, I need you to tell me what&#39;s going on.”</p>\n\n<p>“There&#39;s a body here.”</p>\n\n<p>“Where is the body?”</p>\n\n<p>“Outside of Piggy’s on Camelot. In front of the dumpster.”</p>\n\n<p>“I&#39;m sending a car. Are you sure they’re deceased?”</p>\n\n<p>Yes, I was sure they were deceased. They were carved like a thanksgiving turkey. Blood pooled around their mutilated corpse. I couldn&#39;t even tell if they were male or female.</p>\n\n<p>A lot of things go through your mind when you take the nightly trash at your job. Many of those things are unrealistic supernatural fears, but deep down you never actually expect something horrific to actually happen.</p>\n\n<p>You definitely don&#39;t expect to see a dead person laying in front of the dumpster with their entrails hanging out.</p>\n\n<p>I was at a loss for words when I first saw them. I just stared. After reality set in, I panicked and fumbled to pull out my phone and call 911.</p>\n\n<p>“Yes… they are definitely deceased.”</p>\n\n<p>I examined my surroundings in a panic. Thick trees on one side, Piggy’s on the other. Piggy’s was a diner about a mile outside of town, completely isolated with a forest behind it.</p>\n\n<p>The police were there soon enough. I didn&#39;t go back inside and tell any of my coworker&#39;s what had happened. They all rushed out the back door when they saw squad cars go behind the diner.</p>\n\n<p>Some screamed, others just held their hand to their mouth. One of our waitresses, Jenny, was sobbing.</p>\n\n<p>The coroner determined that the victim was a Jane Doe. No identification on her. Nobody came and identified her body for days. Nobody knew how she got there. I was sure she was a fresh kill, blood was still pouring from her body when I found her. Everyone I spoke to had assumed it was an animal.</p>\n\n<p>I took the next week off of work. I couldn&#39;t shake the thought that if I had taken the trash out just a little earlier, I could&#39;ve gotten caught up in that. If there was some animal tearing people apart around Piggy’s, I didn&#39;t want to be anywhere near it.</p>\n\n<hr/>\n\n<p>When I had finally returned to work, it was like the incident had never occured. Nobody made mention of it, nor did anyone act odd around me.</p>\n\n<p>As I entered, the two night cooks, Enrique and Mike, each waved at me.</p>\n\n<p>“How&#39;s it hanging, David?” Mike said.</p>\n\n<p>“Hey Mike! Enrique! What&#39;s up?”</p>\n\n<p>“Enthusiastically cooking breakfast food at night. Because that&#39;s when I want to be cooking breakfast.” Mike gave a very clearly fake smile.</p>\n\n<p>“I&#39;m sorry, cooking? I&#39;ve been doing all the cooking tonight, you&#39;ve just been recapping Westworld,” Enrique chimed in.</p>\n\n<p>“Do you want me to stop recapping Westworld?”</p>\n\n<p>“No…”</p>\n\n<p>Mike and Enrique were best friends and had a great dynamic. They were also the best cooks in town, which is why my boss, Ms. Piggy, put up with their antics.</p>\n\n<p>“Hey, David, how have you been?” My chipper boss walked towards me. We called her Ms. Piggy because she told us to. There wasn&#39;t much explanation outside of that. She was the owner of Piggy’s, a cheery, large woman in her late 40s.</p>\n\n<p>“Hey, Ms. Piggy, I&#39;ve been alright. How about yourself?”</p>\n\n<p>“Trying to get through this dinner rush!” She walked past me with two plates in her hands, delivering them to a couple sitting at a booth.</p>\n\n<p>There was a Mr. Piggy. They started the diner together. Unfortunately, he developed cancer at a pretty rapid rate and had passed years before I started working here. I remember seeing them together when I ate at Piggy’s as a kid. I&#39;m glad that the light in Ms. Piggy’s face never left, despite the tragedy.</p>\n\n<p>“Who&#39;s waitressing tonight?”</p>\n\n<p>“Well, Carly is here. And Jenny is supposed to be but she&#39;s running late.”</p>\n\n<p>As if on queue, Carly walked past me with a stack of menus to bring to a family sitting in the corner. Her high ponytail bounced as she power walked through the diner.</p>\n\n<p>“If she isn&#39;t here in the next five minutes, I&#39;m going to kill her.” Carly’s brows furrowed in frustration.</p>\n\n<p>“Let&#39;s… maybe keep the kill jokes to a minimum there, Carls,” Ms. Piggy said through gritted teeth.</p>\n\n<p>Carly was quick to anger. She was always the one that would kick out disrespectful customers. On my first night shift, I saw her dump a pitcher of water on a drunk guy passing out at the bar.</p>\n\n<p>I clocked in for my shift and started cleaning off tables. Ms. Piggy was a relaxed boss, she didn&#39;t care if I listened to music while I cleaned. I got into a groove and soon forgot that the corpse situation had even happened.</p>\n\n<p><em>Tap tap tap</em></p>\n\n<p>I turned around and took out an earbud. It was Jenny.</p>\n\n<p>“Ms. Piggy wants you to take out the trash.”</p>\n\n<p>“Oh yeah, of course.”</p>\n\n<p>“She wants us to go out in pairs.”</p>\n\n<p>“Oh. Okay. Yeah, let&#39;s go.”</p>\n\n<p>I walked around the diner and collected all the trash bags, making my exit out the back door.</p>\n\n<p>“So, how have you been?” Jenny was standing in the doorway.</p>\n\n<p>“Alright. You?”</p>\n\n<p>“I honestly can&#39;t stop thinking about it. I&#39;ve been late a lot this week because... I just don&#39;t want to come here. I know that sounds dumb, telling you that. I mean you&#39;re the one that got the worst of it.”</p>\n\n<p>“It doesn&#39;t sound dumb. What we saw wasn&#39;t something anyone should see. I&#39;m sorry it&#39;s been haunting you. Have you talked to anyone?”</p>\n\n<p>“Not really… I don&#39;t wanna relive it.”</p>\n\n<p>“If you ever need to, I&#39;m here.”</p>\n\n<p>“You&#39;re such a sweet kid, David. Thanks.”</p>\n\n<p>The truth was that I had nightmares about what I saw. I considered myself to be pretty good at pushing haunting thoughts to the back of my head, so that seemed like my best option. I didn&#39;t want this to be a drag on me.</p>\n\n<p>Jenny and I exchanged a smile and we headed back inside. Being a junior in high school, I was the youngest employee at Piggy’s. Jenny and Carly were the next youngest, but they were already in college. I was the “little brother” of the diner.</p>\n\n<p>Five days later, the woman was identified. Penelope Myers. A transient woman from two states over. She was in her late 30s and nobody had heard from her in years. She was missing several organs when her corpse was examined.</p>\n\n<p>They thought she was going through the dumpster when an animal of some sort mauled her. It didn&#39;t seem likely, as the only wildlife I&#39;ve seen outside of Piggy’s is the occasional snake. There was also the matter of the missing organs, which seemed unlikely for an animal to take. However, there wasn&#39;t many other reasonable options.</p>\n\n<p>Her parents had spent thousands of dollars trying to find her and when they finally did she was just… gone.</p>\n\n<p>I felt guilty after that. The pain her parents must be feeling can&#39;t compare to whatever nightmares I had been having. I&#39;m not one to pray, but I did say a small prayer for Penelope’s family before bed that night. </p>\n\n<hr/>\n\n<p>Going to work that next day was rough. Jenny was late. Again. I entered the diner in the midst of an argument between her and Carly.</p>\n\n<p>“We all saw it, Jenny! But we still have work to do!”</p>\n\n<p>“Just because you can bottle it all up doesn&#39;t mean that everyone else can too. I&#39;m just being very open about what&#39;s going on with me.”</p>\n\n<p>“What about what&#39;s going on with us? We have a job to do here. We’re understaffed as it is. We can&#39;t handle the workload on top of all the reporters and random assholes wanting to ask us a million questions. Get your head out of your ass!”</p>\n\n<p>The diner went silent. Carly was enraged, panting after her last statement.</p>\n\n<p>Jenny teared up. “Look, I&#39;m sorry, I just… It&#39;s really hard for me, Carly.”</p>\n\n<p>Carly’s panting slowed, her face relaxing. She closed her eyes and let out a deep exhale, rubbing her temples and sliding her hands over the length of her ponytail. </p>\n\n<p>“Jenny… I&#39;m…” Carly sighed, “I&#39;m sorry.”</p>\n\n<p>In an act of kindness I found impossible for Carly, she gave Jenny a hug.</p>\n\n<p>“Just… try to be on time more, okay?”</p>\n\n<p>Jenny wiped tears from her face. “I&#39;ll try.”</p>\n\n<p>In unison, Enrique and Mike gave a hardy “awwwwww.” Carly shot a death glare at them and then it was back to business as usual.</p>\n\n<hr/>\n\n<p><em>Tap tap tap</em></p>\n\n<p>“David… Uh…”</p>\n\n<p>“Trash?”</p>\n\n<p>Jenny smiled. “Yup!”</p>\n\n<p>Jenny started to cling to me in the days after my return. She found comfort in being around me. She thought that if I could be strong after what I witnessed, she could be too.</p>\n\n<p>I collected the trash and headed out back while Jenny stood in the doorway. I threw the bags into the dumpsters and she stared off into the surrounding forest.</p>\n\n<p>“When you forget about all of the danger out there, it&#39;s really calm and beautiful, isn&#39;t it?” </p>\n\n<p>“The forest?”</p>\n\n<p>“Yeah. Like, if it wasn&#39;t so terrifying. It would be pretty peaceful to take a walk through there at night. There&#39;s lots of paths you can walk down. That just sounds so relaxing.”</p>\n\n<p>I turned away from Jenny and faced the forest, trying to view it as she did.</p>\n\n<p>“You know, it kinda does.”</p>\n\n<p>“Maybe one day, when I&#39;m not scared anymore, we could do that.”</p>\n\n<p>“That sounds good, Jenny.”</p>\n\n<p><em>Whizzzzzzzzzzzzz</em></p>\n\n<p>“What is that?”</p>\n\n<p>A machine-like whizzing sound echoed from the forest. It sounded somewhere between a weed whacker and a lawn mower.</p>\n\n<p>“Maybe it&#39;s forest maintenance?”</p>\n\n<p>“In the dark? I don&#39;t think so.”</p>\n\n<p>Jenny ran off into the diner and yelled for Ms. Piggy. I stood where I was and looked back and forth at the forest, looking for where the noise was coming from. It sounded like it was getting closer.</p>\n\n<p>I couldn&#39;t identify the direction it was coming from. It wasn&#39;t an animal, it sounded too mechanical to be any sort of organism. Thoughts rushed through my head. I tried to think logically and break down the possibilities.</p>\n\n<p><strong>There was actually forest maintenance happening.</strong> This was unlikely. It was dark.\n<strong>This was an animal.</strong> Nope, this was some type of machine.\n<strong>This was what killed Penelope.</strong> I… really hope not.\n<strong>This was some punk trying to scare us after hearing about what happened.</strong> I&#39;m gonna go with this one and hope for the best.</p>\n\n<p>“David! What are you doing! Get in here?” Ms. Piggy grabbed me by my shirt collar and pulled me inside, locking the door behind me.</p>\n\n<p>The sound was nothing but a dim buzz from inside of the diner. I looked around and saw the concerned faces of my coworkers. Enrique and Mike looked somber, Jenny was sobbing, Carly looked ready to fight, and Ms. Piggy looked furious.</p>\n\n<p>“Are you trying to get yourself killed? I don&#39;t know what the hell that is but you need to stay away from it.”</p>\n\n<p>I&#39;d never seen Ms. Piggy be anything less than smiles and cheer.</p>\n\n<p>“Y-yes. Will do.”</p>\n\n<p>“And starting tomorrow morning, that dumpster is going in front of the diner. I don&#39;t care how unattractive it looks, the safety of you guys is my priority. I should&#39;ve done that to begin with. That was my incompetence, I&#39;m sorry.”</p>\n\n<p>None of us said a word. Ms. Piggy reported the noise to the police, but they found nothing. We didn&#39;t talk about the noise because there was nothing to talk about. We couldn&#39;t confirm if it was related to the death of Penelope or not, but we assumed it to be so. We had nothing to go off of. Just speculation and fear.</p>\n\n<hr/>\n\n<p>The next night, I showed up to my shift in a darker mood. Upon entering the diner, I could see I wasn&#39;t the only one. </p>\n\n<p>Enrique and Mike were quiet, not greeting me or even speaking to each other. Ms. Piggy brought a table their food, only faking a smile when interacting with the customers.</p>\n\n<p>“Oh, hey there, David,” Ms. Piggy said upon seeing me. “We’re short staffed, Jenny hasn&#39;t come in yet and it&#39;s Carly’s day off.” Ms. Piggy sighed, “I should really just hire another waitress.”</p>\n\n<p>I clocked in and just got straight to work, wanting to escape everything. I put my earbuds in and got to cleaning, hoping to never hear that noise again.</p>\n\n<p>The thoughts wouldn&#39;t leave my head. I couldn&#39;t help it, my mind was swarmed with fears about that noise and it&#39;s connection to Penelope’s death. The police had no clue where it came from. That bothered me more than anything.</p>\n\n<p>I&#39;d periodically look around for Jenny. I felt horrible, she was on edge and forced to work at a place that terrified her. As much as I liked her, I wouldn&#39;t have blamed her if she quit.</p>\n\n<p><em>Tap tap tap</em></p>\n\n<p>“Jenny! It&#39;s good to see yo-”</p>\n\n<p>Ms. Piggy stood in front of me.</p>\n\n<p>“Oh, no, sorry. Just me. Do you think you could take out the trash?”</p>\n\n<p>“Oh, of course Ms. Piggy.”</p>\n\n<p>I gathered the trash from around the diner and headed out front, where the dumpster was now located. Ms. Piggy stood watch from the front entrance, just in case. I felt terrible looking at her face. The light had actually left it. Seeing someone so bright and cheery look so gloomy was more than enough to send me into a depression.</p>\n\n<p>She was hurting, it was apparent. Her husband had passed, and now their legacy was in shambles. I wanted to help in any way that I could.</p>\n\n<p>“Maybe we should hire more help,” I said, returning to the front entrance.</p>\n\n<p>“Money’s tight… I could move someone from the afternoon to evening. Things have been pretty slow in the afternoon lately.”</p>\n\n<p>“That sounds like a great idea.”</p>\n\n<p>“You have a good head on your shoulders, David. I&#39;m glad I hired you.”</p>\n\n<p>Ms. Piggy gave me a smile. It wasn&#39;t her usual, cheery smile, but it was good to see some happiness back on her face.</p>\n\n<p>We both entered the diner. And heard a scream. </p>\n\n<hr/>\n\n<p>Ms. Piggy and I sprinted into the kitchen, where the back door was wide open. Enrique and Mike were standing behind the diner. Screaming.</p>\n\n<p>“What is happening?” Ms. Piggy yelled.</p>\n\n<p>Fresh blood covered the pavement.</p>\n\n<p>“We— We thought we heard the noise again and… and…,” Mike was panicking.</p>\n\n<p>In the middle of the bloody mess, a mangled corpse was on the ground.</p>\n\n<p>“What… what,” Ms. Piggy’s voice choked up.</p>\n\n<p>In the middle of the bloody mess, our fellow coworker and waitress, Carly, was dead on the pavement.</p>\n\n<p>Her face was nonexistent, but her trademark ponytail told me exactly who it was. There was no doubt it was her. Our coworker was no more. Just a lifeless, mangled corpse on the ground.</p>\n\n<p>I squatted on the pavement and dry heaved. The smell of copper sat in my nose and mouth. I wish I hadn&#39;t seen that. I wish this all could have ended there.</p>\n\n<p>I wish that was the last body found behind Piggy’s.</p>\n</div>\n","author":"10gentlemen"}