{"rank":"21","title":"I woke up in an alternate universe","id":"8lv8fi","url":"/r/nosleep/comments/8lv8fi/i_woke_up_in_an_alternate_universe/","time":"1527188720000","body":"<div class=\"md\"><p>I woke up to find myself lying flat on the concrete floor of an industrial garage, legs and arms sprawled out against the cold cement. My forehead was drenched from the constant stream of dripping water falling from a sweaty pipe above me. I slowly sat up to realize that I had no idea where I was or how I had gotten here.  What would have caused me to end up in a place like this? </p>\n\n<p>My mind drew a blank.  </p>\n\n<p>As my senses came to, I realized that something was wrong; I was in danger. The sound is what caught my attention at first; a roaring fire off in the distance, a woodcutter going a thousand miles a minute, a deep rolling thunder. I smelt gasoline and smoke mixed with the putrid smell of rot.  My heart began to race as I looked off into the distance at what was creating the commotion. </p>\n\n<p>I felt the air escape my lungs.  </p>\n\n<p>About 100 yards away from me stood an ogre. The thing had to be at least 600 feet tall, with iridescent pink skin, almost like that of a pig. This massive monster wasn’t the cute Shrek you see on the Disney station, no, this thing was massive and mean. Its face seemed to be deformed as it twisted in pain, destroying everything in its path consequently.  </p>\n\n<p>Within seconds, I had the energy of a thousand warriors. Where could I run to hide? I felt so exposed, I was laying in an open garage in direct view of this monster. Where could I run? Who could I call? I had no idea where I was or how I got here.  Sparks flew in the air as the ogre ripped down major power lines. Wildfires quickly spread among the land as the ogre’s destruction split apart trees, houses, and buildings.  There was no motivation for the acts this thing had bestowed. The monster was programmed for one thing, and one thing only; to destroy.  There were no words for the fear I felt at this moment. With how fast and fierce this ogre was moving, I knew I would be dead within seconds if it noticed me.     </p>\n\n<p>My eyes glanced back towards the interior of the garage; a wide-open space with limited hiding spots. I continued to scan the room for a route of escape when out of the corner of my eye, I saw a little girl standing just slightly behind a giant tractor tire leaning up against the metal wall. She stood frozen in fear as we made eye contact. Did this little girl know more than I did what was becoming of our situation? She had to be just three years old, too scared to move, too scared to even cry.  My feet had finally caught up to my brain, I shot up from the slick spot on the concrete, and within seconds, swooped up the girl in my arms and made a run for it. </p>\n\n<p>I darted towards the back of the garage as fast as I could. I saw a hallway to the back-left side of the garage, maybe I could lock ourselves in a back room? It wasn’t much of a plan, but it was better than waiting to be had out in the open.  Just as we rounded the sharp corner of the hallway, a loud explosion sent deep vibrations through the metal walls of the building; I collapsed to my knees. A shriek left the little girl’s mouth, which soon found its way into my shoulder, her eyes shut tightly. My fingers traced the bend in my leg, it felt like my kneecap had split in half.  </p>\n\n<p>My legs shook as I tried to stand once again to run for shelter, almost collapsing once more when my eyes met the beast that had entered. A whole new monster had made a discovery of the industrial garage. I ducked back down and slid beneath a flimsy black tarp. Now I realized what had terrified the little girl, she had seen this thing enter. She knew our time was ticking away.  This thing had the body of a caterpillar, but the head of a bird. Deep indigo feathers rubbed against the metal walls of the building, again, this creature’s only motive was to destroy. The deformed bug had to be at least a thousand pounds, the floor rumbled with each perpetuating footstep. The head of the creature looked like it was confused about what it had become. It was frantically looking around in every direction while the body followed the heads lead, thrashing around the building, crushing everything it met.        </p>\n\n<p>I held the little girl tight against my chest and curled into a ball as the creature frantically ripped apart the garage. </p>\n\n<p>Where am I, how did I get to this place? </p>\n\n<p>Everything grew still at once, and I knew at this point that no commotion was a warning sign; a sign of being noticed.  My eyes slowly crept up to peer out of the opening from the tarp. A long, sharp beak was inches away from us. I felt a million needles prick my skin, dancing beneath the surface of my flesh.  I was sure we would die at that very moment, I took another deep breath and held the girl’s face close to mine. </p>\n\n<p>Another loud crash from outside and the creature was frantic once again; legs sprawled out and body banging up against everything, another creature had made its way into the garage.  We didn’t have long.  What happened next was something I didn’t realize my body could do, I leaped from the tarp and darted down the narrow stairway, careful not to look up at the two creatures battling. </p>\n\n<p>My feet carried us down the cold hard steps, as I prayed we would make it somewhere safe, somewhere to map out a plan.  The concrete walls of the staircase cracked as the monsters went head to head above us. </p>\n\n<p>What kind of nightmare did I wake up to? </p>\n\n<p>I bent down when I got to the bottom of the stairs, just in front of the olive-green door that waited for us at the bottom. The little girl was growing heavy in my arms, but I knew I had no choice but to carry her; she wouldn’t survive otherwise. My hand cupped the cool metal brass of the doorknob and gave it a hard push.  </p>\n\n<p>The basement was pitch black.  </p>\n\n<p>I held the girl tightly to my chest, ensuring that any sobs would be muffled by my shirt as my other hand felt for a light switch. A few more rubs against the wall and I was finally able to flip the switch. Horror melted upon my face as I realized what we had just walked into.  </p>\n\n<p>Hundreds of deformed creatures were feasting upon human remains. </p>\n\n<p>Their legs jutted out like that of a kangaroo, but their torso and arms resembled that of an ant. Don’t get me started on their face, I can’t begin to fathom that memory. The creatures hadn’t noticed our arrival, they must have been blind to the light. Thankfully, the commotion above us had muffled out our arrival.           </p>\n\n<p>I held the girl’s face to my chest, making sure she didn’t see the horrors that we walked in on. Was there anywhere safe to be? Were we going to die? Why couldn’t I remember anything?  My converse scampered up the stairs, praying the battling creatures above us were too consumed with each other to notice us. I made a sharp left at the top of the staircase and continued down the hallway; door, after door, after door, locked.  We had reached the end of the hallway, I thought I was at a dead end when I noticed a big gaping hole in the right corner. It opened to a dirt field that had a single round pipe sticking out with a man running towards it.  </p>\n\n<p>A man.  </p>\n\n<p>He was running like his life depended on it. Three more wide strides and the man dove headfirst into the huge, open pipe sticking out of the ground; a warp pipe. </p>\n\n<p>I looked to the left and saw the ogre, thrashing about, inching closer and closer. Could I make it to the pipe unnoticed? I heard cricket noises coming from behind us, getting closer and closer by the second. There was no way I could stay in this overtaken building.  I feared what I might see if I looked behind me.  I had to make a run for it, and fast. </p>\n\n<p>My feet hit the dirt creating a cloud of dust behind me as I ran toward the pipe. Would I make it in time? Could I make it in time? </p>\n\n<p>The little girl raised her head from my chest and glared up into the sky. A silence swept the air as we grew closer to our escape.  My eyes met the little girl’s, then followed her line of sight to find the ogre gleaming at us. Three seconds passed as the ogre lifted both arms into the air; creating two big fists, he slammed his knuckles into the ground, creating a ripple effect that nearly knocked me over. I could hear the ground shake with each step the ogre made towards us. This was it, I had to make it to that pipe. </p>\n\n<p>I didn’t know where it led to, I didn’t know if it was a suicide mission, the only thing I knew was that we had to get out of this demented world, some way or another.  I could feel the heat of the ogre’s breath, I could smell the sweat of the ogre’s body, and I could feel the anger radiating from him.  </p>\n\n<p>Destroy, destroy everything. </p>\n\n<p>I could practically feel what this creature was thinking. This thing had no soul, this thing was bread from hate; pure evil.  With my legs like Jell-O, I used all my power to leap the last couple of feet into the pipe. </p>\n\n<p>Feet first, then the rest of our bodies fell through the whirling pipe.  A whoosh and a whirlwind later, we had fallen into the middle of a road. </p>\n\n<p>My arms were shaking, I wasn’t sure I was going to catch my breath. Were we alive? Did we make it out of that hell hole? My eyes darted in every which direction, the coast seemed to be clear.  We seemed to be out of danger.  After a few deep breaths, I realized that I recognized this street. We were about three minutes from my house.  </p>\n\n<p>*  </p>\n\n<p>We ended up at the hospital, the doctors were convinced that I had tried to kidnap this girl and get away on foot. I explained up and down what had happened, but nobody paid any attention to my story. </p>\n\n<p>They thought I was crazy; wouldn’t you? </p>\n\n<p>I could see that my family was getting agitated with me.  </p>\n\n<p>“Just tell them what you did! Tell the truth.”  </p>\n\n<p>That’s just it though, I was telling the truth. I was just as petrified as everyone around me. I didn’t know how I ended up in that place, and I hoped I’d never return.  </p>\n\n<p>My boyfriend tried to convince everyone that I was sleepwalking, he tells me to drop the crazy stories; that it was all just a dream.  I know something happened to me that night, I know I was in a different sort of universe. An alternate universe, the future of mankind, an alien invasion on a different planet. I wasn’t sure what I experienced, but I knew this had happened to me; this was real.  </p>\n\n<p>Three knocks on my hospital door and my parents welcomed the doctor in. A clean white lab coat made the doctor look polished, put together, presentable; however, the sweat dripping from his forehead along with his shaky hands made me think otherwise. </p>\n\n<p>My mom was starting to worry, “Doctor, what is it?”  A few stutters later, he finally blurted out what he had been struggling to tell us. I felt my body ice over as he said the words, “The little one, she doesn’t speak a language recognized by mankind.”</p>\n</div>\n","author":"briannaappling"}