{"rank":"0","title":"Music is my life, 3rd verse","id":"8lvfed","url":"/r/nosleep/comments/8lvfed/music_is_my_life_3rd_verse/","time":"1527190207000","body":"<div class=\"md\"><p>Please don’t bother trying to find her / \nShe’s not there</p>\n\n<p>That’s by some old group called The Zombies. Christ, I feel like a damn zombie right now. I haven’t slept in days. I’ve barely eaten. I haven’t touched my computer since...</p>\n\n<p>It wasn’t my fault.</p>\n\n<p>I know they won’t believe me. But you believe me, don’t you? Whoever “you” are, the formless mass of humanity on the other side of this screen. I’ve told you about what happens when I hear music - how the lyrics come true. It happens every damn time. That’s why I hardly ever go out. That’s why I wear earplugs when I do. I try to keep it from happening, but it happens. You believe me… you have to believe me.</p>\n\n<p>It wasn’t my fault.</p>\n\n<p>I was still spending time on the roof of the building across the street from Angela’s apartment. Maybe a couple weeks since I’d started. I’d even set up a sleeping bag so I could spend more time there. I guess I dozed off that night. And my goddamn earplug fell out. I’ve never had one of them fall out before. I’ve never slept with them in before, either, so how was I to know it could happen.</p>\n\n<p>It wasn’t my fault.</p>\n\n<p>I woke up when the sun started to peek over the roof of Angela’s building. I was too groggy to really process that I was hearing the world around me - cars in the street, birds in the trees along the sidewalk, and a radio through an open window in one of the apartments below where I had been camping out. Goddamn oldies station. Goddamn Tom Jones.</p>\n\n<p>At break of day when that man drove away I was waiting / I crossed the street to her house and she opened the door / She stood there laughing / I felt the knife in my hand and she laughed no more</p>\n\n<p>It wasn’t my fault. I didn’t want to do it. I tried to ignore the music. But it always happens.</p>\n\n<p>I keep a Swiss army knife in one of the pockets of the sack that holds my sleeping bag when I’m not using it.</p>\n\n<p>I didn’t mean for this to happen. Angela was nice.</p>\n\n<p>So much blood from such a small blade.</p>\n\n<p>It wasn’t my fault. It was the music. I heard the music, and the words of the song came to pass.</p>\n\n<p>I’m sorry, Angela. I’m so so sorry.</p>\n\n<p>I did my best to clean things up. Used my sleeping bag to get her to my car. It was still early enough that there weren’t many people up and about. Then I drove. And drove. And drove.</p>\n\n<p>I found a nice high bridge over a river. It looked like the water was deep enough that the bag won’t be seen, plus, it’s that drab gray-green that so many cheap sleeping bags are, so it should be okay.</p>\n\n<p>Like anything is ever going to be okay.</p>\n\n<p>Please tell me that you understand… it wasn’t my fault.</p>\n\n<p>It was the music.</p>\n</div>\n","author":"JeffKochosky"}