{"rank":"9","title":"The Hobby Goat","id":"8lvunw","url":"/r/nosleep/comments/8lvunw/the_hobby_goat/","time":"1527193417000","body":"<div class=\"md\"><p>The boy sat, despondent, on a threadbare sofa under the harsh lights at the back of the police interview room. His father and mother sat at the table in the centre, talking and crying. The officer was trying to write everything down, a pained expression hovering somewhere between irritation and sympathy on his sweaty face. A second officer, a slim woman with red hair, watched them silently. Her face gave nothing away. Occasionally her eyes would flick to the boy, calculating. Eventually, he met her gaze.</p>\n\n<p>‘Do you remember anything, Simon?’ Her tone was brisk, cold, cutting across the garbled sobs of the parents. The boy’s father blinked at her, wrong-footed by the question. </p>\n\n<p>‘Why are you asking him?’ he said, an edge of hostility creeping into his voice. That natural parental need to protect. A need that, when denied, resulted in the uncontrolled hysteria currently on display. </p>\n\n<p>‘He might remember something important,’ the stern-faced woman said, still staring at the boy.</p>\n\n<p>The moment stretched as his father struggled to process this. </p>\n\n<p>‘I do remember,’ the boy muttered, ‘I know what happened.’ His father made a pained sound.</p>\n\n<p>The stern-faced woman leaned forward slightly, ignoring his father.\n‘It was the horse,’ the boy whispered, his voice choked and his face pale, ‘the horse took him.’</p>\n\n<p>The day was bright and sunlight glinted from ancient rooftops, sparkling from a thousand reflective sunglasses and shining on the silver bells of the Morris dancers. Winchester had come alive, bursting with the sound of folk-music played on old-fashioned instruments, thrumming with the excitement of small children caught up in the frenzied atmosphere. </p>\n\n<p>Simon and his brother Jamie stayed close by their parents as they moved slowly through the crowds, staring wide-eyed and bemused at the unusual sights.</p>\n\n<p>‘Why do they call them Morris dancers, Mum?’ Simon asked his mother, watching warily as the group of fifteen or so brightly-clothed men and women danced in time, waving their handkerchiefs and stamping their feet. It seemed odd that grown adults should behave in such a curious manner; he’d seen people dance before, but this was different. The oddly choreographed routine and jingling bells, coupled with the frilly and colourful outfits, made him strangely nervous. As though there was something beneath the dance, some deeper meaning covered by an overly cheerful raiment designed by someone trying to imitate “cheerful” without truly understanding it. A dark heart trying to impersonate a light one, and getting it disturbingly wrong.</p>\n\n<p>‘No one really knows,’ his mother said with unlikely confidence.</p>\n\n<p>‘I think it’s Old English,’ Simon’s Dad added, smiling down at his son. ‘I think it used to mean “Moorish”, after the Moors. Perhaps it was their dance first.’</p>\n\n<p>‘Like Othello,’ his mother cut in.</p>\n\n<p>‘Was Othello a Morris dancer?’</p>\n\n<p>‘Well, he was a Moor.’</p>\n\n<p>‘Then I guess he must have been, right?’</p>\n\n<p>‘Would’ve made the play more exciting…’</p>\n\n<p>Simon stopped listening as his brother seemed to freeze by his side. He glanced back over his shoulder in the direction his brother was staring, and felt a chill race up his spine. In the ring of dancers stood a horse. Not a real horse, but half of one of those pantomime horses; the head and front legs. A man in half a horse costume.</p>\n\n<p>The horse was standing stock-still, and the vacant animal stare seemed to look right at them.</p>\n\n<p>And it looked disturbingly real. Not a cartoon horse with floppy ears and a wide smile, no. This one could almost have been alive. A long, flat head, ears sticking out on either side. A wisp of a beard under its chin. Yellow eyes.</p>\n\n<p>Simon jolted with the realisation; that thing was not a horse. He took Jamie by the arm and turned him away, eight-year-olds had no business staring at a man in what appeared to be half a dead goat costume. He glanced back just once as they moved to catch up with their parents. The animal head had turned away and was bobbing comically with the strange music, and on second thought it did look like a horse. Just a hobby horse. Part of the festivities. \nBut he couldn’t shake the thought that as he moved away, those yellow eyes would turn to follow their departure.</p>\n\n<p>‘Did you see that?’ Jamie asked him, tugging on his arm as they headed past a row of pubs and restaurants towards the grounds of the Cathedral. Simon considered lying for a moment, worried about the haunted look on his little brother’s face.</p>\n\n<p>‘I saw, something,’ he said, ‘I’m not quite sure what I –‘</p>\n\n<p>Simon’s half-truth died in his throat as they entered the grassy Cathedral grounds. Tents and booths had been set up all across the field, people with painted faces and refreshment stands rested under the old trees, sheltering from the sun. Everywhere little groups of Morris dancers cavorted and capered with their bells and handkerchiefs, twirling and jumping through their peculiar routines. Oblivious to the weirdness, people strolled about with ice creams and shouting kids, enjoying the sunshine. It was almost too much for Simon.</p>\n\n<p>One dancer, an older woman with grey hair in bunches beneath her brightly coloured bonnet, spun fast and aimed a short white stick squarely at the dancer behind her. He blocked it with a rod of his own, a toothy grin spreading over his bearded face as he twirled away to strike at another dancer, who struck at another. Faster and faster they spun, quicker and quicker came the strikes. For a second, Simon could have sworn they were fighting for real. The beat of their silver bells was like the pounding of a desperate heart, the jangling sound clashing with the increasingly frenzied tune from the lute player behind them. The dancers writhed and flailed, hacking and blocking and snarling their way through the dance as the tune became frantic…desperate…chaotic…</p>\n\n<p>Simon blinked. The dancers smiled and bobbed gently to the soft music. He stood, mouth agape, staring at them. He had just begun to convince himself that he’d imagined it all when Jamie began to cry. </p>\n\n<p>‘Hey, hey kiddo what’s up?’ he said as lightly as he could, kneeling beside his brother.</p>\n\n<p>‘I want to go home,’ sniffed Jamie, looking fearfully up at Simon.</p>\n\n<p>‘I know how you feel, brother,’ Simon smiled, forcing the memory of the disturbing dance out of his mind for the moment. ‘Let’s find mum and dad.’</p>\n\n<p>But their parents had been swallowed by the milling crowds of ice-cream-eating sunshine-junkies. Simon made his way through the swarm as fast as he could, holding Jamie by the hand.</p>\n\n<p>‘Simon!’ Jamie shouted suddenly, pulling him back to where he stood, wide-eyed and pale, staring in the direction of a tent.</p>\n\n<p>An old lady in stereotypical fortune-teller costume sat outside a heavy-looking tent bedecked in stars and strange pictures. She smiled genially at passers-by and waved her little cards around enticingly. Simon recognised them; tarot cards. The lady had an almost comical look about her, a colourful headdress with sparkly coins dangling from it and about twenty shiny bangles on one wrinkled arm. It looked like an outrageously over the top, deliberately silly costume that was actually quite charming. Simon was about to ask what his brother had seen when the lady turned and looked directly at him. She smiled again, but in spite of himself Simon felt a pang of panic at the sight of those aged lips pulled back over those yellowing teeth.</p>\n\n<p>The lady held his gaze, lifting a card from the deck on the table before her. She held it up, obscuring her features. </p>\n\n<p>Simon screamed, unconsciously letting go of Jamie as his hand flew to his mouth. </p>\n\n<p>On the card was his brother’s face. Grey, lifeless, mouth open in a wordless scream. Like a post mortem photo of a murder victim. It shook in the crone’s leathery fingers, as her shoulders quivered with cruel laughter.</p>\n\n<p>‘Jamie!’ Simon shouted, turning away from the old woman and frantically darting into the crowd. He knew his brother couldn’t have gone far, but his mind was a jumble of frantic half-formed thoughts. The folk music was obscuring his mind, making it hard to think. And within the jaunty tune and jingling of bells, he became aware of another melody. Something primal, something deeply wrong, made up of the few discordant notes that to everyone else must have seemed accidental but which together formed a song of their own. A harmony to the sense of wrongness pervading the Cathedral grounds. The accompaniment to the rituals being played out by the dancers. </p>\n\n<p>A subtle hymn to something infernal. </p>\n\n<p>Simon stumbled blindly through the faceless crowds, ignoring the shouts and indignant glares of the strangers he pushed past. He knew he was vaguely headed in the direction they’d come from, hoping maybe that Jamie had gone that way, back to the car perhaps. The jagged melody beneath the cheerful folk music seemed louder than before, the unnatural cadence making him feel sick. It was as though the tune was not made of normal sounds but something other. Un-sounds. Blasphemous resonances emanating from between the instruments’ strings.</p>\n\n<p>Simon slammed bodily into something hard and furry. He stumbled back, partially stunned, and looked up at the monstrous form of the skinned-goat hobby horse. Its yellow eyes bored down into him, and its dead mouth stretched impossibly into a grotesque leer. The stench of something rotten rose from its matted fur. </p>\n\n<p>Simon screamed and shoved past the foul thing, veering away through the crowd of startled carnival-goers.</p>\n\n<p>‘What’s wrong, son?’ a middle-aged man in khaki shorts and sandals asked, grabbing hold of Simon as he ran shrieking past him. Simon stared at him for a second, blinking back tears, before turning to point at the hobby horse, now jovially bobbing its way through the crowd, still missing its back half.  The silly smile and floppy ears were decidedly comical and non-threatening. A child’s friendly mascot. </p>\n\n<p>‘Simon!’ a voice called from behind him, and Simon whipped around. Relief flooded him as his father reached for him, casting a furious glare in the direction of the middle-aged sandal-wearing man. Wrapped in his father’s embrace, Simon collapsed into tears, shaking and burying his head as his father angrily demanded to know what was going on. He could hear his mother trying to calm his father, her voice soft and reassuring. Simon couldn’t make out the words, hearing nothing but his own sobs as they flooded out of him.</p>\n\n<p>Eventually he calmed enough to open his eyes and look up at his parents. The middle-aged man was gone, and they were looking at him fearfully. </p>\n\n<p>‘Where’s Jamie?’ he asked, his stomach turning to ice as he realised his brother was not with them.</p>\n\n<p>‘Oh god,’ his mother whispered, putting her hand on his father’s arm.</p>\n\n<p>Simon leapt to his feet, screaming Jamie’s name, turning in a circle as though he could somehow see through the crowds. He ran blindly through the horde shouting his brother’s name, heedless of the bemused stares of the carnival-goers. He was still shouting it as he crashed through an ice-cream stand, knocking cones all over the grass. He continued to shriek it as his parents wrestled to control his thrashing, even as the ice-cream vendor called the police.</p>\n\n<p>In the back of the police car, on the way to the station, Simon turned to glance once more across the sunlit fields of the Cathedral grounds. The Morris dancers were still dancing. The crowds continued to eat ice-cream. And in the midst of it all, the dead-goat hobby horse gambolled and capered. Its yellow eyes stared at Simon, its grotesque mouth lolling open to show diseased teeth.</p>\n\n<p>But now it had four legs. At the rear end, a small figure twisted and danced to the unnatural tune.</p>\n\n<p>In the brightly lit police station, Simon’s father turned back to the officers. </p>\n\n<p>‘I’m sorry, he’s been through a lot,’ he said. ‘We’ve never had a son named Jamie.’</p>\n</div>\n","author":"StevenDJackson"}