{"rank":"1","title":"The Mauve Lodge: a Confession.","id":"8lvvbe","url":"/r/nosleep/comments/8lvvbe/the_mauve_lodge_a_confession/","time":"1527193545000","body":"<div class=\"md\"><p>There exists among us a unseen force. A group lurking forever in the shadows of every profession. The Mauve Lodge. What is the Mauve Lodge? They are the most elusive and most mysterious of all secret societies in history. Hundreds of historical figures throughout the past four hundred years, from Aaron Burr to David Bowie, have been members knowingly or unknowingly of the Mauve Lodge. Their reach extends from Berlin to Beijing. They are the true international masters.</p>\n\n<p>The delicately gloved hand of the Mauve Lodge is Smith&#39;s invisible hand. The prime mover in the unseen workings of our world economy. Before the collapse of feudalism to progress rule was centralized to small kingdoms. The European example held that property would be passed down in family lines. To keep large kingly holdings from being divided a great deal of interbreeding took place among the elite of Europe. This had very detrimental consequences to the genome of these ancient blood lines. In time the great families of Europe could not longer maintain their success with the disgenic effects of inbreeding taking hold. To ensure the success of these established fortunes a secret group began governing from the shadows. The group today known as the Mauve Lodge arose from the ranks of Europe&#39;s great households, but not its &quot;great&quot; bloodlines, these members of influence are a society of &quot;servants.&quot; </p>\n\n<p>I have received a snippet of their initiation rituals that I will leak here. Much of the sample I was given has been destroyed but a idea of their organization can be glimpsed from these fragments. </p>\n\n<p>&quot;Open the eye of the autumn&#39;s pillar.</p>\n\n<p>Step forward unto the Mauve glow</p>\n\n<p>Face the Goddess. Beglove thy hand. </p>\n\n<p>The initiate takes seven steps into the light and a figure of a chicken is thrown on the rostrum. Silver platter in hand the initiate must perform a improvised tap dance to the accompaniment of the Mauve band. A reenactment of the great founders acts of mediation are enacted through interpretive dance. Then upon a successful performance the tap shoes are ritualistically burned... Upon completion the initiate is ritualistically bathed in oil and a &quot;servants&quot; feast is had.&quot;</p>\n\n<p>The next section is so badly damaged I am not sure I can publish it. But it seems to depict further tasks related to acting, singing, and hosting. In adition to being a good host the member of the mauve hand must be what is known in the acting world as a triple threat; I.e. actor, singer, dancer. This will ensure that they will be ready for any circumstances that may arise.</p>\n\n<p>This society has existed for millennia in their own literature but we have traced back the actual origin to the writing of an alchemical text published in approximately 1611 called &quot;The Hand Servants Guide to the Mauve Arts; as passed down from Henri Francois Fabinio IV&quot;. In which the essential guide to maintaining a civilization is laid out disguised, of course, as the instructions given to a house servant. Any great peace treaty, business deal between nations, unification, and even major war, has had the invisible influences from the Mauve Lodge acting upon it. Though they act in the shadows they are among us. You may know a member but not know it... If you ever see a cloth napkins folded into a dodecahedron then you will know they are there. Every important function with dignitaries from across the world has been infiltrated by this organization. They are the deal makers. The negotiators. The true fixers. The Mauve Lodge is the true elite, making the deals while the &quot;elite&quot; in name only have genetically degenerated to the point that many simply drool their days away in a sedated haze.</p>\n\n<p>It may surprise you to hear but this organization is more powerful than ever in the past. The Mauve Lodge has succeed in subverting the Black Lodge and directing its efforts towards different ends. Everyone is playing useful idiot to the delicate mauve glove.Today the world is not run from the board room. No, It&#39;s run from the coffee room.</p>\n</div>\n","author":"RMFN"}