{"rank":"44","title":"I Think I Was A Sacrifice (2)","id":"8lvy9e","url":"/r/nosleep/comments/8lvy9e/i_think_i_was_a_sacrifice_2/","time":"1527194195000","body":"<div class=\"md\"><p><a href=\"https://www.reddit.com/r/nosleep/comments/8lhmrf/i_think_i_was_a_sacrifice/\">Part 1</a></p>\n\n<p>I got to go home from the hospital finally. The infection is finally cleared up and the symbols carved into me started to scab over. My parents helped me get settled back into the apartment where Scout was waiting dutifully. She had healed up already and bounced happily when I walked back in. Kyle was at my side and helped me down onto the couch. Scout hopped up and her large head was in my lap in seconds.</p>\n\n<p>My parents left with the promise that as soon as I healed we’d consult with a plastic surgeon about the scars and try and push the whole ordeal behind us. Kyle was taking leave from school to be with me and my advisor suggested I wait until fall to think about classes again. He had a substitute teaching my intro to creative writing course and all of my professors pardoned me for the rest of the spring semester.</p>\n\n<p>I just had to worry about getting back to normal life and I had the loving support of my best friend with me. We settled into a routine. With our school stipends we didn’t need to work and were able to relax. The first night home we took Scout for a walk around the block not wanting to overwork me.</p>\n\n<p>The night air was clear and crisp. Kyle held my hand in one and Scout’s leash with the other. It was the first time I felt happiness since the whole ordeal had began. I sighed happily and rested my head against Kyle’s arm as we walked. The blossoms of spring left the air thick with the scent of florals and fresh cut grass.</p>\n\n<p>Crickets chirped into the evening and Scout’s snuffing at the ground ensured it wasn’t too quiet for me. When we got home we ordered pizza and started a new Netflix binge together, Sons of Anarchists. I’d heard about it for a long time but never really had an interest in biker gangs. Kyle suggested it as he’d watched it before.</p>\n\n<p>Before too long my head lolled to the side and I was drifting off to sleep against his arm. He easily scooped me into his arms, being a 6’4 mountain to my 5’3 frame. I was carried to my bedroom and nestled into the covers. Peace washed over me as I fell fully into sleep.</p>\n\n<p>Red. Fire. Flames. Heat.</p>\n\n<p>I gasped as my eyes opened to the same bright red light that emanated from the carved symbols in my stomach. I was suspended in emptiness staring out into that light so bright it nearly burned my eyes. My wounds throbbed and buzzed as they began to burn hotly again. The blood in my veins was cold, my heart was in my throat.</p>\n\n<p>“My love,” a dark, deep, growled voice spoke. It was ancient with an accent of times long lost. The darkness in it shook me to my core, seeding a fear so deep it was primal.</p>\n\n<p>The word “love” sounded twisted, perverted even in its voice. I simply shook in fear.</p>\n\n<p>“You were my portal. Those fools were simply tools that brought me into this world. Brought me to you. You are to be my bride in this plane as I bring it to it’s knees.”</p>\n\n<p>All I could see was the blinding, crimson light. I felt the heat of flames but none of the burn. A whimper escaped my throat. I couldn’t hold it back.</p>\n\n<p>“Wouldn’t you like that? Seeing this world’s corruption, evil, vile things burn around you as you stand at the top at my side?”</p>\n\n<p>I tried remaining silent. My heart thudded loudly in my chest and my blood rushed behind my ears. I wanted Scout. Kyle. My apartment with a glass of wine. Not whatever this voice wanted.</p>\n\n<p>“No,” I whispered.</p>\n\n<p>Everything around me shook violently. The bright light flared into flames that consumed everything around me. I was untouched. I could feel the heat but the flames avoided my skin. The engagement ring on my finger began to burn white-hot and I yanked it off, throwing it into the abyss. Even as I moved the flames seemed to avoid me with intention.</p>\n\n<p>“You are mine. Nothing will come between that.”</p>\n\n<p>I awoke drenched in cold sweat with a scream on my lips. Scout whined as she ran into the room, jumping onto the bed and stepping on Kyle to lay her head on my chest. Kyle snorted awake and sat up, reaching for me. I was wailing and pressing my hands hard into my eyes trying to clear the images of the nightmare. Was it a nightmare? It felt so real.</p>\n\n<p>“Babe, babe,” Kyle soothed, pulling me to his chest and wrapping his arms around me.</p>\n\n<p>“He’s coming for me.” I babbled it over and over again. My voice cracking and devolving into whimpers.</p>\n\n<p>I checked my finger, my ring was still present, but I wiggled it off and found a bright red burn mark under the band. The sobs came harder. It wasn’t just a dream. Even as Kyle held me close and assured me it was.</p>\n\n<p>I didn’t fight against going to the psychiatrist. I already had anxiety and depression, PTSD would just be another tag. Hopefully only one more pill instead of several.</p>\n\n<p>A “classic case” as the asshole behind the desk said. I didn’t want to fight against the diagnosis. Even if I believed it was real no one else would. But it didn’t make me feel any less pathetic when he gave me the script for a new med to take for PTSD and told me to journal my nightmares to go over in future appointments.</p>\n\n<p>The ride back to the apartment was quiet. Even with my favorite bands coming through the speakers and Scouts happy huffing out the back window of my Jeep. I held the Walgreens bag in my lap and stared at the burn on my finger as Kyle drove. </p>\n\n<p>It wasn’t a dream. Whatever they were trying to do, succeeded. Whatever they summoned, was real. Whatever he was, he was coming for me.</p>\n\n<p>I knew mixing alcohol with me new meds was a little sketchy but the wine was the only way I could lull myself to sleep that night. I feared the red space in my dreams. The rumbling voice that seemed from the depths of hell itself echoed in my ears. Kyle hugged me close to his chest and Scout lay next to me. I was safe, but I didn’t feel it.</p>\n\n<p>My dreams met me with darkness. Sweet, blissful, empty, darkness. But I awoke to Scout growling viciously.</p>\n\n<p>“Scout?” I called out into the darkness.</p>\n\n<p>I felt around the bed. Scout was gone and so was Kyle. Her barking grew louder.</p>\n\n<p>“Scout!”</p>\n\n<p>I threw myself out of bed as quickly as I could, untangling from the blankets and stumbling into the hallway. I fumbled for the light switch and wished I hadn’t.</p>\n\n<p>Standing in the hallway was a monster. No. A demon. It. He? Was nothing like they’ve told us. I wish it was. It was hulking. It had to stoop forward in order to not hit its head on the ceiling. It’s shoulders were wide and broadly muscled. A burly torso thick with muscle. Fiery symbols were carved into its chest in patterns akin to tribal tattoos I had seen, but using symbols that reminded me of my stomach.</p>\n\n<p>It looked like it could crush a car with its hands. It’s arms were long and disproportionate, dragging along the ground at its sides, it’s fingers tipped in ebony talons. It’s legs were proportional but ended in clawed toes.</p>\n\n<p>It’s face shook me the most. While it’s skin was as crimson as the light that had summoned it the only thing that made its face inhuman was that it was a little more angular than any human’s. It’s eyes were living flames but shaped as ours were. If it’s body wasn’t that of a monster maybe it would be handsome. It had no hair or horns.</p>\n\n<p>It’s dark lips parted in a mockery of a smile and revealed teeth pointed and likely sharp as razors. My heart was pounding in my ears again. Scout stood just before me, low and growling at the thing. Slobber dripped from her jowls as she continued her vocal assault. But she stood still before me. I looked at the things feet again and realized why.</p>\n\n<p>Scout didn’t want to step on Kyle.</p>\n\n<p>He lay motionless at the thing’s feet. A can of Dr. Soda in his hand. He must’ve gotten up for a drink. His bare chest was ribbons of pink flesh and blood as it pumped from his wounds. His eyes were closed but his chest still rose and fell weakly. I caught a glimpse of a few ribs and my stomach turned.</p>\n\n<p>“Come,” it said.</p>\n\n<p>I looked back up at the creature. It had a taloned hand extended out towards me. I didn’t realize I had to pee until it was running hotly down my leg. The fear outweighed my embarrassment.</p>\n\n<p>“D-don’t hurt her. She’ll try to hurt you but please,” I begged, resting my hand on Scout’s grey coat.</p>\n\n<p>“Your wish is my command my love.”</p>\n\n<p>I almost vomited.</p>\n\n<p>“He, he needs help. He’s going to die.” Tears finally were sprouting in my eyes.</p>\n\n<p>“He was claiming what is mine. He holds no importance to you any longer. You are my bride, not his,” it insisted.</p>\n\n<p>I sobbed quietly, using the hand on Scout’s back to steady myself. Hopefully my neighbor would hear Scout and call the police. That was the hope I clung to as I reached out and took its hand.</p>\n\n<p>Scout lunged at it but as she did we disappeared. The oxygen was pressed out of my lungs sharply and I shut my eyes tightly. I felt my feet touch something silky soft and I gasped for air. My eyes opened and I found myself in a bedroom.</p>\n\n<p>I was on a large bed, four poster with a canopy around it. Candles lined the room and the fireplace mantel. The walls were made of stone and the windows were crisscrossed in wrought iron. While the candles smelled sweetly of calming lavender the musky smell of old still was present.</p>\n\n<p>It was gone, for now. A large wooden door was in one wall but a smaller one was ajar across from me. I got up from the bed and found myself in an updated bathroom. It had a shower and a granite vanity but the original claw foot tub was present. I quickly washed myself and my underwear, not wanting to smell like urine.</p>\n\n<p>I washed my face and neck and tried to steel myself. My neighbor would hear Scout. She didn’t bark at night. Kyle would be okay. I didn’t know what to do about the demon but as long as they were safe I could deal with this.</p>\n\n<p>It doesn’t seem to want to hurt me. It called me it’s bride. I shuddered in fear of what that entailed.</p>\n\n<p>The sound of the other door opening set me moving again. I dried my face and pulled back on my still wet, but now clean, panties. A quick glance around told me there was nothing I could use as a weapon, even if I thought anything could hurt it. I took a deep breath and went back into the room.</p>\n\n<p>The ceilings here were high enough it could stand straight. The ceilings in my apartment had to be at least eight feet high. This thing was huge.</p>\n\n<p>“I hope this is to your liking,” it swept a taloned hand around the room, “my palace was prepared in anticipation of our arrival.”</p>\n\n<p>“It’s nice,” I admitted. “But I don’t have any clean clothes.”</p>\n\n<p>I shifted uncomfortably in my wet panties and grimaced a little. The demon walked over to the dresser and pulled open one of the drawers, revealing it to be full of my own clothes. A chill ran down my spine.</p>\n\n<p>“While I transported you here I also was able to acquire your things from where you were.”</p>\n\n<p>My head spun.</p>\n\n<p>“How can you teleport and gather my clothes at the same time?” I might as well talk to it. I didn’t have any sort of plan.</p>\n\n<p>It smiled, at least, that’s what I think it would call a smile.</p>\n\n<p>“You only have one corporeal body, my love. I’m able to take many at once. I was able to as you say, teleport us here, and also gather all your garments at the same time as there were two of me.”</p>\n\n<p>My head spun. Two bodies, no two versions of it at once? It didn’t make sense.</p>\n\n<p>“Like a copy?”</p>\n\n<p>“No, they are still me, my mind controls them all at once. Human minds are unable to control more than one body at once while I am able to control an infinite amount. But you need rest. We have a big day tomorrow.” It gestured towards the bed.</p>\n\n<p>I didn’t understand how it could split itself but I didn’t need to. I walked over to the bed and crawled into it. I hate to admit the mattress was like a cloud, the sheets soft as divine silk. It walked around and blew out the candles until only one on my bed stand remained. It set a glass of water next to it and sat on the bed.</p>\n\n<p>It ran a talon along the side of my face and tucked a strand of dark hair behind my ear.</p>\n\n<p>“Such beauty,” it breathed.</p>\n\n<p>I gagged silently. But I did want to know.</p>\n\n<p>“What do I call you?” I asked.</p>\n\n<p>It titled it’s head a bit but then smiled.</p>\n\n<p>“They call me Lucifer.”</p>\n\n<p>He exited the room after placing a kiss on my forehead and tucking me in. I don’t know if he forgot to take my phone or didn’t think of it but I’m typing this up because I can’t sleep. I have data, can surf the web, but I can’t send any messages or use the GPS on my phone. I’m hoping keeping you all updated is enough.</p>\n\n<p>I’m going to try to sleep now. I hope tomorrow isn’t what I think it’s going to be. But I think it is. Either way, my best option right now is to play prisoner and play along. Maybe something more later on.</p>\n\n<p>I’ll try and stay strong. But the longer I’m here the more my symbols burn. I just hope I don’t turn into one of them.</p>\n</div>\n","author":"SilverScripte"}