{"rank":"8","title":"Scrolls Of Cydonia","id":"8lw188","url":"/r/nosleep/comments/8lw188/scrolls_of_cydonia/","time":"1527194852000","body":"<div class=\"md\"><p>So I been doing some meditation focusing on the questions if Mars ever had any life on it&#39;s surface. I&#39;ve always wondered, so I have been trying to get answers for like 3 years. Last night while meditating, I finally hit the jackpot. All of the sudden my mind received a vast amount of information about the long ago ancient Mars planet. This is what I received. It was like it was all downloaded to my brain. I have no clue as to where from, but probably just the collective conscious and the message was clear that there is a collective. We are all interconnected.</p>\n\n<p>Before Earth,  known to us as Barrenias, was able to harbor life. A long, long way before, we had 2 suns. The smaller of which was a bit closer to our planet Mars, know by us as Alumn, and provided our planet with the perfect amount of light and warmth. It also had an atmosphere, of course. We were not all that different from you. In fact we are related. But I&#39;ll tell you more about that later. This world was gorgeous, with beautiful pristine seas and crystalline beaches. Giant waterfalls and skies of deep orange like a  sunset on our world. Except all day until the suns went down. The years were 650 days and days were 23 hours long. Winters were snowy and pristine. Summers were blissful and warm. It was truly a sight I was given of this place.</p>\n\n<p>What I also received was a message that Cydonia is, in fact, where they built the original pyramids and ours were also built by them. The Scrolls of Mars were in those pyramids in Cydonia.  And the message told to me was that my people have them hidden from the world. I assume that means the US Government as I am an American. I was told all the information that I was getting is in those scrolls.</p>\n\n<p>I was told that they were very technologically advanced, and that they absolutely did not destroy themselves. They were a peaceful race that lived in balance and peace. But that what had happened was the second sun went supernova and sent microwave pulses on the surface killing those that were near the initial pulse and everyone elsewhere became sick and died slowly, even when they went underground because all the other resources were devastated.  But they had ships that escaped with all the most brilliant minds of their race. They did come to Earth and founded Atlantis, but it was so long ago they had to build a biodome, Atlantis was a floating biodome! When it became evident that the Earth was supportive of life, the people of Alumn destroyed and sunk the remains of their dome. They went into the world and mixed with the early humans, by genetic manipulation.  Basically, they couldn&#39;t really breed with them, in the normal sense of the word. Their genetics were vastly different (at first). We are relatives of their kind. They are our ancestors. And they do not understand why we cause so much chaos.</p>\n\n<p>The last thing I was told is that I should already know this, because my spirit was alive on Mars and I stood and watched in my final moments the brilliant blast of the supernova. It was similar to what we call Aurora Borealis. We knew the end was coming, but it was not the end of our kind. We have family all among the stars still to this day. Other ships went to further planets that were supportive of life. Technically, Earth wasn&#39;t,  but a handful of souls braved the new challenge, and survived.</p>\n</div>\n","author":"_PMmeSkittlesCandy"}