{"rank":"8","title":"Trust me, you DON'T want to become God.","id":"8lw7tz","url":"/r/nosleep/comments/8lw7tz/trust_me_you_dont_want_to_become_god/","time":"1527196299000","body":"<div class=\"md\"><p>Yes, I know it sounds tempting. To have the power to change the way that the world functions at your whim. To be able to manipulate time and space like butter between your fingers.</p>\n\n<p>Heck, it sounds AWESOME to be God.</p>\n\n<hr/>\n\n<p>The Hindus claimed that there was one god, but normal humans failed to comprehend him.</p>\n\n<p>The claimed that God appeared in many forms, and that&#39;s why their religion consists of so many.</p>\n\n<hr/>\n\n<p>Now, there&#39;s a wide majority of people out there that want to &quot;play god&quot;, to have ultimate power. And I&#39;ll admit, I was one of those people not too long ago.</p>\n\n<p>But that was before I died.</p>\n\n<p>You see, I&#39;d felt it coming for a long time now. Every day, I could feel the tumors growing, cells turning upon each other, as my body was embroiled in a brutal civil war.</p>\n\n<p>Nothing could save me, not even Chemo. But my last thoughts while slipping away weren&#39;t frantic, scared, or sad.</p>\n\n<p>I was curious.</p>\n\n<p>Curious as to what lies beyond. Curious as to whether I&#39;d see a scale where my heart would be weighed, whether I&#39;d go to God&#39;s graces or Satan&#39;s hell, or whether there truly was nothing beyond death.</p>\n\n<p>Trust me, death is bad, but what comes after is WAY worse.</p>\n\n<p>As soon as I felt my eyes closing a final time, I could feel my soul drifting away... ever so slowly... ever so gently...</p>\n\n<p>And suddenly I was awake.</p>\n\n<p>I woke up on a slab of metal, unable to move. Creatures that I can&#39;t even begin to describe were crawling over me, leaving viscus trails of green slime behind them as they went.</p>\n\n<p>I couldn&#39;t scream, I couldn&#39;t move, I couldn&#39;t even blink.</p>\n\n<p>Then, slowly, they disappeared into my skin, burying their way through like they had been starved, devouring my flesh, as I felt every single agonizing moment</p>\n\n<hr/>\n\n<p>The Hindus believed in re-incarnation, that we all were reborn after death.</p>\n\n<p>In a way it&#39;s kind of peaceful: you&#39;ll always end up right back on Earth.</p>\n\n<hr/>\n\n<p>I woke up sitting on a comfortable leather chair in front of a balding old man.</p>\n\n<p>&quot;Sup,&quot; he said nonchalantly, to my surprise.</p>\n\n<p>Relieved to finally see another human, I replied, &quot;What were those... WORMS?&quot;</p>\n\n<p>&quot;Ahh, the probes? Don&#39;t worry, that&#39;s only a one-time thing for humans, to purge you of your sins&quot;</p>\n\n<p>&quot;Shit. So do I get punished for those sins?&quot;</p>\n\n<p>&quot;Not at all, in fact, I&#39;m here to reward you!&quot;</p>\n\n<p>&quot;Reward... me? How so?&quot;</p>\n\n<p>&quot;You can have whatever you want. Think about it, you can accomplish whatever you want in the universe, destroy and create universes at whim, and construct your own reality. All you have to do is say yes, and never abdicated the position,&quot; the old man claimed, practically yelling that last bit.</p>\n\n<p>&quot;Say yes to ... what, exactly?&quot;</p>\n\n<p>&quot;To take up my place as god, of course! I&#39;ve grown bored sitting up here watching you guys, I want to go back and get re-incarnated, like you will if you say no.&quot;</p>\n\n<p>I&#39;m pretty sure you can guess what I chose.</p>\n\n<p>Of course being a god sounded great, but that old bastard tricked me.</p>\n\n<p>He said that the probes only purged humans once. He wasn&#39;t lying to me about that. But as soon as I&#39;d said yes, he doubled over laughing. Just as he was fading away, I heard him say,</p>\n\n<p>&quot;You idiot, there&#39;s only one thing more powerful than you in the world, and that&#39;s the probes&quot;</p>\n\n<p>If you STILL don&#39;t understand, let me spell it out for you,</p>\n\n<p>Infinite power = Infinite possibilities</p>\n\n<p>Infinite possibilities = Infinite sins</p>\n\n<p>Infinite sins = Infinite purges.</p>\n\n<p>Now every day, I ask someone else to take up my position.</p>\n\n<p>But I was never a good actor. They see right through my facade, every single one of them. Nobody wants to become god.</p>\n\n<p>Nobody wants millions of worms crawling into their skin every day as they sit by, powerless to stop it.</p>\n\n<p>Not even god.</p>\n\n<hr/>\n\n<p>The Hindus claimed that we were all working towards salvation -- to free ourselvs of the reincarnation cycle.</p>\n\n<p>And I guess they were right, because:</p>\n\n<ol>\n<li><p>There ARE multiple gods, changing and shifting so nobody has to experience those probes</p></li>\n<li><p>In my experience, everyone is reincarnated</p></li>\n</ol>\n\n<p>But most importantly, EVERYONE, including God, is looking for salvation.</p>\n</div>\n","author":"LitLegend27"}