{"rank":"15","title":"The Nightmare People","id":"8lwa0e","url":"/r/nosleep/comments/8lwa0e/the_nightmare_people/","time":"1527196773000","body":"<div class=\"md\"><p>The girl with the cleaver hesitated. Her arm was raised high and the large sharp blade quivered slightly in her small hand as she looked down at the creature by her feet. It was insectine with a sharply jointed angular body and huge eyes that bulged out of its head in obvious terror. She saw in those huge alien eyes a plea that it could never voice in any language she could understand. No animal cry for reprieve or blind survival, those eyes held a deep intelligence, no mere spark, but a green inferno of thought and feeling that tried, in the only way left to it, to reach out to another sentient creature. And Olivia hesitated.</p>\n\n<p>“Whats wrong? Her mother asked placing her hand on Olivia&#39;s shoulder. “Mom could you make it look away from me?” “ No dear” her mother said in an uncharacteristically gentle voice. “You have to look it in the eye that&#39;s the whole point.” “But..but.. I why? It&#39;s easier to kill from behind dad always said so....” she trailed off as she saw the warmth begin to drain from her mother&#39;s eyes. Olivia braced herself, but before her mother could speak her father&#39;s voice seemed to echo around the room. “Tell me what you know about Alistair Been.” She closed her eyes and recited. “He lead the retaking of earth and founded the fleet. He was the first of the nightmare people.” “No dear, not the facts, why did he change, how did he change?” She struggled to find an answer, she knew this, her teacher had told them the story, something about dreams and insomnia but she had forgotten. Her father knew, he always knew those pale eyes saw through her as easily as though she were made of glass and she shivered under his gaze. But the moment passed and he smiled at her all the menace gone as though it had never been. “Come here Olivia let me tell you the story”</p>\n\n<p>Alistair Been suffered bad dreams, ever since he was a boy. Bad dreams were the way other people described them. The same way they described people who obeyed different traffic laws than them or the milk in the fringe. To him they weren&#39;t bad dreams they weren&#39;t even nightmares. Al had something else. When he eventually fell asleep at night, he was consumed by terror. There was no plot to his nights no structure. Just the terror and a constant following presence. He couldn’t bare the thought of what followed him. He could never see it clearly only at the edge of his vision as he desperately ran through landscapes that were so horrible he couldn&#39;t bring himself to remember them in the morning. But, as horrible as the land was, the thing that followed was infinitely worse. When he was 20 years old and had moved away from his parents he tried to confront it. A friend had been spouting pop psychology at him and had said something transformative, something amazing.</p>\n\n<p>He was everyone in his dreams.</p>\n\n<p>He had control. So he tried it what the hell, nothing else had worked. That night he collapsed into bed and fell into his dream. As he waded, as fast as he could, through a lake of human viscera the terror slipped over him. But inside the terror was something else, was it hope? it felt like a little light in the center of his chest not very bright but just enough to turn the darkness away. So with a supreme effort he turned to face his monster.</p>\n\n<p>The light died.</p>\n\n<p>He had always thought, hoped? that the things that frighten us most are the things we know nothing about. He had been wrong. Alister Bean ran from his nightmare. The thing behind him had been both more human than he had feared and less than he had hoped. He woke up screaming! And huddled in his bed the rest of the night wide and irrevocably awake.</p>\n\n<p>That night as he cried to himself in the dark he swore that he would never go back. And he didn&#39;t, Alister Bean stopped sleeping. He thought after the first month that he couldn&#39;t do it, that he would inevitably collapse but he didn&#39;t. He got into a rhythm. He fell into a deep fog. He replaced the vivid terror of his dreams with a slow agonizing monotony. He was so oblivious that he barely even noticed when The Masters came. They didn&#39;t call each other Masters but it was an apt title and no human could pronounce their true name. The masters didn&#39;t really need human labor . Their machines took care of their needs. The Masters came to earth to relive their ancestor&#39;s glorious past they were of the firm belief that only through dominating weaker species could they live full, virile, lives. Most members of their species found them repulsive and backward, a cult of little significance. But as long as they weren’t hurting anybody they could do what they wanted. Humans weren’t considered anybody.</p>\n\n<p>Alister Bean worked in a mine ever since he was 29. It was easier than ever to keep his wakeful schedule, the masters kept the mine brightly lit at all hours to encourage productivity. When the other slaves he worked with stopped for the day to sleep in the brightly lit shaft he would lay down beside them and stare at the lights until he was ordered to rise again. He was dying. He had already been sickly from lack of sleep before the mine but the constant work and cold had, over the years, sapped him. The Masters sometimes gave them injections to keep them fit and healthy but Alister Bean was dying anyway. It was the only form of resistance his sleep deprived mind could conceive of.</p>\n\n<p>And he needed to resist because deep down under the fog Alister Bean hated the masters. He hated them as much as any human being on earth and there were some who had lost much more than he ever had. He wasn&#39;t sure why he hated them so much. Maybe it was the friends on the line he’d seen beaten to death on a whim. Maybe it was the bodies of the dead piled carelessly against the walls to rot. But deep down he feared that it was because the world they were creating looked more and more like his nightmares everyday . He hated the masters so much because they were talking away the only refuge he had from his dreams. Maybe that’s why he did it?</p>\n\n<p>In the middle of a shift a new master came. He walked down the line watching as they worked and occasionally, casually, flicking out his arm and cutting the throat of a worker. They would collapse in silent spasms and die clutching the blood as though that might stop it. Alister clenched his fists. A ripple of fear past down the line. The Master got closer, his arm flicked out more often. People began to run. Alister stayed. The Masters were laughing and pointing. The new one grabbed a human the woman who sometimes sang as she worked and cut her throat spilling her songs on the floor. Alistair began to walk toward them. The fog still clung to him he couldn&#39;t think straight but the anger was so strong that nothing mattered. He was half inside the mine and half in one of the hellscapes from his dreams. He wanted to destroy more than he had ever wanted anything else in his life and nothing was going to stop him. He charged the Masters. All the rage and strength he had built up poured out of him as he charged, nothing could stop him, he felt it.</p>\n\n<p>The Masters didn&#39;t even bother killing him. One of them fired a blackout round into his chest and Alastair fell, hard. Even before he hit the ground he was asleep.</p>\n\n<p>He instantly fell into his dream. He was in the mine around him everyone he had known for the last few years lay dead. Standing on top of the pile of the dead was the presence made flesh, he felt the terror grip him more powerfully than it ever had before and he desperately tried to escape from the dream. Nothing worked all the long honed skills for keeping himself awake failed him. He couldn&#39;t escape. He couldn&#39;t run. He didn&#39;t want to run. The nightmare came closer. He deserved this he was useless. All the power he had ever had all the rage and the courage and the iron will to stay awake had gone into that charge and he had been brushed aside like nothing. Who was this weak sad little coward on the floor of the cave too afraid to even face his own dreams. He separated from his body in the dream. He saw himself weak emaciated weeping on the floor the greatest efforts of his life spent for less than nothing and he saw his nightmare. Even outside his body he feared it feared it more then anything more even than the Masters. The only thing worse than them...It came to him.</p>\n\n<p>The only thing worse than the Masters.</p>\n\n<p>And in that instant he gave into the monster at his back. He allowed it to take him, allowed it to consume him.</p>\n\n<p>no</p>\n\n<p>he was the monster.</p>\n\n<p>In the cave of his dreams the nightmare that had been Alistair Bean ate the annoying human body that had run from it for so long. He tore away the hated face with strong jaws and with every bite he felt the weakness and lethargy leave him. When he was done eating he was alone an incomprehensibly terrifying monster in a cave of the dead. Finally, he was alone, he was everyone in his dreams.</p>\n\n<p>He awoke for the first time in years. The first of the nightmare people stood slowly in the shaft of the mine. Sniffed the air once, and sprinted silently down the shaft toward his prey.</p>\n\n<p>Olivia&#39;s father stood and stretched. “So that&#39;s the story little girl.” “What happend next? Did he get the masters?” “Oh, yes, he hunted them all down. slaughtered them like animals men woman and little children. And after he was done he taught the other humans how to become nightmare people and our ancestors took the Master’s ships. but you know all this. The important thing is how he became the first of us. Now, Olivia enter your nightmare” She knew how of course, they had been teaching it since kindergarden. All she had to do was close her eyes and she was there, as easy as falling. It was a terrifying place full of the sounds of screaming and her parents cold eyes looking down on her as she ran through the dark. And coming after her the whispering monster gliding silently on the floor except for the occasional sound of metal sliding on metal. “Now” her mother said her voice booming through Olivia’s nightmare. “turn and face it” She did. It was worse then anything, worse than her teacher&#39;s screaming worse then the fights they encouraged in school. Worse even than her mother&#39;s rage or her father&#39;s cold cruelty. She wanted to run but she knew she couldn&#39;t she could never move again as her nightmare approached. “Now Olivia remember what i told you, you are the nightmare as much as the little girl.” Some part of her still fought against it some part of her rejected the very notion that she could be something so horrible, but she had been trained for this. Trained without even fully realizing what she was being taught to do. She separated herself from the little girl on the floor the weak cowering thing that couldn&#39;t even run and allowed herself to become the nightmare. It was both the easiest and hardest thing she had ever done.</p>\n\n<p>Before her lay her prey huddled on the floor trying not to look at her. Olivia the nightmare smiled flexing her long fingers as she prepared to destroy this week little creature that polluted her home. She pounced as fast as thought and grabbed the little girl around the throat and tilted her face up. The Nightmare stopped, deep in those green eyes was a spark of defiance, eyes that had just been hers. For a split second Olivia was truly both, the nightmare preparing to kill and the little girl staring death in the face. Olivia the nightmare put down the little girl. They stared at eachother for a moment that lasted centuries. Then the nightmare drew a circle in the dirt around the little girl. “Hide in here, don’t let anyone find you” the monster said it didn&#39;t even notice that those were its first words. The last thing Olivia the nightmare saw before she woke up was the little girl standing in the circle and giving her a pale frightened smile.</p>\n\n<p>Olivia awoke to a world made new, for the first time she felt her own strength. She smiled her predatory smile up at her parents, her father smiled back. Smiled back and handed her the cleaver. This time she didn&#39;t hesitate. She looked the creature right in the eye as she brought down the blade again and again on it’s head until the green fire went out of its eyes and its blood covered her hands and arms. It was incredible, she had never felt so alive as when she hacked away the other creatures life. and when her thin arms became tired and the creature on the floor was unrecognizable she realized she had been laughing with wild abandon her high musical voice made ugly by the effort of killing.</p>\n\n<p>She was weak and shaky as her parents led her out of the cave and into their ship. As soon as she was aboard she stumbled to her cabin. There she slept, and Olivia dreamed of a sad little girl in a circle of light who held her and told her it was all going to be ok. The nightmare child smiled as she slept, it was a very good dream.</p>\n</div>\n","author":"benoodel"}