{"rank":"245","title":"The Night Doctors","id":"8lwcka","url":"/r/nosleep/comments/8lwcka/the_night_doctors/","time":"1527197359000","body":"<div class=\"md\"><p>“Did you lock the door?”</p>\n\n<p>“I think so. Let me check.” This was our nightly ritual. My grandma asked, I checked. The door was always locked, of course. She’d lock it and put the chain on before she bothered to take off her coat. If she had her shopping with her she’d put it down on the thin little side table next to the closet, lock the door, and “forget” the groceries were there so I’d have to put them away. Rituals.</p>\n\n<p>I went to the door. Sure enough, the dead bolt was thrown and the chain was on. We were safe as could be from all the blood-letters and bad men outside. But, grandma wasn’t worried about robbers, or terrorists, or druggies. Grandma was afraid of the Night Doctors.</p>\n\n<p>She claimed she’d seen them once, when she was a little girl. Said they took her friend, Martin. I tried to tell her once it was all old stories, that the Night Doctors were invented by evil men after the Civil War to keep folks like us in line. They didn’t have to exist, and grandma was proof of that. Only the fear of them was required.</p>\n\n<p>She didn’t take kindly to my words. “You call it old tales, I tell you it’s true. I saw them with my own two eyes. It was a long time ago, but that doesn’t make it a lie.”</p>\n\n<p>“I never said you were lying, grandma. But, sometimes we see things we don’t understand, and we tell ourselves they’re something else.”</p>\n\n<p>“I know what I saw. It was early in October, and here we were, not a mile from the Johns Hopkins. I’d just turned fifteen, and oh, was I a handful! I was growing up fast, and I was getting a bit sassy. That very day I’d given your great-grandma some of that sass, and she grounded me for a week. </p>\n\n<p>“Well, I was having none of it. I was sweet on a local boy, name of Martin Young, and I was planning on seeing him after supper. Nothing special, just sit on his front steps and talk. We didn’t have the money for anything fancy like a movie. I didn’t mind, I just wanted to see him. And I told my mother I was going, grounded or not.</p>\n\n<p>“She shook her head. ‘Mabel Johnson, you’re not going anywhere tonight. Of all nights, you are staying inside on this one. Don’t you know what week it is? Those medical students are back to the Johns Hopkins. They’ll be out tonight. You’re staying here.’</p>\n\n<p>“So, naturally, after your great-grandma had gone to bed, I snuck out the window.</p>\n\n<p>“There was a full moon, a harvest moon we used to call it, so bright you could read a newspaper by it. It was only a few blocks to Martin’s house. I was as happy as could be as I walked down the street. You know how it is when you’re young, and you’ve found that first love. I was lost in silly thoughts, so much so that I almost missed them when they came round the corner. The Night Doctors.</p>\n\n<p>“How they didn’t see me, I’ll never know. Four of them there were, and they weren’t fifty feet from me when I saw them. I froze in my tracks for a moment, then instinct took over and I jumped behind a big tree. Good thing I did, when I peeked around it the Night Doctors were looking down the street where I’d been. I started shaking so bad, I had to grab that tree to keep from collapsing.</p>\n\n<p>“I know, those Night Doctors are people, that’s what they say. They’re medical students from the Johns Hopkins, looking for people to take back to their cellars and cut up for study. Evil people, but people all the same. But, that night, I didn’t see people on that moonlit street. Dressed like they were, in black coats that went down to their ankles, and big hats that slouched to cover their faces, they were fiends, straight out of Hell.</p>\n\n<p>“I was lucky that night. Had they come down the street my way, they would have found me, and neither you nor I would be here today. As it was, they kept going down Patterson Street. Soon as they were gone I turned and ran home.” She paused, looking so sad.  “Next day, Martin didn’t come to school. I never saw him again. Everyone said he ran away, but I know the truth. His house was on Patterson. The Night Doctors caught him outside and took him away.”</p>\n\n<p>That was that. Grandma had been living in fear of the Night Doctors ever since. And, Martin? Who knows. Maybe something bad did happen to him. Maybe he did run away. There were all kinds of explanations without dreaming up some phantom corpse hunters. But I’d stopped trying to tell her that long ago. She never got cross with me, in fact, I’d never seen her more sure of anything.</p>\n\n<p>Grandma was still living in the house where she grew up. She and grandpa inherited it from her mother. I moved in with grandma after grandpa passed on. She was slowing down and needed help, that’s true. But I was still on my own and had no one in my life. It was nice to have the company, to have someone to share the stories of the day with. Grandma and I had always had a bond, and living with her was actually kind of fun. I’d moved in late Spring and we’d had a summer of laughter and good times.</p>\n\n<p>Then, September came along, and grandma started getting a little quiet. She’d be outside and I’d notice her gaze drawn in one direction, as if she were looking for something. Was she thinking of her childhood sweetheart? She also started to check the windows and doors more often and make sure they were locked at night. I knew what she was afraid of. When I asked her first time I saw her doing it, she only looked out the window and said, “Students are back.” </p>\n\n<p>I knew she didn’t mean kindergarteners.</p>\n\n<p>Soon enough it was October. The weather was getting cooler, the days were getting shorter. Grandma would do all her errands in the mornings, and was home for the day well before sundown. Even though the weather was still mild she stopped spending her evenings relaxing on the porch, sitting in the living room instead, watching television with the sound up a bit too loud and the window curtains drawn. And always, always, asking me to lock the front door.</p>\n\n<p>Her fear left me troubled. I had to talk to her about it. One night, at the end of the first week of October, I sat down with her to watch television, but didn’t turn it on. “Grammy”, I asked her gently, “are you afraid the Night Doctors are out?”</p>\n\n<p>She looked at me, smiled, nodded. “I know they are. This is the worst time. They’re all supposed to have their bodies by now. There’s things to learn. Those that don’t, the ones who didn’t have someone waiting for them in the morgue, some tired old soul or car accident victim, they’re getting desperate. They’ll be out tonight, and every night until they get someone to drag back to their cellars. Won’t be long, a few days, maybe.” Then she took the remote and turned on her shows.</p>\n\n<p>Just like that. Like it was normal, another part of the world. And it was, to her. To my grandmother, the Night Doctors had been a part of her world since she was a little girl, and long before that. Not my world. Not my superstition. I lived in a world with smart phones and gene therapy, not boogers and haints. As I sat there, watching my grandmother watch television, I knew what I had to do. I needed to go for a walk.</p>\n\n<p>I waited for grandma to go to bed before quietly slipping out the front door, unlatching its sad little chain and releasing the deadbolt before opening it slowly as to avoid its inevitable creak. A few moments later I was on the sidewalk, enjoying the mild breeze and the bright harvest moon that lit everything clear as day yet with a pale blue glow, like it was all a panorama from some ancient, tinted tintype. I had to shiver a bit, to see my familiar world so unfamiliar. If there was a time for ghosts to walk the world, this seemed it.</p>\n\n<p>I didn’t have to think about where I was going. My feet took me there automatically. I walked slowly, calmly, down towards the intersection with Patterson. Most of the houses around me were old bungalows like the one my grandma owned. I wondered if the street as I saw it that night was the same as she had seen it when she had slipped out to see her Martin. Even then, as I approached the corner, I saw to my right the remnant of what must have been a mighty tree, dead and rotted down to its hollow trunk at the edge of the sidewalk. I took so long looking at its bulk, seeming to glow in the light of the harvest moon, that I didn’t notice the men on the corner as they approached.</p>\n\n<p>When I did see them I jumped behind the rotting tree. It was common sense. A woman out alone at night should avoid gangs of strange men. I held my breath and peered around the decaying bole to see a trio of men standing at the corner, dressed in long, black coats, their slouching hats covering their faces. I felt my heart skip a beat.</p>\n\n<p>The Night Doctors were here. And they were looking my way.</p>\n\n<p>Later, after it was all over, I’d try to lie to myself, tell myself I had been seeing things, or that it had just been some guys pulling an ill-advised prank. But at that moment I knew what I was looking at. Under a harvest moon, Death had come in threes, stalking the streets, looking for a corpse. Looking at me.</p>\n\n<p>I pulled myself into the tree’s hollow bulk, scrunched down, praying that they hadn’t seen me. But they had, I knew it. I was trapped, and they were coming. They would drag me off to their cellars, and I would never see my grandma again. All at once I knew my folly. Oh, grandma, why didn’t I believe you?</p>\n\n<p>I heard the sound of approaching footsteps in the grass. I waited for their sinister bulks to come around the tree and blot out the moon. Instead, a teenage boy stood before me. A little boy made of grey, dressed in the clean but threadbare clothes of another time, looking right at me. He raised his finger to his lips, telling me to be quiet. I did, and we watched as the Night Doctors slowly glided by, ignoring the both of us. In a minute they had passed down the street and were gone.</p>\n\n<p>The boy turned to me and smiled. It was then I realized I could see the moon through him. He turned and walked away from the opening in the tree trunk. I took a breath and ran out after him. He was nowhere to be seen. I was alone once more.</p>\n\n<p>That was enough for me. I made my way home, going slowly as I was walking in the same direction the Night Doctors had taken. The last thing I wanted was to run into them again. All the while my thoughts were on the boy. A ghost. Martin’s ghost. Had to be. Had he been waiting for my grandmother all this time? Was this the anniversary of that dreadful night? Maybe he mistook me for her. I did look a lot like her, it’s true. When I was younger, people would say I was the mirror image of her. Couldn’t tell us apart, they would joke. I was even named for her, Mabel. Had Martin mistaken me for her? Come to rescue his sweetheart? I wondered about this right up to the moment I got home, and saw the front door was wide open.</p>\n\n<p>I had forgotten to lock it when I went out.</p>\n\n<p>In a panic I went inside, went straight to my grandmother’s bedroom. That door was open as well, the bed empty and cold. I ran about the house, checking everywhere, before calling the police. They looked everywhere but never found her. I never saw my grandma again.</p>\n</div>\n","author":"TheAncientMarinade"}