{"rank":"7","title":"Do Not Travel on Adrestia Court","id":"8lwh9f","url":"/r/nosleep/comments/8lwh9f/do_not_travel_on_adrestia_court/","time":"1527198411000","body":"<div class=\"md\"><p>Horror Stories don’t take place in the Suburbs. </p>\n\n<p>Well… except for Disturbia, Halloween, Nightmare on Elm Street, Scream, Frightnight, Paranormal Activity…..</p>\n\n<p>Ok, so basically every horror movie is set in the suburbs. But honestly, scary things are supposed to call the city home. People move to small towns like this to avoid the evils of metropolises. Hell, I drove out here to escape from some bad shit myself but now I find myself in a situation that is so fucked and horrifying that even the most desperate crackhead on the streets would pity me. </p>\n\n<p>I am stuck and stranded on Adrestia Court.</p>\n\n<p>You may be wondering what Adrestia Court is and how it could possibly be so bad.  Let me start from the beginning, I will try to be as quick as I can. I am in my car the gas gauge is almost empty and I don’t have a ton of time. Sorry in advance for grammar. </p>\n\n<p>I spent the early part of my life in a small town right outside of Raleigh, North Carolina. Not a huge city but I liked it enough. My dad landed an awesome job at DePaul University when I was a junior in High School so my family moved to Chicago. I immediately was infatuated by the city. The hustle and bustle, the buzz on the street the energy of so many people living and moving at once, it was magic. </p>\n\n<p>The ease with which one could acquire narcotics was pretty great too. In my new environment it was pretty easy to rearrange my new priorities. School, studying, sports, that shit was out. Exploring, partying, getting fucked up in a park at 2 in the afternoon, that’s what mattered. </p>\n\n<p>Don’t get worried, this isn’t one of those sob stories where I join a gang, alienate my family, and ruin my life. Wait, well that’s not entirely true. I did ruin my life but I will get there. My family though, they are still present and accounted for. I did graduate high school though even went to community college for a semester. What I am trying to get across is I was just your average entitled, drug fueled, miscreant kid whose parents had enough money to support me. </p>\n\n<p>But like I said, I did ruin my life. And I have a confession to make. </p>\n\n<p>Late last month in Chicago I was having some drinks with friends. Usually I would have taken public transit, but my dad recently gifted me his Jeep after he got a new car. I was stoked and wanted to show off. We had some drinks at a bar then some shots at another. Someone suggested that we  hotbox my car after wards to “break it in”. </p>\n\n<p>I was too fucked up, I shouldn’t have driven. I had only driven sober like 6 times in the previous year. I should have just taken an Uber. Then I would be safe right now, not trapped in car facing my imminent doom. BTW my phone doesn’t seem to be holding a charge and the gas gauge is drifting below the “E” Line so I better get this story moving a little. </p>\n\n<p>Anyways, I dropped off my friends at their apartment in Lakeshore. And started heading towards my parents place. Like I said, I was fucked up and I knew it. IT was really tripping me out. I needed to relax. Music! That’s what I needed! I decided to take my eyes off the road for just a couple of seconds to put on a song. </p>\n\n<p>I swear to god I didn’t see her. Not until it was too late at least. I was going faster than I should have been, but my memory recalls the moment in slow motion every time the disgraceful thought crosses my mind. I click play on my Iphone, and lift my head towards the road. I catch sight of her and she’s too close, she’s wearing a blue hoodie  and is looking at me with a puzzled expression on her face that is slowly turning into panic. </p>\n\n<p>WHAM. She’s going over my hood and is landing on the road behind me. I swear even over the music I had playing I heard the thud she made when she hit the ground. Her crumpled body in a blue hoodie wasn’t moving, and I wasn’t stopping.  She died. I know she did. It was in the news. </p>\n\n<p>This is my first time really acknowledging it to anyone. I continued my drive home. I got there put my car in the garage and I didn’t leave my house for three weeks. I was sure that at any moment a I would hear a knock at the door. I would hear my mom have a confused conversation with an outspoken man of the law. I would feel the cuffs slip on my wrist as I was escorted to a waiting car. </p>\n\n<p>That never happened. I got away with it. At least I thought I did. </p>\n\n<p>I decided that after that it wasn’t wise to drive my car around the city much. It could still get me caught. My buddy worked for Safelite and replaced my windshield without asking too many questions. I decided that I would drive back to Raleigh, seeing as my Grandmother still lived there and I couldn’t stay sane if I stayed in my house any longer. It was a good plan. </p>\n\n<p>It was a LONG FUCKING DRIVE (like 12 and a half hours). Don’t worry I am not going to bore you with the details. Actually I will tell you one detail as it has a lot to do with my current predicament. </p>\n\n<p>As I crossed into West Virginia, I got a weird text message from a number I didn’t recognize. It was from a 919 area code so I knew it was from the Raleigh area. Anyway it said this. \n*\n<em>“Hey Josh I know this is incredibly random but you came up in a conversation I was having with one of our old friends from Ravenscroft. I realized I never kept up with you after you moved and I wanted to see how you were doing! – Raguel”</em> </p>\n\n<p>What a fucking coincidence right? The name didn’t strike me as familiar but truth be told I didn’t really keep up with anyone after I moved so it wasn’t super surprising. Plus I was pretty sure that “Raguel” was a girl’s name, and seeing as I was about to be in a new (ish) city for a while I figured it may be wise to renew some connections.  I decided to write up a quick reply saying how its crazy she reached out to me when she did as I was actually driving to Raleigh as we spoke and that I’ll be in town for a bit. </p>\n\n<p>She responded insanely fast. </p>\n\n<p>*“Well isn’t that fantastic Josh!! Consider me your welcoming party. Let me take you out to dinner tonight. My treat. – Raguel” \n*\nI let her know I had been driving all day and should probably check in with my Grandma first. But she wasn’t having any of it. </p>\n\n<p>*“Oh come on… let’s have a good time its been too long. You deserve this! Waiting any longer would be an injustice - Raguel” \n*</p>\n\n<p>Being the pushover that I am I caved and asked her where she wanted to meet. </p>\n\n<p>“444 Adrestia Court. 6:00 – Raguel” </p>\n\n<p>I put this Address in my GPS, having some anxiety that it wouldn’t pull it up due to there not being a city or zip with it. But sure as shit there it was. It was in a weird spot on the edge of town somewhat close to Holly Springs. Even in the GPS no town or zip code shows up. Strange but whatever.</p>\n\n<p>The GPs got me to the general area easily enough. I took some back roads, went past some residential neighborhoods and kept going. My GPS said that I should be taking a left On Adrestia ct in 100 feet but for the life of me I couldn’t see anything but a dense tree line on that side of the road. I looked down at my phone to make sure I was seeing it right and when I looked back up I nearly had to slam on my brakes. Right there on my left was a tine neighborhood entrance that was tucked into the trees. There was a small hand painted street sign and a sign with the neighborhoods name that read “Justice Pines”. </p>\n\n<p>I took the left but I swear the trees on either side of me were thicker than hell and this tree line was at least 15 feet deep and incredibly dense. Someone either over planted some trees or they had to clear a shit ton of trees when they built this neighborhood. \nI was slowly rolling down the street and I started looking for house numbers I really wanted to get out of the car and stretch my legs. Something wasn’t right though. There were no mailboxes and none of the houses had the typical numbers by the door. I knew HOA’s could be strict but this seemed excessive. </p>\n\n<p>After driving for what felt like a quarter of a mile I came to the first intersection of this neighborhood. I slowed down to read the street signs on the corner and became incredibly confused. Both the street I was on and the intersecting street were both named “Adrestia Court”…. WTF</p>\n\n<p>I texted “Raguel” and told her that her neighborhood was super confusing, and I was pretty lost. Her reply came back less than a second after I hit send.</p>\n\n<p>“Don’t worry, I will find you.” </p>\n\n<p>I stared at my screen for a second then said aloud “Fuck This Shit”. I pulled a three point turn and made my way out of this creepy ass situation I found myself in. </p>\n\n<p>Even from a distance I could tell something was very wrong. As I got closer, I was able to confirm what I initially saw. The opening in the tree line was gone. Not blocked off, just completely filled in with trees. If it was even possibly the trees appeared be even more dense and looked to go on forever. </p>\n\n<p>I turned around again, it seemed like my only option. I didn’t know what the fuck was going on and felt like I was going crazy. What I saw once the car was reoriented made me think I was definitely crazy. </p>\n\n<p>The scene was similar to what it had been during my first trip down Adrestia Court except this time there were definitely mailboxes and each one had a little sign on top of it. </p>\n\n<p>I was freaked out due to the unexplainable shift but strangely comforted to have a least a little extra direction. I had to slow down to read the numbers…. Except the weren’t numbers. Each sign had just one word, and I began to read as I drove. </p>\n\n<p>I……… Know………..You……….Killed……….Her</p>\n\n<p>I was sweating, hyperventilating, and on the downhill side of losing my shit. I sped up and was going as fast as I possibly could while still maintaining my ability to navigate the streets. I made a turn, then another and another. The roads seemed to wind more and becoming more confusing. The signs were still no help. Every single sign said Adrestia Court. </p>\n\n<p>I turned one more time feeling like a rat in a maze that was being observed. This street had a different aesthetic though. Whereas so far I had not seen a single car in the neighborhood, on this street there were HUNDREDS. To be specific there were hundreds of the same car. My Car. </p>\n\n<p>Red Jeeps were everywhere. Two in every driveway. The streets were lined with red jeeps. As I looked closer they all had the same features. Big dents in the hoods, obliterated windshields, and as I looked down at the road again there was massive amounts of blood. It was literally flowing like rainwater. It took a few turns but I was really happy when the street changed again. </p>\n\n<p>It was for a while at least. It was back to “relatively normal”. I hadn’t paid attention to the houses themselves yet but for some reason my attention was drawn there now. I couldn’t put my finger on what was so interesting. Then out of the corner of my eye I caught a glimpse of something blue. </p>\n\n<p>She was in the windows. In the same blood drenched blue hoodie, standing in every window of every house. That’s all she was doing at first. I sped up trying desperately to flee, to get away, to do anything. As I sped up she started moving. She was raising an arm. At the speed I was going it was if I was watching a flipbook animation. He arm went up and she was undeniably pointing. Pointing directly at me. I don’t know how I know this but she was identifying me. Accusing me.</p>\n\n<p>I shouted for her to leave me alone, to let me leave, to forgive me. It was at that point my phone buzzed. It was a text. No number this time. </p>\n\n<p>“Those decisions are no longer hers, but are mine. Judgement is near. A confession will be made. A price will be paid.”</p>\n\n<p>That’s where my knowledge ends. Since I received that text I’ve just slowly driven through this neighborhood and watched as the sun has slowly started to descend. I don’t have a good feeling about what is going to happen at night but I felt the need to write this and send it out. I don’t know the rules of this place, whatever it is. I can’t send out texts. I have signal but can only visit certain places. I need to get my side of the story out. I don’t even know if it matters. </p>\n\n<p>That catches us up. The car has just run out of gas, and my phone is sitting at 2% battery. Funnily enough I can see the tree line down the road a bit. There is someone standing there it looks like a woman in a white robe. She has something on her face, a blindfold maybe? I have to walk to her, I don’t have another option. If this goes through I hope someone reads it. If nothing else take it as a warning. IDK</p>\n</div>\n","author":"renegadepoly"}