{"rank":"452","title":"I found weird-looking mushrooms in the forest behind my house","id":"8lwi9f","url":"/r/nosleep/comments/8lwi9f/i_found_weirdlooking_mushrooms_in_the_forest/","time":"1527198646000","body":"<div class=\"md\"><p>I wasn’t allowed to walk anywhere alone.</p>\n\n<p>Not with Frank Lonegan on the loose. Suspected of brutally murdering his wife and their unborn son with a dozen stab wounds to the stomach. “You have to walk with Jeremy, okay?” my mom said, as she pulled on her work blazer. “Don’t talk to any strangers. Come straight home.”</p>\n\n<p>I nodded.</p>\n\n<p>But we didn’t come straight home that day. Because, as Jeremy and I walked the short, wooded path between my house and the school, we found mushrooms.</p>\n\n<p>A cluster of three beautiful, white mushrooms. One large, two small, lined up in a perfect row, poking through the moist, black dirt. “Mom said not to stop,” Jeremy groaned, yanking me back onto the path. “Come on. We’re late, anyway.”</p>\n\n<p>But all day, I thought about those mushrooms. I mean, I had only ever seen mushrooms in a grocery store – never in the <em>wild.</em> I told Mrs. Eberhart all about it, and she gave me a nature book from the library. I spent most of lunch reading about different varieties of mushroom.</p>\n\n<p>During recess, I told my friend Mabel. “That’s <em>so</em> cool,” she said, drawing a unicorn on the sidewalk. “Do you think they’re poisonous?”</p>\n\n<p>“I don’t know,” I replied, reaching for the purple chalk. “We shouldn’t eat them, just in case.”</p>\n\n<p>“Maybe I’ll <em>dare</em> you to eat one,” she giggled.</p>\n\n<p>As soon as the school bell rang, Mabel and I took off into the woods, kicking up dirt in our wake. Jeremy followed, muttering something under his breath about “annoying little girls.”</p>\n\n<p>“There! There!” I shouted, pointing to the mushrooms. They poked through the dirt, pale and smooth and perfect.</p>\n\n<p>“I thought they’d have more of a cap,” Mabel said, kneeling in the dirt. “They’re kind of just… round.”</p>\n\n<p>“Some mushrooms don’t,” I said. “Like shaggy ink caps.” I reached for the book and opened it to the mushroom section. “See? Like that.”</p>\n\n<p>She shook her head. “Those don’t look like these.”</p>\n\n<p>I looked at the photo, and then at the mushrooms. She was right; the shaggy ink caps were taller. And they weren’t smooth, like these were. I thumbed through the pages, scanning the different photos; but the other mushrooms looked even more different. Brown portabellas, red wine caps…</p>\n\n<p>None of them matched. These were smooth, stubby, white things with rounded tops that were slightly larger than the stems.</p>\n\n<p>“Guys, we should get home,” Jeremy said, fiddling with his earbuds. “Come on. Mom will ground me <em>forever</em> if she finds out.”</p>\n\n<p>“Let’s pull them up and eat them!” Mabel shouted, ignoring him.</p>\n\n<p>She grabbed the large one. I grabbed one of the smaller ones.</p>\n\n<p>We tugged.</p>\n\n<p>Nothing happened.</p>\n\n<p>“Why – aren’t – they – coming – out?” Mabel huffed, tugging over and over.</p>\n\n<p>“I don’t know,” I said. “But we can always dig them up.” I pushed my fingers into the soil and pawed away. “See, we can –”</p>\n\n<p>I stopped.</p>\n\n<p>Two more mushrooms were buried underneath the soil. Smaller than the others, caked with dirt.</p>\n\n<p>And all five of them were connected.</p>\n\n<p>“I don’t think… mushrooms are supposed to do this.”</p>\n\n<p>We clawed away at the dirt. Digging faster, deeper, like dogs digging for a bone. More smooth, white material lay under the soil. I dug faster, my heart pounding with excitement. These weren’t mushrooms at all! They were something cool, neat, and –</p>\n\n<p>I stopped.</p>\n\n<p>The mushrooms – they were <em>moving</em>.</p>\n\n<p>And then the dirt shifted and roiled, as something large underneath it began to move. Mabel and I backed away. Jeremy grabbed our hands, his eyes wide with fear. “What the hell?!”</p>\n\n<p>The mushrooms shot up.</p>\n\n<p>And that’s when I realized –</p>\n\n<p>They weren’t mushrooms at all.</p>\n\n<p>They were <em>toes.</em></p>\n\n<p>And that’s when something grabbed my ankle.</p>\n\n<p>I screamed. I yanked and thrashed and shrieked, but the grip was incredibly tight. Jeremy rushed towards me; I glanced down –</p>\n\n<p>It was a hand. Pale and white, caked with black dirt.</p>\n\n<p>Jeremy grabbed me by the arms and tugged. I felt the fingers loosen, then finally slip.</p>\n\n<p>And then we were flying across the path, towards the safety of home.</p>\n\n<p>---</p>\n\n<p>The police told our parents the whole story, in hushed whispers that Jeremy and I weren’t supposed to hear. Apparently, to evade capture, Frank Lonegan had buried himself in the soil. He was breathing through a small drinking straw.</p>\n\n<p>My parents and I moved shortly after that. We slowly recovered from the incident, though I was still never allowed to walk to school alone.</p>\n\n<p>But to this day –</p>\n\n<p>I still don’t eat <a href=\"http://www.blair-daniels.com\">mushrooms.</a></p>\n</div>\n","author":"BlairDaniels"}