{"rank":"6","title":"A strange childhood hospital experience.","id":"8lwifg","url":"/r/nosleep/comments/8lwifg/a_strange_childhood_hospital_experience/","time":"1527198689000","body":"<div class=\"md\"><p>When I was four years old I had my first asthma attack. \nMy dad drove me directly to the hospital and they got me breathing again very swiftly. Sadly for me I had to stay over night. I&#39;d never spent a night away from my parents before so it was a daunting idea for little me. but after the attack I was exhausted so it didn&#39;t take too long for me to fall asleep that night.</p>\n\n<p>I woke up early in the morning, no light coming through the large windows of the childrens ward. The only light came from the hallway and made the large cartoon characters painted onto the walls seem to loom over the beds. I could hear the quiet taps of the nurses shoes as they did their rounds. Across the room from me was a boy who was older than me, probably eleven or twelve years old, and I remembered his parents visiting him that evening. I think he was in some kind of accident but was only there for observation like I was. He&#39;d been lively and cheerful.</p>\n\n<p>Here&#39;s where things get strange. The air felt cold but heavy, the ward curtains separating the beds were all pulled back and not one of the kids in those beds moved. I don&#39;t mean they were asleep, I mean I couldn&#39;t see the rise and fall of their chests as they breathed. I couldn&#39;t hear any of them breathing or making any of the small sounds you make when you sleep. I would probably have panicked if it hadn&#39;t been for the nurse whos eyes caught mine. She walked swiftly towards me, her blond hair pulled back into a bun and her uniform looking pressed and neat. She said I had to take my medicine, then pointed to what looked like a glass of orange juice on the bedside table. Her voice was quiet but sharp like one of my school teachers.</p>\n\n<p>Already unnerved and having a deep hatred for liquid medication I refused. The nurse went from blank indifference to anger in an instant and ordered me to drink it, holding it out to me. I refuse and started to cry. At that moment she picked me up under her arm like a sack of potatoes and marched down the ward with me wriggling in her grasp towards an open door. As we got to the hallway I looked both ways for help but despite the many footsteps I&#39;d heard there wasn&#39;t a soul to be seen. I was taken into a small room with a chair, a table and a  nebuliser. For anyone who has never had to use one it&#39;s a machine that basically pumps medication and oxygen into a mask to help people with lung issues. This room looked like a storage closet more than a treatment room. The door was closed behind the nurse leaving me no place to escape.</p>\n\n<p>She sat in the chair and switched the machine on. I hadn&#39;t even seen her load any sort of medication into it as she still had me pinned under her arm. She pulled over the mask and roughly held it on my face, making sure I was breathing whatever was in it. It didn&#39;t smell like the stuff I&#39;ve been given since when my asthma is playing up. It was colder and felt like menthol in my lungs. It was only moments before I became light headed and couldn&#39;t feel my extremities. I stopped fighting and hung limply. The nurse hadn&#39;t said anything to me the whole time, barely even reacting to me. She half carried, half marched me back to my bed where I flopped down and passed out. </p>\n\n<p>I woke up the next morning to an empty ward. The other kids were gone and there was no sign that they had ever been there. I was just so happy to be able to go home and escape that place. I would have assumed that it had been a nightmare brought on by stress, but ever since that night I&#39;ve had a scar on the left side of my ribs. It looks like some sort of puncture mark and it isn&#39;t tiny, like a scar left over from having a tube inserted.</p>\n\n<p>I asked my parents about it and they have no idea how I would have gotten that scar.</p>\n</div>\n","author":"myotishia"}