{"rank":"34","title":"A Girl Named Jane","id":"8lwk7v","url":"/r/nosleep/comments/8lwk7v/a_girl_named_jane/","time":"1527199122000","body":"<div class=\"md\"><p>About thirty years ago, I met a girl. I had just finished college and a few friends and I went on a trip to Florida. On the last night we were there, we went to a club. </p>\n\n<p>It wasn&#39;t the greatest place, but it worked just fine for a group of twenty somethings looking to get drunk and have some fun. It was there that I met her. </p>\n\n<p>My friend was talking to some girl who had a friend named Jane. We started talking and hit it off. It was actually pretty great. </p>\n\n<p>Would have been nice if it had stayed that way. </p>\n\n<p>At the end of the night she left with her friends, but it seemed like she wanted to meet up again, so we exchanged numbers. The next day, I went home and expected I&#39;d never see her again. Regardless, I gave her a call a few days later, and we actually started to arrange meeting. I live in New York, so getting to Florida isn&#39;t all that hard, but it&#39;s tough enough that we could never quite make it work. </p>\n\n<p>That October, after our phone relationship had become about 5 months old, I finally thought I had a day where I could go and see her. I called her to tell her that I would fly down for Thanksgiving when I didn&#39;t have work, but when she answered something sounded different. This was back before caller ID, but as soon as she picked up the phone she knew it was me. Before I could even get a word in, she asked me a question.</p>\n\n<p>&quot;Did I ever tell you about my veil?&quot;</p>\n\n<p>I was confused. Was she married? The way she said it was so monotone, completely unlike anything she had ever said before. I tried to figure out what she could mean before just saying no. Honestly, the question scared me a little bit. Looking back, I wished it had scared me enough to just hang up the phone.</p>\n\n<p>&quot;When I was born, my head was covered in extra skin that looked like a veil. I had to get surgery to remove it, but it gave me special abilities.&quot;</p>\n\n<p>She held the same strange tone of voice the whole time while she said that. I was at a loss for words. Is there any correct response to that sort of thing? I tried to limit what I said for the rest of the conversation, barely ever giving answers that were more than one word. </p>\n\n<p>Right after she explained that to me, she shifted right back into her usual cheerful tone that I was used to, but it didn&#39;t help with how horrified I was. If anything, it made it worse with how she never brought what she had just said up again. It was as if someone else was saying it. </p>\n\n<p>I decided not to tell her I was coming to see her. </p>\n\n<p>The phone calls became less frequent after that. They also became a lot creepier. She&#39;d always start off our conversations by saying something ominous. The most memorable was after my mom died. I got a call from my father telling me she had passed, and then five minutes later, the phone rang again.</p>\n\n<p>&quot;I&#39;m sorry.&quot;</p>\n\n<p>And she hung up. I was worried, but I also didn&#39;t think much of it. It had been a few years now, and by that point I was getting one call once every few months at most. I would never call her because I was too scared, but I would always talk to her when she called. I hadn&#39;t had any girlfriends since college, and I was lonely, so I took what I could get, creepy messages and all. </p>\n\n<p>After that call, however, she stopped calling. </p>\n\n<p>A year passed with nothing.</p>\n\n<p>One day I was feeling particularly lonely, so I gave her a call. No answer. That had never happened before, so it intrigued me. I called once a week from then on, with nothing. </p>\n\n<p>After about four months of weekly calls with no response, someone finally picked up. </p>\n\n<p>It was her friend who told me she was busy with work and couldn&#39;t respond. I wanted to believe her, but I knew she was probably avoiding me. After that I thought I was over her, so I actually started trying to find myself a girlfriend. </p>\n\n<p>I found one but I wasn&#39;t proud of it. I was almost thirty and she was nineteen. Obviously that didn&#39;t last, and I was kind of relieved when she broke it off. That said, it didn&#39;t stop me from being a bit sad about it. That night, I got a call. It had been almost two years since I had heard from her.</p>\n\n<p>&quot;Don&#39;t be sad, she was too young for you anyway.&quot;</p>\n\n<p>I never called her again. About eight years ago, I decided I&#39;d try to find out who she was. Back when everything else happened I couldn&#39;t just look her up online, but now I could. I searched for her on Facebook, and, to my surprise, actually found something. </p>\n\n<p>It was a relatively normal profile, with three exceptions. Every photo was of her alone. Not only that, but she didn&#39;t have any friends. It was as if she lived in her own little world, because the way she posted made it seem like she was speaking to an audience. The third exception was the most terrifying. I looked through her entire profile until I reached her very first status update.</p>\n\n<p>&quot;Been awhile, hasn&#39;t it?&quot;</p>\n\n<p>It had been posted over two years prior and didn&#39;t seem to be for anyone, but I knew who she was talking to. I never made any social media profiles because of that. Four years ago, I got engaged. That night I received a phone call.</p>\n\n<p>&quot;I thought we were-&quot;</p>\n\n<p>I hung up before she could finish. I didn&#39;t recognize the number after all those years, but I blocked it right after. She shouldn&#39;t have even known my cell phone number. One year later, on my wedding night, I got another phone call. Even though the number was blocked, the call still came through, and I was too intrigued not to answer.</p>\n\n<p>&quot;Can&#39;t go back now.&quot;</p>\n\n<p>I had a few guesses as to what she meant, and none of them were good. I&#39;m writing this now because I just received a call. </p>\n\n<p>One hour ago, I got the shortest, and yet somehow most terrifying phone call of my life. I didn&#39;t even consider it could be her. After all, it was on my house phone, and she should have no way of knowing that number. I made sure not to put it online anywhere for this exact reason. </p>\n\n<p>At the moment, I&#39;m terrified. I need help, and I don&#39;t know how much time I have. One hour ago, I picked up the phone and heard one word.</p>\n\n<p>&quot;Here.&quot;</p>\n</div>\n","author":"Afqua"}