{"rank":"13","title":"They came for us in the night (Part 1)","id":"8lwkwb","url":"/r/nosleep/comments/8lwkwb/they_came_for_us_in_the_night_part_1/","time":"1527199278000","body":"<div class=\"md\"><p>Part 2 is up here <a href=\"https://www.reddit.com/r/nosleep/comments/8mcusl/they_came_for_us_in_the_night_part_2/\" rel=\"nofollow\">https://www.reddit.com/r/nosleep/comments/8mcusl/they_came_for_us_in_the_night_part_2/</a></p>\n\n<p>When I got home from work I immediately knew that something was wrong. My German Shepherd, Sarah, would always happily greet me at the front door, tail wagging. She wasn&#39;t waiting for me when I opened the front door, and as I stepped inside, I heard what sounded like static coming from the back of the house. I put my bag down on the table, looking around for Sarah, unable to find her. I followed the sound of the noise down the hallway, back to my bedroom, and discovered it was coming from an old radio that I would keep turned on for Sarah when I went away to work. She had terrible separation anxiety, and listening to the radio seemed to be helping her nervous fits when I had to leave the house. I frowned when I got to the radio, sure that I had left it on an active station. The radio, which was one of those wooden antique units, seemed to be in perfect operating condition, but no matter what station I turned the dial to, I only received static. Somewhere overhead thunder rumbled loudly, and I decided that the house felt suddenly too big and quiet and that I needed to locate my dog.  </p>\n\n<p>&quot;Sarah!&quot; I called out, stepping from my bedroom and back into the living room, &quot;Let&#39;s go outside!&quot; </p>\n\n<p>Silence was my only reply from the house. I began to feel the cold edges of fear creeping into my chest, and fought to stay calm. There was no way she could&#39;ve gotten outside, I had made sure all of the windows were properly locked after the last time she got out. Sarah and I lived in the house that my parents built after they got married. My father was retired Air Force and my mother was an accountant. Both had successful careers, and their marriage produced four children, of which I am the youngest. When they died, I was the only sibling not settled into a steady career or with a family of my own, so it made sense for the house to go to me. </p>\n\n<p>Part of me felt jealous that they had their own lives to look forward to, while all I had was an empty house and my dog. They had had so much more time with our parents and grandparents, it didn&#39;t seem fair. These were the bitter thoughts that I had in my darker moments, consumed by my inability to fit in and find meaningful relationships with friends or partners. The dog was all I had, and the dog was enough. When I went into the kitchen and turned the lights on was when I found her. She was standing at the bay window, staring out at the darkness beyond the glass. </p>\n\n<p>&quot;Sweet girl, what are you doing?&quot; I asked as I approached her. Her tail wagged for a moment, and she resumed her vigil at the windows. &quot;There&#39;s nothing out there, sweetheart.&quot; </p>\n\n<p>But I wasn&#39;t sure if I was saying this for her benefit or for mine. We lived alone out here, on the farm that my parents had built in the latter years of their retirement. The farm went mostly unused now, only a few horses and cattle remained, isolated on separate pastures on the estate. Our closest neighbor was my sister, who lived in the house that she inherited from my grandmother after her death years ago. Her and her husband had just celebrated the birth of their third child a few months ago, and had even saved up enough money to have have a pool installed, which thrilled their children. I remember cynically thinking, “Is this what normal people look like, celebrating such mundanity? Is this all there is to life?” </p>\n\n<p>The sun had long since gone down, and staring out through the glass of the windows, I saw nothing of particular interest in the fields, and wondered if the storm had gotten to Sarah. I had read once that some dogs were frightened of thunderstorms, though Sarah had never before displayed fear or apprehension about them. The area of the country we lived in, the deep South, was a hotspot for bad weather, which both of us had seen our fair share of. Could the weather really be what she was acting strangely about? </p>\n\n<p>I grabbed her leash from the kitchen counter and told her again that we were going outside, which seemed to break the spell the window had had over her. She bounded up to me, tail wagging wildly, and gave me the expected amount of kisses required when seeing me for the first time after I had been gone. We stepped outside into the humid southern night, serenaded by the sounds of the cicadas and crickets, and walked across the carport and into the tall grass beyond the edge of the yard. I remembered when we were younger, how this yard had once been fenced in, and we had spent our childhood running and playing in its confines. That was years ago, before The Storm had come and blown it away, just like it had blown away all of our lives. It began to lightly rain just as Sarah had found a spot that was to her liking, and I wished that I had remembered the thunder and the rain it would bring with it, and had grabbed a jacket on the way out. I casually glanced to the massive forest on the outskirts of the estate, and thought that I had seen movement briefly. Staring out at the dark, I saw nothing further and decided that it was a trick of the light, and that my eyes had been deceiving me. </p>\n\n<p>Suddenly the power went out in the house behind me, the pale illumination from the lights of the kitchen suddenly cut off, throwing us in total darkness. I swore loudly as I turned around to look at the house, noticing that it wasn&#39;t just our house that had lost power, but all of our neighbors as well. The entire countryside as far as I could see in the distance was dark, all of the houses had seemingly lost power at the exact same time. Sarah growled behind me, a deep rumbling noise that made the hair on the back of my neck stand up straight. As I turned around, careful not to get caught up in the leash, I quickly realized why Sarah had growled. Standing a few feet in the distance, half obscured by the tall grass, was a slender bipedal creature of vaguely humanoid proportions. That wasn&#39;t what I noticed first however, as my eyes were drawn to a pair of golden eyes, the glow of which became the only light visible in the field. The rain increased in its intensity, thick heavy sheets began to come down, soaking me thoroughly to the bone. The thing beyond the grass took a step towards us, and Sarah lunged forward, snapping and growling at it. The leash pulled taut, and I wrapped it twice around my arm, bringing her closer towards my body. </p>\n\n<p>&quot;Do not be afraid,&quot; a female voice called out, and I glanced at its face to see movement from its lips but found none. &quot;I did not come here to harm you.&quot; The voice was calm and low, but sounded out louder than the sound of the rain and thunder of the storm, which was in full effect now. </p>\n\n<p>&quot;What are you and what do you want!&quot; I yelled out, the fear in my voice clear as could be. &quot;Stay back!&quot; I warned as the creature took a few more steps towards us, and Sarah growled out a similar warning. </p>\n\n<p>&quot;It is you that called me here, James, and it is you that I have come for.&quot; I was certain this time that the creature&#39;s mouth hadn&#39;t moved, yet I heard the words all the same. &quot;I am speaking to you now in your mind, James. There is nothing to be afraid of.&quot;</p>\n\n<p>&quot;How do you know my name?&quot;</p>\n\n<p>&quot;I know everything there is to know about you, James. I know the things that you want, the things you desire. Your heart called out to us and I have answered.&quot; </p>\n\n<p>Now it was only a few feet away, and as my eyes began to adjust to the darkness, I could make out more of its features. It was tall, much taller than myself. If I had to estimate it, I would put it at seven feet tall. It&#39;s limbs were dark black, and almost seemed to blend in with the darkness of the night. It&#39;s face was framed by two twisting, black horns, that protruded and curled back from its temples. The way the creature walked and held itself up gave me the impression of femininity, but I had no reference in mind to compare this thing to. </p>\n\n<p>&quot;You don&#39;t know me at all, stay back!&quot; I said, glancing around me for a way out of the situation. The reality of my conversation with this thing from a nightmare began to sink in, and the panic and fear began to take over. I had to get away, Sarah and I had to escape. We weren&#39;t safe here.</p>\n\n<p>&quot;There&#39;s no escape, James.&quot;</p>\n\n<p>Lightning flashed across the night sky, and I saw that she was right. There were several other golden eyes shining out at me from the darkness, their eyes burning with fierce intensity, forming a large circle around us in the field. We were surrounded. Several things happened in rapid succession after that realization. Sarah managed to slip her collar, and ran at the creature with the speed and ferocity that is borne of fear and the need for self preservation. I screamed out to stop her, but lightning and thunder boomed out and drowned my voice. The creature held out her hand, the only movement it had made besides walking towards us, and Sarah, inches away from attacking it, was lifted off the ground and thrown several feet through the air, sliding through the mud and coming to an eventual stop on the ground. </p>\n\n<p>&quot;SARAH!&quot; I called out to her, forgetting the situation with the strange creatures, and ran over to her crumpled body on the ground. She wasn&#39;t moving, and her breath came out in short, shallow gasps. Some of her paws were sticking out at irregular angles, and she had broken  several teeth in the altercation. Blood and mud stuck to her fur, and I could feel my heart breaking, an almost literal physical pain. Sarah was all that I had in this world.</p>\n\n<p>&quot;No no no..&quot; I whispered, stroking her soft ears and wiping some of the mud off of her muzzle. I looked up at the female creature, blinking rainwater out of my eyes. The circle was beginning to close, and the golden eyed figures were beginning to take shape as they got closer to us. I could see that they comprised many different colors and heights, but there were only two main body types, slender and muscular. </p>\n\n<p>&quot;We have a long night ahead of us, James. It&#39;s time that we got started.&quot; She walked up next to us as the others began to close in, and I closed my eyes in fear and wished that Sarah and I could wake up from this nightmare. &quot;Prepare yourself for dissolution.&quot; I felt a strange lifting feeling, almost as if the ground had been lifted out from my under my feet, and my vision became black as I lost consciousness.</p>\n</div>\n","author":"MidnightVigil"}