{"rank":"2","title":"I live in an old school","id":"8lwmy6","url":"/r/nosleep/comments/8lwmy6/i_live_in_an_old_school/","time":"1527199766000","body":"<div class=\"md\"><p>My dear readers,</p>\n\n<p>What i am about to tell you is 100% true.</p>\n\n<p>I am a young recent graduated artist,  boy oh boy is the starving artist an accurate stereotype. Because of my low income i had to find an affordable place.  I decided that living “anti-squatting” was the best option. This is how i ended up moving into a classroom. The school i live in was build in 1920 and is a monument, so to say that it has a history would be accurate. </p>\n\n<p>Right above my room is the attic, its in its old original state and you can see the structured woodwork. The ceiling/roof is incredible high and the lights don’t work so I’ve never seen it.\nMy room alone has 4 meter (13.1 feet) high just to give an idea how high the roof is. One of my neighbors hung a boxing bag there, so id regularly heard him practice. </p>\n\n<p>The first few months i lived there there was hardly anything worthy of mentioning.\nBut after about a year or so i started hearing sounds above my head. It sounds like footsteps of a rather sizable human. The sounds usually wouldn’t last long and only appeared late at night. It wasn’t pacing around it only took a few steps when the sound stopped.</p>\n\n<p>This kept happening on and off, after ignoring it  for a while i figured it could’ve been rodents. Its big building after all and i do live in an urban area. I lifted my ceiling panels to have a peek up there, perhaps i could find some mouse droppings. But unfortunately there was nothing more than dust, cobwebs and dead insects.</p>\n\n<p>I decided to ask my neighbors if they went up at night and if so if they would try to avoid it as much as possible. Since i could clearly hear them walk. But they told me they didn’t go there that often (only the one that hung the bag), but he didn’t practice at night.</p>\n\n<p>I kept ignoring it, mostly because I’ve seen enough horror stories to know that investigating at night by yourself is a terrible idea.\nAfter about 1,5 years the sound started to become a bit more frequent at night and it seemed like there were more steps now than before. </p>\n\n<p>One night the steps woke me up again, and i laid there listening where they went. Curiosity got the better of me i wanted to know (and still do) what was walking in the attic at night without really going anywhere. I grabbed my phone to use as flashlight and just incase i brought my biggest knife with me.  I left my room as quietly as i possibly could, but as soon as i stepped into the hallway the sound was gone. I pressed onward and went upstairs. Of course there was nothing to see. The sound had disappeared and whoever was there was gone before i arrived.</p>\n\n<p>I kept doing this every time i heard the footsteps, but every time i found the same empty looking attic.  </p>\n\n<p>Ive been living there for 2 years now, i still hear the steps and i still haven’t found out the source.</p>\n</div>\n","author":"Lady-Lilithh"}