{"rank":"880","title":"An ancient relic in government posession has blinked for the first time in 500 years(Part 2)","id":"8lwv5h","url":"/r/nosleep/comments/8lwv5h/an_ancient_relic_in_government_posession_has/","time":"1527201728000","body":"<div class=\"md\"><p>If you haven’t, catch up on the story by reading part 1 here:</p>\n\n<p><a href=\"https://www.reddit.com/r/nosleep/comments/8lkjah/an_ancient_relic_in_government_possession_has/\">https://www.reddit.com/r/nosleep/comments/8lkjah/an_ancient_relic_in_government_possession_has/</a></p>\n\n<p>Hello again, reddit.</p>\n\n<p>Time runs on me so I must be quick before it is too late, so much has happened in the hours since my previous post. Let me begin to break it down.</p>\n\n<p>The department I work for does not take things (such as blinking coins leaving threatening messages in morse code) very lightly. I had told Dr. Sanchez of what happened about 5 minutes after I collected myself.</p>\n\n<p>Let us not dwell on the past though, at the moment we need to look to the future for even myself being at the forefront of this disaster, am without a clue as to what is next.</p>\n\n<p>The subterranean buildings speaker buzzed slightly before a familiar voice bellowed out in a nervous command “ALL LEVEL 5 PERSONNEL TO THE CENTRAL HUB, THIS IS NOT A DRILL!” and with that, I marched down the corridor pondering what our next assignment would be, given all the chaos.</p>\n\n<p>To my surprise, I was the first couple of people there. I walked up to a fellow colleague by the name of Halloway, he is a tall man with broad shoulders and a serious, blank expression worn at most times that would’ve put even the most miserable looking people to shame.</p>\n\n<p>He looked over to me. “Thought you would’ve ran with the rest.” he let out an expressionless chuckle, without even having to move his mouth much. From behind the monitors Dr Sanchez walked out into the view of the two of us, before he managed to get within speaking distance I looked straight back at Halloway.</p>\n\n<p>“What do you mean by ‘ran’ Halloway?” I wasn’t in the mood for his vague remarks at this point.</p>\n\n<p>“You didn’t hear it did you? Sitting in your office fiddling about with your medallion.” I found my words caught in my throat, there was no way he was supposed to know about the contents of my assignment.</p>\n\n<p>“What? You think that disclosure agreement is still in play here?” He motioned over to the approaching director. “He told us all about it, have you even watched the news from earli-”</p>\n\n<p>He cut himself off when the ground had a faint tremble, the kind that only silence and our carefully listening selves could verify to be true. As if on cue, Dr. Sanchez cut in.</p>\n\n<p>“You two, look at this mess.” He flicked on every monitor in the room that was mounted against the main wall in front of us. The news headlines read; “Numerous earthquakes and fissures appear within the same hour across the globe, population descending into chaos as world leaders have yet to release statements.”</p>\n\n<p>My heart raced, what the fuck would have caused this catastrophe? Every bit of reason told me this could not be, but from the start I knew this was something beyond us all. There were many loose ends in terms of the medallions origin, so we sat there just the three of us for hours picking apart each and every detail.</p>\n\n<p>What we know is that the material that appeared to be some sort of organic type of material that was not bone or wood, however it related closest to stone. The idea that it is living stone is almost unbelievable but at this point given that it communicated with us, we’re just taking in the information as it comes. As for the “M” or the “Core” as Halloway has come to refer to it as, we still can’t figure out what it is made out of.</p>\n\n<p>When it comes to what transpired when it started to blink, we are all at wits end for two main reasons. How could a billions year old object both communicate and know morse code?</p>\n\n<p>Even with the most advanced technology at our disposal, there was one elephant in the room no one cared to mention. Whatever this was, someone or <em>something</em> made this for us to find.</p>\n\n<p>The trembling ground grew more noticeable as the time passed like fluid.</p>\n\n<p>That’s when the medallion started to glow once again. This time it was… different to say the least. The three of us didn’t even say a word, we just stared for a good minute before Dr. Sanchez spoke up.</p>\n\n<p>“It’s telling us where to go.” He proclaimed as he started to pace back and forth while it was in his hand.</p>\n\n<p>“What are you talking about?” Said the now standing Halloway, all the while looking on in awe.</p>\n\n<p>Dr. Sanchez pushed his glasses up a bit before finishing. “Look at the medallion when I move across the room.”</p>\n\n<p>He was right. We both watched the medallion carefully, when he was at the north of the room towards the monitors the glow of the light was faint, but still visible enough. However when he ended up on the south part of the room the light was clearly far brighter.</p>\n\n<p>“Well what are we supposed to do, follow it blankly until we find the source of whatever is causing all this? Sound hardly likely the earth will still be in one piece by the tim-” Halloway was cut off by one quick and loud rumbling of the ground. We are located below ground and I think we all knew this was the worst place to be given the circumstances, but regardless we needed to figure out something before time had run out.</p>\n\n<p>Security personnel had already started to evacuate when Dr. Sanchez beckoned me and Halloway over to the monitors once more.</p>\n\n<p>“There is where we must go.” Dr. Sanchez pointed over in the direction of the monitor furthest left, and there it showed a picture of Stonehenge, in england. However something was noticeably different… in the center of the stone circle there was a truck-sized gaping hole leading straight into the dark, unknown and frightening below.</p>\n\n<p>“I will arrange for the test chopper to get us there in ample time.” Sanchez seemed confident one of the test helicopters recently developed could get us there in time, which given the projected speed I don’t doubt however I was unsure as to the stability of it.</p>\n\n<p>I turned myself back to the exit to prepare myself but I could’ve sworn, the hole that was made… the shape looked too strange to be natural. It was almost as if I could make out knuckle marks on the edges of one side of it.</p>\n\n<p>It was shaped perfectly like a fist.</p>\n\n<p>______________________________________________________________________________</p>\n\n<p>“See? What did I tell you, perfect timing!” Cheered Dr. Sanchez as we all ran out into the field, stonehenge was straight ahead. The rain and thunder had started to pick up and it was increasingly dark out so we quickened our pace as we heard the chopper behind us shut down.</p>\n\n<p>“We will have to go dow-” Sanchez was cut off by a now visibly unpleased Halloway who went on to say “We know.” while I remained silent, a feeling was growing inside me that told every cell in my body to about face and get the fuck out of there because at this point if the world was going to end I just wanted to get home to my dog and relax.</p>\n\n<p>However I didn’t.</p>\n\n<p>We traversed down the collapsed earth on cables we had placed with brutal efficiency, we went on down for miles before we hit the bottom, it was breathtaking.</p>\n\n<p>I found it very strange that the floors were clearly tiled although most of the wall was just destroyed earth.</p>\n\n<p>“This way!” Shouted Halloway as he ran into the only visible hallway, it was led by a large arched entrance and you wouldn’t be able to tell how far it went if we had no lights with us, but from what we saw it didn’t go far.</p>\n\n<p>But it did go down.</p>\n\n<p>We ran into the entrance to discover that there was a rough hewn set of stairs leading down to a massive sort of wall.</p>\n\n<p>“This doesn’t make sense anymore.” I said as I realized that my hands were on top of my head. For just a moment I began to question my sanity.</p>\n\n<p>The ground trembled like never before in a long stroke of about 10 seconds, enough to shake the ceiling and cause parts of it to collapse around us.</p>\n\n<p>Then it stopped completely.</p>\n\n<p>My mind lit up immediately when I took the coin out of Sanchez case and saw the glowing was brighter than anything I had seen, staring into it for too long could probably cause someone to go blind, but we knew what this had meant.</p>\n\n<p>We scoured the wall in front of us for a while until I just barely saw it, straight down the middle was a line as thin as a string of hair.</p>\n\n<p>“That’s it! It is a gate!” I shouted to Sanchez and Halloway who were on the other end of the gate, they ran over to me to confirm it and right when they did was when we saw it.</p>\n\n<p>“And what do you suppose that is for?” Said Halloway in a dry, sarcastic tone. Neither of us answered, because we all knew exactly what it was for. In the moment I was terrified of what laid ahead of us.</p>\n\n<p>A gently chiseled circle was at body level with us between the two lines.</p>\n\n<p><strong>Just about the size of The Makers Mark.</strong></p>\n\n<p>Finale: <a href=\"https://www.reddit.com/r/nosleep/comments/8m64to/an_ancient_relic_in_government_posession_has/\">https://www.reddit.com/r/nosleep/comments/8m64to/an_ancient_relic_in_government_posession_has/</a></p>\n</div>\n","author":"Gorbado"}