{"rank":"7","title":"The Family Men","id":"8lwxr0","url":"/r/nosleep/comments/8lwxr0/the_family_men/","time":"1527202312000","body":"<div class=\"md\"><p>I check my watch.</p>\n\n<p>Not quite time yet. </p>\n\n<p>It feels so strange staking out my own house.  I parked the truck around the corner so I could keep an eye on the place without being spotted.</p>\n\n<p>The Family Men left the truck right where they said they would.  Long term parking at the airport.  They said it didn’t matter if I drove my own car, but I took a cab up there anyway.  This whole thing is making me nervous as hell so I’m not taking any chances. </p>\n\n<p>The gun was right where they said it would be.  In a plastic bag under the trunk board.  A Glock 19.  Nine millimeter.  The magazine held fifteen rounds but it contained only three, just like they said. </p>\n\n<p>They gave me specific instructions not to add any additional ammunition.  Three was all I needed.  One bullet for each of them and one extra for myself in the event of failure. </p>\n\n<p>I wish I had a cigarette right now, but smoking was prohibited.  I thought about sneaking one earlier, but decided against it.  They’d know.  They knew every move I was making. </p>\n\n<p>It was tough though.  Tough to keep your hand steady when they were asking you to carry out the greatest sin a husband and father could ever do.</p>\n\n<p>The Family Men recruited me right after Fallujah.  Well, on the flight back home from Fallujah.  I was taking some R&amp;R, higher up’s orders, but I needed it to tell you the truth.  Urban combat is never pretty, but the shit we saw retaking that city is something I’ll never forget.  A few weeks away would clear my head. </p>\n\n<p>I wondered later if the order to take some time off was just a piece of their long, elaborate puzzle.  Wouldn’t surprise me.  I’d heard they’d sometimes lay the groundwork  years in advance before  finally making contact.</p>\n\n<p>They sat me next to some wormy looking guy on the plane.  Commercial flight, but if you were flying out of Baghdad in 2004, it usually meant you had a military connection.  We didn’t talk much during the flight.  He gave me a pleasant enough greeting when he first sat down but after takeoff he was buried in some pulpy beach book like the dozens I’d read back at the base.</p>\n\n<p>The timing of it was what threw me off.  We had four hours still left to go when he placed a calling card on my table tray. </p>\n\n<p>“Call that number as soon as you get off the plane.”</p>\n\n<p>That was all he said before he got up and walked down the aisle.  I swear to you I have no idea where the hell he could’ve gone to.  He never returned and I didn’t see hide nor hair of him after the flight.  It was like he evaporated. </p>\n\n<p>The card didn’t provide many answers.  All it had was a phone number and three stick figures printed underneath.  I wasn’t sure what to make of it but I had my suspicions. </p>\n\n<p>I figured I was finally getting tapped.  CIA, NSA, Homeland Security, whatever, they all had their strange ways of recruiting.  I was finally getting my chance. </p>\n\n<p>I made the call as soon as I got off the plane, just like he said.  It couldn’t have rang more than once when a pleasant-voiced woman picked up.  Before I could get a word in she told me to call back in exactly twenty-four hours to schedule an appointment.  Then the line went dead. </p>\n\n<p>I did as she said and tried the number the following day, but the number was out of service.  I hung up but after about three seconds my phone began ringing.  I picked up and the pleasant-voiced woman gave me an address and told me to be there at 3pm the following afternoon. </p>\n\n<p>Through the windshield of the truck, I see a light turn on at the house.  Jason’s room.  I smile.  I wonder how long until Becca comes in to drag him out of bed so he’ll brush his teeth. </p>\n\n<p>I think I’m going to shoot him first.  The Family Men didn’t tell me the order I needed to do it in, but Jason will be the hardest for me so I just want to get it over with.</p>\n\n<p>Man, I really wish I had a cigarette right now. </p>\n\n<p>When I showed up at the address, I found an empty lot.  I waited over an hour, the thought that I blew my chance slowly began creeping into my mind when my phone rang.  A man this time.  All he said before hanging up was to walk a hundred feet forward and get the box from the drainage ditch. </p>\n\n<p>I did as he said and found the half-soaked cardboard box.  Inside was just a black cloth bag and a note that said “PUT BAG OVER HEAD AND SIT INDIAN STYLE.” </p>\n\n<p>I stretched the bag over my head and found myself in complete darkness.  I sat down and in a matter of seconds a vehicle came ripping from wherever it had been hiding and screeched to a halt behind me.  I felt two gruff arms drag me up and into the vehicle.  I heard a van door slide shut. </p>\n\n<p>“Don’t make a sound or you will be shot,” a voice tells me. </p>\n\n<p>I feel a pinch in my left arm followed by a sting and the blackness of the bag became even blacker.   This was the start of my recruitment into The Family Men.  I passed my first test. </p>\n\n<p>I never see their faces.  The bag stays on the entire time we are together.  When I wake up in my car, hours or even days later, I’m alone.  They are nowhere to be found. </p>\n\n<p>Becca asks me where I go.  She begs me to talk to somebody at the VA.  I want to tell her everything, but they said they’d kill me if I did.  I keep reminding myself once training is complete things will be okay. </p>\n\n<p>My training is never physical, always mental.  Always physiological.  They mold my mind to think the way they do.  I’m never allowed to ask questions.  If I make a sound I get shocked. </p>\n\n<p>Jason’s light turns back off.  I smile again.  He’ll be asleep soon.  The kid always conked out as soon as his head hit the pillow.  I pray that he’ll be having a sweet dream when I shoot him.</p>\n\n<p>I start thinking about Fallujah.  I haven’t thought about it once since The Family Men recruited me.  But I’m thinking about it now.  Forty-six days of hell.  I knew something had changed in me when I kicked a severed head across the street we’d just swept for mines.  I remember getting a real laugh out of the smacking thud the head made when it banged against the wall of a half blown out apartment building.</p>\n\n<p>I think about the children I killed.  I was the point during one of the many house raids we’d conducted during the battle.  The city was ninety percent ours by that time.  We were so close.  I’d seen so much death, so many wounded soldiers; I was praying I could hold on just a little longer. </p>\n\n<p>We yelled for them to come out the entire time we were in the house.  I guess they were just scared.  I was scared too.  That was why I shot first and asked questions later when I threw open those closet doors and saw the pair of eyes looking back at me.</p>\n\n<p>Everyone lied for me.  I guess they figured the stress everyone was under, it’d be bad propaganda to court martial one of the “good guys”. </p>\n\n<p>I had to start seeing some doctor.  After a few sessions, command was sending me home.  They told me I wasn’t going to jail, but I wasn’t going to fight anymore either.</p>\n\n<p>On my last day of training, they finally let me talk.  They asked if I had questions.  I had so many, but I boiled it down to just one.</p>\n\n<p>“Why do they call you The Family Men,” I asked. </p>\n\n<p>A voice in the dark responded, “Because that’s our final test.  We can’t have anyone.  Our work is too important.” </p>\n\n<p>I don’t understand.  Somehow they see it on my shrouded face.</p>\n\n<p>“You’ll never be one of us until you have no one else.”</p>\n\n<p>As I let that sink in the voice goes on, “We are going to change your face, your blood, your DNA.  You won’t be anyone.  You’ll be a weapon.”</p>\n\n<p>I feel the speaker inches from my face.</p>\n\n<p>“Now, are you ready to complete your training?” </p>\n\n<p>I check my watch.</p>\n\n<p>It’s time.  I step out of the truck, closing the door with quiet care. </p>\n\n<p>As I begin walking towards the house I check the Glock.  Safety off.  After a few more steps I stop and eject one of the bullets. </p>\n\n<p>I’ll only need two.  I’m sure of it.</p>\n\n<p>I slip my key into the lock and hear a click as I turn it.  My hand is shaking.</p>\n\n<p>Man, I’d kill for a cigarette right now.</p>\n</div>\n","author":"bigrig42788"}