{"rank":"17","title":"Part 2: Government Human Experiments: The Lab","id":"8lx3wb","url":"/r/nosleep/comments/8lx3wb/part_2_government_human_experiments_the_lab/","time":"1527203705000","body":"<div class=\"md\"><p><a href=\"https://www.reddit.com/r/nosleep/comments/8lf80o/part_1_government_human_experiments/\">Part 1</a></p>\n\n<p>I rolled up to my apartment building at about noon. I would have been here sooner but I stopped at a burger joint on the way back from dealing with Dr. Cloutz. There was nothing I loved more than a tasty burger and fries with a coke. I thought back to all the times I would be in foreign countries and would not have access to American food. It’s the little things like this that you miss when you are kicking in doors and helping overthrow foreign governments. Medium well, pickles, lettuce, grilled onions, just a dab of spicy mustard. Melted American cheese. Toasted sesame seed bun. Even though I only ate it 90 minutes prior, the thought of it once again began to make my mouth water. I unlocked the door to my apartment and began my usual routine of setting my kettle and diffuser. If there was one thing I learned from my time in Asia, a cup of green tea is one of the most efficient ways to keep a clear mind and level head.</p>\n\n<p>After the kettle was done whistling and my tea was made, I sat down at my table and pulled my map of the city. Using the address Dr. Cloutz provided me with, I circled the location on my map. One of the local high schools, which coincidentally happened to be about 8 miles outside of the town. I felt a frown forming on my lips. I was already beginning to not like the feel of this assignment. I dialed the number of my handler, curious about how I was supposed to approach this time of mission. After a few rings, the receiver picked up.</p>\n\n<p>“Syver, this is Conte. I’m curious about how I’m supposed to handle this phase of the assignment. I know I need to destroy all data stores that are contained in the lab, but what about any surviving scientists inside? Also what am I to do about any of the experiments that may still be alive inside?”</p>\n\n<p>“This is a total liquidation and clean up. Simple solution, if it is breathing and alive in that lab, terminate it. There can be no witnesses and no liabilities about what occurred in that lab. It was an unsanctioned lab and the public cannot find out about what was going on in that lab. This isn’t just about preserving the image of the government but if other countries were to find out we were doing experiments to weaponize genetic enhancements, it could lead to the collapse of the world and the start of world war 3. Once you are finished cleaning out the lab, report back to your apartment. We will update you when a transport vehicle will be outside to take you in for your debrief. Syver out.”</p>\n\n<p>After the very audible click, I placed my phone down and began to think of all the possibilities of what could go on down there. No information at all regarding lab structure, layout, or anything. I don’t even know how many experiments or people there were inside. A smile crept onto my lips. They always leave the fun jobs for me.</p>\n\n<p>Before I made my way to the high school, I stopped by my storage unit in the downtown area. I looked up at the dark clouds that were beginning to form and blot out the sun. After using my keys to unlock the door, I slid it upward, moved inside, and closed it behind me. I reached for the light switch and when the bright light illuminated the room, my eyes went wide with an excitement I haven’t felt in a long time. Ever remember going to a toy store or candy store when you were 5 and that excitement you felt? That was me when I remembered how much ordnance I had in this little 10 by 10 storage unit. </p>\n\n<p>All along the walls was a variety of different types of weapons from sniper rifles to shotguns to more pistols. Very few jobs required me to grab supplies from this storage unit, and I could feel my heart rate increasing as the adrenaline shot through my body at the thought of equipping myself with some of my weapons. I grabbed one of my large black duffel bags from the corner and zipped it open, ready to start selecting my gear for the mission. I had replaced my tactical T-Shirt with a long sleeve version, as to protect my arms from whatever may be in there. I grabbed my body armor for my shins, upper body, elbows, and knees from the wall and placed all of that in the duffel. In addition, I pulled one of my old vests off of the wall and put that with my equipment as well. I didn’t know what was down in that lab but I wanted to make sure that I wouldn’t run out of ammo. The helmet I selected had a flashlight build on the side of it, and in addition to that, I grabbed a shotgun with a flashlight attached in front of the pump mechanism. It was a nice black steel and was cut down on the barrel and stock to provide maximum maneuverability indoors. I grabbed another pistol off the wall, almost identical to the one in my holster currently. Lastly, I opened a little trunk in the corner. I grabbed my 8 inch razor sharp knife, as well as a few incendiary grenades. Fragmentation don’t work too well indoors, too much concussive force. With my loadout ready, I zipped up the bag, turned out the light, and made my way back to my car.</p>\n\n<p>After putting the duffel in the trunk, I made my way to the school. After dealing with 5 o clock traffic, I arrived at the school late into the night. The rain had begun to poor down heavily. I looked at the instructions on the paper again and read that the entrance was in the basement of the gym. It was currently the summer term so I wouldn’t have to worry about students or teachers arriving early in the morning. I got my duffel bag from the trunk and made my way over to the doors of the gym. After kicking in the door, I went on the basketball court and began to suit up with my equipment. As I slid on the body armor and vest, I forgot how heavy it makes your body feel. Almost as if I was 50 pounds heavier. I began to slide my extra shotgun shells and pistol magazines in the vest, beginning to add even more weight. Better to be safer than sorry, second chances were rarely given in this line of work. The knife attached to my right boot, a good little backup to have if my weapons were knocked away or became unusable. I attached the grenades to my vest as well, attaching them by the pin. This was so that all you had to do was pull it off and chuck it. With my equipment on, I began to make my way into the basement.</p>\n\n<p>The basement lights wouldn’t turn on, so I already had to turn on my helmet lamp. The smell down here was absolutely terrible. I know it’s a gym basement, but this smell went beyond the smell of gym clothes containing the sweat of three generations of prepubescent boys. This was almost a rotting corpse smell. The only door I saw was a wooden one in the far corner of the tiled room with the words “Cleaning Supplies” stamped on it. I approached it and grabbed the handle. No luck, the door was locked. And there was not visible lock on the outside of the door either. As I began to knock on the door to hear for a weak point, it was that I noticed this was not a wooden door but a metal one. Pretty thick too by the sound of it. I began to look around for a computer as this must be the entrance to the lab. I found one in the little office near the stairway I entered and as I hit the power button a terminal screen appeared. It requested the login information with a username and password. I pulled the little note out of my pocket and began to input the information.</p>\n\n<p>USER: DR.JCloutz</p>\n\n<p>PASSWORD: TheCakeIsALie</p>\n\n<p>After pressing enter, I heard several locking mechanisms undone as the door in the corner swung open. Glancing inside, I shined my light down and saw what was a spiral staircase going down atleast 100 steps. I began my descent down the creaky metal steps, not knowing what was waiting for me down at the bottom.</p>\n\n<p>After I descended the 122 steps to get down, they lead to a hallway. The hallway was lit with very bright lights, somewhat reminiscent of a hospital. At the other end was a giant vault door, and a control panel about 4 feet before it. I went up to the control panel and slid the handle on the top of it. After I did that, large yellow lights flashed along with a loud beeping noise. A huge waft of decaying flesh hit me that nearly made me throw up right there. I had dealt with some bad shit before, but this smell was on another level. I now turned on the flashlight on my shotgun, as the past the vault door there was only red emergency lights on. After stepping through I found myself in another hallway, with office windows and doors along both sides that ended in another hallway at the other end. With steady caution, I began to make my way to the end of the hallway. Looking around I noticed some light fixtures were broken open, wiring in the wall was chewed through. But weirdest of all, the air vents were busted out. Only they had been busted out from inside of the air shafts. A slight shiver went down my spine as I thought of something crawling in the ventilation system. The smell was getting progressively worse, but yet there was still bodies or parts of bodies anywhere. Blood was all over the place, yet there were no bullet casings or sign of weapons at all. I made it to the end and looked at the signs. To the left was the mess hall and living quarters, to the right was the research labs. Down the right hallway was yet another staircase, and I wanted to see if anyone had survived what happened on this floor before I descended.</p>\n\n<p>The door to the mess hall was on my left. As I turned to face the door, I thought I heard something overhead and shone my light up. It sounded like movement but I was alone in the hallway. Figuring I must just be a little fidgety, I stood squared towards the door and hit the panel to slide it open. As it moved to the left I immediately swept my lights over the area and saw the same thing as the initial hallway. Broken light fixtures, wiring taken out from the wall and chewed out. I noticed just about all the tables and chairs were knocked over, plenty of blood all over the place, yet still no bodies. As I shone the light towards the bottom, I heard the sound of movement across the tile. Like fingernails being tapped along the tile floor as whatever it was ran away. I discharged two shotgun rounds following the movement, yet there was nothing but holes where the rounds made contact with the floor. I cautiously moved towards where I heard the initial noise and saw food cans from the mess hall line had recently been opened. Except these weren’t opened with a can opener, they had been chewed through. As I moved back to the hallway to make my way to the living quarters, my mind started to wonder what type of animal could chew through metal and be completely fine.</p>\n\n<p>After moving down the hallway a few more meters I came to the door to the living quarters. The door opened and I shined my light inside,  and saw that this area was virtually untouched. The room was about 30 meters long and 10 feet wide. It was like a barracks that we stayed in during basic training, with bunk bed cots all along the length of the room, each with a wall locker. I shut the door behind me and noticed that all the lights still functioned, and there was a bathroom at the end of the room. All of the lockers were the same, open doors with all kinds of gear thrown around as if the owners were rushing to grab their equipment and go. All except one. With the barrel of my shotgun trained on the locker, I began to move towards it at a steady pace. I got close enough, and as I grasped the handle and ripped open the locker door, a short and stout man fell out, crying.</p>\n\n<p>The man lay on the ground sobbing like a baby, curled up in a fetal position. He wore brown slacks and a green shirt with a white lab coat on. He was a particularly overweight man with rectangular rimless glasses and was balding on the top with brownish hair. Training my weapon on him the whole time, I looked around the room to make sure nothing had changed. When I was comfortable with my surrounding, I grabbed him and hoisted him up against the wall so that he was sitting and looking at me. </p>\n\n<p>“Look at me and tell me your name.” I said very sternly towards him</p>\n\n<p>“J.. Ja… Jacobs. My name is Dr. Jacobs and I’m the head scientist for this research facility. Well, was the head scientist. Job titles seem to disappear when experiments run loose.” He muttered out between the crying</p>\n\n<p>“Well Dr. Jacobs, I happen to be with the sanitation department and it seems that we have quite a mess on our hands. Can you care to explain exactly what the fuck happened down here? I’ve been in fire fights that looked like they had less shit going on here. And I already know you were doing human experimentation so skip all that expositional bullshit and tell me exactly where things went wrong” I stated</p>\n\n<p>“As you know, we were splicing human DNA with other species in an attempt to create superior beings as a form of biological warfare. Well, the problem is, our genome is very unique so most hybrids couldn’t actually handle the introduction of new genes and promptly died after we introduced the new DNA. Most hybrids. We were successful with one species. Too successful honestly.” He muttered to himself. “Periplaneta Americana, also known as the common household cockroach. When we extracted the DNA from one of the teenagers and mixed it with the roaches, it didn’t just mix well, but it began to evolve on its own. Over weeks the roach not only began to grow to the size of a Rottweiler, it began to show remarkable intelligence. Able to distinguish different people, objects, hell even grasp the concept of ideas.”</p>\n\n<p>“Wait a second, you are telling me there is a cockroach the size of a hundred pound dog down here? A fucking cockroach caused this much mayhem? And what happened to the children?” I interrupted.</p>\n\n<p>“Yes, a cockroach caused all this damage. There are no more children, when we extracted samples of their DNA we had to take it from a very specific part of their brain. They did not survive the procedure. Well, one day it appeared the roach had died. It was flipped over on its back and wasn’t showing any vital signs on the machines we had hooked up.”  He let out a very deep sigh before he went into the next part. “When we sent in some scientists to examine what caused this, it was then that we realized the error in our judgement. The roach snapped awake and chewed open the throats of the pair that went in to examine it. We tried to shut the door but we were too slow. It retained all its physical properties and was able to squeeze through the crack of the door. We sounded the panic alarm and grabbed as much gear as we could and tried to leave. The only problem was the vault auto locks for 30 days when the panic alarm is activated to keep any contamination inside, the only way to open it is from the outside.” He took a couple breaths before he got to the next part</p>\n\n<p>“We sent a team down in the basement to search for it, as they love moist, warm environments. They didn’t come back. I became scared and voted that we should stay in here. Others said we had powers in numbers and that we should just go kill it. I locked the door behind them and shortly after all I heard in the hallways was screaming. They were banging on the door to let them in but I was too scared so I went and hid in my locker as I heard their cries for help as the roach got them. And here we are.” He finally finished</p>\n\n<p>“So tell me then, how do I kill it? And where are the documentation files for this facility located?” I sternly questioned him.</p>\n\n<p>“They are in the research lab. In the basement. On the main computer. There is no password for it, you merely turn it on and you have access to all the files this facility has generated in its 9 months of operation. To kill the roach is simple, do as you would to a regular sized roach. Just know that its strength and defense have grown with the ratio of its size, and that it has superior intelligence. Don’t think it will be as simple as stomping it with a boot.” He said, eyeing me up and down.</p>\n\n<p>“Excellent, one more question. Is there any way to decontaminate this facility?”</p>\n\n<p>“Yes. On the research terminal, type in the command ‘Flood’. The facility was built with a failsafe combustion protocol. Two minutes after the command has been typed, the vault door will shut and lock. Once that happens, the facility will be filled with a flammable gas and it will light the air of the facility on fire. This will then happen multiple times over the course of 48 hours as it makes sure there is nothing organic left alive in here. Now if you’ll excuse me, I’m going to make my way to the surface.” He stated as he waddled past me</p>\n\n<p>“Hold up there Doc. After all you told me I can’t just let you walk away. You know too much for your own good, and that last thing this country needs is you spilling this to the media. Or worse, giving this knowledge to our enemies and letting them have access to create super bugs.” I said in a very monotone voice, sounding almost robotic.</p>\n\n<p>His eyes went wide with fear as he came to the conclusion of what was about to happen. I trained the shotgun on his chest and blew a hole the size of a basketball where his organs used to be. I spit on his corpse in disgust after he fell to the ground, convulsing as he had attempted to take his last few breaths with lungs he no longer had. The blood began to pool around his wound on the floor and he spit up blood when his eyes finally went cold. People like him always disgusted me, I have no sympathy for someone who will sacrifice children like this. As I reloaded my shotgun and made sure that all of my weapons were loading and ready, I opened the door back to the hallway and made my way back to the intersection I had originally gone down. Typical that the basement was where the main terminal was. And typical that there was a fucking hundred pound cockroach running around this fucking facility. Specifically in the basement. I approached the staircase to the basement at the end of the hall. I took a large breath and then began my descent into literal hell.</p>\n</div>\n","author":"Shadelsmra"}