{"rank":"51","title":"The Miracle of Birth","id":"8lx4fp","url":"/r/nosleep/comments/8lx4fp/the_miracle_of_birth/","time":"1527203831000","body":"<div class=\"md\"><p>It felt as if a knife had been stabbed deep into my abdomen, tearing through muscle as the tip touched the back of my insides. I screamed out as the pain brought me to my knees.</p>\n\n<p>“We’re going to the hospital.” Noah said sternly, rubbing my back in an attempt to soothe me.</p>\n\n<p>I had been experiencing sharp pains for weeks. At first I dismissed them as particularly bad cramps. My period had been really light that month, more like spotting than an actual flow and I assumed the two had been related. It happened occasionally when I was on the pill so I initially wasn’t worried. But the cramps continued long after my period had ended, gradually becoming worse and worse. Noah had been asking me to go to the doctor but I’d ignored him, brushing the pain off as normal. </p>\n\n<p>My knees were barley propping me up from our kitchen floor as my body quaked in agony and in that moment even I had to agree that the pain had gone far past normal. I nodded to him, finally acknowledging that something was wrong. I stood, still shaking, and let my husband guide me out of the apartment. </p>\n\n<p>“Congratulations Mrs. Gill, you’re pregnant.” The doctor smiled at me. I looked to Noah to see his response but his face was blank. </p>\n\n<p>We were in our late twenties and financially stable, but while our instagram feeds were filling up with pictures of nurseries and ultrasounds, we had both agreed that we weren’t ready yet. Sure we talked about it, but it was always something for the future. We laughed and rolled our eyes when our mothers broached the subject, trying to gauge when we were going to start a family without asking outright. We told them that we were still having fun, that we still had time to enjoy our youth.</p>\n\n<p>Yet, when I passed parents cooing at their newborns or playing with their toddlers, I would think about the joys of having kids. The love on their faces shone so pure and endless it made my heart pang with desire. But still, I wasn’t ready.</p>\n\n<p>The doctor’s deep voice shook me from my thoughts, “how you proceed is your decision, but either way we’ll need to start scheduling your follow up appointment as soon as possible.”</p>\n\n<p>My abdomen muscles tightened suddenly, so tight that it felt like a giant fist had balled itself inside my stomach and was threatening to punch its way out. I cried out as a burning pain spread throughout my lower stomach like molten lava. My body felt scorched as it flowed downward towards my legs. I curled into the fetal position, hot tears beginning to form through my closed eyelids.</p>\n\n<p>The doctor’s voice was tight with worry as he continued, “these cramps you’re experiencing are very concerning, especially since they’ve been occurring for so long. Please try to lie back so I can take a look.”</p>\n\n<p>I inhaled deeply, readying myself. As I exhaled I clenched my teeth and slowly unfurled my body. Whimpering from the pain, I placed my feet in the cold metal stirrups at the end of the exam table. The doctor bent down and placed his head between my thighs. I closed my eyes tight as a gloved hand cautiously pushed against the inside of my body. After a few seconds there was a sensation of the hand leaving. I held my breath but the room remained silent. I opened my eyes hesitantly and was greeted by the doctor’s grey gaze. His expression of alarm and disbelief made my stomach drop.</p>\n\n<p>“We need to get you upstairs as soon as possible.”</p>\n\n<p>“Why, what’s upstairs?” Noah asked, his voice thick with panic.</p>\n\n<p>Never taking his eyes from mine the doctor answered. “The maternity ward.”</p>\n\n<p>“What? Why?” I demanded.</p>\n\n<p>He swallowed, steadying himself. “Because you’re 5 centimeters dilated. Whether you want a child or not, you’re in active labor and we need to act now.”</p>\n\n<p>The world grew silent as shock washed over me. The past nine months flashed before my eyes: weekly sushi lunches, my morning cup of dark roast, the occasional cigarette, my regular after work beer, weekend shots of tequila, a new tattoo. This child would most likely be deformed, mentally challenged, or dead. I shuddered. I could taste the acid of my bile as it burnt the back of my tongue.</p>\n\n<p>I shook my head. No, it was impossible. How could I be pregnant? I had no symptoms and I sure as hell didn’t look nine months pregnant. Despite my bad habits I had been trying to improve my health. I had been losing weight for weeks. I was on track to get back to my college weight by the end of the year. </p>\n\n<p>I placed my hand on my lower stomach and felt nothing. I was empty. My hand stayed there as nurses passed me, the sounds of their shoes over the linoleum floor and the beeping of machines humming in my ears like a distant hurricane.</p>\n\n<p>The frenzy was dying down when my doctor returned. He reached inside me and nodded to himself before sitting up. His voice was low and soothing, the tone one takes when speaking to a frightened child. “You’re staying dilated at 5 centimeters so it seems like we have a little time. Let’s take a look at what we’ve got here.” A cold wet jelly was applied to my flat stomach, creating a slimy layer of goop. The doctor brought a grey ultrasound wand down onto my skin and began to drag it over my flesh. The steady hum of the room faded as a new sound floated up and surrounded us: a small steady heartbeat. I looked at the machine’s black and white screen to see small washed out shapes bob in and out of focus. It was pixelated and ill defined, but I recognized it as a baby nonetheless. The baby I hadn’t felt grow. The baby I hadn’t helped, that I hadn’t taken care of. The baby I hadn’t even thought about or considered. Heavy tears rolled lazily down my cheeks as I watched the baby, my baby, wiggle and squirm, its limbs barely moving within me. </p>\n\n<p>I would’ve taken care of you, I thought. I would have taken care of you if I had known you were there.</p>\n\n<p>As I listened to the heartbeat I thought of our tiny one bedroom apartment filled with our bikes and paints and alcohol. All the toxic things we didn’t consider as threats because they weren’t. At least not to our minds or bodies. It was the home of adults without responsibilities. If we had known we could’ve prepared. Could’ve found a bigger place, bought furniture, baby proofed. We could’ve found a safe space for our tools and instruments and art supplies. Concern for my unborn child filled me. Regret soon followed. Regret that I wasn’t able to prepare my life for a baby. That I wasn’t able to bring it into a home that was ready for it. Parenthood had been far from my mind only a few hours ago, yet now I felt attachment to the fully developed life inside me. </p>\n\n<p>The doctor turned and smiled despite himself. “It’s a boy.”</p>\n\n<p>Warmth flooded through me. Not the burning of pain but a good kind of warmth. A happy warmth. Love, I realized. It was love. I loved him.</p>\n\n<p>An hour later and I was screaming as pain exploded between my thighs. Through the blur of confusion and horror I could hear the doctor telling me to breath. My legs were wet and I could see fluid flowing from inside of me. I choked as a sob caught in my throat, threatening to suffocate me.</p>\n\n<p>I knew nothing of childbirth. I tried to think back to educational films from middle school, but I was lost in pain, only able to do what I was told and pray that I was doing it right. With each wave of pain I pushed as instructed, ignoring the primal fear screaming within me as my body tore itself apart. I could feel it, feel the child between my legs. I looked down and despite the dizzying red that painted my vision I could see a grey-blue ball emerge from my body. It was disgusting and beautiful at the same time. </p>\n\n<p>Relief washed over me through the pain as I looked at his perfect face. He was ok. His features were scrunched with the agony of entering the world, but he was alive. </p>\n\n<p>The doctor continued to pull and I felt my body loosen as my son’s narrow shoulders appeared. A heat grew in my genitals and I cried out again with the effort as the doctor continued to pull, revealing my son’s chest.</p>\n\n<p>I looked down and screamed. It was a deep guttural scream. Not of pain, but of horror.</p>\n\n<p>My baby boy’s chest was skinless, his rib cage and organs completely exposed. The reds and purples of his insides deflated and spread apart from each other. As he became more and more exposed to the air of the hospital room his body melted, losing its structure.</p>\n\n<p>“Oh, oh god!” The doctor exclaimed, his face twisted in disgust. Noah retched beside me. My body became numb as my infant’s slippery legs fell from me leaving my body barren. His tiny heartbeat still resonated in my loins like a far away echo.</p>\n\n<p>No, no, no. He was alive. He had been alive. I had felt him. I had heard his heartbeat. A heartbeat that I had fallen in love with in only a fleeting moment. A voice, my voice, rang throughout my head. Maybe he’s still alive? Maybe they can save him? </p>\n\n<p>I looked at his tiny heart, black and still. He wasn’t coming back. I gasped for air in large, croaking inhales as I began to shake uncontrollably, pain and grief filling me until I could no longer take it and the world went dark.</p>\n\n<p>Noah and I have never told anyone about what happened. It’s too much to explain.</p>\n\n<p>It’s been three years and both of us still have nightmares about it. Nightmares of the pain and loss. I sometimes hear Noah crying in his sleep. He remembers the macabre horror, the fear. He remembers the half dissolved fetus falling apart in the doctor’s hands.</p>\n\n<p>But I also have dreams about our baby boy. Dreams of him surviving. Dreams of looking into his eyes and seeing the life within them. His tiny mouth opening to suck air into his new lungs before I awake suddenly, never able to stay and hear his first cry.</p>\n\n<p>Lately, Noah and I have been talking about trying to get pregnant. We don’t say “again.” It’s too painful. Instead we discuss moving into a two bedroom apartment and possible baby names. It’s exciting to think about doing it right. I remember the love I felt for that little boy even though I only knew him for a few hours and I can’t wait to feel it again. I can’t wait to actually get to hold my baby.</p>\n\n<p>I’ve never told Noah that I had named him. The moment I saw his face. The moment I had thought he made it. The moment when a joy I had never known before filled my heart.</p>\n\n<p>I had named him Josh.</p>\n</div>\n","author":"meltingalphabet"}