{"rank":"2","title":"Outcast (Part 3)","id":"8lxcxw","url":"/r/nosleep/comments/8lxcxw/outcast_part_3/","time":"1527205941000","body":"<div class=\"md\"><p><a href=\"https://www.reddit.com/r/nosleep/comments/8jykvc/outcast_part_1/\" rel=\"nofollow\">PART 1</a></p>\n\n<p><a href=\"https://np.reddit.com/r/nosleep/comments/8k8c9n/outcast_part_2/\" rel=\"nofollow\">PART 2</a></p>\n\n<p>“Tiiq,” she said with a smirk and a guttural, croaking <em>ah</em> in place of the double <em>i.</em> “It means <em>butthole</em> in Alutiiq.”</p>\n\n<p>We fell to fits of laughter. </p>\n\n<p>I had long adored the native cultures. There were many variants, dialects, legends, and tribes. Each was special, but there was something extra special about learning the one that belonged to your friend. My first Alutiiq word was a curse, and I was pleased. </p>\n\n<p>It is a difficult language to learn. Coupled with the fact that many of the sounds aren’t sounds made in English, many of the words don’t have true English counterparts, that it emulates wild noises, that Russian fur traders muddled the language back in the day and brought a true <em>r</em> sound, <em>and</em> that only about 60 people still speak the Subpiaq dialect of Alutiiq, it is a <em>difficult</em> language to learn. It is a dying language, and a dying culture. And with no one to carry the stories, they are fading beyond memory.</p>\n\n<p>“Do you speak it, Z?” I asked. </p>\n\n<p>“Just a few words.” She sighed.</p>\n\n<p>Z’s mother was full Alutiiq and married a white man with red hair, creating Z. Her mother was one of the 60 few that spoke Sugpiaq Alutiiq fluently, and in her final days she spoke solely Sugpiaq, much to Z’s dismay. As the tribes mingled more with the white community across the bay, I guess it was easier to just forget and move on. They had been uprooted so many times. So the culture began to fade. </p>\n\n<p>“What were the stories? What were the legends? Can I be friends with your family? Not to invite myself in, buuuut…” I was babbling. I was so excited. Z was also excited to see someone so enthusiastic about her culture. </p>\n\n<p>“Yes! Please go visit my brother in the village! It’s beautiful!” She flapped her arms excitedly. </p>\n\n<p>“So what about Raven? What were the stories of the orcas in your village? The fur trade? The effigy lamps? What about Port Chatham?”</p>\n\n<p>“Old Portlock,” Z’s face went pale at the mention of Port Chatham. “Oh, that’s a bad place. Bad spirits.” She squished her eyes and squirmed.</p>\n\n<p>“Why? What’s that story?”</p>\n\n<p>“The <em>hairy man</em>. He’s our boogeyman.”</p>\n\n<p>“Can your brother take us there? He’s taking us there.”</p>\n\n<p>“Are you trying to die?”</p>\n\n<p>“Oh come on, whatever it is, it’s not real.”</p>\n\n<p>Z knew she didn’t stand a chance against my curiosity. She rolled her eyes to herself, sighed deeply, and accepted my request. “Fine, I’ll arrange it with him. But I won’t sleep ever again. I’m already nauseous thinking about it.”</p>\n\n<p>Before I could speak again, our general manager yelled at us to get back to work. I squeaked with excitement and skipped out of the room. </p>\n\n<p>“We will find the hairy man!!!” I returned to tell Z one last time.</p>\n\n<p>Z groaned in response.</p>\n\n<p>Deeper research on this <em>hairy man</em> revealed some concerning stories and mysteries. Port Chatham and neighboring Portlock were the former homes to the vast majority of the Alutiiq people in the 1900s. The bay offered a haven to the otherwise tumultuous Gulf of Alaska, and fishing prospects flourished there. By 1920, a post office had set up shop. Mines, canneries, timber, and hunting commerce boomed. But as all good things must come to an end, so did the prosperity of Portlock.</p>\n\n<p>The Alutiiq and mixed fishermen began to fear some unknown creature in the woods, a massive lumbering beast with a taste for blood. Hunters tracking big game found its tracks pursuing the same game: massive footprints, that simply disappeared into the mountains far above where expected predators had any need to roam. Children were warned to behave lest this monster would eat them in the night. But after some time, the moose and sheep this monster hunted apparently left it yearning for sweeter meat. A prospector was found mangled, torn to pieces in a way that no bear or wolf would execute. And the casualties only grew from there. </p>\n\n<p>One hunter, determined to end the murder spree, locked eyes with the beast in the twilight hours. But as he tensed his trigger finger, he was frozen. Staring at the monster, he questioned whether it was man or beast, and in his stupor he saw both a grizzled man with white beard and a monster born from of many beasts. He pulled the trigger, and the creature was gone. He ran to where it vanished, and found only in its place a dead ermine. </p>\n\n<p>Natives called the monster, <em>Nantiinaq</em>. More concerning though was it’s other name: <em>Arula’aq</em>, meaning <em>outcast</em>. My heart skipped at the word; there was something unnerving in knowing that it once belonged. Arula’aq was evil. Arula’aq was born from those who got lost in the wild, wandering far through banishment. The Alutiiq warned that those who lived alone in the wilderness were prone to decay and deform into Arula’aq, and gain supernatural powers… the ability to shape shift at the expense of their humanity. They were neither man nor beast, but both, and they lived in both the living world and the dead. So twisted was their fate that they lost speech entirely and spoke solely in haunting whistles, creaks, and groans. By 1950, the entire town had fled seemingly overnight, leaving a foolish few, including the reluctant postman. The murders were never solved. Now all that remains are a few piers left unswallowed by the sea and the fading stories of the Alutiiq. </p>\n\n<p>I slammed my computer shut. </p>\n\n<p>“That night under the lights…” I thought, “No. No it was a moose. Just a moose. No more Nantiinaq today. No more <em>Arula’aq</em>.”</p>\n\n<p>When sleep took me, I tossed and turned with uneasy rest. Visions of beast and men and man-beast flashed violently in my mind’s eye. I saw that awful leg crawl through the trees again only to reappear with the creature’s face. A wolf howled in the darkness of my dream, its voice growing so shrill it morphed into a screech, a piercing whistle. Slowly chanting under the ear splitting noise I could hear, “<em>Nantiinaq. Nantiinaq. Nantiinaq,</em>” growing louder until at last it yelled “<em>ARULA’AQ</em>.” I sat upright in bed and yelped. Steve, my beloved, woke beside me and held me.</p>\n\n<p>“What’s wrong?” He asked.</p>\n\n<p>“Just a bad dream,” and I lay my head in his arms. I loved that man. He could soothe any nightmare. “No monster can get me when you’re here.”</p>\n\n<p>Weeks later, I was tending to the massive expanse my small acreage contained. It was only 5 acres, but my God did it require work. Hassocks of grass six feet tall smothered my land so aggressively that I swear they tried to choke the trees that outlined the field. But… you could run through the grass and no one would know you were there. It was like a corn maze but the hassocks made an unpredictable network of routes. And it was <em>fun</em>.</p>\n\n<p>Dagon bolted around me and into the hassocks: game on. I could hear him panting and playfully barking as we blindly chased each other. Not too long before, a family of escaped pheasants had moved onto my land and were setting up roots. I could hear them whistling their cooky call often… so when Dagon startled a particularly large male that flew over my head screaming, I was ashamed to admit that I nearly peed my pants. Dagon barked, taunting me. </p>\n\n<p>To my surprise, Steve’s leg tactfully disappeared near me into the grass.</p>\n\n<p>“That asshat,” I thought. “He’s trying to sneak up on me!!! I’ll show him.” I was torn to chase Steve, or Dagon, as the dog could help me tagteam Steve, but I&#39;d lose him if I didn&#39;t pursue him then and there.</p>\n\n<p>Running through the grass, I opted to chase Steve. The pheasants whistled increasingly, until at last their calls surrounded me and the hair on the back of my neck stood on end. </p>\n\n<p>“Steve?” His footsteps were audible beside me but every patch of grass I pulled aside revealed an empty space. I pulled one clump aside and revealed the few remains of a mangled moose, a garish murder scene completely concealed in the grass jungle. I screamed, and when I did Steve - or so I thought - bolted out of the grass and into the trees beyond as he stretched and morphed, and clinging to its changing hide was the same tattered fur I knew so well from the winter before. </p>\n\n<p>I ran. When I found <em>real</em> Steve, I stared hesitantly. With a lack of words, I simply chalked my fear to the dead moose, he wouldn’t believe me if I told him a shapeshifting, undead, giant, cursed man was stalking us. Hell, <em>I</em> wouldn’t believe me. </p>\n\n<p>I opted to avoid working in the field for that day, maybe indefinitely, for obvious reasons. There was much left to do as we were preparing to tear down the old cabin and build a new one. Things needed to be sorted and boxed. We’d been together just shy of two years, and two years bears a lot of possessions to sort. I sighed as I accepted I’d need to go into that awful attic.</p>\n\n<p>As I pushed boxes aside, Carl’s old box was revealed. I had forgotten it was up there all along. </p>\n\n<p>“Whatever happened to you, Carl?” I said as I held my hand solemnly on the box. </p>\n\n<p>His family would want his things, but if there was nothing of value inside I’d save them the pain of stirring a pot that had long since simmered. Dust had found its home on the box, and I wiped it off before popping the plastic tote. Before fully opening it, I was assaulted with an awful smell, of old, dried blood. My heart raced as I revealed the contents. Carl’s clothing, the stupid cat shirt he was wearing when I last saw him, was inside… soaked in dried blood. It had been placed there, and my heart sank to think who - or <em>what</em> - had put it there. </p>\n</div>\n","author":"ckjm"}