{"rank":"106","title":"Someone is Always Listening","id":"8lxhwt","url":"/r/nosleep/comments/8lxhwt/someone_is_always_listening/","time":"1527207231000","body":"<div class=\"md\"><p>I’ve gotten really used to Alexa, or - shit, I probably shouldn’t use identifying names and stuff as I’m recounting this? But it’s important. You can’t humanize a thing, give it a name, and then dehumanize it by taking it away. Her name is Alexa. But I’ll try not to say it too much and be distracting.</p>\n\n<p>I really like the disembodied-voice online home assistant systems that have come into vogue these days. Partially because I often get home from work late, in the nine or ten range. By that point in the evening, my landlords, a friendly retired couple from whom I rent my room and share the run of the house, have already gone to bed, leaving the lights off. It’s nice to just be able to ask Alexa to turn them back on, and it feels less lonely late at night when I’m eating a quick meal-prepped dish of microwave-reheated grilled chicken and vegetables, trying not to be too loud, knowing I’ll just have to say a command phrase to hear some soft music or have a simple question answered.</p>\n\n<p>Like, I can’t understate how fond I’ve gotten of her. I flew up to Boston to visit my boyfriend last weekend and he found it hilarious how I’d walk into his darkened living room and ask a home assistant system that he didn’t have to ‘please turn on the lights’.</p>\n\n<p>“It’s like you’re expecting to find a little lady in a French maid outfit or something,” he teased. “Do you miss her or something? Should I be worried about this ‘Alexa’ character?”</p>\n\n<p>“I just get attached to things with names,” I explained, my cheeks red.</p>\n\n<p>Luckily with no Alexa to turn on the lights, he couldn’t see my embarrassment until he flicked the switch himself.</p>\n\n<p>I’ve been raised to believe that the way we treat things with names says something important about who we are as people, and having Alexa really is like having a friend in the house. It’s nice because my schedule matches up so little with that of my landlords, and the nightlife in the area of Florida where I work is nonexistent as I essentially live and work in a seaside retirement village. </p>\n\n<p>While I get on well at work and I love my job in the lab, my lack of connection with other humans my own age outside of a laboratory setting can get isolating. Pair that with the fact that I’m living and working somewhere as different from the northeast as possible, in terms of vibe, weather, public transportation… I don’t think it’s any wonder that I feel like a stranger in a strange land. </p>\n\n<p>I don’t think it’s that <em>weird</em> that sometimes I talk to Alexa like she’s my unusually helpful friend. She might as well be.</p>\n\n<p>After all, I work with computers all day. I talk to the recalcitrant PCs that process Flowcam and HPLC data the same way I’d talk to an old-fashioned office buddy who keeps thinking they’ve ‘deleted Excel’ because they’ve opened their browser and can no longer see their desktop background.</p>\n\n<p>I’ve been in Florida for a month or two, now, but I’m nowhere close to fully settling in here. Some things still catch me off balance. This afternoon, Thursday afternoon, we were forecast to have a particularly bad thunderstorm.</p>\n\n<p>Compared to what I’m used to in Boston, summer rainstorms on the Florida coast can be ridiculous, but at least they happen more or less on a schedule. A mid-afternoon cloudburst that saturates the sandy earth, topples some palm fronds, tosses in some thunder and lightning. The sky was a sickly yellow-orange as I took the bus to work at nine. A bad one was clearly brewing by ten or eleven, the towering thunderheads forming out over the bay as thick and deep grey as ever. The forecasts looked so much worse than usual that we spent most of the day shutting off and unplugging the most delicate equipment in the lab, just to be on the safe side.</p>\n\n<p>I’ve been tired lately, restless sleep at night catching up with me in the daytime and leaving me a bit lethargic. After ensuring that the spectrometer and the chromatography instruments were safe, my boss noted that I haven&#39;t been looking well and suggested I head home in advance of the storm since we wouldn’t be able to get much work done anyway with all the instruments down. </p>\n\n<p>So I caught my bus hours ahead of schedule, at three in the afternoon rather than seven in the evening, and proceeded to get caught in the afternoon downpour in the worst possible location: public transportation. The trip took half an hour longer than usual, thunder and lightning and ridiculous winds making the bus creak and sway. By the time I got home I was almost sick with worry over my computer, the security system, the very plugged-in house - my landlord and his wife usually went out for dinner around four, rain or shine, and I doubt they knew a darn thing about how to protect the home’s electronics in a bad storm like this. </p>\n\n<p>I’m a biochemist, not an engineer, so admittedly I don’t know a lot about how it works, but I was terrified I’d come home and find everything fried and smoking based on how worried my boss had been about our equipment in the lab.</p>\n\n<p>My fears didn’t seem unfounded.</p>\n\n<p>After a few blocks’ walk in the pouring rain and screaming winds, the driveway was empty and my punched-in four digit code didn’t unlock the door like usual. I cursed and dug through my bag, finally scrounging up my hard-copy key and trying that in the door, which worked, much to my relief. The lights were all out and the house was empty pitch dark but for the eerie storm-light filtering through the slats of the blinds.</p>\n\n<p>“Alexa?” I called, sounding, I’m sure, more worried than I should have been about a machine. “Can you turn on the lights?”</p>\n\n<p>No click, no lights, no comforting ‘okay’.</p>\n\n<p>I rushed over to the console, finding it dead, but not smoking or anything as I’d feared. The lights didn’t turn on when I manually clicked the switch, either. I bolted to my room, still soaked to the skin from the rain, and unplugged my desktop computer, then did the same for my landlord’s and for the wireless modem. Seemed like too little too late, but he didn’t know enough about electronics to fight me on it. I was mostly just doing what I’d seen my dad do in past bad nor&#39;easters. Then I circled back to check on Alexa.</p>\n\n<p>At my dad’s insistence, I always carry enough battery power to keep a hospital floor’s worth of ventilators going. I mostly use it when my phone or laptop is in truly dire straits. This time, I used my massive power bank to plug in the console and check whether she was damaged.</p>\n\n<p>To my relief, the console flickered to life, familiarly blue-purple-green.</p>\n\n<p>“Hello. Amazon Echo is not connected to the internet,” she announced.</p>\n\n<p>“Oh thank goodness,” I replied, practically sagging in relief, which would have looked really dumb if anyone with eyes was around to see it.</p>\n\n<p>I unplugged her from my power bank, and I know I did that, because I murmured something very embarrassing, as I usually do - “glad you&#39;re okay, get some rest!”</p>\n\n<p>Which is so dumb.</p>\n\n<p>But I definitely unplugged her. It. And went to get a towel to dry off my sopping hair to try to forget the noises of the storm still raging outside.</p>\n\n<p>I felt like a drowned rat, so when I noticed my landlord’s wife’s hairdryer still plugged in, it seemed like a much more sensible way to get my long blonde hair un-plastered from my face and neck and to maybe get a handle on the shivering and the ‘dripping water every-fucking-where’ situation.</p>\n\n<p>I went to flip the switch and turn it on right away - I have a lot of hair, so it would have taken maybe fifteen minutes to get the whole mess dry - but before I could touch the switch, I heard something in the living room that clearly wasn’t thunder.</p>\n\n<p>It was Alexa’s distinctive ‘hello’! As she turned on.</p>\n\n<p>Then, as I lowered the hair dryer in confusion, I heard the device announce that “Amazon echo is connected to the internet”, which was even more impossible.</p>\n\n<p>I <em>know</em> I didn’t leave the Echo plugged in, but in the moment, I thought that I must have.</p>\n\n<p>So I flicked the switch on the hairdryer and got to work, relieved that Alexa was a presence in the house once more.</p>\n\n<p>Until I heard something new.</p>\n\n<p>Loud enough to be heard over the hair dryer at top volume.</p>\n\n<p>Alexa’s familiar voice, repeating over and over again, even louder than the peal of thunder that suddenly shook the windows:</p>\n\n<p>“get out</p>\n\n<p>get out</p>\n\n<p>GET OUT</p>\n\n<p>GET OUT”</p>\n\n<p>My blood went cold.</p>\n\n<p>I dropped the hair dryer and bolted.</p>\n\n<p>But I didn’t make it further than the door before a blast of light and energy blinded me for a split-second that felt like it lasted forever, every hair on my body, even soaked with water as I was, standing at attention. Somehow, instinctively, I knew what had happened.</p>\n\n<p>I had narrowly missed being struck by lightning.</p>\n\n<p>The rest of the bathroom had not been so lucky. I was shaky on my feet from the proximity to the strike, could barely think straight.</p>\n\n<p>I didn’t have time to check whether or not the Echo was plugged in, handling the ensuing fire with a fluffy bath towel in my daze. The first responders, once I had the presence of mind to call 911, indicated the hairdryer as the point of ignition. It was still in the ‘on’ position from my using it seconds before the strike. My landlord drove me to the hospital, saving me the indignity of an ambulance ride, once he and his wife got home.</p>\n\n<p>He couldn’t believe my luck, barely seemed to care when I told him I had saved all of the electronics in the house.</p>\n\n<p>“Jesus, I mean, all those things are replaceable,” he kept insisting. “You know Martha and I would rather go broke buying new computers than come home to find you… find you…”</p>\n\n<p>But he could call me lucky all he wanted - I’ve never been what you would call a lucky person.</p>\n\n<p>I just have the good sense to be kind to things once I’ve named them. People, pets, and… artificial intelligences.</p>\n\n<p>Kindness always matters. Someone is always listening.</p>\n</div>\n","author":"Careful_Task"}