{"rank":"5","title":"Now i understand, in fact, it all fits in","id":"8lxh4r","url":"/r/nosleep/comments/8lxh4r/now_i_understand_in_fact_it_all_fits_in/","time":"1527207044000","body":"<div class=\"md\"><p>&quot;Aaaaaaaaaaaaaaaaaaaaaaa!&quot;</p>\n\n<p>&quot;Aaaaaaaaaaaaaaaaaaaaaaa!&quot;</p>\n\n<hr/>\n\n<p>My wife and I were only married a few years before the arguments started. I would not say that we were a happy couple; we had our moments, but as soon as the arguments got louder and more violent, I knew it was not long. I knew it was not long before divorce came up the road. It all started on one night; we had just eaten dinner and she thought I complained about her spaghetti. By “she”, I mean Melissa.</p>\n\n<p>“I heard what you said.” She said, hatefully.</p>\n\n<p>“All I said was that it was good. I never said anything bad.” I said, trying to convince her.</p>\n\n<p>“Sure. Whatever, but I know what I heard Rob.” She spat coldly.</p>\n\n<p>“What else do you want me to say? Do you want an apology?” I yelled, finally fed up with her.</p>\n\n<p>That is when something shattered next to the cupboard beside me. Glass flew everywhere, and a piece of it cut the side of my cheek. Blood gushed down my face, onto my shirt, and onto the floor like a river. I stared at the shattered glass and looked back up at Melissa. She was staring at me, holding another glass in her hand.</p>\n\n<p>I held my hand up and said, “Alright, I am sorry.”</p>\n\n<p>“Sorry? You are sorry now, aren’t you?” She said through gritted teeth. I took a step in her direction and she raised the glass threateningly.\n“Don’t you fucking dare?” She seethed. Anger shot through me like a cork out of a wine glass. I made another step and she hurled the glass at me. I caught it carefully and set it on the table.</p>\n\n<p>Then, she pulled out a knife.</p>\n\n<p>“I will.” She said.</p>\n\n<p>“Honey, calm down, please? This is just a misunderstanding. You wanted to say sorry, and I did. I did say sorry; straight from the heart.” I said, pleadingly. I stepped a bit closer to her, and I noticed that she was crying.</p>\n\n<p>She held the knife in front of her still and said, “I cannot do this anymore. I’m calling for divorce.”</p>\n\n<p>My stomach dropped, and I was a bit shocked, yet, pleased at the same time. I stopped walking towards her and stood there, awkwardly. She had stopped crying.</p>\n\n<p>“Are you alright? Hon? I am so sorry.” I said, tears burning in my eyes.</p>\n\n<p>“No, I am not. I am moving out tonight.” She said, finally.\nShe went upstairs and packed all of her clothes. I thought about helping her, but I kept thinking about the knife she had, and the way she pointed it at me. A half an hour later, she came tumbling down the stairs. Her mascara was smeared, but she did not look pretty to me. In fact, she looked like a demon. She looked evil.\nShe walked out the door without saying goodbye and drove off in her Sedan. I stood there, just for a moment in the driveway. A light rain had started, and I knew it was not long before it turned into snow. I was partially glad it was over and done, and the other half told me I made a mistake.\nSomething told me that this was not finished yet</p>\n\n<hr/>\n\n<p>Melissa called me a few days later and said that she had moved into an apartment in the city. She seemed happier too. We both decided that we wanted a divorce; we called our lawyers and got the petition settled out.</p>\n\n<p>About a month or two later, we went to court, and it was official after that. I kept the house, but she got some of the furniture. We never had children, so that was not an issue. </p>\n\n<p>The months flew by after that. I do not remember anything happening specifically during those months, but I remember the restless nights. Outside our house, there was a dog that constantly barked. The owners never bothered to call it inside either. I complained, but they never ceased. I would occasionally lace my fingers behind my head, after taking a few sleeping pills, and fall asleep. By then though, the clock had already struck 2 a.m.\nNone of those noises in the night, and the thoughts and voices never ceased.</p>\n\n<p>About a year later, in the summer of 2003, my wife was engaged to another man named Don. He was a short, pudgy man with a bushy mustache. He was shorter than Melissa was, but I admit, he was nice. I met him at the supermarket downtown once, and we talked for a little bit. That is how I found out she was engaged.</p>\n\n<p>“Why didn’t you tell me?” I inquired.</p>\n\n<p>“It is none of your business anyway. Besides, why do you care?” She asked angrily.</p>\n\n<p>I sighed and said, “I wanted to make sure he was the right one. I still care about you.” I said, trying to act cheerful. There was a pause on the phone, and then she answered.</p>\n\n<p>“To be honest; I just think that you have to move on. You do not have to care about me anymore. I am fine. If it makes you feel any better, you are invited to the wedding. It is on November 6.” She said nicely.</p>\n\n<p>“I might come. I am glad for you.” I said awkwardly. </p>\n\n<p>“Okay.” She said, and then hung up abruptly.</p>\n\n<p>I sat there a moment and thought about going to the wedding. Would it be a bad thing not to? I did not want to disappoint her if she wanted me to come. After all, she did not plan to tell me they were engaged anytime soon. November was a long ways away, so I did have time to think about it.</p>\n\n<p>Around October, just before Halloween in fact, I was watching videos of “How It’s Made” and I saw this documentary pop up. It was about the serial killer named John Ramsey, aka The Red Executioner. He killed many young boys and girls and kept their bodies. He would drain them of their blood and put it in jars. They never caught him, nor did they get a photo of him. They only had drawings.</p>\n\n<p>Some of the drawings I looked at looked identical to Don, the fiancé. I tried calling Melissa to get background info on Don, but she always hung up. We ended up arguing and shouting just like any other time. I had a bad feeling about Don, and it never went away. God, it never went away.</p>\n\n<p>At one point, I was actually convinced that he was the serial killer. They described John Ramsey as short, pudgy, and facial hair. Maybe I was just being paranoid, but I always went with gut. Always; and something about the wedding did not seem right.</p>\n\n<p>As soon as all that happened, the wedding was there. It was a casual wedding, so I decided to wear khakis, a white-collar shirt, and some loafers. It slicked my shoulder length hair to the side and I went on my way. I made sure to wear jacket on the way there. A light rain had started, but the wedding was inside a small, cozy church on the outskirts of the city. I recognized a few people there; but I saw Don first. </p>\n\n<p>He was more fit this time, and it looked as if he had lost weight. His mustache was gone too.</p>\n\n<p>He looked at me curiously and walked over towards me.</p>\n\n<p>“Hello?” He said weirdly.</p>\n\n<p>“Hey, uh, Melissa invited me.” I said quickly.</p>\n\n<p>“Oh, okay, um, good to see you again.” He said and reached for a handshake.</p>\n\n<p>I returned with the gesture, and I noticed something strange. Was he sweating in 40/30 degree weather? He had been standing outside when I got there, so why was he sweating? I also saw a dark, blotchy stain on his tuxedo. It looked like blood at first; was it blood? I made myself believe it was an ink stain.</p>\n\n<p>We chatted a few more minutes, but all I wanted to do was get the wedding over with and done. I walked inside the church and everyone gave me weird looks. I walked over to the table I would be sitting at and saw my name. “Bob Henderson” it read. She always called me Rob though. About an hour later, the wedding started. Melissa looked devilishly beautiful in her wedding dress. They said their vows, and I looked away when they kissed.</p>\n\n<p>We got dinner set up, and that is when I noticed something strange. I saw Don standing beside Melissa, but he was clenching his fist and putting his hand in and out of his tuxedo. I saw something glint, and I had an awful feeling that it was a knife. A few minutes later though, I saw him pull out a cigar and a lighter. It had been a lighter, and nothing more.</p>\n\n<p>Melissa nodded at me and I nodded back.  As soon as the feast began, I heard loud screams coming from the table Melissa and Don were at. I spilled ranch dressing on my shirt getting over there, and what I saw horrified me. I saw a knife jutting out of the best man and Don trying to pull it out. People screamed and ran away. I saw Melissa on the ground, and part of her shoulder was slashed.</p>\n\n<p>“Aaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaa!” Don shrieked as the knife came out with a wet, shing. </p>\n\n<p>He sprinted at me and pushed Melissa out of the way. The knife caught my rib and we both were flat on the ground. Pain flared throughout my side.</p>\n\n<p>“Aaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaa!” Don yelled and tried to stab me more, but I blocked him.</p>\n\n<p>I pushed him off me, shot up, grabbed Melissa, and ran outside. I saw Don in the background slashing others, so I left Melissa and went inside to stop him. I grabbed him by the collar and flung him into the middle of the parking lot. </p>\n\n<p>He kept making that constant noise while I tried to block his moves. Melissa just stood there and gazed in horror and awe. I yelled at her to call the police, but she stood still. I knocked the knife out of Don’s hand and it landed on the ground. The rain had started to pour, and it was turning into sleet.</p>\n\n<p>He lunged for the knife, but I kicked it out of the way. It slid over to where Melissa was standing. I ran over there, picked it up, turned around and WHAM! Don ran straight at me. He coughed warm blood in my face and started to shake. I took the knife out, and in a fury of rage, I started to stab him. I do not know how many times I stabbed him, but it was enough to make the ground crimson, and my shirt the same color.</p>\n\n<p>I got up and went over to Melissa.</p>\n\n<p>“Oh my God!” She said quietly. She was in shock. </p>\n\n<p>I tried to pull her into an embrace, but she pushed me away forcefully.</p>\n\n<p>“You killed him. You fucking killed him!” She screamed.</p>\n\n<p>“I saved your God damn life Melissa.” I said softly.</p>\n\n<p>“No you did not. You just killed my husband.” She spat.</p>\n\n<p>“He was killing people; what was I supposed to do?” I yelled.</p>\n\n<p>“You did not have to kill him, and I do not want your sympathy.” With that, she stormed back into the church and I was left out there in the rain.</p>\n\n<p>“Aaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaa!” I whispered underneath my breath. Anger flooded me like a river and picked up the knife.\nAll those days I spent in that house. Alone and awake. Listening to the dog and crickets. Going insane slowly. Being fed up with her. Maybe Don was fed up too. Maybe that is why he did what he did.\nI saw the blood running through my fingers and down my arm. The knife glinted in my hand, as if begging me to do something. I walked back inside the church slowly; the knife clutched in my hand, ready to do something unimaginable.</p>\n\n<p>I started to make the noise too.</p>\n\n<p>Now it all made sense. It all made sense.</p>\n\n<p>“Aaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaa!”</p>\n\n<p>“Aaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaa!”</p>\n</div>\n","author":"Dan100903"}