{"rank":"66","title":"The old rope swing (Part 2)","id":"8lxllx","url":"/r/nosleep/comments/8lxllx/the_old_rope_swing_part_2/","time":"1527208172000","body":"<div class=\"md\"><p>[<a href=\"https://redd.it/8kwn9e\">Part One</a>].</p>\n\n<p>Long story short, I did <em>not</em> like what I found.</p>\n\n<p>My sister was right about one thing; there are no photos of the old rope swing.</p>\n\n<p>After my sister had basically kicked me out of the family, after she claimed that our childhood was a lie, I went straight to our shared storage. If the circumstances were different I would have waited. Even though the storage unit was totally lit with the orange glow of artificial lights, even though I could see around it just as good as I could during the day, there are few places that I can think of that are more creepy. Going to a storage facility at night is <em>asking</em> to be on a <em>Missing Person</em> flyer. But my family life was on the line. I had to go.</p>\n\n<p>The orange garage door of the storage unit was covered in dust and grime. Somehow the pavement below it seemed cleaner, and the pavement was painted in old motor oil stains. The artificial light from the facilities lamp posts was domineering and impersonable. The darkness around the facility was complete, the facility was an island of muck surrounded by a sea of night. I opened the storage door and was immediately assaulted with a stale stench of dust and mold that had been long dead. The tower of boxes that had seemed so organized during the day now appeared to be ominous as they cast jagged shadows. I knew right away which box I need to get to. I looked behind me before I entered, my car keys were clutched like miniature knives.</p>\n\n<p>Half of me thought that this was stupid. Kaylee had simply asked for some rope to play with and mentioned her imaginary friend. So what if that imaginary friend had a creepy name? What imaginary friend doesn’t have a super creepy name? My sister was overreacting.</p>\n\n<p>Overreacting, but not lying. I know her well enough to know that she believed what she was saying. It was my job to show her that what she believed wasn&#39;t true. We would be laughing about this in the morning. I opened the cardboard box that I had come for.</p>\n\n<p>I did not like what I found.</p>\n\n<p>There were no photo albums, no old binders with shitty scrap-booking, no instant Kodak pictures. No, it was not full of any of the items I remembered. There were only poorly drawn pictures, all of them done by the hand of a child. All of them drawn by me. Old printer paper, colored construction paper, even torn out notebook paper, it didn’t matter, all of them depicted something disturbing. A dead tree hanging a rope. A smiling face with dead eyes. A little girl who never smiled. Pages and pages and pages drawn from a child’s mind that was not simply broken, but <em>shattered</em>.</p>\n\n<p>The only label above any of them, the only thing scrawled across the pages in my handwriting: <em>Forget Man</em>.</p>\n\n<p>The name of Kaylee’s imaginary friend. Of my imaginary friend.</p>\n\n<p>The light from outside suddenly got dimmer, as if someone was behind me. I turned around in fright. My keys were clutched tight. My heart raced and my breath became shallow. My eyes darted from side to side… I saw nothing. There was nobody there. At least not anymore.</p>\n\n<p>I gathered my courage and stepped slowly out of the unit. Keys out in one hand, a few pages of drawings in the other, clutched to my chest. The facility was just large rows of identical units. When I peeked outside there was no one in either direction. If they darted into a unit, I would have heard them open one. My mind had to be playing tricks on me. The drawings had made my nerves raw, and the creepy nature of the storage facility did not help. I talked myself down from the terror that I felt and breathed in deeply. When I turned back around to face the inside of the unit there was an empty space where the box of drawings should have been. It was gone.</p>\n\n<p>I <em>did not</em> stick around to find them.</p>\n\n<p>I dragged the storage unit’s door hard behind me. I have no idea if I locked it, I was a slave to adrenaline. I ran straight to my car and darted out of parking fast enough to get a ticket. Only the three pages clutched to my chest remained of the collection.</p>\n\n<p>I did not get what I came for.</p>\n\n<p>This was supposed to settle things. I was supposed to find happy memories to vindicate myself from my sister’s delusions, but now? Now I don’t know. Now I had more questions than answers.</p>\n\n<p>In truth, I did not have a plan. I went back to my sister&#39;s without thinking about it. Terror had put me on a manic autopilot. I kept my eyes forward as I drove, not to watch the road, but to keep my eyes from drifting onto the pictures of the Forget Man.</p>\n\n<p>Long lengths of rope. Children dangled upside down. A leering smile from a dead face. The Forget Man.</p>\n\n<p>If this were true, if what my sister insisted had happened, how often had I tried to dangle her from a tree, like our townsfolk had done to heretics back in the day? How many of my happy memories were really macabre games played by a sociopathic child? I can tell you now, that despite my fright I don’t think I actually <em>believed</em> in the Forget Man. But I had evidence that suggested at the very least that I was a monster to my sister in our youth. None of this set well with me.</p>\n\n<p>Then I got home.</p>\n\n<p>In this one case, in this one instant, darkness would have been a comforting sight. A dark home with no lights? That meant that everybody was fast asleep and safe inside. But the lights were on… and the front door was wide open.</p>\n\n<p>I got out of the car. I called out to my sister, I called out to Kaylee. Silence. Bitter ominous, <em>terrifying</em> silence. No one was home, and scattered around the house were pictures of the Forget Man, <a href=\"https://revfitz.com/forget-man/\"><strong>authored by Kaylee</strong></a><strong>.</strong></p>\n\n<p>[<a href=\"https://redd.it/8muvy2\">Part Three</a>].</p>\n</div>\n","author":"revfitz"}