{"rank":"1","title":"A first of many","id":"8lxqit","url":"/r/nosleep/comments/8lxqit/a_first_of_many/","time":"1527209464000","body":"<div class=\"md\"><p>There is a saying that goes <em>If you think you are crazy, then you definitely are not.</em>  I personally find that to be less than true.  At least for me.  Having experienced the legitimate blurring of the lines of reality (not in the <em>everything is true even if it is not</em> sense, but instead in the completely 100&#37; true sense), I think it would be more accurate to say that I can sense when I am drifting into the shallow eddies of insanity and when I step back on the solid ground of rational thought.  What lies in-between...well I hope that my memory is at least somewhat accurate.</p>\n\n<p>All that being said, I have many stories that I would like to share here and all of them contain true events that are original and personal to me. Some will have more narrative and embellishment than others, but all of them have their foundation in experiences I have actually had in my life.  This first one is completely true without any exaggeration. So some may find it a bit tame.  But being about 12 at the time, this was one of the first most horrifying experiences I have had.</p>\n\n<p>*********</p>\n\n<p>I was a pretty good kid in my neighborhood and stayed out of trouble.  But there was this other kid, Justin, who was the epitome of trouble.  At 12, he was about three years older than me and had a younger brother that was just 8 months ahead of me.  So they were an ideal fit for friends for myself and my older brother.  At least until we realized that Justin pretty much was devoid of good intentions.</p>\n\n<p>One of the things we would do with them when we were first becoming friends was to roam the neighborhood of our development at night.  It was mid-summer in North Carolina during the late 80s, and it was pretty much unheard of for bad things to happen to kids in our neighborhood.  And of course we felt like little badasses hanging out with Justin who would howl at the moon in the middle of the street at 8pm.  Because sometimes memory is a thing for me, I cant remember if the events all happened on the same night or not, but I think they did.</p>\n\n<p>We had been out at night (myself, my brother, Justin, and his younger brother) and had been hanging out in a house that had finished being framed and was still under construction watching Justin smoke and tell stories of his wild and rebellious youth.  We should have learned by now not to hang out with him after he took us on an adventure walk that ended up going through a junkyard, only to leave us behind when he stirred up a literal hornets nest and was no where to be found as I ran home screaming because of the 44 stings I had received.  I guess you could say I was a slow learner.</p>\n\n<p>So there we are in this house with Justin, and he has been breaking boards that are part of the frame and generally just being destructive when he gets this look in his eye.  He stood up from where we were sitting and said &quot;Come on guys, this is going to be cool.&quot;  It was the a few days before Halloween so our little adrenaline pumpers were already primed with dreams of epic candy runs anyways, so we assumed it would be worthwhile.  We follow Justin down the street a ways (I think it was around 9:30pm) and there is a small crowd of us: us four, plus I think another two of the neighborhood kids.  After a short hike down one of the main neighborhood streets we stop in front of this nice house that belonged to someone we all knew.</p>\n\n<p>I don&#39;t remember her name so I will just call her Shelly.  Shelly was one of the prettiest girls in school but she generally had the reputation for being really stuck up.  At least thats what Justin always told us.  And with her dad having a cherry red Porsche 911 in the driveway, it was believable.  So we are standing at this corner near the house listening to Justin, and some of the other kids, trash talk the girl.  And then Justin pulled out a roman candle.</p>\n\n<p>I had been around fireworks before, but at that age a <a href=\"https://en.wikipedia.org/wiki/Roman_candle_(firework\" rel=\"nofollow\">roman candle</a>) was the next best thing to actual explosives.  He chuckled as he pulled it out of his pocket (I don&#39;t know why I hadn&#39;t seen it before) and said &quot;watch this,&quot; as he lit it.  The five of us stood there in silent suspense as he lit the firework with his yellow bic lighter and then raised it up so that it was aiming straight at the house.  I remember I was standing next to my older brother at the time (who had always kind of looked out for me when we were with Justin) and we were both trying to even breathe quietly in anticipation of what was about to occur without thinking of what the result might be.  We heard the fuse fizzle in the darkness and then a pop.  The first colorful shot rocketed out and struck the roof before ricocheting speedily out of sight into the night sky.  Our response was an expected chorus of &quot;woah&quot; and &quot;radical&quot; (again, late 80s), and I think someone even taunted Shelly saying &quot;yeah take that bitch&quot; as shots continued to pop out and strike various parts of the house. The exterior brick, shutters by a window, a window (fortunately it did not break) and then the gutter.  But that last one seemed to actually increase speed as it was redirected right at the Porsche and bounced noisily off the hood.</p>\n\n<p>My brother, who was as good natured as I was, broke one of our parent&#39;s rules and exclaimed &quot;Shit Vazhilli (but using my real name)!  RUN!&quot;</p>\n\n<p>I knew I was in deep trouble for being involved in one of the most expensive cars in the neighborhood getting damaged, so I turned and sprinted as I heard other kids yelling and shouting in different directions.  Somewhere in the middle of all that cacophony, I heard the front door of the house slam shut.  We were now being chased.  And then it got worse.</p>\n\n<p>When you are a 12 year old kid, the sound of a Porsche 911 starting up is pretty much the same as an epic rock ballad about all things awesome.  When you know the roar of that engine is for you, it sounds a lot more like you are about to be force-fed to a chainsaw.  I remember tears streaming down my face and crying out loud as I ran as fast as I could make my short legs go.  The engine didn&#39;t just roar to life with the sound of vicious hatred, it was coming my way.</p>\n\n<p>Being a stupid 12 year old I had managed to pick the one direction that was uphill, where no one else had gone, towards a cul-de-sac.  I don&#39;t remember what I was thinking, only that I was moving as fast as I could and was highly confident I was about to get caught, or worse.</p>\n\n<p>The street was straight until the end where it curved right into the circle, and I remember cutting through some guys front yard as I tried to rush further away from the speeding death machine.  I think I was just hoping to somehow cut through the neighborhood to go home, but I could tell this was a race I was losing.  Fast.  Miraculously at the end of the circle there was a plot of land that had not been developed at all yet, and I recklessly plunged headlong into the high grass that filled it as I heard the sickening squeal of tires rounding the corner.  I had fallen and I knew I didn&#39;t have time to get back up and run because of the glaring beams from the headlight that swung overhead.  So I quickly turned onto my belly and pointed my head towards the street as I willed every cell in my body to just freeze.</p>\n\n<p>The car snarled to a stop as the tires came to rest mere feet from me.  I thought I might be safe in the foot high grass, until the car door slammed.  Tears were still streaming down my face as I held my breath and watched the shadow of a figure cross back and forth in front of the penetrating white light coming from the car.  I was only 12, and so my sense of distance was obviously skewed, but I felt as though he were pacing right in front of me.  I could hear him talking to himself in a low, grumbly tone. And while I couldn&#39;t make out any words I remembered it sounded very angry and violent.  But I just lay there thinking &quot;he&#39;s gonna see me! He&#39;s gonna see me! He&#39;s gonna see me!!&quot;</p>\n\n<p>I could feel my body tighten as I was holding my breath and I just knew I wasn&#39;t going to make it long enough for him to go away before I gave my self away by gasping for air.  And then suddenly he got back in his car and drove off.</p>\n\n<p>As soon as I saw the headlights swing away, I gulped in as much air as I could take as I pushed my face into the dirt and wept openly.  Waiting for his inevitable return.  But thankfully that beast of an engine had roared off into the distance in search of another child.  After what seemed like half an hour, I finally stood up on very shaky legs and started walking further into the darkness and the empty lot.  I knew that a road that lead back to my house was just on the other side, and as soon as I could I began running, not caring about the branches that were smacking me in the face as my mind was plagued with images of the man somehow jumping out of the dark and grabbing me.  Finally I burst through to another empty lot with neatly trimmed grass and the road beyond.</p>\n\n<p>I breathed a deep sigh of relief and tried to wipe away some of my tears as I saw my brother and one of his friends walking down the road as if nothing had happened.  He called me by my name and asked where I went, but I just answered with a sullen &quot;I don&#39;t know&quot;, glad that he could not smell the urine that had soaked my pants.  I never went anywhere near that house again, or hung out with Justin again after that, but I remember for at least a week or so expecting that Porsche to pull up any moment and get me.</p>\n\n<p>For a 12 year old....that was one of the scariest things I ever experienced.</p>\n</div>\n","author":"Vazhilli"}