{"rank":"3163","title":"I wrote a letter to myself. I got a response.","id":"8lxrvb","url":"/r/nosleep/comments/8lxrvb/i_wrote_a_letter_to_myself_i_got_a_response/","time":"1527209820000","body":"<div class=\"md\"><p>I’ve been on my knees trying to scrub up all this blood and the scraps of paper for the last half hour.  I’m making some progress, but it’s slow, and I keep having to stop when my hands start shaking too much.  I’m out of my apartment for the moment, sitting on the floor in the hallway, and I can feel my nerves settling some.  I’m going to write this out so I’ll have it all recorded and also so I can wait a bit before having to go back in.</p>\n\n<p>&nbsp;</p>\n\n<p>It started when I was bored yesterday.   The internet was out in my apartment, and after casting about for a couple of hours trying to read or do some cleaning, I was out of ideas to entertain myself.  That’s when I saw the box of stationary on my desk.</p>\n\n<p>&nbsp;</p>\n\n<p>My Aunt Emma had given me the stationary as a birthday gift the week before, and there was nothing inherently wrong with such a gift—it was a box of high-quality paper and envelopes personalized with my initials at the top of the sheets of paper and on the back fold of the envelopes.  As a seventy year-old man I would probably have thought they were the cat’s pajamas, but as a twenty-five year old man, not so much.</p>\n\n<p>&nbsp;</p>\n\n<p>But still.  I was very bored, so I sat down at my desk and started messing around with it.  At first I tried writing as neatly and fancily as I knew how.  My handwriting is horrible, and my best efforts looked like a slow fourth-grader as opposed to a slower second-grader, but it was something to do.  Then I doodled a bit, but my drawing skills are equally lacking.  </p>\n\n<p>&nbsp;</p>\n\n<p>I was feeling myself getting drowsy, but then a thought occurred to me of what to do with the stationary.  I’d write a letter to myself.  It was a stupid idea, but I thought it was kind of funny too.  So I took out a clean sheet of paper and set to work.</p>\n\n<p>&nbsp;</p>\n\n<p><em>Hey Scott!  How’re you today?  My day is okay if kind of boring.  Christine is out-of-town visiting her parents and the internet is dead!  I have zero ideas of what to do with myself.  This is lame.  Good-bye.  Sincerely, Scott.</em></p>\n\n<p>&nbsp;</p>\n\n<p>The novelty of the idea had clearly worn off quickly, but I did fold it up and stick it in an envelope at least, even going so far as to address the letter to myself.  Standing up from the table with a sigh, I laid down and fairly soon I was fast asleep.</p>\n\n<p>&nbsp;</p>\n\n<p>When I woke up it was early evening and the room was only dimly lit by the fading twilight outside.  I reached over and turned on my bedside lamp, blinking blearily at its brightness.  I hated taking naps.  I always felt groggy afterward and had trouble sleeping later in the night.  Rubbing my eyes, I rolled discontentedly onto my side and began getting up.  When my eyes lit upon my desk, I sat back down.</p>\n\n<p>&nbsp;</p>\n\n<p>The envelope with the letter I had written was different now.  It was in a different spot for one, but I could tell from the bed that it was also a different color and looked like it had a small stain in one corner.  Standing up and going to my desk, I looked at the envelope closer before picking it up.  My name and address was still on the front, but hadn’t I written it smaller and more centered than that?  Regardless, the envelope itself was definitely different, so clearly I hadn’t written this at all.</p>\n\n<p>&nbsp;</p>\n\n<p>My next thought was that someone had come into my apartment to either prank me or try and scare me.  The obvious answer was Christine.  It didn’t really seem like something she would do, but she was the only other person with a key.  After I did a quick sweep of the apartment for intruders I texted her.  She swore she was still half a state away and even sent me a picture as proof.  She also seemed worried and asked if I had called the cops, but I wasn’t to that point yet.  I needed to look inside the envelope first.</p>\n\n<p>&nbsp;</p>\n\n<p>I pried it open carefully and peeked inside, seeing a light blue piece of paper that matched the envelope and was wholly different than the cream-colored paper I had used earlier in the afternoon.  When I unfolded it, I was surprised to see it really did look like my handwriting, but it wasn’t the same letter.  Instead it seemed to be responding to mine.</p>\n\n<p>&nbsp;</p>\n\n<p><strong>Good to hear from you!  I’ve been watching you when I can for years, and it seems like the universe has finally given us a way to talk!  I’m guessing that you have apartment 3B on Nesbitt Street in Baltimore, right?  And your Uncle Tom gave you the box of stationary for your birthday?  It’s so weird!  I guess things have to line up just right.  If this actually works and you are reading this, I know it will probably come as a shock.  I don’t think your side knows about us like we do you.  But that’s cool, we can swap stories!  I’ll keep it short for now, but hope to hear from you again soon.  Glory and peace, Scott.</strong></p>\n\n<p>&nbsp;</p>\n\n<p>I read the letter three times.  I really couldn’t tell I didn’t write it other than the content itself, which was decidedly weird.  Whoever was doing this was either a very good prankster or I had a dedicated stalker that had taken the time to learn my handwriting.  Either way, I was calling their bluff.</p>\n\n<p>&nbsp;</p>\n\n<p><em>Hey, man.  Good to get a response.  So are you like me in some other world?  That’s crazy.  Tell me some facts about your world and we can compare.  And if you have some kind of souvenir you can send next time, that’d be awesome!  Looking forward to the next letter!</em></p>\n\n<p>&nbsp;</p>\n\n<p>I put the new letter in an envelope, addressed it and set it on my desk.  I then took out my tablet, plugged it in, and set the camera to record at an angle where it could see my desk and the door to the bedroom.  I thought about just sitting and waiting, but the idea was too tedious and would make it less likely anyone would come back.  That was assuming this wasn’t some kind of one-shot joke or harassment, but time would tell.  Either way, I decided to go grab something to eat and see a movie.  Four hours later I returned home to another blue letter.</p>\n\n<p>&nbsp;</p>\n\n<p><strong>I understand you being skeptical. Thinking it’s all a joke, right?  Well, here’s some info like you asked, and I sent along something that might help convince you.  Our world is a lot like yours, though it is different in some ways.  About forty years ago we had a lot of animals start dying off.  Not all of them, of course, but most of the birds, all of the dogs, and a few other species here and there.  Still don’t know why.  But around that same time we lost our mirrors.</strong></p>\n\n<p>&nbsp;</p>\n\n<p><strong>What I mean is our mirrors stopped showing our reflections.  A lot of them just went dark, but some of them, where they have twins in your world, would show us your reflections instead.  We knew it was reflections because all the writing is backwards, and I can tell from your letters you don’t actually write backward anyhow. Lol!</strong></p>\n\n<p>&nbsp;</p>\n\n<p><strong>But after that, a lot of people started changing.  Getting weird or violent.  It’s stabilized some now, but it was really bad when I was younger.  A lot of people died.  Anywho, like I said, things are better now, though we do have odd stuff pop up and people go missing some.  Is your world like that?  From what I’ve seen and what I know of studies people on our side have done observing active mirrors, it seems like things are a lot better over there.  If so, I’m kind of jealous.</strong></p>\n\n<p>&nbsp;</p>\n\n<p><strong>But enclosed you’ll find one of our nickels.  It’s got President Robert Kennedy on it.  He was president from 1969 through 1977.  I don’t know for sure, but I think I read he’s one of the differences between your place and mine.  Write back soon!</strong></p>\n\n<p>&nbsp;</p>\n\n<p>I looked back in the envelope and found a nickel tucked into the corner.  On one side it had a man’s profile with the name “Robert F. Kennedy” listed under it.  On the other it had what looked like a large turkey glowering over a shield bristling with spears and covered with stars and stripes.</p>\n\n<p>&nbsp;</p>\n\n<p>What. The. Fuck.</p>\n\n<p>&nbsp;</p>\n\n<p>I remembered my tablet and checked the footage.  It had actually stopped recording after two hours, but it was enough.  At the forty-two minute mark I watched as my cream envelope gave a shudder and disappeared.  Thirty minutes later the blue envelope had faded into existence a few inches over on the desk.</p>\n\n<p>&nbsp;</p>\n\n<p>I wasn’t sure what to do at this point.  I thought about asking Christine for advice, but it would be hard to explain over the phone and I didn’t want her to worry.  I could call the police, but what good would it do?  Even if I showed them the video they would think it was fake and I was a jackass wasting their time.  I didn’t know if I believed everything the letters were saying, but I couldn’t deny the evidence was compelling, and if this guy really was another me, it could wind up being something really great.  I might even become famous for discovering some parallel dimension.  </p>\n\n<p>&nbsp;</p>\n\n<p>But first things first.  I needed to write another letter.</p>\n\n<p>&nbsp;</p>\n\n<p><em>Wow, so this is big news, right?  So you’re saying you can see us through mirrors?  That’s kind of embarrassing!  Can you hear us too or just see us?  Do your people have any theories on how this all happened?  Have other people on your world had this happen where you can talk to people from my world?  I’m very curious to know more.</em></p>\n\n<p>&nbsp;</p>\n\n<p>This time I watched as my letter disappeared, only to be replaced with another response a short time later.</p>\n\n<p>&nbsp;</p>\n\n<p><strong>Yeah, you’ve got a lot of questions.  I understand.  No, we can’t hear, just see, and I don’t know about anyone actually communicating like this before.  No one knows why the world is changing so much.  When the other things started appearing last year, people said it was the end of the world.  That we were being judged.  But people are just going crazy, you know?  I don’t believe in all that stuff.  Things are changing and we just have to change with it.  Hey, did you say you have a Christine?  Is she a hot blond girl there too?  She your girlfriend?</strong></p>\n\n<p>&nbsp;</p>\n\n<p>I didn’t like the tone of the new letter, and I had even more questions now, but I wanted to keep him talking, so I tried to respond in a way that would make him happy.</p>\n\n<p>&nbsp;</p>\n\n<p><em>Yeah, she’s my girlfriend.  She’s great!  We’re planning on getting married next year.  Do you have a Christine too?  Tell me more about your world when you can!</em></p>\n\n<p>&nbsp;</p>\n\n<p>My letter shuddered away fairly quickly and I waited for an answer, but none came.  It was getting late, so eventually I went to bed, though I would wake up periodically and check the desk.  Around six in the morning I saw the blue envelope and I jumped out of bed to read the two lines written there.</p>\n\n<p>&nbsp;</p>\n\n<p><strong>I did have a Christine.  But she was a fucking whore.  I had to punish her.  I hope yours isn’t a whore too.  Lol!</strong></p>\n\n<p>&nbsp;</p>\n\n<p>I was done.  I didn’t know what this was, but I knew it had to be real and it was feeling more and more like it was dangerous.  Throwing the letter down, I started looking around the room.  I saw the small mirror I had hanging on the back of my closet and I yanked it down quickly, hearing it crack as it hit the floor.  I tried to think of any others, and the only ones that came to mind were in the bathroom and the one Christine had hung over the mantle in the living room.  </p>\n\n<p>&nbsp;</p>\n\n<p>Christine!</p>\n\n<p>&nbsp;</p>\n\n<p>I looked at my phone and saw it was almost seven.  She was going to be back in town this morning, probably coming straight here.  I tried calling her, but it went straight to voicemail like it was powered off.  I didn’t have her parents’ number, so I had to resort to leaving her a voicemail and text message telling her not to come to my apartment, that I would meet her at hers when she got back.</p>\n\n<p>&nbsp;</p>\n\n<p>I debated what to do until she arrived, but ultimately decided I couldn’t stand being in the apartment myself, so I left a note on the door saying “Christine, don’t go in the apartment.  Call me instead.  I’ll explain and meet you.” and left the building.  For the next few hours I basically drove a circuit between our two apartments, occasionally parking outside one place or the other.  I was sitting outside her place when I got a call from her phone.</p>\n\n<p>&nbsp;</p>\n\n<p>It was her mother.  She said Christine had knocked her phone in the toilet getting ready for bed last night and they had put it in a bowl of rice to dry it out.  When Christine left to come back home a few hours ago, she must have forgotten it.  I felt my mouth go dry.  Her mother was asking what she should do to get Christine the phone, but I told her I’d have to call her back and hung up.  Based on when she left, she should have been back at least an hour at that point.  I knew she wasn’t at her apartment, so I sped back over to mine.</p>\n\n<p>&nbsp;</p>\n\n<p>I saw her car parked down the street from my place and my head started pounding.  Running up the stairs, I reached my door and saw the note I had left was gone.  In its place was a blue sheet of nice stationary bearing a drawing of a red ink heart and the words “Come on in!” in my handwriting. </p>\n\n<p>&nbsp;</p>\n\n<p>I started yelling her name as I fumbled the door open, but as I entered I could tell she wasn’t there.  The apartment felt empty and lifeless.  I ran to the bedroom, stumbling to a stop at the doorway.  My mind had difficulty making sense of what it was seeing at first.  On the wall next to my desk there were strips of paper plastered to the wall and making the outline of a small door about three-feet tall.  The strips seemed to be some combination of blue and cream paper, speckled here and there with spots of crimson and soggy near the baseboard where there were partial bloody handprints on both sides as though someone had been trying to hold on.</p>\n\n<p>&nbsp;</p>\n\n<p>Leading away from the paper door the floor was covered with more blood, and as I looked closer I could see several thick runnels in the wood that l thought at first were scrapes or cuts of some kind by something heavy being drug.  But then I saw one of Christine’s bloody fingernails, torn off at the nailbed and ragged, jutting out of one of the grooves she had raked into the floor in her fight to get away.</p>\n\n<p>&nbsp;</p>\n\n<p>I collapsed to the floor and began crying.  After a few minutes I pulled myself together enough to look around the room for any other clues or some means of helping her.  That’s when I saw the blue envelope on the desk.</p>\n\n<p>&nbsp;</p>\n\n<p><strong>You were right, she’s a hot one.  Better than mine even.  But I can tell she has those same slutting ways.  It’s in the eyes.  But don’t you worry.  She’ll find less tolerance for that over here, and I’ll be sure to keep her corrected.  Don’t bother trying to come across either, bud.  I figured out how to do it, but I’m going to have to keep it close to my vest.  I have to apologize for not being completely honest before.  Things are worse here than I let on.  Maybe this Christine can keep me happy and satisfied with my life, but whose to say?  Like I told you, some people are really losing it over here.  Might be I have to come visiting again some time.  More permanently.  Till then, glory and peace.  Or as you would say, Sincerely, Scott.</strong></p>\n\n<p>&nbsp;</p>\n\n<p>As I’m finishing writing this, I dread going back into that room.  I know I have no way of getting her back and I know I can’t have her blood being found in my apartment.  Even without hard evidence, there will be questions when she’s reported missing.  But all of that is in the background at the moment.  I can’t shake the feeling of being watched.  I look around and see no one, but then I notice the dingy brass door of the elevator across the hall from where I’m sitting.</p>\n\n<p>&nbsp;</p>\n\n<p>The reflection there is dark and distorted, but I can still see myself in it, or at least a version of myself.  It looks like me, but I can tell that it isn’t.  Because that version of me is laughing.</p>\n\n<p>&nbsp;</p>\n\n<p><a href=\"https://redd.it/8m7o9u\">Part Two</a></p>\n</div>\n","author":"Verastahl"}