{"rank":"19","title":"Settling my estranged uncle's estate","id":"8lxu4y","url":"/r/nosleep/comments/8lxu4y/settling_my_estranged_uncles_estate/","time":"1527210405000","body":"<div class=\"md\"><p>Couple weeks ago, I got my uncle&#39;s house. His whole estate, actually. I&#39;ve been here at a hotel for a few days just going through things.</p>\n\n<p>Friend of mine told me about those unclaimed property sites each state has, so I plugged in my info, saw I had something and requested the documentation.</p>\n\n<p>After a year, I got all this paperwork to settle my uncle&#39;s estate. I didn&#39;t know him well. In fact - him and my mom hadn&#39;t talked in several decades. I had vague memories of the home that was left to me, and memories of slowly seeing him less and less. My mom told me he was sick. As a child, I accepted this. Hard as it was - curiosity and all that - I just figured he didn&#39;t want to see me, and my kid brain rationalized it away. On I went.</p>\n\n<p>Going through his stuff sucks. Boxes and boxes of mostly... crap. Garbage. Tchochkes. Sometimes I load up a couple of boxes and haul them to the hotel to sort. It isn&#39;t too far, but the hotel told me I had to stop using their dumpsters. I&#39;ve decided to stay a few extra days while I get utilities turned on so I can stay at the house.</p>\n\n<p>The strangest thing I&#39;ve noticed so far is that he never seemed to use the ground floor or the upstairs. They&#39;re both covered top to bottom dust-covers and tarp.</p>\n\n<p>And the smell. All this time unoccupied, its <em>sterile</em>. Absolutely sterile. Like the kind of industrial grade stuff you&#39;d smell in a public restroom. There&#39;s absolutely no character to the air - no lived-in smell. No one&#39;s been up here for years. Many, many years, looks like.</p>\n\n<p>All of his life is crammed the basement. There are no corners. I mean, there are corners, but no angles. Where the walls and floor connect are all rounded out and curve in to the flat, cement floor. He must have lost a shit-ton a floor space doing it, but it looks nice. He has everything situated just so, and I imagine he never went upstairs at all. </p>\n\n<p>As you walk down the stairs (rounded off), you enter the main room with a small living room. There&#39;s a chair with a side-table, an old, boxy, giant projection TV, and a make-shift kitchen with a hot plate and igloo cooler, along the back wall with a tiny card table and folding chair. The floor&#39;s covered in rugs of various sizes and colors. He has a bed on the other end with a tall lamp.</p>\n\n<p>There&#39;s a small bathroom built off the main room with a shower head jutting out of the rounded ceiling and a drain at the bottom. There&#39;s also separate entrance to come in through the basement, again, rounded corners. Even the door and frame are sanded down to look like some sort of hobbit-hole. Everything, aside from dust, is squeaky clean and the smell, again, stings my nose with sterility.</p>\n\n<p>I did find this really odd little figure wrapped in yellowed paper next to the bed with, &quot;CIRCLES SAVE,&quot; written over and over. It&#39;s like pewter, but heavier. And it stinks like burned plastic. It&#39;s some sort of dog-looking tentacle... thing. It&#39;s difficult to describe. It&#39;s almost like a damn Dungeons and Dragons monster. It&#39;s covered in what I assume are claw marks and small pock marks in the metal. The bottom of the base says, &quot;Born above below, billows cold.&quot;</p>\n\n<p>I spent most of yesterday with a leaf-blower trying to tidy up the outside. It&#39;s backed up toward the woods at the end of an old cul-de-sac, so it&#39;s absolutely covered in leaves. I found these random piles of ash outside, but I assume they&#39;re either caught by the wind piling by the woods (from someone&#39;s chimney/fireplace/whatever) or something, but there was a lot of it.</p>\n\n<p>I think I need sleep. It&#39;s been a rough few days. Going through the few boxes upstairs, I felt like I kept seeing smoke in the corners of the room. Every time I turn to look, I hear these awful, deep clawing noises and don&#39;t see smoke, but there were marks - paint chipped up and gouges in the dry wall that weren&#39;t there when we did the initial inspection this morning. I&#39;ll have a roofer come out and take a look. Could be raccoons.</p>\n\n<p>My uncle was always a weird dude, and all I know of his life before he died is that he was a shut-in. I&#39;m going to try to reach out to some family that may know more. I&#39;m not even sure how he died - I was never given a death certificate, though I&#39;m sure I can file for or request one. I don&#39;t know much about this estate garbage, but it&#39;s a huge pain in my ass so far.</p>\n\n<p>Either way, I figured this would be an interesting way to sort of document stuff and give a bit of entertainment to Reddit at the same time. I&#39;ll let you guys know when I get the utilities on and set up in the house.</p>\n\n<p>As requested below, a <a href=\"https://imgur.com/a/Sd6q2qD\">poorly sketched diagram</a> of the basement.</p>\n</div>\n","author":"bornabovebelow"}