{"rank":"94","title":"My Neighbors Never Go Outside [Part 1]","id":"8lxwl1","url":"/r/nosleep/comments/8lxwl1/my_neighbors_never_go_outside_part_1/","time":"1527211059000","body":"<div class=\"md\"><p>Funny what you notice, when you’ve got as much free time as I do. I noticed absence of the moldy “For Sale” sign in the neighboring yard right away. They didn’t chain a “SOLD” announcement to the bottom. No, they ripped it right up out of the ground. They left a ragged, black hole in the grass where the post used to be. They were serious about it, it seems.</p>\n\n<p>I guess that’s been a couple years ago, now.</p>\n\n<p>Not long ago, it occurred to me that I never saw a moving truck, after that. I never saw a car in the driveway. I never saw the neighbors come outside. I saw them through the windows, though, only at night. Grey shadows dancing across the blinds.</p>\n\n<p>I wasn’t trying to be nosy. I wasn’t prying. I just noticed, that’s all.</p>\n\n<p>“I wonder what kind of lighting they got over there,” I said. I was raking dinner scraps into the garbage disposal and gazing out of the kitchen window. My husband, George, was sitting at the dinner table, picking his teeth.</p>\n\n<p>“Who?”</p>\n\n<p>“The neighbors. The light in the windows is bluish.”</p>\n\n<p>George squinted at the window. “Probably got a big screen,” he said, sinking back into his chair and examining something at the end of the toothpick. “We should get a big screen.”</p>\n\n<p>“Big screen in every room. Sure,” I said.</p>\n\n<p>“Why not?” George said.</p>\n\n<p>After that, I guess I did get a bit nosy. I mean, <em>who</em> doesn’t <em>ever</em> come out of their house like that?</p>\n\n<p>So, I started <em>really</em> watching. For at least a month now, I’ve kept a close eye on the place. Nothing. It made me uneasy. Nobody else in the neighborhood ever mentioned it, which made me feel a little crazy. Maybe I am, because I started thinking about going over there and knocking on the door. I’d introduce myself to my normal neighbors who must have a perfectly reasonable explanation for never showing their faces outdoors. Then, I could stop thinking about it. Then, I could stop peeking out of the windows.</p>\n\n<p>So, I did it. Yesterday afternoon, while George was at the office, I went over and knocked on the door. As I made my way up the front walk, I thought, <em>I wouldn’t have to ask where the bathroom is. This one’s just like Becky’s down the street. Cookie-cutters, they call them</em>. I knocked and straightened my skirt. I heard a mechanical hum just above me. I turned just as the little camera mounted under the eave focused in on me. Lots of people have security cameras. I don’t, but lots of people do. Sure. As George would say, “Why not?”</p>\n\n<p>I smiled and gave a little wave at the lens. The camera only stared until my smile faded. I cleared my throat and knocked again. I didn’t look at the camera, this time.</p>\n\n<p>If it wasn’t for that camera, I think I would have pressed my ear against the door. I could hear something in there. The murmur of many voices. <em>Maybe they do have a big screen in every room.</em></p>\n\n<p>Well, nobody answered, and I got tired of staring at the door. The camera whirred again as I turned to leave.</p>\n\n<p>Later that evening, I was slicing vegetables for dinner and frowning at the window looking out on the neighbor’s house, when somebody knocked on my door. I wiped my hands and ran on tiptoe to the front door.</p>\n\n<p>I peered through the peephole. <em>Jennifer</em>.</p>\n\n<p>I sighed and opened the door, “Hey, Jenny,” I said.</p>\n\n<p>“Just Jennifer, Mrs. B!” She always says that, but I can’t help abbreviating her name. Jennifer. It feels too old and clunky for her.</p>\n\n<p>“Hey, Mom said to ask if I could sit with you while she runs to the store!”</p>\n\n<p>I looked over her shoulder to see her aging mother waving from their yard. I smiled and nodded in her direction as I ushered Jennifer inside.</p>\n\n<p>She bounded down the hallway toward the kitchen.</p>\n\n<p>I love Jennifer, but I don’t think I’ll ever get used to seeing a grown woman move that way. The way her mother put it, her brain stopped growing at the age of ten but the rest of her didn’t have any trouble.</p>\n\n<p>“You’re cooking!” she sang as she went.</p>\n\n<p>“Yep! Just getting started. How did you know that?” I called after her.</p>\n\n<p>“Just did,” she said as I slipped through the kitchen door. I believe it. The girl is spooky sometimes.</p>\n\n<p>“So, while I’m cooking, would you like to play a game on my phone?”</p>\n\n<p>“Heck, yeah!” She beamed, clapping her hands.</p>\n\n<p>“Okay,” I said, as I unlocked the screen, “I just found this new one I think you’ll like…”</p>\n\n<p>Then, I noticed that her gaze had wandered to the window looking out at the neighbor’s house. Her jaw went slack. She rubbed the back of her neck, her patent nervous gesture.</p>\n\n<p>“Mrs. B,” she said, frowning, “Did you go see the neighbors? <em>Those</em> neighbors.”</p>\n\n<p>“Well… I…”</p>\n\n<p>“Mrs. B don’t do that anymore!” She whispered, face inches from mine, eyes wide. “They’re <em>bad</em>.”</p>\n\n<p>“Why do you say that, honey?”</p>\n\n<p>“Promise you won’t!”</p>\n\n<p>“Okay, I promise… but why do you think the neighbors are bad?”</p>\n\n<p>She frowned and shook her head rapidly back and forth. Sometimes, when she couldn’t muster the vocabulary to say the thing she desperately wanted to say, she got frustrated. I felt bad. I shouldn’t have asked her like that. She doesn’t know how she knows. She just knows. I put my arm around her shoulder and drew her to me. “Sshh, now. It’s okay.”</p>\n\n<p>She hugged me fiercely while I whispered assurances. Then, it was like it never happened, for Jenny, at least.</p>\n\n<p>It was still on my mind, long after she left. I pushed my dinner around on my plate, while George shoveled his into his mouth.</p>\n\n<p>“Do anything special today?” he asked between mouthfuls.</p>\n\n<p>I forced my eyes away from the window. “Nope. Just, you know, the usual. Jenny came over.”</p>\n\n<p>“Just Jennifer,” George said.</p>\n\n<p>“I know.” I debated telling him what Jennifer said about the neighbors but decided against it. He’d scold me for being nosy.</p>\n\n<p>Later, I laid awake listening to George snore. Jenny’s voice echoed in my head.</p>\n\n<p><em>They’re bad.</em></p>\n\n<p><em>Promise you won’t!</em></p>\n\n<p>The clock on my nightstand read 2:24 when I slowly swung my legs out of bed a tip-toed to the front door. My bare feet were slick with dew as I climbed the steps to the neighbor&#39;s front porch.</p>\n\n<p>The camera whirred and whined as its glass eye focused on me, again. The windows were lit with that eerie, blue light.</p>\n\n<p>I looked over my shoulders at the dead, silent street. I raised my hand to knock, then dropped it, again. I could hear it, the same incessant chorus of whispers.</p>\n\n<p><em>They’re bad.</em></p>\n\n<p><em>Promise!</em></p>\n\n<p>I jumped the steps and ran through the wet grass back to my house. Back to safety.</p>\n\n<p>Back in bed, as my heart rate slowed to normal, I felt silly. They’re just people. I got spooked because of the quiet and the dark. That’s all. Those whispering voices sound creepy at night... but it&#39;s probably just the television.</p>\n\n<p>I think that I’ll pay another visit tomorrow, while George is at work.</p>\n\n<p>They can’t ignore me forever.</p>\n\n<p><a href=\"https://www.reddit.com/r/nosleep/comments/8m7198/my_neighbors_never_go_outside_part_2/\">[ Part 2 ]</a></p>\n</div>\n","author":"lazykill"}