{"rank":"69","title":"Wrong Number Stalker","id":"8lxy4o","url":"/r/nosleep/comments/8lxy4o/wrong_number_stalker/","time":"1527211462000","body":"<div class=\"md\"><p>Let me preface this with a few important details. I’m a 27 year old woman. I live alone, in an old trailer from the 70s in the middle of nowhere, surrounded by corn, cows, and little else. I don’t have a lot of close friends that I’m in constant contact with and my family lives fairly far away.</p>\n\n<p>Last week, I received a call from a number I don’t have saved in my phone. I thought it was weird, but I answered, thinking it was probably a telemarketer. I know so many people who are angry that telemarketers can call cell phones now, but I don’t mind. Everyone has to make money somehow. So, I answer, and this guy goes, “You called?” </p>\n\n<p>“Oh, sorry honey, you have the wrong number.” The only people I call are my parents. Everyone else gets a text message. I knew I hadn’t called him. No big, though. </p>\n\n<p>He laughed. “Okay, sorry you called.” Then he hung up. </p>\n\n<p>I pulled away from my phone and frown at it. That was rude, and I had been nice. There isn’t any embarrassment in misdialing. Whatever, I shrugged it off. I had better things to do, like get back to watching Bob’s Burgers. </p>\n\n<p>The event is gone from my mind the next day. Honestly, who would even linger on a rude miss caller. I had deleted the number from my call history, so I couldn’t accidently click it at some point, and went on about my life.</p>\n\n<p>I got a restricted call. It’s breakfast and I’m scrolling through my favorite site on my phone while munching on some fruity pebbles. That’s weird, especially considering the wrong number I received the day before. I ignore, of course. If you aren’t brave enough to show me how to contact you, I don’t need to give you any of my time. There is no reason for restricting your number. </p>\n\n<p>Later that day, I go to work. I work at a movie theater. I know, exciting, right? It’s easy money though, especially in the summer where I can get overtime. I live in a small town, and the teenagers the owner hires call out all the time to go out with friends. </p>\n\n<p>Once I’m out from my shift, at around 1 a.m., and safely in my car, I look back at my phone. I have seven more missed restricted phone calls. </p>\n\n<p>The hair on the back of my neck stands up. Why am I suddenly getting so many of these? Is that guy angry because I said he had the wrong number? At that point, I don’t believe that, but I also don’t know what else it could be. I am such a homebody that I can’t remember the last time I even made someone angry. </p>\n\n<p>I look around the parking lot. My coworkers are all doing their own thing. Craig is starting his car, Brad is smoking a cigarette, and Windy pealed out before I ever picked up my phone. With a thick swallow, I turned my car on and went on my way. </p>\n\n<p>I’m home now, and feeling a little paranoid. What could be going on? Can I go to the police? Should I? </p>\n\n<p>I think I’ll answer the next restricted call I get. </p>\n</div>\n","author":"fallen-starr"}