{"rank":"16","title":"There's Something in the Woods","id":"8lxzte","url":"/r/nosleep/comments/8lxzte/theres_something_in_the_woods/","time":"1527211926000","body":"<div class=\"md\"><p>I&#39;ve always been a nature person. I&#39;m the kind of guy that goes on hikes for fun. As a kid, I had a huge forest behind my house that I explored nearly every day. Unfortunately, I&#39;ve not had the chance to be close to nature in a long time. I moved to the city to be closer to my job, and I hadn&#39;t really been back in a while.</p>\n\n<p>About a month ago, a friend of mine from school told me he was selling his house in upstate New York. It sat on a huge piece of land, with a giant forest taking up most of the space. You could imagine my excitement when he decided to sell it to me for way cheaper than it was worth. I worked from home anyway, so there was almost nothing keeping me from up and moving to the house. I think I was living there within a week of buying it if I remember correctly.</p>\n\n<p>The main thing I was excited for was the forest.  I could explore the woods like I did when I was a kid, I could really rekindle my relationship with nature that I had lost by moving to the city. I had barely put any furniture in place when I had suited up for the first hike in my new woods. My buddy hadn&#39;t told me much about the forest other than the size, so I didn&#39;t know what to expect.</p>\n\n<p>The woods were huge, and they surrounded my house in a semicircle. They towered over everything, almost like dark green giants blocking the sky from view. There was a faint outline of a path, so I just decided to see where the path took me. I&#39;d say I walked a solid 10 minutes into the path before things started to get interesting.</p>\n\n<p>I&#39;d like to consider myself a pretty brave person. You kind of have to be if you enjoy nature as much as I do. Just keep that in mind as you read what I&#39;m about to type. It was about mid day when this happened, but it looked like it was much later because of the trees. I heard something, a stick snapping. Like something had stepped on it.</p>\n\n<p>I brushed it off. It was probably just an animal. I kept walking for another minute or 2 when I heard it again. This time it was more pronounced, almost like I could here the ball of the foot roll off the twig. Then again within the minute. The snaps got closer to each other, all around me. Footsteps got mixed in, surrounding me. Something was circling me.</p>\n\n<p>Forget about how brave I was or was not, I was terrified. I checked my feet and they were still on the path. Good. The last thing I wanted was to get list in the woods with that thing. I decided it was probably a good idea to head back. It was getting late and my imagination was taking over my reality. The footsteps were gone, so I just figured it was a coyote, which were common in the area.</p>\n\n<p>Fast forward about 5 minutes. It&#39;s getting pretty dark, so I use my flashlight. I&#39;ve completely forgotten about the footsteps from earlier. Until I start hearing them again. Just small ones. I look around with my flashlight, and I see nothing. I recentered my flashlight on the path, and I see it.</p>\n\n<p>This thing. It was weird, and stretchy. Almost humanoid in nature. It looked like it was wearing a tan morph suit that was a little too big. It had a small face with odd squinty eyes that I&#39;m still not sure how it could see out of. It was crawling on all fours, which just added to it&#39;s odd nature. It stopped moving as soon as my light touched it. There was a brief pause, and then it sprinted at me.</p>\n\n<p>I dropped my flashlight and ran. It let out an unforgettable scream that sends chills down my spine just thinking about it. I just ran blindly, the only sounds being my breathing and the footsteps and screeches of that thing. I got really dizzy, like the ground was spinning. I tried to keep myself upright because I know if I fell it would catch me.</p>\n\n<p>I think I blacked out for a while while running because I don&#39;t remember how I got home. I just remember the thick darkness blanketing me and the thoughts of those weird squinty eyes keeping me running. I eventually found my way home, and this is where the memories start coming back.</p>\n\n<p>I remember running towards my glass sliding door in the back, ripping it open and slamming it shut behind me. The thing was directly on the other side of the door. I could finally get a good look at it. It seemed to be leaking a thick yellow substance out of creases in it&#39;s body. It was smart, it knew there was a glass door between it and myself. It sat there, watching me with the intent if killing me. I just knew it would. </p>\n\n<p>That was two days ago. I&#39;m writing this on the computer in my bedroom. I haven&#39;t left my house since it happened. I know it&#39;s watching me, through windows and the back door. I know if I leave the house it will kill me, or worse. I don&#39;t know what to do. There&#39;s only so much food in the house. I&#39;m terrified.</p>\n</div>\n","author":"NoSleeper124"}