{"rank":"8","title":"YOUR CONNECTION HAS BEEN DROPPED","id":"8ly0ko","url":"/r/nosleep/comments/8ly0ko/your_connection_has_been_dropped/","time":"1527212139000","body":"<div class=\"md\"><p><em>Ring ring</em> Maya is calling.</p>\n\n<p>The blue screen flashed across my laptop as the familiar melodic, beeping tune emanated  from the speakers and brought a warm smile across my face. Maya and I have been in a long distance relationship for a little over five years now and have spoken to each other for  nearly every single day of them, so much so that the little persistent ringing of her call like ASMR fills me with calm and happiness just by the association. Maya and I have struggled in the past couple of years to turn our relationship into something real and tangible, not that I minded the distance, but it&#39;s so much better when we&#39;re actually there together in the same room and I&#39;m holding her in my arms.  It&#39;s been a bit of a hassle since she practically lives half way across the globe, and between our jobs and her studies we only ever got to visit each other once every blue moon, but all that was about to change. Finally all our hard work was about to pay off, and our lives would never be the same again.</p>\n\n<p>&quot;Hey babe!&quot; I gleamed as Maya&#39;s gorgeous face came into view of the camera.</p>\n\n<p>&quot;Hi baby,&quot; Maya squealed. &quot;Oh my god, I&#39;m so fucking excited! Has yours come in yet? Please tell me it&#39;s there?&quot; She jumped up and down excitedly, barely able to contain herself. </p>\n\n<p>&quot;Hmm, I don&#39;t know has it?&quot; I smirked, teasing her.</p>\n\n<p>&quot;Come on babe! I&#39;m dying over here!&quot; Maya protested, pouting her lips and looking at me in that irresistibly cute puppy-eyed way that always broke me.</p>\n\n<p>&quot;Alright, alright&quot; I laughed, panning my camera to the large, clunky metal arch sitting clumsily in the back of my room. &quot;Ta-da!&quot; I exclaimed, mustering as much enthusiasm as I could.</p>\n\n<p>&quot;Oh my god, yes!&quot; Maya cheered excitedly. &quot;I can&#39;t wait to turn them on and try it!&quot;</p>\n\n<p>I examined the machine up and down, trying to figure out where all the strange wires would go. </p>\n\n<p>&quot;Let&#39;s not get too excited yet honey, we got to test them first.&quot; I argued, trying to reason with her despite the overwhelming giddiness I was doing the best to hide myself as I worked out the cables and switched on the arch. &quot;Alright, turn yours on and let&#39;s see if we can get them to sync.&quot;</p>\n\n<p>&quot;Do you think they&#39;ll work? I&#39;m so nervous!&quot; Maya said as she anxiously switched the lever on, bright lights flashing as the two arcs begun buzzing in unison.</p>\n\n<p>&quot;They damn well better,&quot; I scowled. &quot;This thing cost twice as much as my car, you know?&quot; </p>\n\n<p>&quot;I know baby, and I&#39;m so happy we did this, it&#39;s all going to be worth it, I promise!&quot; Maya cheered excitedly, awaiting the two arcs to sync. &quot;Just imagine it babe, no more having to worry about whether we&#39;ll be able to see each other or not, or fussing over time and planning out trips. We&#39;ll be able to be with each other whenever we want!&quot; </p>\n\n<p>I couldn&#39;t stay too mad, I smiled widely at the prospect of finally tearing down the barrier between us, yet still something was off. </p>\n\n<p>&quot;I know baby, I can&#39;t wait too, its just,&quot; I hesitated a second. &quot;I don&#39;t think anyone has tried syncing these things from this far before. I mean even if they did work, is that even legal? I can&#39;t imagine customs would be too happy about it.&quot; </p>\n\n<p>Maya frowned slightly, I could tell my pessimism was starting to rub off on her. As nervous as I was for what we were about to do, I couldn&#39;t bare seeing her so upset. </p>\n\n<p>&quot;Awh honey, no don&#39;t be sad, I&#39;m sure it&#39;s fine. You know what? Let&#39;s do this!&quot; I exclaimed as I entered in the codes to Maya&#39;s arch and awaited the result with overwhelming anticipation.</p>\n\n<p>&quot;Yay! This is going to be amazing, I just know it!&quot; Maya shouted excitedly. </p>\n\n<p>Just then a bright flash engulfed the entire room as a picture started to form inside the arch, I stood there mouth hanging open in disbelief as I began to see my Maya waiting for me on the other side. </p>\n\n<p>&quot;Hello? Maya can you see me?&quot; I waved excitedly, grinning from ear to ear and still in shock.</p>\n\n<p>&quot;Oh my god, it worked! It worked!&quot; Maya waved ecstatically, jumping up and down as she moved closer to the Arch.</p>\n\n<p>&quot;Maya no, wait!&quot; I shouted anxiously, just stopping her short of stepping through. &quot;The test remember?&quot;</p>\n\n<p>&quot;Oh right, come on then!&quot; Maya pouted, standing anxiously as I produced a ball from my pocket and motioned for her to catch it as I carefully tossed it into the arch, and just like that in an instant the same ball appeared through the other side of the portal as Maya caught it gleefully in her hands. &quot;Woohoo! Look it&#39;s all fine!&quot; </p>\n\n<p>I smiled joyfully as I gazed deep into Maya&#39;s soft blue eyes through the crystal clear arch and stepped back slowly. </p>\n\n<p>&quot;Alright baby, I&#39;m ready when you are!&quot;</p>\n\n<p>&quot;I love you&quot; she said as she disappeared through the portal. I awaited Maya&#39;s warm and loving embrace as I stood there, body shaking nervously. Seconds passed and still there was no sign of Maya, a deep burning feeling of dread began to form in the pit of my stomach as seconds turned to minutes.</p>\n\n<p>&quot;Maya?! Oh god, Maya?!&quot; I began to break into panic as I called for her, desperately trying to fiddle with the arch to get some kind of reaction. Tears running down my face and hyperventilating as I tried to look for her through the camera, but was only greeted only by the silence of her now empty room. The buzzing emanating from the arch slowly began to die as the lights dimmed and shut off. </p>\n\n<p><em>SORRY, YOUR CONNECTION HAS BEEN DROPPED. PLEASE TRY AGAIN LATER</em></p>\n\n<p>&quot;MAYA!&quot; I sobbed, angrily slamming my fists against the arch. &quot;Please.&quot;</p>\n\n<hr/>\n\n<p>THREE MONTHS LATER.</p>\n\n<p>There&#39;s been a massive void in my life ever since the accident. Nothing has been the same without Maya, I try to go on but it only feels like I&#39;m going through the motions. I&#39;ll often go online and see Maya&#39;s picture halfway way expecting it to light up any moment with her messaging me letting me know she&#39;s okay. She&#39;ll tell me how her day went at her boring class, and I&#39;ll tell her about some stupid client at work... God I miss her. I need to find her. Wherever Maya is, maybe if I try stepping through the arc myself.. Maybe I&#39;ll find her. Well, I guess there&#39;s only one way to find out. </p>\n</div>\n","author":"KnightTerror1229"}