{"rank":"7","title":"The Procedure - The Announcement","id":"8ly29a","url":"/r/nosleep/comments/8ly29a/the_procedure_the_announcement/","time":"1527212603000","body":"<div class=\"md\"><p>The first announcement was met with skepticism; perfectly understandable considering its impossible promises:</p>\n\n<p><em>Introducing NuYu, a revolutionary new procedure! Troubled by depression, anxiety, schizophrenia? Want to rid yourself of laziness, shyness, or stupidity? NuYu promises that with one treatment you&#39;ll be a brand new person, free of all the flaws that hold you back from being the best you that you can be! Only available at The Asher Clinic, call today to schedule your appointment!</em></p>\n\n<p>“No way. No fuckin&#39; way one measly therapy session&#39;s gonna fix all that.” Ally snorted derisively, taking a long drag on her Marlboro and tossing the wrinkled flyer at my feet. She leaned back with her arm slung over the back of the kitchen chair and stared at me, as though daring me to disagree. She wasn&#39;t alone in her outright dismissal; the moment major news outlets got wind of it and alerted the public, NuYu and The Asher Clinic became the concern of every mental health professional and the butt of every late night talk show sketch. “Who do these people think they are and how dumb do they think we are??” was a common topic on first dates and lunch breaks.</p>\n\n<p>I shrugged and picked up the flyer, setting it on the counter with a mental note to add it to the currently overflowing trash can once I&#39;d taken the bag out. “Well, I&#39;m sure NuYu has some benefits, but they&#39;re probably overselling it a bit. Someone will try it, be disappointed, and that&#39;ll be the end of it. Unrelated to that though, ummm...would you have time to help me clean up the apartment this weekend? The landlord&#39;s coming by for a quick inspection on Monday and I kinda wanna leave him with a decent impression of us.”</p>\n\n<p>“Fuck that. I got plans and busting my ass here for free ain&#39;t one of &#39;em. Maybe if you brought it up sooner I coulda helped, but only a week&#39;s notice just ain&#39;t enough.” Ally got up quickly and grabbed her purse. “Besides, who cares what that prick thinks? Not like we got rats or anything, and our rent&#39;s always on time.” <em>My rent, you mean.</em> The thought flared quickly, along with thoughts of just what a bitch Ally&#39;s always been, how I&#39;ve put up with her bullshit for 15 goddamn years, and she can&#39;t even be assed to push the vacuum around the place for 20 minutes to help out. And like all the other thoughts of their ilk, it died down just as fast. “Oh, okay, no big deal. It&#39;s really not much anyway, I shouldn&#39;t have bothered you with it.” She didn&#39;t even respond; she was already halfway out the door and on the phone with whatever guy was her flavor of the week – Peter, I think.</p>\n\n<p>As I said, I fully expected the fervor over NuYu to die down pretty quickly, and put it completely out of my mind. That is, until Ally strolled in a week later while I was struggling to move the stone coffee table she just had to have, even though it cost me two weeks&#39; pay and she was rarely home to even use it.</p>\n\n<p>“Lee! You&#39;re going to throw out your back again, let me help you!” The fact that she&#39;d spoken before I&#39;d even noticed her was far less startling than what sounded like a genuine offer of assistance. “Uhhh, it&#39;s fine really, I think I almost got it.” “No, no, no,” she clucked, grabbing the opposite end. “This is our place, and it&#39;s time I started pulling my weight. So let me know what else you need me to do, and I&#39;m on it!” Her face lit up like I&#39;d never seen before, almost beatific in her sudden willingness. Together, we got the table moved, the carpet vacuumed, the dishes cleaned and put away, and all the mail sorted before taking a break over coffee.</p>\n\n<p>“Oh my god Lee, it&#39;s all true! NuYu is a miracle, and it saved me. I had no idea what a horrible person I was until after the procedure...it was like all the bitchiness and selfishness was years of filth on my soul, and NuYu took the stain right off and made it shine.” She grabbed my free hand, my other hand held the mug that stopped halfway to my mouth in dumbfounded shock. “You did it? You actually went to Asher and did NuYu? Didn&#39;t you think it was a scam?” She smiled, that wondrous light again poured from her eyes. “I did. But I swear, it was fate. I don&#39;t even remember how I got there or what made me decide to go in, but I did. And it was the best decision I ever made, although that&#39;s not a real high bar.” Ally chuckled softly. “Lee, I&#39;m so, so sorry. After the procedure I realized just how badly I&#39;ve treated you. You&#39;ve stuck by me for 15 years now, and lord knows I don&#39;t deserve a friend even half as good as you. And now that I&#39;m a better person, I want to help you be better too...you can&#39;t keep letting people walk all over you and then thank them for it, it&#39;s just not right.”</p>\n\n<p>She was absolutely right. I&#39;d been a doormat my whole life – meek as a churchmouse, never wanting to rock the boat, always willing to concede just to avoid conflict. I knew what I was, I hated it, but I couldn&#39;t fix it. And there was always someone ready to take advantage, and I welcomed each and every worthless scumbag into my life with open arms. I let myself be broken over and over again, and always ended up alone and put back together just enough to get broken again.</p>\n\n<p>Maybe I could fix it though. Ally was proof that I could also be wiped cleaned, and I could be strong, confident, and happy like I always dreamed. Still, the very idea of being someone new, even if it meant being better, made me a little nervous. “Did it hurt?” “Nah. To be honest, all I really remember was the doctor putting this kinda helmet thing on me, then I drifted off to sleep. I woke up a few hours later feeling like a million bucks and ready to make up for all the bad things I&#39;d done to everyone being the way I was before. So sort of like AA, but you know, it works.” We laughed to tears at that one, good to see Ally kept that wit I&#39;d always loved. She leaned in, her voice dropping to a whisper, “They kill it, but it doesn&#39;t hurt you.” Her eyes went soft and blurry, and her new soul flickered like a dying light bulb swinging from the ceiling of a horror movie basement. Her grip on my hand tightened suddenly. “They have to kill it, you can&#39;t be perfect with even a trace of the old you still in there. So they kill it and you watch that fucking cunt bleed out and beg for her life, and when her brains are splattered on the walls and her skull is in pieces on the floor you can be happy. <em>You will be perfect and you will be happy</em>.” “What? Ally, are you okay? What the hell are you talking about?”</p>\n\n<p>Ally&#39;s eyes came sharply back into focus. “Huh? I was just saying that the procedure works. Sorry, I thought the AA thing was funny.” The beatific smile returned, and she got up to rinse her mug. “Well, I gotta get to work. Please consider what I said Lee, I really think you should look into getting the procedure. I feel amazing and I want you to feel this way too.” She gave me what I think was the first sincere hug in the entire time I&#39;d known her and headed out.</p>\n</div>\n","author":"elhiyacho"}