{"rank":"438","title":"A random woman knew my child’s name.","id":"8ly4uy","url":"/r/nosleep/comments/8ly4uy/a_random_woman_knew_my_childs_name/","time":"1527213334000","body":"<div class=\"md\"><p>I was at the store a few days ago waiting in line to checkout. I have a 18 month old who is very vocal and tends to grab the attention of anyone around her. As I was ringing up my stuff, she was talking up a storm, pointing to this and that as usual. </p>\n\n<p>The cashier gave her a kind smile and asked how old she was, I told her 18 months. She was holding a ball she insisted on having (and I couldn’t refuse buying it for her) and the cashier said “she’s so cute”. I thanked her and continued putting my stuff on the belt. </p>\n\n<p>As I’m finishing up, a woman walks up with her cart and begins putting her stuff up. She looks to be about 65, gray hair and glasses. My daughter is still talking away, making herself known. The woman looks at her and says “well isn’t she a doll baby?” I reply thank you, while my daughter let’s out a screech so loud that my immediate reaction is to go over to her and say “that’s not nice!” </p>\n\n<p>The woman chuckles and says “yes Madelyn, that’s really not nice.” My heart dropped into my stomach. I had not said her name at all while being in line, and come to think of it, I might’ve said it once in an aisle we were in, but that was it. How did she know my kids name? Part of me wanted to ask, but the other part of me just wanted to get the hell out of there. </p>\n\n<p>I paid the cashier and put my bags in the cart. I wished the cashier a good day and began to walk away. The woman gave a huge smile and waved, “bye bye Madelyn”. I shot her a weird look and walked as fast as I could to my car. After getting her in the car seat and loading the bags, I got in my car and sat for a second. </p>\n\n<p>I didn’t have a good feeling. I tried to think if I had said her name without noticing, and maybe the woman was close by and heard me. But my gut knew I hadn’t. I felt scared for the both of us. Just as I was starting my car, there she was. Standing about 5 or 6 feet from my car, staring, smiling, and waving at me. </p>\n\n<p>I pressed on the gas so fast and peeled out of the parking lot. I sped home and told my husband all about it. Of course his response had been “Maybe she heard you say it in the aisle and you didn’t notice her. I wouldn’t worry too much about it.” But I still had an uneasy feeling. </p>\n\n<p>Fast forward a few weeks; I had pretty much forgotten about the strange woman and I hadn’t returned to that particular store either. It was a random morning at work (I work as a receptionist at an eye doctor) when I was busy filing papers and doing a couple other things. The other receptionist had ran to the bathroom and my back had been turned to the desk. </p>\n\n<p>“Excuse me, maam?” I heard and turned around. “I have a 930 appointment.” I nearly froze. It was the woman. I didn’t know what to say. I just stood there. She had never been here before. Ever. I would’ve remembered. “Are you going to help me?” She asked as I stood there, not knowing what to do or say. </p>\n\n<p>The other receptionist walked up and asked if I was okay. The woman turned to her and said “I told her I have a 930 appointment but she’s just been staring at me.” “You’re the woman from the supermarket a few weeks ago. You knew my child’s name. And you stared at me in the parking lot.” She gave me a confused look. “I’m so sorry dear, you must be thinking of someone else.” </p>\n\n<p>I shook my head. “I wouldn’t forget someone that did that. Now tell me, how did you know my child’s name? I didn’t tell you, and I didn’t say her name either.” “I’m not sure what you’re talking about, that was not me.” She replied. The other receptionist but in - “Katie... she says it wasn’t her. And I really don’t think this is the place to do this.” “Rebecca, she knew Madelyn’s name without anyone telling her. That’s creepy. And it’s even creepier to stare and wave at me after the fact. Now i want to know how you knew my daughters name.” </p>\n\n<p>Rebecca could tell I was becoming agitated. “Let me go get Gina (the supervisor)” I stood there, waiting for the old woman to respond. “You know dear, you’re really being incredibly rude. Just as rude as you were being when you wouldn’t wave back to me in the parking lot. I didn’t appreciate that.” My stomach was in knots. “Are you fucking kidding me?!” I was practically yelling. “This is crazy. I’m going to the police.” </p>\n\n<p>I began to gather my stuff up. She looked me dead in the eyes “Do as you please. But when you get home, please tell little Madelyn I said hello. I’m sure she’s playing with her stuffed elephant right now.” She said, chuckling. I was contemplating lunging at her when Rebecca walked back up with Gina. </p>\n\n<p>“What’s the problem here?” Gina asked. I explained to her everything the woman had just said, and that I was going to go to the police. “I assure you none of that happened, I don’t know this woman. Im simply here for my eye appointment with Dr. Kurnick.” </p>\n\n<p>I couldn’t stand there any longer, I had to get to the police. And before that I was going to pick Madelyn up from my mom, to ensure she was safe. I didn’t know what this woman was capable of. Apparently she’d been spying on me and my child. “I’m going to the police and I’m going to tell them everything you said and tell them you’ve been on my property spying on me and my child, you sicko.” </p>\n\n<p>Gina had the most confused look on her face. “Let me take you back ma’am, and Katie - I’ll call you later.” I didn’t bother to respond. As I was walking out the door, I saw the woman turn her head and smile at me. </p>\n\n<p>I hopped in my car and immediately called my husband who was at work, but he didn’t respond. I sped to my moms house and picked up Madelyn hastily. She kept questioning what was going on, but I told her I didn’t have time and would call her later. </p>\n\n<p>I went to the police station and told them what happened. I told them they could contact the eye doctor to obtain her information, and that I was sure this woman was a threat to me and my family. They wrote everything down. The cop shook my hand and said, “We’ll look into it the best we can. We can’t charge her with anything unless we have evidence. In the meantime, keep your doors locked and keep a close watch on your daughter.” I intended to. </p>\n\n<p>A couple days later, I got a call from the detective. He told me they had questioned the woman and she assured them none of that had ever happened. She pretty much had tried to make me look like the crazy one. He told me to give him a call if anything else happened. But I still didn’t feel safe. </p>\n\n<p>My husband and I had planned to stay at my moms house for the next few days, simply because we didn’t feel safe. I had locked every door and window, but still went to bed uneasy that night. Around 2 AM, I woke up to a noise coming from my baby monitor. I immediately shot up. Madelyn was laying there fast asleep. I convinced myself I was being paranoid. </p>\n\n<p>Then I heard the noise again. I was staring at the monitor. It sounded like a shuffling or rummaging noise. I saw a flash of something move in the corner of the screen. I immediately grabbed my husbands arm and shook him. “Wake up! I think there is someone in Madelyn’s room!” He shot out of bed, grabbed his gun from the drawer, and we went running to her room. I flung the door open and there she was. </p>\n\n<p>She was standing over her crib. Madelyn had started to wake up. “You crazy bitch. Step away from my child right now. Or I’ll shoot you.” She grinned that awful smile, “I just wanted to watch her sleep. She is so peaceful when she sleeps, isn’t she? All curled up, dreaming away. Not a care in the world.” I began to cry. “You fucking psycho! I ran over to Madelyn, as I was about to grab her the woman jumped on top of me. I screamed for my husband. Madelyn woke up and began to cry. </p>\n\n<p>I was scratching, hitting, doing anything I could to get this sicko off of me. My husband grabbed the woman by her hair and threw her to the side. I grabbed Madelyn and ran like hell. She was screaming and crying and all I could think was “get her out of the house immediately.” I ran outside screaming for help, while holding Madelyn close to me, shaking in fear. </p>\n\n<p>I was about to run to the neighbors house when I heard a gunshot. My stomach dropped and I screamed. I prayed to god he had shot her and it wasn’t the other way around. Then I heard “Katie, call the police.” It was him. I ran to him and immediately began to cry. He was okay. And there she was. Laying on my daughters bedroom floor. </p>\n\n<p>The police arrived 15 minutes later. It seemed like an eternity after they had finished questioning us and writing everything down. I took Madelyn to my moms house, I could barely even think straight. Sometime around 6 AM, my husband showed up. We were both so shook we didn’t know what to say or do. </p>\n\n<p>The police searched the woman’s house. They found pictures of Madelyn that had been stolen from our home, which means that her visit to our house wasn’t the first one. She had a notebook with our address, Madelyn’s full name, and a description of her. They believe she had been spying on us a while. She had figured out when we weren’t home, and made her way in somehow. She had clearly been planning to kidnap my child. </p>\n\n<p>It sickens me to think this woman was in my home and I had never known. And that she had watched my child play and had been sick enough to approach us in public. Some people are truly sick and it is awful that we have to raise children in a world where people like that exist. Keep a close eye on your children and never ever ever trust anyone. </p>\n</div>\n","author":"babyking1"}