{"rank":"32","title":"Nothing Good Happens After Two AM","id":"8ly51q","url":"/r/nosleep/comments/8ly51q/nothing_good_happens_after_two_am/","time":"1527213386000","body":"<div class=\"md\"><p>The worst part about college was walking home on a Saturday night while sober. </p>\n\n<p>If you were home before two, you were guaranteed to catch the bar crowd. That time of night could have been a zombified pep rally with all the frat boys and girls chasing down a friend to fuck. No, two was safe.</p>\n\n<p>But two-thirty?</p>\n\n<p>Three?</p>\n\n<p>Four is where I found myself on the night in question. At four AM there&#39;s nothing but you and the wind in the trees. That&#39;s what my mom used to tell me.</p>\n\n<p>I went to a state school, a moderate one in the Northeast US, located in a small town consistently comprised of school employees and attendees. The quietness of the town was the college&#39;s biggest appeal. The campus sat in a valley a couple miles wide, nestled and enclosed like so many others in the shadow of the Appalachians. With all the room for housing and the dwindling attendance rates, upper class-men were even granted their own house on campus. I loved it.</p>\n\n<p>It was October, and though it was a bit out of character it had snowed earlier in the day. A squall, they called it. I remember thinking how strange it was to be in a tee shirt and still see small patches of it sitting outside the windows of the closed convenience stores. </p>\n\n<p>The reason I was going home late was nothing exciting. Calculus. It had become an even more immense nightmare than the quiet campus. A failing grade the previous semester had kept me back in credits, and bombing another test was not an option. So I was in the library, in a corner all huddled to myself, working on practice quizzes for hours before I finally got a good look at the clock. When I did, I waved goodbye to the regulars, threw my books in the bag and darted for the door.</p>\n\n<p>There had been stories. There always were, in small towns like mine. Years ago a kid had been murdered on campus in the middle of the night, and when all the students woke up and walked to class they found his body strung up in the quad like a pinata. As it always goes, they never caught the guy or girl who did it.</p>\n\n<p>I didn&#39;t know the whole story at the time, but I remembered writing it off as local yokel bullshit. That was a mistake.</p>\n\n<p>The walk was only a mile or so and it was covered by a gravel road next to an open field. Beyond the field was the woods. The lighting was actually great, when it was working. But every two or three months some bulbs would die, and it would take another month of complaining to get them fixed. That turnover rate left a lot to be desired.</p>\n\n<p>I could lie to you and say I was worried when I started walking. That the late hour or the missing streetlights bothered me, or that I was terrified by the absence of any sound other than the wind in the leaf-less trees. </p>\n\n<p>But I wasn&#39;t. I was annoyed. Annoyed by the fact that it was late and that I might oversleep the exam tomorrow.</p>\n\n<p>So that being said, I was totally unprepared for what happened next.</p>\n\n<p>I was about halfway home, in a slow jog already as I started to calculate how many hours before I was completely fucked by math. There was a dump-truck backed onto the sidewalk at one point, and I cursed out loud when I had to go around it.</p>\n\n<p>When my voice broke the night, it was like something in the trees shook from its sleep. I was just a few feet away when I saw green eyes light up from just inside the treeline. As soon as the eyes popped, they started to move forward.</p>\n\n<p>My first thought was bear or wolf, so I booked it. Down the road, past the convenience store, and five hundred feet away before I even bothered to turn around to look. </p>\n\n<p>When I did, the shape of the creature had exited the treeline and was pursuing me. It was on all fours, standing at what I guessed to be four feet off the ground.</p>\n\n<p>I stared at it for a while, watched as it came to a stop about two hundred feet away. It was covered in fur, that was clear. There were long elaborate horns at the top of it&#39;s head, and it was massive. Bigger than animal I had ever seen. But it had to be an animal of some kind, I was sure of that. Just couldn&#39;t figure out what.</p>\n\n<p>It was taller than a wolf, smaller than a bear. Nothing like a deer, and yet there was something so human about the way it moved. It shuffled those legs left to right when it ran, like some of it&#39;s feet were bigger than the others.</p>\n\n<p>My suspicion was confirmed when it came to a stop in front of a dead streetlight, stood on it&#39;s hind legs, and stared right back. </p>\n\n<p>The shriek the creature let out was mind numbing. Earth shattering even. It was crazy to me that every single person on campus did not turn their lights on and come outside. But no one did. After the ten seconds, the night returned to what it was. Silent except for the wind in the trees.</p>\n\n<p>Then the creature started to move forwards, towards me. It was still on it&#39;s hind legs, and how it walked suggested it was a bit unsure about that. Like a bear trying to keep its balance. I still could not see well, but I knew it had hooves because they kicked and clacked at the old gravel of the path. I was entranced by this animal, stuck in a dumbfound shock as it came closer. What <em>was</em> it?</p>\n\n<p>When it was one hundred away, the beast craned it&#39;s massive neck and paused. It seemed like it was listening with gigantic, cartoonish ears. It called out again, this time in these <em>chit-chit-chits</em> that sounded like something out of a dinosaur film. </p>\n\n<p>This <em>chits</em> shook me out of my trance, and I decided that should probably be my exit line. My feet hit the ground in a mad dash, never looking behind me as I counted house after house. There was never a strategy, never a plan in mind. The only thing I knew I could do was get inside my apartment and lock the door.</p>\n\n<p>The creature hesitated. Still listening. Still calling out to something that it expected to call back. But after a minute of sprinting, The screeches felt loud enough to make my ears bleed, and they were in a voice that crept closer and closer. Finally, I slipped around the corner towards my street. </p>\n\n<p>Home free. Six houses left. </p>\n\n<p>My rapid breath made my lungs feel ache a cavity, and I cursed myself for smoking as I pushed myself harder and further. It was gaining on me. I heard the <em>chits</em> like they were whispers, felt it&#39;s hot breath on my back waiting to tear into my open flesh like a sundae.</p>\n\n<p>But I was quick, and the head-start helped. Up the driveway. To the door. Key in the door had to be perfect. I fumbled for it with sweaty hands as the beast leaped up my lawn. And then, luck. The key found the sweet spot, opened the door, and I shut it right on that motherfucker&#39;s face. </p>\n\n<p>It was furious. I knew that by the scratches. They rattled the house as that beast beat and pounded against the door like a madman. I stayed there, cowering behind that door like it was the Great Wall of China. For the time being, it was the only thing keeping me alive.</p>\n\n<p>And then, as quickly as it came, it was gone. The hooves retreated down the driveway, and the beast let out one final screech before I watched it take off down the street from my window.</p>\n\n<p>Not taking any chances, I slept behind that door until seven the next morning, resolving to report whatever the fuck I saw once campus opened back up. </p>\n\n<p>When I woke up, it was to a bright October sky and the screams of my classmates. </p>\n\n<p>I pulled open and rushed out the door, balking at the rising sun and already guilt ridden at what I knew they would find. </p>\n\n<p>A quarter-mile from my house was the quad. I ran there at full speed, following the source of the screams. When I got there, there was a group gathered around the center. I pushed them aside and made my way to the middle.</p>\n\n<p>Lying on the ground in a haphazard sprawl was a guy I immediately recognized as one of the ones in the library that night. Mark. I had an economics class with him the year before.</p>\n\n<p>Mark was dead. His stomach was cut open and his entrails were beside him.</p>\n\n<hr/>\n\n<p>The school shut the whole thing down after that. I was interviewed by police, campus security, and anyone with a badge in our great state. After a six month investigation, all agencies branded it a bear attack, ignoring my testimony as it lacked corroboration. The school implemented a system to keep kids safe around campus that involved escorts after hours. That made a lot of parents feel better, I guess, and it helped that there were no more attacks.</p>\n\n<p>But six years later, I can&#39;t stop thinking about it. About the night, about the beast, about the victim; Mark. I think about Mark a lot. Even while he&#39;s been dead and buried for so long, I think about that poor, stupid look of shock on his face. </p>\n\n<p>And I have to wonder. </p>\n\n<p>Do you think he took my place?</p>\n\n<p><a href=\"https://www.reddit.com/r/MattRichardsen/\">.</a> </p>\n</div>\n","author":"iAmMatt1"}