{"rank":"24","title":"House Jakool","id":"8lyh1c","url":"/r/nosleep/comments/8lyh1c/house_jakool/","time":"1527216741000","body":"<div class=\"md\"><p>In 2009, a small developer named Ontensoft quietly released a horror game called House Jakool. It was a fairly basic three-dimensional first-person game which took place in a contained environment that looked similar to a seventeenth-century manor done in a gothic, depressing style. Onyx replaced Ivory, and empty canvases replaced lavish portraits. It was visually impressive for its time, easily holding up to many games that were released as late as 2014, but the gameplay was mediocre at best and mostly consisted of running from generic slasher-esque villains while collecting flutes to unlock the next level. Why flutes? Only the developers have even the remotest idea. The game was available for Pc, Xbox, and Mac, but only the Pc version actually seemed to reliably function.</p>\n\n<p>Your character doesn&#39;t get a canonical name, you&#39;re referred to by whatever name the game determines to be yours after a sweep of your hard drive. There is no spoken dialogue, so this system worked surprisingly well, but there were several players who had to beat the game with names like Hidden_Fold or Bitmap.bmp. Nobody really knew how the naming would&#39;ve worked on other platforms since no copies have been found that work with other systems. Despite the generic gameplay, it had enough gimmicks and hidden content that it kept players entertained.</p>\n\n<p>You could actually beat the game without running into most of the content, but the people who stuck with it were rewarded with extra story elements or routes that would bypass some of the more difficult sections of the game. It featured a semi-open world and allowed players to explore area-by-area at their own leisure, similar to Amnesia: The Dark Descent, but with fewer actual objectives and more organic, undirected exploration. The main draw of the game, however, wasn&#39;t its story (or lack thereof), innovative design, or graphical fidelity, though.</p>\n\n<p>You see, House Jakool was designed to be the first &quot;Integrated Horror&quot; experience to hit the gaming scene. Ontensoft commisioned several peripherals that were more-or-less exclusively designed to work with their crowning achievement, and each was designed to bring the scares in a way that&#39;s never been attempted before, and likely won&#39;t ever be again. There were originally plans for up to ten peripherals, but in the end, only six were released, and most of the units didn&#39;t work, leading to many, many returns during the game&#39;s short life. Almost none of the copies sold came with a full working set, and, unfortunately, the game could only be played with all of them or none at all.</p>\n\n<p>The peripherals worked as follows: the first was a heart-rate monitor. This one was fairly self-explanatory. It was designed to help the game tailor your experience by measuring what made you the most nervous, and hitting you when you were most vulnerable. The second was a retinal tracker. This was meant to be mounted on top of your monitor, so it could measure pupil dilation and hold its worst scares for when you were looking directly at the screen. The third was a tactile feedback device that would rumble when you were in danger. By simulating a rapid, panicked heartbeat, it was designed to induce the same panic in the player. The fourth, however, was quite unusual in the sense that it didn&#39;t appear to do anything, at least not at first. </p>\n\n<p>It was a speaker, but it never made any detectable sound during gameplay. When some hardware hackers tried to use it as a regular speaker, it worked fine, but that same unit just refused to do anything noticeable during the game. More recent investigation has shown that it does, in fact, emit a constant seventeen Heartz tone during gameplay. This was ostensibly designed to infrasonically trigger visual aberrations in the player&#39;s actual eyeballs. Obviously, Ontensoft was more dedicated to horror than ethics.</p>\n\n<p>The fifth was basically a clunky, limited-use PDA with an LCD screen that only served as the game&#39;s menu. It was an innovative idea, forcing players to interact with a physical device rather than pause the game, but it was more irritating than anything. The last peripheral was the one to worry about, though. It didn&#39;t look too sinister at first. It was just a small gray box that had its own little battery pack that took two humble double a&#39;s. The game recommended that you leave it nearby during gameplay, though it never specified why. </p>\n\n<p>The box didn&#39;t have any connectors or even a power switch, so most players seemed to assume that it was a useless piece of hardware that was never implemented. Still, the game wouldn&#39;t work without it, so players left it running. Presumably, it would interact with the game by sending data over Bluetooth to one the other peripherals, which would send data directly to the computer, and vice-versa. The purpose of this device was the most puzzling thing about the game for a long time. Disassembling the unit revealed little; it was a standard microprocessor along the lines of a modern Audrino or Raspberry Pi, but it had no external connectors and no obvious GPIO pins. It did have fairly robust and advanced hardware for its time, so tech-savvy players speculated that it was designed to act as an additional processor for the game.</p>\n\n<p>What it actually was, however, was something far worse. You see, when you first booted up House Jakool, it would sweep your hard drive. This was common knowledge since it used the player&#39;s actual name and everything, but that wasn&#39;t all it gathered. It would read your files. All of them. Text documents, downloaded programs, image files, etc. It would even observe the layout of your computer&#39;s file structure and desktop. The purpose? To get to know you on a VERY personal level. The idea was to figure out what you were like, individually, and viciously exploit your fears and insecurities.</p>\n\n<p>An external unit was required because the file it would create could then be stored an on external system totally separate from your computer, without your knowledge. Another reason was to reduce the time it would take to complete by having a dedicated unit do the sweep, rather than relying on the user&#39;s hardware. This brings me to the reason I&#39;m writing this at all. I wasn&#39;t one of the original players, but I&#39;m something of a collector of weird games.</p>\n\n<p>I got the game and peripherals from various people who either didn&#39;t want them or couldn&#39;t use them, so I didn&#39;t pay much. I don&#39;t think I was the first person to get a complete set, but I&#39;d say that those numbers are definitely in the low double digits. I sat down at my computer with the heart monitor, retinal scanner, tactile feedback vest, speaker (with several layers of tape to block the noise), the PDA/menu, and, finally, the creepy gray box close by. I can see why this concept never took off.</p>\n\n<p>I needed a powered USB hub just to connect everything, and the first-time setup was agonizingly slow since USB tech back then wasn&#39;t what it is now. The game itself also needed to run in compatibility mode, and it took some troubleshooting to prevent it from crashing, but I finally got it all to mostly work, with the exception of the vest. It still connected, but the motors were dead, so I gratefully pulled it off and threw it aside.</p>\n\n<p>The title screen was underwhelming, to say the least. It featured the words House Jakool in a drippy red font, imposed over a monochromatic dark gray background. The title music was creepy, though. It was a haunting piano tune which brought to mind those long nights in the dark as a child, praying that the monster in the closet wouldn&#39;t jump out of the shadows to eat me. Already, I was freaked. I&#39;d heard a lot of good scores in games, but this one struck a cord. The thing was, I was aware of the whole thing with the gray box figuring you out before the game started, so I was using my old PC that I&#39;d wiped clean a few years before.</p>\n\n<p>I didn&#39;t know how much the game knew about me, so maybe it somehow figured it out from my vitals or something, but it definitely knew that I was scared now. I could feel the heart monitor against my chest. I hesitantly pushed &#39;Start,&#39; and I heard the gray box gently whirring in response. I hadn&#39;t heard of a cooling fan on the unit, only a small copper heat sink. For most other peripherals, I&#39;d just assume that multiple versions of the device had been released, but House Jakool was on store shelves for like, two weeks, so I seriously doubted that any updates had been made in that time.</p>\n\n<p>Again, to my surprise, the game started with a cutscene. I hadn&#39;t heard of this, but most other people who&#39;d played the game played without peripherals, so I knew that the experience would be very different. The cutscene was... bizarre. It was just a collection of random clips from the internet, mixed with moments I&#39;d seen in other people&#39;s playthroughs of the game. The clips weren&#39;t even scary, they were just bits and pieces of video thrown together with no obvious direction or purpose. I was mildly nervous that something scary would happen, but it didn&#39;t.</p>\n\n<p>The cutscene only lasted about fifteen seconds, according to my capture software. When it ended, I heard that whirring again and questioned for the second time whether or not I should be playing this. After that, the game actually started. I found myself in the foyer of the mansion, which I understood to be the normal starting point. The first thing I noted was that the art style of the game varied greatly from descriptions I&#39;d read.</p>\n\n<p>The walls were white as could be and the grim, dark style was replaced by an almost inviting atmosphere. Despite that, I actually felt more nervous than I normally would. The calm, benign appearance of the game just set me on edge, since I knew what it was capable of. Another haunting score played gently in the background. This was a more urgent piece, and it heavily featured the flute, as well as some strange, heavy percussion instrument I don&#39;t think I&#39;ve heard before. You know that moment of panic when you realize something&#39;s just gone spectacularly wrong, but it&#39;s too late to change it? This reminded me of that moment instantly.</p>\n\n<p>I felt my eyes instinctively dart around the screen. I tried to keep them still, but it was no use. Cautiously, I made my way through the first floor. To my left, a kitchen was fully stocked for what looked like a feast, while a grand ballroom was visible to my right. Everything was set up for a large number of guests. Everything looked normal, but, at the same time, something was just ever so slightly off about it. Like that uncanny-valley effect you get when you look at a clown, but applied to everything in some small way.</p>\n\n<p>Every element of the environment, from the walls to the decorations to the plates, had some element to unnerving creepiness to it that I couldn&#39;t quite place. The music had stopped for the moment, but the silence was almost worse. I knew there were monsters in this game, and I knew that they made noise when they moved. I should&#39;ve seen one by now. I also hadn&#39;t found a flute yet. In the normal game, you&#39;d need five flutes to pass the first level.</p>\n\n<p>Experimentally, I tried to just walk upstairs towards level two, and, to my surprise, I could just pass right on through too the next section. Was the game broken? It seemed likely since I didn&#39;t have any clear restrictions, enemies, or objectives. But that score was evidence that the game was doing something. What, I wasn&#39;t sure, but it was definitely still processing data to play sound files, so I stuck with it.</p>\n\n<p>Level two was supposed to be a puzzle-focused area of the game which tasked the player with solving riddles or finding objects while avoiding monsters, but I found that every door in the level was already unlocked and opened wide. I might&#39;ve turned the game off right there, just because I thought it was bugged, but, as I was reaching for the PDA to exit the game, every door slammed shut and a huge clang resonated throughout the level. I jumped.</p>\n\n<p>Normally, I wouldn&#39;t have reacted to a cheap jump scare, but the game had been so oppressively quiet up until that point that I was genuinely surprised when I heard something other than music. I nervously navigated the menu to access my inventory, but, when I tried to equip the flashlight, the screen flashed to some ASCII art of a young girl. I felt my breath change for a moment as painful memories crashed through my skull. Brief backstory: I had a sister. A sister who, unfortunately, passed away at five years old from an unidentified illness. Something about that awful, low-quality art reminded me of her.</p>\n\n<p>I swallowed hard and put the chunky, plastic device back down. I turned back to the game. The doors were locked, the lights were off, and that unsettling score had picked up again. Just as I was about to quit, the screen lit up my room in an ugly, crimson red. The in-game room was suddenly covered in the crude, crayon drawings of a young child, held to the walls by duct tape. One of the doors on the far side of the room swung open, a young voice beckoning me from within. WTF? There wasn&#39;t supposed to be dialogue. I moved my character through the door, knowing I&#39;d regret it.</p>\n\n<p>Fuck me. There she was, covered in sores, brushing necrotic tissue off her arms and somehow smiling through it all. Emily. My sister. Dressed in her little flowery dress, the one with the princess wings. She spoke in that perfect, soft voice. &quot;Hey Mike. Missed you.&quot; I spoke with a tremor in my voice. &quot;Uhh... hey. You... gosh.&quot; I knew it was the game messing with me, but I couldn&#39;t help but be overcome by her presence. &quot;I missed you so much. When we lost you... our parents cried for days. You... oh God, I love you.&quot; She giggled. &quot;Oh, silly. You don&#39;t need to miss me! I&#39;m right here!&quot; She turned suddenly, facing a round, low table I hadn&#39;t noticed. Teapots were carefully arranged around saucers and stirring spoons.</p>\n\n<p>&quot;Come on! Let&#39;s play!&quot; I moved my character to the table, watching as my camera moved down to be level with her face. She sat down and pensively twirled her spoon around in her empty cup. &quot;Ya know, you could join me.&quot; She reached under the table and handed my character a rope. Shit. Here comes the twist. &quot;It won&#39;t hurt, promise!&quot; A button prompt showed up. Press &#39;E&#39; to tie a noose. I was visibly shaking. This was freaking me the hell out. I reached forward and pressed the button.</p>\n\n<p>My character effortlessly tied the knot and swung the rope over a rafter in the room. Emily watched with a smile. I started in horror. Just before my guy took his last step off the stool, I swung the mouse back and forth, shaking the camera &quot;no.&quot; My character took the noose off and let it swing. He stepped off the platform. I looked at Emily. She looked terrified. &quot;Mike! Please, do it! He said he&#39;d hurt me if you didn&#39;t! PLEASE, MIKE!&quot; She was hysterically sobbing at this point, more desperate than I&#39;d ever seen anyone. </p>\n\n<p>I&#39;d never smashed the &quot;close&quot; button faster. Hell no. No no no. I shut my computer down, took the game disk, smashed it over my knee, and spent most of the night staring at the ceiling, trying desperately to relax. The next day, two things sent me over the edge. One? I woke up to find a noose resting at the edge of my bed. Two?</p>\n\n<p>That computer didn&#39;t have a microphone.</p>\n</div>\n","author":"IdoHorror"}