{"rank":"1","title":"The Hut","id":"8lyii4","url":"/r/nosleep/comments/8lyii4/the_hut/","time":"1527217167000","body":"<div class=\"md\"><p>I&#39;ve always loved nature. I would leave the comfort of my house to take walks in the park. The area I live in is considered somewhere in between urban and rural, a place where there is a fair amount of people and buildings yet with a few fields and forests nearby. It was summer time, perfect for a stroll. I had invited my friend Josh to hang out with me, go for a walk or something. We had decided to go into the forest where its quiet and you can&#39;t hear any cars in the distance, only leaves and the rustling sound of the tall trees above.</p>\n\n<p>We had walked this familiar path before. It winded through the forest, up a and down a few small hills and across an area scattered with fallen branches and tree trunks. It was there, amidst the bramble and bushes where an eery delapidated hut stood.</p>\n\n<p>This day, we followed the path as planned, and as it usually did, the hut caught our eyes.</p>\n\n<p>There was something about it, even if we tried, we couldn&#39;t keep from looking at it. It was like something forced us to.</p>\n\n<p>The rotting hut looked like it had been abandoned for a almost a decade. &quot;Why is it there?&quot; I asked myself. &quot;What was inside it?&quot;</p>\n\n<p>Me and Josh were having a funny conversation about embarrassing events that happened to us when we were younger.</p>\n\n<p>I was distracted by my particularly funny story when I realized Josh had stopped walking beside me.</p>\n\n<p>It took me a moment to realize what was going on before I turned around to see him a little far behind.</p>\n\n<p>He didn&#39;t look good. He stood frozen in place, pale as a ghost and breathing quickly, his eyes fixed on something behind me.</p>\n\n<p>There was a sudden feeling of fear and unsettlement.</p>\n\n<p>He turned his head with wide eyes to the right and stared in that direction without moving his body.</p>\n\n<p>The only thing i could see moving was his hand shaking as if he was having a seizure, which he wasn&#39;t.</p>\n\n<p>I turned my head to the left to see what caught his gaze.</p>\n\n<p>I saw the hut... I stared at it as I thought about what I should do.</p>\n\n<p>I could feel my heart pounding on the interior of my chest. constantly booming as if you were pounding on a door.</p>\n\n<p>The silence was broken by Josh.</p>\n\n<p>..</p>\n\n<p>He screamed.</p>\n\n<p>The sound that came out of his mouth sounded like the end of the world, as if a demon possessed him and tried to leave his body.</p>\n\n<p>&quot;WHO ARE YOU!&quot; he exclaimed. &quot;SHOW YOURSELF!&quot; he demanded.</p>\n\n<p>&quot;Who the hell is he talking to?&quot; I wondered in panic.</p>\n\n<p>It was just then that Josh uncontrollably ran towards the old structure.</p>\n\n<p>&quot;Josh! Wait! Where are you-?&quot;, he stopped. He stood. He walked up the creaking footsteps, walked through the door and stopped...</p>\n\n<p>The termite infested door, shut behind him.</p>\n\n<p>I ran as fast as I possibly could off the path to the tiny building and pushed the door open...</p>\n\n<p>with fear and shock in my eyes, adrenaline in my blood, I realized... I didn&#39;t see him, nor a trace.. He was gone... &quot;What in the hell..?&quot;</p>\n\n<p>To be continued...</p>\n</div>\n","author":"justchillshaiyan"}