{"rank":"1","title":"The Milk Man","id":"8lyi26","url":"/r/nosleep/comments/8lyi26/the_milk_man/","time":"1527217027000","body":"<div class=\"md\"><p>I can&#39;t really tell you the last time I had heard this term, being 15 and living in this time period, the term isn&#39;t used as much anymore. But the time I did hear this term, I didn&#39;t want to.</p>\n\n<p>About a year ago I was watching YouTube, I know, I know, a 15 year old female watching YouTube, how &quot;creative&quot;. Anyway, I found this YouTuber, I won&#39;t say the name,(but I&#39;m sure that you&#39;ll be able to figure it out), but I will tell you his real name later. I had found this person&#39;s channel when I was watching one of his friends playing Gmod(Garry&#39;s Mod if you didn&#39;t know), this video was posted a while back. This YouTuber, Lucas is his real name, was playing Freeze Tag with his friends and he had showed his new player model, it was a Milk Carton with arms and legs. I did, however, find this the funniest video at the time.</p>\n\n<p>I was bored one day and I had decided to revisit this video, but something was odd. I was left alone and I heard something pouring and odd laughing outside. I had paused the video and the odd noise stopped. I thought that I was just hearing things, so I continued the video.</p>\n\n<p>Again, there was laughter. I had decided to listen closely, and it sounded like Lucas, the man with the <strong><em>Milk Carton</em></strong> player model. </p>\n\n<p>I texted my mother and I hadn&#39;t gotten any texts from her, I tried calling and everything, and nothing worked. I decided to message my friends and nothing worked. Even my cats were sound asleep. I was on my own with this one.</p>\n\n<p>As I continued to watch this video, I heard more laughter, but no pouring. I did however, heard knocking on my bedroom window, I was in the living room and I could see my bedroom from where was I sitting. I decided to look over and what I saw was the most horrifying and most beautiful thing ever.</p>\n\n<p>My bedroom&#39;s outside light was on and saw a beautiful man in all white, like an outfit a <strong><em>Milk Man</em></strong> would wear. This man had brunette hair with matching brown eyes. </p>\n\n<p>What was creepy was his smile, it was a wide smile that looked like a sinister smile. That was only thing that was creepy, but it was also satisfying at the same time.</p>\n\n<p>I had paused the video, and he stayed there, smiling. It was hypnotizing, I walked over to him feeling controlled and I stared into his brown eyes, he was so much more beautiful looking up closer. </p>\n\n<p>I could hear him talking even though he was outside, I could hear him in my head, but his lips were moving. He had told me to go outside. I listened to him without thinking. </p>\n\n<p>When I was outside I saw him still at my window, I walked up to him and put my hand on his face. His face was so warm. &quot;Let&#39;s go home&quot;, he had said calmly and I walked off with him into the woods by my home.</p>\n\n<p>New text from MOM:</p>\n\n<p>Sent at 1:55 a.m.</p>\n\n<p>-Hey sweetheart are you okay?</p>\n\n<p>Sent at 2:30 a.m.</p>\n\n<p>-You took your Meds today , right?</p>\n\n<p>Sent at 4:30 a.m.</p>\n\n<p>- Are you there?</p>\n\n<p>3 Missed calls from: MOM </p>\n</div>\n","author":"Rat_girl112"}