{"rank":"1","title":"Why don’t you remember","id":"8lykls","url":"/r/nosleep/comments/8lykls/why_dont_you_remember/","time":"1527217737000","body":"<div class=\"md\"><p>I always have wierd dreams, but after a while I had the thought that one day they would stop. I was wrong. At first, I thought I was having unbelievable nightmares, but that wasn’t the case. These dreams, they were so realistic. In one dream I was standing in a dark alley and towards me came running a woman who looked horrified as if she’d just seen a ghost. But she ran right through me. I initially thought to turn around and run after the lady, my intentions were to make sure everything was okay with her and maybe even offer my phone to her if she’d needed to call the police. After about 10 seconds max of standing there thinking of a decision to make a man with a knife came running through me behind the lady. He looked like a psychopath I didn’t know what to do. Like anyone else who would’ve been in that situation, I called the police.</p>\n\n<p>When I explained to the dispatcher what was going on he didn’t believe me. Maybe it was because I’d mentioned that they had ran through me, but what else was I to say it was the truth.</p>\n\n<p>That isn’t even the wierd part. The next day on the news a lady had been found brutally murdered at approximately 5 am in a alley, but it happened states over. They even included a call received and was looking for the person who had called. As a young girl I didn’t know what to do, I was terrified. If I’d been smart enough to include a description of the man, then maybe they would have some clues or maybe even something to relate to, but, I didn’t. I tried to make myself believe it was a coincidence. But, coincidences don’t happy every night to the exact same person. </p>\n\n<p>One day I received a call, I had no ideas who it was but it was a number calling from Idaho, where the murder I explained had occurred at. A man said, “ If you ever tell anyone what you saw I’ll make a special trip to make sure you’re next.” The call ended there I was so scared so I decided to tell my best friend, Marlin, about my dreams she was super supportive and I was extremely shocked when she told me the same thing was happening to her. </p>\n\n<p>So, after that we told each other everything but the difference was my dreams happened as I was seeing them happen, hers always occurred 2 days later after the dream. One night I was woken up by the ringing of my phone, it was her. Something was completely wrong, she didn’t sound like herself she sounded like a aged woman. She only said, “Keeping secrets again I see, too bad you want have the pleasure of having more to keep. He’s coming,” and ended the call. I was perplexed also terrified. I hadn’t kept any secrets from Marlin and what did she mean by “ He’s coming.” Did she mean the man who had called and threatened me. </p>\n\n<p>When I confronted her the next day she had no idea what I was taking about. She didn’t even remember the dreams. Mine or hers. She told me I was crazy and we were no longer friends but had no reason. That day I was sad I had lost my bestie. Later on that night I recieved another call this time it was from my state, Georgia. It was the man again “I’m here, you should’ve thought twice before you shared exactly why I told you not to with Amy. By now you don’t even remember what I’m talking about but you still ran your mouth.” That’s how the call went. He had said Amy, which Is me. I decided to just sleep it off but the next morning my parents woke me up, my mom in tears. “What’s going on?” I asked. “Honey, Marlin was found dead in her room this morning. She was murdered.”</p>\n</div>\n","author":"LifenowandDeath2come"}