{"rank":"10","title":"The Desert Always Demands a Sacrifice","id":"8lyp1m","url":"/r/nosleep/comments/8lyp1m/the_desert_always_demands_a_sacrifice/","time":"1527219029000","body":"<div class=\"md\"><p>I’ve never really liked people. They’ve never enjoyed me much, either. I just don’t know to connect with any of them. I can’t say I’ve really ever had any friends, and I don’t even speak to my mother much. I feel like people are unsolvable puzzles, taunting me.</p>\n\n<p>I substitute human interaction for time spent outside. I have always had an inexplicable, unexplainable obsession with the desert. I find this place beautiful. The way it wraps it’s warmth around me, drawing me into its quiet nothingness. The way it gently holds me as I lay on its earth, cradling me while I stare up at the Milky Way. This enigmatic, unending desert is my confidant, my sanctuary. It is my home, not the shitty trailer I live in or the town 15 miles down the road. I don’t know how to capture it in words, but I have always been drawn to the vast expanses of sand that nobody dares go into. It’s like there is a magnet, pulling me further and further into the nothingness.</p>\n\n<p>Other interests come and go. I was obsessed with gardening for years, but a slowly emerging fancy with model trains took over, and my poor garden was neglected. I had a brief obsessive interest in American history, but that didn’t last long either. My love for the desert, though, has been with me since I was old enough to think. My mom often talks about how, even at 5 or 6 years old, I would sneak out of the window and walk straight into it, often times for miles, before returning totally unfazed in the morning. Apparently, no matter how much she yelled or scolded, I would do the same the next night. She just doesn’t understand the undeniable appeal of looking at the night sky, sitting on cool sand, feeling safe and at peace. There is nothing better in this world.</p>\n\n<p>The 200 some-odd residents in town don’t like this desert much. They hardly even have the guts to venture out to our trailer on the outskirts. The feeling is mutual, though I don’t much like them much, either. They say horrible, mean things about the desert. The talk about the unnatural lights above it, or all the missing hikers who have never been found. They don’t understand the beauty of the lights, how they dance and mingle with the stars. They don’t understand the tranquility in the air, untouched my man or urban progress. I know they sit around embezzling campfire stories about strange and mysterious things they’ve seen or felt while out in the wilderness. Part of me is glad to know there is such a mythology surrounding my home, but my blood boils that they can’t simply respect the land they are guests in.</p>\n\n<p>Sometimes, a tourist will catch wind of our untouched land with beautiful stars and mysterious lights, and they’ll come on down to see it. There are two distinct types- the hikers and the ghost hunters. I despise them both. In fairness, I don’t see much of them. I do, after all, live in the middle of the desert. There isn’t even a road to my trailer. The townspeople don’t seem to mind the tourists much, though. I guess they’re good business.</p>\n\n<p>Every once in a while, a lost hiker will come banging on my door, parched and panicked. I’ll sit them down and give them water, and tell them to stay until it’s dark, that it’ll be cooler when the sun goes down. Almost all the time they are so weary, they have no objection to resting their feet in the air conditioning. When night falls, I’ll usher them into my truck and drive them far out into the desert, as far out as I can until they notice we’re not headed to town.</p>\n\n<p>I wait for the lights to come find me, shooting through the starry sky, and I let them take my unwilling counterpart. Don’t get me wrong, it’s not that I enjoy doing this, it’s just that the lights demand sacrifice.  They whisper sweet nothings into my mind, little secrets that only I can hear. They promise me that if I bring them enough sacrifices, they will come and take me, too. I always feel a tinge of jealousy watching them dash off into the abyss without me. It is lonely when they leave, like when something you’ve been looking forward to for months happens, and you feel empty after. I don’t know what to do with myself. I am antsy here.</p>\n\n<p>I bring the lights sacrifices, so that one day soon, they will bring me home.</p>\n</div>\n","author":"grey_lavender"}