{"rank":"0","title":"Not Quite Dead","id":"8lyweg","url":"/r/nosleep/comments/8lyweg/not_quite_dead/","time":"1527221078000","body":"<div class=\"md\"><p>This message was found on the phone of Leon Michaels, a man murdered in a London alley.</p>\n\n<p>Hello, The date is December 28th 2008. It is almost Christmas time and I wish so much to be with my family but I’m afraid to say I have died.</p>\n\n<p>I know what you’re thinking no, this is not a suicide note, so let me explain.</p>\n\n<p>I was captured by hooded figures. They brought me to an alley and tied me up. I was then given a drug which was meant to kill me and it worked. I died.</p>\n\n<p>You are probably thinking, how am I writing this letter?</p>\n\n<p>Well, I have been blessed this day. I have returned from the dead but I don’t know for how long, my body still feels like death but yet I live.</p>\n\n<p>I’m writing this note to say my last goodbyes. To my children I love all 3 of you and I hope you all live successful lives. To my beautiful wife, I know we have been fighting a lot and I wish it were not so. You are the most amazing woman I have ever met and I am so happy I married you. All I ever wanted was for you to be happy. So goodbye to you.</p>\n\n<p>Since I am not dead yet I will tell you that I have no clue who has done this to me or why. Yes, my wife and I fought but I don’t think she would have me killed for it.</p>\n\n<p>I could tell that the hooded figure who captured me was a man and there was also another figure with him. That person was much smaller, a woman I am suspecting. In fact, they seemed to be a couple.</p>\n\n<p>I saw a bit of the man’s face and he looked a bit like my friend Marco. He had the same type of beard. But wait why would Marco want me dead? And if it was him who was the woman that was with him…wait. No, this can’t be.</p>\n\n<p>On Wednesdays me and Marco and some other friends would all go bowling but recently he has stopped coming. There was also one night while I was out bowling and I came home an hour early because I wasn’t feeling well. When I returned home my wife was not there. She came home an hour later just before the time I would normally get home from bowling. When she walked in and saw me she seemed shocked. I asked where she had been and she said she was out with some friends. I didn’t see this as strange and put it off as nothing.</p>\n\n<p>Now that I think about it I think she and Marco have probably been having an affair for quite some time now. This must have been there big plan to get rid of me. Well it worked.</p>\n\n<p>Urghh I can feel my body shutting down again. I thank the lord for these last minutes for me to write this. </p>\n\n<p>I thought you loved me Christine as I loved you but apparently not. Well now that I am going to be gone you can live a happy life. I just have one request. </p>\n\n<p>Please take care of our children. They are the most precious beings you will ever have in your life. Just because you have killed me, ruined our marriage and are being with Marco, don’t let our children suffer for that. </p>\n\n<p>Christine you will probably find this letter and never show it to the children but if they do get to read it somehow, to the twins Jenny and Fredrick and to our younger son Marshal, I love all 3 of you and you have made me the happiest man in the world even as I lie here dying. The thing that saddens me most is the pain that you will go through when you learn of my death. </p>\n\n<p>Christine even though you may not tell them the details at least make sure they know that I loved them. </p>\n\n<p>I am grateful that I have been given a chance to write this out. Wait I hear someone coming. It is Christine and Marco probably coming to clean up my body. She sees I’m alive and says ,“how is he not dead”, she is coming at me, this is it, she is going to finish me I’m going to diiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiii</p>\n\n<p>Marco Williams and Christine Michaels were both arrested after police found this note. It was shown to his children Jenny and Fredrick (10) and Marshal (8). The children are now taken care of in foster care. As for Leon’s body, it was given to his brother Sean and was cremated. </p>\n\n<p>Doctors cannot identify the drug used on Leon or how he came back to life to write this note. Everyone is grateful that he did. Without this note Christine and Marco may not have been caught and still free to this day.</p>\n</div>\n","author":"Betterthanu55"}