{"rank":"0","title":"Howdy my name is E-a-m-y-e-s, how's your day today?","id":"8lyxsu","url":"/r/nosleep/comments/8lyxsu/howdy_my_name_is_eamyes_hows_your_day_today/","time":"1527221483000","body":"<div class=\"md\"><p>Howdy, my name is Luke Skywalker. Ha got you there didn&#39;t I, but really it&#39;s Ethan.\nI have always had a normal life, some moments of getting slapped on the wrist for doing something you shouldn&#39;t, learning how to ride a bike, talking to the &quot;others&quot;, and smiling while the spoon full of ice cream is in my mouth.\nAhhh yes you are one of those people, aren&#39;t you.... the kind that doesn&#39;t understand us, sorry I mean me. You see I thought it was normal at first, but the first I told, or should I say &quot;showed&quot; ran away with a bloody nose screaming.\nThe for mentioned....&quot;others&quot; are me, but they have names too. Meet, J€#%{, and of course T$#¥~&gt; they are my friendssssssssssssssssssssssssss! Aren&#39;t you? Let me tell you a few tales of us sh____________________.... d-o-n-t-y-o-u-d-a-r-e-t-h-e-y-d-o-n-t-n-e-e-d-t-o-o-know-know-know-know-know-know....\nSorry, let&#39;s get into the story&#39;s,shall we.</p>\n\n<p>~This first one was how I meet James. He was always there or at least I don&#39;t remember a time he wasn&#39;t. In preschool I always was the kind of kid that did what they were told, that is why James helped me when nobody was there. He whispered sweet things like, &quot;HELP ME, I&#39;M STUCK IN HERE!!!&quot; And, &quot;He&#39;s right there and you can&#39;t hear him can&#39;t you?&quot; Things that would at least keep me out of trouble. I remember a day when I was given a ring by a girl (in kindergarten) and James told me to get rid of it. This wasn&#39;t the last time I ignored him, but it was the first.</p>\n\n<p>~Thomas on the other hand was introduced to me, at first by being on my shoulder and telling me weird things. He was dark, his eyes like snakes, and he had curved blood red horns, he still dose. He yelled in my ear when I didn&#39;t do what he said, pulling on my ear, and one time stabbed my head with a pair of scissors. I try not to let him out but slip ups do happe_________ im so so so sorry, you weren&#39;t supposed to die like this...\nAnyways he is just a big old jerk who likes to bug me, but when ever I lose my cool... I felt bad the first time it happened even though it was not me... was it?</p>\n\n<p>-Oct.25.05-This day if I recall was his.... birthday I think? He was being a little kid like usual when he started showing up and RUINING ALL MY HARD WORK!!! He whispered something into his ear and E started going toward another kid with anger. Now E is not the type to get angered very easily so I don&#39;t know what he said to E but he was snickering to himself. I looked.... E wasn&#39;t there any more... it was the Devil instead, holding a bloody knife over one of the kid&#39;s body on the floor. He had taken over E&#39;s body. I tried so hard to stop him. He killed every last one of the kids.... all 6 of them. When the parents came in they were in shock, I would too if I saw a kid crying over the spilled guts all over the floor. The saddest part was I don&#39;t think E was crying over the necks he snapped, or the kid he hanged, but rather the fact he had no more friends because of that.</p>\n\n<p>~ I have always been scared of something, from it being blood, to death, or the old someone is standing behind you thing, even if I know it&#39;s not true I look back just to see.\nSome days fly by, and others never move, but some I just watch as I can&#39;t do anything. As you know by now I switch some days with one of the others, just to talk a break when I&#39;m sad, but the other times are when they decide I&#39;m the wrong person for the situation. When I get in a fight, Thomas shows himself. When one of my friends are crying, James shows up to comfort them. The one time I remember the most is a big kid wanted to fight me one day, I declined but he punched me knocking me to the ground along with a tooth and some blood out of my skull. I watched as Thomas began to _________ and _____________, soon the kid started running away.</p>\n\n<p>-Feb.02.09-I yelled and pleaded for us to leave the kid, he wasn&#39;t worth our time. E was the only one who could hear me. We ran after this kid for 2 hours, we ran into the woods with no thought about it. He got into a cabin and slammed the door. We got there and he used E&#39;s left hand and pushed it in the crack between the door. I heard E&#39;s fingers brake as well as the lock, we kicked the door open to find the kid standing there with a axe.</p>\n\n<p>~ It was weird.... my head touching the cold dusty wood floor. I still saw everything, from my headless body walking toward the kid making him cry and scream for it to stop, to him being pushed up against the wall, to...</p>\n\n<p>T.: Me StAbInG mY rIgHt HaNd ThRoUgH tHaT pOoR aSs HoLeS HeAd.... but I did give his brain a nice squeeze to release him of some of the pain. He learned a good lesson that day... you can&#39;t kill what isn&#39;t there... also killing with out a weapon is so much more fun!</p>\n\n<p>~ So you may understand now who the &quot;others&quot; are and why I might be afraid of my own shadow from times. So tell me, if you see me... who will you talk to... because it might not be m, and that may be your last mistake sadly, or it may be mine, who knows?</p>\n\n<p>Sorry, how&#39;s your day going?</p>\n</div>\n","author":"IamZextra556"}