{"rank":"62","title":"Rose's Whisper","id":"8lz0u9","url":"/r/nosleep/comments/8lz0u9/roses_whisper/","time":"1527222384000","body":"<div class=\"md\"><p>The house seemed like an absolute miracle, the asking price was unbelievably low, the sellers had remodeled most of the house to try to entice buyers and the yard was absolutely enormous, surrounded by vacant, wooded lots on three sides. We were in a tight spot, the seller of the house we were buying backed out at the last minute. The house we were in was in closing. It was the most welcoming vacant house I’d ever seen. Even from the first night, with only boxes and no furniture in place, it was home. There were no nights of unfamiliar noises breaking our slumber.</p>\n\n<p>Shortly after the move, I started my junior year of highschool. I didn’t know anyone in this sleepy little town yet. The move was sufficiently far away none of my friends were close enough to even visit. It was pretty average, people were too busy with their own business to really notice me. At lunch on the first day a pale girl sat down across from me.</p>\n\n<p>“I’ve never seen you here before.”</p>\n\n<p>“I just moved here a few weeks ago,” I admitted.</p>\n\n<p>She nodded along, pulling her arms into her black TSOL shirt. I watched her squirm in her seat, and try to shake the tuft of auburn that hung from an otherwise shaved head out of her face.</p>\n\n<p>“Why Pinehurst?” she asked with more than a tinge of disgust.</p>\n\n<p>I shrugged, “My parents just really loved the house and happened to find better jobs around here.”</p>\n\n<p>“What house?” she probed, skeptically.</p>\n\n<p>“The big purple house on Garden Row.”</p>\n\n<p>She came to life, her eyes lit up, her flat expression turned to the most infectious smile. </p>\n\n<p>“You’re telling me you live in Rose’s House?” she laughed.</p>\n\n<p>“Rose’s House?” I was lost.</p>\n\n<p>“It’s the haunted house!” she exclaimed before launching into a barrage of questions. “Have you seen the lady in the bright red dress? Has she been calling for her lost lover? When I broke into it back when it was still abandoned, I totally saw her in a mirror behind me!”</p>\n\n<p>“Slow down there, Egon.” I said with a laugh, “I haven’t seen anything like that.”</p>\n\n<p>“Just you wait! You’ll see her!”</p>\n\n<p>She practically dripped with excitement as she climbed over the lunch table, plopped down next to me and flung her arm around me.</p>\n\n<p>“Ghosts aren’t real.” I reminded her, trying to wiggle from her grasp.</p>\n\n<p>“Just. You. Wait.” she shot me finger guns and a wink.</p>\n\n<p>The lunch bell rang and everyone dispersed to their schedules. I decided not to share my residence with anyone else for awhile. I kept thinking about how sure she was, how she said that she saw the lady in red before. Were those shadows that we see from the corner of our eyes really the lady in red? Had I explained away something terrifying? I was on high alert when I got off the bus. I carefully observed every window in the house, searching for movement, silhouettes, anything that might tell me there was something in the house. </p>\n\n<p>Our entire house was still as I slipped through the door as quietly as I could. I checked behind me so often I felt like I was spinning. I crept down the hallway, peeking into each room from the edge of the door frame. I winced with each creak of the floor. Then came a sharp snapping sound that echoed through the house. I scrambled into my room and hide behind my bed. Silence swept back through the house.</p>\n\n<p>It took me a few minutes to get my bearings. I absolutely knew there were no such thing as ghosts and I needed to step up and be an adult about it. I marched back into the hallway with a hair straightener in my hand. The door at the end of the hallway slammed shut. I started to scream, but managed to pull it together and yelled into the house. </p>\n\n<p>“Who the fucks there?!” I bellowed down the hall.</p>\n\n<p>I ran down the hall, breaking the silence with the thuds of my feet. I ripped the door open and swung my implement of destruction wildly for anyone in there to catch. It was our home office, and it was completely empty. Someone had left the window open, the curtain was snapping in the wind, and the wind probably slammed the door. I threw myself into the office chair and sat the hair straightener down.</p>\n\n<p>“Jesus, what’s wrong with you!” I said into my hands with an aggravated growl.</p>\n\n<p>My stomach sank, now there was the distinct sound of a person coming down the hallway. A strange yet familiar voice called out, “Hey, you alright back there?”</p>\n\n<p>I grabbed my straightener and peaked out into the hall. I should have known by the clunk of her boots. </p>\n\n<p>“What the fuck are you doing?” I said, holding my chest as my anxiety leveled out for the third time.</p>\n\n<p>“I… uh… “ she stammered, trying to find a reason to be at my home.</p>\n\n<p>“I told you there’s no ghost here.”</p>\n\n<p>Her face was red, she chewed her bottom lip. “Well, there is,” she said matter of factly, “but that’s not why I came over. You did tell me where you live, I figured you wanted to hang out.”</p>\n\n<p>She was an odd duck. We sat out on the patio in the back of the house. It was honestly the fastest I’ve ever become friends with someone. The only girl named Johnnie I’d ever met, she hung onto my every word and I hung onto hers. We’d been talking for what felt like minutes but had stretched into hours when she jumped up from the swing. </p>\n\n<p>“Do you smell that?” she asked with a grin.</p>\n\n<p>“I thought it was you.”</p>\n\n<p>She took off towards the woods and yelled back for me to hurry up. I ran after her. It didn’t take long before I found her in a clearing with an absolutely massive rose bush. The buds were equally disproportionate, some of them as big as dinner plates. Its thorny tendrils stretched across the clearing, it seemed like nothing else wanted to live near it. Johnnie reached out and was stroking one of the large flowers to be.</p>\n\n<p>“Laura?” I heard my mom call from the house.</p>\n\n<p>I turned to look towards the house, “I’m back here with a friend.”</p>\n\n<p>The bush shook violently. I jerked around and Johnnie had tripped over one of its sprawling vines and into the thorny bush. I dug her out, but the thorns had done a number on her arms. I helped her back to our bathroom to clean her wounds.</p>\n\n<p>“Ow!” She exclaimed as I dabbed peroxide on her arm.</p>\n\n<p>“Not as tough as you look?” I asked with a laugh.</p>\n\n<p>“Can I ask your parents if they&#39;ve seen Rose?”</p>\n\n<p>I jabbed one of her cuts with a cotton ball. “You have a problem.”</p>\n\n<p>She stayed for dinner that night. My parents loved her like a second daughter from the first hello. Johnnie was unlike any other person I&#39;d ever met. She treated everyone she ever met like they&#39;d been with her their entire life. My parents basically let her crash at our house as often as she wanted. They wouldn’t have really noticed anyway, the workaholics that they were. I think they liked that I had someone around to keep me company.</p>\n\n<p>After a couple of nights, I caved. “Johns, what exactly is Rose?”</p>\n\n<p>I thought she was going lay an egg. She squealed with absolute delight. “Did you see her? Is that why you want to know?”</p>\n\n<p>“No, I just know you’re really into it and wanted to know why.”</p>\n\n<p>“Well! Let me tell you! This was one of the first houses in Pinehurst. That’s why it seems so much older than most of them. Eventually they sold more and more of the land and people built more homes up around it.”</p>\n\n<p>“So, the house is haunted because it’s creepy?” I asked flat and unimpressed.</p>\n\n<p>“I’m getting to it! So! Rose was a resident here after they’d broken up the big land parcel. She was a single woman, no kids. Which was a little strange but not unheard of when she lived her. Unfortunately, she had a very early mental decline.”</p>\n\n<p>“Like Alzheimerz?” I asked.</p>\n\n<p>“I don’t know, but at first she was still her friendly self, then she had a little bit where she was just kind of a husk. Out of no where, she started lashing out at the nurses who’d come to take care of her. She’d hit them, she’d scratch them. Most of them didn’t do more than a few shifts in a row with Rose before they’d take a break.”</p>\n\n<p>“Why didn’t they put her in a home or something?”</p>\n\n<p>“Do you know where the nearest home or asylum is to Pinehurst?” she asked before continuing, “It all culminated in one of the nurses getting killed. Her fingernails had gotten a little too long and went a little too deep. This was before cellphones, they didn’t have constant contact. Her agency assumed everything was business as normal. Rose was alone with the body for a few days, as that was the nurse who was scheduled for that block. When the next nurse came a couple days later, she found Rose gnawing at the flesh.”</p>\n\n<p>“SHE FUCKING ATE HER?!” I screamed, clearly too drawn into the story now.</p>\n\n<p>“Not so loud, she’ll hear you,” she said with a wink, “She attacked the second nurse as she called the police. She fended her off, but Rose fell and hit her head. Ever since, people in Pinehurst say they see her looking out of the windows, watching her neighbors and admiring her garden. If she catches you in her house, tho--”</p>\n\n<p>“It’s our house! We live here!” I cried.</p>\n\n<p>“She’ll make you feel every bit of emotion you’ve ever felt. It call comes racing into the forefront of your mind, paralyzing you. Then, she feasts again.” she growled that last part with a grimace.</p>\n\n<p>“How do they know what happens if she eats you?” I asked, with a jarring clarity.</p>\n\n<p>“Maybe one kid saw it happen to another and escaped while she was tearing into his friend?” she mused.</p>\n\n<p>“Why are you so into this stuff?” I asked, honestly curious.</p>\n\n<p>“Well, I always loved ghosts and scary shit,” she admitted, “but when we were kids, I dared my brother Mikey to break in here.”</p>\n\n<p>“I haven’t met your brother yet?” I asked, a little hurt.</p>\n\n<p>“He… uh… well…”</p>\n\n<p>She was struggling to find the words. It looked like every time she found one, it got caught in her throat and fell back down to her darkest depths. I hugged her and shushed her. </p>\n\n<p>“You can tell me when it’s time.” I assured her, she nodded into my neck.</p>\n\n<p>Night after night we stayed up into the wee hours of the night, vigilant until dawn broke. I didn’t believe in Rose. Ghosts were for campfire stories. Even still, I was sucked in by the energy that she threw towards trying to show me what she absolutely knew. One night, she was positive we’d found Rose. There was a rustling outside, we charged out like warriors. The raccoon rummaging through the flower beds was more of a warrior than we. </p>\n\n<p>“Laaaauraaaa…” I heard Johnnie’s voice call out to me from the darkness.</p>\n\n<p>Our wide eyes locked. Johnnie mouthed “What the fuck?” to me. </p>\n\n<p>“Laaauraaaa...” the words drifted through the night air a second time. </p>\n\n<p>It felt like it was coming from the house or the backyard. She gripped my hand with white knuckles as we bolted into the house. She held the door open for me and locked it as soon as we were both inside.</p>\n\n<p>Once we were inside, Johnnie’s terror had transformed into bliss, she grabbed my arms and gave me a shake with an excited scream. Mine had not.</p>\n\n<p>“She called for you!” she squealed and jumped up and down, “I told you she was real!”</p>\n\n<p>“Why did it sound like you?” I asked, my voice cracking.</p>\n\n<p>“She’s trying to luuuure you!” she cackled.</p>\n\n<p>I sat there on the couch and stared at the floor. </p>\n\n<p>“C’mon!” she tugged me by the arm, “Let’s go find out who it was. Ghosts, aren’t real, right?”</p>\n\n<p>I shook myself and jumped up with her, of course she was right. Ghosts aren’t real, they’re just stories to scare kids like Santa or Barbara Streisand. We crept through the house. Just my mom in the office, she assured us it wasn’t her that was calling for me, nor did she hear anyone calling my name. We swept the backyard with a flashlight we keep for walking our dog at night. Nothing. We spent the rest of the night watching movies. I don’t think you could have pried me off of Johnnie with a crowbar that night.</p>\n\n<p>The ghost hunts chilled out, even as fall moved in and Halloween was upon us. No more voices, not even false alarms. We ate lunch every weekend back in our secret grotto. The buds grew bigger, but never blossomed, even into October. I tried a few times to find out what kind of flower it was, but it certainly wasn’t native to North America. </p>\n\n<p>For Halloween we were attending a party at a friend&#39;s house. Johnnie had ran home to pick up a few accessories for her costume. I was finishing up my make up, Raggedy Anne to go with my curly red hair, and heard Johnnie call my name from down the hall.</p>\n\n<p>“I&#39;m in the hall bathroom!” I bellowed down the hall.</p>\n\n<p>No one answered for a few minutes. I finished painting my face before I went looking for Johnnie. I called out for her from the top of the steps.</p>\n\n<p>“Johnnie!” echoed back up the staircase.</p>\n\n<p>I froze, I couldn’t figure register who the voice belonged to. It rang out again, calling for Johnnie. Simply hearing the voice made me queasy, it was so familiar, yet alien. </p>\n\n<p>“Laura? I just got here, what&#39;s up?” Johnnie’s voiced called out.</p>\n\n<p>“Oh Jesus.” I said into my hand.</p>\n\n<p>Frozen at the top of the stairs, I stared down at the landing. Then, Johnnie appeared at the bottom. I pointed to my chest and shook my head. She motioned for me to come with her. I scrambled down to her. She kept her calm and ushered me to the Halloween party. Even under thick make up, more than a few people said I looked like I’d seen a ghost. </p>\n\n<p>“I’ve never <em>seen</em> a ghost,” I assured them.</p>\n\n<p>We tried to avoid being in the house after that. We crashed at the Halloween party that night. I felt safer with Johnnie with me. Looking back, the voices were unnerving, but they didn’t feel malicious. </p>\n\n<p>Thanksgiving was coming up fast. Pinehurst was bathed in oranges, browns and gold. Except for the little alcove behind my house. The trees were thick enough to hide it, but that immediate area stayed green. One of the blooms was swollen, the green casing stretched thing with the petals inside pressing outward. I watched it blossom a few days before Thanksgiving. Johnnie had went on a store run and I was still avoiding being in the house by myself. It unfolded delicately in a plume of red, each petal waving into place. The flower itself was a dull beige oval after the first couple of layers of red. Closer inspection revealed another oddity; it had three stamen instead of the usual one. Two on the top semi close to each other, and one farther down, a little larger than the other two.</p>\n\n<p>My phone buzzed in my pocket. Johnnie was back. I helped her get the things for Thanksgiving put away. Then, I told her that the bush in the back had bloomed, and about it’s peculiar hue and anatomy. Naturally I took her to see the rarity in our backyard. She loved weird. When we breached the woods into the clearing, her joking stopped when she saw the bloom.</p>\n\n<p>“What the fuck?” she screamed, running to the plant. </p>\n\n<p>The beige petals of the bloom had folded and laid across each other. It was a face. A young boy that looked strikingly like Johnnie. My heart sank. She cradled the bloom in her hand, her eyes were already swollen and red with tears. She looked to me with eyes that crushed my soul. I dropped to my knees next to her, embracing her. </p>\n\n<p>“It looks like Mikey” she she mumbled, “it… it looks like Mikey...”</p>\n\n<p>“Who?” </p>\n\n<p>“It looks like Mikey,” she reiterated, “It. Looks. Like. Mikey.”</p>\n\n<p>“Johnnie, who is Mikey?” I pushed.</p>\n\n<p>“He - My - He went -” she sputtered, “My brother who went missing.” </p>\n\n<p>She’d mentioned a missing brother, but never a name or shown a picture. I always assumed she was too young when he went missing to have remembered much of him. Maybe she had been, and that flower brought it all raging back. The petals wiggled. Writhed? I don’t really know what to call it, but his--it’s? mouth started opening and closing, like a guppy gasping at the water. We both tumbled back into the dirt, Johnnie shaking in my arms. I could scarcely pull my attention from the monstrousity to notice the sunlight being devoured by the encroaching shadows. </p>\n\n<p>“Wuh… wuh…” the flower wheezed.</p>\n\n<p>I started shooting back towards the house, adrenaline giving me the ability to drag a paralyzed and hysterical Johnnie backwards. Until we hit a wall of thicket. I drug us both to our feet and surveyed the area. We were surrounded. I couldn&#39;t see the house. The woody vegetation stretched up into the tree tops and tangled until I couldn&#39;t see the sun or clouds. Everywhere I looked was obscured by branches and brambles.</p>\n\n<p>“Why… why…?” it moaned. </p>\n\n<p>Johnnie went limp in my arms. I couldn’t hold her dead weight, I couldn’t do much but slow her crumpling to the ground. There was a thorny tendril creeping towards her. </p>\n\n<p>“Why did you let me?” It groaned at her unconscious body.</p>\n\n<p>I stomped and kicked the vine. It wouldn&#39;t be dissuaded from it&#39;s pursuit. I grabbed it. I yanked and jerked on it, I tried to pull it in the opposite direction, despite the thorns cutting my palms. I screamed her name until I was hoarse. She wouldn&#39;t stir no matter how loud I screamed. </p>\n\n<p>Another blossom unfurled in front of me. Johnnie. It was Johnnie staring at me through the brilliantly colored petals. I stood there in awe. Then I felt everything. Literally every thought, every feeling I&#39;d ever had about Johnnie surged through me. It was beautiful, it was horrifying, it left me on my knees with tears streaming down my cheeks. I couldn’t find the strength to move a single muscle.</p>\n\n<p>I forced my eyes shut. I refused to acknowledge it even existed. I knew she was on the other side of the bush. I rose to my feet, I was weak and shaking, but I made it. I looked away from the shrub. The vines had wrapped around her ankles and were inching her through the packed dirt towards its base. I wobbled and stumbled towards her, keeping a wide breadth from that thing.  I tried to snap the vine, but now it was thicker, heavier. It was like trying to sway a steel cable from its anchor. </p>\n\n<p>It felt like everything went black. That moment of struggle made me absolutely know what “drowning in sorrow” felt like. I distinctly remember the ground tearing open, like a little Hollywood earthquake. The roots twisted and writhed, covered in white thorns and hooks. I grabbed a long stick and jammed it into the gnarled mass of roots. It recoiled, just long enough for me to drag Johnnie back away from it. I found a small gap in the twisted wood that had walled us in with it, I managed to squeeze through then pull her through behind me.  </p>\n\n<p>I screamed her name as I inched her limp body down the trail towards the house. I remembered it as just a short walk, but now it was miles. Eventually I had to stop. I couldn’t drag on any further, I propped her up against a tree and sat next to her. It was quiet. No rustling, no voices. She started to come to as I layed in the dirt.</p>\n\n<p>“Mikey?” she mumbled with drowsiness clouding her mind. Then her eyes shot open and she punched my shoulder, “Mikey?! Where the fuck did he go?”</p>\n\n<p>I shook my head, “That was just the roses, Johnnie. It was trying to drag you into its roots.”</p>\n\n<p>“How did it know?” she started sobbing, “Did it get him?”</p>\n\n<p>“I- I don’t know. It showed me your face.” </p>\n\n<p>I ushered her back to the house. She wept and wept. I cried with her. What was happening at my backdoor didn’t dawn on me until we were on top of it. The two rose bushes that flanked the door were no longer dormant. Lush and green, their branches were drooping with heavy buds. </p>\n\n<p>“Noo..no no no” I stammered, supporting some of Johnnies weight.</p>\n\n<p>“What now?”</p>\n\n<p>The plant on the left’s bloom unfurled. A small forehead, slightly pointy nose and thin lips folded out of the delicate petals. The one on the right a strong jawline, wide nose, deep set eyes. Mom. Dad. The petals annealed together, forming perfect replicas of my parents right down to their skin tone.</p>\n\n<p>“Giiiirls,” my mom’s voice cracked, “It’s time for supper!”</p>\n\n<p>My dad’s voice cackled and carried through our yard. I’d never heard him sound like that before. It was his voice, but it was not my father. I clutched Johnnie close.</p>\n\n<p>“C’mon, girls!” his voice called out, “Help me with the flower beds!”</p>\n\n<p>“Laura! Johnnie!” my mother’s voice followed up, “Come look at these beautiful roses!”</p>\n\n<p>Johnnie stood on her own. I could see the exhaustion, the same that was starting to weigh me down. Whatever that thing was, it’d taken too much. Too much from me, too much from Johnnie, too much from everyone who’d ever found it. I ran for the shed that my dad put back by the woods. The gas can for the lawn mower was full. </p>\n\n<p>“Girls! We found what you&#39;ve been hiding!” My father&#39;s words mocking, drenched in sarcasm.</p>\n\n<p>“You shouldn&#39;t have dared me to go!” a small voice I didn&#39;t recognize called out.</p>\n\n<p>Johnnie looked like she&#39;d been punched in the gut. She clenched my arm tight enough to cut off circulation. I shook my head to her. “It’s not him, not anymore, anyway…” </p>\n\n<p>She swallowed it all. We trudged on. It whipped at us with stray vines, the trail was even longer than it was mere moments ago. Each sharp lash drove away Johnnie’s sorrow. We grew more resolute that this had to be solved tonight. I lugged it back to the clearing as fast as I could. The living walls had retreated, the ground was still open, the tangle of roots gnashing in the void of soil.</p>\n\n<p>“Come join us all down here!” a legion of voices echoed from the pit.</p>\n\n<p>I unscrewed the nozzle and threw the metal gas can in. The hungry roots shredded it into ribbons. Johnnie lit the trail of gas with a lighter she always carried with her. The fire shot into the hole, then erupted out like a volcano. We were surrounded by pained wails, I could see faces hanging from the plant, screaming as they burned. I could hear Mikey’s voice, Mom’s, and Dad’s too amongst the cacophony of the lost. I heard my voice and Johnnies voice distinctly, along with an innumerable mix of others. We watched it burn. </p>\n\n<p>The path back to the house was short again. There were sirens coming towards us. The house was on fire, plants around the house were also ablaze. They must have been connected through the roots. We met the firemen in the front yard. They heard the painful wails too, but never found the living people they thought they were going to find. Neither us, nor the firemen were prepared for what we found in the tree in the front yard.</p>\n\n<p>My mom and dad were both in that tree. Crucified by a thick tangle of now burning vines. The vines were bursting through their skin, coming out of their mouths. Terror and confusion were permanently sculpted on their faces. I broke down. Johnnie held it together for me in the moment, and broke down with me again later at her house. The flames burned for days. When everything was done, bones started popping up. In all the places that were previously plants. They identified Johnnie’s brother based on dental records, he’d gotten caught up in the old green house in the backyard.</p>\n\n<p>I moved in with Johnnie and her parents, I helped them with arrangements, and they helped me. Next year we’ll hopefully be roommates at the same college. I can’t say it’s been easy without my parents. I love Johnnie and her family, but it’s still a void that I know will never be filled. It’s hard to know that my Dad will never have the chance to walk me down the aisle, or that we’ll never get to see Mikey graduate. Johnnie never got a chance to try Mom’s world famous banana bread. The only real solace either of us gets is that maybe, when we burned that thing, we set them all free somehow.</p>\n\n<p><a href=\"http://facebook.com/MMKelleyWrites\">M.M.K.</a></p>\n</div>\n","author":"MMKelley"}