{"rank":"1","title":"Person at the window","id":"8lz1b2","url":"/r/nosleep/comments/8lz1b2/person_at_the_window/","time":"1527222537000","body":"<div class=\"md\"><p>In this story the events are all true I will not be disclosing names like most of the story&#39;s on here I also should mention its the middle of winter in northern Canada where I live 10 minutes out of town with a couple of surrounding houses probably a short run away</p>\n\n<p>I was 14 maybe 15 at the time it was a Friday after school and like most Fridays I would normally invite a friend out (Andy) and so this particular Friday unlike most. Andy and I were left home alone we normally stay up till 1 or 2 in the morning playing video games he is always the first one to go to sleep, so after he falls asleep while hes stuck snoring away in my bed I&#39;m lying there with my small laptop beside me just watching a tv show. My curtains were wide open at the time and my body was facing it on my side when all of a sudden I here a loud knock at the window and in the blink of an eye my laptop was closed pushed up under my pillow me staring at the window, but there was nothing there oddly enough it took me maybe 5-10 minutes to overcome my fear and move to take a look. I take a peek out my window and see foot prints leading around to the other window. Me as my curiosity peaks I decide to leave my bedroom and in my living room there is a large glass window.</p>\n\n<p>I wish I never saw what I did but staring at me through the window were these to Abnormally large eyes staring at me the eyes are as wide as possible seeing no emotion in them I have locked eye contact for about 1 minute when the figure knocks on the window three times with a tilt in its head. I quickly run over to the door and lock every single one in my house then I run back to my room and wake up Andy up and he gets up only to see the figure through the open door and says under his breath &quot;what the fuck is that&quot; I respond &quot;I don&#39;t have time to explain just get up and call 911&quot; I quickly run towards the kitchen where the thing is now knocking on the door and I grab something as the knocking turns to smashing on the door. With the door sounding like its about to break it ceases. 5 minutes pass and my dog starts barking from the garage. &quot;SHIT&quot; I yell &quot;what is it&quot; Andy responds The doggy door in the garage he probably crawled through&quot; &quot;oh fuck, that&#39;s bad&quot; &quot;no shit.&quot; we both rush over towards the garage door and yank it open he standing in the middle of the garage with his jaws clenched around my dogs neck.The dogs eyes staring at me with this lifeless look which I have only see a couple times in my life like when my grandpa died next to me at the hospital or the bird that was lying in the field. I get yanked back by Andy, snapping me out of that trend as Andy then slams the door shut and locks it, with the tears welling up in my eyes remembering all the memories I have of me and my dog.</p>\n\n<p>I start to hear sirens in the distance then there&#39;s some shuffling in the garage and then dead silence. As the cops arrive I quickly calmed down knowing that fucker must be long gone by now, the cops ask a lot of questions then my parents show up hours later rushing home after they got a call from the cops squeezing me tight in their arms. They then explain the situation and the cops go peaking around oddly seeing now footprints in the snow anywhere around the house</p>\n\n<p>I am currently 25 now and to this day I still remember the white eyes staring at me and am so thankful that I had a friend on that day me and Andy are still best friends but we rarely talk about but when he mentions it he turns it into a joke by saying he saved my life which he kind of did by pulling me back inside.</p>\n\n<p>Thanks for reading.</p>\n</div>\n","author":"DiablosMuchacho"}