{"rank":"8","title":"Interesting Accounts of a old mid west Town","id":"8lz3gh","url":"/r/nosleep/comments/8lz3gh/interesting_accounts_of_a_old_mid_west_town/","time":"1527223211000","body":"<div class=\"md\"><p>In the early 1900’s, out in the wilderness of the mid west, laid a small town. It was apparently positioned in a valley, where many mountains overlooked the spot of civilization that stained the wilderness. Few records of the town have ever been recorded, with the most recent dating in 1929. Many historians have speculated about the anomaly that was the town, with many dismissing its existence entirely, stating that there are too many inconsistency’s with eyewitness’s stories. Nevertheless, a few travelers claimed to have passed by or seen the town. </p>\n\n<p>Joseph Dale</p>\n\n<p>The story that Joseph had to tell was passed on through the years by his family. His first experience with the town occurred around 1889, when traveling through what was most likely Wyoming. Joeseph recounted that after his third day of trekking through the wilderness, he rounded a large hill, and his gaze fell upon a small settlement that began at the bottom of the hill. He estimated that he was around 600 feet away, and could see all the individual buildings and structures. Many eyewitness accounts dispute what actually made up the settlement, but Joseph described it as a few dozen small buildings surrounding a tall wooden church in the middle of the town, with a gleaming bell sitting atop it. No people were to be seen and Joseph was tight on time, so he made a mental note check the place out at a later date.</p>\n\n<p>Mary Collins</p>\n\n<p>Mary Collins was a ten year old traveling with her family across the country in the summer of 1901. Allegedly, they wanted to take a break for a picnic after several hours of traveling, so the walked a little ways off the trail and over a large hill to see the sunset. After rounding the peak, they were surprised to see a small town sitting in the middle of a meadow. The girl said that all of a sudden, her parents seemed very uncomfortable and kept fidgeting with all of their stuff. In fact, while this girl was completely enthralled with the idea of finding a new playmate, her parents decided to just get up and leave.’</p>\n\n<p>Hank Filler</p>\n\n<p>Mr. Filler was a elderly man who owned a property only a few miles from the alleged location of this town, and was therefore also relatively isolated. In fact, the only times he really saw another person was to make the 30 minute drive down to another town to get groceries and the like. Hank reported that on one hot summer day in the year of 1903, while sitting on his porch, a young man came sprinting down the dirt road through the meadow to his house. As the man got closer to the property, he could see the sweat and dark grime clinging to his skin, as well as the distinct look of fear on the mans face. The man was nearly touching the steps. Hank called out to the man, and asked him what in gods name he was doing. The man dropped to his knees, and started blabbering on about something that was looking for him. </p>\n\n<p>Hank recalled how the man told him he was hunting in an area not far from Hanks house, when he rounded a rocky hill and saw the town about a quarter mile away. He described it as having many wooden buildings surrounding a large wooden church, just like the other descriptions. However, unlike<br/>\nthe previous travelers, the man felt an “otherworldly” aura overtake him. He became very paranoid, and kept glancing around him and back to the town. In the mans own words, “it felt like the town had eyes. Like I could feel it gazing at me.” The man began to be aware of a trudging, growing closer and closer to him. The man described that as the heavy footsteps approached from over a small hill, everything grew very quiet. Unconsciously backing up, the man glanced a rock. There was a short pause, broken by fast light footsteps. It sounded strange, and the man was pretty sure that whatever it was, it had dropped to all fours and was crawling with exceptional speed. The man took off in the opposite direction and just kept running.</p>\n\n<p>Hank was fairly certain by now that he had had a run in with a curious grizzly bear, but was sympathetic and offered the man a place to stay the night. The man gratefully accepted, and not long after, they were both asleep. Later that night, Hank was awoken to the sound of quiet commotion come from the bottom floor of his house. He immediately checked the mans room and found it empty. Hank thought the man was simply, getting something to eat and was about to take his first step on the stairs when he hesitated. The unmistakable sound of a death rattle echoed up from the pit of the first floor. Hank mentioned “if you’ve never heard a death rattle, it’s a horrible wail of sadness and pain that is made when a person is on the verge of dying.” Hank, hearing this, suddenly became much more aware, and he listened intently as quiet tiptoes moved through the hallway and out the open door. Hank, too terrified to go down and discover the fate of his new acquaintance, locked himself in his room until the morning. The next morning when the sun was already high in the sky, Hank cautiously made his way to the kitchen to find nothing but a broken glass. “Never did ask the name of the fella.” Hank later stated</p>\n\n<p>A few days after Hank called for the authorities, a few cops with a detective made their way out to the house to try and figure just what had happened that day. Finding no significant evidence in Hanks house, the detective asked Hank what direction the man came from. Hank pointed past the meadow and over the hills, so the group made their way out there. Unfortunately for Hank, he had also put himself under suspicion and was left at the house with an officer. Around 2 hours later, Hank saw the detective and the other officers with him making their way back to his house. Eager to know if he was going to be in any legal trouble, he was caught off guard when the immediately took the cuffs off him and told him that they would be bringing more people out to investigate. Utterly confused at the newfound importance of some nobody that had just happened to disappear, Hank asked the detective if they had found anything. The detective, then reluctantly pulled a photo out of his satchel. There in the dirt, were hand and feet marks. It looked like whoever had made them, had scraped his hands and feet along the dirt before putting its full weight on it. Confused with the elongation of each foot and hand print, the detective explained that although not exact, they had calculated that whatever was making those marks was moving at around 30 miles per hour. “Lock your doors, and tell us if anything else happens.” Said the detective as they were getting ready to leave. “In the meantime, we will take this evidence back to the station and see what the chief has to make of it.”</p>\n\n<p>More stories are just being uncovered about these strange occurrences, and I will be sure to pass on whatever more I find out. </p>\n</div>\n","author":"--cole--"}