{"rank":"2","title":"Wait.. What?","id":"8lz47p","url":"/r/nosleep/comments/8lz47p/wait_what/","time":"1527223449000","body":"<div class=\"md\"><p>Even 16 years on, merely thinking about this experience makes the hair on my neck stand on end. It&#39;s only the second time in my life I&#39;ve shared this experience so without further ado, let me tell you why... I get No Sleep.</p>\n\n<p>Let me paint a picture for you, a picture of my 10 year old self and my 15 year old brother, Joe. We lived with our Mother in a town called Sulphur Creek, it&#39;s located on the North West coast of Tasmania, Australia and we were die hard fans of the sport known more commonly around the world as Aussie Rules Football. Every day after school and all day every weekend was spent kicking the football back and forth, trying to kick goals from impossible angles down the street and other times just trying to see how far we could kick it. One goal was between a fence post and concrete slab on the grass just before our next door neighbours driveway and the other was the driveway of the neighbours across the street. </p>\n\n<p>Now the neighbours house across the street was a 2 story Bed and Breakfast, small with only 5 rooms but it is a lovely place to stay with the master suite having a large window that had a lovely view of the ocean that was not even 30 paces across the main road and the owners, Brad and Kelly were lovely people and we knew them well, so well in fact that every now and then I would collect firewood for them from the pile outside and take it inside to it&#39;s place beside the fireplace for 5 bucks, my mother would also clean for them from time to time or even stay over there to make sure the guests were checked in and out if Brad and Kelly were going to be away for the night and Joe and I would stay over on these nights as well.</p>\n\n<p>One particular night, however, was different. The only internet available to us in 2002 was dial-up and Brad and Kelly didn&#39;t have a TV. It was getting late, about 8pm and pitch black outside with a beautiful full moon glistening across the waves of ocean but Joe and I were bored out of our minds so we did what all kids do when we were bored, we played hide and seek. Joe was a master of it, he would always know where I was hiding and if he was hiding he&#39;d be able to keep an eye on me and change his hiding spot when I wasn&#39;t looking but one night I&#39;d had enough, I&#39;d spent 30 minutes looking for him already and was getting quite upset. </p>\n\n<p>Then, out of the corner of my eye, in the master bedroom with the large window I caught a glimpse of a figure run in front of the window. The only light in that room was the moonlight that was piercing through the window, my plan was to sneak in, flick the light on and scare the shit out of him as pay back for making me look for him for so long.\nI crouch down and sneak in through the door, and I hear a rustle on my left from that alone I knew he had gone into the big walk in wardrobe and smile had made its way across my face. &quot;Got you now bitch&quot; I thought to myself. I reach the end of the bed and turn left, now I just have to sneak up to the wardrobe, it&#39;s only 10 more steps in front of me. 9 more steps. 8 more steps. 7. 6.. 5... 4... 3...\nAnd as i was about to stand up, flick the light on and let the wrath of my 10 year old anger flow down upon my brother I felt him brush past me and I knew all I had to do was tackle him on to the bed behind and I win.\nI leapt for glory, wrapping my arms around him and falling backwards I throw his ass on the bed. I make my way on top of him and start tickling him, something I knew he would hate and I knew I couldn&#39;t get in trouble for. Hearing his girlish giggles made me laugh at the victory I had just waited so long for ...</p>\n\n<p>The light suddenly turned on in the room ... and with that blinded, eye adjusting to the light face i look at the open door ...</p>\n\n<p>&quot;Dave, what are you doing? Get off the fuckin&#39; bed, Mum&#39;s going to kill you&quot;.</p>\n\n<p>It was Joe. I look at the bed, I look at him ...</p>\n\n<p>&quot;Wait ... what?&quot;</p>\n\n<hr/>\n\n<p>Now this is my first ever story, I was unsure if I was going to share this but I hope you enjoyed. I&#39;d like to finish it off with saying that the people in this were real but the names were fictional and this was a personal experience of mine, however I didn&#39;t throw him on the bed and tickle him, I ran into the walk in wardrobe, flicked on the light and screamed but no one was there and then my brother was in the door of the bedroom wondering what i was doing. I changed the ending for more intensity to the story but I definitely saw the figure run across the bedroom window and I have never gone back to that Bed and Breakfast again. Writing this story was hard, thinking of it again in detail has got my hands shaking but I have plenty more real life experiences just like this to share. So let me know what you think and what I could improve on so I can share more with you. Have a good one and sleep well ;)</p>\n</div>\n","author":"sabretooth1992"}