{"rank":"31","title":"The Kovacs-Mendez Tape","id":"8lzmwm","url":"/r/nosleep/comments/8lzmwm/the_kovacsmendez_tape/","time":"1527229730000","body":"<div class=\"md\"><p>Nobody knows exactly where the tape came from, but it’s widely believed among the internet community to have been found it on a dusty book shelf in a thrift shop, or at least that’s the most popular variation of the story. The tape was one of those micro-cassettes, the kind that requires an adapter-tape in order to play in a VCR, and the footage it contained could have quite easily been lost forever if somebody who stumbled across it hadn’t been fairly competent in the field of audio-visual technology. In the description provided by the original user who uploaded it to YouTube, they had a great deal of trouble converting it from VHS to .mkv. But that is not where its mystery lies, for the video was deleted a month later for no apparent reason, and the original user who uploaded it has since gone silent. It still gets reuploaded once in a while, sometimes in its entirety, sometimes in fragments, but it’s always deleted again soon afterward, and the user who reuploaded it always vanishes alongside it. However, and to be quite honest with y’all, I find the suppressed footage of the abandon house and the failed experiment that was conducted there absolutely fascinating, to such a great extent that despite the fact that I do not possess a digital copy of the tape, I have created a manuscript in which the tape is described in complete detail. I have no idea who the clandestine agency trying to keep a lid on it is yet, but they don’t seem too concerned about the tape being circulated in the form of a written narrative.</p>\n\n<p>The tape begins on a path in the woods with sunlight slanting through the leaves overheard. The sun has either yet to pass its noon meridian or the hour has recently passed into the afternoon hours. The underbrush boarding the path is thick and green and almost completely obscures the faint traces of civilization sometimes glimpsed beyond the trees. Two teenagers are walking ahead of the person holding the camera, a boy and a girl. The boy is a tall youth with dark hair of about sixteen. From the way he occasionally glances back over his shoulder, he gives off the air of a competent young woodsman with a friendly disposition. The girl is a pretty redhead of about fourteen. Her mannerisms suggest a crush on the older boy. The camera is handed off to the dark-haired boy at one point and the face of the boy who holds the camera most of the time can be seen briefly for a moment before he walks a few paces from the path to take a leak. He is about the same age as the dark-haired boy. But he has the same fiery red hair as the younger girl tagging along with them. His face bears enough resemblance to the girl’s that most people immediately assume that he is her older brother. This has since been confirmed.</p>\n\n<p>When the redheaded boy returns, the camera is passed back to him. He centers it on the redheaded girl’s face.</p>\n\n<p>“Are you nervous, Julia?” he asks.</p>\n\n<p>“No,” she says. Her face says different.</p>\n\n<p>“Good,” he says. “Cause we’re almost there.” He moves the camera to the dark-haired boy’s face. “Right, Steve?”</p>\n\n<p>“Yeah, the house is on the right. Right after we cross the stream.”\nJulia: “Stream?” </p>\n\n<p>Steve: “Don’t worry. It’s wide but it’s not deep. You’ll be okay.”</p>\n\n<p>Julia looks doubtful.</p>\n\n<p>They reach the stream a few minutes later, and it’s exactly the way Steve described it, wide and shallow. They stop, take off their socks and shoes and roll up the pant legs of their jeans to the knees, and cross it without incident. A good look at their faces can be gained during this time, including a second—more through—glimpse of the boy holding the camera.</p>\n\n<p>A screen capture of each of the three faces and a search of the database of missing persons by state reveals their names to be Julia Kovacs, age 14; William “Bill” Kovacs, age 16; and Steven “Steve” Mendez, age 16; All three of them are listed as residents of North Carolina, would’ve graduated from the same high school, and were reported missing in the early spring of 1999. </p>\n\n<p>Now, after a few more minutes of banter among the trio, Steve leads them away from the path deep into the foliage. They emerge from the woods on a narrow gravel road that runs parallel to woods. They a few dilapidated houses in which the trees press close to the boarded up windows and doors. They stop at the fourth house on the left, and the camera zooms in on the sign posted on the front door of the abandon house that stands before them. The faded black letters set against the white are difficult but not impossible to read:</p>\n\n<p>&nbsp;</p>\n\n<p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;PROPERTY OF PGS4<br/>\n&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<strong>NO TRESSPASSING</strong></p>\n\n<p>&nbsp;</p>\n\n<p>They linger out front for a few minutes. The building owned by PGS4 looks just as abandon as the rest of the houses on the street. The camera pans from the sign up to the boarded-up windows and then down the street back to the way they came. It comes to a rest on Steve. Steve runs a hand through his dark hair and grins.</p>\n\n<p>“I told you, Bill,” he said.</p>\n\n<p>“Yeah,” Bill says from behind the camera. “You were right, Steve. It doesn’t make sense. According to GoogleMaps there are fourteen abandon houses on this road. Yet the PGS4 sign is only on this one.”</p>\n\n<p>“But why’d they only post it on this house?” Julia asks.</p>\n\n<p>“That’s what we want to know,” Steve said.</p>\n\n<p>“And what does PGS4 stand for, anyway?” Julia asks.</p>\n\n<p>Steve glances at the camera and shrugs. “I don’t know. But I reckon whatever is in there might explain some of the weird incidents that happened in town last year.”</p>\n\n<p>It is unknown which town the teenagers are discussing, although it has been suggested by a seasoned cartographer that the town may not or may no longer exist on modern maps. Any official record of PGS4’s existence has yet to be confirmed, although several sources I’ve spoken with claim PGS4 was a paper company that went out of business in 1979, which also has still yet to be confirmed. Other, less constrained sources, believe the acronym PGS4 stands for the fourth iteration of Project Ghost Storm, a mythical government experiment rumored to have been conducted in the wake of MK-ULTRA. However, unlike MK-ULTRA, the government has never officially acknowledged the existence of Project Ghost Storm. There are rumors, yes. But even conspiracy theorists have trouble reaching an agreement on exactly what the project was supposed to accomplish. Some claim it mentally tortured children with certain psychic talents. Others claim it was concerned with side effects of non-electric portals. My research remains incomplete. </p>\n\n<p>The trio approaches the house and tries the front door. It is locked. They make their way around the property to back of the house and try the back door. It is also locked. They eventually come to a stop below a shattered window that isn’t boarded up with plywood about ten feet away from the backdoor. It is about six feet off the ground. They survey this unlikely entrance with a certain air of professionalism that many other ghost hunters and urban explores have since tried and failed to emulate.</p>\n\n<p>Steven glances at the camera. “You know what I think?”</p>\n\n<p>“Yep,” Bill says, centering the camera on Julia.</p>\n\n<p>“Now ya’ll just wait a minute.”</p>\n\n<p>“C’mon, Julia,” Steve says. “You’re the lightest.”</p>\n\n<p>“Yeah, we’ll give you a boast—”</p>\n\n<p>Julia sighs, already resigning to their plan.</p>\n\n<p>“—and then you can unlock the backdoor and let us inside.”</p>\n\n<p>Julia blew a stand of red hair out of her face. “Fine.” </p>\n\n<p>The camera is set in the grass. Three sets of sneakers are visible for a moment. Then a set of laced fingers appears, the girl sets a foot on them, and then the boys lifted her up out of the frame. Once they are finished, Bill retrieves the camera</p>\n\n<p>“This bathroom is disgusting,” Julia says from above.</p>\n\n<p>“Great,” Bill says. “Here, Julia. Now take the camera and go open the backdoor.” He hands the camera up to Julia. She takes it, and the two boys below are seen upside down for a moment, as she hauls it into the window and the disgusting bathroom beyond.</p>\n\n<p>The bathroom is dim and would be dark if not for the daylight slanting through the window. Julia pans the camera about the scene with a certain lack of the smooth motion that comes so naturally to Bill. There are leaves scattered about the tiled floor and drifting on the placid surface of the bathtub, which is full of stagnant, foul-smelling water. The mirror is shattered. Fragments of it lay gleaming in the sink. Julia does not get a good shot of the toilet but she does lift the lid and swear under her breath in a manner that is quite unbecoming for a young lady of her age. </p>\n\n<p>The door to the dark hall beyond the hall is open. There are more leaves and trash heaped about the floor. Julia makes her way quickly through the hall to the kitchen. For a moment the screen is dark, save for a few rectangles of light that come from where the kitchen windows have been boarded up with plywood. They are the only way to mark Julia’s progress as she traverses the darkness. Her breathing and footsteps can be heard. Both are slow and steadily paced. Then the sound of a deadbolt turning can be heard, a door swings open, and Steven and Bill are seen standing there, framed by a rectangle of perfect blue sky behind them.</p>\n\n<p>“It sure took you long enough,” Bill says.</p>\n\n<p>“I couldn’t see.”</p>\n\n<p>“There’s a light on the camera.”</p>\n\n<p>“Oh,” Julia says, handing it back to him. Bill centers the camera on Steve. Steve withdraws a small flashlight from his back pocket, switches it on, and plays the beam across the kitchen. When the camera catches another view of Julia’s face, it should be noted that she seems particularly annoyed by the ease in which the two boys banish the darkness. </p>\n\n<p>The kitchen is a lot the bathroom, save for the fact that nature has not yet began to reclaim it. The appliances are greasy, rusted, and filthy. The kitchen table is bare. A few of the tiles are cracked. Bill toggles a light switch back and forth a few times but the room stays drowned in the darkness.</p>\n\n<p>Steve leads them from the kitchen into the living room. It appears at first to be a completely normal living room. There is a couch set against one wall and a television set against another. There are even a few framed photographs on the walls.</p>\n\n<p>“What do you think, Julia?” Steve asks.</p>\n\n<p>She is staring intently at one of the photographs. “I think these are those photographs that come in the frame when you buy them from Wal-Mart or Target. Do you know what I mean? It’s like somebody just bought them and hung them up in there so that everything would look normal.”</p>\n\n<p>The camera moves from a photograph of a smiling white elderly couple standing in front of a small yacht to a photograph of a biracial mother and father and their two youngins standing on a beach. There is also a photograph of a blonde-headed girl flying a kite in an open meadow and a black guy getting a haircut in a very happening barbershop. Other photographs included a number of landmarks: the Golden Gate Bridge, the Statue of Liberty, and Grand Central Station.</p>\n\n<p>“Yeah,” Steve says. “These pictures are kind of weird.”</p>\n\n<p>“Let’s check out the rest of the house,” Bill says.</p>\n\n<p>Julia nods in agreement.</p>\n\n<p>They leave the living room. The circular oval cast by the camera and the flashlight give them plenty of light to find their way.</p>\n\n<p>But I think the three teenagers failed to make an important connection while they were in the living room, a connection in which electric light cannot illuminate, for a faint connection to transportation can be glimpsed in each of the photographs if the viewer takes the time to analyze each photograph shown on the tape in detail. Taxicabs can be seen outside the window in the background of the barbershop photograph, and ships can be seen in the background of both the yacht and the beach photographs. The kite is a symbol our childhood desire fly and the string is our anchor to reality. But, the landscapes are more important than the people, for they are all obviously gateways. </p>\n\n<p>In the downstairs office, they find several empty bookshelves and a desk. Office supplies are strewn all over the floor: pencils, pens, staplers, sticky notes, index cards, three-ring binders, calculators, manila folders, ink cartridges notebook paper, and a damaged computer printer. There is a lot of computer paper. Most of it is blank. But one sheet isn’t. Julia stoops to pick it up and Steve hold it up to the camera before he folds it in half twice and slips it into the back-left pocket of his jeans. It appears to be one of the middle pages of some kind of internal memorandum, and if it wasn’t for Bill’s steady hand, the writing might have been too blurry to read, but his hand holds the camera as steady as a surgeon with a scalpel.</p>\n\n<p>When I went through this part of the footage frame by frame, almost the entirely of the memorandum was rendered legible:</p>\n\n<p>&nbsp;</p>\n\n<p>pertaining to the containment of living test subjects. Those whom are beginning to show signs of either the desired effect or mental segmentation should be kept apart from the others. Both should be considered a threat to themselves and others. Subjects experiencing physical segmentation are not necessarily dangerous but should immediately be placed on life-support, for they may possess relevant information. Furthermore, oversight would like to remind all field operators that the test subjects must be kept under constant observation at all times. And oversight does mean at all times. Oversight would also like to stress the point that cross-reality contamination will result in the immediate quarantine of the experiment. If any personnel would like to ask any questions or voice and concerns regarding their responsibilities and/or the site security and/or standard operation procedure concerning the experiment, the oversight believes that now would be the time to address these issues. Nobody wants a repeat of what happened last month in South Carolina. </p>\n\n<p>&nbsp;</p>\n\n<p>What is <em>mental segmentation?</em>” Julia asks.</p>\n\n<p>“A complete and total breakdown of the mind,” Steve says.</p>\n\n<p>“It’s very different from physical segmentation,” Bill adds.</p>\n\n<p>“What do you think the <em>desired effect</em> is?” Julia asks.</p>\n\n<p>Steve shrugs. “That’s what I want to know. Thirty-one people allegedly died on this road over the last decade. And I bet they were victims of the desired effect.”</p>\n\n<p>“So it’s probably something awful,” Bill says.</p>\n\n<p>They discuss the memorandum among themselves for a few minutes. Then they set out to explore the rest the downstairs. \nThey find a bedroom full of tiny cages, and when they open the small closet in the bedroom, they find several large containers. Steve squats in front of them down and turns one of them so that the handwritten label is clearly readable by anybody watching the tape:</p>\n\n<p>&nbsp;</p>\n\n<p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<em>Formaldehyde</em></p>\n\n<p>&nbsp;</p>\n\n<p>The rest of them contain the same labeling. </p>\n\n<p>“I don’t think they were experimentin on livin creatures here,” Bill says. “I think they were all dead to begin with.”</p>\n\n<p>“Good,” Julia says. “No living creature deserves to live in a cage.”</p>\n\n<p>“This actually makes a ton of sense,” Steve says. “Think about it. There’s all this trash. But there isn’t any of the kind of food you ‘d feed animals.”</p>\n\n<p>But why would anybody conduct an experiment on dead animals? What is to be gained? These questions keep me awake at night. These questions are the reason why I obsess over this mysterious tape. Could the person—or persons—who once occupied the space between the walls of that house been on the edge of some kind of great scientific discovery or were they messing around with some dangerous aspect of the nature order they didn’t—and couldn’t—possibly understand?</p>\n\n<p>I wish I knew.</p>\n\n<p>But all I can do is relate the rest of the tape and the abhorrent end the three teenagers met.</p>\n\n<p>Now, the part where they venture upstairs is rather dull. They talk a lot and explore the bedrooms. There are two beds in each of the three bedrooms, for a total of six, and one of the mattresses is severely bloodstained. The trio spends a great deal of time discussing that discovery, not making any rash assumption and exploring are possible theories. However, I am content with the idea that one of the people experimenting on dead animals suffered some kind of undesirable side effect related to the experiments that were being conducted in the basement.</p>\n\n<p>In the basement, at the bottom on a long set of rickety wooden stairs, the trio examines what remains of the failed experiment. Neither Steve’s flashlight nor the light on the camera Bill in holding casts any light on the far wall of the room. The floor is concrete, the walls are concrete, the windows are barred, and the whole space is wide open and empty. Not a single thing remains, and yet the trio is able to make their way so deep into the darkness that eventually they are not able to see any of the walls.</p>\n\n<p>“How big do you think this place is?” Steve says. His voice resounds off the walls. <em>“. . . big do you think this place is . . .”</em></p>\n\n<p>“I don’t know,” Bill says.</p>\n\n<p><em>“. . . do you think this place is . . . places . . . places . . .”</em></p>\n\n<p>Bill pans the camera from Steve to Julia.</p>\n\n<p><em>“. . . don’t know . . . know . . . o  . . . o . . . o . . .”</em></p>\n\n<p>“It’s gotta be at least a hundred feet,” Julia says.</p>\n\n<p><em>“. . . hundred feet . . . feet . . .”</em></p>\n\n<p>The unseen concrete walls almost seem to twist her words.</p>\n\n<p><em>“. . . undead . . . feet . . . eat . . . eat . . .”</em></p>\n\n<p>And change them into something ominous.</p>\n\n<p><em>“. . . undead . . . eat . . . eat . . . eat . . .”</em></p>\n\n<p>They might be in the middle of the room now.  They might not be. Their lights illuminate each other and the concrete floor and nothing else. After some time they appear to have lost their way, the microphone on the camera stops working and their conversation takes on a fearful appearance that is both silent and impossible to follow. Then, without warning, there is an eruption of blazing white light behind them. Bill turns the camera and the void of bright white nothingness—</p>\n\n<p>In the void which so abruptly consumes them, three pieces of strange imagery can be seen when you slow the tape down or go through it frame by frame as I did. There is fleeting moment in which a cluster of dark black tentacles rise from the floor. One of them wraps around Bills leg and he drops the camera. But this all quickly fades back into the white void. Then there is a terrifying view of a bizarre city that could not have possibly existed in the past, the present, or the future of the history of the Earth. And then the void transports them (if that is indeed possible) to another place where a colossal creature stands towering over a broken field of corpses under a blood-red sky. The last image haunts me the most, for I believe at that moment, some horrifying creature of annihilation may have accidentally became aware of our world.</p>\n\n<p>—fills the entire frame for a moment. It lasts for almost an entire minute, and when it begins to recede, it does so in a slow manner . . .</p>\n\n<p>White nothingness becomes a blue sky. Then there is grass. And each blade of grass is first black and then fades to green. The camera is lying in the grass. In the background, Steve is on his hands and knees . . . vomiting. After he finishes, he wipes his mouth and crawls over to the camera.</p>\n\n<p>He picks it up and pans frantically around, as though unsure how he came to be outside again. The front of the house they were just inside can be seen in the background. He stands. Julia is sitting nearby with her back turned toward him. Bill is nowhere in sight.</p>\n\n<p>Steve approaches Julia, the camera in one hand, reaches out with his other hand, and touches her shoulder. When she turns and looks up at him, tears are streaming down her cheeks, but I don’t think she was crying because she was in pain, I think she was afraid, for after she looks up at Steve, she holds out her hands with her palms facing up and spreads her fingers. Her fingers separate at the joints of the knuckles and float away from her palm, which is floating away from her wrist.</p>\n\n<p>The camera shakes, cuts to black.</p>\n</div>\n","author":"ScottLandon"}