{"rank":"258","title":"Odontophobia","id":"8lzoim","url":"/r/nosleep/comments/8lzoim/odontophobia/","time":"1527230294000","body":"<div class=\"md\"><p>I&#39;ve never taken very good care of my teeth. I typically brushed about once a week, I smoked and pretty much survived on Dr. Pepper. I had several cavities, and two teeth had almost completely decayed; I&#39;d never been to a dentist. It wasn&#39;t much of a surprise when I grabbed an icy cold soda from the fridge, took a big sip, and felt a stabbing pain explode in one of my bottom molars.</p>\n\n<p>I&#39;d had a pretty bad toothache toothache before. After I tried several home remedies, my face started swelling, and the pain stopped. I had a friend who was an EMT, and he gave me some antibiotics that cleared it up in a couple of days. I had some minor pain a few times since then, but nothing that Excedrin couldn&#39;t knock out.</p>\n\n<p>This was a whole new level of pain, though. It radiated throughout my entire lower jaw, and I could even feel it up near my ear. I sat curled up on the floor, holding my jaw and hoping the pain would subside. After 10 minutes, not only had it not gone away, but it seemed to be getting worse; the slightest movement sent jolts of pain through my skull. I went and shook my girlfriend Tori awake, told her what was happening, and had her take me to the emergency room.</p>\n\n<p>Since it was about 2 in the morning, there was no one else there; I was seen within a few minutes. I answered their questions as best I could through the pain, and the doctor injected anesthetic into my mouth. It instantly stopped the pain; I felt like crying from relief. Since the hospital didn&#39;t have a dentist on staff, that was all they could do at the moment. The doctor recommended I see a dentist as soon as possible, and wrote a prescription for hydrocodone and penicillin.</p>\n\n<p>I didn&#39;t have dental insurance, so I called around to different clinics, hoping one would treat me quickly and set up a payment plan. Luckily, I found one that offered free exams for new patients, and flexible payment options.</p>\n\n<p>Two days after the pain started, I went in for the exam. They started by asking a few questions, then they took x-rays; it was worse than I thought. Two teeth decayed down to the root, four cavities, and three wisdom teeth that needed to be extracted. This was too much to be done on short notice, so I scheduled the surgery for two weeks later. Over those two weeks, the pain got so bad that I had to return to the emergency room three more times.</p>\n\n<p>The day of the surgery arrived. The oral surgeon greeted me, and explained what he was going to do; cut out the wisdom teeth and the decayed teeth, pull the tooth that was giving me trouble, and perform root canal therapy on the other three cavities. He was very soft spoken, and he seemed confident, which helped ease my nerves a bit. He led me to the operating room, and he got ready to administer the anesthetic; due to the complexity of the procedure, I had to be put under.</p>\n\n<p>Here&#39;s a fun fact about general anesthetic: there are three parts. First there&#39;s an analgesic, which numbs you. Then there&#39;s the sedative, which knocks you out. Finally there&#39;s a neuromuscular blocking agent, which paralyzes you and makes sure you don&#39;t twitch or anything, which could really complicate things.</p>\n\n<p>A mask was put over my nose and mouth, and I leaned back and closed my eyes. I heard the surgeon leave the room, and I started counting and waiting to pass out. I realized something was wrong when I got to 60; he said I&#39;d be unconsious in less than 30. He came back a few minutes later, and when I tried to tell him I was still awake, I realized with horror that I couldn&#39;t move.</p>\n\n<p>I could feel it when he put the mouth prop in, which meant the only part of the anesthetic that worked was the blocking agent. I tried to open my eyes, and I tried to scream, anything to get his attention, but it was no use. Then I heard the whine of a drill.</p>\n\n<p>Throughout the whole thing, all I could think was how badly I wanted to die; if I was able to, I&#39;d have killed myself right then and there. The surgeon started with the root canals; drilling through the teeth, down to the pulp, then removing and replacing the pulp and putting on crowns. That happened four times, then he started cutting into my gums to remove the wisdom teeth and what was left of the other two. Finally, and rather anticlimactically, he pulled the tooth that started this mess; it only took about 20 seconds, and it was out.</p>\n\n<p>He stitched up the holes in my gums, and left the room again. I laid there alone for about 10 minutes, screaming internally. I suddenly felt my hand flexing, and I realized I could move again; my internal screams became external. The surgeon and his assistant came running into the room, finding me climbing off the bed, screaming and spitting blood.</p>\n\n<p>They had to call two security guards to hold me down, then injected novocaine straight into my gums. When the pain started fading, I passed out. I woke up in the hospital, my face all puffy and numb, mouth packed with gauze. Tori was sleeping in a chair by my bed. I couldn&#39;t talk, so I threw a pen at her to wake her up.</p>\n\n<p>&quot;Alex, you&#39;re awake! Do you feel ok?&quot;</p>\n\n<p>I tried to ask &quot;What happened?&quot; but it came out more like &quot;wahappa?&quot;</p>\n\n<p>&quot;Don&#39;t try to talk. I&#39;ll get a nurse.&quot;</p>\n\n<p>After I passed out at the dental clinic, they called an ambulance and brought me here. I had torn out the stitches screaming, so that had to be redone. The oral surgeon had done good work, not counting the fact that I felt everything. The doctors at the hospital just kept me sedated and gave me anti-inflammatory drugs and antibiotics through the IV. I was out for a little over a day.</p>\n\n<p>The surgeon felt terrible about what happened; he said he should have noticed my increased heartrate and realized what was happening. He&#39;s a really nice guy; not only did he not charge me anything, he paid me $25,000 in &quot;please don&#39;t sue me&quot; money.</p>\n\n<p>I was diagnosed with post-traumatic stress disorder shortly after. I&#39;ve been brushing religiously since, been flossing, quit drinking soda; doing everything I can to avoid getting in that situation again. I know that that wasn&#39;t a typical dental visit, but the thought of seeing a dentist again almost sends me into hysterics. Don&#39;t be like me; take care of your teeth.</p>\n</div>\n","author":"Alexander_Glover"}