{"rank":"638","title":"My Brother Was Murdered This Morning","id":"8lzqkh","url":"/r/nosleep/comments/8lzqkh/my_brother_was_murdered_this_morning/","time":"1527231065000","body":"<div class=\"md\"><p>You aren’t going to believe a single word of this. That’s fine. Think what you want. It’s not important.</p>\n\n<p>This is what’s important:</p>\n\n<p>I hate my half-brother.</p>\n\n<p>Every single day, readers on this sub ask me where I get my ideas. Why do I write? What’s my inspiration? What scares me?</p>\n\n<p>The answer to all those questions – and so many more – is my half-brother Adriel.</p>\n\n<p>Adriel killed my father when I was six, then raised me as his own. He is a monster. I don’t mean that figuratively. He’s a literal monster. He should’ve been killed a hundred years ago.</p>\n\n<p>But people are stupid. People are shallow. People only see what’s on the surface. When the surface is beautiful, they fall to their knees in more way than one.</p>\n\n<p>Adriel has the most beautiful surface in the world. Trust me. I hate him, but even I have to admit he looks perfect.</p>\n\n<p>All my life, he’s tried to make me like him. “I’ve been waiting for you so long,” he always says. “Our mother eats her children. I was the only one who escaped her…until you. For one hundred and five years, I’ve been alone. And now…now you’re finally here. But after all this time, all this waiting…you hate me.”</p>\n\n<p>He’s right. But the thing is, it’s really hard <em>not</em> to hate Adriel.</p>\n\n<p>This is because he eats people.</p>\n\n<p>In particular, he eats their organs. Yeah, I know, it’s all very <em>Invader Zim</em> (and boy did I just about shit my pants when I saw <em>that</em> episode). But that’s basically what it is. Whenever Adriel gets sick, he kills a victim and eats the organs. Then he drains and chops up the corpse, dumps the slurry in the bathtub, and soaks in it for hours. No matter how sick or injured he is, he invariably emerges from these baths whole, hearty, and hungrier than ever.</p>\n\n<p>It always works. I don’t dispute that. But it’s evil. It’s monstrous. There has to be a better way.</p>\n\n<p>Adriel doesn’t agree. In fact, he wants me to be like him and do what he does. So far I’ve resisted. It’s really not hard. The only difficult part is having to put up with all his whining afterward.</p>\n\n<p>“Don’t you want to live forever?” he always asks.  “Don’t you want to be young?”</p>\n\n<p>Adriel’s been freaking out about the whole “young forever” aspect lately. See, I just turned 28. I look really young for my age (turns out a stress-free, work-free, school-free, drama-free, sun-free life is really good for your skin) but that won’t last forever. That stresses Adriel out because he believes that, in order for us to be equal, we have to be equally beautiful.</p>\n\n<p>He’s so upset, in fact, that he stopped eating. He hasn’t bathed lately, either. Even worse, he’s starting to get sick. But he says he’ll only eat if I eat with him. A hunger strike, I guess, to try and guilt me into becoming like him.</p>\n\n<p>That’s the phrase he always uses, too, when he tries to convince me. <em>Becoming like him.</em> Usually he’s calm and almost insidious when he plays his manipulation game. But this morning, he finally lost his temper. </p>\n\n<p>“I need you to become like me!” he screamed. “Filial bonds are the only real bonds because they are the only equal bonds. Maternal bonds, paternal bonds, romantic bonds, all of those are inherently unequal. They aren’t bonds. They’re <em>bondage.</em>”</p>\n\n<p>I don’t know what I was thinking. Maybe I was tired. Maybe I was hungry. Maybe I just wasn’t thinking at all.</p>\n\n<p>Whatever the reason, I said: “Sounds kinda hot.”</p>\n\n<p>For the first time in my life, Adriel snapped.</p>\n\n<p>He wrapped his hands around my neck and threw me at the hearth.  It’s an old-world stone monstrosity he imported years before I was born. The corner sped toward me, solid as a mountain and sharp as a knife, and smashed into my temple. Nervy, electric, impossibly deep pain screeched through my head for an instant, then I blacked out.</p>\n\n<p>I surfaced to the sound of Adriel sobbing. I opened my eyes just a sliver. He was prostrate at my feet, shoulders heaving with every broken breath. “It’s your fault,” he whispered. “I don’t have a choice. I made myself weak for you. Too weak to go outside and hunt. But I have to eat. I have to <em>bathe</em>.”</p>\n\n<p>His words wound through my mind like fuzzy snakes: annoying, itchy, and woefully out of place.</p>\n\n<p>Then I heard a knock at the door.</p>\n\n<p>Adriel’s sobs died in his throat. He stood up as I hurriedly closed my eyes. “Yes,” he whispered. “<em>Yes.</em>”</p>\n\n<p>He quickly dragged me into the hall. The knocking came again. He quickly tucked me just out of sight and went to the door.</p>\n\n<p>He’d done a terrible job hiding me. In fact, from my vantage point I could still see most of the living room.</p>\n\n<p>Adriel drew a deep breath, then opened the front door. Warm morning sunlight streamed into the room, bright and clean and white.</p>\n\n<p>“Hello,” he said slowly.</p>\n\n<p>I tried to catch a glimpse of our visitors, but couldn’t see around his body.</p>\n\n<p>“Good morning, sir!” a child piped.</p>\n\n<p>“Good morning.”</p>\n\n<p>An adult male repeated: “Good morning.” Adriel’s shirt rustled as they vigorously shook hands. “Sir, do you have a moment to talk about our Lord and Savior, Jesus Christ?”</p>\n\n<p>“Always,” said Adriel. He stepped back. A man entered with an unusually small, reedy boy. The child lugged a massive metal clipboard, the kind that’s three inches wide and has a locked compartment. A pen rolled wildly along the surface, producing a hollow echo.</p>\n\n<p>They were utterly unremarkable except for the sheer, manic force of their excitement. It radiated from them, nearly palpable.</p>\n\n<p>Adriel shut and locked the door. Then he smiled at them: the warm, wide, vaguely indecent grin that always precedes a kill.</p>\n\n<p>“Sir,” the child squeaked. He picked up the pen and clicked it enthusiastically.</p>\n\n<p>Adriel looked down indulgently. “Yes?”</p>\n\n<p>“Can I tell you a secret about our Lord and Savior?”</p>\n\n<p>“Of course.”</p>\n\n<p>“Come close! I have to whisper!”</p>\n\n<p>Adriel’s eyes briefly flicked to the man. His smile widened slightly, then he fell to his knees. “Tell me.”</p>\n\n<p>The boy’s smile faltered for an instant. His hand tightened on the pen as he leaned in.</p>\n\n<p>Adriel licked his lips.</p>\n\n<p>Then, in a single violent movement, the boy plunged the pen into my brother’s eye. </p>\n\n<p>Adriel fell back, screaming. The child gripped that enormous clipboard with both hands and smashed it into his face.</p>\n\n<p>My brother went abruptly silent and crumpled to the ground. </p>\n\n<p>The boy brought the clipboard down several more times. By the seventh or eighth blow, it sounded like he was enthusiastically smashing squashes. </p>\n\n<p>“That’s enough,” the man said. Gasping, the boy finally dropped the clipboard. The man reached down and helped him up. “Excellent. Excellent.” He looked fondly at my brother’s ruined corpse, then pointed his index finger at the ceiling. The gesture reminded me absurdly of the Salvation Army services I’d attended with my father before Adriel killed him. “There is a Better Way!” </p>\n\n<p>The child copied the movement, finger trembling slightly. “The time is nigh!”</p>\n\n<p>The man dropped to his haunches. The boy followed suit. They folded their hands and bowed their heads.</p>\n\n<p>“The day of reckoning is soon at hand,” they intoned together.</p>\n\n<p>Then they leaned down and began to eat. </p>\n\n<p>My brother the ancient predator, ended in the way he’d ended so many others. </p>\n\n<p>I faded out. I didn’t even feel afraid or sad. Just relieved.</p>\n\n<p>When I woke up, they were gone and my brother was about halfway to being skeletonized. </p>\n\n<p>I don’t know who or what that man and that boy are. I don’t know where they’re from, or what they’re doing, or why. I kind of wish they hadn’t eaten Adriel. I don’t know what happens to people who consume the raw flesh of an immortal being, but it’s probably interesting. Either way, crazy as it sounds I hope it helps them.</p>\n\n<p>I want them to reach their goal. I want them to implement their Better Way.</p>\n\n<p>I know you don’t believe any of this. But when the day of reckoning comes, you will.</p>\n\n<p>And I think it&#39;s coming soon.</p>\n</div>\n","author":"Dopabeane"}