{"rank":"0","title":"I only just went down to get a book and no I can't stop shaking.","id":"8lzrb5","url":"/r/nosleep/comments/8lzrb5/i_only_just_went_down_to_get_a_book_and_no_i_cant/","time":"1527231314000","body":"<div class=\"md\"><p>My parents who occupy the first floor are currently out while my grandparents are sleeping in the second floor. Although I avoid going there alone when the first floor is empty, a while ago, I went to the ground floor (which is deserted at night and is super creepy even in the day since it houses dolls from 1900s and real human bone joints and a skull) only to get a book that I wanted to read tonight (my book stash is also downstairs). Little did I know what was waiting for me. </p>\n\n<p>Since I am kind of a sissy, I keep switching on all the lights I encounter as I make my way downstairs so that there is maximum light to give me protection from unwholesome spirits lurking in the dark. As I switched on the final light on the landing (mark you even after switching ALL the lights I can&#39;t call the landing well lit up ever since the installation of the fancy, dim LED bulbs.) I saw a doll sized silhouette. I was already doubting if I should even move an inch forward. It was at least at a distance of 10 feet from me and was mostly concealed in darkness and shadows. Without thinking much I went nearer to it and scrambled for the hall switch. You know how these weird lights start from being exceptionally dim and then gradually brighten up, I found myself starting at a pair of blue eyes as they turn more prominent by the second, staring coldly right back at me. I could not scream, I could not let out a word heaven knows why. </p>\n\n<p>The perfect silhouette of a doll with curled up light brown hair, the lace trimmed cream satin ball gown with puff sleeves and the huge bonnet accompanied by a lace umbrella was not something I had seen in the past ten years years. As I remember from when I was much younger, the doll would play Für Elise and keep moving slowly if you wound it up. The music came like one in a sound box and was exceptionally creepy to me as a kid. The doll had an extremely morose and melancholic look on it&#39;s face almost as if something extremely bad had happened to it. Since I had happier toys that didn&#39;t creep the daylights out of me I never really played with her or name her which was highly unusual since I have the habit of naming inanimate objects once I get attached to them. Although she did come with a name on her box, I never remember using it. Today as I found myself looking at the forsaken doll I felt a shiver going down my spine. I don&#39;t know how she came to be there right at the entrance to my room and whether she&#39;s still down there. But I know that I made a run for my life and am safely tucked in bed next to my grandmother. </p>\n\n<p>Should I be scared?</p>\n</div>\n","author":"Maiden_of_darkness22"}