{"rank":"54","title":"The Breakup","id":"8lztzo","url":"/r/nosleep/comments/8lztzo/the_breakup/","time":"1527232252000","body":"<div class=\"md\"><p>“Thanks for meeting me on short notice like this”  Candace’s hoop earrings jostled about, as did her bangs while she settled into the cramped booth. We got the stink eye from the manager for choosing the booth over the bar, being that there were only two of us, but Candace likes to be comfortable.</p>\n\n<p>“It’s fine, you know what my schedule is like lately. Wake up at noon, hammer out an article. Piss and go back to bed. Wake up again at 2, do another article-” She gestured for me to hurry it along. “I’ve begun pretending to have important appointments I need to work around when scheduling stuff with people I don’t yet know well, just so they won’t think I’m a bum.”</p>\n\n<p>Candace smirked. I found myself as embarrassingly taken as ever by even the smallest movements of her facial muscles. “Do you want something? I ordered a coffee before you got here, I thought it would be more of a wait.”</p>\n\n<p>Generous sunshine poured in through the window. Birds sang, swooping this way and that against the bright blue sky. Candace held up one expensively manicured hand to shield her eyes as she browsed the menu. “Actually I’m not sure. There was something I wanted to talk to you about.”</p>\n\n<p>A slight tremor. Nobody else noticed, so I ignored it under the assumption I’d imagined it. “Oh”? She flipped the page to the seasonal specials section, studying some fancy drink consisting mostly of foam served in a comically large teacup for six dollars. </p>\n\n<p>“Yeah, it’s...I just figure if we’re gonna eat something we should do that first.” The tremor returned. Out of the corner of my eye, I saw a crack begin to spread from the edge of the window pane. “Is it important?”</p>\n\n<p>She lifted her eyes from the menu to meet mine. For a few seconds she just looked at me, studying the details of my face in much the same way I often study hers. But there was something else this time. Mournful? </p>\n\n<p>“Listen, I...Remember when we started seeing one another? Remember the talk we had?” My stomach began to gurgle. The crack on the window spread, like a time lapse spiderweb, and began to bleed a viscous black sludge. </p>\n\n<p>Outside, grey storm clouds wallowed up the sun. A black rain began to fall. “The talk about how you didn’t know if you wanted something serious?” She nodded. I held her dainty little hands in mine. “I told you that’s fine. It’s still fine. We don’t have to label this. It’s just the two of us enjoying one another’s-”</p>\n\n<p>She withdrew her hands from mine. There was no mistaking the tremor this time, markedly more violent than before. Outside, cracks began to spread across the buildings themselves. They bled the same sticky black crud as the window. Everybody just continued with their business. A mother pushed her baby in a carriage. An elderly man quarreled with the owner of a magazine stand. Oblivious, all of them, to what was happening in my heart. </p>\n\n<p>“Listen. I hate this. I hate having to say this. You’re such a sweet man. I don’t want to hurt you.” The gurgling in my stomach before turned into a violent revolt, but I didn’t wince. Oddly, I couldn’t even make myself frown right then. </p>\n\n<p>The buildings continued to crumble in slow motion as she spoke, oily sludge bubbling out of every fresh crevice. Birds fell from the sky, dead as a doornail, sinking into the gradually rising black tide. </p>\n\n<p>“You’re breaking up with me” I said, “aren’t you.” Tears appeared in her eyes. What a joke. Aren’t I supposed to be the one who cries? Though I felt nauseous, nothing stirred in my heart. On the contrary it sat limp and still within me, as though nothing out of the ordinary was happening. I suppose in a sense, it wasn’t.</p>\n\n<p>The sewers overflowed, flooding the streets with boiling, surging black fluid. The brick barber shop across the street was the first to collapse entirely, absorbed into the foul sea as if eaten by it. Cars sank by the twos and threes, then by the tens and twenties. </p>\n\n<p>“It’s okay” I assured her, as much to her surprise as my own. Calm as I’ve ever been, eyes dry as could be. “You don’t have to justify it to me.” She motioned as if to object, but I wasn’t having it. </p>\n\n<p>“Love is not a trap. It does not mean capturing someone and trying to prevent them from leaving. It’s like feeding birds. They land on your opened hand because they trust you. Because you don’t grab them and put them in a cage.”</p>\n\n<p>Of course this only made it worse. She fetched a tissue from her purse to wipe away her tears with. I just gently smiled, the picture of indifference. Meanwhile the flood had risen to the point that all I could see out the window was writhing, bubbling darkness. </p>\n\n<p>“I’m a jerk, aren’t I?” I denied it. I insisted I never expected anything. That it was a pleasure to have her in my life for as long or short a time as she was available to me. “I just want you to know, it’s not like I had anybody in mind” she blubbered. “It’s not like I was looking for someone new.” </p>\n\n<p>Oh, so she’s found someone. “May I ask who it is?” She cast me a hesitant glance. As if it would make any difference to me at this point. “There’s this guy I met months ago. We had such a strong connection. Infatuation is what it is. I just can’t move on with my life until I explore these feelings I have for him. I know I can’t ask you to still be there waiting for me afterwards, either.”</p>\n\n<p>The window, riddled with a tangled mess of interconnected cracks, finally gave way. The black sea flooded torrentially into the diner, sweeping away tables and chairs around us, but she just kept talking. Even when the ceiling above us began to crumble, chunks of plaster splashing as they landed in the goo which had now risen to our knees. </p>\n\n<p>“Well I wouldn’t want you to stay with me, always wondering what might’ve been with this other fellow. I don’t want to be in a relationship with someone who regrets it, even a little bit.” The ceiling groaned, on the verge of collapse as droplets of black sludge dripped from the cracks still spreading across it.  </p>\n\n<p>“You’re being so reasonable about this” was the last thing out of her mouth I could understand. Her hair drenched in the sticky, horrid slime, now up to her nose. Everybody else up to their chests in it, casually waiting tables or paying for their meals, even as it continued to rise. The rainclouds outside finally parted to reveal a pitch black, starless sky.</p>\n\n<p>“It’s fine, really” I repeated as the ceiling caved in. “I feel nothing.” </p>\n\n<p><a href=\"https://www.inkitt.com/alexbeyman\">Inkitt</a><br/>\n<a href=\"https://www.amazon.com/Alex-Beyman/e/B01N4LHI3C\">Amazon</a><br/>\n<a href=\"https://steemit.com/@alexbeyman\">Steemit</a><br/>\n<a href=\"https://www.facebook.com/AlexBeyman/\">Facebook</a>  </p>\n</div>\n","author":"Aquareon"}