{"rank":"21","title":"A memorable sleepover","id":"8lzzw3","url":"/r/nosleep/comments/8lzzw3/a_memorable_sleepover/","time":"1527234459000","body":"<div class=\"md\"><p>A friend of mine invited me to a sleepover at his house.</p>\n\n<p>Let&#39;s call him Frank.</p>\n\n<p>Frank and I have been childhood friends ever since kindergarten. We were both 14 at the time that this happened.\nFrank&#39;s parents we&#39;re out of town for 5 days because they wanted to see a concert and visit old relatives.</p>\n\n<p>Me: &quot;Sweet! We can do whatever we a want for 5 days!&quot;\nFrank: &quot;Finally!&quot;</p>\n\n<p>Frank&#39;s parents are rich but, pretty strict.\nFrank lives in a really safe neighborhood, and his house is huge.\nAnd the neighborhood watch had been doing a lot more patrols ever since a kid and dog went missing that year.\nFrank has an older brother too but, we hadn&#39;t seen him the entire day and assumed he was staying at friends house in the neighborhood.\nSo for 5 days it was just Frank and I, in his big ass house.</p>\n\n<p>It had been incredibly fun for 3 days, and we thought the 4th day wouldn&#39;t be any different.\nOn the 4th day, Frank&#39;s neighbor told us about a party that was going on in one of the neighboring houses, and that we shouldn&#39;t be worried if we heard some loud noises and screaming.\nAt around 9 or 10PM there was blackout for the entire neighborhood.\nThe party happening in the neighboring house was still raged on because they had a diesel generator. Frank had a diesel generator in his garage too but, we&#39;re 14, dumb as hell and couldn&#39;t be bothered to try turning it on.\nSo, Frank and I decided to grab a pair of binoculars and spy on the hot babes at the party. And after spying on the girls and playing cards for around 3 hours we got bored.\nSo we started talking about what we should/could do.\nSuddenly we heard the entrance door open, we assumed it was Frank&#39;s older brother coming home to pick up the beer he left in the fridge about a week ago, and take it his friend&#39;s place or to the ongoing party.\nWe then heard knocking on the door in the room we were in.</p>\n\n<p>Frank: &quot;What do want!&quot;</p>\n\n<p>The knocking stopped and it sounded like his brother went into the kitchen.\nI then got the idea that we could try some beer before Frank&#39;s brother left of with it. Frank agreed.\nFrank&#39;s brother is really chill and cool, so we were pretty sure his brother would let us have 1 beer.\nSo, when we went out the room, we saw Frank&#39;s brother run across the hallway all the way to the entrance door and leave.\nOn our way to the kitchen, we saw that the furniture was out of place, cutlery and broken glass was everywhere too. It looked like the kitchen exploded and everything in the fridge was on the walls.\nWe guessed that Frank&#39;s brother was at the party and was drunk when he got home and decided to do some drunk redecorating.\nFrank&#39;s brother always said that he hated how the interior looked and moved the furniture a lot, even though he says that he doesn&#39;t actually do it.</p>\n\n<p>Frank: &quot;My brother is so screwed HAHA!&quot;\nMe: &quot;Damn. The beer has been spilled everywhere. What a waste.&quot;</p>\n\n<p>Frank rang up his parents in the middle of the night.\nLuckily Frank&#39;s parents were still awake but, were a bit annoyed that we hadn&#39;t gone to sleep yet.\nFrank told them that, his brother made a mess out of the kitchen.</p>\n\n<p>Frank&#39;s parent&#39;s: &quot;Uhhh... sweetie, your brother flew to France the same time we left town.</p>\n\n<p>The next day, Frank&#39;s parents came back home early and reported to the police that there was a break-in.</p>\n\n<p>Now, Frank&#39;s house has 2 entrance doors, like an airlock.\nThe first door has a regular door lock that needs to be opened with a key. 2nd door also has a regular door lock but, needs a separate key to be opened with and the door also a code lock.\nNobody noticed anything near the house. The neighborhood watch saw nothing, the other neighbors saw nothing and the people at the party saw nothing.\nAlthough, one neighbor said he saw a dog in the backyard, but didn&#39;t think much of it.\nThe police didn&#39;t find anything either.</p>\n\n<p>For about a year Frank and his family didn&#39;t sleep well, they felt like they were being watched and said the kept hearing muffled howling coming from the basement but, every time they checked the basement they found nothing but, each time they checked the smell got worse.\n...\nOne day the howling stopped but, the smell was absolutely horrible.\nMe, Frank, his brother and his dad, checked the basement.\nAgain we didn&#39;t find anything, however, we saw a crack in the wall that led behind a shelf. We moved the shelf, and saw a dark hole that led into a makeshift room made out junk and dirt.\nWe got flashlights and decided to explore.\n...\nWhat we found will never leave my memory... There was starved dog, a half eaten person, what looked like the bones of the child that went missing last year and a fuck tone of dog hair everywhere.\nThe dog died only 2 days before we found it.\nThe person that was eaten beyond recognition was probably the person me and Frank saw during the sleepover.</p>\n\n<p>Police said that a homeless man somehow gained entry to the house, kidnapped the child and the dog. And then fed the child to the dog. The dog killed the man his sleep.\nThe mess that happened in the kitchen was due to the dog escaping into the kitchen and there was fight between the man and the dog.</p>\n\n<p>That man had been living in that house ever since Frank&#39;s family moved there...</p>\n</div>\n","author":"_-sloppy-_"}