{"rank":"4","title":"The shack (part one)","id":"8m06q6","url":"/r/nosleep/comments/8m06q6/the_shack_part_one/","time":"1527237261000","body":"<div class=\"md\"><p>Now, I&#39;m taking to Reddit to hopefully get some new ideas as to what the hell happened in my sister&#39;s little shack that she lived in a couple of years ago. </p>\n\n<p>I&#39;ve been a lurker here for the longest time, I never thought my life would be exciting enough to actually have a story to share. But I was speaking with my sister about all our crazy experiences, and I learnt alot of new things about this particular place, and I&#39;m fascinated. I need to know more. And maybe you great slueths have some sort of idea. </p>\n\n<p>I&#39;ll start with a little bit of background story seeing as it was a few years ago and you kind of need to understand to understand, but I&#39;m sure you understand. </p>\n\n<p>On the south east coast of Queensland Australia stood the little shack, cottage, whatever you want to call it, it was right next to a creek, then a forest was beyond that. The surrounding forest is known for strange things, native Australians were executed hundreds of years ago in the area, immediately making it spooky, and on top of that bigfoot, yowie, whatever you want to call it sightings are also common in the area. </p>\n\n<p>Now I want to first start off by describing the shack. It was a shoebox, rented to my sister as a one bedroom, however it was a 2 bedroom. 2 small rooms, a tiny lounge, a kitchen and a bathroom. The house was isolated on top of a mountain, as I mentioned above, a river, the forest and the road out surrounded her, nothing else.</p>\n\n<p>I need to do some research on the area but I haven&#39;t really got around to it yet.</p>\n\n<p>Strange things would happen in this house from the day she moved in. The spare room had a cold, something-is-really-wrong air about it, I stayed there for a few weeks and lasted 2 nights in that bedroom, I slept on the couch the rest of my visit, and I wasn&#39;t the first or last person unable to sleep in that particular bedroom, for no reason other than the anxious dread you would feel when you went in there. My sisters appliances would turn on in the middle of the night despite being uplugged (her surround sound system and tv, or her electric kettle for example). </p>\n\n<p>My sister, her partner and anyone else that stayed in the house and showered there would leave the shower with a large red handprint on our backs. </p>\n\n<p>Now all of these things are mild compared to the insane things that she discovered and the downright terrifying events that began to unfold the longer she lived there. </p>\n\n<p>The first strange thing she noticed was a tiny shed on the property at the very end of the driveway right next to the letterbox. One day she looked in the shed on her way to work. Crosses, all shapes and sizes lined the walls of the maybe 2 square foot tin shed that was barely still standing. </p>\n\n<p>Another weird thing worth mentioning is the secret door. One day, one of her chickens passed away under the house. To avoid foxes getting her chook she climbed under the house to get the chicken out and bury it, as you do I guess.</p>\n\n<p>That&#39;s when she discovered the secret door, the door led from underneath the house directly through the kitchen floor, and into the house. When the door is closed from the inside you can only tell where it is because of the lines of the edges, there is no way to access it from inside. That is a mystery to me, is there a reason one would have a trap door in the house ? </p>\n\n<p>Then, the night that forced my sister to pack her stuff and move out the next day, even though it meant breaking her lease and potentially being screwed over for a while. </p>\n\n<p>She was snuggled up in bed, ready to go to sleep, waiting for her partner to arrive home from work. Now the driveway to the shack is a gravel driveway, it&#39;s LOUD when a car drives down the driveway. \nShe notices nothing until she hears a car door slamming, even though the sound of crunching gravel didn&#39;t indicate her partner arriving home. Then she heard footsteps, heavy footsteps come toward the house. She was panicked as you would be and jumped out of bed and hid beside it without hesitation. She had a glass sliding door that led from her room onto her little back porch, but there were no curtains on the window, and she was obviously petrified and didn&#39;t want anyone to see her in there and you know murder her or something, she couldn&#39;t see out and she was praying whoever/whatever was out there couldn&#39;t see her. </p>\n\n<p>She had chicken wire strewn across the porch to stop the chickens from going up there and pooping on the porch. She heard the footsteps round the corner and ascend the steps, then it sounded as if whoever was there that night ran into the chicken wire and tripped over it. No voices, no nothing this whole time. She was on the phone to her partner at that point whispering, and it definitely wasn&#39;t him, he was about 5 minutes away and racing to get home. \nNow the strange thing that gets me is my sister&#39;s dog was on the patio, now he is the friendliest, happiest pup I&#39;ve ever met, gets excited at the mere presence of a human. He was whimpering, clearly terrified. Then, the only way she could describe to me what happened next was as if whoever this was picked her pup up and held it against the glass sliding door, pushing him into it, dragging him up/down/along the glass. I hope you can make sense of that. </p>\n\n<p>The dog was still whimpering, however all else went silent after maybe 30 seconds (which would have felt like a lifetime to her). She sat where she was trembling with fear for another few minutes, when she heard her partners car come down the drive, and him run into the house. There was nothing at all to indicate anyone being there. And she most definitely did  NOT hear footsteps walking away...\nThankfullyas fine after that incident, he just didn&#39;t like sleeping outside on his own after that night. </p>\n\n<p>After that she moved out, when we were talking about it the other day, we were talking about going to look at the property on my next visit to my hometown. I just don&#39;t know if satisfying my curiosity is the best idea in this situation, but I feel like we both need to know.</p>\n\n<p>I&#39;ll update on anything that we discover or anything that happens. </p>\n\n<p>Wish me luck !</p>\n</div>\n","author":"Unstable1997"}