{"rank":"10","title":"My Dead Sister Part 4, The Penultimate.","id":"8m0ho3","url":"/r/nosleep/comments/8m0ho3/my_dead_sister_part_4_the_penultimate/","time":"1527241412000","body":"<div class=\"md\"><p>Part 1 <a href=\"https://wh.reddit.com/r/nosleep/comments/722es7/my_dead_sister_part_1/\">https://wh.reddit.com/r/nosleep/comments/722es7/my_dead_sister_part_1/</a></p>\n\n<p>Part 2 <a href=\"https://www.reddit.com/r/nosleep/comments/72f4w7/my_dead_sister_part_2/\">https://www.reddit.com/r/nosleep/comments/72f4w7/my_dead_sister_part_2/</a></p>\n\n<p>Part 3 <a href=\"https://www.reddit.com/r/nosleep/comments/8f3v3u/my_dead_sister_part_3/\">https://www.reddit.com/r/nosleep/comments/8f3v3u/my_dead_sister_part_3/</a></p>\n\n<p>Chapter 4</p>\n\n<p>All at once Lena flew through the air. Less than a second later, she had landed feet first on the pillowy grass below and crumpled into a ball. I hadn&#39;t heard a tell tale crack or break, but this wasn&#39;t a guarantee of her safety. I wanted to yell to ask if she was okay, but I didn&#39;t dare risk more noise waking up my undoubtedly hungover parent. I watched as she seemed to stay curled in a ball on the wet grass.</p>\n\n<p>Twenty seconds went by. Thirty. “Lena” I whispered, as loudly as I could. “Lena, are you okay?” Nothing. I was starting to panic. Had she hit her head? Had the impact been too much for her? Should I also jump?</p>\n\n<p>Relief hit, as Lena lifted her head from the sodden grass, but it was short lived. As she lifted her torso, I could see a large lump protruding from the back of her neck. Her spine had literally split her skin, and was edging upwards from underneath her shirt, behind her head. I couldn&#39;t believe she could even still move. At the time I knew very little about anatomy. Even at sixteen years old, I couldn&#39;t have told you what the spine was connected to, but they were careful to inform me. Since being in this facility, I have been instructed in the many ins and outs of anatomy and biology. Why? No one can walk, breathe, function, without the connectivity of the brain to the spinal column. At least not without intense medical intervention. I must have been lying. This couldn&#39;t have happened. But it did: I promise you it did.</p>\n\n<p>Lena brought her hand to the top of her spine jutting out from the base of her neck. She tried to look round, and up at me, but she couldn&#39;t move her head past the protruding length. She sat up, with her shoulders hunched over, her arms spread outwards, and tried to stand. It almost looked as though she was trying to manoeuvre herself in a jacket still with the coat hanger stuck inside it. Lifting her hand to the top of her spine, flat palm, she firmly tried to shove it back through the gaping puncture. Gradually, it sunk back down into her torso, making a hideous noise like squeezing moist meat through a tube. With a final &#39;squelch&#39; it seemed to fit back into place. No blood pooled in the hole that the spine at left.</p>\n\n<p>&#39;Are you okay?&#39; I mouthed to her as she was finally able to look back up at me. She nodded, but her face was white, and she looked horrified. I don&#39;t care whether you can barely feel it, spine severance would be traumatic for anyone. At least the rest of her seemed to be more or less intact; it seemed the first aid kit had been unnecessary. But all at once, the optimism that had been slowly creeping upwards turned to ice.</p>\n\n<p>“LENA.” A shriek, coming from the other window that opened onto the back garden.</p>\n\n<p>“LENA, get the FUCK back into this house!” Mum obviously hadn&#39;t seen the protruding bone, or the fact that Lena&#39;s body was now hardly her own.</p>\n\n<p>Lena picked herself up off the grass, limbs cascading beneath her as she rose, and she ran. The gate was on the left side of the garden, next to my window but round a sharp corner. She slammed into it as fast as she could, and I lost sight of her. I heard her try to flick open open the latch. It must have been locked: there was no familiar scratching sound as the door swung loose off the rusty metal fixture.</p>\n\n<p>“LENA!”. Another screech in the early morning air. A thought briefly passed through me: the neighbours will surely hear her. What if it was enough to alert someone?</p>\n\n<p>I heard the wooden door of the gate start to bang and heave on its hinges, Lena was clearly trying to climb over it, just as I heard mum&#39;s footsteps clear her bedroom and throw herself through the doorway onto the landing. My heart was thumping in its cage: all I wanted to hear was the sound of shoes on concrete as Lena cleared the back gate. I tried to stay calm, I couldn&#39;t throw myself out of that window to Lena&#39;s aid. Not after all she had done to save me.</p>\n\n<p>More grinding of wood on metal, it sounded like the thin gate was shuddering as it shouldered the weight of a 15 year old undead girl. Mum&#39;s footsteps on the stairs, two at a time, as she ran as fast as she could on the splintering wood in pursuit of her child. The front door was thrust open, and a little yelp, from a scared little girl, that preceded a thud.</p>\n\n<p>Please let her be on the other side of the door.</p>\n\n<p>Silence.</p>\n\n<p>Seconds turned into an excruciating minute as I listened. I could hear birds chirping, and the sound of one or two cars from the nearby highway. But what I did not hear was the unlocking of a rickety wooden gate, and the scream of a horrified jailer as she took a good long look at what she had done to her daughter. And I did not hear the yell of a defiant young girl, whose freedom was once again threatened. I dared to hope that she had done it, that she had slipped away through the bars to the alley by the side of our house. It would have been a tight squeeze.</p>\n\n<p>I sat down on my bed, barely daring to let out the breathe I hadn&#39;t noticed I&#39;d been holding. I didn&#39;t know what was going to happen next. We hadn&#39;t planned so far ahead. Shaking, I listened for the door to slam that would indicate my mother was back, and most likely coming for me. But I heard nothing. Minutes passed, and all I could think about was my sister, and whether she would be able to convince anyone to send help. If she was taken away to some facility before I could get out, then I wouldn&#39;t be able to protect her. I hoped that was my motive. I hoped that I wasn&#39;t selfishly prioritising my own freedom above her safety. I hated that I couldn&#39;t be sure.</p>\n\n<p>Two minutes. Three. Where was everyone? Where was mum? I looked at the door with my bed wedged against it. I didn&#39;t want her to come in, but the unknown was terrifying. Four minutes. Five. No noise, not sound at all. Maybe mum was still running after Lena, or perhaps she&#39;d seen her face and feinted. Surely, she couldn&#39;t have simply run away?</p>\n\n<p>“It would make sense” I thought to myself.</p>\n\n<p>The police probably wouldn&#39;t take kindly to her murdering her daughter, however impermanent it turned out to be. Uneasily, I started to wonder what would happen if no one believed Lena that I was in here, and mum never came back. I shivered as a cold wind came through the glassless window, permeating my thin night dress. It must have been about 6 o&#39;clock by now. Many hours had passed since Lena woke me, and I was starting to hear the chatting of our neighbours, and the smell of coffee wafting from their houses. I pulled some clothes out of the chest of drawers, and tried to make myself decent despite no mirror, or even a hairbrush. Poised for the rescuing, I sat in the window, closing my eyes and leaned my head against the frame.</p>\n\n<p>“Millie?”.</p>\n\n<p>“What the hell?”</p>\n\n<p>“Miss Barker?!”</p>\n\n<p>I jumped up.</p>\n\n<p>“Are you in there?!”</p>\n\n<p>I must have fallen asleep. The sun was streaming into the room, and there were people in their gardens looking curiously up at my window. The noise was coming from the door, as well as a drilling sound, just like the noise I had woken to the day before.</p>\n\n<p>&quot;Miss Barker?” Said a man&#39;s voice through the wood.</p>\n\n<p>“Yes! Yes that&#39;s me!” I darted from my window seat to the door, feeling very much as if this couldn&#39;t be real. “I&#39;m in here, my mum left me in here, is my sister with you?” Words and thoughts tumbling through my mind as I couldn&#39;t believe what I was hearing.</p>\n\n<p>“Lena is outside” said the voice “We&#39;ve called an ambulance, and they&#39;re waiting to check you guys out.”</p>\n\n<p>My blood froze. I knew this would happen, but not so soon. As soon as they looked closely at Lena they would see there was something wrong with her. If they hadn&#39;t already.</p>\n\n<p>“I&#39;m not hurt” I said, as the drilling stopped on the top left of the door hinge, and and begun again on the bottom one.</p>\n\n<p>“I don&#39;t need an ambulance. We don&#39;t need one.”</p>\n\n<p>“Your sister says she jumped out of the window” the man replied. “We&#39;re here to help you Millie, everything is going to be okay.”</p>\n\n<p>Tears started falling down my face as desperation hit me. I began to shove the heavy bed out of the way of the door frame, and then sat against it with my arms around my knees. It was all now out of my hands.</p>\n\n<p>“Please” I said, “We don&#39;t need an ambulance, we&#39;re fine. Please just.. Just...” Suddenly the question hit me. What were they going to do with us? We couldn&#39;t stay here. I supposed in order to be neatly put away into some social worker&#39;s filing cabinet we would have to go through all sorts of tests and inspections. How could I have been so stupid. Lena shouldn&#39;t have run for help, she should have run for a door key. I was so selfish. All I wanted was to be free, to find authority, to find someone to look after me. That&#39;s what I always do, and I have destroyed my sister&#39;s life for the sake of it. We should have run away, found somewhere to hide.</p>\n\n<p>“Everything is going to be fine” the fireman said, trying to sound reassuring. I don&#39;t know what on Earth I had been planning, but I should have thought this through. And the fireman was in, his colleague lifting the left side of the door away from the frame while it still swung on the silver padlock that had thus far imprisoned Lena and me. The dark, dingy hallway spilled into my bedroom followed by the bright yellow uniform of my rescuer. He kneeled down next to me.</p>\n\n<p>“Let&#39;s go, shall we?” He said with a smile. Somehow he sounded reassuring and condescending at the same time. Despite being in my teens, I felt like a lost child, with no control over the situation at hand.</p>\n\n<p>I stood up as the second fireman came into the room, draped a blanket over my shoulders, and putting his arm around me. The first man held the door back for us as we left the room and walked down the hallway to the staircase. I had only been held captive for a couple of days, but good lord, it felt like I was seeing the rest of the house for the first time in months. We descended the stairs to the hall, the front door was wide open and there was daylight flooding in. It looked like it had been forced ajar. Mum must never have come back, and it would have locked automatically behind her. Maybe that&#39;s why she never returned; she forgot the key when she ran out after Lena.</p>\n\n<p>“Do you know where my mum is?” I asked.</p>\n\n<p>“Not yet, lass.” said the fireman, this one had an accent. “But mark my words, we&#39;ll find her.”</p>\n\n<p>There was a police car outside, as well as an ambulance. The fire truck was parked a little ways down the street. Looks like they had all of the first responders out today. The ambulance was parked adjacent to the house, the back doors were open, and beneath the edge of them I could see the dangling, blotchy, purple legs of what must have been Lena sitting with the paramedics. My mouth went dry.</p>\n\n<p>“Is she okay?” I asked, nervously.</p>\n\n<p>“You&#39;ll have to ask the med team”</p>\n\n<p>The fireman led me towards the open back doors of the ambulance, but as we turned the corner, I nearly screamed. Lena&#39;s face was all but hanging off of her skull. Her eye sockets and mouth were completely dislodged, and you could see the sinew beneath her skin as her eyes struggled to see out of the small slit she had left to peer from. Her mouth hung, dog-like over her jaw, revealing her gums as it draped underneath her jawline, so much so that I couldn&#39;t believe that she would be able to speak. Blood was leaking from her ears, and clumps of hair had fallen out of her scalp to the extent that she had clear, hairless patches revealing rotten, discoloured skin. There was a paramedic next to her. He was taking her blood pressure. I gaped at this man. He was sitting in front of a corpse, and he was performing the most routine of tests.</p>\n\n<p>“90 over 60” he said to his colleague in the ambulance.</p>\n\n<p>“Pretty low” she said.</p>\n\n<p>Pretty low? Pretty low?! How is it as high as that? She has no blood pressure. The second paramedic climbed out of the ambulance and took my arm, clearly indicating for me to hop up into the vehicle. I must have looked a sight: white face, trembling. I did as she requested. I was in too much shock, too much denial and too exhausted to do anything else. Lena followed. They strapped us in.</p>\n\n<p>“We&#39;re going to take you guys to the hospital” said the first paramedic holding out the doors as he prepared to close them.</p>\n\n<p>“The police will want to talk to you, but we want to give you a proper look over first. Too much all at once can be overwhelming. And Lena, I&#39;m a bit worried about that ankle.” He shut the doors.</p>\n\n<p>Her ankle is what they&#39;re worried about? Not the dislodged face? The spine hole? The pools of blood up and down her limbs? No, they want to look at her ankle.</p>\n\n<p>“Lee this is messed up” I said.</p>\n\n<p>She started to cry.</p>\n\n<p>“I&#39;m not dead. Of course I&#39;m not dead. I knew it was just bruises.” I could barely understand her mumbled words through the hole in her face that couldn&#39;t close to make proper speech. Tears pooled in the drooping holes of her extended eye sockets. “Why did you scare me like that?”</p>\n\n<p>The engine of the ambulance sprung to life, and I could feel the van steering away from the curb. I suppose that she may not have seen her face. But even so, could she not feel the disfigurement? I took her hand. And shuddered as I realised I was only holding four digits, barely attached to a sinewy palm.</p>\n\n<p>“I don&#39;t know what to say” I said quietly, “You&#39;re falling apart Lena, it&#39;s plain as day.”She snatched her hand back.</p>\n\n<p>“I think you&#39;re the one that&#39;s falling apart.” She said. “They didn&#39;t notice anything, and my blood pressure is fine.”</p>\n\n<p>“Are you guys alright back there?” The paramedic asked through the small hole to the front of the van.</p>\n\n<p>I looked forwards towards the shelves of locked up medical equipment. I didn&#39;t think that I would ever be okay again.</p>\n</div>\n","author":"Crayonless"}