{"rank":"21","title":"The Dogs Are Barking","id":"8m0lmg","url":"/r/nosleep/comments/8m0lmg/the_dogs_are_barking/","time":"1527242824000","body":"<div class=\"md\"><p>I am not entirely sure what my intent of writing this is. After the events of the past twenty four hours I don’t really know if this is meant to be a warning, or if it’s just the delusional thoughts of someone who has seen too many scary movies. </p>\n\n<p>I guess I’ll give you a little background to allow some perspective, so you can decide for yourself.</p>\n\n<p>I spend a lot of time watching and reading scary stories. Horror films, horror books, true crime shows, Nosleeps, creepy podcasts, you name it. To me the scariest thing to watch are the movies and TV shows with paranormal activity. Don’t get me wrong, I still love watching them, I just can’t do it alone. And then when I am alone, my mind submerges itself in paranoia and turns every innocent shadow or noise into something sinister. </p>\n\n<p>Just this last weekend, a friend and I spent two days bingeing on just about every decent scary movie on Netflix that we hadn’t already seen (and some that we already had). To me, what can make or break a scary story is the ending. Some people like to be left wondering, to finish the ending with their own interpretation of events. I like a good, solid, “this is what happened and why.”</p>\n\n<p>If you’re a lover of horror like me you’ve probably picked up on some of the same “rules” that seem consistent across many movies of that genre. For example, shit is more likely to happen between 3am and 4am, or that dogs bark like crazy in the presence of the paranormal . There’s even a recurring theme that children can see and talk to things that adults can’t. </p>\n\n<p>I have a two year old little girl. She has big blue eyes and alabaster skin, and is probably the most adorable tiny human on this planet. She’s in this phase where she calls all children “babies”, all women “mama”, and all men “dada”. We’re working on it. </p>\n\n<p>If you have children or are frequently around children, have you ever noticed that sometimes out of nowhere they will look past you like they’re staring at something over your shoulder? Emma has done that randomly and infrequently ever since she was a few weeks old. It used to scare the shit out of me and I’d always whip around, but I’ve gotten used to it over the years.</p>\n\n<p>That brings me to last night. Jake, a very close friend of mine had an early flight this morning to go see his boyfriend. The airport is a short drive from my house and I offered to drop him off if he wanted to sleep at my place. \nIt was about 10pm and Jake had retired to the guest bedroom about a half hour prior. I was in my living room getting Emma ready for bed. She was watching some cartoon video on her iPad while I tucked her limbs into footie pajamas. </p>\n\n<p>Out of nowhere she looked up past me and over my shoulder. Like I said, I’d gotten used to this so I didn’t have the impulse to immediately look behind me. </p>\n\n<p>I was just zipping up her pajamas when Emma said, “hi dada”. </p>\n\n<p>I turned around expecting to see that Jake had come back for a glass of water or something, but the room was empty. The kitchen was empty as well. I got up and tiptoed down the hall to the guest room, really expecting to see the light under the door flick off as Jake got back into bed. </p>\n\n<p>“Did you need something”, was a half-breath from being out of my mouth when I noticed the room was dark and the only sound coming from behind the guest room door was Jake’s rhythmic snoring. </p>\n\n<p>So my next paranoid thought was, “is there someone else in the house?”</p>\n\n<p>Emma was back to watching her videos so I just did a quiet sweep of the house to give myself peace of mind. When I was sure the house was empty aside from Jake, I put Emma to bed. </p>\n\n<p>I forgot to mention that I have two big golden retrievers that spend the majority of the time in the backyard barking at the neighborhood cats. I bring them inside at night partly so that they don’t bark and wake the neighbors (and myself) and partly because my room is across the house from the front door and Emma’s room, so if anyone tried to break in, my dogs would be my alarm system. And if you asked me two days ago, I’d be embarrassed to tell you that I’m afraid of the dark and I rely on my dogs to alert me of anything lurking in the shadows. </p>\n\n<p>For three years I’ve lived in this house and more or less followed this same routine. Auri (the young, spry one) runs to my room and springs onto my bed. Elodin (who is now too old to make it on top of the bed) plops down outside my bedroom door. A guardian for the house and a guardian for my room. </p>\n\n<p>Up until twenty four hours ago they’ve never barked inside the house. </p>\n\n<p>I was brought out of sleep to the sound of static coming from the baby monitor beside my bed. I checked my phone for the time: 3:20am. Behind the static I could hear the sound of Emma talking quietly. She does this sometimes: wakes up from a dream and rattles on about “stars and puppies and flowers” and then knocks back out a couple minutes later. This time I couldn’t make out what she was saying over the static. </p>\n\n<p>I picked up the monitor to check the video screen and to get a look at Emma. At the same moment, I heard Elodin let out a low growl followed by a single, short, bark from outside my bedroom door. I heard his paws on the hardwood as he stood up from his sleeping spot. Auri was still curled up at the adjacent corner of my bed, but her ears were perked up now. </p>\n\n<p>I turned my attention back to the baby monitor which was now blinking a “no signal” message on the screen. </p>\n\n<p>I was just beginning to swing my legs over the side of the bed when I heard Elodin settle back down against my door and the baby monitor come back to life. The static sound was gone now and I could see Emma sitting up in her crib. I swear I heard her say “night night dada” before she laid back down on her pillow. </p>\n\n<p>Again, I thought of Jake. Maybe he got up to use the restroom and Emma heard him moving around. Maybe it spooked Elodin. </p>\n\n<p>My alarm went off at six and I dragged myself out of bed. I threw on some yoga pants and a sweater before going to round up Jake and Emma for the quick drive to the airport. </p>\n\n<p>Jake was already up and ready to go in the living room. He had two cups of coffee on the table and was on his phone presumably checking his flight status. Elodin had his head in Jake’s lap who was stroking him softly with his free hand. </p>\n\n<p>I reached for the fullest cup of coffee and it was halfway to my lips when I noticed that Emma was already up as well. She was on her iPad on the other side of Jake, so I hadn’t seen her immediately.  </p>\n\n<p>He saw my confused pause and gave me a guilty look. </p>\n\n<p>“Oh yeah, sorry. I didn’t know you leave her door open at night now, so I think I woke her up when I got up and moved around the house this morning. It’s been nice chilling with her for the past half hour though”, he said as he ruffled her hair.</p>\n\n<p>“I don’t leave her door open at night.” </p>\n\n<p>Jake gave me a blank look. He must have seen the blood drain from my face because his blank stare quickly turned into a mask of reassurance. “Hey hey, I’m sure you just didn’t close it all the way when you put her to bed and it blew the rest of the way open in the night. Besides, you know Elodin would have let you know if anyone was in the house.” </p>\n\n<p>I tried to take a drink of coffee to settle myself, but it went down hard in an audible swallow. </p>\n\n<p>“You’re probably right”, I said. “The only sound Elodin made last night was when you got up around three. Did you notice her door open then?” </p>\n\n<p>Jake looked confused. “Liv, I was out like a light for the whole night. I didn’t get up until my alarm went off at five thirty this morning.” He stood up from the couch and went to the front door. Still locked. He went to each room and every door, but nothing was out of place. </p>\n\n<p>I was still frozen in place when he came and put his hands on my shoulders. I must have looked really shaken because Jake never shows affection. </p>\n\n<p>“Look,” he said, “Elodin probably heard Emma’s door blow open and startled at the sound. When does Charlie get back from his work trip?” </p>\n\n<p>“Tomorrow morning.” I wiped away a tear that I hadn’t realized was running down my cheek. I was being ridiculous. I shook my head as if to clear it and downed the rest of my coffee. I grabbed my keys from the bar and tried my best at a smile. “You ready to get on a plane and go see your man?” </p>\n\n<p>Jake gave me a bashful grin, scooped Emma up off the couch, and followed me out the door. </p>\n\n<p>By the time night fell I had convinced myself that Jake was right. I was feeling even more reassured after my phone call with Charlie. He made me promise to double check all the doors and to let the dogs in before I fell asleep. I did just that and curled up in bed with my book. </p>\n\n<p>I must have fallen asleep reading because I woke up with my bedside lamp still on. My phone read 1:14am. Auri was snoring softly and I could see the shadow of Elodin under my door. I checked the baby monitor and could make out the sleeping form of Emma. I switched out the lamp. </p>\n\n<p>I can’t explain it, but as soon as the light was off, the darkness felt thicker than ever before. I tried to shut my eyes, but I kept popping them back open at any little sound. </p>\n\n<p>I guess that’s why I’m typing this all out now. I need a distraction until I can fall asleep, and I was hoping if I laid it all out into words, I could re-read it and see how trivial it all is. </p>\n\n<p>I probably won’t even post this. </p>\n\n<p>It’s 3am now. I  just woke up from a nightmare, my phone still on and in my hand. In my dream there was a dark figure standing over my bed. I can see by the light of my phone that my room is empty aside from Auri. </p>\n\n<p>3:50am and Elodin is barking outside my door. I feel ice cold. I swear I can see my breath by the light of my phone. I tried to turn my lamp on but it’s not working. I don’t know what to do. Call the police? </p>\n\n<p>The baby monitor says “no signal”.</p>\n\n<p>I can see Auri’s shadow in the dark, she’s standing on the bed facing me. </p>\n\n<p>Both dogs are barking now. Auri is snarling at something over my shoulder. </p>\n\n<p>I am so afraid to turn around.</p>\n</div>\n","author":"Nightingale12125"}