{"rank":"12","title":"Im sorry miss but we don't have a lawn mower","id":"8m0p0r","url":"/r/nosleep/comments/8m0p0r/im_sorry_miss_but_we_dont_have_a_lawn_mower/","time":"1527243973000","body":"<div class=\"md\"><p>I used to be a strong disbeliever of the paranormal but now I can&#39;t say I am anymore. </p>\n\n<p>So my house has been in my family for a while, noting that my mother has lived here since she was a child. But even back then my grandma would mention seeing a brown haired woman in a nightgown. She would say that every so often she would see her somewhere in a dream or through a window or catch a glimpse of her out of the corner of her eye. People on my street now even say similar things but I didn&#39;t believe them, after all in my 15 years of living here I hadn&#39;t seen a thing. </p>\n\n<p>One summer break day early in the morning I wake up and just go to the family room where I can sleep on the couch. I quickly passout, im never awake that early anyway so I&#39;m not missing out on anything. While I was asleep my mother had gotten up and left for work leaving only me and my younger brother to fend for ourselves till my dad gets home. As im asleep the black amazing feeling of sleep transitions to a white blank space, emerging from that space I see my mother but something is off. I notice she is wearing a white nightgown, and she is wispering something. She comes closer untill She is just infront of me, looking down. She whispers into my ear, &quot;wake up!&quot; Like  vacume I get sucked out of sleep to hear a knocking on the slider glass door behind the couch. The knocking is a woman, I approach confused not knowing why she is in my back yard. She tells me that she is here to get the lawn mower. I tell her that we don&#39;t have a lawn mower, and unsurprisingly ask her to leave. As she walks back to the gate she entered through I atempt to catch her walking back to her car that is parked in my yard, but after 10 minutes of waiting she never came. I turn around to look at the back yard through my slider And see a knife left on the table out side. when I glance back to the space where the car was parked, i  saw nothing and the grass was only disturbed where the car had been, there were no tracks. </p>\n\n<p>Nothing major arose from It but there are a few things I&#39;m still confused about. 1) how did the woman know I was sleeping on the couch to knock there, she couldn&#39;t have seen me. 2) Ive asked around and everyone I&#39;ve asked has said that the woman in the white nightgown has always looked like my mother does now, even 30 years ago. 3) when I went to recover the knife, I couldn&#39;t find it, it had vanished just as the car had. </p>\n\n<p>This was my first story and id like to get some constructive feedback on it, thank you very much. And PS this is a true story I&#39;m still puzzled and i only now realize that me and my brother could have been killed that day. </p>\n</div>\n","author":"jugernutts12"}