{"rank":"918","title":"I Smelled Every One","id":"8m0td0","url":"/r/nosleep/comments/8m0td0/i_smelled_every_one/","time":"1527245499000","body":"<div class=\"md\"><p>Malls have everything, don’t they?</p>\n\n<p>So why ever leave?</p>\n\n<p>People toss out the phrase “homeless” with such cavalier disregard for what the term <em>actually</em> means.</p>\n\n<p>I’m not homeless.</p>\n\n<p>The mall is my home.</p>\n\n<p>*</p>\n\n<p>The Tavistock Galleria in West Mifflin, Pennsylvania has been my everything for nearly a decade.</p>\n\n<p>My day begins before dawn. The JC Penny has just so many delicious little nooks and crannies that allow me to make a nest. Do you ever think about what’s in the middle of those circular racks in the clothing section? It’s a perfect place for me to hunker down all night on a bed of unsold women’s pants. Mmmmmm.</p>\n\n<p>Everything’s put back in place before the first employees arrive, of course. Can’t have anybody knowing about my nest, now can we?</p>\n\n<p>I know what you’re thinking. Wouldn’t it raise suspicions if they found me wandering around before opening?</p>\n\n<p>Not a chance. That stolen mall cop uniform has paid dividends many times over. </p>\n\n<p>And Joe, the idiot night watchman, never suspected a thing. I would occasionally pretend to be a mannequin in the display case shadows, but his brain was dimmer than the after-hours lighting. </p>\n\n<p>Maybe that’s why he disappeared without a trace. I never did find out what happened to him.\nAnd they never did replace that one. $913 a month was just too high a price for the Tavistock to monitor itself, it seems. What a sorry state.</p>\n\n<p>I’m polite when the situation necessitates it, and send a ‘good morning’ wave to Urusla each day when she comes in to open. </p>\n\n<p>You see, once a person <em>accepts</em> anything as a routine part of their life – be it a car, a rule, or a smiling man in a mall cop’s uniform – they stop questioning <em>why</em> that thing is there in the first place.</p>\n\n<p>That fact has sustained me for years. </p>\n\n<p>Breakfast! There used to be an amaaaaaazing Cinnabon in the food court. Hell, there used to be a food court. Now there’s just a creepy-ass carousel that children are rightly afraid to touch.</p>\n\n<p>Forlorn, I’m stuck munching on cold cuts sandwiches, remembering the intoxicating aroma of cinnamon and warmth that would greet my day with all the sweet calmness of a warm blanket. For the record: fuck Amazon and your destructive, mall-crushing greed. Malls used to have everything, you see. </p>\n\n<p>I could pass the days just getting lost in Tavistock. I’d browse the Dick’s (Sporting Goods, you pervert), imagine that I had enough money to buy everything in Jimmy Jazz, and just stand outside the Bath &amp; Body Works. <em>Smelling.</em></p>\n\n<p>There was nothing like the Victoria’s Secret, though. I would come in and pretend to be looking for a gift that I could bestow upon my lovely “wife.” Really, I was pre-shopping.</p>\n\n<p>Sneaking into a lingerie shop after hours is <em>much</em> easier than you’d think, as long as you live in the mall. I was like a kid in a candy store. And to answer your question: yes.</p>\n\n<p>I smelled every single item in the store. </p>\n\n<p>You might be wearing one of my pre-sniffed garments right now!</p>\n\n<p>I promise you that it passed the sniff test.</p>\n\n<p><em>Smelling.</em></p>\n\n<p>But I still have to toss things up every once in a while! That’s where the holidays come in. I’ve pilfered a Santa uniform, a bunny outfit, several elf costumes, and a large dog-like getup that has no real explanation.</p>\n\n<p>Again, I’ve become such a fixture that people just accept my presence. I can spend an entire day in the middle of the mall, greeting children and being photographed by their smiling parents! No one doubts the authenticity of a mall Santa!</p>\n\n<p>Not even when I smell their kids’ hair.</p>\n\n<p>Now I know what you’re wondering: could something as wonderful as the Tavistock mall <em>really</em> be in jeopardy?</p>\n\n<p>I’m crying as I write this, because the answer is ‘yes.’ As the final doors close for the night, I prepare for bed knowing that I will soon <em>actually</em> be described as “homeless.” </p>\n\n<p>What a sorry state. </p>\n\n<p>While I walk down the abandoned central walkway (avoiding the Hot Topic even at night, because those people freak me the <em>fuck</em> out), I head to the seldom-used utility closet for a midnight snack.</p>\n\n<p>His glassy eyes take a moment to focus on me when I open the door. When semi-consciousness floats back into his brain, the young man is once again seized in terror. </p>\n\n<p>Fortunately, he can hardly budge against his restraints. The boy’s mutilated hands wouldn’t do him any good, anyway, because his fingers were the first to go. </p>\n\n<p>I pull out the carving knife, and slice a nice, thin layer of cold cuts from his belly.</p>\n\n<p>Sure, I complain about my sandwiches. But when the meat is fresh, cold cuts really aren’t that bad at all. </p>\n\n<p>Oh, boy! It’s a good thing that I knew how to slice out his tongue and sever his vocal cords, or he’d be making a racket! And you know what?</p>\n\n<p>That tongue made a <em>good</em> fucking sandwich.</p>\n\n<p>I pocket the cold cuts and the knife before closing the closet door on the convulsing boy. I do feel bad for him.</p>\n\n<p>Because this is what happens when you’re homeless.</p>\n\n<p>*</p>\n\n<p>The decision is final, and it’s nearly enough to shatter my heart: </p>\n\n<p>The Tavistock Galleria is closing forever in June.</p>\n\n<p>We all knew it was coming, really. But I didn’t want to believe it. I couldn’t.</p>\n\n<p>Though keep in mind that it’s <em>nearly</em> enough to shatter my heart. </p>\n\n<p>But not quite sufficient.</p>\n\n<p>See, malls have everything – don’t they? So why <em>should</em> I ever leave?</p>\n\n<p>I can’t find a reason, either.</p>\n\n<p>But what I <em>can</em> find is another mall! </p>\n\n<p>So I’ll be searching the country for the best possible fit. Nearly every major metropolitan area has one!</p>\n\n<p>I will search until I find one with everything I need: a Cinnabon, a department store, hidden corners, lots of children. Hopefully not a Hot Topic, but beggars can’t be choosy! </p>\n\n<p>Smell you <a href=\"https://www.facebook.com/P-F-McGrail-181784199029462/\">soon, folks.</a></p>\n\n<p><a href=\"https://www.reddit.com/r/ByfelsDisciple/\">BD</a></p>\n</div>\n","author":"ByfelsDisciple"}