{"rank":"4","title":"Demon Scars [Part 7]","id":"8m0wuw","url":"/r/nosleep/comments/8m0wuw/demon_scars_part_7/","time":"1527246606000","body":"<div class=\"md\"><p>Part 6 of 8: <a href=\"https://www.reddit.com/r/nosleep/comments/8l03vo/demon_scars_part_6/\">https://www.reddit.com/r/nosleep/comments/8l03vo/demon_scars_part_6/</a></p>\n\n<p>There we were in Randy&#39;s basement. Soaked in blood while watching this black shape float over Shane&#39;s butchered corpse. </p>\n\n<p>The room became bitterly cold. </p>\n\n<p>After what felt like an eternity but was probably only a minute, the shape disappeared into the air. The cold suddenly lifted as well. </p>\n\n<p>It was now late and we had to remove the body to the forest. We pulled a blanket off the couch and laid it next to the corpse. </p>\n\n<p>We had to move Shane&#39;s body out the front door and through the yard. I cringed at this next step. </p>\n\n<p>Looking at Shane now, he barely resembled a human. His face and arms appeared abnormally wrinkled, like a raisin. </p>\n\n<p>It was like the demon had sucked the very essence of humanity from Shane&#39;s remains. </p>\n\n<p>Even more surprisingly, all the blood that had covered the floor around the body was now gone, completely absorbed by the abomination. </p>\n\n<p>While Randy and I were very much bloody, the floors and walls were inexplicably spotless! </p>\n\n<p>This conveniently made the clean-up much easier. Great, since we didn&#39;t think to bring any cleaning supplies down with us.</p>\n\n<p>Randy&#39;s shock had worn off and he resumed his grim fascination with death. </p>\n\n<p>He held the head in place and I pulled the axe from the skull. He marveled at the wound and was impressed by my accuracy and strength.</p>\n\n<p>As he talked, we heard a noise upstairs that filled us with an unspeakable dread. </p>\n\n<p>The bolt to the front door clicked open and loud adult voices were heard laughing and yelling as they spilled into the house.</p>\n\n<p>Randy&#39;s mom had returned. With what we had to deal with, this was not a good time to have parents in the house. </p>\n\n<p>It appeared that Randy&#39;s mom had brought friends home from the bar and continued the party upstairs in the living room. </p>\n\n<p>Their drunken yelling drove our anxiety through the roof. </p>\n\n<p>We both nearly had heart attacks when we heard footsteps walking towards the basement steps and stop. </p>\n\n<p>Randy&#39;s mom yelled down the stairs to see if he was there. </p>\n\n<p>He calmly replied that I was over and we were peacefully playing video games. She said that there was pizza upstairs and then left back to the living room. </p>\n\n<p>She had not seen the body. What a fucking relief.</p>\n\n<p>Now all we had to do was change out of our bloody clothes and remove the body from the basement without any of the partiers noticing. </p>\n\n<p>Slim chance since there was probably half a dozen people upstairs. </p>\n\n<p>Randy said he could sneak past them and dart to his second-floor bedroom to quickly clean and change before grabbing some spare clothes for me. </p>\n\n<p>I argued that I should do it, as for whatever stupid fucking reason, Randy chose to wear a WHITE SHIRT on this day. </p>\n\n<p>I will never understand that decision. </p>\n\n<p>Attempting the trip shirtless wouldn&#39;t have done any better either. </p>\n\n<p>One glance would have Randy&#39;s mom wondering what shirtless teens were doing in the basement, sparking an immediate investigation. </p>\n\n<p>Either way, I was dressed in a black shirt and denim jeans, which made me stick out slightly less in the quick dash through the kitchen, past the living room, and up the stairs to the bedroom. </p>\n\n<p>Also, since none of the people knew me, it made it less likely that they would attempt to strike up a conversation. </p>\n\n<p>Remember that I had never even met Randy&#39;s mom and to this day have no idea what she even looks like. </p>\n\n<p>I was our best shot.</p>\n\n<p>I removed my bloody socks and wiped the blood off me as best I could. </p>\n\n<p>I took a deep breath and attempted my ninja-like ascent to Randy&#39;s room in hopes of solving half of our dilemmas. </p>\n\n<p>The pressure was stomach-churning.</p>\n\n<p>As I neared the ground floor I could hear voices from the living room and saw that the brightly-lit kitchen was empty. </p>\n\n<p>I tiptoed through the kitchen and neared the corner. </p>\n\n<p>As I approached the turn, a drunk middle-aged man walked right into me. </p>\n\n<p>He was startled by my presence and dropped his beer bottle on the floor, shattering it. </p>\n\n<p>I accepted this was the end. Randy and I were finished. \nBut by some miracle he promptly looked away. </p>\n\n<p>I&#39;m not sure if he was too embarrassed by his clumsiness or that he was uncomfortable to be drinking around minors, but he didn&#39;t look me in the eye. </p>\n\n<p>He didn&#39;t even notice the blood in my hair. </p>\n\n<p>I heard the others coming to inspect the crash. This was my split-second opportunity to escape the kitchen&#39;s light and bolt up the staircase where I was relatively home free. </p>\n\n<p>And like that, I was gone.</p>\n\n<p>With a new-found sense of relief, I made my way to the bedroom. Randy must have been at his wits end with all the commotion. </p>\n\n<p>Downstairs, I could hear Randy&#39;s mom berate the man as he sheepishly explained that he had dropped the bottle. He didn&#39;t even make mention of my company. </p>\n\n<p>I heard the others joined in on ridiculing the man, rendering him mute. It was hard to tell who was guilty of what around here. </p>\n\n<p>I quickly changed, cleaned and grabbed some clean clothes for Randy (black this time!). </p>\n\n<p>I wrapped my bloody shirt and pants in a black garbage bag from Randy&#39;s room and fucked off back to the basement, confidently avoiding any unwanted run-ins. </p>\n\n<p>Randy was elated by my arrival, but this was no time to celebrate. </p>\n\n<p>With the body securely wrapped and the blood-stained evidence in hand, we made our way outside. </p>\n\n<p>As for Shane’s severed fingers, Randy wrapped them in a towel and set them aside. He wanted to make a necklace out of them.</p>\n\n<p>It must have been from the surging adrenaline because Shane&#39;s body felt weightless. Without incident, we made our way through the yard and towards the trees. </p>\n\n<p>The sound of the party could be heard raging indoors as rain poured and lightning flashed. </p>\n\n<p>Randy lit the wooden torches ablaze and we ventured to the heart of the forest. </p>\n\n<p>By now, I thought our nerves would have calmed, but they were frayed raw by some hideous rustling from the trees around us. </p>\n\n<p>That indescribable stench returned and it sounded like some inhuman beast was thrashing through the trees around us. </p>\n\n<p>Randy reminded me to stay vigilant and to not lower the burning torch under any circumstances. </p>\n\n<p>The cannibal was stalking us.</p>\n\n<p>The rain drenched the wooden torches and they struggled to stay alight. We stayed the path to the fireplace and Shane&#39;s makeshift grave as the creature&#39;s repulsive grunts and growls encircled us. </p>\n\n<p>Every now and then I caught the glimpse of a tall skinny shape in the trees. </p>\n\n<p>Our torches continued to dim, and the fireplace would have to be stoked immediately.</p>\n\n<p>We finally got to the clearing and the light from the torches now held a dull orange glow. </p>\n\n<p>The Sound of the beast was getting sickeningly close. </p>\n\n<p>We dropped the body and Randy handed me his torch, ordering me to hold them high into the air. Someone (or something) had scattered the carefully placed fire wood from hours before. </p>\n\n<p>Randy scrambled to assemble the logs while I played sentry. I struggled not to imagine being devoured alive. </p>\n\n<p>Randy and I were back-to-back as he desperately started to build a roaring fire. </p>\n\n<p>I held the torches overhead as their flames continued to weaken. </p>\n\n<p>And then I saw it. The cannibal was no longer threatened by my smoldering sticks. </p>\n\n<p>It came out from the bush and slowly approached, its emaciated sunken features showed bare teeth where lips should have been. </p>\n\n<p>Black wiry hair hung from its pale disgusting scalp and its white lifeless eyes stared at me unblinkingly. </p>\n\n<p>It was tall and would have been gigantic if not for its frail stature. </p>\n\n<p>Its limbs and torso were lanky and gaunt, like those mournful pictures of starving Somalians in National Geographic magazines. </p>\n\n<p>As the abomination crept forward, it raised a hand and reached for my face. </p>\n\n<p>Like Randy had always stated, the flesh from its fingers was completely gnawed off, uncovering bony white knuckles.</p>\n\n<p>In terror, I closed my eyes and pressed the burning ends of the sticks together. I felt a few pitiful sparks spray down. </p>\n\n<p>I heard the creature snarl and step back as I felt the divine heat from the fireplace hit my back. </p>\n\n<p>Randy had done it. The fire was lit and the cannibal repelled. </p>\n\n<p>When I opened my eyes it was gone, and the vile stench that had bombarded us began to dissipate.</p>\n\n<p>Randy, unrattled and possibly unaware of the cannibal&#39;s proximity, lifted one end of Shane&#39;s body. </p>\n\n<p>I had forgotten which end was head and which was toe. We dropped the corpse into the ground and began covering it with dirt. </p>\n\n<p>I&#39;m not sure if it was from my crippled imagination or the flames flickering shadows, but it appeared that Shane&#39;s body was writhing as we piled more and more dirt on to it before it was completely swallowed by the earth.</p>\n\n<p>Without a word Randy and I worked in unison. It was like we now perfectly knew each other&#39;s thoughts. Like we had become fluent in telepathy. </p>\n\n<p>After the body was buried, we tossed the bag of bloody clothes into the fire and sat back as we watched them reduce to ashes. </p>\n\n<p>Next, we threw the axe and broken knife into the blaze.</p>\n\n<p>It was time to go. We relit the torches and ventured back. The trees were still this time. </p>\n\n<p>The ritual was complete. Through frustration, anticipation, and set-back, we had achieved our goals. </p>\n\n<p>We had narrowly avoided being caught by human, demon, and cannibal. </p>\n\n<p>Would we now possess superpowers and be able to fly? I don&#39;t know, but all that shit they tell you in school about self-belief is true. It&#39;s impressive to know what you can do when you set your mind to it.</p>\n\n<p>When we returned through the storm, the house was quiet and dark. Either the party had ended or was moved elsewhere. </p>\n\n<p>It was time for me to go home. I got on my bike and watched Randy as he opened the door and went inside. </p>\n\n<p>As I rode off in the rain, I glanced back at the house and the big tree in the yard. </p>\n\n<p>Through the darkness, I saw bodies hanging from the branches. And I saw Shane. Standing under the porch light.</p>\n\n<p>Part 8 of 8: <a href=\"https://www.reddit.com/r/nosleep/comments/8max4s/demon_scars_part_8/\">https://www.reddit.com/r/nosleep/comments/8max4s/demon_scars_part_8/</a></p>\n</div>\n","author":"Rich_Brady"}