{"rank":"22","title":"I Remember the Night I Died","id":"8m0yvh","url":"/r/nosleep/comments/8m0yvh/i_remember_the_night_i_died/","time":"1527247215000","body":"<div class=\"md\"><p>I remember the night I died, I remember the feeling of my life draining away, the paramedics ripping my blouse to try to save me, and the dark nothingness that waited on the other side. I don’t think I should be alive, I felt my life end, and every day for eleven years I sat in darkness, yet somehow I am sitting here, typing this, desperately trying to find answers to questions I don’t want to ask.</p>\n\n<p>This morning I felt sun on my face for the first time since 2007. I opened my eyes nervously, unsure what to think of the light. I noticed that there were blackout curtains on the window, but it seems they’d been left open just a touch. I stood, hearing what sounded like breaking glass with every move I made. I walked to the window and slowly pulled the curtains open, shining light on the small room I was in. A dingy bed was in one corner, surrounded by empty liquor bottles; an old computer sat in the opposite corner, the one I’m using to post this.</p>\n\n<p>I left the room and explored the apartment I was in. There was another room set up exactly like mine, the computer looked a little more modern than mine though. There was a bathroom with nothing in it, and an empty kitchen as well. In the living room, there was a ratty couch, a nice TV and my Xbox 360, which I had gotten for my birthday, a few weeks before I was murdered. I noticed that there was a phone connected to the wall, by the TV. </p>\n\n<p>I used it to try and call my parents, but their number was disconnected. Theirs was the only number I remembered, neither of my older sisters had a phone. I went back to my room and booted up the computer, and that’s when I noticed the date. It might be nothing, but I died on this day, eleven years ago. That made me pause for a minute, but I remembered that I needed to get on Myspace and message my sister. </p>\n\n<p>It didn’t take long for me to realize that Myspace was dead, and that I needed to find another way to message her. I checked my email and saw that I had a ton of messages from Facebook, of all things. I could vaguely recall opening an account, but I didn’t use it for much other than games. I logged in and saw I had quite a few notifications. Most were from games, but a few were from my older sister, Ella. </p>\n\n<p>“I’ll see you soon! I can’t wait for things to be back to normal!” was what she had said. It was posted a week ago, with several people replying, asking what she meant and if she was okay. My sister hadn’t replied to any of the messages. It looked like she was online now, so I decided to reach out to her.</p>\n\n<p>“Hey sis, how are you? Tried to call mom and dad, but their number is disconnected. I love you, let’s hang soon,” was the short message I sent her. She looked at it and then I was promptly blocked. I assumed that something had happened in the time I’d been away and she was mad. I decided that if she wasn’t going to help me, I’d find things out for myself.</p>\n\n<p>I searched Google for my name, but nothing came up. Only a few spam sites, saying they had records for people with my name for a small fee. I figured that my death would have made local news, if it didn’t get some national recognition. It worried me, but it worried me more that there was nothing in the news or on Facebook about my friend Kelsey Hagar, either. She had called me the night I was murdered and asked me to come over to help her with a paper and was the last person I talked to.</p>\n\n<p>I can’t find anything about it in the news, but I remember it vividly. Kelsey called at 7, she had just found out that the sources for her essay were all satire sites and she needed help finding new sites to back up her arguments in her essay. She didn’t get the best grades and had put a lot of work into this paper, so finding this out was a huge disappointment to her. I could hear it in her voice, she was devastated and it sounded like she’d been crying. </p>\n\n<p>“Please, Amy, I need you. You’re the only one who can do this for me. If I don’t get a good grade on this, I won’t pass the class,” her voice was shaky, she was breathing hard.</p>\n\n<p>“Kels, calm down. It won’t take long to find new sources. I’ll come over in a little while, I’m in the middle of someth-” she cut me off with a weird sounding shriek.</p>\n\n<p>“No! It has to be now. Please come. I need you, just get here as fast as possible.”</p>\n\n<p>She was always overreacting, but I figured if I didn’t get over there fast it would just get worse. I left a note for my mom and left for Kelseys. It was about a 30 minute walk on the main roads, but if I took the alleys it would only be about 10 minutes. It was a no-brainer, the faster I got Kelsey’s essay figured out, the faster I could get home and get my own finished. I couldn’t just be smart, I had to be fast too. </p>\n\n<p>I wish I had seen the man who was watching my house. If I had, maybe I would have taken the main road, or maybe I would have told Kelsey I couldn’t help her, but I didn’t see him. He was good at hiding and being quiet. I was less than half a block from Kelsey’s house when I heard his footsteps behind me.</p>\n\n<p>“Don’t run, or you’ll regret it,” I heard his gruff voice, his breath hot against my neck. “Just take it easy and you’ll make it home.”</p>\n\n<p>My blood turned to ice and I listened to my instincts. I bolted, knowing that if I just made it half a block I would be safe in my best friends house. I instantly regretted it, as I felt something pierce my back, stabbing through my right lung. I screamed, a horrible and bloodcurdling sound, and heard a woman call that she’d called the cops. I heard sirens in the distance. I fell to the ground.</p>\n\n<p>I felt his breath on my face, it smelled like death. He whispered in my ear, “I warned you not to run. You would have gotten home. You girls never listen, you always pay. Now she’ll pay too.” I could hear sirens in the distance, they were so far away. “They’ll arrive as you die. I can feel it and now you can too. Maybe next time, you’ll listen.”\nI knew he was right, there was no way I could stop the bleeding enough for them to get here in time to save me. Whatever he had stabbed me with had gone completely through, leaving me with a torn lung and a gaping wound. Every breath felt like I was drowning, and I probably was. I applied pressure and saw the lights of the ambulance coming closer, but I knew that it was too late. I lost consciousness as the ambulance pulled up next to me, and when the paramedics began to move me, I felt the last of my life drain away and everything went dark.</p>\n\n<p>For eleven years, I sat in the darkness, knowing that I was dead. Then I woke up this morning, and now I can’t find anything about it on Google. According to Google, nothing happened that night, and Kelsey Hagar never existed. I don’t want to question it too much, but I can’t help but wonder some things… Why do I get a second chance? Why won’t my sister talk to me? If that night didn’t happen, why do I have a scar on my chest? What did I do to deserve my fate, and will I have to go back to that awful place? There’s just so many things left unanswered, and I’m hoping someone here can help me.</p>\n</div>\n","author":"thrashm"}