{"rank":"204","title":"Never Talk to a Demon in a Bathroom Stall","id":"8m0yim","url":"/r/nosleep/comments/8m0yim/never_talk_to_a_demon_in_a_bathroom_stall/","time":"1527247107000","body":"<div class=\"md\"><p>In all honesty, I had no business being at the club then. Firstly, it was a Tuesday night. Studio 97 was one of the only places that was open on weeknights. Secondly, I had work early the next morning. I should have been at home in bed. Thirdly, I had just broken up with my boyfriend of over a year a few days before. Studio 97 was the <em>ideal</em> place for me to lose my head and pick up someone I would regret in the morning. And lastly, I was alone. It&#39;s not a good idea to get drunk and put yourself at the mercy of your fellow clubgoers without having a friend to either snap you out of it or back you up.</p>\n\n<p>Needless to say, it was a recipe for disaster.</p>\n\n<p>In the minutes leading up to it, I actually wasn&#39;t that drunk. I had had about...three or four drinks. Tipsy but definitely not falling over. The floor wasn&#39;t that full (it was a Tuesday, after all) but it had substantially more people on it than I would have guessed. The songs began to turn over from harder techno to more subdued synthpop. Most of the dancers took this time to leave the floor and get drinks, regroup with friends, or use the bathroom. I took the third option.</p>\n\n<p>Pushing open the door, I stepped inside. It was lit only by a strip of red lights running over the top of the mirror, casting the whole room in a crimson glow. The metal was all a shiny chrome that reflected the lights. It smelled better than a club restroom usually did and seemed to be deserted.</p>\n\n<p>I did my business, washed my hands, and turned to leave. Just as I put my hand out, I heard the doors to one of the stalls creak open behind me.</p>\n\n<p>It wasn&#39;t the normal sound of someone just opening it and stepping out. It was a slow, creaking noise, like a door squeaking open in an old haunted house movie. Against my better judgement, I turned around. The red lights darkened the room significantly, making it difficult to see who or what was in the stall.</p>\n\n<p>Just when I thought about just leaving, I saw a girl step out. She was rubbing her nose with the back of her hand and snuffling loudly. Dressed in a skimpy black dress and high heels about two inches too tall, she was mumbling under her breath.</p>\n\n<p>&quot;Need more. Need more. Got to find him. Need more.&quot;</p>\n\n<p>She walked over to the sink and absentmindedly ran her hands under the water. At last she seemed to notice me and looked up, giving me a bleary-eyed stare. &quot;Do you work for him? Can you hook me up?&quot;</p>\n\n<p>I stared, struggling to form words. &quot;I...no. Who are you talking about?&quot;</p>\n\n<p>Instead of answering she abruptly turned off the faucet and darted towards the door, shoving me aside and running back into the club. It swung shut behind her, leaving the bathroom in its crimson darkness.</p>\n\n<p>The stall was still open. Curiosity overtook me. I crossed the room and grabbed the door, pulling it wider and peering into the cramped space.</p>\n\n<p>My stomach dropped.</p>\n\n<p>He was perched upon the seat, almost human but not quite. At first glance, I thought the abyss of black feathers was a suit, but as I stared it became eerily clear that something was very wrong. Something about his shape, or perhaps the way his eyes were set into his face was amiss, inhuman.</p>\n\n<p>His head twitched and tilted to one side, like a curious dog waiting for instruction. My legs wanted to stumble away or crumble beneath me but my mind held them firmly in place.\n“Ni- nice suit…” I tremblingly whispered.</p>\n\n<p>“You too.” The thing replied. He unfurled his leg from the the top of the lid and onto the stained tiles. Standing straight he was almost eight feet tall, and felt every bit of it. As he moved towards me I swung myself aside to avoid him. Despite my maneuver his arm still found its way onto my shoulder for a momentary pat, that felt like he meant to reassure me but instead it only sent a spasm down my spine.</p>\n\n<p>The red strips that lit the room flickered. I could have sworn the room didn’t look quite this dismal when I entered…</p>\n\n<p>The thing ducked out of the door and it swung to a close. Then I noticed out the corner of my eye something creeping out from the stall next to me. It was blooming outwards towards my shoes, and even in the red light I could tell what it was, so vividly crimson.</p>\n\n<p>I screamed and fled, slamming through the bathroom door and stumbling out. The music had stopped but the lights still spun and flashed, displaying the horror of the dancefloor in a strobe. Piles and piles of club goers, strewn this way and that. Each one looked more gored and wretched than the last. I heard the familiar cry of a crow as the stench hit my nose.</p>\n\n<p>“Are you okay?” Came the voice, like a shy child. There he was, sat comfortably across a speaker on the stage, a murder of crows perched all around him.</p>\n\n<p>I struggled for words but couldn’t find any, instead I looked back to the strewn corpses, now seeing the hordes of crows that pecked at each and every one.</p>\n\n<p>“Oh, them? They’re only dead for now.” I heard the slight British twang to the skin crawling voice that issued forth from his beak.</p>\n\n<p>“What are you talking about?”</p>\n\n<p>“Don’t worry, I’ve only done this so we can play a game. Would you like to play?”</p>\n\n<p>I struggled for words but found none.</p>\n\n<p>“It’s a simple game. When we’re done, you can go back. You might even be able to go back with more than you came, if you play correctly.” A crow somewhere amid the dancefloor cawed and flapped its way over, landing upon the thing’s outstretched hand.</p>\n\n<p>“The girl before you gambled a little more than she could pay, but you’re going to play a much more interesting game - I can already tell. The rules are simple, so I hope you’re listening: First, You tell me something you want, then I tell you something I want, and if you do what I want, I&#39;ll make sure what you want happens. Oh, and if you don&#39;t do it, or if you tell anybody about our little game...&quot;</p>\n\n<p>His head tilted backwards, turned around to look at something on the dancefloor. He didn&#39;t have to say what would happen to me.</p>\n\n<p>He was looking at the body of a dead club-goer on the floor. That dress, It was the girl from earlier, the one from the bathroom. A crow was picking out one of her eyes with its beak.\nThe bird-man chuckled with a child&#39;s laughter, coming from behind me.</p>\n\n<p><em>This can&#39;t be for real right? No way he could actually... No.</em></p>\n\n<p>&quot;I... I... Don&#39;t know what to say... I just want to go home.&quot;</p>\n\n<p>&quot;I don&#39;t think you&#39;d like doing what I want you to just for that.&quot;</p>\n\n<p><em>Maybe... Eric? Could I go back... No. I need to get out of here.</em></p>\n\n<p>&quot;Can&#39;t I just leave?&quot; The crows around us began making a terrible noise. He spun his head in place for a moment before they quieted down.</p>\n\n<p>&quot;Then how would I get what <strong>I</strong> want?&quot; He had a needy quality to his voice, like a child being denied his play-thing. &quot;Tell me what you want, and it&#39;ll all be over by sunrise.&quot;\n<em>All or nothing</em> I guessed.</p>\n\n<p>&quot;I want to go back, a week... no, not that, a month. To before I saw Eric at that party, I want to go back to before I had the fight with Josh, can you do that?&quot;</p>\n\n<p>&quot;Sure h-honey.&quot; His voice jerked, almost like he was about to squak. &quot;I just want you too...&quot; His head did that weird turning thing again, I realised he was scanning the room for something. First he zeroed in on a dead dancer, an older middle-eastern man, but then he just zoomed past it. Ran to some dead businessman with a suitcase.</p>\n\n<p>He pranced towards it, picked it up and opened it on the floor with a ransacker&#39;s glee. A collection of men and women&#39;s erotica magazines poured out. He didn&#39;t seem to show any interest in them, all he wanted was the case. He ran back and laid the case beside him.</p>\n\n<p>His beak made it the full 8 feet of his height down as he pecked at the dead man&#39;s exposed stomach, as he spilled guts and viscera into the suitcase before closing it.</p>\n\n<p>&quot;Here.&quot; He held it by the handle. &quot;Take it.&quot;</p>\n\n<p>It was wet and dripping on the outside as I held it. Bits and pieces of the dead man clung to the leather exterior. My face was a mix of tears and convulsions from holding back vomit.</p>\n\n<p>&quot;There&#39;s a hotel across the street. I want <em>you</em> to put this case in room 66G.&quot;</p>\n\n<p>&quot;I just want to die.&quot;</p>\n\n<p>His voice began screeching again. &quot;That&#39;s not what you said you wanted from me. Don&#39;t make me angry. You&#39;ve got until sunrise alright? W-what is that, 92 minutes now? Just get going.&quot; He turned away from me. Running over back to the middle-eastern man. As he began pecking at him again the big neon signs all over the club begun to change.</p>\n\n<p><em>Studio 97</em>  became <em>Studio 92</em>, and as I stood there mesmerized for a moment, it turned into Studio 91.</p>\n\n<p><em>Fuck.</em></p>\n\n<p>I held the suitcase tight as I ran out into the dreary streets. I was quite familiar with the hotel he asked me to go to. How did he know all of this about me? The many escapades I’d had there with Eric. And what sort of game had I walked into? I found my heart beating faster as I stepped into the lobby. It seemed colder and darker than I ever remembered it being. The clerk was busy checking another guest in so I slipped by to the elevator.</p>\n\n<p>Something caused the elevator to rock side to side as I rode up to the floor. When I reached the room in question, the dripping suitcase clutched tightly to my body, the door was already open; as though someone was expecting me.\nAs I stepped inside the room, a foul odor overcame my senses. The carpet seemed to move and sway before my eyes as I looked at the lone occupant on the queen bed.</p>\n\n<p>It had the face of a man, but besides that, nothing about it resembled a human. It’s neck was craning out like a giraffe and it’s body almost resembled that of a slug, with long pools of slime dripping from its body. It had no arms or legs to speak of, just a gelatinous naked form writhing on the bed.</p>\n\n<p>A worm, it was a giant fucking worm. I scrambled to leave the room, but found the door no longer there. “Another gift? When will Kutkh learn?” its voice sounded hollow as it took it from my arms and swallowed it in one ferocious gulp.</p>\n\n<p>Its wide eyes probed me as more saliva dropped into the infested carpet, a thousand tiny larvae squirming about. “Run along little one.” it said as I saw the door reappear before my eyes.</p>\n\n<p>As I walked briskly through dark, twisting streets back towards the club, I saw now that it was 64. Happy late-night bar crawlers walked past me. Many of them gave me dirty looks or moved away. Understandable. My shoes and dress were stained with gore and my face was probably a mess of run makeup and mascara. I could have been a drugged-up prostitute or an escaped mental patient. Great public image.</p>\n\n<p>My feet reached the road. Across from me sat the studio, only a short distance away, but to me like another world. Hard techno music had started back up again and I saw the faint flashing of  lights coming from the doorway. I could have ended it all here. Turned back around and pretended like all this shit never happened. Rented a hotel. Gotten a better job. Maybe even gotten into good, decent relationship that wasn’t built on lies.</p>\n\n<p>My feet stepped onto the road. No turning back now. I pushed open the glass doors reluctantly. A blast of stench and warm air hit me in the face like a wall. The floor was a mural of blood and guts. They had been arranged into a gory recreation of my face. It may have been made from the insides of two dozen people but there’s no doubting that it was me. I stumbled backwards and vomited violently onto the floor.My eyes drifted upwards to see something even more terrible. The bird man…Kutkh... whatever he was called.  He had piled up the bodies and was sitting on them glamorously like some sort of king. Crows littered the pile and flew around him in a cloud. \nHe squawked and flapped his feathered wing-arms together.\n“S-so, you delivered the case?”</p>\n\n<p>I nodded, trying not to let the tears gathering at the edges of my eyes free. Then I remembered. his side of the bargain.</p>\n\n<p>“So, you’ll send me back? To before it all happened? To before the party, to befo-“</p>\n\n<p>“Y-ye-“</p>\n\n<p>He vomited up a chunk of bloody meat.</p>\n\n<p>“Yes. I am a bird of my word.”</p>\n\n<p>He began to giggle at that statement.</p>\n\n<p>“So… how does this work? Do I like run really fast, or make a wish-?”</p>\n\n<p>The bird-man squawked in what sounds like laughter.</p>\n\n<p>“N-no! Nothing like that. Just stand still and think about the exact date you want to go back to.”</p>\n\n<p>I thought about a date. Exactly one week before the party. Before everything happened.</p>\n\n<p>“I’m ready.”</p>\n\n<p>The bird man squawked and began flapping his wings manically. Feathers started to fill the air. A strong breeze started to blow from somewhere. The air was thick with black bird dander now. I was choking on it. A swirling storm of blackness.  A crow cried from somewhere far away. Suddenly, a bright light filled my eyes and my body was thrown backwards. The environment around me was still black, but it was a different kind of black. Like night-time black.</p>\n\n<p>And then I saw the stars, and the moon,realized... I was  falling from the sky. I saw buildings getting closer, and closer, and- There! I saw my apartment, then me, on my couch. I drew closer and closer, I connected, and I became myself.</p>\n\n<p>I sighed deeply, got up, and walked over to the fridge. I didn’t even realize I was doing it, one of those automatic things that you just do when you’re hungry, I told myself. I grabbed a snack, and started munching on it.</p>\n\n<p>A text binged in on my phone, and I grabbed it out of my pocket.</p>\n\n<p>“Hey girl! There’s this great party happening on Friday, don’t make other plans!”</p>\n\n<p>Perfect, I thought. All I have to do is tell Stacey I’m not coming, stay home Friday, and my relationship would be saved. I started typing a response.</p>\n\n<p>“You know I’ll be there!”</p>\n\n<p>No, that’s not what I wanted to write. I moved to delete the words, but to my horror, my thumb moved straight to the send button.</p>\n\n<p>Sent!</p>\n\n<p>Oh god no. I tried to move my arm, to stop the text, cancel the plan, but I couldn’t. My body walked over to the couch, all the while I was trying as hard as I could to turn back and pick up that phone. Nothing happened. My body kept moving around, ignoring my every attempt at stopping myself from going to that party. Icy realization hit: I would have to relive the whole damn thing, like watching a slow motion trainwreck unfold, knowing how to avert the crisis but completely unable to do anything.</p>\n\n<p>Let me tell you, fear without adrenaline is a strange feeling.</p>\n\n<p>To be honest, they were all strange feelings. I wasn’t able to move my body, but I could feel everything. My body stubbed its toe, my body got scared, my body got drunk, I felt it. When Josh kissed me, oh, I felt it. I tried to treasure every single moment of the last time I slept with him; I knew this time knowing it’d be the last, but it was difficult when I knew that the next day I would go to the party and break both our hearts. When I locked eyes with Eric at the party, I felt that too. I felt the excitement, the warm glow of the alcohol, the way my body reacted when he touched me, and I felt the hangover, the panic, the shame the morning after when I woke up in his dirty apartment on the mattress on the floor and realized what I had done, the profound anxiety as I knew my body was debating in its head weather to tell Josh, the pain of having to tell him, and the heartbreak when he told me it was over.</p>\n\n<p>It was way worse the second time around.</p>\n\n<p>That fucking bird tricked me.</p>\n\n<p>The week leading up to the infamous night in Club 97 was unbearable. The closer the time drew the more I tried to resist it. The everyday actions before that night made me want to vomit. Every meal eaten, TV show watched, hour slept was a living nightmare. Getting ready hours before was the worst, however. Putting on my makeup, slipping into that too-tight dress, aware I was drunk but unable to do anything about it.\nAs I walked up to the club, I saw something odd. The sign no longer read <em>Studio 97</em>. It now read <em>Studio 0</em>, with the lights inside the 0 blinking on and off sporadically. I had no idea what that meant and I didn’t want to find out, but I continued on unwillingly inside.</p>\n\n<p>The booming music and frantic dancing of my fellow clubgoers sent waves of pain and discomfort to my head. The music died down. Screaming internally, I was carried across the floor to the bathroom where it all had started. Why hadn’t I just left? Or at least gotten a drink?\nWhen the door swung open, however, I was greeted with a different sight than the one I had seen the first time.</p>\n\n<p>The lights were now a dark blue. The floor was cracked and stained, the chrome fixtures grimy and disused. Some of the stall doors hung off their hinges and the water puddled in the sink was a sickly yellowish color.</p>\n\n<p>From the now-familiar final stall came quiet sounds. </p>\n\n<p>I tried taking a step forward. It worked. I took another. The same result. I was in control again! Instantly I turned to leave, but found the door was gone, only a blank, soot-stained wall.  Something about the situation seemed disquietingly familiar. Right as I made the connection, the final stall swung open and I heard a sickening, wet thwap as something hit the floor.</p>\n\n<p>The slimy voice that greeted me sent shivers down my spine.</p>\n\n<p>“When will Kutkh learn? These payments can’t go on forever.”</p>\n\n<p>I whirled around and saw it. The slug...worm...man thing from the hotel room. It was sliding out of the stall and leering towards me, it’s head stuck out almost offensively on that long neck that protruded from it’s lumpy, misshapen body. </p>\n\n<p>“Kutkh is disposable compared to the others. He answers to the ones above. He had you fooled didn’t he? Him and his little games.”</p>\n\n<p>I struggled for words but all I could manage was a thin gasp of fright.</p>\n\n<p>The eyes seemed to pulse in their sockets, empty black pools which absorbed all light. “He only does that with the messengers so he can have his fun. Hand-delivering it is never preferable to getting poor mortals like yourself to do it for you.”</p>\n\n<p>The wall seemed to be shifting behind me, bending and pulsing against my back. I tried to ignore it.</p>\n\n<p>“Time-skipping is easy for ones like us. It only took moments to locate whatever line you were on. Anyway, I’ve grown sick of dead meat. Where’s the enjoyment if you can’t feel it struggle as it slides down your throat?” </p>\n\n<p>He opened his mouth as his eyes rolled back into his head, causing a black, oil-slick tongue to loll out between his teeth. It opened a small mouth of its own, which released an ear-splitting screech that reverberated around the room. It lashed out at me quick as a viper. Jumping out the way, I fell to the floor as it smacked against the wall with a dull thud. The creature rolled, squelching as it went, towards the corner where I lay. </p>\n\n<p>Just then, the wall shimmered and buckled as a black shape flew through it at lightning speed, a blur of black wings. Just as the tongue struck towards me again, I saw a long, thin shape rise up and enter in the soft flesh just below the creature’s neck.</p>\n\n<p>It shrieked in pain and rolled back just as the shape withdrew. Looking up, I saw oily black blood dripping from the end of a bird’s beak.</p>\n\n<p>Kutkh?</p>\n\n<p>Before I could do anything else, He stabbed down again, piercing the blob across its neck again. It hissed and clacked its teeth together at him but its eyes betrayed its fear. It tried rolling forward, pinning him underneath it, but he was too fast, stabbing him in the stomach this time. A sea of black cascaded out of the wound, washing over the floor like a wave. One last stab sent the neck, head attached, flying across the room and smacking into the wall, leaving a black stain as it slid slowly down.</p>\n\n<p>A feathered hand grabbed my own and lifted me to my feet. I was dirty and covered with black splotches. Pulling me to the center of the room, Kutkh stared at me, his head cocked sideways.</p>\n\n<p>“You lost your bet, little one.”</p>\n\n<p>I remembered the changed number from outside the club. He continued. “Your wish still entrapped you in the game. You ran out of time long ago.”</p>\n\n<p>A shiver ran down my spine as I stared at him, the black blood dripping onto the floor from the end of his beak. “But in the end, I have to thank you.”</p>\n\n<p>I stared at him in disbelief.  “The only way the worm leaves his room is to collect at the end of the bet. If you hadn’t failed he wouldn’t have left, and then I wouldn’t have been able to kill him.”</p>\n\n<p>I still had no idea why he was thanking me.</p>\n\n<p>“Now that the Worm is dead, I have moved up into his place. I will be taking his spot in the hierarchy.”</p>\n\n<p>I felt the wall shifting behind me again. “So, thanks to you, I have risen up.” He cocked his head again. “Still, you lost the game. I should kill you. But I will not.”</p>\n\n<p>The music returned outside. “Leave, little one. Just because I let you go now does not mean I will have the same feelings later.”</p>\n\n<p>With that, he shoved me towards the wall. I tripped over my own feet and felt a cool sensation, as if I was passing through something. Before I knew it, I was landing on my back in the hallway, hard techno music blasting from nearby.</p>\n\n<p>Getting to my feet, I pulled the bathroom door open. The red light greeted me, along with the shiny chrome fixtures and clean floor. All stall doors were open, revealing no one inside.\nI stumbled out of the hallway and across the dancefloor, eyeing some of the people as I passed. I saw a Middle-Eastern man dancing wildly in the center of the floor. A man in a suit, holding a briefcase, pushed through the crowd. At the bar, a young woman with too-high heels and a skimpy black dress was ordering a drink.</p>\n\n<p>I stepped out into the night, dreamily blinking my eyes and heading back towards the direction of home.</p>\n\n<p>A loud noise erupted overhead. Looking up, I had just enough time to see a crow diving towards me, releasing something, and disappearing into the night sky.</p>\n\n<p>A note.</p>\n\n<p>I unfolded it, reading it by the glowing lights of the club.</p>\n\n<p><em>Ready for round two?</em></p>\n</div>\n","author":"step_up_step_down"}