{"rank":"9","title":"My brother doesn’t exist anymore","id":"8m0ybg","url":"/r/nosleep/comments/8m0ybg/my_brother_doesnt_exist_anymore/","time":"1527247050000","body":"<div class=\"md\"><p>If you&#39;ve lived in Twin Falls Idaho for very long than you have likely heard the tale of the Singing Bridge. </p>\n\n<p>It&#39;s a pretty standard urban legend, but I will summarize as best as I can. </p>\n\n<p>The area in question is  near Shoshone Street South, called Rock Creek Canyon. \nNear the top you may notice a staircase that leads to some peculiar looking stones. </p>\n\n<p>They almost look like the faces of children, and according to the tale there was a man that held them captive down in a cave at the bottom of the winding trail. Some people even thought he was a devil. \nAnd I can confirm that because on what happened to my brother. </p>\n\n<p>Up until the age of 13 me and my older brother Gary were inseparable, we did a lot of things with our friend Kyle including getting into all sort of trouble down in the canyon. </p>\n\n<p>Our parents always told us not to stay down there after dark mostly because a lot of homeless people roamed the area and there was even times we saw a few of them rummaging for scraps in the desolate area. </p>\n\n<p>This particular night I will never forget cause Gary had the bright idea to go salvage a bike he saw from the bridge. Kyle didn&#39;t make any objections despite the hour. \nWhen we finally made it to the bottom of the ravine I realized there was a reason for me feeling uncomfortable. </p>\n\n<p>There wasn&#39;t just a bike lying there but the figure of a frail little girl. She had probably been riding too fast near the edge and plummeted to her death. </p>\n\n<p>I think Jake might have puked when he saw her crushed skull. \n&quot;Aw man that sucks,&quot; Gary said as he checked the bike. \n&quot;Are you crazy? I&#39;m not stealing a dead girl&#39;s bike,&quot; I told him. \n&quot;Finders keepers,&quot; he said nonchalantly. \n&quot;God you are so annoying! I wish you were dead!&quot; I shouted. \nSomething stirred in the cavern near by. \nThe three of us froze. \nWe had thought we were alone in the cabin but now this imposing man was staring down at us from atop a strangely shaped rock. </p>\n\n<p>He was dressed in all black with a long scraggly beard and smoking something as he cleared his throat and said, &quot;You needn&#39;t worry about the girl, I&#39;ve taken good care of her.&quot;  </p>\n\n<p>&quot;What do you mean?&quot; Kyle asked in confusion. The man gestured to a nearby group of rocks. We looked toward it and I remember thinking how the formation looked like faces. \n&quot;Your eyes do not deceive you. For any lost child in these parts, I make sure they are never forgotten,&quot; he said. </p>\n\n<p>&quot;Who... whoa are you?&quot; Kyle asked. \n&quot;Raditas, it&#39;s a pleasure to meet you three hooligans. I don&#39;t often see any children before they die,&quot; he commented. \nGary started to run. Then Raditas flicked his finger and something long and oily spiraled thru the air. \nIt hit my brother in the back of the head and he fell to the ground and started to convulse and foam at the mouth. </p>\n\n<p>I was shaking, not sure what I was seeing. \n&quot;What the hell?&quot; Kyle said. He moved to leave and then the strange man made another flick and held him up in the air like a puppet on strings. \nFinally my brother stopped moving and fell unconscious. </p>\n\n<p>I saw Kyle&#39;s eyes roll back in his head and then Raditas spoke, &quot;I am offering you a choice, a life for a life. One of these will die the other shall return to you. But know this the one that returns will only remember themselves. The one left behind will be forgotten except for by you. Now choose.&quot; </p>\n\n<p>It was an impossible choice. My brother or my best friend. One would die, the other live. I knew I couldn&#39;t live with myself no matter what. I was having an asthma attack trying to decide. </p>\n\n<p>Then I closed my eyes and thought of all the times Gary was mean to me or picked on me. I don&#39;t know if Raditas was  helping me recall it or not but the fond memories were hard to find. I realized I didn’t like my brother as much as I thought. </p>\n\n<p>&quot;Kyle, please save him him,&quot; I decided. </p>\n\n<p>The whole thing seemed surreal. Both Kyle and I blacked out and woke up near the bridge. The constant traffic woke us up shortly afterward but Kyle looked very confused. I even asked him about Gary and all he said was, “Who’s Gary?”</p>\n\n<p>That was so long ago, and for a while I have thought I made the right choice. No one remembers my brother except for me. Raditas saw to it to keep his end of the deal. I was never bullied again. </p>\n\n<p>Recently though things have changed. You see I still live close to the old singing bridge and my two boys play near it from time to time. </p>\n\n<p>John mentioned the other night he met a man that knew me and I asked him what did he mean. \n&quot;The old man near the edge, he said he was a friend of yours,&quot; he said. His brother James seemed especially upset about the situation and I prodded a little further. \n&quot;What happened?&quot;\n&quot;He made us play a game,&quot; James said. \n&quot;Said If we both won we would get a prize,&quot; he said. \n&quot;What was the prize?&quot; I asked growing concerned as I listened. \n&quot;He said he would make one of us permanently his property,&quot; James said. \n&quot;Who was this guy anyway?&quot; I asked still not seeing the connection. </p>\n\n<p>&quot;He called himself Raditas,&quot; John said. That was enough for me to go get my jacket and head for the bridge. </p>\n\n<p>The landscape itself seemed harder to traverse thanks to the additional trees now provided by Mother Nature. I found the stairs though and descended to the bottom. </p>\n\n<p>I found the old rocks, the ones where my own brother Gary resided now forever etched in stone and search for any kind of clues for what John and James had seen. \nThere were plenty of other stone carvings here and there but nothing out of the ordinary. I remembered how sad James was. </p>\n\n<p>Then I realized I wasn&#39;t sure how many children I really had. \nI think I may need to talk to James and see if he lost a brother too. </p>\n</div>\n","author":"inmemoryofsarah"}