{"rank":"5","title":"Got Life Insurance?","id":"8m0zy6","url":"/r/nosleep/comments/8m0zy6/got_life_insurance/","time":"1527247545000","body":"<div class=\"md\"><p>It was sometime this week, around Monday or Tuesday, when I first got a missed call from the number. My phone is practically on do not disturb 24/7, so only calls from my listed ‘favourites’ in my phone come through. </p>\n\n<p>I thought it was strange to have had a missed call at such early hours of the morning, so I did what I do every time an unknown number calls me; I searched the number on Google. That often helped me to identify whether the caller was a business, telemarketer or someone i knew calling me/ a wrong number. As suspected, the caller was a telemarketer; namely trying to sell life insurance. Ha, they called the wrong person, I could barely afford my apartment let alone life insurance. \nI dismissed the missed call and went about my day. \nI received another three missed calls the next day and every day after that, the amount of missed calls increasing as the day went by. </p>\n\n<p>This morning was the first time I answered. I had my phone off do not disturb while I had been waiting for a call from my best friend in Singapore, I’d totally forgotten to turn it back on.  It was 4am and the call had awoken me from a deep sleep. I glanced at my phone to see who would be calling at this ungodly hour and, lo and behold, it was this same number that had been calling all week. \nFor the first time in my life, I genuinely saw red and I could’ve sworn steam came out of my ears. \nI grabbed my phone from my bedside table and stabbed ‘answer’ with my forefinger. \n“Who the FUCK do you think you are calling me at 4-“\nI was cut off by an automatic sounding response. The voice sounded like it belonged to an overly chirpy 20-something year old woman. \n“Mariette. 4:07am.“\nI was ready to hang up at this point, it was 4am and I didn’t have time for this shit. Just as I pulled my phone from my ear I heard a piercing screech from the other end of the phone call. \nI was awake now. I pulled the phone back up to my ear, having had enough of the nuisance, the screeching stopped immediately. \n“Okay, what the-“\nAgain, interrupted. \n“Alone, 2nd floor of two-storey apartment.\nLife insurance; negative.”\nThe line went dead. </p>\n\n<p>Okay, so definitely an insurance company, but how did they know my name? And where I lived? And how did they know where in my house I currently WAS?\nSuffice to say, I wasn’t surprised they had correctly assumed I had no life insurance; that’s their selling point. \nI ignored my concerns and put the call down to a desperate telemarketer attempting to scare its customers into buying life insurance. \nI told myself I’d find out what company they were calling from in the morning and speak to their manager; I wasn’t having this nonsense. </p>\n\n<hr/>\n\n<p>Later today, I woke up to a quiet house. Happily, I rolled out of bed and into my fluffy slippers. I made a beeline for my bathroom to do my morning business when I realised that my cat hadn’t been sleeping in one of my slippers as usual. \nShe was probably just lazing out on the couch, it was pretty late. \n“Macy? Tsk tsk tsk, Mace?”\nNothing. Usually I heard her little bell on her collar as she stretched up from her slumber, or her paws padding along the timber floors as she made her way towards me. But, not today, I heard nothing but silence. </p>\n\n<p>I walked through the apartment, calling out her name whilst simultaneously poking  my head around doors and under various pieces of furniture. When all else failed, I scooped up her food bowl and walked over to the cutlery drawer to grab a spoon. This was the only thing she would never dream of ignoring. </p>\n\n<p>I pulled the drawer open and dropped her food bowl in the same moment. My hand flew up to my mouth as I muffled a scream. \nMacy was in the drawer.\nShe was in the drawer with every knife I owned etched into her small body.\nShe was in the drawer, shoved into the small compartment I kept the knives in. I fell to my knees and wept, head in my hands. \nWho could have done this!? Why would anyone do this?!\nI racked my brain thinking of people I’d upset, bad things I’ve done recently but came up blank. \nNo one even had a key to my apartment apart from myself! </p>\n\n<p>I peeled myself off the floor and pointedly avoided looking into the drawer again, I was headed for the door. \nWhen I reached the door, I could’ve fainted. Every single night, without fail, I locked all 3 of the chains I had my father install on my door; blame my anxiety. I never forgot, I was never to tired to do so; it was practically part of my evening routine. But standing before this door today revealed not one of those chains. There wasn’t even evidence of there ever having been chains. I ran my fingers over the smooth door and was lost for words; there wasn’t even any dents from where the screws had been. \nConfused and, frankly, scared shitless; I slowly opened the door. The hallway was empty, my door showed no signs of forced entry and there wasn’t so much as a leftover footprint on my Welcome Home! doormat. \nI was stunned, I closed the door in a haze and stood there for what seemed like hours. </p>\n\n<p>I absentmindedly made my way upstairs and into my bathroom, perhaps my usual morning routine would soothe my overworked mind before I had to deal with my cutlery drawer. \nI lifted the lid to the toilet and sat down in one swift movement. \nI sat there for a while after finishing my business, numb from the mornings trauma. I reached over for the toilet paper without taking my eyes off the wall straight ahead of me. Instead of the soft, 3-ply tissue I had intended to feel between my fingertips; I felt cold paper, and a sticky wetness. </p>\n\n<p>My head shot over to the toilet paper and I saw red; for real this time. \nThere was just paper, rolled over the toilet paper roll and it was stained with red.. paint?\nI could make out a question mark, I figured I needed to keep pulling.\nI leapt of the toilet seat and started pulling at the toilet paper for dear life, only stopping when the roll was empty. \nI felt my heart stop when I finally made sense of what was written on the paper, and realised it was unmistakably written in  blood; more than likely, the blood of Macy. </p>\n\n<p>“Having the blood of a loved one on your hands.. tough. Got life insurance?”</p>\n</div>\n","author":"erraticrationalist"}