{"rank":"3","title":"The woman in the white gown.","id":"8m0zpf","url":"/r/nosleep/comments/8m0zpf/the_woman_in_the_white_gown/","time":"1527247464000","body":"<div class=\"md\"><p>There used to be a big hospital a block away from where I lived. It was quite big, and quite out of place for our area, as the area I lived in only really needed a small doctors surgery, and we already had one of those. Well, no one needed it, so no one went to it. Therefore, it was closed down because of lack of money. My mom used to work there, but she got a new job. The main hospital was immediately torn down, leaving a large grass field area, gated off. It stayed like that for years, and one day, my ten year old self decided it would be a good idea to go and explore back there, I looked out of my window, ande eyed up the area before making my mind up and going there.</p>\n\n<p>I ran out of my house and around to the abandoned Hospital grounds. The gate was metal, but a pushed it enough that I could fit through and make it to the other side. I had to admit, it looked pretty cool from the enterance. There was a big overgrown road and a parking lot that was broken up with plants growing through it. I turned and went slightly up hill where I found where the big hospital building use to be. Just a patch of land with unkept grass, yet there was a road going down the middle. That was when I noticed something at the end of the plot of land. There was a little area with a stone floor and two stone walls either side of it. Inside of this stone area was a large sewage pipe, and looking at the pipe was a woman.</p>\n\n<p>She had black hair, was very pale and skinny, but the one thing that was the freakiest was that she appeared to be wearing a white gown. It may of been a hospital gown, may of been a sleeping gown, I don&#39;t know. She just stood completely still, her back facing me, staring at the pipe. The pipe was open, revealing nothing but darkness inside. I didn&#39;t know who she was or what she was looking at. My ten year old mind raced, and I instantly thought she was a ghost, wouldn&#39;t any ten year old in my situation? I decided to leave, and I waited an hour. After those sixty minutes, I decided to return to the grounds to see if she had left.</p>\n\n<p>I ran up the hill and saw that she left. This let me run up to this area and check it out. There wasn&#39;t really anything there, so I turned to the sewer pipe, maybe I could find the thing she was looking at. I grabbed it and tugged it open. To my horror, that same white gown was inside! But it was stained, ripped and not in the same condition it was only an hour before. Back then, I thought she may of climbed in, but now I believe that the woman who owned that gown used to be a hospital paitent who possibly died at the hospital, and had came back to find her missing gown.</p>\n\n<p>Maybe I&#39;m overlooking things. It could of been a different gown, or that lady may of just been my mind playing a horrible trick on me, but it seemed too much of a coincidence. I recall running back home and telling my parents about this, calling the woman &#39;the woman in the white gown&#39;. My parents didn&#39;t believe me, and ended up scolding me for going back there, as there could of been broken glass and sharp bits of metal back there. If you ask them today, they&#39;d tell you that story and laugh. Ask me? I&#39;ll tell you it in every detail.</p>\n\n<p>Around a year ago, contruction workers began building houses on that land. My parents are eyeing up one house which I believe is right in front of that sewage pipe that is a lot bigger than our currant one. Yesterday, she asked me for my thoughts on moving there and all I did is shake my head. I am still scared to go back there, and now I&#39;m fearing looking out of my window, just in case I see her one more time, but staring back up at me.</p>\n</div>\n","author":"UndeadAlfieTV"}