{"rank":"23","title":"Terminal 5","id":"8m19cj","url":"/r/nosleep/comments/8m19cj/terminal_5/","time":"1527250362000","body":"<div class=\"md\"><p>I spend a lot of time traveling for work, and that means killing a lot of time in airports. When I have a long transfer I like to go explore and just walk around, sometimes if you&#39;re lucky you might even find a bench without armrests in a quiet place. Nap time! Last week I was transferring in Madrid and had 6 hours to kill until my connecting flight would leave at 6am (fuck me right).</p>\n\n<p>As some of you may know Barajas airport is rather big so there is quite a lot of room to walk around, i&#39;ve been there a lot of times so I avoided the main halls and shops and started exploring the more quiet areas. I got to a nice and quiet spot where there was nobody to be found except for some young backpackers sleeping on the benches. I smiled as I used to do the same to avoid hotel costs when I was younger. I took a random turn, went down some stairs and arrived in a long hall. Terminal 5. Apparently there were no flights at all leaving from this terminal as there wasn&#39;t a living soul to be seen. In fact it was dusty all around like the cleaning crew had been skipping this place for the last decade. Other than the dust, the terminal looked brand new, it was almost like they just built it and forgot to take it in to use somehow.</p>\n\n<p>I walked past some stores that were not stocked nor had signs, found the sweetest sleeping benches ready to be claimed, stood at the window for a while watching the airplanes leaving from the other terminals. It was so quiet that after a while I started to get uneasy, this is not what an airport should feel like. I must admit that I got a bit queezy and decided to go back.</p>\n\n<p>&quot;Aidez-moi s&#39; il vous plait&quot; I turned around startled, there was an African woman sitting at Gate 23 with her hands clenched on her stomach. I approached her and it seemed like she was pressing her sweater against her abdomen as hard as she could. &quot;Il m&#39;a amené ici&quot;</p>\n\n<p>I tried to ask her who she was talking about and what happened, her sweater seemed bloody, I think she was cut. But my french is bad and she was not making sense. She got erratic and kept asking to help her. When i tried to let her show me her stomach she grabbed my arm, Only now I realized she was bleeding a lot harder than i originally assessed. &quot;Il est encore ici, Il n&#39;est pas loin, AIDEZ-MOI!&quot;</p>\n\n<p>The lights tuned off and i stood frozen in a moment of blindness. I felt something rush past me, there was no sound but a squeaking like rubbed shoes on an airport floor but instead of steps it was one long squeak. My eyes adjusted to the sudden darkness with only the little light from outside creeping in trough the windows.</p>\n\n<p>The woman was gone, all that was left of her was a thin smear of blood leading to the far end of the terminal. I ran back to the main halls of the airport and soon enough found some security officers.</p>\n\n<p>I grabbed them saying there was a woman in danger in terminal 5 that she was bleeding and someone was hurting her. They looked at me incredulously and told me to take me to her. We walked around for at least 20 minutes while I was trying to find my way back. I kept telling the security to speed up, to point the way to terminal 5 that she was in danger but they kept following me in silence, almost looking annoyed.</p>\n\n<p>After a while they detained me and took me to a security inspection room. A Police officer joined me I don&#39;t know how much later, he let me tell my story. He asked If I had taken any drugs. He kept asking me where this happened and I kept saying gate 23 in terminal 5. In the end he showed me a map of the airport. There was no terminal 5 on there. They let me go and gave me sleeping pills saying that the long flight from Colombia had exhausted me and I had probably fallen asleep and dreamed it all. </p>\n\n<p>They told me that I wouldn&#39;t get a fine this time but harassment of security personnel for no reason is a criminal offense. </p>\n\n<p>I just cant accept that this was a dream but I cant prove a thing except for the crusted blood on my forearm.</p>\n</div>\n","author":"Comngetme"}