{"rank":"10","title":"My sister's \"somnambulism\"","id":"8m1m40","url":"/r/nosleep/comments/8m1m40/my_sisters_somnambulism/","time":"1527253757000","body":"<div class=\"md\"><p>I live with my parents and my sister in a kind-off weirdly organised home. My parents own a 4th story building, including a cellar. They stopped using the cellar (they sometimes let some homeless people sleep during the winter, or so I remember that they did when I was younger), and the rest of the building is mostly used for their restaurant bussiness : 1st floor is the serving room, 2nd is the kitchen, 3rd was a secondary serving room that was pretty much never used (until they turned it into my personal room when I turned 15) and the 4th floor was where me and my family lived. </p>\n\n<p>Anyways, before I turned 10~ I used to sleep with my mum and sister in the same bed and room (back then I didn&#39;t have my personal room and I liked the safetiness my mother used to inspire to me, as I always had trouble sleeping). Basically, since I&#39;ve been a small child I always believed this place was haunted or something. Even now when I&#39;m mature I can sometimes hear or notice weird stuff. </p>\n\n<p>For example, I could always hear steps in the midnight, as I usually fall asleep past 1 or 2 am. They were coming from the staircase, as somebody was just wandering. They were definetely different from the ones of my parents : my dad&#39;s steps are really heavy, they are easily recognizable by their distinct heavy tone, while my mother&#39;s are very soft, barely hearable; the ones I hear are in the middle of those. Besides the steps, I can always hear weird, soft knocks in the walls or ceilling, which are usually organised in patterns, with different intensities and length but I always blamed it on the age of building. I also had numerous nightmares about the building being haunted, and countless times when I woke up without a reason, but with a feeling that somebody has been going trough the things in my room, or with the impression that something is staring at me. Sometimes, I would wake up with extremely weird bruises on my body. Not very serious, they were like somebody scratched me with his fingers, they were really small, almost unnoticeable, and they were everywhere, from my legs to even my chest and back. But they were too minor for me to worry, so I just said I probably scratched myself in my sleep. </p>\n\n<p>Also, my sister does weird stuff aswell. It’s a really common thing for her to wake up in her sleep and talk about really weird things, and it always seems like she’s talking to another person (even though my parents or I are next to her or in front of her, trying to put her to sleep). But .. I’ve never seen her sleepwalking or other things besides her weird discussions.</p>\n\n<p>But, the things above are easily justifable and not that scary. But here comes the bullshit.</p>\n\n<p>One night, when I was still sleeping with my mum and sister (which is 6 years younger than me, so she was 3-4 years at the time) something really weird happened. My mum used to always sleep while hugging my sister tight, with the TV open (to make us calmer) and every door closed (you need to pass trough 2 doors in order to get to the staircase leading to the 1st floor and then to the exit door). I fell asleep,but pretty late, as that night I thought I could hear somebody in our house, a weird presence, but I ignored it, as I have this feeling pretty often and just took it as normal\nSuddenly, out of nowhere, my parents and I are instantly awoken by a loud scream. We rush trough the house, going down the stairs as fast as we could, finding my sister in the kitchen, crying while starring at the staircase as if someone just left. My parents were occupied with seeing what was going on with my sister, but I was still looking at the staircase, and I heard the exit door slowly closing. I rushed to it, but never saw anyone in the street, and more strangely, the door was locked (and it has a weird locking mechanism, you have to lift the handle a few times to lock it, which would take at least 30 seconds and additional sounds, which I could&#39;ve heard). </p>\n\n<p>We took my sister back in our room, but she couldn&#39;t pull out any word and we just left her to sleep and blamed it on sleepwalking.</p>\n\n<p>I couldn&#39;t instantly fall asleep as I was still somewhat shocked by the event so I remained awake for a while, thinking about what happened. I’m still wondering how she was able to get out of bed without awaking one of us, get dressed (she was dressed as if she wanted to leave the house), open both doors (which she normally couldn’t open), get down the stairs without getting injured or falling (again, she was 3-4 years at the time, walking wasn’t that easy for her, and especially in her sleep), but also close the TV, and basically every single source of light in the house (my mother, being very religious, leaves a lot of burning candles over the night and other religious items, but we found them all extinguished). Basically, the house was looking untouched, but at the same time, things were looking as if somebody did ramble trough it. </p>\n\n<p>Now the part that still haunts me : my sister awakens up due to her somnambulism, and acted as usual as if she was talking to someone, but I couldn&#39;t barely understand anything, as I was tired and too scared. Then, she suddenly turns to me ( a thing she almost never does to anyone when talking in her sleep) and utters : &quot;We are alone for now.. but he promised he will visit us again from time to time&quot;.</p>\n</div>\n","author":"The__Wild__Child"}