{"rank":"1","title":"Potential Cult? picture included","id":"8m1ofj","url":"/r/nosleep/comments/8m1ofj/potential_cult_picture_included/","time":"1527254306000","body":"<div class=\"md\"><p>Before I begin with my story I would to explain that I am a very fond reader of /nosleep stories but I am here to tell a story of which happened to me and i’m hoping someone has answers.</p>\n\n<p>Around June last summer me, my mother and brother Harrison took a visit to see my youngest brothers grave who died a few years back.\nIt was a common occurrence for us to visit, to tidy his grave and reset it for the upcoming event; for example christmas or his birthday. \nThis specific day we went it was extremely hot and sunny, nothing out of the ordinary but a really nice day to visit.</p>\n\n<p>After doing the normal cleaning and resetting my mum always sends me and Harrison to get rid of the previous dead flowers or decorations down one of the paths, we usually take this time with a stroll allowing my mum to spend some alone time with Jack but also for us to sight see over the fields.\nAfter chucking our stuff in the bin and us continuing slowly through the paths observing the stones and reading the stories that come with them, my brother stops.\nI take a few steps before realising he wasn’t alongside me, I turned around to see him standing dead still looking off to the left through the gravestones.\nAssuming he was reading a story I started to make my way back before he said.\n“ what the hell is that.”</p>\n\n<p>I peek through the few gravestones between us and the parallel path and there stands a small group of people. All wearing black robes that went from there feet all the way to the ghoulish hoods that covered there faces.\nOne stood central though, wearing full white although he was the centre of attention and some kind of leader.</p>\n\n<p>Knowing that people see weird shit all the time my first thought was to not be like one of them idiots that forgets the proof so I whipped out my phone as fast as I can to take a photo. \n( as soon of you must know iPhone cameras on zoom is atrocious so this is the best I managed to get )</p>\n\n<p><a href=\"http://imgur.com/klnF9mS\" rel=\"nofollow\">iPhone photo </a></p>\n\n<p>Here you can see one of the black cloaked men standing in front of a tree, reading a book.</p>\n\n<p>At this point a car pulls up behind me and my brother startling us before releasing it was just my mum picking us up.\nWe got in the car and explained the situation to her, at first she laughed before releasing the general frustration and potential fear we were showing.\nNow in the safety of our car she drove to the where these people would of been, which is no more than 30-40 feet opposite us. This took a matte dog seconds before reaching this point.\nWhen we arrived no one was there, nothing.\nThis area ended being the furthest point the graves reached before being an empty field which I can assume was a plot of land for the next burials to be placed. All that stood was a very small black marble stone.\nWe decided to drive and hurry to the exit of the graveyard which also is the only entrance.\nBeing in a car in a graveyard we got there within a minute or 2, expecting to drive past them or see them leaving but had absolutely nothing. </p>\n\n<p>To this day I am still clueless of what occurred and am hoping the people that read this have some kind of idea.</p>\n</div>\n","author":"lutible"}