{"rank":"8","title":"The House - Part 1","id":"8m1q64","url":"/r/nosleep/comments/8m1q64/the_house_part_1/","time":"1527254750000","body":"<div class=\"md\"><p>Rainy day.</p>\n\n<p>It was 9 a.m.</p>\n\n<p>I opened up my eyes slowly and uncomfortably. Curious as to what kind of weather had awaited me that morning.</p>\n\n<p>Cloudy.</p>\n\n<p>The faint grimace on my face could only be noticed by me myself.</p>\n\n<p>I liked cloudy days. This meant a gale of wind blasting onto my face and the ominous clouds above me would rumble inside and between themselves, grumpy like it’s dull colors, ready to soak the world below. The leaves and the grass wavered from the cool breeze outside, contrasting to the grayness of the day, the trees stood out with it’s natural green color. The air smelled humid, peaty.</p>\n\n<p>Exhaling a quiet sigh, I sat up. Looking around my empty apartment. It had always lacked the coziness I felt at my grandmother’s home.</p>\n\n<p>Today was the day. The day in which I would go back to that cozy place. It was going to be a five hour drive, so I had to take some measures to prevent myself from drifting off to sleep and literally drifting off to my death driving my car.</p>\n\n<p>Said measures included a shower, a big breakfast and a pack of cigarettes and canned coffees in a cooler. For a lonely person, it was more than enough. But I never liked risks.</p>\n\n<p>Some people preffered to live their lives filled to the brim with adventures and adrenaline. In my case, it was the polar opposite. I <em>was</em> indeed, just like them, in the past. However, after my first accident which involved a completely 180 degrees turned leg and a big, metal fence on top of my frail six year old body, I had formed a different opinion. In my opinion that nobody cares about, I believe that “monotony” doesn’t exist. Nope. Everyday is a new day. It can be boring, but it’s still a new day that you have countless options to do whatever you want. The “monotony” itself is only the individual’s belief that everything seems dull and boring when in reality, they have all the opportunity to make it more exciting and colorful. I never liked colorful things, but this is a metaphor.</p>\n\n<p>After making the preparations and also after double checking my spare tire for any holes and opening up my trunk to make sure that I had enough oil prepared, I finally got in the car, made myself comfortable and bummed a smoke and turned on the ignition. Don’t you just love how euphemisms work? “Turned on the ignition and started driving”. “I started my car”. Difference, huh? My mind wandered like this sometimes.</p>\n\n<p>The road in front of me was long and seemingly endless. But it was a good day. The weather was just perfect. The modern life is an amazing thing to me because what would’ve been a year or more so long of walking and riding in carriages in the past, was now just a day’s trip. Not a boring one, too. I turned on my audio player. I rolled my driver side window down. The wind blasting outside rushed in, drowning out the blasting music with loud whistles. This particular incident made me chuckle a bit to myself. The weather really was to my taste.</p>\n\n<p>Long trips can be exhausting. This one was not an exception to it. After almost falling asleep two times, I finally closed in to my destination, alive and well and full of coffee.</p>\n\n<p>The town was a tiny one. Small, cozy and enclosed in an expanding forest which covered everything in its dark green tone. The house in which I grew up happily (I shouldn’t say that, I guess) was close to the edge of town, still the same as it was back in the days.</p>\n\n<p>Blue and beautifully worn down. The cracks in the paint job seemed to compliment the warm feeling it emitted. On the porch was an empty, wooden chair and beside it was a sturdy looking hammock, swaying a bit because of the evening breeze. </p>\n\n<p>Home, sweet home.</p>\n\n<p>Morning sky was cloudy and so was the evening’s, maybe a bit more orange. The sun was setting, slowly hiding behind a hill as night’s cloak covered the skies and it’s shiny white jewel decorations were shimmering above me. The difference between my city and my hometown. One was bland, deep black while the other one was a beautiful light blue with countless stars that accompanied it.</p>\n\n<p>My reason for coming here was simple. Grandmother had called. I loved my granny. Without a mother, she was the only person I could turn to. She was the only one who had baked me and my brother cookies when we didn’t even ask for it. Old, sweet home that had inside it, an old sweet woman.</p>\n\n<p>She asked if I could come. I asked her what was going on and how were things back in town. Hesitation. I could hear her breathing on the other side, so I assumed she was trying to conjure the right words in her mind.</p>\n\n<p>“Sweetie, I really need you back here. As quick as you possibly can, if you could. Tim…Tim is missing.”</p>\n\n<p>“Tim? No, not possible. He knows our town like the back of his hand, I’m sure he’s hiding in his tree house or something. No?”</p>\n\n<p>“Brandy, it’s been a week. He’s headed to <em>that</em>  house. Please come home, I’m worried sick for him. I think your brother needs your help.”</p>\n\n<p>“No worries, gran. I’ll be coming over.”</p>\n\n<p>That phone call had disrupted the flow of that day. I couldn’t articulate any thoughts other than about Tim and grandma. Life in the city was busy and challenging but it compensated for it with generous amount of rewards. I lived with food on the table and beer in my fridge. Though, it does get lonely sometimes. Later that evening, I decided to rush back home.</p>\n\n<p>So, there I was. Standing in a gorgeous green grass field which swayed and rustled. The night sky above me glittered with stars. The house in front of me, pale blue with white edges. Worn down but still the same as ever. </p>\n\n<p>I climbed up the stairs and gave four hard knocks on the cracked wooden door. Granny had a hard time hearing and I knew that better than anyone else. Well almost everyone except Tim. He and I grew up together, bonded together and lived together. He was my only friend ever since I was a child. I didn’t get along with <em>kids.</em> Maybe I was an asshole or maybe they were. Personally, I lean towards the latter one.</p>\n\n<p>I had a hard time imagining Tim all grown up and mature. Then I remembered he was missing. Standing there on the tattered door mat, I thought of these things when it was interrupted by the sound of metal lock clanking and presumably opening and the old door creaking as it welcomed me inside. The elder lady standing in front of me was worryingly similar to the house. Old but still beautiful.</p>\n\n<p>She stood there with a beaming smile that quickly replaced her previous depressed expression. I hugged her. As I did, I made a sad discovery. Her sullen attitude had softened. As did her skin from wrinkles. Her hair, once partly gray was now ashen white. Her eyes had a hint of saddened acceptance behind it. But after the hug, it seemed to have gained some hope as it glimmered with tears in the moon light. Old people are sweet, aren’t they? Who else would cry out of happiness just from seeing your face?</p>\n\n<p>“It’s been some time, gran. How were you?”</p>\n\n<p>“I’ve been doing just fine. Come now, hurry inside.”</p>\n\n<p>She ushered me in with a somewhat urgent attitude. I guessed that she was probably happy that someone who could solve the dire problem she faced had came. A familiar person. Her grandchild.</p>\n\n<p>I took in the view and just as I remembered, it was all there. The old carpet still had the same stain I had made after spilling a glass of apple cider on it. From the ceiling, the same old yellow light bulb hung dimly, making the atmosphere ever so familiar as it flickered a bit. The wooden floor creaked as two figures drew closer to the living room. The painting of a white butterfly Tim did when he was seven still hung from the hallway wall. The big, dusty windows were different though. One of them was shattered and had now been covered with a blanket, failing to cover some glass shards still sticking out from the window frame. Wind blew inside through it. The other one was different too. It wasn’t dusty like it used to be. It was clean and transparent.</p>\n\n<p>Nostalgia is a form of drug. The tranquility I felt at that moment was something that I didn’t I longed for.</p>\n\n<p>She sat me down on a small chair and rushed over to the kitchen, bringing a rusting black tea kettle. Steam drifted from it’s spout. She poured the piping hot tea into two wooden cups on the table. I smiled at this. The one in front of me was mine, back when I was still living here. The one she held was hers, back when she still scolded us for pouring water inside an anthill. Then I saw a familiar sight on the kitchen counter. Tim’s favorite, red glass cup stood there. Empty and cold.</p>\n\n<p>This reminded me why I came here.</p>\n\n<p>“So, gran. Tim has been missing for a week?” </p>\n\n<p>“More than that. It’s now been a week and two days.”</p>\n\n<p>“Have you called the police?”</p>\n\n<p>“Of course, they did a thorough search around the entire town but never found a single strand of hair from Tim.”</p>\n\n<p>“Huh…Well, what happened? How did he disappear? Why didn’t you call me sooner?”</p>\n\n<p>I was a bit frustrated. She had waited a whole week before she called me? This was about Tim. My first fucking priority was Tim.</p>\n\n<p>“I, I’m sorry Bray. I just didn’t want you to worry about it. I assumed Tim would come up after a day or two but, well…”</p>\n\n<p>“Grandma, Tim is my only brother. I would do anything to protect him from danger, you know that. So tell me, how did he disappear?”</p>\n\n<p>Her lips quivered. I remembered our phone call.</p>\n\n<p>“The house at the edge of town?”</p>\n\n<p>“Yes, I saw him walking in. It was quite a busy day. I had been planning to do a thorough cleaning to this house and  Tim was helping clearing out the basement. I was scrubbing the front windows when he called and I barely heard him say something about finding a key. I’m sorry Bray, I was just too careless.”</p>\n\n<p>She started silently sobbing.</p>\n\n<p>“I called out to him again after roughly an hour but he didn’t reply. Tim always gave quick answers, he was a bright boy, you know that to be true, Bray. That’s why I was worried. I quickly went inside only to find an empty basement and an old gray sack, emptied out on the floor. A few buttons and some stones with weird carvings on it spewed from the bag. I called out to him again and again but still there were no replies. I rushed out and took a look around outside. That’s when I last saw Tim. He was slowly walking inside that god forsaken place. I ran over to that house, my old age burdening my body but halfway through, the door closed as Tim disappeared out of my sight. </p>\n\n<p>Brandy, you know I’m old and maybe the other might think I’m just senile but I believe that you know when I’m telling the truth.“</p>\n\n<p>“What do you mean?”</p>\n\n<p>“Old age had worn me down. But the one thing it didn’t dare touch was my sight. I could still remember clearly when the door opened, Tim had a look of utter shock and above him was a dirty, elongated fingers stretching out, seemingly guiding Tim in-. ”</p>\n\n<p>She sounded both terrified and furious at the same time.</p>\n\n<p>“-That house is old and abandoned. But that day, I saw something behind the windows. Bray, please believe me when I say that there was a man in a top hat, grinning to himself. His eyes were unnaturally small like dots and that “top hat” of his seemed to be…attached to his head. It threatened me, Bray. It slowly swayed it’s putrid long fingers left to right, warning me not to get too close.”</p>\n\n<p>“Holy shi—”</p>\n\n<p>The profanity almost escaped my mouth.She was a christian, I had to remember that. That’s beside the point. I was shaking with anger.</p>\n\n<p>“What do you mean?! Didn’t the police check that house then??? That dirtbag took Tim away!”</p>\n\n<p>“They did, Bray, but they found nothing but a husk of a house.”</p>\n\n<p>“Christ.”</p>\n\n<p>I was quiet. Staring at the floor. The words that came out of her mouth seemed utterly insane. But I knew better. Gran would never lie about something like this, especially if Tim is involved.</p>\n\n<p>“Brandy, I know it’s unbelievable but you have to trust me. I think the pebbles I found that day has to have something to do with that house.”</p>\n\n<p>“Huh? You mean the pebbles with strange runes carved on it?”</p>\n\n<p>“Yes. These symbols Bray, look at them!”</p>\n\n<p>She dug through her pocket frantically and pulled out a handful of pebbles. Five to be exact.</p>\n\n<p>“Those are undoubtedly evil, Brandy. I know a satanic symbol if I see one.”</p>\n\n<p>She was right. Those were the symbols of hell. The pentagram. The goat’s head. The triplets. The dragon’s eye. And a…middle finger?</p>\n\n<p>“What is this?”</p>\n\n<p>“That’s the sign of Kish. It’s meaning is to break down all barriers that separate our reality from the abyss and to let hell loose to this world.”</p>\n\n<p>“This is insane…”</p>\n\n<p>I couldn’t believe my eyes which were looking at the glowing pebbles nor my ears which were hearing grandmother’s seemingly non-sensible words.</p>\n\n<p>“Brandy, you <em>have</em> to find your brother. Please.”</p>\n\n<p>I already knew that. I was already prepared to do anything for my little brother. Even if I have to go through hell itself. But I needed to prepare. I needed a plan.</p>\n\n<p>“It’s time to go to bed granny, you’re tired. Same for me. It was a long road coming here. Let’s talk about this in the morning, okay?”</p>\n\n<p>She nodded, her quivering lips slowly calming.</p>\n\n<p>I remembered the taste of grandmother’s home-cooked meals that night. It was nice to have a plate of food prepared without having to pay for it.</p>\n\n<p>And here I am. Writing this on my laptop. It’s two in the morning. </p>\n\n<p>You know, the streets of the city are lively even during night time. Not this town though. It’s so utterly quiet. Silence literally overwhelms the night itself.</p>\n\n<p>The house at the edge of town. Ever since I was just a kid, building sand castles and fighting with makeshift stick swords with my brother, that house existed. Before I was even in this world, it stood there. Lonely. Dark. Ominous.</p>\n\n<p>Gran always warned us not to get too close to it. She had a bad feeling about it, she told us. I always trusted her words. However, Tim was stubborn. Curious and immature. I couldn’t blame him for it though. He was a better individual than me in every way.</p>\n\n<p>Well, it’s getting late. I really need to get some sleep. It really is quiet in this town.</p>\n\n<p>To be continued.</p>\n</div>\n","author":"rantleystalk"}