{"rank":"57","title":"The dogman (Update)","id":"8m1rhv","url":"/r/nosleep/comments/8m1rhv/the_dogman_update/","time":"1527255074000","body":"<div class=\"md\"><p><a href=\"https://www.reddit.com/r/nosleep/comments/8ls06e/the_dogman/\">Part One</a></p>\n\n<p><a href=\"https://www.reddit.com/r/nosleep/comments/8molkd/the_dogman_final_update/\">Part Three:</a></p>\n\n<p>Part Two:</p>\n\n<p>The week before my little sister disappeared began like any other that summer. The days stretched golden and lazy and Jamie and her friends had begun to swim in the river on days when the heat was too much. You could hear the sounds of their laughter bouncing through the woods, shaking the birds from the trees and waking the butterflies from the wildflowers that grew at the edges of the bayou. Because of this, Jake and I had started venturing further and further into the woods to escape their noise that scared off the animals he would try so patiently to draw. I was angry with Jamie, always bringing noise and chaos wherever she went, but Jake didn’t mind.</p>\n\n<p>It was a Saturday in late July and me and Jake were walking deeper, past the creek and the white cross nailed to a cyprus tree trailing spanish moss like a child bride. Every so often I’d catch him looking back at me, as if he had to check I was still there. We reached a clearing and Jake abruptly stopped.</p>\n\n<p>A tree grew alone in the centre, older than us both, trunk weathered and sun bleached by the years. Covering the base in heaps were Walmart bouquets of babysbreath, pink flowers, wrapped in plastic shrouds and wilting in the heat. Bouquets piled underneath had begun to rot into the dirt. Butterflies landed hesitant among the fresh flowers, wary of the smell of death beneath. Stuffed toys sat atop the decay, a pink bunny missing an eye, a lamb with a satin bow round its neck stained with mud. Candles, some painted with a faded Virgin Mary like the ones in church, were lit among the toys and flowers and cards, a steady flicker in the shade of the trees. I wondered who was lighting them. A bottle of Jack Daniels filled with white roses jostled for space with a small statue of an angel, face in its hands. And covering everything were the photographs of the same four girls.</p>\n\n<p>Some were middle school pictures, smiling for the camera with gaps in their teeth, photo frames starting to rust. Some were family photographs, some baby pictures. A girl stood waist deep in the river in a sun-dress grinning at the camera. A girl sat in the bed of a blue pick up truck, arms around a doe-eyed Labrador. A girl stood hand in hand with a woman, both in their Sunday best, ribbons in their hair. A girl blew out the seven candles on her birthday cake, eyes squeezed shut as she wished. All of them with long, blonde, hair. I wrapped my arms around myself, digging my nails into my skin. I felt cold despite the sun.</p>\n\n<p>“Jake?” I turned to him, uncertain. He scrubbed at his eyes, hands coming away wet. He didn’t answer, just grabbed my hand and pulled me away. He wouldn’t talk to me as he pulled me back through the woods, ignoring all my questions until I gave up asking. We cleared the trees, and jumped the fence into my backyard. He was still holding my hand. Jake sat me on the porch and took my shoulders, turning me to face him.</p>\n\n<p>“I wasn’t gonna tell you, cause my mama said it would just scare you ’n all.” He looked away for a minute, mouth down turned, hands a weight on my shoulders. “That right there on the tree? Those girls all disappeared last year. Nobody knows what happened or nothin’ just that they never came back.” I had never seen a boy cry before and caught one of the tears dripping off his chin on my thumb, couldn&#39;t bear to see it fall.</p>\n\n<p>He smiled for me, shaky but sweet.</p>\n\n<p>“One of them was my cousin Abi.” He hesitated.</p>\n\n<p>“I taught her to ride a bike,” he turned to face the trees, as if to say that was that, eyes sad with the memory. Thirteen, and already too sad. We sat in easy silence on the porch, leaning against each other until it turned dark and Jamie emerged from the woods like some half wild thing, grinning from ear to ear with leaves in her hair. I grabbed her into a hug, closing my eyes and resting my chin on her head. She complained I was crushing her to death, but hugged me back just as hard.</p>\n\n<p>That night Jake taught me and Jamie to catch lightning bugs with our bare hands, laughing as Jamie screamed with delight, chasing them like stars round our back yard, wishing again and again on every one she caught. Jake whispered to me that soon the weather would turn too cold for them and they would curl up and die in the grass. But for now they were here, and they were beautiful.</p>\n\n<p>Amy came to pick him up on her way back from work, saying his daddy had dinner waiting. She asked me where Mom was, brow crinkling with worry, probably wondering if me and Jamie had any dinner waiting for us. I just smiled and said she’d be home soon. I made me and Jamie peanut butter sandwiches and brushed her hair in front of the TV, tying it into two perfect blonde braids to keep out the tangles. She fell asleep with her head on my lap and her thumb in her mouth.</p>\n\n<p>Mom finally came home. Bill was with her, but I knew that even before he stepped in after her, hearing the low purr of his truck out in the drive way. She stumbled when she bent to kiss my cheek, her lipstick smeared and her breath strange and fruity, making my eyes water. Bill leaned against the doorway, smiling in his blue jeans as mom giggled when she knocked over my glass of juice with her high heel. I carried Jamie upstairs, her body heavy with sleep and put her to bed, carefully tucking her baseball bat in between her hands. I fell asleep to the sound of mom laughing too loud, TV blaring white noise. As I closed my eyes, I thought I saw a silhouette in the doorway, but I wasn&#39;t scared because the head wasn’t a dog’s head, it was a man’s.</p>\n\n<p>I woke up to Mom screaming. It was morning, and Jamie’s bed was empty. I ran downstairs, two at a time, heart beat like a baby bird learning to fly. Mom was in the kitchen, pancakes on the stove turning the room syrupy. Jamie was sat at the kitchen table. The two perfect braids I’d done for her the night before were gone. Her hair was gone, hacked away to just above her shoulders. Mom whirled round and pointed the spatula at me accusingly.</p>\n\n<p>“Kenna! Did you do this to your sister?” Her voice was strained as she tried not to shout. Mom never yelled at us. I shook my head, numb. Mom nodded, turning off the stove and sitting down, pulling Jamie onto her lap. Mom held her face in her hands, forcing her to look into her eyes.</p>\n\n<p>“Baby I’m not mad,” she said, voice now calm. “I just want to know why.” She ran a hand through Jamie’s ragged hair, distracted. She held out an arm for me and I leaned against her, breathing in. She smelled like herself again, like detergent and honey. Like mom.</p>\n\n<p>“I know this move hasn’t been easy,” she said, brushing her eyes clear. “I know <em>I</em> haven’t made it easy,” she continued, voice quiet.</p>\n\n<p>“This is my fault,” she finished, sad but steady. We sat and held each other in the sun filled kitchen, and it felt like if we held each other long enough, the cracks that had slowly grown in our lives would mend.</p>\n\n<p>Mom took Jamie upstairs to the bathroom and sat her on the side of the tub, fixing the ends of her hair as best she could with nail scissors. The phone sang from downstairs, calling her away. Jamie turned to me eyes wide and solemn. She tugged me towards her, small hands hooking onto my belt loops, determined.</p>\n\n<p>“I didn’t do it Kenna,” she said. “It was the dogman. He came and he took my hair.” She looked out into the hall to check mom wasn&#39;t coming back. “I don’t wanna sleep in our room tonight Kenna. Okay? I’m scared.”</p>\n\n<p>“Okay.” I said.</p>\n\n<p>That night, me and Jamie built a blanket fort in the living room, saying we wanted to sleep in there. Mom just laughed at us and helped, even strung up some christmas lights inside. Mom cooked dinner for the first time all week, real dinner, not just microwave meals. We ate inside the fort, faces covered in the glow from the rainbow lights, blues and reds and pinks. We had built the fort around the TV and mom stuck on an old movie I hadn’t watched since I was Jamie’s age.</p>\n\n<p>A knock on the front door pulled us away from the screen. Mom untangled herself from the nest of cushions and blankets and stuffed toys and went to answer. I suddenly felt like mom was on a boat being pulled out to sea, leaving me and Jamie behind on the shore, left helpless by the tide. I could tell from the way her voice changed it was Bill. I tried to focus on the movie but I heard mom go upstairs and come down a few minutes later, the sound of her high heels on the wooden floor. She lift back the entrance to the fort and smiled, mouth shiny and red with her lipstick.</p>\n\n<p>“I’m going out with Bill tonight, we’ll only be a few hours. Will you two will be alright?” I could smell her perfume, the one she used to wear for dad.</p>\n\n<p>“I don’t have to go,” she said. I noticed she had done her hair, piled carefully on top of her head. She looked so pretty in the christmas light glow, younger in the half dark. I just wanted her to be happy. I shoved Jamie and she smiled up at mom with me.“Go momma, we’ll be okay,” she said, glaring at me and rubbing her arm. Mom blew us a kiss and she was gone, perfume left behind. The front door slammed and we were alone. Jamie punched me in the arm hard. Payback. I glared at her until her mouth twitched and we both dissolved into giggles, settling down to finish the movie. We fell asleep with our legs overlapping, Jamie’s steady breathing lulling me to sleep like the ocean.</p>\n\n<p>The next morning, I woke up alone. A mess of blankets next to me marked where Jamie had been. I stretched and crawled out of the fort. The kitchen was dark, and I drank orange juice straight from the carton in the white fridge light. The morning was blue outside, dawn not quite ready to replace the dark. A few birds braved the empty garden and the trees rustled in the wind. I sat on the porch with my feet in the grass and watched dawn slowly light up the clouds, a blur of dazed yellows and peach. I assumed Jamie had gone to sleep with mom upstairs or was back in our room. I was wrong.</p>\n\n<p>I went upstairs to drag her out of bed, bored of being alone. I checked our room, the beds unslept in and empty. The window hung open, room turned cold with night. A moth hid in the corner of the lace curtains as I went to close the window. I watched it raise its brown wings, paper thin, early light through the glass making them see-through. I brushed it with my hand until it flew away, and I closed the window behind it. I checked the bathroom, also empty. I checked mom’s room.</p>\n\n<p>Mom lay in her underwear, above the covers. Her hair had come lose across her face, in gentle waves. She was beautiful, even with last night’s make up smudged across her eyes. Her shoes and clothes were scattered on the floor where she’d left them. I hadn&#39;t heard her come in but it had obviously been late. She was sleeping alone. I shook her awake, panic crawling the walls of my ribcage.</p>\n\n<p>We ran back downstairs, checked the kitchen. Empty. Ran into the living room, tearing apart the fort, throwing pillows and blankets. Empty. We ran outside into the garden. Empty. I screamed my sisters name into the trees. They gave no reply. Jamie was gone.</p>\n</div>\n","author":"Coney-IslandQueen"}