{"rank":"0","title":"The Static calls my name","id":"8m1wgu","url":"/r/nosleep/comments/8m1wgu/the_static_calls_my_name/","time":"1527256292000","body":"<div class=\"md\"><p>Hi, I’m Dave, I just moved into my new 2-bedroom 1 bathroom house with my 6-year old daughter, Kim, The reason I didn&#39;t say wife is because last year Karen got murdered while Kim and I went to see a movie for her birthday. Karen couldn&#39;t go because she had work, At that horrible job. You see Karen had certain erm, “assets” that men fall head over heels for. Everytime she came home she told me how she’d be relentlessly sexually harassed at work. The boss didn’t do anything because he was the one doing it. Sorry to side track, Kim and I were devastated, and the old house we lived in brought back too many memories, so we decided to move somewhere else, somewhere different, away from people, away from everyone… </p>\n\n<p>The moving process went pretty well with minor issues such as getting the couch in and all that, but the TV, that was the most difficult. Karen LOVED that It always knew what she needed… When I married her it started to malfunction whenever I used it, Something was off about it… but I brushed my “madman” thoughts aside and moved it in. We lived in a secluded house in the forests of oregon where there was complete and utter silence, Perfect.</p>\n\n<p>I tried using the TV but alas nothing, So I just turned it off and helped Kim with her homework. “Daddy how do you say this?” She pointed to the word “‘Could’ Spelled C-O-U-L-D” we go through her homework and it’s done before we know it. </p>\n\n<p>The past week has been, Weird. Kim to be exact, this morning she tried putting her hand on the stove, she didn&#39;t scream or anything… it was scary. I rushed her to the hospital nevertheless. The days following that were even creepier. She stopped calling me a happy warm “daddy” and started calling me a cold “Father”. By the time I was done thinking about it it was night time I went to bed. I checked in on Kim, sleeping, good. I go to my bed and I fall asleep.</p>\n\n<p>I was, in our old house, The memories. I looked around and I heard the door open. “God I hope Dave and Kim had a better day than me.” Karen? I creeped closer. I heard the flicker of the TV remote and then static. “C’mon Damn thing work!” I saw the text on the Tv &lt;Why Karen?&gt; Was written in blood red on the Tv was flickering… As if it was repeatedly asking. “Why what?” &lt;WHY DID YOU BETRAY ME!?&gt; I heard an ear piercing sound as if a grenade went off right beside me. &lt;IF I CAN’T HAVE YOU NOBODY WILL!&gt; Karen went to the Kitchen, brought back a knife and stabbed herself repeatedly over and over. I woke up in a cold sweat. Kim.</p>\n\n<p>I ran into the living room to hear the tv static WHERE’S KIM! She was in the Kitchen grabbing a knife… I grabbed the knife by the blade and cut my hand. Kim drags the knife across her throat and falls. I hear something, a voice... The static calls my name...</p>\n</div>\n","author":"FalloutDoomfan"}