{"rank":"2","title":"So...this is how I gambled our lives away.","id":"8m21cw","url":"/r/nosleep/comments/8m21cw/sothis_is_how_i_gambled_our_lives_away/","time":"1527257408000","body":"<div class=\"md\"><p>When you live your life like a normal person...a &quot;regular&quot; person, you&#39;ll realize how boring it can be. Normally, very fast. From the simple additional shot of alcohol on Saturday night to jumping off skyscrapers, planes or any other high place. Humanity came up with a lot of ways to screw themselves over with the next sick thing they could come up with, only to escape this hell of boredom.</p>\n\n<p>And honestly? I was feeling the same way a while ago. But now it seemed more like child&#39;s play for me than actual excitement.</p>\n\n<p>The beginning was quite simple for me, the &quot;norm&quot; as one would think. As a mechanic with shitty income, a small flat outside of town and a worn-out truck, you didn&#39;t expect much from fate or destiny in return for dealing with all these ungrateful bastards showing up in your garage. There were a few exceptions...but they came over too rarely to make a difference. Feeling unsatisfied with...my current way I decided to do little stunts from time to time. Haul it over the highway, drive over red or be more uncaring whist a police cruiser drove past me. Every little bit helped.</p>\n\n<p>At the beginning, it felt kind of wierd how I disregarded my own policies. In the past, no one would give me a fine or scold me on how I drove a tad more reckless than the usual beginners. Now I literally begged for it. Over 2 months, not much happened afterwards. I got my payments, drank from time to time and tried to haul ass every time I sat in my old Ford at night. Day after day it continued. </p>\n\n<p>And slowly but surely it crept back. The fear of it all becoming a regular activity, to lose that little spike of fear and adrenaline that kept me going. I rather wanted to crash straight into a brick wall and become a layer of splashed gore and scrap than ending in that nightmare again. And I was getting quite sick of the letters from the police about breaking the law. As if they knew better...</p>\n\n<p>A drink was what I needed, so without any thought of speeding on the fresh tar I made my way to the local bar. That&#39;s when I met her. She wasn&#39;t the hottest thing out there and as I was in my late 30&#39;s, expectations didn&#39;t range skyhigh. Anyway, we met in the end of June, with her simply lounging at the bar in a black frilly dress, that melancholic gaze and the purse hanging from her shoulder that begged to be stolen. She didn&#39;t chat with me at first. Rather, it was my drunk rambling that got her attention. The simple laughs meant a lot for me, since knowing you weren&#39;t alone in your demise kept your hopes high. The night went on and glass after glass went down.</p>\n\n<p>Close to midnight, she suddenly stood up without warning, her heels clacking on the wooden floor while she turned to me and asked: &quot;Care for a little thrill?&quot; It sounded almost like divine intervention that day, a godsent to help me out of my dilemma. I walked with her, no thought of danger recurring in my mind. Was it foolish? Yes. But I didn&#39;t care. These golden walls, covered slightly in vines and the marble pillars beckoned us into the town&#39;s casino when we reached its entrance. I usually never gambled, although that night I really felt like trying my luck. Good thing my credit card was still in the ripped piece of leather that I called a wallet. She advised me to prepare for a lot of huge pots coming up, so instead of merely using a few hundred bucks there we now 5.000 dollars in chips on me. </p>\n\n<p>The woman also felt lucky, cashing in almost double of my own budget into the expensive currency. Just 2 minutes in and we already sat on a table for Texas Hold&#39;em. If you don&#39;t know the rules, they&#39;re pretty straight forward. But I&#39;ll not recite them for you. The internet and books exist for a reason. Some snotty rich douche sat next to us, the part of the table before him littered with stacked piles of gambling chips. He surely had a good night. The first rounds were played warily from all parties, none of us going above 250 or 500 before backing off. Then, once the playing cards were given out after 15 minutes or so, I smiled mentally from joy as I saw the double queen in my hand. </p>\n\n<p>Suppresing it became harder once that guy instantly raised to 1.000 without batting an eye on us. Sure, he didn&#39;t seem too concerned about us but the lack or care seemed insulting to me. Deciding to see how this would go out, we both followed suit. And man, how I was internally cackling my ass off as the other remaining queens showed up in the flop, a 9 of hearts just behind them. That snob seemed to play it more secure now, simply calling before we did the same. Then a 10 of diamonds as our turn. And suddenly he smirked before raising by 50.000. At that moment I was flabbergastered. Half of his chips were moved while I thought about my odds. &#39;He surely didn&#39;t have a better hand than I do,&#39; was how I tried to calm myself. Both palms were getting sweaty, my heart was racing, the thought about losing my future savings and possible carrer...</p>\n\n<p>It excited me. So much that my all-in followed suit just before my partner did the same.</p>\n\n<p>We could only stare as the dealer brought out his last card, all of us neither noticing the stares of other visitors and the occasional high roller behind our backs, nor the expensive aroma of alcoholic drinks or extravagant perfumes in the air. Only the last card was in our vision as it turned over, releaving...</p>\n\n<p>The jack of hearts for the river. We revealed our own hands, displaying the snob&#39;s straight to queen, my companion&#39;s 3 jacks...and my own 4 of a kind. 65.000. That one pot won me 65.000 dollars in one go. But that moment I didn&#39;t care about the money, only feeling how the tons of adrenaline left my vains as I returned from my high. It felt so exhilarating! So...unique.</p>\n\n<p>How crazy I probably sound when I demanded more. Yet it didn&#39;t continue as my partner stood up, her own buy-in completely burned out. So did the rich dude who had enough of his little game and quickly walked out to trade his remaining winnings for cash. My brain wanted to scream right there, muscles aching for another high and my feet refusing to budge. Though...the woman walked up to me and smiled, as if the big loss of money didn&#39;t concern her. I saw her eyes, those emerald sparks having the same craving as me in them before asking me: &quot;Would you like...more?&quot;</p>\n\n<p>There wasn&#39;t even a verbal response as my grey shirt and jeans moved alongside my body, following her towards my next activity. The 2 of us arrived before a wooden door, guarded by some shady security man in the typical black suit and tie. Sunglasses and ear piece included. He only gave us so much as a fleeting glance before opening the door for us, his bulky hand holding the entrance open for us until we passed through.</p>\n\n<p>Passing the ominous corridor led us to a badly lit room, bare wooden walls, the weak lighting and table with two chairs creating a massive contrast to everything I saw in here so far. Only a little box at the center of the table looked out of place.</p>\n\n<p>That and how one of the walls looked shinier than the other 3...almost reflective even. And I swear that some sort of stain was on the very edge of that wall. Yet the smell of industrial cleaning utensils burned my nose, making concentrating very problematic in that moment. She explained how this room was supposed to be sound-proof, ensuring that no one would interrupt our &quot;fun&quot;.</p>\n\n<p>My companion strided towards the table, her auburn hair swaying from the motions as her frame blocked my sight from the box she currently opened...revealing the cold steel of a .357 magnum, presenting it in the air like a grand prize to win. Just looking down the already used barrel made my blood run cold...yet for some reason, I didn&#39;t feel uncomfortable.</p>\n\n<p>She beckoned me to the other free chair, her voice sounding like a siren luring in her prey. When I actually complied and how long it took me to sit down is still a mystery to me. Her free hand reached out again to the box, revealing half the drum&#39;s capacity of ammo, neatly placed with care on the now visible red velvet. That&#39;s when the security man from earlier stepped in, the door creaking all the way. He grabbed both the gun and the bullets before the woman turned her head away from him. I couldn&#39;t see his eyes behind the glasses, yet it took me a while to understand his request.</p>\n\n<p>I copied her actions. Only then was movement heard from our blind side. A clank. The sound of metal against metal. Again. And again. Then the whirring before the clack repeated and I heard him putting down the gun before he left us alone once more.</p>\n\n<p>We were actually doing this. There was no turning back.</p>\n\n<p>She gestured towards the gun, not allowing me to think any longer about this. &quot;You. Or me. Choose.&quot; The adrenaline was coming back, stronger than before. I would be losing myself in euphoria if I wasn&#39;t careful. With a shaky hand I gripped the wooden handle, feeling the increased weight of the now loaded gun in my fingers. She gave me an coaxing smile, like she witnessed the situation a million times before. It felt groundbreaking.</p>\n\n<p>The odds could&#39;ve been 50&#37; for me to die, or higher. Maybe it was rigged and I would&#39;ve died regardless of my decision. All the possiblilities of my death. I...only felt bliss after I pulled the trigger, the tool to my possible death only giving out an unsatisfying click. </p>\n\n<p>Now it would&#39;ve been the woman&#39;s turn. But I wasn&#39;t done yet. I needed more. I wanted this rush on the edge of life and death to never stop. She didn&#39;t deserve it just yet as I still cherished my first spike...</p>\n\n<p>So much in fact that I pulled the trigger again as it still pointed at my head, ending in the same result before I lowered it slightly from my own temple.</p>\n\n<p>My partner...or rival to that time seemed to freeze just then and there. I could almost see her eyes mentally panicking while I had the time of my life. Oh how I enjoyed this night so far! It would be forever etched into my mind...yet I wasn&#39;t done just yet. I&#39;ll never understand what compelled me to this absurdly reckless act, though with one last demand for another rush I quickly readjusted the revolver&#39;s previous position and pulled for a third time.</p>\n\n<p>*Clack*</p>\n\n<p>...The woman&#39;s body seemed to freeze entirely. As if anything else had stopped for her, she desperately tried to bring out another word. Not even a stutter was heard while her body collapsed, a look of total and utter sorrow in her irises. How ungrateful she would be for her own turn.</p>\n\n<p>As to me, I maybe even came from this. I was feeling to good to check, a big smile forming on my face. Only the three bullets remained. Her chances of surviving, crushed. My own calm hand put the weapon down on the table, even slightly nudging it forward for the woman to share this rush with me. For some reason she never moved, only laying there unresponsive to any of my attempts at conversation.</p>\n\n<p>A few minutes ticked by before the familiar man came in, his steps slower than before as he seemed to judge me under his glasses. He took the revolver from the table, then firmly gripped the woman&#39;s hand and put the weapon into her hand under his. He made her point the gun towards her own head, demanding her to pull the trigger or else he&#39;d do it. &quot;The crowd is waiting...you don&#39;t want to dissapoint them, right?&quot;</p>\n\n<p>I only watched like another spectator as she emotionlessly nodded, cocked the gun, turned her eyes to me in what I assumed to be a last &quot;smile&quot; and pulled the trigger on her own accord. Of course, there wasn&#39;t any chance or surviving for her left so none of us jumped as the sound of blood splattering between a loud bang came, part of her head flying around the air and painting the table, the reflective wall and the ground in a gory mixture of red. Her night was over.</p>\n\n<p>The man removed her unexisting grip from the gun, grabbing a small handkerchief to clean the stained barrel as I looked at his technique. He removed all the little stains in seconds, professionally pocketing both things as he wordlessly mentioned me to follow. My legs felt shaky from this experience, a smile etched on my face like I was driving a carneval ride continuously.</p>\n\n<p>All the events afterwards felt jumbled through as I was handed an additional 100.000 dollars for &quot;entertaining their guests&quot; while also agreeing to never share any of the details to an outsider. They led me out of the casino, handing me a bag for all my winnnings before sending me on my merry way.</p>\n\n<p>So much joy was still left on the next day. Sure, I felt bad for the woman who died and yet I can&#39;t help but be grateful on how she introduced me into this world. The emotion of being reborn into heaven could be compared to this experience. Now, I never really used the money, only grabbing a grand or such every week whenever something came up. The clothes I wore that night have been discarded, burned and burried into the ground as part of my promise with the higher ups of the gambling hell. </p>\n\n<p>...Well, except my shirt. I kept it as a memorial for myself. It&#39;s tucked underneath the drawers in my bedroom with that tiny smudge of blood still stuck on the side.</p>\n\n<p>...</p>\n\n<p>So, now you know my story. You could&#39;ve stopped listening the entire way but no. Maybe you were intrigued in my reasons...or maybe you&#39;re disgusted with me, internally labeling me as a freak.</p>\n\n<p>That doesn&#39;t matter anymore. Remember what I said? Only those who aren&#39;t outsiders are supposed to know of this. So my friend, I hope you&#39;re feeling lucky today. Cause I could really need another distraction from my boredom. Now c&#39;mon, the audience doesn&#39;t like waiting, as do I.</p>\n\n<p>I&#39;ll even give you a lift...so what are you standing around for? Let&#39;s have some fun!</p>\n</div>\n","author":"MrFiretank"}