{"rank":"472","title":"Why Is Patrick Crying?","id":"8m2duz","url":"/r/nosleep/comments/8m2duz/why_is_patrick_crying/","time":"1527260261000","body":"<div class=\"md\"><p>“Why is Patrick crying?” asked a small voice.</p>\n\n<p>I gazed up from the papers I was grading to see Emma, one of my students, standing there with a concerned look on her face. She had spoken quietly as to not disturb her nosey classmates. </p>\n\n<p>My eyes darted to Patrick’s seat. His head was resting on his desk and being gently cradled by his arms. His shoulders heaved deeply. For a moment I thought he was asleep until he let out a sharp sniffle. I nodded at Emma and she returned to her place next to her teary classmate. I got up and made my way toward the boy. </p>\n\n<p>I tapped him on the arm and he jerked upright. His bloodshot eyes grew wide as he realized that his teacher was looming over him. </p>\n\n<p>“Patrick,” I said softly. “Would you mind joining me out in the hallway for a minute?”</p>\n\n<p>The entire classroom was suddenly on high alert. They looked at me, then at Patrick’s tear-stricken face, then exchanged looks with one another excitedly. One of their classmates was getting busted. What could it be about? Rumors would spread quicker than wildfire, as they tend to in all fourth grade classrooms.</p>\n\n<p>Patrick reluctantly rose from his desk and followed me out into the hallway. I closed the door behind us and stepped away from its window and the eager faces that it contained.</p>\n\n<p>“Patrick,” I said in the same soft tone. “What’s wrong?”</p>\n\n<p>The boy stared at his shoes.</p>\n\n<p>“Nothing,” he whispered.</p>\n\n<p>Patrick Wells had been a closed book since the beginning of the school year. He was the type of kid who never raised his hand in class, gave the bare minimum on homework assignments, yet still managed to get decent grades. He was one of those students who’d become a fuzzy, distant memory in my mind. Just a blank face in the vast sea of students that passed through my classroom over the years. A ghost who would be forgotten come summer. He had successfully flown under the radar. Until recently. </p>\n\n<p>“I’m worried about you,” I said to the top of his scalp. “Your fr-“</p>\n\n<p>I caught myself from saying the word ‘friends’. I knew Patrick didn’t have any. You notice these things as a teacher. Children are bad at hiding social cues. Nobody chummed around with Patrick. He traveled alone to and from class. The others would shoot him dirty looks if he tried to talk to them as if he were some contagious disease. Whenever I had the students pick partners for a group project he’d just stand there like a lost puppy until I paired him up with someone. He was the class’s unofficial pariah. </p>\n\n<p>“Your classmates are worried about you,” I recovered. His eyes remained glued to the floor.</p>\n\n<p>I felt bad for Patrick. He didn’t deserve this isolation. He wasn’t the weirdest kid I’ve had, nor was he ugliest. He was just quiet. Children didn’t like quiet kids. They were mysterious, and in the eyes of the other students, frightening.</p>\n\n<p>I scanned Patrick’s sullen figure. I looked for bruises, scratches, anything that stood out against his pale complexion. Patrick noticed my gaze and withdrew awkwardly.</p>\n\n<p>“Why are you looking at me like that?” he snapped.</p>\n\n<p>Over the last few days, I noticed Patrick crying. It started with just a teardrop or two. He tried to hide it, but such things are difficult to conceal when you’re facing a teacher all day. I didn’t say anything at first- didn’t want to bring attention to the outcasted boy. As the week passed the cloud over Patrick’s head got darker and darker until, well, here we were.</p>\n\n<p>I smiled patiently. </p>\n\n<p>“Summer is just around the corner, do you have any big plans?”</p>\n\n<p>Patrick locked eyes with me for a moment. I tried to convey warm emotions through my gaze, and in return I got a vacant stare.</p>\n\n<p>“No, sir. Just video games, I guess.”</p>\n\n<p>“Hm. I could say the same.”</p>\n\n<p>A flicker of light flashed across Patrick’s eyes. Did his teacher just admit to playing video games? Yes. Yes he did.</p>\n\n<p>“Really? What do you play?” </p>\n\n<p>I couldn’t answer his question for two reasons: I had left my class alone for too long and I didn’t actually play video games. But I had to keep his interest.</p>\n\n<p>“Why don’t we continue this after class? I’ll write you a late slip.”</p>\n\n<p>I opened the door to the group of fourth graders. They all looked at us as we walked in, trying to figure out which juicy rumor they spun during our absence was true. Perhaps they’d never find out, because not one of them would dare talk to Patrick. Meanwhile Patrick sat down at his desk with a slight grin on his face. He probably had the most juicy rumor in the entire classroom. His science teacher just admitted to playing video games.</p>\n\n<p>While the kids continued their busy work I snuck out my phone and watched clips on the latest video games.</p>\n\n<p>When the bell rang Patrick hurried over to my desk. He had spent the last part of class wondering what games I played and whether or not I could beat him.</p>\n\n<p>We chatted a bit about video games. I wanted to earn Patrick’s trust. This was an important step. When I felt it was appropriate, I asked:</p>\n\n<p>“Do you have any friends, Patrick?”</p>\n\n<p>I caught him off-guard. He put on a hurt look and began withdrawing into his shell again.</p>\n\n<p>“No,” he muttered. Patrick turned on his heel and went for the door. Before he vanished into the hallway, he paused, turned to me and said:</p>\n\n<p>“Sometimes I like to pretend I’m in my own video game. One where I can hurt my enemies- kill them if I have to. It’s easy to do it online. Sometimes I wish it was real. I’d waste all my bullets on him.”</p>\n\n<p>Without another word Patrick slipped through the door. </p>\n\n<p>…</p>\n\n<p>During my free block,  I had time to catch up on some grading and do some thinking. I was alone. Or so I thought.</p>\n\n<p>I nearly jumped out of my skin when I felt a cold hand on my shoulder. It was Patrick. He was sobbing. I looked up at him and nearly fainted. The boy was missing his eyes. Blood poured from his empty eye sockets. It ran down his porcelain cheeks and dripped onto my desk. </p>\n\n<p>“They’re all dead. Why didn’t you stop me?” the mannequin-resembling boy said chokingly. </p>\n\n<p>My voice got caught in the back of my throat. I couldn’t speak, let alone scream. Paralyzed by fear, I knew death was imminent. </p>\n\n<p>“I killed them. And it’s all your fault.”</p>\n\n<p>The boy went into a fit of sobs. They were the cries of a lost child, alone in the woods and terrified of what lurked behind the dark trees. The more Patrick struggled, the more his figure changed. Tendrils of black smoke plumed from his back. The classroom lights were dimming, as if Patrick was draining them of power. A feeling of ancient evil swelled around him like a mushroom cloud. </p>\n\n<p>In a split second Patrick went from a timid, grief-stricken child to an indescribably different person. He stood upright, impossibly tall for his height. The smoke swirled around Patrick’s body until I could only see his chalk-white face. It was grinning at me. I stared at this hollow-eyed figure until it spoke to me in a deep voice:</p>\n\n<p>“I saved all my bullets for you.”</p>\n\n<p><em>Click.</em></p>\n\n<p>Next thing I knew I was sitting up in bed at home. It took me a while to process the nightmare I just had, and spent the remaining hours before work deciding my next move. I had just experienced some type of clarity. Questions and accusations were spinning in my head, the loudest one screaming the simplest explanation:</p>\n\n<p><em>Patrick Wells is going to commit murder.  He’ll bring in the 9mm he found in his dad’s gun safe and unload the chamber on his ostracizing classmates. Then, he’ll come for you.</em></p>\n\n<p>There was an urge to call the principal, the police, anyone who could prevent this madness from taking its due course. I must have dialed their numbers over a hundred times that morning, but before I hit ‘call’, something stopped me every single time. A soft voice telling me to wait and see. I was missing something crucial, but what was it? I looked at one corner of my room. There, in the shadows that were still fighting against the dawn, was the demented face from my nightmare. Its grin mocked me, daring me to call the police. I contemplated my phone again, dialed a number, hit ‘call’, and got ready for work. It was going to be a long day.</p>\n\n<p>I was mildly relieved when I saw Patrick saunter into my class first period. He looked tired but reasonably stable. I kept a nervous eye on him, and almost suffered a mild heart attack when he left for the bathroom. Anxious thoughts flooded my brain. He was going to come into the classroom and put the first bullet through Joe’s brain. Then Alice. Then Shaun. And he’d let me live so the guilt could fester within me and follow me to the end of the rope. Maybe there was still time to call for help…</p>\n\n<p><em>Wait and see.</em></p>\n\n<p>After what felt like an eternity he returned looking like his usual harmless self. There were fresh tears on his cheeks. Despite the fact that he just had a good cry in the bathroom, I relaxed. Things were going to be okay. Meanwhile the clock continued to taunt me, the minute hand appeared almost frozen, as it does in all classrooms. </p>\n\n<p>Once the bell rang I let out a small sigh of relief. I briskly walked over to Patrick. When he saw me coming, his body perked up, anticipating more video game chat.</p>\n\n<p>“Patrick, I want us to have a little chat during your next period. A good friend of mine will be joining us. No, no it’s not like that, you’re not in any trouble. What’s your next class? Math? Well, I’m sure you won’t be upset if you miss that. Let’s head on down to the office right now, he’s probably waiting for us.”</p>\n\n<p>As we walked down the hallway, I glanced down at Patrick. He felt my gaze and looked up and smiled. For a split second the nightmare from last night danced across his face. </p>\n\n<p><em>It’s not too late,</em> a foreign voice boomed in my head.</p>\n\n<p>I hoped to God this was the right decision.</p>\n</div>\n","author":"ZedBelinsky"}