{"rank":"100","title":"UPDATE: How to get BACK from Hell","id":"8m2fbd","url":"/r/nosleep/comments/8m2fbd/update_how_to_get_back_from_hell/","time":"1527260564000","body":"<div class=\"md\"><p><a href=\"https://www.reddit.com/r/nosleep/comments/8ljhzx/how_to_get_to_hell/?st=JHM3EC8W&amp;sh=3fde8afd\">I may have found my Granny,</a> but now my little girl needs me. As soon as Satin told me where Bruce and his gang of unemployed demons were partying tonight, I knew I had to get the Hell out of Hell.</p>\n\n<p>“Come on, Granny. Let’s go save Allison.”</p>\n\n<p>“You go on ahead, dear. I think I’ll stay here with Satin awhile longer. The heat here is good for my arthritis, and besides… he’s such a handsome devil,” she replied with a smile. </p>\n\n<p>I didn’t like the glint I saw in her ancient eyes as she looked at him.</p>\n\n<p>“Oh Ethel, you tease! If I was ten thousand years younger…” Satin replied with an equally unsettling smirk.</p>\n\n<p>What the?! You know what… I’m not sure I even want to know.</p>\n\n<p>“Suit yourself. I’m not wasting any more time. What’s the quickest way out of here? Industrial sector still?”</p>\n\n<p>Satin ripped his lingering gaze away from my Granny long enough to answer me. “I wouldn’t chance it if I were you. Bruce kind of made himself at home in the Factory, and I’m sure he didn’t leave the place unattended.”</p>\n\n<p>“It’ll take way too long to backtrack through the central passage. Oh no… That only leaves –“</p>\n\n<p>“Residential…” the three of us said in grave unison as the others came to the same awful realization I had.</p>\n\n<p>“Have fun with the fishies, dear,” said Granny with a grimace. “Do you have any supplies left?”</p>\n\n<p>“No ma’am. I lost my fish food in the dark, and I used everything else making my way here.”</p>\n\n<p>“Here take this,” she said, handing me a loaded pack she’d retrieved from under the bar. “I always keep an extra on hand, just in case.”</p>\n\n<p>“You’re a lifesaver, Granny,” I said gratefully as I checked the contents of the bag. A coinpurse, a package of beef jerky, a can of fish food, a bottle of wine, and what looked like a package of pizza Lunchables.</p>\n\n<p>“What are these for?” I asked, holding up the Lunchables.</p>\n\n<p>“In case you get hungry, dear. I’m afraid I’ll be keeping that wine though. You won’t need it where you’re going, but Satin and I might before the night is through.” She winked at me as she snagged the bottle. “Run along now.”</p>\n\n<p>Gross. This really was my own personal Hell at the moment.</p>\n\n<p>“Hey, Satin! Know if there are any stray demons holed up in Residential?” I asked as I began moving toward the door. I don’t want any surprises.</p>\n\n<p>“Oh, just old, anti-social Eurynomos. But he doesn’t eat the living, so you should be fine!”</p>\n\n<p>I don’t know who Eurynomos is, but I’ve already wasted too much time talking. As I headed down the hallway leading to the exit, I heard them giggling together like school girls. </p>\n\n<p>I never thought I’d be so relieved to step into the sewer.</p>\n\n<p>I say sewer, but the Residential hell-gate isn’t your average sewage system. It’s more like its own decaying ecosystem. Even though by all logical explanation, I should still be underground, there is a melancholy sky above me, lit by a greenish sun.</p>\n\n<p>I’m in some sort of sunken bayou, this narrow, shit-filled canyon with towering walls you could never scale. Not that you’d want to try anyway. The precipice on either side of the gulch is covered in bulging, oozing sores. They are the only handholds for climbing, but you couldn’t pay me enough to touch one.</p>\n\n<p>Thankfully, there will be a rope ladder when I reach the far end. It’s one beast of a climb back to the physical world, but I guess it wouldn’t be as hellish if they put in an elevator.</p>\n\n<p>It’s like this place is the neglected asscrack of the world and these monstrosities lining the walls are its shit infected pimples, the results of eons without a good shower. </p>\n\n<p>Occasionally, one of the pustules pops of its own accord, spewing whitish-yellow filth five or six feet in every direction.</p>\n\n<p>Luckily, the path is broad enough that you can stay out of range, as long as you stick to the middle. The fetid sewage water is deepest there, but it’s nothing my rubber boots can’t handle. Not until I reach the Pond at least.</p>\n\n<p>I’ve got at least a mile to go before then, so I have time to psyche myself up while I trudge on. </p>\n\n<p>&quot;You can do this. You’re a man. Allison is in trouble, and you’ll be her hero forever once you save her. You’re a man, damnit! You discovered fire, and tamed wolves, and –“</p>\n\n<p>Wait, what the fuck is that?</p>\n\n<p>It’s a shadow. A big one. Something’s following me then. But a moment later it’s in front of me. Oh...</p>\n\n<p>It’s <em>circling</em> me. </p>\n\n<p>I look up and shield my eyes against the infernal green sunlight. Yep. There’s definitely something flying around up there. </p>\n\n<p>It’s just a wide, black shadow against the backdrop of the sky. It’s so far away that I can’t quite make out the shape of it, but judging by the size of this shadow…</p>\n\n<p>Whatever is circling me is big. Real big.</p>\n\n<p>I quicken my pace to a jog. I had intended to make my way carefully, so I didn’t accidentally step off into the Pond, but now I have a feeling the less time I spend getting to that rope ladder, the better. </p>\n\n<p>The shadow continues to circle me slowly, but at least it doesn’t get any smaller. That’s good. A smaller shadow would mean whatever it is decided to descend a little closer.</p>\n\n<p>I tell myself maybe it’s just curious. Hopefully this bird’s eye view is enough and it stays right where it is.</p>\n\n<p>I’m breathing a little harder now. When did jogging get so hard? I make a mental note to cut back on the donuts and stop putting cream and sugar in my coffee once life returns to normal. </p>\n\n<p>Then the path ahead begins to widen out suddenly, the sides of the canyon veering off at sharp angles.</p>\n\n<p>The water in front of me takes on a darker cast. It’s so much deeper here. I hate this place. It’s the reason I usually avoid Residential. Few things are worth what I have to try next, but my sweet Allison is one of them.</p>\n\n<p><em>The fucking Pond.</em></p>\n\n<p>The Pond is a landfill that has collected the trash and waste of every home in the Residential sector for an untold number of years. A large pipe on the distant wall pours forth a continual stream of sewage, a putrid waterfall of excrement, bile, soggy toilet paper and used tampons.</p>\n\n<p>Somewhere deep down on the bottom of the pond, in the center of it all, sits the mother of all pustules, a gigantic version of the blisters all over the canyon walls. </p>\n\n<p>Granny calls it Old Fateful, because it erupts like clockwork, every 15 minutes. And you do not want to be out on the water when that happens.</p>\n\n<p>Over time, the acid from Old Fateful has liquified most of the trash into a thick, syrupy solution. It gives off a sickeningly sweet smell, like permanently rotting fruit mixed with those flavored trashcan liners. </p>\n\n<p>The thick pus settles to the bottom, but the liquid garbage it leaves in its wake is semi-transparent. Although, the only things that seem to survive the acid are the goldfish.</p>\n\n<p>The fucking zombie goldfish.</p>\n\n<p>Thousands and thousands of dead aquatic pets, flushed by parents of crying toddlers who promise that “Mr. Fins is on his way to fishy heaven.” </p>\n\n<p>If they only knew the terrible, soupy Tartarus they condemned these fishies to… they’d find a new way to usher Mr. Fins into the afterlife.</p>\n\n<p>The zombie fish swim around slowly a few feet beneath the deceptively still surface of the pond, lurking in large schools. They are in varying states of decay, depending on how recently they’ve made it down the sewer pipes above.</p>\n\n<p>Some of the dead-eyed fish still shimmer with orange scales, but most are at least partially corroded, with holes and chunks missing from their flesh to reveal still functioning organs, enchanted by some evil magic of the Pond. </p>\n\n<p>Those who’ve been damned here the longest are reduced to finned skeletons, forever swimming in the muck, waiting for a salvation that will never come.</p>\n\n<p>I don’t dare attempt a swim through the acid water. I’d certainly meet the same fate as everything else which has the misfortune of falling into the Pond, a fast liquification and a steaming demise. </p>\n\n<p>Only the goldfishies seem to have any tolerance for the acid, and even theirs is only temporary.</p>\n\n<p>As disgusting as they appear, the zombfish are my only means of crossing toward the dumping pipe on the other side, which is the only road which will take me back to the physical world, back to Allison.</p>\n\n<p>I watch and wait. The only safe time to cross is immediately after Old Fateful erupts, giving me a 15 minute window to perform the morbid dance that comes next. </p>\n\n<p>As I tap my foot impatiently, I look out over the water. It looks almost peaceful, except there is a large, winged shadow stretching over the water on the left side of the Pond.</p>\n\n<p>I look up to the canyon wall to see that my stalker has landed. It is now perched high above me, stretching its huge black wings and preening its feathers with its sharp, pointed beak. </p>\n\n<p>The underbelly of the beast looks pale in comparison to its obsidian feathers, giving it a strange two-tone appearance. A morbid curiosity comes over me. Part of me wants a closer look, but the reasonable part of me hopes it stays exactly where it is.</p>\n\n<p>Just now my thoughts are interrupted by a rumbling of the earth below. Ripples spread from the middle of the Pond and the deathfish scatter as a stream of pus begins spewing from the very center of the water. It violently breaches the surface and shoots what might be a hundred feet into the air. </p>\n\n<p>I involuntarily take a step back as its volcanic rain of death and decay cascades over the surface of the entire Pond, stopping short just feet in front of me.</p>\n\n<p>After less than a minute, the last disgusting drop falls into the water with a <em>sploop.</em> There’s no more time for hesitation. </p>\n\n<p>It’s time to make my move.</p>\n\n<p>I take out the can of fishy food and sprinkle a handful in the water on the edge nearest to me. Hundreds of the greedy zombiefish rush to the surface, desiccated eyeballs bulging at the rare chance at a meal. </p>\n\n<p>There are so many that they form a reeling, unsteady temporary stepping stone for safe passage.</p>\n\n<p>I leap out onto the writhing school of fish and my feet find an unlikely purchase. I steady myself as I throw more fish food a few feet further into the Pond. </p>\n\n<p>When enough fish have rushed to snatch up my offering, I make the leap onto the next fishy stepping stone. I chance a look up at my terrible winged observer, relieved to find that it hasn’t move from its spot atop the canyon wall. </p>\n\n<p>Waiting.</p>\n\n<p>Then I continue the gruesome business of hopping from mound of half-rotted fish to mound of half-rotted fish. I can feel them crunching and squishing beneath my boots. </p>\n\n<p>Several lose fins or eyeballs, or their brittle bones shatter completely beneath my weight. Thankfully there are more than enough of them beneath those I smash to hold me above the water.</p>\n\n<p>I make my way like this, spreading food and hopping to each new swarm of zombie goldfish, until I reach the very center of the water, directly above Old Fateful’s resting place on the submerged floor. </p>\n\n<p>It is only then that the shadow cast long over the water takes off and begins circling again, and I realize what the winged creature had been waiting for.</p>\n\n<p>It was waiting for me to reach the middle of the Pond. </p>\n\n<p>I’m vulnerable now, too far out to turn back to the safety of the shore, stranded amidst this sea of burning death, only kept afloat temporarily by the zombiefish below me. Safety is still several leaps away in either direction.</p>\n\n<p>I have no choice but to keep going toward my destination on the other side.</p>\n\n<p>With haste, I spread more fishy food ahead, as far away as I think I can leap under the circumstances. The shadowy form is now diving toward the Pond as I land on the next bulging fish stepping stone. I quickly spread more fish food.</p>\n\n<p>But, before I can leap to the fish that appear, the winged monster divebombs into the school, dispersing them. </p>\n\n<p>This is the first time I’ve seen my assailant up close, and the sight of him is jarring, to say the least. </p>\n\n<p>I nearly drop my can of fishy food in shock as I witness the thing – which looks like a tall, gaunt human man with huge, vulture wings instead of arms. What I had taken for a beak before is actually something like a plague doctor’s hat. He has a human mouth, though his jaw seems unnaturally wide.</p>\n\n<p>Without hesitation, he dives mouth first into the Pond and comes back out of the water with writhing, wriggling zombie fish between his jaws, gnashing them and eating them with sickening crunches and wet squishes.</p>\n\n<p>I realize this is the demon Satin warned me about. So this is Eurynomos “who doesn’t eat the living.” </p>\n\n<p>Every time I throw more fish food, he swoops into the water, dispersing my fishy stepping stones before they form fully enough for me to jump. He makes no attempt to bite me, presumably because I’m alive. </p>\n\n<p>But I won’t be living long if I don’t get to the other side of the Pond in a hurry...</p>\n\n<p>Any minute now Old Fateful is going to rain on my parade.</p>\n\n<p>I throw the beef jerky as a distraction, hoping the man-bird will chase after it, allowing me time to make my escape. He watches it sail over the water and fall in with a thump. Then he turns his gaze coolly back toward me and continues circling.</p>\n\n<p>It’s not beef jerky he wants… it’s me.</p>\n\n<p>Just now the ground starts a familiar rumbling. I’ve been out on the Pond for too long, and my fifteen minutes are up. Knowing I’ll probably die, I do the only thing I can think of.</p>\n\n<p>I throw more fish food in front of me. The fish rise to the surface. Eurynomos darts toward the water… and I leap toward him in a final, desperate move.</p>\n\n<p>Our bodies clash in the air above the water. I wrap my arms around him and my hands lock into a death grip, white knuckling onto the feathers of his wings. </p>\n\n<p>He panics under my added weight and flaps his wings to stay aloft, spinning us around in the air. The rumbling beneath us continues to grow louder, and we tumble together, each trying to stay on top, as the pus lava makes its way toward the surface of the Pond.</p>\n\n<p>He beats me in the face with one of his wings, spinning us so that he is gazing down triumphantly above me. </p>\n\n<p>Then, with all the force my adrenaline fueled muscles can manage, I reach inside his snarling, slobbering mouth, hooking my fingers onto the inside of his cheek and pull with all my might until his skin begins to tear. </p>\n\n<p>In his pain and outrage, he stops flapping momentarily, just long enough for me to spin us around so that his back is between me and the water.</p>\n\n<p>Then the motherload blows from the Pond below. </p>\n\n<p>The stream of hot pus smashes into the demon’s back with explosive force, propelling us both at least a hundred feet into the air. Eurynomos screams as the acidic filth burns into him, melting his feathers and peeling off his skin.</p>\n\n<p>We reach the peak of the eruption, then begin falling together back toward the ground. I close my eyes and brace myself for the splash which will signal my impending death, to be submerged among the zombie fish and be reduced to haunted bones like they are.</p>\n\n<p>The splash never comes.</p>\n\n<p>Instead I hear a loud crunch as together we land, the demon taking the worst of the fall, his body absorbing most of the shock as we hit the dry land on the other side of the pond. He lays, broken and still, as I struggle to my feet, dizzy but very much alive.</p>\n\n<p>I made it.</p>\n\n<p>My head is still spinning from the impact as I walk to the wall to begin my climb up the rope ladder. Only, when I reach the wall… there is no rope ladder swinging there.</p>\n\n<p>In its place is a small, handwritten note, staked into the canyon wall.</p>\n\n<p><strong>Fuck you.</strong></p>\n\n<p><strong>Sincerely,</strong></p>\n\n<p><strong>Bruce</strong></p>\n</div>\n","author":"Deesco5"}