{"rank":"3","title":"It’s my last day of work, and I can’t leave.","id":"8m2orc","url":"/r/nosleep/comments/8m2orc/its_my_last_day_of_work_and_i_cant_leave/","time":"1527262608000","body":"<div class=\"md\"><p>It all started this morning, when I got to work for the morning shift. I work in a factory, making hats and clothes and shoes. It’s mostly empty, damp and dark. It’s not the best place to work, but it brings in the money, I guess. Luckily it’s my last day today, I got a part time job closer to my university. It used to be easy, just sewing where we were told to sew, making the things we were told to make. </p>\n\n<p>But when I got to work this morning, it was... different. Scarily different. It was colder, for a start, and smelt more metallic than usual. There were sewing patterns scattered around the floor, as if someone was looking for one. Messy and unorthodox sounds like a normal day so I just shrugged it off and started working, like a normal day.</p>\n\n<p>A few hours pass. I’m working on shirts to go to the stores as per usual. They’re not very nice, or not my style at least. They’re black, with lace around the v neck and the bottom of the shirt and the shirt sleeves. They look pretty tacky in my opinion, but I get paid to make them so I guess I have to suck it up. </p>\n\n<p>Anyway, I go to look for more material. I open the storage door and just... stare, I guess. Nothing was in there. Nothing. Not even a floor, just the walls and ceiling, and they were completely bare. I didn’t think about the floor at first, it’s a tall building and we were on the fourth storey, and it was a very old building, so it could’ve just broken and fallen through, and they removed the rest of it, I assumed. So I turned around and realised something that still scares me.</p>\n\n<p>It was pitch black.\nAnd it looked like no one had been here for a very, very long time.</p>\n\n<p>I’m writing this right now at my desk, although dust coated the desk I had just been working at, and the dresses I had sewn were covered in moth-bitten holes. There was more hole than dress. It seems like years has passed and it’s terrifying me. I’ve been here for 3 hours at the most, the dust couldn’t of got here then. I’m looking at that door now, and I wish I had closed it. It’s just...open, baring wide, as if something is in there, like something is WATCHING me. I’m shaking so much as I type this.</p>\n\n<p>I need to get out of here, or try and find a way out. I already tried the door I came through, and it’s locked. I think I’m the only one here, but now I’m not so sure.I’m going to look around, the only thing working right now that I know of is my phone, and I have 90% left. I have no idea what time it is outside, my phone clock is frozen. I don’t want my phone to die, I don’t know how long I’ll be stuck here for, so I’m turning it off. I’ll update you all soon. Wish me luck.</p>\n</div>\n","author":"r0sa1ine"}