{"rank":"8","title":"Garbage.","id":"8m2vvk","url":"/r/nosleep/comments/8m2vvk/garbage/","time":"1527264159000","body":"<div class=\"md\"><p>Crowdsourcing some advice. </p>\n\n<p>I have done the best I can to piece together the pages the housekeeping people found in the drawer of the hotel room my aunt Maria passed away in. The hotel said I could keep her belongings, but all they had was a wad of these pages. No suitcases, no clothes -- she seemingly died of a heart attack, and all that was left were pages that looked like they were torn out of an old address book. -- The numbering is mine, but the words were written in ink, pencil, and typed in some cases. </p>\n\n<p>If what this is saying is true? Well -- read it. I have a note at the end for you. </p>\n\n<hr/>\n\n<p>1:\nThe room was a small suite at the Comfort Motor Lodge just outside of Bradley, Wisconsin. The motel was located across from a John Deere dealership, secluded and almost hidden by trees on a frontage road. Salt’s drive from Johnson’s Creek took a half an hour, and this motel, just a few miles outside of the southern Wisconsin bogs was on his way to another job in Rockford, Illinois. </p>\n\n<p>When a person dies outside of a care facility, it has to be cleaned up. Public places, shared spaces - there&#39;s always someone who has to scrub away the death. And after? The ones who haul out the garbage that death leaves behind. </p>\n\n<p>Most times, Arthur Salt was called to remove carpets, beds and destroy bedding. Salt was called when the elderly who brought themselves to an anonymous cheap motel room to die had innkeepers who would like to <em>keep</em> the room anonymous. </p>\n\n<p>Folks would be shocked at the number of lonely elderly checking in to these human roach motels just to check out in a semblance of comfort. Salt had been to every kind of inn, lodge, hotel, no-tel, motel and motor lodge in the Midwest in his years hauling garbage. </p>\n\n<p>Over the years, he&#39;d grown comfortable, knowing what to expect, and had become nonchalant about the inevitable way a dead body left on a bed could leak fluid out of its lowest point, and completely impress an image of their corpse on the bed with constant pressure and that same reek of liquid. Most times, there would be a singular presence of blood, shit, and whatever else leaked out of the corpse on the bed and possibly down to the carpets. </p>\n\n<p>That was bad. Under carpets was foam, glued to wood or concrete -- and whether or not you believe in ghosts, if any bit of that fluid reek seeps into the carpet and padding? May as well be haunted by a shrieking wraith. </p>\n\n<p>Salt, over the years had seen, smelled, experienced every type of sight too gruesome or sad for normal people. Suicide by gunshot, the way the blood mixes with the burn of gunpowder -- the fan of arterial and brainmatter spray against a wall like a slap of a paintbrush. </p>\n\n<p>The overdoses, who appear to be asleep -- until you catch wind of their scent. </p>\n\n<p>However, this time, he had no idea <em>what</em> he was looking at. Salt&#39;s mind spun, trying to visually decipher what his eyes were taking in, and he couldn&#39;t. </p>\n\n<p>He stood at the threshold of the motel room, looking in on what could only be described as a mad artist&#39;s installation of blood, skin, hair, and sinew.</p>\n\n<p>The motel room was cramped, tiny. There was no television. All of the other furniture in the room was removed save the bed, dresser, and carpet. Even though it was early morning, and the trees&#39; colors were whispering a rumor of fall to one another, this room was hot, a tropical warmth, even with the heater off. Salt thought to himself with panicked hilarity Maybe I should insulate my place with blood. This thought was followed by a bout of retching as he caught a glimpse of sandy blonde hair wadded up on the door in a smear of blood and grue. He backed out of the room with a hand in front of his eyes.</p>\n\n<p>“Shit.” Salt said. Shocked drool smeared his lower lip and chin, a helping of previously owned hash browns steamed on the sidewalk outside. Salt closed his eyes, and repeated the mantra he&#39;d been taught as a rookie, trying to center himself. </p>\n\n<p><em>It’s all just garbage, when it all comes down to it, it’s all garbage. Get to cleaning.</em> </p>\n\n<p>Martin Sharp was the author of the &#39;Holy Mantra of the Hauler.&#39; Martin was Salt&#39;s mentor, teacher, and introduced Salt to hauling garbage, as well as giving him a head&#39;s up about the dangers of hauling garbage. Martin didn&#39;t mention anything like this.</p>\n\n<p>2: \nSalt waved to Martin, standing outside of the Carpenter’s Inn just outside of Fort Atkinson. Martin wore a green-gray coverall, stiff at the joints, rubber gloves up to his elbows. His sandy blonde hair cropped short, out of his eyes. Martin practically reeked of the mentholated alcoholic haze of Scotch Guard. He did not wear a mask. </p>\n\n<p>“I didn’t think you were coming, Mr. Salt.” Martin said with a grin. Martin&#39;s sharp gaze pored over his classmate with a surveyor&#39;s appraisal. &quot;Good to see you made it.&quot; Something in that grin was more than friendly. Salt chose to ignore it for the moment. Salt met Martin in &#39;Psyche 201&#39;, they were chat buddies in class, but not much more. </p>\n\n<p>“Hey, man, you said I could make a quick two hundred bucks.” Salt said, trying to take a casual look in the rear of the van, for the cleaning supplies he supposed would be there. </p>\n\n<p>“Nothing in there, man. Just your coverall. Also, you’re making two hundred and <em>fifty</em> this time. Don’t forget that all you need is a panel van to make this your career, buddy. You might also want a mask your first time out.” </p>\n\n<p>Martin’s grin stayed around longer that Salt thought to be socially acceptable. His smile showed both playfulness and avarice, in equal measure.</p>\n\n<p>&quot;What&#39;s so funny?&quot; Salt said, smiling back to him, feeling his nerves guiding his face more than mirth.</p>\n\n<p>&quot;You&#39;ll see, man.&quot;</p>\n\n<p>Martin and Salt walked through Carpenter’s Inn’s finest ‘honeymoon’ suite, and found a stripped mattress with a broad brown and deep maroon spot across the center, and a crevasse in the middle that looked like a massive, deeply imprinted comma. Salt could smell blood and something else. It seemed like a scent of shit and sweat, and under it a seething fetid reek Salt didn&#39;t have a name for, but would come to know well in the next couple of months as &#39;the stink of garbage&#39;. </p>\n\n<p>“God, what <em>is</em> that?” </p>\n\n<p>“It’s the smell of garbage, Salt. When it all comes down to it, humanity post-mortem? It&#39;s all garbage. Remember that, and you&#39;ll be fine, man. Let’s get to cleaning.” </p>\n\n<p>Martin’s grin never seemed to falter, or in fact, leave his face. That smile,  like the <em>snap-tick</em> of his watch was pervasive during their first day of work. The grin held even as he pulled the soiled mattress from the box spring, dragged it out the door, and shoved it into the back of his van. The box spring was also stained with the same reddish and deep brown liquid, and so also was dragged out of the room and shoved into the back of Martin’s panel van. </p>\n\n<p>Salt struggled with the lopsided bulk of the box spring, and turned his head quickly enough to hear the neck muscles creak. </p>\n\n<p>“What?” Salt said, feeling his pulse in his neck, looking around for whoever had just spoke to him. </p>\n\n<p>“What, what?” Martin said, pulling on his end of the box spring with a lighter grasp, looking at Salt with his piercing, evaluating eyes. Now, no grin. Martin&#39;s eyes were the same color as hazelnuts flecked with pale green, and they were scanning Salt&#39;s face, looking for something. </p>\n\n<p>“Nothing, man.” </p>\n\n<p><em>Tick-snap-Tick.</em> </p>\n\n<p>The watch counted off a few seconds, passing time, and the moment came to an end as the watch chimed a precise series of notes, &#39;Greensleeves&#39;.</p>\n\n<p>Martin shrugged, and shook his head, his smile prowling the corners of his mouth as he shoved the box spring into the back of his van, and tapped a button on the side of the watch, cutting the tune short.</p>\n\n<p>The rest of the first cleanup was easy, peeling carpets, and stuffing the strips and rolls into the van as well. After, Martin Sharp&#39;s smile was wider as he walked around the room, making a couple quick notes into a battered notebook, that he shoved into the back pocket of his coverall. Martin, satisfied with his day’s work (which, all told amounted to five hours), then peeled off several bills from a roll that contained all manner of denominations. Salt took them and counted, not licking his thumb to count, not wanting to touch his own fingers with anything near his face. </p>\n\n<p>“Hey, there’s more than two fif-”</p>\n\n<p>Martin cut him off. “That’s because you didn’t gag. Look, I’m going out tomorrow, and I’ll cut you in for more than ten percent next time if you show. It’s at the Edgerton Oasis Motor Lodge. If you do decide to come, Salt, bring galoshes. It’s a messy one.” </p>\n\n<p>Martin drove off, taking his haul to the dump, and Salt decided, after doing the quick math that there was a lot of cash to be had in hauling ‘garbage’. So, Salt continued doing this dirty business that needed to be done, discreetly as could be managed. When people asked him what he did for a living, he simply said ‘I haul garbage.’ Which Salt guessed, was why people never asked why he never ate finger food. </p>\n\n<p>3: </p>\n\n<p>Looking back into the room, Salt caught a whiff of that same scent he caught the first time he helped haul with Martin; something under the blood and shit and dribbling fat, a smell like rotten eggs and a septic tank, a cloying and nauseating miasma. Salt flicked the switch on the wall, and the lights came on, casting the entire room in a reddish orange hue. The smell grew for a moment, and then Salt noticed the sizzling sound of blood collected in the ceiling lamp cover heated by the light bulbs. The sound turned his stomach again, but this time all that came were dry racking heaves, since Salt had long ago learned to eat a light breakfast when hauling. He wiped his mouth, and there was a soft ticking in his ears, possibly coming from the leaves clattering around on the shoddy roof of the motel. </p>\n\n<p>Why the fuck didn’t Martin mention this on the phone? Fuck. This is a job for a hazmat team, not a hauler.</p>\n\n<p>The sound of the bulb cooking the blood was too much, so, Salt flicked the switch, and worked in the dark for the better part of a whole day. Sunset came, and the sky blazed orange behind him. A cold wind blew and shuddered the trees surrounding the building, sending a torrent of multi-hued leaves all over the place. Again over the wind, not much could be heard. Salt actually sopped up most of the walls with towels, using the hotel’s own cleaning supplies to clean up. Salt would be damned if he used his own cash or equipment to clean this mess up. The smell was fading as he cleaned, and soon, all that was left was to undress the beds, and strip the floors.</p>\n\n<p>Salt entered the bathroom, and pulled down the plastic shower curtain, balling it up, wincing as the smeared gore and blood ran down the front like mercury in a teflon pan. He stuffed the curtain into a lawn bag, and the crinkle-crackle seemed to pervade as the curtain entered the black bag. Something chittered in the room. Aphids make that noise, Salt thought, mice or rats make that noise too.</p>\n\n<p>Salt whirled around.</p>\n\n<p>&quot;Who&#39;s there?&quot; Salt said, face flecked with pips of blood, jaw working in the harsh glare of sundown. Again, he heard a murmur, and again, nothing was there to answer him.</p>\n\n<p>&quot;To hell with this, it&#39;s just..&quot; Salt said, walking out of the cramped room, tossing the bag in the back of his van, &quot;..garbage.&quot; </p>\n\n<p>Even with the mantra, Salt stood at the edge of the room, swabbing down the door. Scrubbing, even though it had been clean since the third pass. The smell was fading, but still present. Salt closed his eyes, and then he could hear a faint noise coming from the room. At first, Salt thought he was imagining things. He thought that the noise was coming from outside, aphids or birds lighting on the motel&#39;s roof. Leaning back into the room he could hear a steady pulsing sound, murmuring somewhere in the gloaming, followed by a sound that filled his gut with ice. </p>\n\n<p>&#39;Greensleeves&#39;, chiming away on tiny little electronic bells. </p>\n\n<p>4: </p>\n\n<p>“You know what kills me?” Martin said, as they met up in the diner outside of Shadsburg, a small factory town in middle Wisconsin. </p>\n\n<p>“Bullets? Wolfsbane?” Salt said, grinning through a mouthful of grilled cheese. He could only eat bland foods on haul days. </p>\n\n<p>“Funny, shithead. No, what kills me is that all of these people don’t know how often we have to haul garbage out from the hotels. Shit, most don’t know about the creepy shit that happened to their towns. Like, nobody round here talks about the time the Chersty Machine Shop’s boiler burst during the middle of a shift. Sometime in the twenties, this happened, boiled all the kids working the line alive. Bet it smelled like that job over in Delaporte.” </p>\n\n<p>“Fuck, man. I’m eating, yeah?” Salt said, swallowing. He’d done a few hauls where someone died in a bath.</p>\n\n<p>Old codger slips into a nice bath, hot water running. Stroke kills the coot, water runs, hot water getting hotter and hotter. Body getting seared and blanched until the motel manager finds out what the hell&#39;s going on in his best suite. Nasty smell, there. Never saw a body, but that smell doesn’t just go away. That smell, doubled or tripled. Salt wanted to punch that grin on Martin&#39;s face down his throat. </p>\n\n<p>“Yeah, yeah.” Martin said, sipping his club soda. “But, isn’t it weird that the Shadsburg Cozy Motel is built on that same spot?” </p>\n\n<p>Salt looked at Martin, whose evaluating eyes stared into his, and the same grin appeared at the corners of his mouth like wandering ghosts. </p>\n\n<p>“You’re fucking with me now.” Salt said, and again started to wonder what was wrong with his friend Martin. </p>\n\n<p>“No. I&#39;m not fucking with you.&quot; Martin said. &quot;And, down south in Whitewater, shit, I don’t even want to go into what they did on purpose.” Martin said, trailing off. Salt felt the words worming their way into his head. Salt hated that. Martin would suggest something and it would eat at him until he saw for himself. </p>\n\n<p>“Right. Well, what of it? Who gives a shit? We’re all garbage, right? Right?” </p>\n\n<p>“Not some of us, Salt.” Martin said. “Sometimes, the garbage we haul is left in those rooms deliberately.” Martin sipped his club soda again.</p>\n\n<p>&quot;Meaning?&quot; Salt said, growing impatient.</p>\n\n<p>&quot;Meaning, man, that not all the stuff left in those rooms is garbage, Salt. Some of it&#39;s not worthless, by a damned sight.&quot;  Martin&#39;s voice dropped a little, and his grin turned down at the corners. His eyes darted around the room nervously. Salt pushed his plate away, feeling his appetite grabbing its hat and flipping him off on its way out the door.</p>\n\n<p>&quot;What are you talking about, Martin? Like jewelry and shit? I was meaning to ask where you got that watch--&quot; Martin cut him off, closing his eyes and shaking his head with an impatient smile.</p>\n\n<p>Martin leaned in, “How many times have we been out there cleaning shit up? You know, since the first one in Fort?” </p>\n\n<p>“At last count, about thirty or so, I suppose.&quot;  </p>\n\n<p>“Yeah.&quot; Martin said. until now, I decided to keep the weird shit to myself, because I didn’t need you hearing shit from some superstitious crackpot, or saying shit to the wrong folks, or running your mouth to the civilians.&quot;</p>\n\n<p>Salt leaned in close and said, &quot;You&#39;re fucking nuts, you know that right?&quot;</p>\n\n<p>Martin&#39;s grin did little to assuage Salt&#39;s fears.</p>\n\n<p>&quot;Now, you know how to do the job, and I figure that once you start doing it on your own, you better know some of the real dangers of the hauling game and rewards.”  </p>\n\n<p>“Dangers?” Salt said, and chuckled. “Right.” </p>\n\n<p>“Hey, listen. There’s more than just garbage in there sometimes. You should look for that stuff; because in those rooms, that’s where you’re gonna get to find out what’s really going on.” Martin’s eyes were surgically dissecting Salt as he spoke. </p>\n\n<p>“See, I found this book in one of the rooms in the New Glarus Quality Suites, when I was just starting out hauling. It had notes, looked like something a hauler would write about the job.” Martin reached into the back pocket of his coverall and dropped the small leather bound notebook onto the table with a slapping sound. Salt looked at the book. It looked old. The edges of the pages were wrinkled, wavy, from water damage, or some other kind of fluid. The possibilities weren&#39;t palatable. </p>\n\n<p>“Shit, I didn’t think there was anyone else who would do this job other than those trauma site cleaner guys. Not everyone can afford a thorough clean up and repair, so they farm out the little jobs, it’s all in there. But this little black book had advice in it about the stuff to look for, and the reason why that stuff&#39;s left behind.” </p>\n\n<p>“What stuff?” Salt asked after a few seconds.</p>\n\n<p>Martin grinned a shark’s grin of avarice. </p>\n\n<p>5: </p>\n\n<p>Salt recognized the sound, as Martin’s wristwatch. Martin and he had worked long enough together before Salt had his own van. Nothing being said, and the only sound filling the room as they carved up carpets and moved the deathbeds of the anonymous garbage out was Martin’s gold watch ticking away, and at the end of each hour of work, &#39;Greensleeves&#39;. He&#39;d liked to have thrown the goddamned thing in the Rock River and be done with it months ago. Now, the sound of those carefully played notes on the electronic watch wrapped around his guts with a frigid wire. </p>\n\n<p>Walking into the room again, boots creaking and crunching through the crust of blood limning the carpet, Salt followed the sound of the watch&#39;s tune. Salt clutched the crusty and stained towel in his hands as he moved around, sensing the sound with his stomach tightening, trying to purge what was left through the giddy lurching. Reaching the end of the bed, Salt dropped to his knees, putting his gloved palm on the floor for support, and was surprised to see the thick wrist band of Martin’s nice gold watch, the face smeared with tar-black blood. The second hand ticking seconds off in even measure. And worse, the watch was still being worn by Martin&#39;s hand and wrist. </p>\n\n<p>A hand under a shitty motel bed was all that was left of Martin Sharp, that, and some bloody room furnishings. Salt blinked a few times, and then noticed the dirt under the fingernails, the bits of scabby blood on his palms. Fear clutched at Salt from behind, a legless creature, scrabbling up his back. Salt backed away from the watch, hand, and wrist under the bed into the dresser he cleaned. Scooting on his butt, using his palms to move him across the matted bloody floor Salt sat on the blood saturated carpet, breathing sharply and staring at the bed. Seeped, and steeped in the blood of his friend, and mentor, Martin Sharp. </p>\n\n<p>When it all comes down to it, we’re all garbage. </p>\n\n<p>Salt’s reverie didn’t last long. </p>\n\n<p>Salt grabbed a broom, and swept the hand out from underneath the bed, and it rolled, rubbery, and bobbled on the carpet. The meat of the wrist was pulled apart, so whatever did this tore Martin to pieces. The light outside had grown gray, and the branches of the nearby trees rattled like bones in a mass grave in the gusts of wind. Patters of cold fall rain began to spit on the sidewalk, soaking the pile of regurgitated hash browns and spreading the pale shredded mess around. </p>\n\n<p>Salt grabbed the hand by the pinky, and noticed the hair on the knuckles and wrist. The watch ticked, and that strange smell was thick around it. Salt took the watch, and put it on, smearing the back of his wrist on his coverall, tossing the severed hand into a garbage bag. The watch worked, it was gold.</p>\n\n<p>Besides, Martin wasn’t going to be needing it anymore. </p>\n\n<p>A small shark’s grin appeared at the corners of Salt’s mouth. </p>\n\n<p>He pressed the button, and &#39;Greensleeves&#39; came to an end.</p>\n\n<p>“Fuck.” And that’s all that Salt said for a while. </p>\n\n<p>Salt continued cleaning up, even as the grey of sunset faded to the dark blues and purples of night’s embrace. He hauled out the mattress, pushing from his mind the thought that this bed was soaked in his friend, and shoved it into the van that Salt bought from Martin. </p>\n\n<p>Hauling garbage. Hauling Martin. Christ, this job just gets weirder.</p>\n\n<p>The steady ticking of the wristwatch filled the seconds and minutes while Salt cleaned the room. Between the mattress and box spring Salt was surprised to find Martin’s book lying there, soaked with blood. The pages were only affected at the edge. The book was almost untouched, but the cover was soaked with blood, front and back. </p>\n\n<p>Salt reached down, and grabbed it up, intending to toss it into the garbage bag with Martin’s hand, but instead, he slid it into his back pocket, smearing blood on the back of his coverall. </p>\n\n<p>6: </p>\n\n<p>“Well, the first thing to look for is candles, Salt.” Martin said, and the smile on his face faded somewhat. </p>\n\n<p>“Candles?” </p>\n\n<p>“Black ones, if the idiot didn’t know just what they’re doing, certain colors mean certain things, and black seem to be the ones most popular with those who don’t know what they’re doing.&quot; </p>\n\n<p>&quot;What are they doing?&quot; Salt said, but Martin wasn&#39;t going to be sidetracked. Salt hated when he got this way, he was hard to follow sometimes.</p>\n\n<p>&quot;Look for chalk dust. Usually, the cops will clean up the mess, and book most of that shit into evidence, which is why doing this job in a big city would be pointless. But doing it out here in the sticks, you get to keep some of the stuff, and learn more.” Martin said. </p>\n\n<p>“Yeah.” Salt said, not understanding, but fascinated. &quot;Why is that important? Candles, I mean--&quot; </p>\n\n<p>“Well, you have to understand, we’re all garbage to them, too.&quot; Martin said, his voice dropping low, and his grin smothered by a wistful look. &quot;People. We don&#39;t matter to them at all, which is why we have to be careful, why it&#39;s dangerous.&quot;</p>\n\n<p>&quot;To who?&quot; Salt said. Martin looked around for a second, and then shook his head, smirking.</p>\n\n<p>&quot;But there are things we do to protect ourselves from them. Some things are just habit now, like pointed eaves, and certain floor plans...clapping. But candles, and chalk, and, don’t forget bells. Sometimes, somebody uses an old alarm clock for a bell, but a real bell works better.&quot;</p>\n\n<p>&#39;Greensleeves&#39; began to play on his watch, and Martin thumbed the watch absently, turning the tune off. Salt grabbed his own club soda, and sipped at it.</p>\n\n<p>&quot;Yeah, but who are you talking about? Who? Is someone out there offing old ladies and pension cases? Like BTK or something?&quot;</p>\n\n<p>&quot;I have a whole collection of candles and bells at home.” Martin’s voice was a whisper, and his sharp eyes measured up the room instead of Salt’s reaction. The diner was nearly empty except the cook, who didn’t speak English and the waitress who didn’t understand English. </p>\n\n<p>“Sometimes there’s pieces.” Martin said. </p>\n\n<p>“Pieces.” </p>\n\n<p>“Yeah, of people. Sometimes, there’s stuff written down, and I put it into the book.” Martin tapped the book. The cover was black, and worn, and there were empty pages near the back, but a lot of it seemed to have been written in all the way past the margins. Salt&#39;s skin crept around thinking that whatever was written in that book was trying to sneak out and get into his head, make him like Martin. Salt&#39;s hands dropped to his lap suddenly, and he licked his lips, feeling odd. </p>\n\n<p>“Most times there’s not much of anything. But when we go for a haul, look up the history of that motel, or hotel. If there’s something weird, let me take it. I’ll let you have the regular ones.” </p>\n\n<p>“What are you saying?” Salt asked, his eyes darting away from Martin, whose gaze became sharper than ever. </p>\n\n<p>“I’ve figured out the main parts, Salt. I can make them help me live forever, man.” Martin said, and Salt understood that his good friend Martin was out of his mind. Somehow, Martin had it in his head that doing this job led to some kind of eternal life or something. That hauling garbage somehow prevented death from coming for you. </p>\n\n<p>“Salt I need someone to take the regular jobs, and bring in cash. I’m going to keep going to the weird ones, the special hauls, and I&#39;m going to get all the information I can about how to do it. When I’ve figured it out, I’ll leave you the book, and you can come, too.” </p>\n\n<p>“Come where?” Salt asked. The diner had grown hot, and sweat trickled down Salt’s spine. The trickle was followed by a wave of cold as Martin&#39;s grin returned. </p>\n\n<p>“When the book’s yours, you’ll know.” Martin said. </p>\n\n<p>7: </p>\n\n<p>There was a mutter of thunder and a staccato flash of lightning. The rain had begun in earnest, and Salt thought about the book in his back pocket. The bag with Martin’s hand in it was already in the van. He’d need to shove the dresser outside, and haul it on the next day’s trip. A two day trip cut into the profits, but now that Martin was gone, it would be necessary. Martin being dead, Salt was stricken, in shock, but continued nonetheless. Then, as the bed frame was loaded into the van, Salt turned and looked at the empty hotel room. Salt reached into his back pocket, pulling out the notebook, and walked toward the room again, horrified that his feet wanted to move closer to whatever might still be in there. </p>\n\n<p>Now, the book was Salt&#39;s, and something in him wanted to know where Martin thought he was going to go.</p>\n\n<p>Salt hit the light, and the naked bulb shone on the room. He had thrown the cleaned fixture cover into a bag and loaded it into his van. The carpets gone, exposed the concrete beneath. Salt opened the book, and stared down at the first page, consisting of a few dates scrawled around some addresses. The cross-referencing was in a stilted all-caps that seemed to be a semi-official ledger. Salt read more, and could see the pattern emerging within. All around him, there were clean ups that occurred, in places with weird histories. Each of these linked to the people who were trying to do what Martin had decided to do, but the dates of the cleanups would have made Martin at least sixty years old. About halfway through the book, the handwriting was in ball point pen, in the erratic backhanded lefty scrawl of Martin Sharp. </p>\n\n<p>Poring over the pages, Salt could see that each of the hauls Martin went on were the aftereffects of whatever those people were doing, whatever they were trying to do. Candles, bells, bowls, all the accoutrements were the proof that something other than simple dying was happening some of the time. Words were written in the margins, &#39;Ashema Deva&#39; and &#39;Nergal&#39; and &#39;Rax&#39;. Words he&#39;d heard before, somewhere, but didn&#39;t really have context to illuminate. Salt had never seen a body, or a body part, in his hauls before. The book told of body parts, and special markings on the doors and floors and walls. The book was filled with room plans, scribbled in pen, layouts marked for appropriate placement of candles, body parts found, and length of time it took to clean up. Some pages had Martin’s handwriting written in the margins, correcting certain facts and  theories.</p>\n\n<p>Then about two thirds of the way through the book, Martin’s handwriting described the way that his dad gave him the wristwatch the first time he went with him on a garbage haul. Then the book was eager to give a description of Martin’s father’s left eye and teeth, along with the book, being found in a hotel room in New Glarus, which Martin cleaned up and wondered why his father didn’t tell him what he was doing. \nMartin then became obsessive about the book, creating charts for a number of the rooms he had cleaned up. Sixty two rooms, sixty two charts, each with a different likelihood of success of accomplishing whatever the something was all those people were doing when they died. The last entry was ecstatic, going on about ley lines, about the timing of the year, about the pieces Martin would need to meet them. What to give them to take him to where his father went. Over the last many years, and increasingly over the more recent few months, Martin collected the pieces. At all the places where weird shit had taken place and the ritual was observed, Martin collected information and bowls, bells, and candles. </p>\n\n<p>And there on page ninety one of the dirty black notebook a very accurate sketch of the room where Salt sat reading the notebook, marking the mattress, and the back of the door with Martin&#39;s own handwriting underneath &#39;Shigg&#39; with a strangely Euclidian diagram positioning small sketched candles. The word seemed to writhe on the page, and Salt closed his eyes. </p>\n\n<p>“Great.” Salt said. His voice was a hoary croak, and the strange Martin-esque smile played at the corners his mouth, twitching.</p>\n\n<p>Salt continued reading, as the storm continued flecking rain onto the window, and blowing leaves into the threshold of the door. The ritual Martin had been chasing down had happened here, and Salt only guessed that it could happen again somewhere else with a similar history. Someone would have to die there, someone die there naturally, and prime the place, to give the place the proper setting, to open the ways.</p>\n\n<p>Martin wrote about pain, about the tolerance for pain, and the denial of death so long as the ritual was observed. The ones Martin spoke of, those &#39;other&#39; haulers, would take you with them to live forever beyond this world, but you had to protect yourself from them, because while they&#39;d help us they&#39;d always hate us.</p>\n\n<p>Hours passed, Salt continued reading. Salt headed back to his apartment in Parker, staying awake and continuing to read through the notebook. The facts Martin and his father found at their hauls piling up with the suppositions they made,  and Salt was surprised to find some of his own knowledge fitting in the gaps where Martin or his father weren’t sure of what was going on. Salt finished reading the notebook, and then grabbed a pen. </p>\n\n<p>Salt wrote the date, and exactly what he had found in Martin&#39;s ritual room in the back of the book. There were only a few pages left to be filled. Salt wrote down what he had found that day, and added a few notes to the previous pages. Martin’s words, Martin’s father’s words, and Salt’s words were together on several of the pages, and Salt read more on the subject in his down time.</p>\n\n<p>Martin’s words were all that were left of him, except the hand, and ultimately Salt decided to keep the hand for himself. Like the book said, pieces were important. The last page of Martin’s writing included a note about the key to his storage unit out on County N, where Salt could find the other pieces Martin had collected, including his father’s eye, but not the teeth, which he used to call the &#39;haulers&#39; in this room. Salt found the key taped to the back of the medicine cabinet’s mirror in the bathroom when he returned the next day for the dresser. More and more, Salt found himself looking for those &#39;weird&#39; hauls, smiling that same shark’s grin because he now had a name for the ritual Martin had been chasing.</p>\n\n<p>Transubstantiation. </p>\n\n<p>8:</p>\n\n<p>“Maria! You came.” Salt said, grinning. Maria smiled, one eye wincing at the brightness of the morning reflecting off of the lake outside the Silver Inn. </p>\n\n<p>“Well, I couldn’t pass up three hundred bucks, Salt.” </p>\n\n<p>“Three fifty. Your coverall’s in the van. Grab a mask, too.” Salt said, eyeing her. </p>\n\n<p>Salt went into the motel, and Maria noticed a big notebook in the back of his muddy coverall. At least, she suspected it was mud. Salt stood in the doorway for a long time, slowly looking around the room as Maria pulled on her coverall. </p>\n\n<p>Maria wondered what in the hell he could be looking at. </p>\n\n<p>Salt simply grinned that toothy, greedy smile at what looked like a big mess on one of the beds, and scribbled something into his notebook. </p>\n\n<p>“Ugh! What’s that smell?” </p>\n\n<p>“It will be easier for you, if you remember that ultimately, it’s all just garbage, just a mess to clean up. Let’s get to cleaning. Time’s wasting.” Maria noticed the sharp grin. </p>\n\n<p>They worked in silence; the only sound passing between them was the sharp tick of Salt’s wristwatch. And then, just as the sun dipped below the horizon, &#39;Greensleeves&#39; played on intricate electronic chimes. </p>\n\n<p>What a nice watch, thought Maria.</p>\n\n<hr/>\n\n<p>The hotel called me right after I got home. \nThey said Aunt Maria had stored some stuff in the hotel safe after checking in. A watch. And a notebook. </p>\n</div>\n","author":"SuperSaguaro"}