{"rank":"38","title":"I am a sad lonely man","id":"8m2y57","url":"/r/nosleep/comments/8m2y57/i_am_a_sad_lonely_man/","time":"1527264637000","body":"<div class=\"md\"><p>This was my header on a Russian mail order bride website. As it turns out you don&#39;t just pay for the bride and shipping costs, first you get to know someone from the thousands of chicks (and guys! albeit I personally wasn&#39;t interested...) and see where you wanna take it. Some girls want a serious husband, some a visa that they&#39;re willing to earn ;) and various other arrangements. This obviously isn&#39;t a tutorial on how to get a bride but I figured I&#39;d get this out of the way for those of you not familiar with the sadder parts of the internet.</p>\n\n<p>In my profile I mentioned my wife- ex wife, keep forgetting the ex. she didn&#39;t leave me for my questionable morals if that&#39;s what you&#39;re thinking; she simply died. I won&#39;t get into to many details but I will say she left me with 6 children ranging from the ages of 3 to 14. three years later my oldest child James jokingly says I should order a bride, little does he know I&#39;m just desperate enough. No sane lady wants a widower with kids ,and so one night when all the kids were out on sleepovers and what not, I sat down with a bottle of scotch and did just that. I didn&#39;t put a profile picture just in case, and wasn&#39;t expecting much to be honest since that&#39;s the number one sign of a fake profile. </p>\n\n<p>After a couple days I checked back in and saw four letters have been sent to me, two were clearly copy pasted and felt very insincere, one accused me of being fake, and the last took me for a ride.</p>\n\n<p>This woman, prettier than every other girl on this site by far, wrote me a letter about her home life and how she must escape her uncle, and in order to do that she must leave Ukraine. Now I don&#39;t believe everything I&#39;m told but this seemed too detailed to just be a gold digger looking for a green card. I massaged back &quot;do you have skype&quot; so we could talk things out. A couple hours later she answered &quot;sometimes&quot; with her user name (she was very active on this website but she didn&#39;t frequent skype much for reasons you&#39;re about to see). Even then I knew better than to immediately call and I asked when can we talk, she answered quickly &quot;call in 3:55 hours not before dont be late&quot; I had to cancel a gig but this was more important so when the time came I called. </p>\n\n<p>The woman who answered looked just close enough to her profile picture but deferent enough for me to be caught off-guard. Her eyes were sunken in and looked so very tired, dry lips, bruises that didn&#39;t quite heal... it was bad. Her English wasn&#39;t good but I still asked questions &quot;how far are you from help&quot; is what my dumbass self chose to ask first, she said she lives in a small village 3 hours away from Kiev and there&#39;s no one to help her there, she stressed I was her last chance before I heard a door shut. She quickly said &quot;no more time&quot; and in her effort to quietly shut the laptop she didn&#39;t quite close it. I couldn&#39;t see anymore but I could still hear. Her uncle (I assumed), was yelling at her and she started crying, sounded like she was pleading with him but I wouldn&#39;t know since I don&#39;t speak Ukrainian. It felt like hours while I was listening in on this when suddenly I heard a gunshot. A few moments later a man opened the computer, I managed to think quickly and put my thumb on the camera before he could see me but he still took his finger to his mouth and said &quot;shhhh&quot; before disconnecting. </p>\n\n<p>That was three months ago. Her profile on the website was deleted and she&#39;s never connected to skype. I saved her profile picture so I reverse photo searched it and found out she&#39;s been missing for over a year. I thought of contacting the authorities but honestly, those moments after the gunshot were real quite, doubt there&#39;s anyone to find anymore. That man&#39;s face is blurred in my memory now so I have no way to help, in the article it states she&#39;s believed to be dead, a belief as good as any. At the bottom of the article there&#39;s a massage from her parents begging for anyone to help find her, guess I did... </p>\n\n<p>Her name was Julia and I was her last chance, as they say, біда. </p>\n</div>\n","author":"whyshouldyouwakeup"}