{"rank":"0","title":"MY TERRIBLE SLEEPOVER","id":"8m2zus","url":"/r/nosleep/comments/8m2zus/my_terrible_sleepover/","time":"1527265020000","body":"<div class=\"md\"><p>One night i went to my friend&#39;s (we will refer to him as Jimmy) house for a sleepover and let me tell you it was not a good experience.</p>\n\n<p>So me and my friend played games till midnight then finally planned to sleep.This was the beginning of a terrible night.</p>\n\n<p>So I and some other friends slept on the floor while Jimmy slept on the <a href=\"https://bed.It\" rel=\"nofollow\">bed.It</a> was going quite and peaceful until at 3:00 A.M I was woken up by my sheet being pulled off.I woke up another friend (james) and told him what happened.We both got up grabbed some flashlights when we heard a huge crash in the kitchen that woke everyone up.We all were terrified.We went to investigate when we heard screams of terror coming from outside.</p>\n\n<p>&quot;WHY ARE YOU DOING THIS!&quot;</p>\n\n<p>Those type of screams.Then we heard a loud screeching noise from upstairs that shooked us all. I froze with chills running down my spine as I felt like I was being watched.I was to scared to tell anyone about <a href=\"https://it.My\" rel=\"nofollow\">it.My</a> friend James came running and dashing towards me and the others while shouting </p>\n\n<p>&quot;THERE&#39;S A MAN UPSTAIRS HIDE!</p>\n\n<p>Some hid in a closet and some in the bathroom. We called the police but suddenly there was no service. As we were hiding a sinister voice while moaning said,&quot;Do you need help if you do come out and i will help you!&quot;</p>\n\n<p>We all knew that it was the man/ghost James was talking about.I started to get goosebumps and almost started crying.</p>\n\n<p>While we were hiding my friend&#39;s cat started shouting &quot;MEAOW MEAOW MEAOW!&quot; As if it was getting beaten by something. My friend swore this had never happened before to him.</p>\n\n<p>Suddenly when it reached 4 AM it stopped everything stopped.The service on our phones was back,there were no sounds at all.We all thought we were fine but this was only the beginning.When the service came i looked up history about the <a href=\"https://house.It\" rel=\"nofollow\">house.It</a> turns out 5 people were murdered there (who had unfinished business)on Semptember 12 1990. </p>\n\n<p>Guess what day it was September 12th <a href=\"https://2017.My\" rel=\"nofollow\">2017.My</a> jaw instantly dropped and when i showed it to Jimmy he said,&quot;So that&#39;s why my mom told me not to go to the attic.&quot;</p>\n\n<p>I instantly asked &quot;Where&#39;s the attic?&quot;</p>\n\n<p>Jimmy replied in a sad voice,&quot;In the closet upstairs.&quot;We all instantly went upstairs and looked there.What we saw will scar me for life.</p>\n\n<p>It was a man who&#39;s face was completely fucked and twisted.He had no chin and no feet.And remember it was in the attic where I saw him.I screamed at the top of my lungs as he vanished in thin air.We called the police.The police was gonna be there in 30 minutes.</p>\n\n<p>Soon blood started to drip from walls.Right after that we heard probably the worst scream of a girl coming from the attic.Soon the police arrived and they found two dead bodies in the attic both were 2 girls</p>\n\n<p><strong>One thing I can tell you that what&#39;s in the attic is not Human.</strong></p>\n</div>\n","author":"AsmarYT"}