{"rank":"7","title":"Caterpillar 2: Transformation","id":"8m2zw7","url":"/r/nosleep/comments/8m2zw7/caterpillar_2_transformation/","time":"1527265031000","body":"<div class=\"md\"><p>the  sequel  to- </p>\n\n<p><a href=\"https://www.reddit.com/r/nosleep/comments/8k8e56/caterpillar/\">https://www.reddit.com/r/nosleep/comments/8k8e56/caterpillar/</a></p>\n\n<p>It has been three months since Eliza, or Azzy as she likes to be called, came back into my life. She’s been acting like any normal millennial, attending community college, landing a part-time job, and spending a lot of time on social media. She even asked if she could make a Facebook account for me. I told her she could, but only if she would run it. I had no time to deal with random friend requests. She agreed and used her phone to take a picture of us to use as my account avatar. “Perfect!” she said as she kissed my cheek. Her long black hair fell over her light blue eyes. “I love you, Johnny V.”</p>\n\n<p>I took hold of her hand, admiring how ethereal her skin looked compared to my dark, Hispanic complexion. “I love you too, Azzy. Did you want to meet me for lunch?”</p>\n\n<p>“No, I have plans.&quot;</p>\n\n<p>&quot;Oh.&quot;</p>\n\n<p>&quot;Work stuff,&quot; she clarified. &quot;But I’ll have dinner ready when you get home. ”</p>\n\n<p>“You’re the best.” I drove to work on my motorcycle, a gift from Azzy. She claimed she bought it used from a school friend. All I know is, I told her it had always been a dream of mine to own a motorcycle then she made it happen.</p>\n\n<p>I was so lucky to have her, but part of me always wondered- what happened to her “family.” Eliza never said she “escaped” the cult, she said she “earned her freedom.” Along with a necklace made from her defeated father’s skin. But her family consisted of more than just her father, there was an entire network of tunnels ran by dozens, possibly hundreds of demons in clown masks. What happened to them all? And, of course, there was the caterpillar; the massive creation made from the body parts of their victims. Whatever became of it? It wasn’t my business or concern.</p>\n\n<p>What was my concern? Apparently my facebook account. At the hospital, a fellow nurse, David told me he sent a friend request and wondered why I was taking forever to respond.</p>\n\n<p>“My girlfriend runs that account,&quot; I explained. &quot;She’ll probably add you when she gets home from school.”</p>\n\n<p>David laughed as he pulled his dreadlocks into a ponytail. “Your girlfriend runs your facebook account?”</p>\n\n<p>“I have the password, she just does all of the day to day bullshit; answering friend requests, Farmville or Candy Crush or whatever.”</p>\n\n<p>“Hey, not my place to judge.”</p>\n\n<p>“I will log on, using my phone, and add you.” I didn’t even want this asshole as a friend but I needed to prove that in an era when a Facebook account seemed to be as important as a passport or driver’s license, my girlfriend didn&#39;t have my balls in a vice.</p>\n\n<p>My Facebook page was filled with comments about how fake my photos looked. Azzy was hot, I looked at least ten years older than her, and certainly not as physically fit. But I was working on that. I ate whatever she cooked; low carb, healthy fat, vegan dishes. On weekends we ran for an hour through the park. During the week, even when I was dead tired, she would pull up a youtube video of a twenty-minute workout we could accomplish before going to bed.</p>\n\n<p>Despite all that, I could see what the haters were saying; Azzy&#39;s skin seemed to glow with an otherworldly radiance: compared to me she looked photo-shopped. I clicked open my gallery, every photo had been taken by Azzy. But one image caught my eye. We were lying in bed. She had pulled down the covers, exposing our upper bodies. For Azzy that was her naked back, with her slender shoulders with just a hint of side boob. But for me, my body left a lot to be desired. But it was better than I thought. It was clear I had lost weight, and even gained some muscle. I touched my own stomach, curious to feel if what I was seeing was accurate.</p>\n\n<p>“Yes, you’ve lost weight,” David snickered. “Just add me, so I can be the first to make fun of you when you start posting bathroom mirror selfies.”</p>\n\n<p>“F--- you, man,” I added him anyway. He was welcome to join the haters who thought Azzy was too beautiful to be with someone like me. I had over a hundred friends, the majority of which I didn’t recognize.</p>\n\n<p>Out of curiosity, I clicked on Azzy&#39;s page. She had just over a thousand. I looked through her photos; selfies, couple goals, work and school friends. She had landed a cashier job at Target where she was loved by all. In the few weeks that she worked there she learned every department even better than most of the managers. Azzy would often tell me her dream was to be a manager, either of Target or her own store. I always felt like she was aiming little low, but if that was what she wanted, I would support her however I could.</p>\n\n<p>After work, I came home to the smell of Azzy&#39;s cauliflower curry bubbling on the stove. She was reading a textbook for her business math class but the moment our eyes locked she sprang up and a leaped into my arms, wrapping her legs around my hips. “I missed you, Johnny.”</p>\n\n<p>With her denim short riding high on her legs, I placed my hand on her naked thigh where I felt a piece of plastic.</p>\n\n<p>“Ow,” she said with a grimace.</p>\n\n<p>“Is that a bandage?” I asked as I carefully put her down.</p>\n\n<p>“I wanted to surprise you,” she pouted. “I got a tattoo.” Azzy turned her hip to allow me a proper view of the small robot. “It&#39;s Johnny-five, from the movie Short Circuit. For you, cause your name is Johnny Villanueva and V is the Roman numeral for five. Do you like it?”</p>\n\n<p>“Of course! Now I just need to get something for you. ”</p>\n\n<p>“You don’t have to do anything for me.” She bit her lip, looking at me with a sensual gaze. “Well, there’s one thing.” She skipped to her backpack and pulled out a manila envelope. “I want you to apply to medical school.”</p>\n\n<p>“How? I’m working close to fifty hours a week.”</p>\n\n<p>“You can quit your job, let me take care of things for a while.”</p>\n\n<p>“I can’t ask you to do that.”</p>\n\n<p>“I want to.” My beautiful girlfriend pulled me close for a kiss. “I want to make all of your dreams come true.”</p>\n\n<p>“We can’t afford it.&quot;</p>\n\n<p>“Will you just fill out the paperwork? You might not even get in.” She handed me the envelope and returned her focus to the stove.</p>\n\n<p>The application was for UCLA. I also noticed there was a check, enough to cover the application fee. The account was Azzy&#39;s. “Eliza Ellie O’Hare?” I read out loud.</p>\n\n<p>“I needed a name for my job application.”</p>\n\n<p>“Oh, ok.”</p>\n\n<p>“It’s not like I was trying to hide my last name.”</p>\n\n<p>“I didn’t say that you were. I was just curious about the account,” I said, motioning at the check.</p>\n\n<p>“Oh, because I offered to take care of things,” she replied with a laugh. “Right. I can be so silly sometimes.” She served up dinner with a side of rice and some naan bread. But instead of sitting down with me she went to her backpack and pulled out her checkbook. She opened it to the back page.</p>\n\n<p>From the corner of my eye, I could make out a massive number. But I looked away. I didn’t care if she had a secret stash of money. It wasn’t any of my business. “I don’t need to see it right now.” I changed the subject to ask her about her day.</p>\n\n<p>As usual, she had many stories of incompetent managers, horrible customers, as well as the occasional guy trying to get her number. She took a few more bites of food before taking out her phone. “But on the bright side, I found a new workout video for us to try: Tantric yoga.”</p>\n\n<p>Needless to say, all thoughts of money were tabled for the night.</p>\n\n<p>We made love until we were covered in sweat, falling asleep from exhaustion.</p>\n\n<p>In the morning she awoke in my arms. “I’m off to work,” she said in her usual perky tone. “Oh, I have a friend coming over. You’re going to love him. He’s a real sweetheart.”</p>\n\n<p>“He?”</p>\n\n<p>“Remy DeSilva,” she replied. “He’s on your friend list. You can message him if you want.”</p>\n\n<p>I picked up my phone as she went to the shower. Sure enough, within my friend list was a Remy Desilva. He was model level attractive, with Italian features and long black hair. In many ways, he looked like Azzy. I wondered if they were somehow related. Remy’s latest update read: &quot;heading to Cali back into my lover&#39;s arms.&quot; He was driving in from Nebraska for a job at … Target.</p>\n\n<p>“He’s working at Target?” I asked Azzy, through the shower.</p>\n\n<p>“Yeah, he just finished his degree, so I told him to apply. He’s going to make a great manager.”</p>\n\n<p>“One of your managers left?” There were roughly six store managers that I knew about from Azzy&#39;s stories; backroom, frontend, grocery, receiving dock, and a few who rotated from the sales floor to the private offices doing “manager stuff.”</p>\n\n<p>“Yup happens all the time. That’s why I’m, almost positive that I can move up into a management position as soon as I complete my business degree.”</p>\n\n<p>“Is he going to be staying here?”</p>\n\n<p>“No, Remy has an apartment downtown.” Azzy stepped out of the shower with her long hair wrapped in a towel. “He’s moving in with Lukas, his boyfriend,” she said with a smirk.</p>\n\n<p>“I wasn’t being jealous.”</p>\n\n<p>“I know baby, I was just playing with you. But seriously, I’m going to help him move his stuff in, during my lunch break and you’ll meet him and Lucas tonight at dinner.” She gave me a kiss on the cheek. “The shower’s all yours.”</p>\n\n<p>I showered, got dressed and went to work. When I arrived, I quickly ate a Powerbar in the breakroom, in lieu of breakfast.</p>\n\n<p>David was by the coffee machine. “You will not believe what’s happening in the ER.”</p>\n\n<p>“What?”</p>\n\n<p>“The cops found a body outside the shopping center; no arms no legs face burned completely off. But the creepy thing is- she’s still alive!”</p>\n\n<p>&quot;I need to start my shift,” I groaned, stuffing the half-eaten bar into my pocket.</p>\n\n<p>“It will just take a second. We can’t even get that close with all the police.”</p>\n\n<p>I reluctantly followed him. Sure enough, there was a body on a bed, with tubes sticking out of it. Exactly the way David described. From what skin I could see, the woman was Hispanic or perhaps African American. “Ok, I saw it, now I’m leaving.”</p>\n\n<p>David followed me to the elevator. “So strange right? I wonder how they’re going to identify her; no hands, feet, not even eyes.”</p>\n\n<p>“DNA can be taken from any part of the body.”</p>\n\n<p>“Yeah, if they have something to match the DNA with.”</p>\n\n<p>“You watch too much television, man.” I got off on my floor. I checked out my phone, it was still on Remy’s Facebook page. “In a relationship with- Lucas Ness.” Lucas Ness? That didn’t sound like a real name. I clicked the link. Lucas was blonde, with glasses and a long ponytail: a total hipster. He worked at a marketing firm that seemed to specialize in video games. ‘Lucas Ness,’ I typed the name into a search bar, it was the name of two famous Nintendo characters. Was it a fake name? It could be just a coincidence. I tried to force the thought from my mind. I needed to focus on work and checking on my sister Olivia.</p>\n\n<p>Ever since Azzy used her powers to restore my sister&#39;s sight, Olivia was on a strong path to improvement. She had been fortunate that Azzy&#39;s father had only taken one arm and one leg, so many of his other victims were not as lucky.</p>\n\n<p>I checked on my sister during my lunch break.</p>\n\n<p>“Johnny!” she said pressing on her throat to activate her robotic voice box.</p>\n\n<p>I smiled, but the sound was a further reminder that the evil man had also taken her tongue. &quot;Hi, Liv.&quot;</p>\n\n<p>It was Azzy, herself, who found a doctor willing to do Olivia’s throat surgery. She even paid for it. During her recovery, Azzy encouraged Liv to read more and learn to type. With her encouragement, Liv started taking online classes. “Where’s Azzy?” she asked.</p>\n\n<p>“Helping a friend move,” I said, looking around the room. “Speaking which when do you think you’ll move to the halfway house?”</p>\n\n<p>“I don’t know,” she said looking around at her walls covered in posters and drawings. “I’m kind of used to having my own space.”</p>\n\n<p>“The sooner you leave the hospital the sooner you can visit me and Azzy.” That made her smile.</p>\n\n<p>My day went by quickly and before I knew it, I was headed home. At around six in the evening, I arrived at the apartment to the sound of loud, boisterous, laughter. I could smell Eliza’s cooking; deep-fried Cajun spice tofu. But as I opened the door a different smell overtook me; lots and lots of wine.</p>\n\n<p>“Johnny!” Azzy ran into my arms, narrowing spilling a coffee cup filled with red wine.</p>\n\n<p>“You drink?” I asked.</p>\n\n<p>“I drink to celebrate!” She motioned to a man with long black hair sitting on the sofa. “Johnny this is Remy.”</p>\n\n<p>Remy reached his hand out to me. “How you doing, man.” His voice was silky smooth with what I could describe as a surfer accent.</p>\n\n<p>“I’m good,” I said, shaking his hand. “I saw on Facebook, you’re from Nebraska? ”</p>\n\n<p>“I went to school in Lincoln, Nebraska, but I was born and raised in Honolulu.”</p>\n\n<p>A man with a long blond braid stood up. “I’m Lucas.”</p>\n\n<p>“Lucas Ness- cool name.”</p>\n\n<p>“Pardon?”</p>\n\n<p>Remy laughed as he took a swig of wine straight from an unmarked bottle. “You actually get the reference!”</p>\n\n<p>Lukas took a sip of wine from a tall juice glass. “The name was Remy’s idea.”</p>\n\n<p>“Name another famous Lucas!” Remy said loudly. It was clear he was drunk. “Lucas and Ness from Earthbound!”</p>\n\n<p>Lucas sighed. “I’m really sorry about him, he needs to switch to water.”</p>\n\n<p>“Nah man, tonight is a celebration, the royals reunited!&quot; He held his hand up to Azzy for a high-five. &quot;Here Johnny, try some of this. It’s all the way from Nebraska.”</p>\n\n<p>I took the bottle from Remy and poured myself a glass. The wine was darker and more opaque then I expected. When I took a sip everyone stared. It didn’t taste like wine, it tasted like blood. And not fresh blood, like when you cut your lip, no this was thick and rancid. As I forced myself to swallow, the flavor changed to a strangely sweet almost soda-like aftertaste.</p>\n\n<p>“It’s beet wine,” Azzy said, with a fake confidence.</p>\n\n<p>By her tone, I could tell she didn&#39;t want to lie to me, but she had no choice.</p>\n\n<p>“Yeah,” Remy added with a chuckle. “Totally.” He stuck his ring finger in his mouth, sucking on the tip as if biting his nail. Blood dripped down his hand. Was he drinking his own blood?</p>\n\n<p>I maintained my composure but stuck to ginger ale for the remainder of the evening.</p>\n\n<p>The next day, as I arrived at work, Lucas was standing by the emergency room entrance smoking a cigarette. “Lucas? Hey, man what’s up”</p>\n\n<p>“We need to talk,&quot; Lucas said, as he motioned with his hand. &quot;There&#39;s something I need to show you.”</p>\n\n<p>I followed him across the street to the parking garage. As we walked he spoke. “Eliza told me about her nickname: Azzy. You dreamt that up before she even found you in California, correct?&quot;</p>\n\n<p>He has a point. Somehow Azzy knew about the nickname without me even telling her. “What are you saying?”</p>\n\n<p>“It took her six years to find you but she wanted you. She chose you, the same way Remy chose me. Lucas Ness is the name that Remy gave me when he started to sculpt my new identity.”</p>\n\n<p>“Who were you before?” I asked.</p>\n\n<p>“Sometimes I can’t even remember.” Lucas stopped at spot number 666. He placed his hand on the concrete wall. Suddenly a wooden door appeared. “I think my name was Lucas Renolds maybe Tuner. I was working at Burger King, to put myself through college. I had dreams of becoming a game designer, but no real talent or industry connections.” He opened the door to reveal a staircase. “One night, after a late shift, I saw a homeless guy. He claimed to be sick and hadn’t eaten in days. I would have left him alone but he looked to be my age.&quot;</p>\n\n<p>The smell of rotten meat invaded my senses, as we descended a staircase.</p>\n\n<p>&quot;It was the end of the month, I was living on instant noodles and sink water. I told him as much; I could give him a place to stay, some food and whatever medicine I had my cabinets. I guess part of me was just lonely.&quot;</p>\n\n<p>&quot;You didn&#39;t have roommates?&quot; I asked. &quot;I mean, being a college student and all.&quot;</p>\n\n<p>&quot;My rundown studio apartment was actually cheaper than living in the dorms. That&#39;s California for you.&quot;</p>\n\n<p>The darkness was broken by a few Christmas lights embedded into the walls, enough for us to see where we were going. &quot;You met Remy in California?&quot;</p>\n\n<p>&quot;Yeah, he laid claim to me. He said he wanted to marry me.&quot; Lucas&#39;s voice was quivering.</p>\n\n<p>&quot;So, what was he doing in Nebraska?&quot; It made no sense. If Remy was in love he would have moved heaven and earth to stay in California.</p>\n\n<p>Lucas shrugged. &quot;He said he had work to do in Nebraska. I took him at his word.&quot;</p>\n\n<p>Stepping in front of Lucas, I could see the sparkle of tears in his eyes. &quot;I&#39;m sorry, man.&quot;</p>\n\n<p>&quot;Remy has the sweetest, most beautiful, heart. You&#39;ll just have to take my word for it.&quot; Lucas said the last part with a chuckle as he let the remainder of his cigarette burn out. &quot;It takes a lot to love someone like Remy or Azzy.&quot;</p>\n\n<p>I scoffed. Azzy was nothing like Remy.</p>\n\n<p>&quot;See for yourself.&quot;</p>\n\n<p>At the bottom of the stairs, was a giant caterpillar made of human limbs. The same as the creature I had rescued my sister from back in Wisconsin. Except it wasn&#39;t. It had been six years since I saw that caterpillar but I was positive this was a different collection of limbs.</p>\n\n<p>Lucas placed his hand on my shoulder. “I’m one of the chosen. And so are you.”</p>\n\n<p>“How many are there?”</p>\n\n<p>“Of us? Millions.”</p>\n\n<p>“I already grasp that concept.&quot; Anyone who was abnormally beautiful, from celebrities to athleates, possibly even certian politicians: they were all inhuman creatures. “How many caterpillars are there?”</p>\n\n<p>“Hundreds,&quot; Lucas said as he approached the massive creature. &quot;This one belongs to Remy’s clan.”</p>\n\n<p>Suddenly I could hear the sound of someone rolling a lollipop in their mouth. Remy grabbed Lucas by the waist, in a flirtatious manner. He wore a clown mask but Remy&#39;s body language was unmistakable.</p>\n\n<p>I watched as he pulled a knife, pressing it to his boyfriend’s neck. “Nice work,” Remy whispered in Lucas’s ear. His dark eyes locked with mine.</p>\n\n<p>I could tell he was putting on a show, in an attempt to intimidate me. “Let me guess, you want to talk?”</p>\n\n<p>“No,” Remy said, as he pushed the candy to the side of his mouth. “But she does.”</p>\n\n<p>Azzy appeared, her eyes focused down at her feet. “Hi Johnny.”</p>\n\n<p>I was trying not to laugh at the absurdity of the situation. Was she afraid of me? I opened my arms for a hug, offering up a calm smile. “Hey, Azzy.”</p>\n\n<p>Azzy ran to me. “I wanted to tell you, I really did.”</p>\n\n<p>Remy put away the knife, presumably to take hold of his lollipop as he took off his mask. “You can’t trust him, Sis. He&#39;s a self-righteous prick just like my ex!”</p>\n\n<p>Azzy shook her head. “You’re just like your father!”</p>\n\n<p>“Is Remy your brother?” I asked.</p>\n\n<p>“No. He’s my friend.&quot; Azzy rested her head on my shoulder. &quot;At least I thought he was. Like me, he’s a human half-breed who killed his father to take control of his clan.”</p>\n\n<p>I turned to look at Remy. Our eyes locked, I knew he was waiting for a reaction. But he wasn&#39;t going to get one.</p>\n\n<p>“Tell him why I’m here,” Remy said with a sinister laugh. “Even under your Azzy&#39;s rule, her clan&#39;s caterpillar grows!”</p>\n\n<p>My mind flashed back to the woman with no limbs. I knew what Azzy had done, but worse: I knew what she was capable of doing. I held her close rocking her in my arms. “I’ll quit my job for you, I’ll go to medical school for you. I love you Azzy.”</p>\n\n<p>Remy threw the knife at Azzy who caught it mid-air. Her hands trembled as she looked at me with tear-filled eyes. “When Remy gave Lucas his clan marking, he did so while they made love.”</p>\n\n<p>I nodded, unsure of what to say. “There was a woman in the ER with no arms and legs. The police found her near the shopping center. Was she the manager who was cruel to you?”</p>\n\n<p>&quot;One of them.&quot; Azzy nodded. “B-but I let her live.”</p>\n\n<p>“Yeah,” Remy muttered. “I still don’t know why you did that.”</p>\n\n<p>“And I don’t know why I chose you to take her job- oh wait! Because YOU wrote to me, asking me to find a way to get you to California! I thought you were my friend!”</p>\n\n<p>“I am your friend, little sister- that’s why I know you can’t trust this man!”</p>\n\n<p>&quot;He&#39;s nothing like your ex! Jordan was a Christian missionary.&quot;</p>\n\n<p>&quot;And this guy is a nurse.&quot; Remy shook his head. &quot;I gave Jordan everything, but when it came down to it to chose his faith over our love.&quot;</p>\n\n<p>&quot;You tracked him down to Nebraska,&quot; I said in a quivering breath. &quot;You had Lucas! You found love, but you chose to exact revenge on your ex!&quot;</p>\n\n<p>Remy rolled his eyes. &quot;You see what I mean, little sister? Johnny V, your knight in shining armor, thinks he&#39;s better than us.&quot;</p>\n\n<p>I closed my eyes and I could see the ER woman’s bandaged face. My mind started to picture what Remy might have done to Jordan. It was sick. Every part of me wanted to prove Remy right; I was too moral, too weak. But at that moment I knew, I would rather die than lose Azzy. I gripped the knife, plunging it into my stomach.</p>\n\n<p>As the world went dark I could see a vision, of Target. I was standing behind a cash register. I looked down at my hands, they were Azzy’s hands. I was looking through her eyes. She was serving customer after customer with her usual energy. I could feel her happiness, her light. And then I felt anger.</p>\n\n<p>Out of the corner of my eye, I could see the dark-skinned woman, the manager on duty. She was going from cashier to cashier like a teacher trying to catch her students cheating. When she got to Azzy the manager instructed her to switch with the bagger. “I need to speak to you in private.” According to the name tag, the manager’s name was Jasmine. The beautiful Hispanic woman was tall, with an imposing glare. My eyes drifted to her hands. On her right finger was the letter J. She wore several rings over the tattoo but through Azzy’s eyes, I knew what it was- a clan marking.</p>\n\n<p>“Yes,” Azzy said as she stepped to the side.</p>\n\n<p>“What’s happening with your in-store credit card numbers?”</p>\n\n<p>“I have great numbers. My average is six signups a day, according to the chart in the break room I’m fourth in the entire store.”</p>\n\n<p>“We all need to strive to do our best.”</p>\n\n<p>“What’s that supposed to mean?”</p>\n\n<p>“Excuse me?”</p>\n\n<p>“You go around saying that as if we’re not all working our asses off!”</p>\n\n<p>“Our store’s numbers have been down, we have quotas to make. So I need you to educate every customer about the in-store credit card.”</p>\n\n<p>“I ask the people who I think might be interested.”</p>\n\n<p>“I need you to be asking everyone.”</p>\n\n<p>“Even the high school kids buying a bag of chips: would you like to put your Doritos on a payment plan?”</p>\n\n<p>“My office- in thirty minutes, you’re getting a write-up.”</p>\n\n<p>Azzy waited a moment, then followed Jasmine. Somehow Azzy knew she was going on a smoke break before going straight to the office. As Azzy walked her body, our body, rippled with energy. The lenses of the security cameras blew out, display televisions distorted. But no one seemed to notice. Azzy’s body was bathed in a heavenly light as we followed Jasmine out the back, to the alleyway. “Only ugly people smoke.”</p>\n\n<p>Jasmine chuckled and shook her head. “I’m getting security. Clear out your locker, you’ll receive your last paycheck in the mail.”</p>\n\n<p>“I don’t think so.” Azzy grabbed her by the neck, causing the manager to fall to her knees. “I know what you are, and you sure as heck know what I am.” Azzy’s blinked her glowing eyes. She made sure to squeeze the woman&#39;s neck hard, to muffle out any attempt at a scream.</p>\n\n<p>Jasmine, choking on blood whispered, “What are you going to do, add me to your collection?”</p>\n\n<p>“No, I don’t want you. But by the time I’m done, no one else will either.” She inhaled. In one monstrous breath, she sucked flesh from bone with the force of a sandstorm. To me, it felt like an eternity, but in reality, it only took Azzy a few seconds. The blood on her lips was no more than a trickle, like the remains of a cherry snow cone. She wiped her mouth with her hand.</p>\n\n<p>Or I did.</p>\n\n<p>Azzy’s hand was trembling. It was as if looking at the blood was not part of what actually happened that day.</p>\n\n<p>My eyes shot open. I was in a dark room, lying on a bare mattress. “Azzy? Are you there?” I knew I hadn&#39;t gone blind because I could still see figures, shadows. I could feel a hand touching me, but it wasn’t my girlfriend.</p>\n\n<p>“Azzy, I think your boy’s awake,” Remy said in his usual laugh.</p>\n\n<p>I could feel Remy’s hand on my leg. I flinched, suddenly aware of my body: I was naked. “Azzy!” I shouted. “Please, Azzy where are you!”</p>\n\n<p>“Remy!” Azzy pulled a string, causing a chain of Christmas lights to illuminate the room. “Stop messing with my boyfriend!”</p>\n\n<p>Azzy had wings. At first, they appeared black, sharp, leathery. But as she stepped closer, into the light, I could see her wings were made of the most beautiful green leaves, like branches growing from her back.</p>\n\n<p>I reached out to touch her, as I did her leaves caressed my fingers. “What are you?”</p>\n\n<p>“An angel, a demon, a fairy- there’s no real word for what we are,” she replied.</p>\n\n<p>I turned to look at Remy. His wings were made of appeared to be palm leaves. One thin leaf bent forward into his mouth. “Sugarcane,” he said with a smirk.</p>\n\n<p>“That explains a lot.” I chuckled.</p>\n\n<p>Remy rolled his eyes.</p>\n\n<p>Lucas sat by his side. “You do behave like a hyperactive child, my love.” He had no wings, only a series of tribal tattoos that covered his naked chest and shoulders. He was holding an old rusted mirror. “Sorry, this was all I could find down here. You can always wait until we come back to our world.”</p>\n\n<p>“Our world?” I asked.</p>\n\n<p>“Ours, yours, whatever, man.” Lucas laid himself in Remy’s arms.</p>\n\n<p>Remy’s sugarcane wings wrapped around both their bodies. He kissed Lucas’s ear. “Give him the mirror.”</p>\n\n<p>I reached out my hand and grabbed the mirror. My eyes went straight for the new tattoos that covered my chest in an elaborate forest pattern. The landscape reminded me of that old show ‘Joy of painting,’ except this image was entirely made up of black ink lines. “Azzy, did you do this?”</p>\n\n<p>“Are you mad?” she asked, her voice trembling.</p>\n\n<p>I touched the lines. Not only did they not hurt, the way I knew a fresh tattoo should but my body felt amazing. I felt strong, energetic, like someone who actually had time to make it to the gym. I touched my stomach, I could feel actual six-pack abs. “I like it, it’s beautiful. I never knew you could draw like this.” Then I moved the mirror to my face. The changes were slight but noticeable, complementing with my newly muscular body. I was beautiful, like Azzy and Remy. But like, Lucas, I would forever be her pet: her property.</p>\n\n<p>“Would that really be so bad?” Azzy asked.</p>\n\n<p>“What?”</p>\n\n<p>“To be mine?” She sat on my lap facing me. “Yes, I can read your thoughts.” Her wings started to engulf me. Holding me close I could feel her warmth. “There are bad people in this world. My father’s generation brought fear, he killed for fun. But my generation, we can bring balance.”</p>\n\n<p>My face was pressed against her breasts. I could feel her heartbeat, soft and calming. “My queen.&quot;</p>\n\n<p>Azzy’s wings opened. &quot;Yes, my love?&quot; She lifted my face with her gentle hands.</p>\n\n<p>“Will you marry me?”</p>\n\n<p>Azzy nodded, her eyes filled with happiness and light.</p>\n\n<p>I let Azzy hold me. I needed her to believe everything would be ok.</p>\n</div>\n","author":"dourdan"}