{"rank":"865","title":"Please Help. Nobody Recognizes Me.","id":"8m35g5","url":"/r/nosleep/comments/8m35g5/please_help_nobody_recognizes_me/","time":"1527266213000","body":"<div class=\"md\"><p>This all started at work. On a regular Thursday. </p>\n\n<p>I walked into my building, took the elevator to the fifth floor, and greeted the sassy security lady. That was the same as any other day. I expected to hear her goofy exploits from the night before. She was middle aged, but last Monday she had gotten drunk and stayed up late doing karaoke with her friends. She loved telling me these things, for some reason, and I loved listening.</p>\n\n<p>But the chipper security woman, as she described herself, just stopped and stared at me. It was the type of look she would reserve for a strange person on the premises. I flashed her a nervous smile and swiped my badge. She gestured towards her notebook, and looked like she was about ready to ask me to sign in. She seemed shocked when the door opened in response to my scan.</p>\n\n<p><em>Weird</em>. </p>\n\n<p>My office was that typical cube monkey design. Most of my day was spent behind a computer, coding and listening to coworkers argue about deployments over the phone. They were all over the world - Boston, Buenos Aires, Chennai. So though we interacted on a daily basis, we never actually met in person.</p>\n\n<p>Except for my boss. </p>\n\n<p>On that day, he decided to drop by my cube around eleven. </p>\n\n<p>My desk faced the wall, so whenever anybody snuck up like that it was always a bit of a shock. I think he liked catching me off guard. To see if I was actually working, or just reading the news and stories online to kill time. So naturally, when his jolly greeting poked it&#39;s way through my headphones and I saw the his overstuffed belly peep into my periphals, I closed all my tabs and turned around in a nervous rush.</p>\n\n<p>He was puzzled. He stared at me for a full minute after saying <em>Hello.</em> I said hello right back, and tried to ask him about one of our upcoming projects as an attempt at breaking the silence.</p>\n\n<p><em>&quot;We have assigned seating here,&quot;</em> was all he said. </p>\n\n<p>*&quot;I know Fran, this is my desk,&quot; I replied dumbly. My voice sounded hoarser than I remembered.</p>\n\n<p>His face wrinkled up. He wasn&#39;t expecting me to know his name.</p>\n\n<p><em>&quot;No, this is Matt&#39;s desk. He works for me, but he must be late or something. The beach traffic can be really bad this time of year, you know how it is. Anyway, this is assigned seating so I need you to get up and move back into the Bullpen until he gets back.</em></p>\n\n<p>And with that, he walked away, leaving me dumbfounded. He had stared directly at my face, at my eyes, and still had no idea who I was. This wasn&#39;t a diet paying off, or all of my hard work at the gym finally coming to pass. There was something wrong, really wrong.</p>\n\n<p>My phone rang. It was Fran again. I let it ring, waiting for the inevitable voicemail. When my cell buzzed happily in accordance, I dialed my mailbox and listened.</p>\n\n<p><em>&quot;Matt... when are you getting in today? Just thought you should know there&#39;s some guy sitting in your desk.&quot;</em></p>\n\n<p>I ran to the bathroom. People I had known as acquaintances for years gave me quizzical glances, looking at one another for reassurance before shrugging their shoulders and moving on with their day. I prayed the bathroom would be empty, and it was. After getting in, I slammed the door shut behind me and got up to the mirror for a long hard look at myself.</p>\n\n<p>The face in the mirror was not mine. That was definite. I was still a man dressed in a tie and business slacks, and for that I was slightly thankful. But I was no more than a svelte one hundred and fifty pounds, a massive difference from my hefty two hundred. I was shorter, and my hair was black, and curly, and came down almost to my shoulders. My clean-shaven face was abandoned for a full beard that met overgrown sideburns like weeds on the side of my face. My eyes were baby blue, a drastic difference from the brown. Even the familiar freckles that had always lined the shadows of my eyes pox were missing. My skin was cool, clean, and unblemished. Attractive, even.</p>\n\n<p>I pawed at that face like an idiot, staring at myself like there was an alien in the mirror. A guy came into the bathroom, pissed and left within that time. He gave me a nervous stare as he washed his hands next to me, and left. </p>\n\n<p><em>Great</em>. </p>\n\n<p>I started to scratch. I settled on the thought that my skin was like a tuxedo. My true skin had to be waiting underneath this weird mask and I just needed to pull it off, right?</p>\n\n<p>So I scratched. I scratched so hard that my skin seperated and I thought, maybe, for a second maybe that was what happened. I got drunk and stuck on this really realistic mask. Had to be. But then blood spurted out of my neck and it really started to fucking hurt, I gave up and started to panic.</p>\n\n<p>What the fuck do you do in this situation? There was no handbook. The guy in the bathroom was suspicious, and if he told the security lady they would look into my scan records and see that my face did not match my picture and the guy they knew. I had to get out of there.</p>\n\n<p>I kept my head down leaving the bathroom, and out the door to the lobby. The guy who was in there with me had not been to visit the security lady yet, but it had to be a matter of time. I kept my back to her while waiting for the elevator, and thanked God when one arrived just after I hit the button. I hopped in, went down to the garage and hopped in my car.</p>\n\n<p>My keys still worked. My phone was still mine. But the bright blue eyes in the rear-view were <em>definitely</em> not my fucking eyes. </p>\n\n<p>I high-tailed it out of the parking garage, same as I had done a thousand times before. When I got to the gate there was another badge scan, but this time it beeped an unhappy sound and the gate remained close. The gate guard stood up, for the first time in years it seemed, and started to approach me with his hand on his belt. </p>\n\n<p>I hit the gas.</p>\n\n<p>The &#39;gate&#39; in question was nothing more than a wooden plank.. It buckled easily from the weight of my truck and fell uselessly to the side. I cut around the corner and headed for the Parkway exit, minding the security guard chasing me from the sidewalk while yelling into his walkie.</p>\n\n<p>The good thing about my office was that it was next to a major road. Once I was on that parkway, my truck blended into a thousand other beach commuters hoping to hit the shore before Memorial Day Weekend. I jammed my cell phone into it&#39;s charger and called the only person I thought could help. My wife, Emily.</p>\n\n<p>Em hated talking on my phone, so it was natural that there were a few long-winded rings before she finally picked up. She was in IT as well, and worked from home that day. So naturally, the first few words out of my wife&#39;s mouth were:</p>\n\n<p><em>&quot;Medium hazelnut, light and sweet, hot,&quot;</em> she chirped.</p>\n\n<p>I struggled for the right words while weaving through traffic. How do you make someone else&#39;s voice sound like your own? I wanted to tell her the truth, but how could she even know it was me?</p>\n\n<p>&quot;Em, I&#39;m coming home. There&#39;s something wrong. I don&#39;t recognize myself. Nobody recognizes me. I don&#39;t know what to do. I need your help.&quot;</p>\n\n<p>She paused.</p>\n\n<p><em>&quot;I can&#39;t hear you that well. Nobody recognizes you because you got old, Matt. It happens. Did you get the coffee order? Only get it if you&#39;re going anyway. I gotta go, though, getting another call. Bye bye love you.&quot;</em></p>\n\n<p>She hung up. Fuck it, didn&#39;t matter, I thought. It was only twenty minutes from the office to my house. I would see her, explain everything, tell her something only I would know and everything would be alright.</p>\n\n<p>But it wasn&#39;t. I was too panicked. When my car pulled into the driveway, Em ran outside to see me. I thought she was excited. Sometimes we did not catch each other in the morning and it had been one of those days. </p>\n\n<p>As I popped out of the car, she started to say, <em>&quot;Your office called,&quot;</em> before her voice trailed off.</p>\n\n<p>I hopped out and immediately started explaining, stumbling over my voice and my words and the feet like didn&#39;t feel like mine.</p>\n\n<p>&quot;Em, Em, I woke up like this. I don&#39;t know what happened. I don&#39;t look like myself, but it&#39;s me Em, it&#39;s me. Please help me, please.&quot;</p>\n\n<p>She screamed. I probably should have seen that coming. Em screamed so loud she brought the neighbors out of their houses. There was former military in one house. An old cop in another. With my shit luck, they both happened to be home.</p>\n\n<p>I ran up to Emily and tried to talk to her. To tell her things only her and I would know. The time at her Aunt&#39;s house. What the cats did in the basement. Something, anything, that would stop her from fucking screaming in my face.</p>\n\n<p>The last memory I have of the day is the blare of gunfire and falling to the floor.</p>\n\n<hr/>\n\n<p>I woke up in my bed this morning. My feet feel like my own. My hands look like my own. Emily is not home, but we miss each other sometimes in the morning. </p>\n\n<p>But my dog is growling, and my face is scratchy. My shirt is over-sized and it&#39;s covered in sweat. The mirror seems a mile away, but is really just above the haphazard bathroom display. </p>\n\n<p>I don&#39;t want to find out whether I am really me today. </p>\n</div>\n","author":"FirstBreath1"}