{"rank":"46","title":"An Imaginary Friend. The Truth Comes Out.","id":"8m3640","url":"/r/nosleep/comments/8m3640/an_imaginary_friend_the_truth_comes_out/","time":"1527266341000","body":"<div class=\"md\"><p>When I was just six or seven, I used to have lots of imaginary friends instead of actual friends. My mom and I lived at grandpa&#39;s house and barn after the divorce, deciding that the city life wasn&#39;t perfect for us. I didn&#39;t know what divorce even mean. I used to gallop with the horses or roll in the mud with the pigs, but my favorite game is to play with my imaginary friends.</p>\n\n<p>I saw four of them. A tall man made of stone with a funny head crown that Aztecs wear. His face was cracked and a golden cape that covered his body like a blanket. His name is The Stone King. I liked his ruby eyes when they shined over the sunlight.</p>\n\n<p>The second was a tall being with a large light-purple jelly bean for a head. He had dark eyes and a top hat over his jellybean head. He wore a checkered shirt with striped sleeves and blue overalls. His arms and legs are tall and slender. He called himself, &quot;Sabast Jelly&quot; or &quot;Mr. Jelly.&quot;</p>\n\n<p>The third was a woman with long brown hair and light sandy skin that matched my mom&#39;s. She wore a pretty primrose dress with a purple heart glittering on the chest. She wore red shades that didn&#39;t show her eyes. Her name is Eliza.</p>\n\n<p>And the fourth was my best friend. He&#39;s tall with a purple upside-down tear-drop head. His left eye in his view was a red button and his right eye was a red-stitched X. His mouth was stitched like those voodoo dolls where cartoon witches used on people. He had only a tentacle made of purple and red fabric with no suction cups as a right arm. His legs looked like elephant feet and it too was stitched with purple and red fabrics together. His torso was too. His neck and joints were red coils made of fabric. His name was Chales.</p>\n\n<p>One day, what I didn&#39;t know of, was a near-death experience.</p>\n\n<p>I was at the porch while my mom was picking berries far at the field behind barn. There wasn&#39;t anyone except for me and my imaginary friends. Eliza and Sabast were chatting over the berry bushes and Stone King was talking to Chales from underneath the apple trees. I remembered seeing a man  who gave me a candy apple. I remembered hearing him say, &quot;I have more at my house. You wanna come?&quot;</p>\n\n<p>I didn&#39;t know anything else except him giving me a cowboy hat and a jacket and carrying me to his house farther and farther from my home. His house was small, with only two windows at the front. He put me down and went to get his keys. I was waiting, and waiting, until I heard a shout from Chales. &quot;Get off from her!&quot; At first, I thought he&#39;s friends with my imaginary friends because he turned around like I did. </p>\n\n<p>I didn&#39;t see much when Stone King and Sabast quickly covered me and lifted me up on Stone King&#39;s arms. The last thing I remembered was Stone King dropping at the side of the road when I heard cars pulling up. Red and blue lights flashed and Stone King was gone. A man in a blue suit and my mom came out at one car and I&#39;d remembered hugging mom so tight. I told her about the man and my imaginary friends. When we were back at my home, I&#39;d remembered hearing them that they found a recent dead body with broken limbs, a heart pulled out, a head smashed with a rock, and his eyes were missing. I didn&#39;t know much. Until now.</p>\n\n<p>I am now thirty-four and had a ten-year old named Izzy. Izzy told me that she was at the park with her dad and after telling me the slides and monkey bars.. She told me this.</p>\n\n<p>&quot;Mommy, I had a friend named Chales. He said he worked at a place called the &quot;Orphanage&quot;. He said the Orphanage was a place where kids go &quot;aftertimes&quot;. He said you were nearly one of those kids when that man tried to take you back then. He said he saved you because no one knew the man was there. Mommy, do you know what &quot;aftertime&quot; means?&quot;</p>\n\n<p>That moment. I froze. That&#39;s why they didn&#39;t tell me everything when I asked, &quot;What&#39;s going on?&quot;</p>\n\n<p>They killed that man..</p>\n\n<p>They were trying to protect me...</p>\n\n<p>But why didn&#39;t my mom or the cops see them then?</p>\n\n<p>How did that man see them?</p>\n</div>\n","author":"G00s3bumps"}