{"rank":"10","title":"Uber Weirdos Work @ A.M.","id":"8m3bw2","url":"/r/nosleep/comments/8m3bw2/uber_weirdos_work_am/","time":"1527267638000","body":"<div class=\"md\"><p>My morning was easy. I got dressed, grabbed my bags and walked out the door. My Uber driver moved the moment I buckled my belt. The car departed my house 5:22 am. Work was in the city, and the drive can be weary. Weary for weak travelers like myself. I’d always ask if I can drink my coffee in the car. If they said yes my inner child would break loose. If no then I’d sit in silence and bear myself not to fall asleep.</p>\n\n<p>The drive can be long. If unaware of this fact, my Uber driver pulled into a petrol station. He said he’d be a second. I waited in the backseat and sipped my mind-buzzing nutrients. I couldn’t complain, a few minutes to work can’t be bad. The reason I traveled to work with Uber was that my boyfriend got into a car accident on his way home from a party. I’ve used Uber a few times now and I’ve enjoyed the service. I continued to sit in the backseat and my eyes watched the clock on the dashboard.</p>\n\n<p>The man said a few minutes. Ten minutes had passed. I wouldn’t know if this was normal. Were Uber drivers allowed to attend their personal lives while on the job? From my seat, I couldn’t see a lot through the windows. I saw a teenager, he looked around his store with his chin held high; we even locked eyes once or twice. I looked away-and-I swear I heard a loud crackle like a burst of popcorn in a microwave. The time chocked me and finally, the man returned to the driver seat. The engine started and we exited the station.</p>\n\n<p>“Could we please go straight to work?” I asked. I sat directly behind his seat. The driver’s thick glove grabbed the rear-view mirror and twisted it until I could see tinted sunglasses and a mustache. I whisper a thank-you and I leaned back into my seat.</p>\n\n<p>I remember the first question he asked. I sensed maybe under those glasses, he couldn’t keep his eyes off me. I’d feel vulnerable to look every so often, only to forget that he might actually be looking at the road. Do people normally sit in the front seat? I found the ride to be relaxing in the backseat as I hate conversations before I’ve properly woken up. The man’s question came to a shock when I heard it.</p>\n\n<p>“Have you got anybody at home?”</p>\n\n<p>From a quick glance, I spotted his lips drop. Only his lips moved. I sipped my coffee and thought of a reply, “Yes. My boyfriend.”</p>\n\n<p>“Oh, you have a boyfriend?”</p>\n\n<p>Eyebrows leaped up from behind the glasses. The driver didn’t move, just the lips again. I took the opportunity to look out the window while I replied a ‘yeah’ under my breath. Overall I begged to end the conversation. I really do hate interacting with people before I’ve properly woken up. Or maybe it wasn’t that. Outside my window, a glowing light moved from around a corner. Another petrol station.</p>\n\n<p>“I’m going to be a few seconds.”</p>\n\n<p>“Wait!” I called but the door shut.</p>\n\n<p>The coffee cup sat empty over my lap. I watched outside the window wide-eyed like an owl. Unbelievable. How unfortunate would it be if my boss cut back my hours because I was late? I threatened in my head I’d give the Uber driver a 1-star review. Unbelievable, I repeated only this time out loud. The time was awfully close to 6:00 am. I started work in 10 – 15 minutes and the thirst to get moving grew stronger.</p>\n\n<p>I wanted to take a look at the front seat. I leaned forward. I looked around and saw a pair of gloves buried in the back of his seat. There was a wallet beside the gearstick and some scrunched up tissue paper. There was also a license on the front dashboard. The Uber driver was inside the store and so I grabbed the license and checked his photo. A lifeless picture of a man.</p>\n\n<p>Inside the store was my Uber driver. The man on the photo must’ve stared at the camera like a wild man entering a city. Rectangle-squinted eyes with thick hazel eyebrows. I didn’t notice the tattoo, either. Over his nose he had, I think, a spider web. I read his details but I can only remember – Dale Henderson? I threw it back on the dashboard as I saw the cashier begin to serve the Uber driver.</p>\n\n<p>The driver flipped on his glasses as he walked out the store. His head aimed towards the window and he watched. He shifted into a comfortable position on his seat and closed the door. He pulled over his belt in one swift pull and buckled himself. Then the keys were shoved into the ignition and the engine started. We reversed and pulled out onto the road. Once more we were on the move and his face sat still in the mirror.</p>\n\n<p>“Your boyfriend. Might his name be Gregory?”</p>\n\n<p>“Uh – Yeah. How – you must know him?”</p>\n\n<p>“Yeah, funny. I went to school with him. Was he a football fan by chance?”</p>\n\n<p>The car hadn’t felt anymore silent, until now. “He’s a baby for football.”</p>\n\n<p>“I’m a diehard fan myself.” We pulled into another petrol station and he added, “Look, I’m sorry about this dear. I’ll be another few more minutes.”</p>\n\n<p>My eyes ignored the fast movement of the Uber driver. He left the car and locked the vehicle on his way. The store doors opened in swift silence. He removed his glasses, stepped inside and vanished from my sight. A phone sat against the front window near the driver seat and it flashed. It asked to swipe. We’ve arrived, arrived at our destination? I opened my phone and it asked to rate my ride. The man’s profile picture, empty, a blank image.</p>\n\n<p>“Back,” A deep voice roared after a door swung open. “You alright?”</p>\n\n<p>I was taken back and I stumbled to reply. He didn’t mind. He started the car, threw on his belt and reversed. Another dozen minutes on the road and this time we didn’t stop. We drove onwards and I made it work in peace. When he expected me to pay me, I instead grabbed my bags and walked away from the car. He swore and yelled as I marched away. My pace picked up speed. I wanted to escape as fast as possible.</p>\n\n<p>Work was long, I remember the hours passing by, and the seconds were like snails in a race. To top the menacing day I felt ill. A runny nose, sore throat and the desire to return to bed. When I could pack up and leave, I reached for my phone. Uber-Hm? Uber. No, not after the incident earlier that morning. It was getting dark and I couldn’t imagine running into that man again. His creepy presence over the steering wheel and the odd stops around town. No, I’d best call my boyfriend for a lift.</p>\n\n<p>If Gregory didn’t answer I’d maybe get a lift with a best friend. I called Gregory’s number and waited. His voice did answer, except it told me to call back at a later time. I called another three more times and again waited. The phone was shoved against my ear when a hand landed on my shoulder. A co-worker, she saw my distress and offered a lift home.</p>\n\n<p>“I’ve never tried Uber.” My co-worker said. “I’m no good with technology and I can’t trust strangers. For that exact reason. I would’ve had a heart attack.” She laughed.</p>\n\n<p>I laughed with her. Our drive home was quite genuine. I’ve seen her around, had the small talk around the office. She seemed really friendly. She even helped me to the door of my home. We held a strong conversation out the car and down the steps, towards the front door. We walked past a small garden. Then, in the shadows and on the ground, I spotted small shards of glass. It flickered little reflection from the front house light. My laughing stopped and I looked at the windows of the house.</p>\n\n<p>It took a little for my co-worker to catch on. She’d never visited, so she had no clue there was supposed to be a window beside the front door. A curtain swooped out of the open window and over the concrete. She immediately called the police and I continued to stand still. Would it have been wise to call Gregory’s name? To walk into my own home? Maybe not – though I found the courage to do it anyway.</p>\n\n<p>“Gregory?” I called and I called again.</p>\n\n<p>My co-worker hissed my name and eventually followed me inside. The house was dark. It felt so unnatural, so wrong to see my home shrouded in a dark mist. A silent void and a crackle under my shoes. I couldn’t tell if this was my house. Up the hallway was pitch-darkness. Our bedroom was not seen on the other end. I called Gregory’s name, there was no reply. I didn’t walk up there at first until I saw his car in the garage.</p>\n\n<p>The police arrived. We crawled back out from the empty house and met the officer face to face. We explained little. They didn’t take notes about the Uber driver too seriously. I told them there was nobody inside. Three months later. I moved in with my Mum. My Mum has a photo of him hanging on the wall in the lounge-room. The police searched around town, through the house and even my phone for evidence.</p>\n\n<p>Mum and I will sometimes sit down and watch T.V. I feel like he hangs around, and my Mum said she has hope he’s still alive. She said she’s dreamt about him and he’s told her a few secrets. He’s alive and well, apparently. Then again. She’s had the same type of dreams about her husband. He passed away only a few months ago, too. </p>\n\n<p>I have work tomorrow morning. Everybody&#39;s busy and a Taxi can be quiet expensive now. I&#39;m afraid I might have to take another Uber.</p>\n</div>\n","author":"IsaacJMadigan"}