{"rank":"14","title":"Doctor Cho's Miracle Salve (Part 2)","id":"8m3dip","url":"/r/nosleep/comments/8m3dip/doctor_chos_miracle_salve_part_2/","time":"1527267995000","body":"<div class=\"md\"><p><a href=\"https://www.reddit.com/r/nosleep/comments/8jdft8/doctor_chos_miracle_salve_part_1/\">Doctor Cho&#39;s Miracle Salve (Part 1)</a></p>\n\n<hr/>\n\n<p>Writing the second part of this story has been more difficult than I had expected. My original hope was writing would bring some sort of catharsis allowing me to let go of what happened. And, I did feel a little better writing down the first part of my story. But I’ve been putting off what came next, because it was easier to fall back on old habits. Pretend that nothing happened and move on with my life.</p>\n\n<p>But no matter how hard I try I cannot ignore it like I had before. The metal tube in the bottom of my desk won’t let me. I’m no longer under the impression that writing this down will give me inner peace. But, it is all I can think about doing, and I have to try something.</p>\n\n<p>My conversation with Dave and Chris about <em>Doctor Cho’s Miracle Salve</em> never really ended for the next three years of my life. Sure, we talked about other things and we weren’t together all the time. But most of our interactions stemmed from that commercial one way or another.</p>\n\n<p>It wasn’t just the three of us either. It didn’t take long for me to notice watching the commercial was prerequisite to becoming an accepted member of their social circle. It didn’t matter if you found it funny or disturbing. Every individual who entered our lives watched that commercial at least once.</p>\n\n<p>Chris, Dave, and I watched it quite a bit more than that.  </p>\n\n<p>Each week I would make my way to Chris and Dave’s dorm with a twelve-pack purchased from my morally dubious RA. The three of us would spend the night drinking and watching the Broadcast Collective Television channel. Or BCTV. The local public access channel, and a haven for lo-fi cooking programs, motion sickness inducing homemade movies, and offensive after-school specials. </p>\n\n<p>The marathon had started based on how BCTV’s mechanics. Thursday evenings the oldest program would be replaced by a new viewer submitted show. Three times a day the BCTV lineup repeated. There were more commercials than shows and they were rarely replaced. They were shuffled around the lineup each week and repeated two times instead of three. So, if you watched the Thursday evening loop starting at eight am you’d know the exact lineup for the next week.</p>\n\n<p>Most people wouldn’t even know how BCTV decided its lineup but watching that public access channel was Chris and Dave’s passion. They knew every show and commercial that aired and were always trying to stump one another with BCTV trivia. It was out of this competition Thursday Marathon Night was born. </p>\n\n<p>Over time the one rule of Thursday Marathon Night was created: You don’t stop drinking until <em>Doctor Cho’s Miracle Salve</em>.</p>\n\n<p>Some Thursdays were easier than others. The commercial might air in the first hour, and then you could drink at your own leisure. But since the commercials were on a twice a day twelve-hour loop you’d never know if would be light out before <em>Doctor Cho’s Miracle Salve</em> started.</p>\n\n<p>So, one night near the end of my Junior year it seemed like we had gotten off pretty easy. It was three in the morning when the familiar synthesized music played. Even in my drunken state I felt relief wash over me. It meant we didn’t have to watch the programming lineup run through a second time. And I didn’t have to keep drinking.</p>\n\n<p>Unlike the other shows the three of us watched the <em>Doctor Cho’s Miracle Salve</em> in relative silence. Dave and Chris taking in every detail they could over the course of the commercial. I didn’t know what possible new information they could gather about a commercial they watched fourteen times a week. But unlike other shows on BCTV I never got tired of <em>Doctor Cho’s Miracle Salve</em>, so I understood their obsession to some degree.</p>\n\n<p>When the tall figure lunged at the camera with the phone number I started gathering the few belongings I had brought with me. When I stumbled a little and flopped back onto the chair I’d been occupying I heard a gasp from both Chris and Dave. Their attention still locked on the screen.</p>\n\n<p>Following their line of vision, I understood why they were shocked. I had seen <em>Doctor Cho’s Miracle Salve</em> enough to notice even the smallest difference. Both hosts still stood in their positions with their heads out of frame, but they were wearing different clothing.</p>\n\n<p>“Welcome back viewers,” Said the tall figure with the deep electronic voice who might have still been wearing his beige ensemble, but it was hidden under a long-stained apron with <em>Kiss the Cook</em> printed on the front. “It is our grandest hope you have been considering purchasing our product.”</p>\n\n<p>“But we are sure there are some craven fools out there who have dismissed our generous nature,” Said the shorter figure with the high-pitched electronic voice. He had switched into a burgundy robe pulled tight across a bloated stomach I was certain was larger than it had been in the regular commercial. “So, to help them find a backbone we are here live to more about <em>Doctor Cho’s Miracle Salve</em>”</p>\n\n<p>“They are making an infomercial!” Chris said </p>\n\n<p>“Did he just say live?” Dave asked.</p>\n\n<p>“We want you to call in and ask us any questions you would like about <em>Doctor Cho’s Miracle Salve</em>,” The deep voice said. “And if a viewer acts now we might even reveal the secret formula that made all of this possible.”</p>\n\n<p>They didn’t even need to get promising the secret formula before Chris began digging through his pockets, and when he didn’t find what he was looking for he rummaged through the couch.</p>\n\n<p>“Fucking phone,” Chris said to no one in particular.</p>\n\n<p>“Art,” Dave said. “Give us your phone.”</p>\n\n<p>“What?” I asked the chaos around me sobering me just a bit. “Use your own phone man.”</p>\n\n<p>“Don’t worry about it Dave,” Chris said. “I already have his phone.”</p>\n\n<p>Turning towards Chris I saw he was holding my phone and typing in the phone number from memory. I reached out to my phone but he was just far enough away to be out of reach. </p>\n\n<p>“You’re a dick,” I said still half reaching for my phone.</p>\n\n<p>“You should be more careful with your phone,” Chris said.</p>\n\n<p>Before I had time to point out the hypocrisy a ringing emanated from both the phone the television. I stopped reaching for the phone and settled back into the chair. </p>\n\n<p>“Hello caller it is a pleasure to have you with us tonight,” The deep voiced tall figure said.</p>\n\n<p>For a second the three of us sat in silence looking at the television. I don’t think we realized how real the situation was until that moment. I had expected the phone to ring and go to voicemail like it had every other time we called the number. But here we were with a direct line to the two headless figures we had watched a thousand times. None of us knew how to react.</p>\n\n<p>“We know you are still with us caller,” the fatter host said. His digital high-pitched voice coming through both the phone and the television, “We can hear your breath over the speaker.”</p>\n\n<p>“Is <em>Doctor Cho’s Miracle Salve</em> a real product or is this whole thing just some kind of elaborate art project?” Chris asked.</p>\n\n<p>The two figures on stage shared one of their awkward false laughter. Hearing the forced reaction live made the hair on the back of my neck stand on end.</p>\n\n<p>“I assure you viewer <em>Doctor Cho’s Miracle Salve</em> is very much a real product.” The deep voice said.</p>\n\n<p>“Um.” Chris said tracing his mind for another question. “How come your phone number has never worked before today.”</p>\n\n<p>“I would love to field this question,” The fatter host said. “We have never felt comfortable promising people <em>Doctor Cho’s Miracle Salve</em> when we do not have any in stock. So, while we have been preparing the next batch we have been refusing calls. It takes a long time to properly create this miraculous product. But lucky for you we are just about to finish a new load live on this program.”</p>\n\n<p>“Which one of you is Doctor Cho?” Chris asked</p>\n\n<p>“There seems to have been a misunderstanding,” The taller host said placing a hand on the shoulder of his cohost. “Neither I nor my associate are Doctor Cho.”</p>\n\n<p>“Doctor Cho is close by,” the fatter host said. “Would you like to meet Doctor Cho viewers?”</p>\n\n<p>“Yes” both Dave and Chris yelled in unison.</p>\n\n<p>“It would appear we have more than one viewer on the line my friend,” The taller host said turning towards the larger host. “I guess we should not keep our audience waiting.”</p>\n\n<p>With his usual lunge the taller host made his way towards the camera. The screen was enveloped in the <em>Kiss the Cook</em> logo of his apron. The tall figure fidgeted with the equipment for a while before picking it up and turning it towards the couch. No longer on screen the tall figure had taken manual control of the camera assuming the role of cameraman. The fatter host was lounging on the couch against the wall. His robe open exposing his large pock marked stomach and a pair of soiled shorts. The cameraman was careful to still position his face off camera.</p>\n\n<p>“What is going on?” Chris asked looking back and forth between Dave and me.</p>\n\n<p>“Shush,” The fatter host ordered with a severe sharpness. “The time for questions has come to an end. You and your friends are about to witness a secret, and we will not be interrupted.”</p>\n\n<p>“You would like to meet Doctor Cho correct?” The taller host asked but continued to speak without waiting for an answer. “This is the only tool capable of summoning the good doctor.”</p>\n\n<p>The camera was aimed towards a corner of the room previously not shown. In it sat a filthy shop-vac plugged into an old gas generator. Placing his hand on the portion of the hose attached to the bulky vacuum he caressed his way down to the end. Outfitted to the end of tubing with duct tape was a long makeshift needle. He held the pointed end up to the recorder to show off the hole in the end.</p>\n\n<p>Satisfied we knew what we were looking at the cameraman grabbed the generator’s starter chord and gave it a few swift pulls. The generator came to life filling the room with a loud rumble. Grabbing a hold of shop-vac the lanky cameraman pulled the shop-vac in the direction of his co-host.</p>\n\n<p>“Now to show the viewers how <em>Doctor Cho’s Miracle Salve</em> is harvested,” The deep modified voice said just loud enough to be heard over the sound of the generator. “Are you ready my friend?”</p>\n\n<p>The large man on the couch gave a thumbs-up. Off camera the shop-vac came to life filling the room with even more noise. The camera watched the free hand of the operator grab the large hollow needle outfitted to device. And with a swift motion he plunges it at an angle into the belly of his co-host. A high-pitched screeching filled the room eclipsing even the sounds of the mechanical equipment.</p>\n\n<p>“Fuck” </p>\n\n<p>The words shot from my lips while I made a retreat towards the door. Dave leaned over the side of the couch and evacuated a night’s worth of alcohol and snacks onto the floor. Chris didn’t move much from where he was sitting, but my phone slide out of his grasp and fell to the floor. No one able to pull our attention away from the horror taking place on the screen.</p>\n\n<p>The deep voiced host had not been satisfied with a single stab into his co-host. Over and over again he speared the fat man’s belly. Each time the high-pitched screech would start all over again. It felt like nails being scrapped across a blackboard in the back of my mind.</p>\n\n<p>Each stab didn’t come all the way outside the flesh of his costar, instead just stabbing into different reachable areas around the entry wound. But every now and then the full needle would be removed from the body and stabbed into another part of his stomach. The screeches that accompanied were much louder.</p>\n\n<p>The deep voiced host was also affected by the screeching. He could be heard telling his co-host to quiet down. Reaching a point where his screams for silence rivaled that of the screeching from the fatter man. His voice raising with each order until he had enough of the screeching.</p>\n\n<p>“I said shut the fuck up you coward,” </p>\n\n<p>He screamed loud enough to be heard over all other noises. Pulling the needle from the fat man’s stomach he lunged it off screen in the direction of the man’s head. The screeching stopped. He pulled the needle back followed by a spray of blood on the wall. Unsatisfied with ending the screams he stabbed the needle again and again in the direction of his co-host’s head. With each thrust more blood spraying on the wall. </p>\n\n<p>It took a lot for me to not follow suit and throw up the contents of my stomach as well. Dave tried repeatedly to look away from the video, but his eyes kept returning back to the screen. Chris’s face was pale while he ran his hands through his mopped hair. Still all three of us were unable to break the hold the video had on us. </p>\n\n<p>After dozens of thrusts into his former-partner’s head the cameraman stopped returning to his previous work stabbing into different parts of the corpse’s stomach. The screeching now replaced by a deep computer modified laughter.</p>\n\n<p>A genuine laughter that made my stomach clench tight.</p>\n\n<p>The laughter faded. The only prominent audio from the rumple of the generator and the <em>whirring</em> of the shop-vac. Every now and then you could hear a wet sucking sound from the needle doing its work inside the dead host’s stomach. The skin getting looser as more of its was sucked through the needle.</p>\n\n<p>It might have continued forever if the generator powering the shop-vac had not died part way through the procedure. The sounds of the industrial equipment coming to an abrupt end. The host pulled the needle from the hole pocked stomach. Dropping it to the ground beside him.</p>\n\n<p>The camera focused on the shop-vac while the camera man removed its lid. The bucket was filled with frothy orange-yellow fat. Chunks of solid blubber floating in the ooze. The cameraman submerged his free hand in the substance up to just below the elbow and gently stirred the tub of fat.</p>\n\n<p>“You wanted to meet “Doctor Cho” viewers,” the deep voice said from behind the camera. “Her he is. The beautiful marriage of carbon, hydrogen, and oxygen creating a most wonderful substance. An ancient elixir forgotten to a false sense of civility and ignorance. A magic piece of ourselves that can solve any problem. All you have to do is call now to get your own piece of this natural miracle.”</p>\n\n<p>I felt another wave of nausea hit me as I realized he was still trying to sell us this vat of human tissue.</p>\n\n<p>“For our lucky callers we will be sending you a free sample of the fresh <em>Doctor Cho’s Miracle Salve</em> you see before you. Others must simply pay a fair fee of $16.84. Call now while supplies last.” </p>\n\n<p>With this the tall host dropped the camera to the floor. Whether it was on purpose or not it gave us a quick glimpse of his face. It was the only time we ever saw what he looked like from the neck up. I wish it hadn’t happened.</p>\n\n<p>The small wisps of hair jutting out from his head and the broad smile devoid of most teeth were familiar. He was a dead ringer for the tooth-brusher and hair stylist from the original commercial. Like the top of his head the hosts face was covered in an infected looking rash. Much like the top of his head a few spots of beard seemed to jut from his face, but most of the area was too covered in the rash to grow hair. His eyes were crusted over causing him to be in a perpetual squint. Smeared across his face was the blood of the partner he had violently ended only moments ago.</p>\n\n<p>The worst part though was where his neck and chin met. Right in the middle grafted into the skin was a black box. The part facing out wasn’t much larger than a dice but judging by the scaring around the object it went much deeper into his throat. The skin closest to the foreign object was puffed and red with a yellow-green fluid seeping from several spots. On the external face of the object was a small speaker.</p>\n\n<p>“That is all for today viewers,” the deep electronically modified voice said while the tall man’s mouth remained motionless. “Thank you for watching <em>Doctor Cho’s Miracle Salve</em>.”</p>\n\n<p>At the conclusion of his final remarks he leaned head first into the bucket of his co-host’s fat. A submerging sound could be heard off camera before the feed cut.</p>\n\n<p>For a long time, the three of us sat in Chris’s room in a sort of daze. Dave was the first one to talk asking if we should call the police. Chris said we shouldn’t since we didn’t know if it was even real or not. From his voice I could tell he was just desperate to not have to accept what he just saw. Still the two of them argued about what we needed to do. For a while I sat trying to process what had happened.</p>\n\n<p>I left without saying anything to the two of them now yelling at one another. I’m not sure if they called the police or not. I never ended up asking them.</p>\n\n<p>A few times the three of us tried to hang out again after we saw the infomercial. We never watched BCTV again, but we had plenty of other interests in common. But every time one of us would find an excuse to be somewhere else. <em>Doctor Cho’s Miracle Salve</em> had been the foundation of our relationship. But that foundation had rotted and was no longer strong enough to support what we had. We had a hard time looking each other in the eyes.</p>\n\n<p>So here I am five years later. I’ve written out everything I remember about <em>Doctor Cho’s Miracle Salve</em> and I can already tell I’m not going to feel any better. Another sleepless night is just around the corner. </p>\n\n<p>I’ve thought about getting rid of the tube of human fat buried in my desk. But I’m not sure how you properly dispose of something that used to be part of someone. Trashing it feels disrespectful. And if I take it to the police they will probably act like I’m a nut. I’ve been contemplating either burying it or burning it. But really all this thought about getting rid of the thing is just me avoiding the question that keeps popping up in my head. The real reason I can’t get any sleep.</p>\n\n<p>Not one of us gave out a name or address when we called. I don’t even live in the same state as my university.</p>\n\n<p>How did <em>Doctor Cho’s Miracle Salve</em> end up on my doorstep?</p>\n</div>\n","author":"JDerrick29"}