{"rank":"20","title":"\"Life isn't kind, but Hell sure isn't either.\"","id":"8m3j8r","url":"/r/nosleep/comments/8m3j8r/life_isnt_kind_but_hell_sure_isnt_either/","time":"1527269200000","body":"<div class=\"md\"><p>I stood there with a smile etched into my face.</p>\n\n<p>I had won, society would never be a pain. No longer would I be surrounded by imbeciles.</p>\n\n<p>My intelligence was dying every damn second of this god awful life.</p>\n\n<p>And then I jumped off the chair, my decision final.</p>\n\n<p>The sweet nectar of release would grasp me any moment.</p>\n\n<p>Instead I find myself dangling for what seems to be hours on end.</p>\n\n<p>&quot;Why isn&#39;t this working?&quot; I bemoaned.</p>\n\n<p>And then I saw the metallic shimmer of a blade in the corner.</p>\n\n<p>Death.</p>\n\n<p>It spoke raspily, and sounded as if it were breathing in at the same time.</p>\n\n<p>&quot; <strong>Your time has not come yet.</strong> &quot;</p>\n\n<p>It was in full view now, showing all of its grotesque glory. It wasn&#39;t like your normal fairy tale version. </p>\n\n<p>It was far more terrifying than that.</p>\n\n<p>A 6 foot naked man now stood with broken wings spread out, each feather a peppered black and white, and many were torn apart from the wear of countless ages.\nThe scythe looked crafted from elm, as if a branch was torn off. The blade was not hammered on, instead nestled in a weave of bark.</p>\n\n<p>The face was what drained me of color.</p>\n\n<p>Its eyes were sewn closed perfectly, almost as if they were never there in the first place.</p>\n\n<p>A maw sat there in place of a mouth. It looked as if someone had cut into a pumpkin. The teeth were almost as sharp as the makeshift lips, and melded into the black void. </p>\n\n<p>To top it off was long, pure white hair.</p>\n\n<p>I wanted to scream, but instead found myself still in awe of what I now face.</p>\n\n<p>&quot; <strong>Life isn&#39;t kind, but Hell sure isn&#39;t either.</strong> &quot;</p>\n\n<p>It then continued on, &quot; <strong>Too many waste their lives, their intelligence, just for the sake of &quot;freedom&quot;. Life is precious after all.</strong> &quot;</p>\n\n<p>I scoffed, &quot;What would you know about life?&quot;</p>\n\n<p>&quot;Better than you I suppose&quot;, he laughed.</p>\n\n<p>Death had knocked at my door, only to let me down. Why was I more important than someone else?</p>\n\n<p>&quot; <strong>You will be the one to show the world the light, the truthfulness of death. You are the artist, the world your brush. This change will be your masterpiece.</strong> &quot;</p>\n\n<p>&quot;Why was I chosen as your artist?&quot; I cried out.</p>\n\n<p>Tears now streamed down my face. Society was a burden strapped to my shoulders. It was something I could never escape even if I tried. Now Death had denied me my last beacon of hope.</p>\n\n<p>&quot; <strong>Do not cry my sweet child. My reasoning will be revealed in due time.Only then will you begin to comprehend the true nature of this.</strong>&quot;</p>\n\n<p>And then he was gone. Only a stray feather now lay where he once was.</p>\n\n<p>The ceiling crashed down on me like His words did me, yet I still emerged unscathed.</p>\n\n<p>I now lay there. Dust and brick were splattered against my blue button-up. My  orange tie now appeared a grey mess, but managed to meld into the shirt like His teeth did mouth.</p>\n\n<p>I couldn&#39;t comprehend any of it, I was petrified. Yet a strange smile grew from beneath my tear-laden eyes.</p>\n\n<p>I couldn&#39;t die. </p>\n\n<p>I am the one that will purge society of its imbeciles.</p>\n\n<p>The world will be reborn.</p>\n\n<p>And then I collapsed.</p>\n</div>\n","author":"demonattacker"}