{"rank":"1034","title":"I Drew It Fifteen Years Ago","id":"8m3lvx","url":"/r/nosleep/comments/8m3lvx/i_drew_it_fifteen_years_ago/","time":"1527269776000","body":"<div class=\"md\"><p>I drew it fifteen years ago. In crayon, the first time. I carefully sketched out the edges of its body, the slender legs, the piercing eyes, the hair as black as death.</p>\n\n<p>From the moment I finished I was mesmerised with my creation, something about it was undefinable to me, something about it spoke to an infinitely deep set part of my lizard brain, something about it terrified me to my very core. And yet, I couldn’t stop.</p>\n\n<p>Every Time I got hold of a pack of pens, or pencils, or chalk, an etch-sketch even with a knife I found in the kitchen upon the grain of my desk. I developed a name for my creation, The Pretender. The pretender was a shapeshifter, that’s what I told my mum and dad. It could appear as anything it wanted. They’d ask me why I always drew the same thing, if it could transform, and why that form? I’d explain that that was how The Pretender wanted to be seen.</p>\n\n<p>From the moment I could draw until I was twelve years old I drew it, over and over, never changing. It’s edges grew more defined as I learned to draw within the lines, learned to sketch and shade better and better. I’d see The Pretender in my dreams when I went to sleep. It would dance and smile, offer its hand to me and tell me it loved me. It seemed kind, friendly even. But that’s what the pretender did, and I knew it, even if I couldn’t explain why. It drew you in. It pretended.</p>\n\n<p>My parents took me to several psychiatrists, to try and understand why I was so obsessed with it. Every psychiatrist said the same thing, “it’s just a phase.” My parents would huff and drag me out by the arm. It became a strain on them. Teachers and other parents would complain about me, about the things I said. </p>\n\n<p>The other children would stay away from me, because when someone did try to make friends with me, I’d tell them. I’d tell them all about The Pretender. My creation. The parents would call my parents and say their children couldn’t sleep, they kept waking up crying in the night and screaming about ‘The Pretender’. When they asked their children what I’d told them, they were horrified, each and every one. Things no child should be able to concoct, or understand. There were stories of children having to attend therapy because of my stories.</p>\n\n<p>Every inch of my room became coated with pages and pages of drawings, watercolours and careful landscape views with images of The Pretender in each and everyone, grinning. I began drawing it straight onto the walls, and my parents would scream at me. They were never abusive, you have to understand, they loved me. But it was because they loved me that they hated my obsession. It put pressure on their relationship, and when I was eight they separated. I lived with my mother after that. My father visited every weekend at first, but every time he’d come and see me I’d only talk about The Pretender. As time went by he’d visit less and less. By the time I was ten he’d stopped visiting me at all.</p>\n\n<p>My mother was left alone. Between two jobs and a son with something inexplicably wrong with him she spiraled into depression. Sometimes, late at night, when she thought I was asleep, I’d hear her in crying. When I went to her room and peered through the door I’d see her face down in a pillow, cheeks rose red.</p>\n\n<p>And then one day, it just stopped.</p>\n\n<p>I was sat on my bed doing a regular sketch, colouring a street with brick houses and pretty gardens. I reached the end of my drawing and sat back to look over it. And then I realised. The Pretender, was nowhere to be found. I couldn’t see it peeking out from behind a car or through a window, and it had never been afraid to show itself before. It was always the focus of my drawings. And yet, it was nowhere to be seen. I never made an effort to draw The Pretender, it was always just there. Like I meant to draw something else and had absent mindedly described its edges and colours with my pencils.</p>\n\n<p>When I showed my mother she almost passed out from shock. She took it and studied it. I think she even cried. She sat me down and asked me to draw something else, and I did. Once again, my creation, did not appear. She almost broke down from happiness. Whatever had been wrong with me, it just stopped when I was twelve.</p>\n\n<p>She took me to the psychiatrists and tried to figure out what happened, and they told her what they always had. “It was just a phase.”</p>\n\n<p>And that was it. We went home and she immediately went into my room and tore down each and every one of my drawings, throwing them into the trash can. When she used to do it, I would cry and scream. But that day, I just stood there in silence.</p>\n\n<p>From then on, I was just like any other kid. I stopped drawing it. I stopped talking about it too, I even started making some friends. Some of their parents had heard about me, about what I’d told the other children. At first they’d tell their children not to talk to me, but as time went by and I showed no signs of my old ways, the parents forgot, or forgave. From then on, I was just a normal kid, a normal teenager, a normal adult.</p>\n\n<p>I went through high-school and went to parties, I got laid, I tried smoking cigarettes. And as time went by, I forgot about The Pretender bit by bit. I got a degree, got a job, got engaged, and I forgot about The Pretender all together.</p>\n\n<p>While I had grown bigger, more well-rounded and more outgoing, I’d also grown further away from my mother. Something about my traumatic childhood just made my stomach drop every time I thought about going to see her, or calling her number. I moved out as soon as I could and didn’t look back. Much like my father, as time went by, I stopped visiting, bit by bit. I look back on it and realise how it must have felt for her, both her husband and son having left her. I know she loved me, and I can’t defend myself. I just wanted to be free.</p>\n\n<p>And then I got a call. She was in the hospital, and I was her next of kin. She’d slipped in the bathroom and her head struck the bathtub. Just like that, she was gone. Not dead, not quite. She was simply comatose.</p>\n\n<p>When I got the call I told Jillean, my fiance. I said I’d go alone, but she said she’d go with me. That she wanted to meet my mother just once, even if it was like this. I appreciated her offering to come with me. Seeing my mother’s face brought up so many memories, so much pain and anxiety. Of being a kid and unable to understand what was wrong with me.</p>\n\n<p>The Doctor explained to us that given the injuries and her age, it was a one in a million she’d wake up. Standing over here bed I couldn’t hold back tears, and Jillean held me while I cried into her light blue sweater. I planned to tell them to let her go, but in the end I never even needed to. I was in the bathroom when it happened. She was already gone by the time I arrived back at her bedside.</p>\n\n<p>I was left to clear out the small apartment I’d grown up in since I was nine. I unlocked the door with my old key, which I’d never taken off my keychain. I walked through each of the rooms with an inexplicable melancholy. I walked through the old door to my room, and everything was just as I’d left it. It even smelt the same, the mustiness and the slight tinge of the Budweiser I’d spilt in the carpet.</p>\n\n<p>I started looking through my old things with a sad smile on my face. My old toys, Woody from Toy Story, a toy I played with every day, the My Chemical Romance poster I pinned to the wall, the collection of rocks I’d gathered with a high-school girlfriend.</p>\n\n<p>Then I found my old sketch-book. I started flipping through pages and seeing my old drawings, old friends and silly scribblings of people I knew. And then I flipped to another page. A page with an image on it that I had long since forgot. An image I thought I’d scrubbed from every part of my memory, repressed away to the locked vault at the back of my mind.</p>\n\n<p>The slender legs in tight jeans, the light skin and frilly shirt, the hair as black as raven feathers. My skin felt as ice. I didn’t want to believe what I was staring at, but as the sweat began to drip down my brow there was no denying the shape of The Pretender. I was staring into the piercing blue eyes of the woman I loved.</p>\n\n<p>“Jillean…” The word passed between my lips almost without my own consciousness.</p>\n\n<p>Beside the picture was one word.</p>\n\n<p>‘Beware’</p>\n</div>\n","author":"GeoronimoTheThird"}