{"rank":"4136","title":"My wife did something really weird last night . . .","id":"8m3tyz","url":"/r/nosleep/comments/8m3tyz/my_wife_did_something_really_weird_last_night/","time":"1527271531000","body":"<div class=\"md\"><p>My wife and I have been married for a few years now. For most of that time, I have slept on the couch. I snore pretty loudly, and she&#39;s a light sleeper, and so it works out best for everyone that I spend my nights on the couch. I don&#39;t mind.</p>\n\n<p>Our couch is against the back wall of the living room. From the couch, I can see the living room, the kitchen, and the hallway with the doors to the bathroom, the bedroom, and the outside. About 3 or 4 times per night, my wife&#39;s small bladder gets her up and sends her to the bathroom. The sound of the doors and movement wake me up pretty much every time. Sometimes I say &quot;hi,&quot; or sometimes I just pretend to still be asleep.</p>\n\n<p>Well, last night, something kind of weird happened. It was probably around 2 or 3 in the morning. I was awoken by the sound of the bedroom door opening and closing, and I opened my eye just enough to see the outline of my wife moving in the hallway. I noticed that the room kind of smelled like pennies.</p>\n\n<p>But then the bathroom door didn&#39;t close. I could hear her moving around very quietly, and when I opened my eye again, she was moving slowly through the living room, stopping to examine every little picture and knickknack along the way. I figured that maybe she was working her way to the kitchen to get some water and was just being nostalgic or something. I didn&#39;t want her to think she had woken me up, as she was clearly trying to be quiet and I didn&#39;t want her to feel guilty.</p>\n\n<p>This goes on for what feels like five minutes. Then what feels like ten minutes. As we&#39;re pushing fifteen minutes of her just meandering around looking at stuff, I finally sit up and ask her, &quot;is everything okay, sweety?&quot;</p>\n\n<p>She turned, looked at me, and froze. She looked like the proverbial deer in the headlights. Her eyes were wide and she looked paralyzed with fear, like I was some giant monster that had just jumped out from around a corner. &quot;Becky?&quot; I asked.</p>\n\n<p>She screamed, or, at least, she she did everything that would be a scream without the sound. It was like she was on mute, but she was clearly screaming. Then she ran. She ran out of the living room, into the hallway, and straight out the front door.</p>\n\n<p>Once she had started running, I also got up. She was out of the house by the time I had walked to the end of the carpet where the hallway began. &quot;Are you okay?&quot; I shouted to the door that she had left open.</p>\n\n<p>At this point I was more confused and worried for her than anything else. I walked over to the open door and looked outside, but she was nowhere to be seen. I began walking back to the living room to grab my robe and shoes, but, before I made it back to the carpet, the bedroom door opened and my wife poked her head out. &quot;Did you say something?&quot; She asked.</p>\n\n<p>I reassured her that I hadn&#39;t, I closed the door to the house, I double checked the lock, and I went back to my couch.</p>\n\n<p>I know that I wasn&#39;t dreaming. She asked me this morning why I was up and said that she swore that I had woken her up by shouting &quot;are you okay?&quot; The knickknacks were all a little out of place, and the picture frame that she had been holding when I startled her was still on the floor.</p>\n\n<p>I have no idea what happened, but it sure was spooky. I don&#39;t think that I&#39;m going to get much deep sleep tonight.</p>\n\n<hr/>\n\n<p>UPDATE: <a href=\"https://www.reddit.com/r/nosleep/comments/8mdus5/my_wife_did_something_really_weird_last_night/\">I decided to talk to my wife about what happened.</a></p>\n</div>\n","author":"JohnQK"}