{"rank":"49","title":"The Video That Changed (Part 1)","id":"8m3ukj","url":"/r/nosleep/comments/8m3ukj/the_video_that_changed_part_1/","time":"1527271659000","body":"<div class=\"md\"><p>Me and Tommy leaned in closer until our noses were almost touching the screen of my phone.</p>\n\n<p>Once again, the video started with Tommy running across the roof of his house and leaping into the air like a madman. He arched his back, tucked up his knees and span in the air. A backflip with forward momentum, or a &#39;gainer&#39; as he kept insisting I call it. He landed perfectly, as he had last time, and it was easy to deny the little differences as being our imagination. Until I spoke.</p>\n\n<p>Off camera, the video version of me said &quot;Dude that was sick!&quot;</p>\n\n<p>&quot;&#39;Dude that was sick?&#39;&quot; said Tommy, spinning me around to face him. &quot;Last time you said&quot; &#39;Man that was perfect&#39;!&quot;</p>\n\n<p>My entire body went cold. This was our fourth watch of the video, and each time there had been subtle differences. I thought my phone was broken first. Then I thought it must have been in my head. Now I was sure. Tommy was right, I had said something completely different in the previous watch of the same video.</p>\n\n<p>&quot;Watch it again!&quot; said Tommy, gripping my shoulders tight and bouncing in his chair.</p>\n\n<p>&quot;But what does it mean?&quot; I asked, &quot;how is it doing this?&quot;</p>\n\n<p>&quot;Watch it again man!&quot; Tommy insisted.</p>\n\n<p>Relenting, I hit replay. That familiar shot looking up to the roof filled my screen, and soon video-Tommy was running and jumping. He twisted through the air, but as he landed, he took one step out of place, wobbling on the spot.</p>\n\n<p>&quot;Nah that was crap,&quot; said video-Tommy, turning to the camera and walking back towards the house. &quot;We&#39;ll do another one.&quot;</p>\n\n<p>&quot;Ok,&quot; said video-me, as the camera panned down to the grass and stopped abruptly.</p>\n\n<p>Next to me, Tommy was leaping up and down, a huge grin on his face, head in his hands, stumbling around his garden like he always did when something was too funny or too crazy to handle. &quot;What the actual fuck!! I told you! I told you it was different each time!!&quot;</p>\n\n<p>I wasn&#39;t smiling though. My hands were shaking. How was this even possible? Some prank, maybe? Tommy had somehow done.. something? But that was my voice. That was me saying those things. And it was my phone. How could he have…</p>\n\n<p>&quot;Watch it again!&quot; said Tommy, throwing himself into the seat next to me and gripping my shoulders so tight it hurt.</p>\n\n<p>I tried to reply, but wasn&#39;t even sure what I wanted to say. Something about this felt very wrong, and yet I had a morbid curiosity about it I couldn&#39;t shake. A part of me wanted to throw the phone as far as I could, to break the thing and never talk of this again. But a much larger part of me wanted to watch the video again.</p>\n\n<p>I pressed replay.</p>\n\n<p>Video-Tommy ran off the roof, just as he span, his shoes caught the guttering, and knocked it loose. As Tommy span, small black shards of plastic clattered to the floor. Tommy landed the gainer fine, but turned round instantly and threw his hands to his head.</p>\n\n<p>&quot;Shit!&quot; said video-Tommy, &quot;dad&#39;s gonna kill me!&quot;</p>\n\n<p>The camera moved from Tommy&#39;s face to the scraps of black plastic on the ground. Off camera, the video version of me was sniggering to himself. Or myself, I suppose.</p>\n\n<p>When the video ended, neither of us said anything. Tommy wasn&#39;t smiling now, his face had gone white as a sheet. I turned to face him, expecting we&#39;d share the same look, but he wasn&#39;t even looking at me.</p>\n\n<p>He was looking over my shoulder. Confused, I twisted to see what he was staring at.</p>\n\n<p>On the ground, beneath the spot he&#39;d jumped from, were four shards of black plastic guttering.</p>\n\n<p>My eyes trailed upwards to the roof. Right at the spot we&#39;d just seen video-Tommy catch with his shoe, a jagged hole was missing from the guttering.</p>\n\n<p>Neither of us spoke for a while, but when Tommy did, it was in a quiet, raspy voice.</p>\n\n<p>&quot;Can you send me that video please?&quot;</p>\n\n<p>I didn&#39;t answer right away. I stood and picked up one of the bits of cracked plastic, needing to feel it for myself.</p>\n\n<p>“Maybe if we watch it again… it’ll go away?” Tommy said behind me. I carefully placed the broken piece of guttering back where I’d found it and caught upto Tommy, who was pacing around his patio, scratching his eyes. “Send it me on my phone, I wanna see if it works on my phone.”</p>\n\n<p>Placing a hand on his chest to stop his mad pacing, I tried to keep my voice steady, but my mouth was dry and I could hear it cracking with emotion as I spoke. “I don&#39;t think that&#39;s a good idea.”</p>\n\n<p>“Come on, stop dicking around. It&#39;s my video. You were gonna send it me anyway.”</p>\n\n<p>“Fine,” I said, loading up WhatsApp and sending Tommy the video file. “But I think it&#39;s a dumb idea.”</p>\n\n<p>“All my ideas are dumb ideas,” said Tommy, somehow managing to crack a smile, his eyes lighting up. “That&#39;s why they’re so fun.”</p>\n\n<p>It was hard not to agree. Tommy was the carefree one, I was the cautious type. It had been that way since we were little kids. Tommy’s phone began quacking as it received the video file, and I had to laugh at the stupid notification tone. I’m sure he changes it just to fuck with me. He opened the file almost instantly, and we both froze, our eyes glued to Tommy’s cracked screen. The upwards shot of the roof came into view, and video-Tommy began to run. Then the screen went black, and a message popped up saying ‘Error’.</p>\n\n<p>“I guess it only works on my phon-”</p>\n\n<p>The video started playing again, resuming from the same point. Video-Tommy leapt into the air, twisting gracefully and absolutely nailing the landing. He fist pumped and video-me whooped, running towards him, the screen blurring as I ran. We high fived and the video ended.</p>\n\n<p>Slowly, we both looked up at the roof. The guttered was fixed. No black shards on the ground.</p>\n\n<p>“What was that error message about?” I asked out loud, not really expecting an answer.</p>\n\n<p>Tommy pursed his lips. “Is that what happened? I was watching the roof. Wanted to see if it got fixed as we were watching, you know? Like if the gutter bits would float back into place or something. I heard the audio stop and started watching again. Never saw an error thingy?”</p>\n\n<p>“Yeah, it stopped playing,” I muttered, gazing back up at the roof, at the perfectly formed guttering. There wasn’t a mark on it. It hadn’t been fixed. It had never happened.</p>\n\n<p>“What do you think will happen if we both watch it?” Tommy said, laughing to himself and bringing up his phone.</p>\n\n<p>I grabbed hold of it and looked him in the eyes, giving him a full blast of my ‘this is a fucking bad idea’ look that I’d perfected over the years. “No, we’re done man. We fixed the gutter, we need to stop.”</p>\n\n<p>Tommy shrugged my hand away and moved out my reach. “You’ve got to be kidding me! This is the coolest shit that’s ever happened! We’ve made a magic video!”</p>\n\n<p>He started laughing as his phone began playing familiar audio, and lurched away as I tried to grab him.</p>\n\n<p>“Tommy! Fucking stop it!”</p>\n\n<p>Eyes locked on the screen, he bounded easily away from me, knowing full well I’d never be able to catch him. A shiver worked its way down my spine until I realised I could just look at the roof and make Tommy’s video stop. I turned back and glanced up at the roof, the audio on Tommy’s phone cutting out immediately.</p>\n\n<p>“Hey!” he shouted, behind me. “You’re no fun, you know that?”</p>\n\n<p>“We’ve got no idea what this is,” I said, twisting to look at him.</p>\n\n<p>The video started playing again.</p>\n\n<p>“Stop it!” I shouted.</p>\n\n<p>“I can’t!” Tommy shouted back, tapping his screen and sounding genuinely scared.</p>\n\n<p>There was a crunch and a moan from Tommy’s phone, and then he wasn’t there. My entire body turned to ice. I tried to speak, to call out, but my throat wasn’t working.</p>\n\n<p>A groan next to me made me flinch, jumping out of my skin. Lying face down in the grass next to me, clutching his head, was Tommy.</p>\n\n<p>Fighting the urge to run away, I had to force myself to drop down next to my friend and check he was ok. For some reason I’d felt like he’d disappeared a moment ago. I was afraid, not for Tommy, but for myself, and I couldn’t quite remember why.</p>\n\n<p>“What happened?” he moaned as I wondered the same thing.</p>\n\n<p>“I don’t know,” I began, “We... we were watching a video, I think… and…”</p>\n\n<p>“I fucked up the landing, didn’t I? Did I pass out?” said Tommy as he pushed himself off the ground and sat up.</p>\n\n<p>“Yeah,” I said, before shaking my head and correcting myself. “No! No, you nailed it, we were watching a video. A video on your phone.”</p>\n\n<p>It felt right as I said it, but it didn’t take long for me to doubt myself. Tommy had fell, slipped and banged his head. What video was I talking about?</p>\n\n<p>“What video?” said Tommy, scrolling through his phone as he rubbed his forehead, one eye closed. He pulled his hand away, a dribble of blood staining his fingers.</p>\n\n<p>“I dunno,” I managed, wondering why I&#39;d said that. “Maybe it was my phone.”</p>\n\n<p>I pulled out my phone and looked at the recent files. There was a video, filmed fifteen minutes ago. My hands were trembling as I showed Tommy and pressed play.</p>\n\n<p>The video started filming upwards at the roof. Tommy ran into shot from the side and jumped off, tucking and rolling into a perfect backflip, or ‘gainer’ as he kept insisting I call them. He fell down and landed perfectly on the grass, throwing his hands in the air like an olympic athlete.</p>\n\n<p>“Nice, man!” my own voice said off camera.</p>\n\n<p>Me and Tommy both looked at each other with scrunched up faces. That wasn’t right; we’d only filmed one shot and Tommy had-</p>\n\n<p>“FUCK!” shouted Tommy.</p>\n\n<p>“What the fuck!” I managed to squeak back.</p>\n\n<p>Our memories came back in a torrent. We’d watched the video maybe ten times, not once. I’d not been counting, but Tommy hadn’t fell. He’d disappeared and appeared on the floor next to me. Tommy was shaking and staring at his hand. The fingers that had been covered in blood seconds ago were now perfectly clean.</p>\n\n<p>“I don’t like this, man,” he said, tears welling in his eyes. “I don’t wanna watch that video anymore.”</p>\n\n<p>I collapsed back, joining him on the grass. I felt like crying too. “Me neither,” I gasped, tapping at my phone. Tommy tried to snatch it out my hand, but I gripped it tight.</p>\n\n<p>“What are you doing?” he whispered, looking the most scared I’d ever seen him in all my life.</p>\n\n<p>“Deleting it.”</p>\n\n<p>I pressed the trash-can icon and a little rotating symbol popped up, showing the phone was deleting. I let out a shaky breath and saw Tommy fetching out his own phone to do the same.</p>\n\n<p>A dialogue box popped up. ‘Error.’ Dismissing it, I saw the file was still there. I tapped the trash can again, and the symbol rotated. ‘Error’.</p>\n\n<p>“I can’t delete it!” said Tommy, his voice splitting in the middle.</p>\n\n<p>“Neither can I,” I whispered.</p>\n\n<p>We both looked at each other for a moment, both as scared as each other. Both scared more so at seeing our best friend as scared as we were.</p>\n\n<p>“We’ve just got to not watch it,” said Tommy, looking at me with wide eyes. “You have to promise not to watch it.”</p>\n\n<p>Grabbing Tommy’s hand, I nodded so fast it hurt my neck. “I never wanna see this fucking video ever again in my life.”</p>\n</div>\n","author":"RyanHatesMilk"}