{"rank":"0","title":"The Village of Nightmare: Fisherman's Death Part2","id":"8m3wrw","url":"/r/nosleep/comments/8m3wrw/the_village_of_nightmare_fishermans_death_part2/","time":"1527272156000","body":"<div class=\"md\"><p><a href=\"https://www.reddit.com/r/nosleep/comments/8lqpk4/the_village_of_nightmare_fishermans_death_part1/\" rel=\"nofollow\">The Village of Nightmare: Fisherman&#39;s Death Part1</a></p>\n\n<p>I was sitting in my bed in the evening, and my hands were shaking. It had been a crazy day. Everything that had happened with Suiyama-san. I couldn’t quite wrap my mind around it. His death that day probably had changed the village’s course of action. I wondered if he would ever again fall from the bridge and break his back.</p>\n\n<p>For a long time, I couldn’t fall asleep. Of course, I was accustomed to all the happenings in the Village of Nightmare. But this time it was different. When watching bad things going on with others, I could feel sad, devastated, angry and powerless, without being able to change anything. However, I had never been chased by someone like today. It was something completely else. The feeling of death running after you, the adrenaline rush through your body. In moments like these, you understand what it truly means to live…</p>\n\n<p>Then I fell asleep.</p>\n\n<p>I was at Suiyama-san’s house again. The world now was warped and all gray. I looked around and wanted to go away, but I couldn’t; when I made a step in a different direction than the house, everything just started waving, and the world turned, making me face the house again.</p>\n\n<p>From the rice field ahead protruded thousands of small stakes with sharpened tips. They all were marked red and were the only thing having a color other than gray in this world. However, the color wasn’t created by the ribbons this time. These stakes were crimson red and, when looking closer, the water in the field wasn’t water anymore but blood.</p>\n\n<p>The house’s door was ajar, black abyss prevailing behind it. I went inside.</p>\n\n<p>I didn’t know what to do. In fact, I just wanted to get out of there, but I didn’t know how. The floorboards were squeaking eerie when I made steps. Prowling through the house was my only option.</p>\n\n<p>When I was on the second floor, I suddenly heard something like a woman’s voice coming from a room. I wasn’t sure about it at first, but the second time it sounded more clearly. For me, it was a sign to get out of the house, but I couldn’t; my legs were moving on their own… toward the room… I felt that sinking feeling in my stomach. Everything felt mushy, muted and unreal like if I was inside of some kind of a cloud. I didn’t control my body anymore.</p>\n\n<p>The door was nearing. This one was also left ajar, but there wasn’t darkness behind it. Ghostly, pale light was coming from inside…</p>\n\n<p>A ghost was standing in the room, radiating the mysterious light. It was a woman about thirty years old.</p>\n\n<p>”Hello my dear, Hashimoto-san,” she said.</p>\n\n<p>”H.. how do you know my name?” I stuttered.</p>\n\n<p>”It doesn’t really matter. What matters is that I have to tell you a story.”</p>\n\n<p>”I don’t wanna hear any stories, please let me go,” I was begging.</p>\n\n<p>”It doesn’t matter if you want it or not, you’ll hear it anyway.” Then she started the story.</p>\n\n<p>”In a place far, far away, in a time long long ago there was a village. In the village, there lived a man and a woman. They met, fell in love and got married. Then, after a while, they had their little baby. She was the most beautiful baby in the world, and everything in their lives went nice and smooth, but you see this isn’t the story with a good ending…</p>\n\n<p>”The village they lived in was cursed, and the mommy died not long ago after the baby was born. It isn’t really important how she died, but trust me her death was terrible and painful. However, that isn’t the most horrid thing in this story. The mommy came back and then she died again, again and again. The daddy had a special ability to remember all these deaths, but no one else in the village could. Others thought that the daddy was going crazy.</p>\n\n<p>”The daddy was trying to save the mommy, but whatever he did wasn’t good enough. He couldn’t stop it. Then the mommy died for the last time and everyone in the village forgot about her forever. But there still was their little daughter…</p>\n\n<p>”The daddy read in some old, old book that curses don’t affect those who don’t have a name. That’s why he destroyed any evidence of his baby existing. The daddy even sneaked into the village’s data repository and burned everything he could find about his daughter, but that wasn’t enough… The daddy killed everyone who knew that he had a daughter. Then he hid her in a place where no one could find her…</p>\n\n<p>”Now the daddy has gone to the place where the mommy is, but there is still a way for their daughter to find a way to the real world…”</p>\n\n<p>She ended her story and seemed to be brooding over something. I stayed quiet.</p>\n\n<p>Then the ghost lifted a tatami from the floor, baring the boards. One of these boards was loose. She took the board out from the floor, revealing a small storage below. In the storage there was a key, glowing in the gray world just as she did.</p>\n\n<p>The ghost woman took the key and stretched her hand to give it to me. My fingers almost could grasp the key when the world around me started to dissipate. I woke up.</p>\n\n<p>My heart was beating fast and small beads of sweat covered my body. I felt nausea. This didn’t seem like a usual dream at all. It probably meant something important.</p>\n\n<p>I tried to turn to the other side in my bed, but I couldn’t; my body had that sleep paralysis people sometimes get. I was steadying my breath and watching the familiar room. It calmed me down a bit. I tried to convince myself that the thing had been just a dream, nothing else.</p>\n\n<p>When looking at the light on the floor cast by a street lantern, I suddenly saw something just behind the edge of the light. I strained my eyes. Nothing should have been there. An anxiety sneaked into my heart.</p>\n\n<p>Suddenly the thing moved and came out into the light. I wanted to scream but couldn’t; I was completely paralyzed, and only my eyes were moving.</p>\n\n<p>The mysterious object was a tip of a boot. I looked up and saw a dark, bulky figure. It was Suiyama-san’s ghost. The unlucky stake still was lodged into his skull, impaling his left eye. The other eye was watching me bulging and its capillaries full of blood. It was a truly insane look.</p>\n\n<p>In his right hand Suiyama-san was holding the wrench, but this time the wrench wasn’t the same. It was much bigger and rusted brown, making its surface like a sandpaper.</p>\n\n<p>There wasn’t a second thought about what was going to happen. He’d traveled from the land of the dead to this world to finish his final task. Kill me…</p>\n\n<p>I still wasn’t able to move. The only thing I could do was watch him lift his hand in order to make a blow ending me.</p>\n\n<p>”Darling, what are you doing? It’s over. There’s nothing else you can do,” suddenly a voice sounded. It was the voice of the ghost woman in my dream.</p>\n\n<p>Suiyama-san lowered his arm and looked back. I couldn’t see a thing because I was still paralyzed.</p>\n\n<p>”Darling, you know I’m right! Even more. She’s the only one who can do something about our daughter. Leave the girl alone! Come, we have to go!”</p>\n\n<p>Suiyama-san turned around and went away. Then I woke up for real.</p>\n\n<hr/>\n\n<p>The next day I once again was in Suiyama-san’s house. I’d shattered the pane of the window and broken in. This time in the real world. He hadn’t come back. The house was empty and Suiyama-san dead, most likely forever.</p>\n\n<p>The house from inside looked just like in my dream, only it had colors. I went straight up to the second floor, to the room.</p>\n\n<p>When I lifted the tatami, there really was a loose floorboard. My heart was beating fast. Could this be happening for real? By then I still wasn’t sure. Maybe I would take the board out and nothing would be there. Maybe it all was my nightmares and fantasies. </p>\n\n<p>I lifted the board.</p>\n\n<p>A big, old key was lying inside the storage below the board. It didn’t look anything like the one in my dream, but it was very real.</p>\n\n<p>I was holding the key in my hand and thinking about what to do next. Although I got the key, I didn’t know where to use it. It most certainly didn’t look like an ordinary house or car key. The key looked more like a gate key or something… And then I remembered. I’d seen a similar key before, I knew where to use it…</p>\n\n<hr/>\n\n<p>I was standing in a tall grass. It was hot, very hot. Sweat covered my body from the long walk. I’d gone past the junkyard along the forest road. Now I was standing in the place where old, abandoned military base started. Although its gates were covered with different signs of no trespassing, there were no guards and no one interested it. Like an irony of the fate the fence just right next to the gates had fallen over and everyone could come and go freely.</p>\n\n<p>I’d seen the key clenched my hand in old history books. It looked just like the key from the World War Two Japanese bunkers, and I knew that there were four of such bunkers in this abandoned military base.</p>\n\n<p>I went and checked the bunkers. Three of them were busted open, but the fourth wasn’t. Its dark metal door was looming in front of me the entrance partially immersed into the ground.</p>\n\n<p>I swept over my forehead; although the bunker was in the shadows cast by big, old trees, I was still sweating. My hand was shaking. Would I really find Suiyama-san’s daughter in there? In the end, he had gone insane. Maybe she really was just a delusion, but then I remembered my dreams, more like nightmares. Although they all could have been just fruits of my imagination, I’d found the key thanks to them. There was some truth to this all.</p>\n\n<p>But what if Suiyama-san had reset and was hiding in this bunker himself? I imagined how angry he would be if he knew that I’d found out about this place. This time I probably wouldn’t be able to escape…</p>\n\n<p>It didn’t matter. Everything that had happened would be for nothing if I gave up now. I made my way down the few dirty steps to the bunker’s door and put the key into the keyhole. The key turned; it was the right one for this door.</p>\n\n<p>With a little yank, the door creaked open. There was a light inside. I knew that this was the right place and continued my way down the corridor.</p>\n\n<p>The whole place had a strong odor of feces and urine. Cockroaches were scurrying on the floor. These things mixed together almost made me puke, but I resisted. Someone definitely lived or had lived in this place.</p>\n\n<p>I checked all the rooms until there was only one left, and I still hadn’t found anyone, but somehow I felt that there was someone in the last room.</p>\n\n<p>I opened the door. The floor was littered with packages from many different foods, cockroaches rummaging through them and making crunching noises. In the corner of the room, a doll was sticking out her head from all this mess. There were also many three-gallon water bottles. All empty now.</p>\n\n<p>Along the wall was a bed, and a body was lying in it. It was a body of a girl. She could be thirteen to sixteen years old. I hurried to her, but I didn’t have much hope that she would be alive. I figured that Suiyama-san hadn’t visited her since he died in the river for the first time. It was some month ago.</p>\n\n<p>He’d written in his note that he hadn’t visited her for three days and was planning to take the daughter away the next day, but after writing the note, he’d died. Even more, the time had passed by after his death, but then he kept resetting, again and again, him thinking that he just had visited her. For him, it always had been three days, but for her already a month had passed. That was why the place was in such a bad shape.</p>\n\n<p>Tears welled in my eyes. She was just a girl. She had seen nothing in her life except these gray concrete walls and didn’t even has a name. Her body had given up in a fight with dehydration when all of her resources had ended. The girl’s limbs were very slender and tiny, her skin almost white pale without being able to see the sunlight for her whole short life.</p>\n\n<p>I checked her pulse, and my heart skipped a beat. Although very, very weak, it was still there. I took her on my hands. She was so light, like almost unreal. I brought her out from this underground hell.</p>\n\n<p>Without thinking, I carried the girl out of the military base’s territory. I tried to be as fast as I could because I didn’t have water taken with me. She could die any moment.</p>\n\n<p>When I almost had reached the main road, a stressful thought came into my head and I stopped. Of course, if this were just some ordinary village and this were just a case of rescuing a victim of abduction everything I did would be right. Unfortunately, this wasn’t the case. Her life had been like that only because of this place itself.</p>\n\n<p><em>”I once read that curses don’t work if the name of a person is unknown,”</em> I remembered what was written in Suiyama-san’s note. What was I doing? The thought in the note was probably right. If I saved the girl now, people in the village would give her a name. She would probably just die later from the curse. Again and again… Maybe it would have been better if I’d left her in the bunker… No! I couldn’t do that, but what could I do? The feeling of powerlessness and depression took over me.</p>\n\n<p>I sat down on the road still holding the girl. I had to think, like really think. Then by chance, I put my hand in my pocket. There was some carton in it. Suddenly everything connected, everything that had happened made sense. I took out my phone, the most expensive belonging I had, and made a call.</p>\n\n<p>The detective Matsui arrived after two hours. The carton in my pocket had been his business card. Matsui-san, of course, hadn’t been appointed to Suiyama-san’s case this time because Suiyama-san had died yesterday while chasing me. Fortunately, the fact itself that I knew Matsui-san’s telephone number had made him concerned enough to find out what was happening. After an intensive persuading, I’d managed to get him here. He was too young and too suspicious of everything to take my call lightly.</p>\n\n<p>While waiting for him, I’d ran to the village and bought the water. The girl had regained consciousness after me cooling her with the water. I’ll never forget her big eyes staring at the world she’d never seen – the trees, the grass, the skies, the mountains.</p>\n\n<p>I didn’t try to speak with her. The last time I saw the girl was when we arrived in Tokyo and I got out of Matsui-san’s car. Then paramedics took her. No one knew about her in the village, and even I didn’t know her name. She was out for real. The place didn’t have any power over her anymore.</p>\n\n<p>After a few days of questioning, they brought me back to the Village of Nightmare. Suiyama-san’s case was closed. It was treated just like some ordinary abduction. Everyone remembered about Suiyama-san dying when he’d chased me. People just thought of him being crazy, and only I knew the truth. In their eyes, I also was the crazy girl. Bad things happen when two mad people meet. That was what people thought.</p>\n\n<p>In the end, I was so happy that at least one person had escaped this cursed place although <a href=\"https://www.sebastianwinterwriter.com/\" rel=\"nofollow\">the price had been great.</a></p>\n</div>\n","author":"SebastianWInter"}