{"rank":"22","title":"Parasites in my apartment","id":"8m47wy","url":"/r/nosleep/comments/8m47wy/parasites_in_my_apartment/","time":"1527274683000","body":"<div class=\"md\"><p>What you are about to read is true. I have been getting no sleep over this so I thought I would post it.</p>\n\n<p>So in April my girlfriend and I moved into a highrise apartment building and things were going well for 2 weeks, I woke up one day and I had this strange little bug on me that looked like a beetle, after more research we confirmed it was infact a bedbug. So we did what any renter would do and contacted our building manager and he got pest control in the next day. So the pest guy comes and checks out the place, keep in mind we had only found one bedbug at this point. The pest control guy had said that it was probably just one and that we brought them in from somewhere, he said to call him if we saw anymore. We actually tore through everything, even took all the power outlet covers off and couldn&#39;t find a thing.</p>\n\n<p>Now a month goes by, we find two more on our couch. So we contact the building manager and the pest guy comes in a sprays, we had to cover almost everything up and wash every single piece of clothing we have, and we had to leave for 8 hours. When we came back everything seemed good and taken care of. A day goes by and I get my flashlight and I start looking, I grabbed a plasic bag and I found maybe 8-10 dead begbugs in the corners of our apartment.</p>\n\n<p>Let&#39;s go forward to the last two weeks. We&#39;re finding lots of alive bedbugs in our bathtub and behind our toilet. There is this very bad smell coming from our building hallway. Each day that goes by it gets worse and worse. This smell I can only describe as the worst smell imaginable. Finally after a week or two of dealing with this rechet smell we notice a team of police and paramedics entering our neighbours apartment. They placed this gigantic ventilator outside in the hallway. The next day we got a knock on our door, it&#39;s the pest guy, he tells us that he has found the source of bedbugs. He told us that there was a lady nextdoor and she was eaten to the bone by bedbugs, the place is so infested with bugs he said that it is the worst case he&#39;s seen in all his 25 years working in as an exterminator. He said that the lady was eaten alive by bedbugs and what was happening was they were hungry so they were coming through the vents in our bathroom and looking for more blood. We were just told to constantly clean our bathroom, when the exterminator is done bombing the apartment with pesticides he&#39;ll be treating our apartment again. There is a whole hazmat team in the apartment right now, I&#39;m so baffled as to why someone would want to live like that. I technically slept next to a dead body for 2+ weeks! </p>\n\n<p>UPDATE:\nSo today we found a ton of bed bugs falling from our ceiling and running around in our bathtub. We did speak to someone about what was going on in the apartment. What we were told is that there was a sick old lady that was an extreme hoarder (they have been taking bins and bins of garbage out for the past three days), we were told that she fell and hit her head against her bathroom sink and was dead for 10+ days as there was no one checking up on her. There were maggots eating the body, bed bug feces all over the apartment and rotten things all around. The body was taken out yesterday, the smell is still unbearable. The exterminator came in and sprayed our vents so here&#39;s hoping we don&#39;t fins any more so we can end this nightmare! I will keep posting updates.</p>\n</div>\n","author":"IntheDarkoftheNight"}