{"rank":"87","title":"I was a Soviet Submariner","id":"8m48q2","url":"/r/nosleep/comments/8m48q2/i_was_a_soviet_submariner/","time":"1527274853000","body":"<div class=\"md\"><p>Iron coffins some called them. To us, they were the testament to our country&#39;s comittment to peace, but also a duty for the people to fulfil. Such a heavy duty fell on our town of scarcely 50 000 inhabitants. We were one of many closed cities in the former USSR, dedicated to maintaining the fleet and little else. </p>\n\n<p>As a top graduate in our local military collage, I was natrually encouraged to become a part of the undersea fleet instead of working a normal job. For a person like me, with no family in this world to speak of and whom no woman have yet taken interest to, it was a dream job. The salary was several times what I could make as a surface fleet officer, not to mention working a civilian job in my town. Spending lots of alone time was not something I minded either, it was even something I welcomed.</p>\n\n<p>Now I have not been a part of the American fleet, but I do not in any way agree with the western assesment that our training and safety standards are deficient. We were given almost half a year of preparation, crewing older surplus vessels and learning to navigate the treacherous underwater passages. A modern diesel electric from Severodvinsk even arrived to let us practice the deadly game of cat and mouse we were expected to play with the Americans during our service. </p>\n\n<p>Navigating underwater is not like flying a plane or driving a car. You cannot &quot;see&quot; at all and have to use your sonar to feel your way through like a bat flying in the dark. Neither could you use a radar, because the water absorbes the waves. If you wanted to find something, you had to listen to their sounds and home in towards them. Identifying the nature of the sound is probably the skill I was best at learning. </p>\n\n<p>I am unsure how many of you young people have played simulators such as &quot;Silent Hunter&quot;, but basically in a submarine simulation, you typically hear no sound when no contacts are present and a persistent bloop when one is. But in real life, even if you are alone under the artic ice, there are always loud sounds. If you suspect another submarine is out there, you had to try to pick apart the soundwaves on screen and match them to a signature.</p>\n\n<p>When our training was completed, we were immediately ordered on patrol. I was assigned to an attack submarine, which meant that my job was to protect our nuclear weapon carrying subs, screening for fleet formations and searching for NATO &quot;boomers&quot;, as submarines carrying nuclear missiles were called. Despite what our training has prepared us for, we were still filled with uncertainty during our first mission. </p>\n\n<p>The Alfa class submarine, which our V.K Tupolev belonged to, could sustain depths to up to 3000 ft. This was far deeper than any NATO submarine could when I was in service. The deeper you were, the harder it was to hear you. At our patrol depth of 2700 ft, we were to conduct a sweep around the outer Barents and return home. The purpose was to keep out pesky NATO attack subs from our fortified bastion and to chase off any NATO boomer audacious enough to patrol so closely to the Soviet coast. </p>\n\n<p>Now the Alfa wasn&#39;t just a deep diving boat, it was also small. The crew was some 30 men strong, all of us officers with good records from military collages and proven loyalty to the party. I was in charge of the listening instruments and sonar arrays, a task shared with my crewmate Vasily from Moscow. Our commander Petrov was obviously there because of party nepotism. Through lacking in competence, he had a good heart and was more than willing to learn. Due to our boat&#39;s diminutive size, the crew area did not provide for very pleasant rest. </p>\n\n<p>We were 5 days from harbour when Vasily woke me from my uneasy slumber. Said he caught a signature but couldn&#39;t tell what and needed an &quot;expert&quot; opinion. I scrambled myself up and drank some water from the mess before pulling over to the command room. </p>\n\n<p>He had found an unknown contact, probably a NATO submarine. It was loud. Louder than any Russian submarine we practiced against. I did not fear for my life because we were not at war, but I still remember how my heart almost jumped out of my chest when I realized that I was so close to the enemy. Vasily summoned up our visibly shaken Captain. </p>\n\n<p>A course of action was needed. The contact showed only a bearing and not depth nor range. Vasily furiously scrolled through a folder containing the signatures known to us to match the sound. Petrov refused to engage our own sonar, not wanting to risk exposure against a most likely more experienced NATO commander. After some debate, we decided to head towards the contact and gather more information. </p>\n\n<p>Aleksy, a former surface navy NGO from Warsaw who had some experience chasing off NATO surface ships came up with a brilliant idea. We would fire a decoy towards it and as we approached, guide it to almost brush against the contact. The NATO sub would not confuse the decoy for a real torpedo, but it would also understand that if this was during war, it would already have been sunk. Basically sail up and deliver a &quot;If I wanted you dead, you&#39;d be dead&quot; to the yanks. </p>\n\n<p>Most of the crew including Petrov were cheering Aleksy for his plan when I felt that something was not right. We were at 2700ft and the American Ohio could barely make 1000ft. Even the upgraded Los Angeles class rumored to exist could not. As I looked up the folder with the signatures again, my sense of wrong was amplified. </p>\n\n<p>The sound hammering in my ears was louder than a WW2 German boat - at 2700ft. Petrov&#39;s decoy was 1000 yards ahead of us when the onboard computers told us that our contact was roughly 5000 yards away and closing. </p>\n\n<p>Vasily was sure it was a new secret NATO project. If we could register it&#39;s unique signature, we would be lauded as heroes when we came home. Petrov was however loath to closing the distance, afraid of colliding with the contact or getting shot at. Aleksy stood up for Vasily. 24 crew members voted to close in and record. Petrov and some of the men afraid to defy their captain voted against. But votes didn&#39;t mean anything if Petrov decided to use his captain&#39;s command to order them into staying. </p>\n\n<p>The impasse was interrupted by a beep from the onboard computer. That beep meant that a firing solution was ready and the target was in our sights. Everyone snapped back to reality and took to action stations. </p>\n\n<p>4000 yards. </p>\n\n<p>3800 yards. </p>\n\n<p>3400 yards. </p>\n\n<p>Was he going to ram us? </p>\n\n<p>He would surely be close to our decoy now. </p>\n\n<p>It was obvious the contact had detected us, so Petrov ordered me to activate the active sonar. We would now have an exceedingly clear picture of it and be able to record it&#39;s unique signature completely. </p>\n\n<p>The sharp sound of sonar violated our ears. But there was a more sinister sound after it, the contact&#39;s unique acoustics have suddenly gone almost inaudible through my headphones... Which was when I realized, <em>I wasn&#39;t wearing my headphones</em>. We were hearing its sound through our hull and straight into our ears <em>without any listening devices</em>. </p>\n\n<p>The sonar returned the shape of whatever was coming towards us. It was larger than any submarine could possibly, feasibly, be. It was like a sea crayon given life and rushing at us at a full 30 knots. </p>\n\n<p>2400 yards. </p>\n\n<p>2200 yards. </p>\n\n<p>Our decoy was just tens of yards away from its front. The whole crew watched. A decoy might not have any explosive charge, but it was still a 5 meter long spear of steel that would fuck up anything colliding with it. </p>\n\n<p>No blast nor collision came. When the contact met the decoy, the wire broke and the decoy disappeared without a trace. Petrov did not need any more encouragement. In the same panicked breath, he ordered us to launch and arm a torpedo at the contact and turn our boat 180 degrees while firing our engines up to full speed. It was spitting distance from us. </p>\n\n<p>Our boat was half turned when the torpedo hit home. The barely audible hum from before became a daemonic screeching mixed with the sound of an underwater detonation, like a knife scraped on a glass bottle amplified a thousand times. The contact slowed down to a crawl, but was picking up speed almost as fast as it had lost it. A moment later, we were fully turned and the thing was in our baffles - we could not detect it due to our own wake. </p>\n\n<p>We kept rocketing through the cold waters at flank speed all day, scared witless from the encounter. It would become a constant topic for our crew, yet in during my next 13 years of service as a submariner until the fall, I did not hear any other such encounter nor experience any more myself. </p>\n\n<p>After the fall, I turned over a new page. I moved to America where I met my future wife Annie. Together we opened a naval memorabilia shop and bought a nice house in the suburbs with the proceeds. I was living the American dream, yet every so often I would think about the sounds in the depths and what had happened that early October morning. </p>\n\n<p>My son grew up hearing my submariner stories, so it was small wonder he decided to show me an old Soviet archive on Alfa class boats from wikileaks. To &quot;fact check&quot; as his teacher always told him to do. </p>\n\n<p>But what caught my eye wasn&#39;t the factually correct and highly detailed charts of the boat I spent 13 years of my life on. </p>\n\n<p>It was a sonar signature near the bottom of the report. </p>\n\n<p>One which sounded at 190dB and was taken 2700ft below sea. </p>\n\n<p>The label read: <strong>UNKNOWN - BIOLOGIC</strong>  </p>\n</div>\n","author":"Comrade_writer"}