{"rank":"1","title":"Labor Pains","id":"8m4a2s","url":"/r/nosleep/comments/8m4a2s/labor_pains/","time":"1527275163000","body":"<div class=\"md\"><p>You won&#39;t believe how big she&#39;s gotten. To see Rebecca&#39;s tender belly swell with our child is a joy that puts every other pleasure I&#39;ve had in my life to shame. It hasn&#39;t always been this happy. Like all couples trying to conceive in their later years, we&#39;ve had our fair share of struggle. Ten years, would you imagine? We&#39;ve been trying that long, always hoping - and even <em>praying</em> - that the nth time would be the charm. By a stroke of luck I can only attribute to good karma, this time we didn&#39;t fail. The naysayers are looking at us now, with their bellies full of food, wine and sin.</p>\n\n<p>I never gave up on Rebecca, you see. I&#39;ve been preparing for this from the moment she was born. I&#39;m not a modest man. I have no qualms with telling you how much patience it took  - and <em>love</em>. Love conquers all, we are told, right from the instant we turn our infant eyes upon our mothers. Those all-knowing deities with the power to create life, and take it away in an instant if they so chose. So that&#39;s what I did: I loved her, and every other priority in my life faded away. We were a match made in heaven. A bond so unbreakable that the devil himself would tire to sever it if he tried.</p>\n\n<p>Rebecca is grateful too - every now and then she tells me she doesn&#39;t remember a life before me. <em>It&#39;s just a grey spot in my mind</em>, she says, and she&#39;s thankful for having forgotten it. In her early days with me, she had the most terrible waking nightmares that made her claw at the chains around her legs, but I would hold her through the night and lull her softly into deep, unshakable sleep. She needed the rest. My Rebecca was always delicate. Often I would stay up beside her, fastening the clips back onto her lovely white ankles, and nursing the bruises she&#39;d inflict on her belly during the sessions. My poor, sweet Rebecca. Sometimes I think I don&#39;t deserve her gentleness.</p>\n\n<p>I have to admit that she hasn&#39;t always been this agreeable. When I took her from the playground, she protested violently and kicked me in the shins unceremoniously; she was too small to aim higher. How could I not forgive her? The tears in her big, blue eyes were too endearing to warrant punishment. As much as it hurts me to say it, I did have to discipline her sometimes. As a teenager, she was particularly brilliant with her rebellion. I still fondly regale her with these incidents. Once, she&#39;d taken all the fresh placenta I had collected (with great difficulty) from my studio and spread them across the door step (she couldn&#39;t go any further, because the sensor sewn into her arm would go off and alert my phone). Had I not come home early that day, there is no saying as to what would&#39;ve happened. Even the thought of losing her sends me into a black rage, so you can understand how angry I was with her. It took me the better part of the night to be rid of the pungent odour of the preservative fluid off my porch. Later, I took her into our playroom and taught her what it means to be a good wife. These special treatments always worked. It made her as pleasing and docile as a dog. It made her the Rebecca I know and love - the Rebecca that loves me back.</p>\n\n<p>Rebecca always knew what she was signing up for. When I set down the contract papers on her tiny, eight-year old lap, she looked at me like she had no idea what was happening. But I knew her tricks inside out, and wasn&#39;t going to fall for her machinations. I then put a crayon in her hand, and told her to sign the paper. She acted coy at first, but the excitement at the prospect of signing something - like she&#39;d seen mam and dada do - won her over. Ever since then, she has pledged her soul and undying love to me. After all these years, I still show the papers to Rebecca; especially when she needs a reminder of her allegiance to our union.</p>\n\n<p>The real test for my Rebecca came one spring morning, when I spread her as usual over the granite table and anointed her forehead with my semen. You see, I had a dream the preceding night. It was more than a dream, actually - a <em>vision</em>, if you will. I was in a dark place. It was a bottomless pit, spreading heat all over my body like a million pin pricks. I&#39;d almost resigned myself to this terrible fate, when He called my name. His voice reverberated through the blackness.</p>\n\n<p><em>Anthony, you corrupt and defile her with your virtue. Salvation is only for those whose bellies are hollow but bring forth fruit when the seed is sown. The time is nigh.</em></p>\n\n<p>Upon waking, I immediately knew what had to be done. I took the pliers, and swiftly went to work on her nubile body. She was already broken-in, and lumps of ash-coloured infection were forming in several places inside her thighs. This putrefaction was necessary to cleanse her soul. Despite having to maneuver through these areas, I didn&#39;t have to struggle with the procedure much. Rebecca screamed, but I kissed her softly and told her I needed to do this to save both of us - <em>it was divinely ordained</em>. There would be no place for me in His kingdom otherwise. After I had sufficiently opened her up, the uterus pulled on my pliers for an enraging amount of time, and gave. Rebecca was finally hollow. I was proud of her; she was as courageous as she was beautiful. She would no longer have to suffer. I made her pure, and she was now ready to feed on the fruits of her labor.</p>\n\n<p>The years that followed were spent in relative marital bliss. She never complained about the ache between her thighs, or denied me my conjugal rights even when the bruises from the previous session were still raw. When I was deep in these sacred rituals, she affectionately stroked my beard and called me her master. After a long, hard battle with herself, I was elated to see that she finally saw my vision. <em>This is the better way, baby.</em> I whispered sweet nothings to her when her body would contort and slip into a comatose state to make room for His authority. She was hollowed out for a reason, you see. He only visits those who are empty, and Rebecca is the vessel that would take us to a better tomorrow. When she came to, I made her lavish dinners and even fed her with my own hands because she&#39;d be too frail to do it herself. Once or twice, she was even moved to tears by my loving ministrations. <em>What have I done to deserve this?</em> Rebecca asked me one night, before I locked the steel cage that encircled her bed. I stroked her black hair with affection, gently reassuring her that she deserved all the love He and I gave her.</p>\n\n<p>Our story is not perfect - but with Rebecca, I know we&#39;re as perfect as it can get for each other. Ten years since He has been visiting her: ten years of fierce love, feeding her hungry womb with placenta, and constantly moving homes to evade those who would see us destroyed. Although I can feel the life weakening in my gut, Rebecca is stronger than ever. She tells me that no noble work goes unrewarded. Now, when I look at her soft belly I can barely see the scar tissue over the spidery blue stretch marks. Every time our child kicks against the walls of her hollow-womb, I can see the fruit of our labor pains. If we can do it, so can you.</p>\n\n<p>P. S. If it&#39;s a boy, we&#39;ll name him Xander. If it&#39;s a girl, she will be Lavi.</p>\n</div>\n","author":"broccoli_chan"}