{"rank":"0","title":"Under your control pt.1","id":"8m4ae5","url":"/r/nosleep/comments/8m4ae5/under_your_control_pt1/","time":"1527275232000","body":"<div class=\"md\"><p>I myself didn&#39;t do this to you. The man in the corner would whisper his ideas in my ear and I&#39;m not going to lie, they sounded very appealing. So I stood and watched as the man used me like a doll, with my skin attached to strings, making me do what I always wanted to, but never could. He said he could help me and that he knew what I really wanted. He told me if I helped him, if I could be his outlet, he would give me power, and I&#39;ve always wanted power. Now that I have what I want I will give my skin to the man in the corner and join him in the darkness.</p>\n\n<p>I never had a good bond with my family. Their game night would consist of gambling and smoking with their buddies, forgetting I even exist. And the nights we went out they would leave me in the car for hours at a time while they would get high and come back as mad as the devil. Fighting before they even made it into the car and swerving off the road with every breath that escaped their lips. I always dreamt of an outcome that would benefit my parents physically and emotionally. Having more than enough time sitting alone in the back of the car, I came up with a plan. In result of always feeling alone or forgotten, I made my own friends, they would never hurt me. Not long after making my own friends, I started to hear them. There was Leah, she always told me the right things to do. There was Trey, he was the naughty one. He would tell me that I should show my parents how I felt, since they deserve to know. There was also Damon, he was the quiet one. Damon doesn&#39;t talk to the others, he whispers things in my ears, interesting ideas.</p>\n\n<p>It was late one October night, I could hear my parents arguing just two rooms over, but nothing could distract me from my plan. &#39;It&#39;s almost time&#39; I heard a dark, raspy voice in my head say. It was Damon, we had been planning this for months and tonight was the night. My task wasn&#39;t easy, but I would do anything to make my parents stop fighting for at least three seconds. I don&#39;t intend on hurting my parents, at least not right now, but I do want them to feel the pain they make me feel every day.</p>\n\n<p>It was almost midnight when I finally left my room, I turned to walk down the hall towards the stairs but then something stopped me &#39;Go out the window&#39; Damon told me, &#39;Why?&#39; I asked &#39;Do as I say, it&#39;ll all be worth it&#39; He tells me, so I do as I was told and headed for the window at the end of the hall. I reached the window, but as I started to open it, my parents bedroom door burst open and out came my father. I had to think fast. If my dad knew I was up I would be severely punished, and that would be a waste of my time. I looked around, I grabbed the curtains and slid behind them. I knew you could see my feet, but I was willing to take the chance. I heard footsteps walking towards me.</p>\n\n<p>My dad had either saw the window slightly oened or he saw my feet. Before I knew it my dad was right in front of me, reaching out towards me. My heart was beating so fast I thought my chest was going to explode, but moments before my fathers outstretched arm reached the curtain my mom yelled “The cops are on their way!”. My dad turned around, forgetting about me, forgetting about the person behind the curtain, and bolted off towards my mother. </p>\n\n<p>As soon as the coast was clear I ran back to my room &#39;I&#39;m sorry Damon&#39; I thought, I knew he could hear me and I knew he wasn&#39;t happy. My head started to hurt and I got dizzy. This was my punishment, I made Damon mad and now I had to pay.</p>\n</div>\n","author":"Writer_of_truth"}