{"rank":"1","title":"The Owl","id":"8m4nid","url":"/r/nosleep/comments/8m4nid/the_owl/","time":"1527278294000","body":"<div class=\"md\"><p>[Ambient music is played out over the sound of crickets and forest sounds]\n[Sound fades and is softly replaced by cars honking and city sounds]</p>\n\n<p>Narrator:\nI suppose you could say that I&#39;ve never really been much of an “outdoors” person. Growing up in the city will do that to you. If I ever want to see trees, I can always take a stroll through Central Park on a Sunday afternoon when the air is warm and the sun is bright. But even then, who has the time for that? I spend most of my days surrounded by concrete walls, enveloped by conditioned air, and you know what? That&#39;s alright with me. </p>\n\n<p>My recent experience with an altogether unexplained phenomenon within the foothills of Vermont is the exact reason why I choose to stay nestled within the walls of my apartment building on the Upper East Side. Until now I&#39;ve never shared this story, partly because I felt none of my friends here would believe me, and partly because I thought if I I ignored it I could forget; while the former remains to be seen, the latter has proven to be utterly wrong. </p>\n\n<p>It all started with me having what my therapist calls an “emotional episode” at work—I prefer to call it a full-blown nervous breakdown. I&#39;m still not sure exactly what triggered me. Sure, I was under a lot of stress at the time, and still am, but I&#39;ve never quite experienced anything like that feeling when I stepped into that elevator. I felt uneasy at first. Nervous and restless. Strangely, I found myself wishing that the doors wouldn&#39;t close. I was scared of the thought of being alone in that elevator, like something bad was going to happen. Something bad did happen, of course. </p>\n\n<p>[Elevator dings] </p>\n\n<p>Before I could shake the paralyzing fear, the doors closed in together. Through the brushed stainless steel of the doors I could see my blurry reflection looking back at me.</p>\n\n<p>[heavy breathing]</p>\n\n<p>That was until the power went out and my world went black. I remember hearing this terrible sound.</p>\n\n<p>[Terrible sound builds to a loud crescendo by the end of Samuel&#39;s dialogue]</p>\n\n<p>Like a rustling of leaves mixed with a flapping of wings, and I could hear myself screaming.  </p>\n\n<p>Samuel:\n“No, no, no, NO! STOP IT! LET ME OUT! LET ME OUUUUUUUT! </p>\n\n<p>[Elevator dings]</p>\n\n<p>Samuel:\n[narrating]\nSixteen seconds. That&#39;s how long I was in the elevator for. When I got to my destination, which unfortunately was the lobby, everyone had heard my screams echoing down the elevator shaft—so that when the doors finally opened, there was a small mob of concerned onlookers who immediately rushed in to help me. I wanted to tell them about the strange incident that had just overtaken me, but I must have been rendered mute from the shock. Apparently my eyes were wide open, but I can&#39;t remember seeing anyone’s faces. I just felt their hands all over me. As soon as I regained my sight, I cried like a scared child curled up into a ball. </p>\n\n<p>My supervisor is one of the best people I&#39;ve ever worked for. When she heard about the incident, not only did she pull the footage from the elevator, she invited me into her office so that we may view it privately as soon as I returned to work after an mandatory three-day weekend. Afterward she promised she would dispose of the embarrassing footage. I told her about how when I stepped into the elevator that the power went out and I was suddenly in the dark. I told her about the noise and how deafening it became. But something wasn&#39;t right with the footage. </p>\n\n<p>Natalie: \n“It doesn&#39;t look like the power goes out at all, Sam. I checked with maintenance for any signs of a power surge, and their diagnostics came up right as rain. As for the sound, well, the only thing I can hear is you.”</p>\n\n<p>Samuel: \n“That&#39;s--..That&#39;s not right. I swear that a second after that door closed everything went dark. Look! My eyes are wide open but I&#39;m fumbling around as if I&#39;m in the dark. I don&#39;t know if this footage is altered or something..”</p>\n\n<p>Natalie:\n“Sam..”</p>\n\n<p>Samuel:\n“..but I know what I saw and I know what I heard! Do you think I&#39;m the kind of person that would lie about something like this? This has been extremely embarrassing for me.” </p>\n\n<p>Natalie: \n“No, I know you&#39;d never pull a stunt like this for fun. That&#39;s what&#39;s troubling me. How are things?</p>\n\n<p>Samuel:\n“Natalie, I don&#39;t need to be psychoanalyzed. I have a therapist who does that for me. She told me that I&#39;ve had a “emotional episode” that is directly related to stress. The feeling of being cloistered in a small space, like an elevator, can induce these feelings of panic in anyone. She thinks I should take a vacation, but where would I even go?”</p>\n\n<p>Natalie: \n“I can help you with that. Actually, I was looking to hire someone to open up our cabin in Vermont for the spring season. It just needs to be cleaned up and dewinterized a bit. Maybe chop some firewood to work some stress out of your bones. It&#39;s right on a beautiful lake and the best part is I&#39;ll pay you for your time. Seriously, take a whole week! It&#39;s good to get back to nature once and awhile. Heaven knows you can forget it exists out there when you&#39;re cooped up in the city all year round.” </p>\n\n<p>Samuel: \n[sighs] \n“I don&#39;t know, nature and I don&#39;t really mix. I live here for a reason.” </p>\n\n<p>Natalie: \n“...And you&#39;ve clearly been here too long. You gotta get some fresh air. Please, I insist. I&#39;ll have my secretary send you the address and a list of things you&#39;ll need. Consider this a personal favor you&#39;re doing for me.” </p>\n\n<p>Samuel:\n“Alright, alright, alright, just don&#39;t go telling people that you&#39;ve shipped me up-river to some cabin in the woods. They&#39;ll think you put me in some sort of asylum.”</p>\n\n<p>Natalie: \n[chuckles]\n“It&#39;ll be just between us, I swear.” </p>\n\n<p>Samuel:\n[narrating]</p>\n\n<p>It took me only four and a half hours to drive to the cabin, which was much less time than I anticipated. Though I&#39;m not sentimental about this kind of thing, the scenic views I witnessed on Vermont&#39;s interstate 89 were especially captivating. Unintentionally I had left late, and so as the sun went down I watched the sky turn from blue, to pink, to mauve, to burnt orange, with all the beauty of a Maxfield Parrish painting. I heard he had lived in this area once, and I could see his muse in the hour before dusk. </p>\n\n<p>And indeed I was in the midst of that dusk when my GPS indicated that the destination would be on my left. The road I had been on for the last mile and a half was a climbing lonesome road with no other inlets or outlets, and it ended with a small loop so that one could turn around if he&#39;d strayed down the wrong path. The road overlooked a lake that was much larger than I imagined, and in the still waters reflected  were the growing number of stars that began coming out overhead. The cabin was on the left. It must have been this building, I was sure. It was a single story wooden structure with a small porch dotted with Adirondack chairs, most showing signs of degradation, and inside the cabin everything was dark. Very dark. In fact, I noticed in the waning light just how dark everything would be soon. There were no streetlamps, no other buildings, and the tall pine trees were sure to catch nearly all the light from the moon and stars. I remember really hoping that the power was on in the cabin so that I might get out of the darkness as soon as possible.  </p>\n\n<p>I busied myself that first evening with building a fire in the stove and listening to tinkling of ice in my glass of Jameson. Cell service was available, but not 4G and so I accepted that a late night movie on my phone was out of the question. I dragged a bed from one of the rooms adjacent to the living room where the stove was positioned, and decided that I would sleep here unless it warmed up later in the week. It was cold, as the last dregs of arctic air raged against the coming spring. I finished my drink and soon was in bed. Somewhere on the lake I heard the sound of loons, which until tonight I&#39;d only heard in movies. For a moment, I thought I might actually enjoy this. </p>\n\n<p>I woke up at some point before dawn. There was a sound that stood out against the cacophony of forest sounds like a moose in Times Square.  It shouldn&#39;t have, though. It was the sound of an owl. </p>\n\n<p>[Owl Hoots, but something is off] </p>\n\n<p>This sound shouldn&#39;t have stuck out to my ears, knowing full well that owls are among the fauna that live in these wooded hillsides. However, there was something about that noise that woke me up from a dead sleep, made my skin erupt into goosebumps, and kept my eyes open until dawn. </p>\n\n<p>[Morning Songbirds]</p>\n\n<p>The cabin really was a mess. There were spots in the ceiling that the snowmelt had permeated and pooled onto the floorboards, discoloring the wood. There was the typical spattering of dust and cobwebs to be cleaned, as well as a large amount of very dry wood that needed to be cut from whole rounds to familiar firewood form. I wondered if Natalie had arranged to have this wood delivered before I arrived so I&#39;d have a pragmatic form of stress relief waiting for me. I spent a large part of the morning pensively chopping wood, breaking the monotony with a ham and cheese sandwich and frequent gazes over the lake. I had brought a good deal of supplies, mostly going off of a list Natalie gave me. Most were things that were easily cooked on an iron wood stove or on a stick over the fire. Hotdogs, marshmallows, eggs, bacon, and ice—lots of ice. I brought a couple bottles of Jameson and a four-pack of some hop-heavy local ale. </p>\n\n<p>I spent much of that first day busing myself with tedious fretwork. As the sun began to dip below the treeline a sudden chill in the air drove me inside by the stove. The wind had picked up considerably and I could hear its high pitched whistling through the drafty cabin. I&#39;ve never been one to fall asleep early, usually lying down sometime around 1am, but I felt the effects of that strong Vermont ale and decided to give the whole, “early to Bed, early to rise,” idea a try. </p>\n\n<p>I had hardly closed my eyes when I heard that noise again. It was the owl from the night before, that strange sounding owl. My bleary eyes opened and searched for my phone. It was 3am. A little too “early to rise.” I rolled over and buried my head beneath the pillow, hoping to drown out the noise. It was too late for that, as all my attention was fixated on that damn owl&#39;s hooting. </p>\n\n<p>Finally I couldn&#39;t take it anymore. I stumbled out of bed loudly and shuffled my way to the front door. I languorously pulled the door wide and walked out onto the porch, but it was too dark. I fumbled with my phone to turn on the flashlight and soon my torch was lit. I scanned the treeline. That was the first time I saw it. Directly in front of me, not more than thirty feet away on the high branch of a dead oak, was the owl. It was larger than I thought an owl should be, though I&#39;d never seen one in person before, and the white markings on its face only made the sunken pits of its eyes that much darker. When they caught the light from my phone just right, the eyes themselves became luminous. The wind was very cold now, and I realized I didn&#39;t know what to do to scare this visitor off. Do I shout at it, or find some rock to throw? All the while I was pondering this, the owl never moved its gaze from me. It stood frozen against the backdrop of slow moving clouds in the late hours of the half-moon night. I raised my hand over my head, somewhat drunkenly, and shouted. </p>\n\n<p>Samuel: \n“RRRRARGHHH! Get out of here!”</p>\n\n<p>Samuel: \n[narrating]</p>\n\n<p>No use. It simply remained perched on that dead branch, never taking its eyes off of me. I was beginning to feel a bit sick to my stomach. Slowly I turned my back on the thing and closed the door. The nausea was overwhelming and I soon found myself retching in front of the toilet; dry heaves and nothing more. In the moments between the laborious breathing, I was sure I heard the owl start up again. </p>\n\n<p>[Morning Songbirds]</p>\n\n<p>I slept in that morning. I didn&#39;t make it out of bed until almost noon, and when I did I was hungover. My head throbbed with a dull ache and there was a sourness in my stomach that kept me inside most of the day. It was strange to me. Had I really drank that much last night? I didn&#39;t think so. Sure, I drank the entire four pack of that heavy ale but that wouldn&#39;t have rendered me as useless as I felt, even with being 8%. The whole thing was starting to make me feel anxious. Images of that owl&#39;s white face fluttered in and out of my mind. I could see its face with frightening clarity: tawny markings about the pits of its eyes like ripples in a alabaster pool. The hours seemed to fly by. I pulled one of the Adirondack chairs inside and positioned it in front of a window where I could watch the sun go down. I found myself feeling increasingly subdued as I stared, unblinking and slack-jawed, at the vanishing orb of light slipping below the horizon.</p>\n\n<p>I had made a point to not drink all day or at night. I needed a clear head in case that owl came back again. I wasn&#39;t sure what I would, or even could, do. I had no gun or air-horn to scare it off. There were a few broken bits of stone and mortar in the fireplace, and so I gathered them and placed them on the nightstand like they were bullets to a revolver I kept underneath my pillow. I felt very foolish, like a child preparing for the attack of some imaginative monster in his closet that only comes out at night. \nI had some difficulty getting to sleep. Besides the fact I was dead sober, I had spent most of the day in  hungover repose; I felt full of unspent energy.  A couple times I had gotten up and walked onto the porch to listen: I didn&#39;t hear anything at all. I took some time to close all the curtains, lock the door, and stoke the fire in the stove. I fell asleep somewhere around two. </p>\n\n<p>But an hour later I was jolted out of bed by the familiar noise. </p>\n\n<p>[owl hoots strangely]</p>\n\n<p>I sprung out of bed with great anticipation. In a flash I had grabbed a rock and my phone. I listened for the noise. It had sounded far off, but all was quiet now. I paced the room like a stalking tiger, phones radiant beam in one hand and a rock held high in the other. There was no more noise. Frustrated and wide awake, I cursed under my breath and lowered the phone and rock. I walked back to bed, but just before I sat down I heard a new noise—a terrifying noise. </p>\n\n<p>[THUNK]</p>\n\n<p>The sound had come straight from the window in front of the chair! I wheeled around and shone the beam at the window, but the dark and opaque curtains caught the light. There was no more sounds coming from the window at all. I couldn&#39;t see what was on the other side, but I felt my skin grow hot and prickle with sweat. My mouth went dry as my breathing became quick and shallow. I moved toward the window as I slowly brought the rock up in a throwing position. I paused at the curtain, dumbfounded and terrified. I had to see what that noise was. I drew in a deep breath and exhaled sharply before extending my hand, the one holding the phone, to the curtain. I grasped it with two fingers and quickly flung it aside. I shined the light at the window, and let out an involuntary scream.</p>\n\n<p>It was so large it nearly blocked the background. The owl was perched directly on the empty flowerbox outside the window, and its head was craned and bent. It was staring at me with its rippled eyes. I staggered backwards and fell into the chair. My sudden collapse into the chair must have agitated it because it quickly swung its head in a low arc before it cried out. </p>\n\n<p>[Owl does a single, drawn out hoot. There is the sound of broken glass.]</p>\n\n<p>Without thinking I hurled the rock at the ghastly thing in the window. My throwing motion caused me to drop my phone and I quickly sunk to the floor to find it. I picked it up and scanned its beam back at the now broken window: Only darkness. It was gone. For a moment I thought I may have hit it. Perhaps it was stunned on the ground right outside my now breached cabin. I timidly poked my head out of the hole in the window and looked down: Nothing but broken glass, but in the distance I heard the droning echo of hooting as the sound flew farther and farther into the woods. </p>\n\n<p>[Fading hoots]</p>\n\n<p>That incident at the window had rendered me completely useless the next day. I swept up the glass on the floor, though the majority had landed outside. It took some time to pick up the pieces that were nestled in the grass and hard to find. Inevitably I cut the tip of one of my fingers as I raked the grass looking for more shards. I stared blankly at the slow pooling of blood there, and slowly tipped my finger upside-down and watched a couple drops fall into the dirt. I had to jar myself out of this unconscious state after a few minutes to go get a band aid. I was glad that Natalie had put FIRST AID KIT at the top of my list of supplies to bring.</p>\n\n<p>Whether it was due to lack of quality sleep or simply shock at the strange events that had been occurring, it felt so easy to dissociate from my surroundings. If I stared at the same object for more than a moment, I could feel the tension in my face alleviate and my jaw hang open. I couldn&#39;t stop thinking about the owl and how it seemed on the three previous nights to have started its strange noise-making around 3:00am. There was a part of me, the sensible part I think, that thought I should pack up and leave. Unfortunately, having something of a scientists curiosity about the thing, I resolved myself to stay one more evening to test my strange theory: I set my alarm for 3:00am and aimed to be prepared to defend myself in case I was right. There was an extra set of bedsheets that I used to cover the broken window using a few small tacks I found already stuck in the wall. In the waning hours before dark I walked the edge of the woods in search of a long stick I could fashion into a spear. The idea of   creating such a primitive weapon out here in the Vermont boonies would have made me laugh a week prior, but things had changed since then and I set about this task with keen resolution. </p>\n\n<p>It was very hard to fall asleep that night. There was an odd stillness in the air. Again, the surrounding forest was shrouded in silence. Not a chirp from a lonely cricket could even be heard, and the only sound from inside the cabin was the muted crackle of the fire churning in the stove. Once in the night I rolled over to double-check I had set the alarm properly, and having satisfied my curiosity, I closed my eyes and finally got some rest. </p>\n\n<p>Have you ever experienced the odd sensation of waking a mere moment before your alarm goes off? Your mind silently arouses from its slumber and small tingles of anticipation drip down your spine. I remember being a child when my alarm clock was my mother in her breakfast apron, and despite not hearing the muffled footfalls of her moccasined feet, somehow I would know the exact moment she was going to open my door. The tingling in my spine would tell me. I used to sit straight up in bed before she came in, so as to shock her with my wakefulness. The second she came into the room I would fling open my eyes. </p>\n\n<p>I felt the tingling again. It started at the nape of my neck and electrically moved down to my tailbone. I noticed something odd right away: Through closed lids I could tell that the lights were on. The brightness of the room seeped into my veiled eyes. I gulped as quietly as I could, slowly positioning my hand closer to the nightstand where my crude spear had been leaning. I took one last hushed breath before I opened my eyes. The horror I felt as I saw what I am about to describe still keeps me awake at all hours of the night. The images I saw flash through my mind like the pictures of an old orange picture viewer pressed rapidly. Even now I feel wet tears stinging my eyes as I attempt to tell you what I saw. </p>\n\n<p>When I opened my eyes I saw them. All of them. On top of every surface, every broken chair, all the furniture, every box and board and shelf and sill, there were owls. They would have been impossible to count in my state of disbelief, but there must have been dozens. It only took a moment for me to realize that every single one of them was the same: Tawny bodies with rippled white faces and eyes like tar. I reached for the spear but it was gone. There on the nightstand, a mere foot-and-a-half away from me, was an owl. No, the owl. I recoiled and pressed my back into the wall as my eyes jumped between the intruders with the wildness of a frenzied dog. It was then that the alarm went off. Its cheerful tone filled the room, and at once all the owls seemed to raise themselves up a few inches. I wanted to turn off the alarm, but my phone was lying in front of that owl, the leader, who too had grown in size and shape in response to the blithesome tone. Then, all at once, the owls drew themselves to their highest shape and hooted—and when they did, a slimy film of lids slid over the blackness of their eyes. </p>\n\n<p>[Cacophony of Hoots and flapping]</p>\n\n<p>I ran. I ran as fast as I could. I jumped out of bed and ran towards the door. All at once the owls took flight in the small cabin. I could feel the rush of air from their flapping and they were hitting me with their wings and bodies. It was pandemonium. I shielded my eyes with my forearms as I fought my way to the door. I caught a glimpse of the sheet I hung over the broken window: It had a large slice down the middle of it and was flowing with the current of air. I crashed into the door and grabbed my keys from where they hung on the wall. I threw open the door and ran out into the night, making a break for my car. I was sure they were coming after me. I had to hurry. I fumbled with the keys before unlocking my car. I quickly fell onto the driver&#39;s seat and slammed shut the door behind me. With a satisfying click I locked the doors and fired up the engine. When the headlights came on things only got stranger. </p>\n\n<p>I immediately noticed that through the trees there were lights in the sky that I didn&#39;t recognize. I thought they were far too bright to be distant stars, and the partial concealment from the trees made it impossible to tell how near or far those still lights were. I also noticed that the owls were no where to be seen. I left the door to the cabin wide open, but looking into the illuminated room there was nothing. It was empty. I did notice something peculiar and, well, unsettling to say the least. There, standing just outside the broken window, was a figure. Despite the lights partially shining on it, it seemed to be a shadowy silhouette of an extremely tall humanoid shape. It appeared to have its arm outstretched. A very long forefinger, bent in an grotesque claw-like manner, was pointed at the cabin. I stared at it a moment, but when it slowly turned its head in my direction I could see great dark pits where the eyes should be. That was it. I had had enough of this cabin, of the owls, of Vermont. I quickly backed my car up and turned around. I sped away from the cabin with blatant disregard for such trivialities as speed limits, and when I looked in my rear view mirror I could see the figure was gone; I thought it must have slipped away into the darkened timbers.</p>\n\n<p>I drove all night. I was heading back home to New York. To all the stuff I left behind in the cabin, I said to hell with it. The owls can have that stuff. The food, the whiskey, the clothes—I even left my phone behind. I would get a new one when I reached the city. I wanted nothing to remind me of this terrifying ordeal. While I was driving, I spent a good deal of time questioning my sanity. What did this all mean? Were those hallucinations? Does that explain how the owls and the silhouette managed to disappear? Or why I saw those strange lights above the cabin? I shook the idea out of my head. I wasn&#39;t crazy. I know what I saw and I know what I heard. But people would never believe me. I&#39;d have to explain to Natalie why I left so early, and apologize for the mess I left behind. I remember the way she looked at me as we watched the footage from my breakdown in the elevator—supportive and concerned, but skeptical. I decided I would tell her there was a family emergency I needed to attend to, which is why I left the cabin in such a hurried fashion. Yes. She would believe that. </p>\n\n<p>I&#39;ve been back in the city a couple weeks now. I feel relieved to be within the safety of my tall apartment building, and the familiar city noises have brought the return of meaningful sleep. Natalie tells me she&#39;s hiring someone to fix the window in the cabin—I told her that it was broken when I arrived—and to finish tidying up the old place before summer hits its stride. She invited me to spend a weekend there this summer with her and some friends but I politely declined, hoping the prickling sweat on my forehead wouldn&#39;t convey my fright. I did work up the courage to ask her if she had heard any owls previously but to my surprise she said no, just the eerie noises the loons make near dawn. Why, she asked. No reason, I said. </p>\n\n<p>You may be wondering why I bring all this up. Why I bothered typing these pages and leaving them on my kitchen counter. I did it so that they could be easily found in the event of my, well, disappearance. You see, I&#39;ve been getting the odd feelings again. The tingling sensation and familiar nausea. I think it&#39;s coming for me, here, in the city. Call it intuition, call it speculation, call it whatever you want: I&#39;ve been waking up at 3am again. There are no sounds, but I can&#39;t fall back to sleep. I think it found me. I don&#39;t know how. Today I found further evidence to support that claim: When I opened the door to leave for work today, there was something on the ground. The hallway was empty, clean, except for this one object. It was an odd looking oval of gray and brown, with small bits of white jutting out. I knelt down and picked it up. It was soft, and felt like a clump of hair and feathers. I then noticed that the bits of white were, in fact, bones. Small bones. I slowly bent and broke open the object and something fell out onto the floor. I leaned forward to get a closer look. Somehow I knew at once what it was: It was skull. The skull of a bird—and, based on the size and shape of it, I guessed it was a pigeon. </p>\n\n<p>[END]</p>\n</div>\n","author":"casullivan"}