{"rank":"4","title":"Lamprey","id":"8m4qlx","url":"/r/nosleep/comments/8m4qlx/lamprey/","time":"1527279011000","body":"<div class=\"md\"><p><a href=\"https://www.reddit.com/r/nosleep/comments/8i2d4z/taxi_cab_confession/\">Taxi Cab Confession</a></p>\n\n<p><a href=\"https://www.reddit.com/r/nosleep/comments/8kmn0l/the_phantom_headlights/\">The Phantom Headlights</a></p>\n\n<hr/>\n\n<p>I don’t sleep most nights. Four hours every couple of nights is fine. Staying up doesn’t bother me much though. I was an MP in the Marines, so I was used to long nights of driving around. After I got out I figured I might as well get paid for it.</p>\n\n<p>Two years ago, I got stabbed in the stomach by a junkie looking for quick cash. I was stupid and tried to wrestle the knife away from him. Turns out I was little rustier in defensive tactics than I thought. The junkie took my wallet and left me to die with my intestines hanging out.</p>\n\n<p>Somehow, someway I managed to drive myself to the E.R. I vaguely remember collapsing just outside the front door. The doctor told me that I had died for a minute and forty-six seconds on the operating table. It took me a few months to recover, but before long I was back on the road.</p>\n\n<p>Something changed after I died though. I started seeing things, strange things. I’m not sure how to explain it. Its as if my Third Eye opened. I see ghosts, ghouls, and monsters of all sorts roaming the streets at night.</p>\n\n<p>I thought I’d share another one with you all.</p>\n\n<hr/>\n\n<p><strong>Lamprey</strong></p>\n\n<p><strong><em>Midnight, Friday.</em></strong></p>\n\n<p>I stared into my black coffee, which was growing cold by the minute, while ignoring the other cabbies chatting idly around me. We were sat in at a large table at a cheap diner; deep in the heart of Philly. Just two weeks prior we were warned about an increase in missing cabbies. Donny was the latest to go missing, and the only one to be found thus far. </p>\n\n<p>Donny was an older cabbie, and while we weren’t friends I was still invited to his funeral. Everyone who drove cabs for the company was invited. It would’ve been rude not to go. It was a closed casket service. His wife told us it was because he had a strange wound on his head and suffered from massive brain trauma. I didn’t ask any more questions.</p>\n\n<p>“What do you think coulda done it Charlie?” Leonard, an older black cabbie (and token Patriarch figure to this group of misfits), asked. I found myself snapped back into the real world. I looked up from the porcelain mug to see the other drivers waiting for my response. The worst part about being quiet is that people expect you to know things. </p>\n\n<p>“Done what?” I replied, only slightly wishing that I had been paying more attention. I was ready to get back onto the road and leave these guys behind. There was good money to be made when the bars closed.</p>\n\n<p>“We were speculating about what coulda stirred Donny’s brains. Don’t you pay any attention, freak?” Ricky, a hotheaded driver around my age, interrupted Leonard before he could even speak up. “Or were you too busy seeing ghosts in your mug?”\nBack in the day I might’ve started something, but in my “old” age I calmed down quite a bit. Instead of acknowledging the asshole, I spoke to the group. </p>\n\n<p>“I’m guessing he got mugged and beaten to death. Probably picked up the wrong crackhead,” I speculated tamely. Lord knows these guys don’t want to hear what I really thought. The last time I confided in another driver he tried to have me committed. Now he just calls me freak from across the table.</p>\n\n<p>“Nah, Brady said he got a look at the body,” Leonard spoke up. “Said it didn’t look like any mugging he had ever seen. Said there was a perfectly round hole in his skull the size of a baseball on his forehead.” </p>\n\n<p>“Its true man, I even took a picture,” Brady reached into his pocket to pull out a flip-up phone. He spent a few minutes trying to find the photos in his relic. “Tell me that your average addict can do that.  That’s a surgery hole if I’ve ever seen one,” He passed the phone around the table. </p>\n\n<p>One by one we all got a look at a blurry, heavily pixelated picture.  I couldn’t make out much except for hair, and a dark hole where skull should’ve been.  </p>\n\n<p>“Brady, I’m trying to fuckin’ eat not stare into someone’s brain-hole,” Jose chimed in with a mouth full of eggs.  He ripped the phone from my hands. “Jesus. Couldn’t get a better picture?” </p>\n\n<p>“I didn’t see you lifting up no casket to get one,” Brady replied with a smirk. He took the phone back and put it away as I took a sip from my coffee. It had gone ice cold during the incessant bickering. I spit the mud-water back into the mug. I pulled out my wallet and laid down a fiver, more than enough for the single cup of coffee. </p>\n\n<p>“Time’s awastin’ boys. I gotta get back on the road,” I said as I stood up from the table. The rest seemed to follow in suit. Before long we were all making our way out of the diner. Parking is a bitch in downtown, even at midnight, so we all went our separate ways back to our cabs.</p>\n\n<p>“Hey Charlie, hold up a minute!” Leonard called towards me. He came running at a slight jog just as I was crossing the street. I sighed and stopped. Leonard was a nice enough guy, but I had my fill of extended human interaction at the table.</p>\n\n<p>“Yeah?” Was all I offered to him as I stuffed my hands into my army jacket pockets. When Leonard finally caught up he was almost out of breath. “Jesus Leo, you ran like ten feet.”</p>\n\n<p>“I know I know,” He wheezed back at me. I gave him a moment to catch his breath before he started speaking again. “Look my dude. I know you don’t like us other drivers, but we’ve got to stick together.” I scoffed and started again. Unfortunately, Leonard followed.</p>\n\n<p>“Something is out there, I can feel it in my bones. I had the same feeling back when Son of Sam was shooting those co-eds in while I was driving cabs in New York.” I began to walk faster but he insisted on keeping up. “Ricky tells me you’re a magnet for this shit.”</p>\n\n<p>I stopped dead in my tracks.</p>\n\n<p>“What else did he tell you?” I asked after I turned to face him.\n“That don’t matter man, I just want you to be careful. You remind me of my son…He was in the Marines too,” Leonard grew quiet before looking down at his feet. A feeling of guilt began to wash over me like an ice-cold bath. “Look, just be careful.” Without speaking another word, he turned and walked away.</p>\n\n<hr/>\n\n<p>Three A.M.</p>\n\n<p>The drunks had all gone home, and I was getting ready to turn in for the night. There wasn’t much point in getting caught in the morning rush that always swamped the city in the morning. I made my way north, back towards my apartment on the 611. </p>\n\n<p>As I was driving up the dimly lit street, I saw a well-dressed man in a three-piece suit standing on the street corner. On his face he wore a surgical mask, which wasn’t unusual. People wear those masks to avoid getting the flu around these parts.</p>\n\n<p>His black hair was kept fairly short and neatly combed. With him he carried a briefcase. He hailed me as I approached. The man seemed harmless enough, so I sighed and pulled over. One more fare couldn’t hurt. </p>\n\n<p>I never lock my doors, so he got in the backseat quickly.  </p>\n\n<p>“How you doin’?” I asked lazily. He didn’t reply, he only sat the brief case on his lap. He clicked it open and began to dig around inside. Most fares don’t chat, and I was fine with that. I adjusted the rear view mirror to get a better look at the man. His skin was a sickly pale, and he was thinner than I realized. I remember thinking that he might’ve been someone with HIV or AIDS.</p>\n\n<p>“Redding Terminal Market,” His voice was unremarkable and slightly muffled by the mask. The man closed his brief case. I saw that he had put on a bib and was beginning to put on rubber gloves. My internal weird meter was rising, and the passenger wasn’t helping. I briefly considered reaching for the illegally owned .38 in the glove box.\n“Tell me something,” The man began to speak again. “What is the strangest thing you’ve ever seen in your cab?”</p>\n\n<p>“You don’t even wanna know,” I replied with a slight chuckle. “I guess a guy blowing his brains out in the backseat doesn’t happen every day.” I watched as the passenger was slightly taken aback, but quickly recovered. There was a look of disgust on his face like I had offended him. The hair on the back of my neck stood up, and I knew just what was riding in the backseat. </p>\n\n<p>The man began to take off his surgical mask. I’ve seen a lot of weird things, as you all know, but I’ve never seen anything like this. I nearly froze as I watched the man reveal his true form.\nThe man had a gaping hole where his mouth should’ve been. He had rows and rows of sharp teeth that seemed to go all the way down his throat. It was if someone photo-shopped a lamprey’s mouth over his own. </p>\n\n<p>What looked like a tongue, complete with 4 razor sharp teeth and another gaping hole, began to raise out of the back of his throat. I knew that if I didn’t move that I was about to become another statistic. </p>\n\n<p>The man let out an inhuman screech. Without hesitation I opened the unlocked driver door and rolled out of the cab; just as the tongue shot out of his mouth and into the windshield. Right where my head had been.</p>\n\n<p>In the Marines they taught us how to fall with style, but they never taught falling out of a moving car onto concrete. I found myself laying in the street with more than a few scrapes.</p>\n\n<p>I sat up and watched the car swerve down the road and into a light pole. I recovered and made my way back to the car. From the back glass I could see the man flailing wildly. I cursed at myself for not pulling out the .38 earlier. If cops found it, I would probably be arrested and get fired for sure. </p>\n\n<p>When I got up to the car I saw that the monstrous tongue’s teeth had punctured the windshield completely and was stuck. The man desperately whined as he pulled at his tongue, but it was lodged. This was my only chance to recover the .38 sitting in the glove-box.</p>\n\n<p>I made my way over to the passenger side, not wanting to get any closer to the tongue than I had to. I found that the door was jammed from the accident, and the only way back into the car was through the open driver door.\nThat meant going under the lodged tongue. </p>\n\n<p>I ignored the face sucker’s inhuman wails as I walked over. Inside the cab the tongue was whipping around without rhyme or reason. With only a slight hint of hesitation I climbed back into the car. I laid across both seats, with the center console stabbing into my gut as I struggled to open the glove box. It was the one thing I kept locked on slow nights.</p>\n\n<p>I heard glass beginning to crack and glanced up. The windshield was splintering and before long the tongue would be free. The man screeched as glass fragments began to stab into his tongue. A blackish blood began to drip onto the dashboard below. </p>\n\n<p>Once I got the glove box open I found the tiny pistol. I got out of the cab as quickly as I could. The tongue was still being held, but I didn’t have much time. I began to run limp from the car. I heard the windshield finally give behind me.</p>\n\n<p>Before I could even turn around, I found the tongue wrapped around my ankle. The teeth dug into my ankle and I collapsed as its gripped got tighter. The .38 fell out of my grasp and clattered onto the street. I rolled over on my back and saw the creature standing there just outside the cab. Its disgustingly long tongue was retracting back into the jagged hell from which it came. </p>\n\n<p>I rolled over onto my stomach desperately grabbed at the .38 as the tongue retraction picked up speed. It had almost gotten away from me, but I found it secure it my grip. Once more I rolled over and began to fire blindly towards the creature.</p>\n\n<p>It let out another screech as one of the bullets struck the tongue, severing it into two pieces. The remaining bit of tongue retracted completely, and there was only a gaping maul of teeth.</p>\n\n<p>The monstrosity turned and darted away into the nearby alley. The missing portion of the creature was still rapped around my leg, so gingerly removed it. The teeth had sunk in deep, but I felt no pain at all. In fact, it had felt almost like I had a dose of morphine running through my system.  I watched the remains of the tongue turn into the same black substance that had leaked onto my dash. </p>\n\n<p>Somehow I managed to get back into my cab and pull it into a parking space before passing out. </p>\n\n<hr/>\n\n<p>“Detective, he’s coming to,” A disembodied voice was gentle through the haziness that was my mind. I could hear rhythmic beating of a heart-rate monitor. I opened my eyes to see that I was in a hospital bed, and that a nurse was standing over my body. I attempted to sit up but found myself handcuffed to the frame. The monitor began to beep faster and faster.</p>\n\n<p>The nurse began to push me back into the bed.</p>\n\n<p>“Easy now, you need to relax,” She cooed softly and somehow put me at ease. I laid back into bed and stared up into the ceiling.</p>\n\n<p>“How long have I been here?” I asked. My head was still spinning and my lips chapped.</p>\n\n<p>“You’ve been in a coma for two days. A SEPTA Officer found you high as a kite in your cab, with enough narcotics in your system to put down a small dog,” She replied as she rested a hand on my chest. “Now this officer has some questions for you.” The nurse motioned towards a fat man in a cheap brown suit sitting in my room. “If you need me officer, I’ll be just outside.” She left the room without saying another word.</p>\n\n<p>The fat man sighed and stood up before making his way to my bedside. </p>\n\n<p>“Mr. McCay, I’m Detective Winston and I’ve got some questions for you.” His voice was gravely and sounded like he smoked one too many cigarettes. I let out a sigh to match the detective’s. He didn’t seem to appreciate the gesture. </p>\n\n<p>“Is this about the .38? I’ve got a permit for that in Texas, I just haven’t registered it here yet,” I spat out. It wouldn’t be the first time I got in trouble for keeping a gun, so I knew he would see right through it. </p>\n\n<p>“Ha! Look, I don’t give a damn about some unregistered peashooter you keep. That gun is the least of your worries now.”</p>\n\n<p>“So, what is it then? The crash?” I asked, thoroughly confused now.</p>\n\n<p>“Guess again.” He chuckled.</p>\n\n<p>“Look officer.” </p>\n\n<p>“Detective.” He spat out.</p>\n\n<p>“Look Detective, I have no idea what this about sooooo you’re gonna have to shed some light for me,” I finally managed to get out.</p>\n\n<p>“I wanted to ask about Leonard Rothchild,” He spoke shortly, as expecting me to fill in the blanks. </p>\n\n<p>“What about Leo?” I retorted, slightly relieved about the gun. \n“He was found dead around two blocks from where we found you. Perfect hole in his head, with most of his brains scooped out,” The detective answered. “I did some digging and saw that your name pops up a lot in our data base. Mostly when people wind up dead. Got anything to say about that?”</p>\n\n<p>“God <em>damnit</em>.”</p>\n\n<hr/>\n\n<p><a href=\"https://www.facebook.com/TheR.W.Rawls\">R.W. Rawls</a></p>\n</div>\n","author":"CriticalMarine"}