{"rank":"23","title":"The neighbor's son talks about a \"Watcher\" in the woods","id":"8m4zze","url":"/r/nosleep/comments/8m4zze/the_neighbors_son_talks_about_a_watcher_in_the/","time":"1527281211000","body":"<div class=\"md\"><p>I loved my Grandma on my Mom’s side. She’d worked at a grocery store chain nearly all her life, and so did Grandpa. They got along well and enrolled in the local Credit Union. After they both retired, they lived off a government check each month of about $1k, likely through Medicaid.</p>\n\n<p>My Grandma was resourceful, always finding ways to squeeze in every last drop of that check, often on her essential utilities, such as cable and power. We had a sort of “I scratch your back, we pay the phone bill” type of deal with her. The highlights of my childhood and teenage years were going up to their summer and winter home up in the mountains of Eastern North Carolina, in a sleepy little mountain town named Otto.</p>\n\n<p>It was a quiet little place, bordered by Franklin further up north and Clayton down in the south, which was where we’d cross often into Georgia. Otto had everything, from big valleys off the side of Highway 441 and rolling hills, like something out of The Sound of Music. There was a nice little flea market sandwiched in between Clayton and Otto where I’d go from time to time, hoping to find some neat collectible or antique.</p>\n\n<p>A fond memory of my childhood time there was a WWII vet who always smoked a pipe, and he always had German medals to sell, but they were a bit overpriced at $50 a pop. WWII relics from Germany creeped me out anyway, so I just gave him a nice smile oftentimes and thanked him for his service. But then one day he just disappeared, along with his trove of militaria. I assumed he died, but I guess I’ll never know.</p>\n\n<p>When I got older and my grandparents passed away, it came as a shock when they bequeathed their home in Otto to me. They’d bought it in the 80s and it was of typical 70s style. Shag-ish carpeting in all rooms but the kitchen and bathroom, and some sort of plastic material covering the outer walls, in baby blue color. Vinyl? I dunno. In the will it just stated “Keep good care of it, son. Like we always have.”</p>\n\n<p>I sure wasn’t one to abandon my grandma and grandpa’s wishes, so I’d continue the tradition of going up there during the summer and winter, but moreso during the winter, as I liked the cold. I became good friends with my neighbors (yes, you can still have neighbors up on a mountain) and we regularly came into each others homes for dinner or just to talk.</p>\n\n<p>During the winter it’d always snow around a couple feet, which wasn’t bad. Shoveling the rock driveway was always great exercise. Things were peaceful. Well, except for one thing. Whenever I’d go over to the neighbors to the right of the house their son would always try to get into an old abandoned house just a short walk off the right side of their driveway. And driveway being a dirt road.</p>\n\n<p>I’d known that kid since he was a little squirt, and no matter how old he got, he still tried to get into that house. He succeeded several times, but his parents always would scold him, often having shouting matches of which I could hear all the way from my house. I don’t know why they insisted he stay away. Parental spider senses, maybe. The house was built in the 70s, as was my grandparents.</p>\n\n<p>But the father of the family that lived in the abandoned house died of a heart attack within the home and they moved out soon after. This of course was way before I was born, so I never had the chance to even know who they were. Even when Grandma told me about them their lives are lost to my memory.</p>\n\n<p>Finally one winter I had gotten curious enough. It was a week before Christmas and I’d spent another dinner over at their house. Ah, I forgot to mention how it looked. Previously it was in rough shape years back, but they fixed it up. A nice A-Frame style on stilts, styled like a barnhouse, just not red.</p>\n\n<p>Now that I was an adult, the kid wasn’t falling far behind me. He must’ve been 16, 17 that year. Me and him were in the living room and his parents darted off into the kitchen to clean up, giving me the perfect chance to ask him. I pull him aside, asking “Why do you keep trying to get into that house? Thirst for adventure? Some lost treasure down in the basement?”</p>\n\n<p>His answer was neither of those. Instead, he just looked at me through his glasses and said “A shadow man lives there. He talks to me, tells me about his family. Mom and Dad say he’s a demon, but I call him the Watcher. Sometimes he goes through the forest down at your embankment at night.” I couldn’t cough up any words in rebuttal, my face growing pale. Shadow man? He’s gotta be fucking with me. I mean he is of the pranking age.</p>\n\n<p>I shrugged it off and sipped some spiked eggnog near the fireplace. When dinner was finished, I wished them good night, grabbed my coat, and headed outside. I walked off their deck and began feeling the snow beneath my feet. I headed left towards a small cut in the treeline between our houses towards my grandparents.</p>\n\n<p>I was halfway through the frozen bramble when I swore I heard another faint set of footsteps through the mountain wind. I glanced behind me and just saw their house still lit up as always, their shadows darting past the windows with what seemed like plates in hand. I kept on walking back home.</p>\n\n<p>When I got to the porch, I decided I still wasn’t tired, despite it being around 9:00 and dropped my boots at the door, hanging my coat on the rack when I went in. Going to the kitchen, I felt like having a bit of cocoa, so mixed some powder and nuked it in the microwave for about 2 minutes. Curious as to whether or not the kid was bullshitting me or not, I grabbed an old pair of binocs that belonged to my grandfather that was sitting in a nightstand near the recliner.</p>\n\n<p>Flicking the porch lights on I put my coat back on but kept my shoes off, as it was only just for a couple minutes. I scanned the forest off the small embankment and only saw just the faint outlines of the first row of trees, the rest being consumed by darkness. Finally realizing that the kid was just dicking around I was about to go back in for some well deserved cocoa when I saw very faintly what seemed like a portion of the darkness move.</p>\n\n<p>He wasn’t lying. My damn hands were shaking as I watched what I could only describe as what looked like a slightly misshapen shadow walk—no, glide more like it, across the forest in a straight line. It looked like a person, but it wasn’t… Cohesive. More like a blob. I shut the fucking door and ran into the kitchen for the cocoa, which was long done. I decided to head straight for bed and drink it in my room.</p>\n\n<p>When I awoke the next morning I could now see a line darting across the forest and into my left nextdoor neighbor’s field. Frankly I didn’t know how to explain it, whether it was wind or me being piss drunk off of eggnog, I dunno. But now that I had seen whatever that was, the air around me felt different. It was as if the forest was watching me.</p>\n\n<p>I put on my coat and hustled over to the neighbor’s house to ask the kid if he saw him. His parents were home, so I requested to speak in private. They probably didn’t know I saw it, and it was probably best if it was kept that way. The kid was in his room, playing video games, with the door cracked open slightly. I knocked on it and asked whether or not I could come in. He obliged.</p>\n\n<p>“Kid, that thing over there at the abandoned house, did you see it last night? It might’ve been just the weather playing tricks on me but did you see it?” He paused his game, and slowly turned around to face me. “Come,” he said. I felt uneasy. He motioned for me to leave the house with him. We were outside on the balcony porch when he said “Of course I did. I watch the Watcher, and he watches me. And now he’s watching you.”</p>\n\n<p>He pointed towards the site of the abandoned home, and through the dead brush, I could see that same disjointed shadow again. It glided backwards into the forest, likely the direction of the house.</p>\n\n<p>I’m not sure what to believe after that encounter. It’s been months since I last went up to Otto. I skipped the next year’s winter trip after that. I had always been neutral on weird shit like the paranormal, but that… It couldn’t have been real, surely. The kid probably stuck a ripped up inflatable in the forest or something. Regardless, that winter was the strangest I’d ever been through up there.</p>\n</div>\n","author":"TheFalloutFan101"}