{"rank":"30","title":"My Grandma Moved in With Me Last Night","id":"8m519r","url":"/r/nosleep/comments/8m519r/my_grandma_moved_in_with_me_last_night/","time":"1527281510000","body":"<div class=\"md\"><p>Actually, my grandma is dead. My grandfather got remarried. Her name is Sylvia but honestly if you call her that to her face, you deserve what&#39;s coming to you. She&#39;ll introduce herself as Sal, her sisters call her Bubby (no idea), and you can also call her any variation of Grandma. Her bio grandkids actually call her Nonabubby. All one word. But if you call her Sylvia, you&#39;ll wish you&#39;d accidentally kicked in a nest of angry hornets instead.</p>\n\n<p>The knock on my door was like a cop. I&#39;d fallen sleep playing some classic game I&#39;d downloaded. I know it was only yesterday but I honestly can&#39;t even remember what game it was. It&#39;s been. It&#39;s been a day, man.</p>\n\n<p>“Turd burglar!”</p>\n\n<p>“Sal, what are you doing here?”</p>\n\n<p>She pushed past me. “Can&#39;t come see my fake grandkid?”</p>\n\n<p>With a chuckle, I shut the door. “Fake? That&#39;s some way to treat me.”</p>\n\n<p>“I said FAVE. Sheesh. You say I&#39;m hard of hearing.” Dropping a suitcase in the floor, she undid her head scarf with the other hand and rolled her eyes at me. “Gonna offer your Nona a drink or what?”</p>\n\n<p>I eyed the suitcase. “Sure. Sure Sal. Have a seat.” Shaking my head, I shuffled to the kitchen in my socks and asked her what was up. Which I shouldn’t have done, because by the time I turned off the tap, she’d stopped talking and the sound of the water running had drowned out every bit of it.</p>\n\n<p>Handing off the water, I sat and asked her to repeat herself.</p>\n\n<p>She lowered herself into my favorite chair, arms shaking, and polished off the glass of water in one go. Rolling it in her hands, she stared at it. “Nothing, bug. I need to stay with you for a while.”</p>\n\n<p>“What? Why?”</p>\n\n<p>“They’re remodeling the nursing home. The construction noise is terrible.” Eyes sunken, she glanced up. “I can’t sleep. You know an old woman like me needs her sleep.”</p>\n\n<p>I sat forward. “Yeah, Sal. But don’t you need like, I don’t know. Nurses and stuff?”</p>\n\n<p>She sat the glass on the table to with a loud crack. “I am perfectly capable of taking care of myself. Those ungrateful children of mine were just scared I’d fall and break my fucking hip or something.” Staring at her nails, she shook her head. “Just because I couldn’t keep my house clean anymore, they shoved me in there so they wouldn’t have to feel bad.”</p>\n\n<p>But I’d forgotten to listen after she cursed. She was always saucy, but I’d never heard such harsh language. “Sal? Is there something else going on?”</p>\n\n<p>“No. So can I stay?”</p>\n\n<hr/>\n\n<p>We went to pick up some of her things the next morning. And that’s when things got interesting.</p>\n\n<p>The first hint of weird came just after we walked in. You have to push a button to access the front foyer, and there’s a security keypad to exit. They keep the place locked down, and the old folks can only go outside via one of the enclosed courtyards inside. A few of the less mobile ones get wheeled out front in their chairs during the day, but if you’re mobile, you stay inside. I always thought it was a bit like a prison.</p>\n\n<p>The guard, um, I mean, the front desk clerk, didn’t even look up after pushing the buzzer to let us in. Sal tried to cruise past the desk, surprising strength in her knobby, arthritis riddled fingers as she gripped my arm to yank me through the foyer.</p>\n\n<p>The desk clerk popped her gum. “You gotta sign in.” She scrolled her phone with a manicured, bejeweled nail.</p>\n\n<p>Sal shoved me at the desk.</p>\n\n<p>I picked up the pen, eyes on the clerk. Scribbling on the sign-in sheet, I tried to make it illegible. I’ve got pretty good penmanship, so it looked like literal scribbles. Palm sweaty, I spun as the clerk hit play on a Facebook video.</p>\n\n<p>A growl emanated from her phone, ripping through static. “Welcome back, Sylvia.”</p>\n\n<p>Sal froze, her bony fingers clutching and digging into the muscle above my elbow.</p>\n\n<p>The desk clerk stopped the video, brow furrowed. “That was a stupid video. Why would she tag me in that?” She glanced up, and her mouth went slack. Eyes locked on Sal, her lips split wide and she began to laugh. But her phone clattered to the floor and the screen shattered with a crack. Shrill laughter cut in half, she picked up the phone and went to swipe the screen. </p>\n\n<p>Why? Maybe to see if it still worked?</p>\n\n<p>At any rate, she sucked breath over her teeth and stuck her bleeding finger in her mouth. Eyes wide, she spoke around the red tip of her finger between her teeth. “Cut my hand on the glass.” </p>\n\n<p>And then, I shit you not, she bit down on the finger and started laughing again. Laughing and pointing at Sal. She stood, howling around the finger, blood spraying down her chin.</p>\n\n<p>Breath short, Sal dragged me through the double doors. Slamming them closed, the magnetic seal engaged, she tugged my arm. “Why did we have to come back here?”</p>\n\n<p>“Well that was weird,” I said, looking over my shoulder at the door. The desk clerk’s laughter still echoed through it. The blood spraying out of her mouth, red against her creamy skin, floating across my retinas.</p>\n\n<p>Sal still breathed hard.</p>\n\n<p>I stopped, tugging her. “Sal, you alright?”</p>\n\n<p>Her eyes wild and rolling, she nodded. “Fine, poop stain. Don’t ask stupid questions.”</p>\n\n<p>Granted, she likes to call me all kinds of stuff. Poop stain, meathead, purple baby buggy bumpers. I think that last one is where “bug” comes from. Still. Her tone didn’t match the endearment. She’s usually not that sharp with me. I kept my mouth shut till we got to her room.</p>\n\n<p>Going in her closet, she yanked out a bag. “Get my shoes from over there, would ya, kid?”</p>\n\n<p>I spun, following her vague point. </p>\n\n<p>Under the empty bed, her roommate had died six months ago and she hadn’t gotten a new one, her shoes laid in a haphazard pile. Couldn’t keep her house clean, indeed. She’d always been a mess.</p>\n\n<p>On my knees, I swept the shoes out with one arm, along with a generous helping of dust bunnies. Coughing, I tried to ask her which ones she wanted. </p>\n\n<p>“Just throw them in the bag, spit.” She walked into the bathroom.</p>\n\n<p>Still coughing, I nodded and leaned under the bed to snag the one I’d left behind with my clumsy sweep. Instead, I hit my arm on something with a corner. “Ouch, what the hell.” I mumbled, leaning my head down to peek under the bed. A smile touched my lips when I saw what I’d hit.</p>\n\n<p>“Sal, what the hell is this?”</p>\n\n<p>The toilet flushed. She walked out, buttoning her jeans. “My shoes. What does it look like?”</p>\n\n<p>I reached under the bed and tugged the box. Laughing, I shook my head and held it out to her. “A Ouija board? Seriously? What are you, twelve?”</p>\n\n<p>The smile slid off her face. “That is not mine. Put it back where you found it. Just get my shoes like I asked.”</p>\n\n<p>A voice spoke from the door. “Sal, get that thing out of here.”</p>\n\n<p>I jumped, dropping the box. The lid popped off and the planchette skittered across the floor. </p>\n\n<p>The shriveled old woman at the door bent over agonizingly slow and plucked it between two fingers. “This thing has been nothing but trouble. When Carl had this idea, we should have said no.” Shuffling into the room, she dropped it in the box. “We’re not teenagers.” She kicked at it.</p>\n\n<p>And before me or Sal could do anything, before I could even think about what she’d said, her kick went wild and she fell. She fell and threw her hands out, catching one arm on the metal frame of the bed. It cracked, and when she hit the ground, something else cracked. Her hip, her rib, whatever. She had time to grunt before her head hit the ground and another crack, louder than either of the others, resounded through her skull.</p>\n\n<p>Her teeth clacked together. I’ll never forget the sound.</p>\n\n<p>The rest of the afternoon was a mess of blood, quiet EMTs, and phone calls to grandkids. Sal and I slipped out the front door, past the desk clerk, and out to my car when no one was watching. As I tried to fall asleep that night, all I could see was the stupid Parker Brothers board game lying in a red pool, white box soppy and crumbling.</p>\n\n<p>Sal slept on my couch that night. She talks in her sleep. All she talked about was the Ouija board. I don’t know. I don’t believe in these things, but it’s been such a weird day. Every time I close my eyes, I see that planchette skittering across the room like some kind of plastic spider. Do you. Do you think maybe. </p>\n\n<p>No. No, I can’t ask that question.</p>\n</div>\n","author":"killabeena"}