{"rank":"13","title":"There's something dangerous in the lake","id":"8m5185","url":"/r/nosleep/comments/8m5185/theres_something_dangerous_in_the_lake/","time":"1527281499000","body":"<div class=\"md\"><p><strong>July 17th, 2017:</strong>  </p>\n\n<p>The backs of my thighs slid against the black leather chair as I sat slouched over, leaving a slight residue of sweat. Bare legs and leather don’t go well together, especially in the middle of July. I scuffed my Old Navy flip flops against the floor while I picked off the last remaining red swatch of nail polish from my thumb.  </p>\n\n<p>“Ok, April. You eventually need to tell me what happened to your friends. There is only so long we can play the silent game before fingers start being pointed, and that’s not what we want, remember?”  </p>\n\n<p>I sighed a deep breath out. I didn’t want to tell the story, everyone already thought I was crazy the first time around. I didn’t need to go through that again. Nobody in school had talked to me since, and parents shot me the evil eye.  Were they scared of me? They shouldn’t be. There’s something far worse lurking out there, something dangerous.  </p>\n\n<p>“April. We don’t have all day.”  I sat up straight and raised my eyebrows in unison. Today was the day. Today was the final time I would tell my story.  </p>\n\n<p>*  </p>\n\n<p><strong>May 6th, 2017:</strong>  </p>\n\n<p>Lake of the Ozarks is a summer hot spot for most people in Missouri. You can find the traffic backed up for hours on the Friday before Memorial and Labor Day weekend. Naturally, my family and friends alike had made the trip out there several times. “The Lake,” as everyone around here calls it, had become a weekly getaway for my group of friends.  Claire, a friend of mine since the tender age of seven, had a lake house passed down to her family from relatives who had moved out to California. Her parents weren’t keen on the three-hour drive out there, so of course, we used it as our party house.  </p>\n\n<p>This particular weekend that she invited us out was a little calmer than usual. Instead of a raging party, we just had our closest group of friends for the weekend.         </p>\n\n<p>Red, yellow, and orange flames danced along the wood as we roasted marshmallows and hot dogs over the embers. The light cast a haunting shadow of the six other faces gathered around the fire.   Emily sat with her phone held high in the air as she huffed and puffed, “I can’t get a single bar of service out here. This is so stupid, what is the point of having a place to hang out with no WIFI?”  </p>\n\n<p>An avalanche of ice fell along the sides of the cooler as Brett dug his hand through the frozen squares, a cobalt blue can of Bud Light resting in his grip. </p>\n\n<p>“Because, babe, we can drink out here. Stop being such a prissy girl!”  </p>\n\n<p>Emily rolled her eyes, then got up from her chair to roam around the yard with just the light from her phone guiding her, high in the air.  I had never been big on drinking, especially out here. I always thought it was a waste of a perfectly good weekend. Everyone would be hungover the next morning, sleeping in until noon while I was out on my raft soaking up the sunshine.  </p>\n\n<p>This was our normal weekend routine, we were used to things being this way, we had no reason to think we were in danger.  </p>\n\n<p>My marshmallow started to catch on fire, and I quickly retreated my stick from the growing flames. A black, charred oval stared back at me, a pathetic attempt at a roasted marshmallow. I reached my hand into the bag to grab another, but came up short of nothing; we were out of marshmallows.  </p>\n\n<p>“Hey, Holly…where did you put the other bag or marshmallows?”  </p>\n\n<p>“Shit. I left them in my car. Patrick, will you go and get them?”  </p>\n\n<p>Patrick sat with his body slouched in his chair, his feet up by the fire. You would be shocked to hear he was a football player with how lazy he was.  </p>\n\n<p>“I don’t feel like getting up. You go get ‘em.”  </p>\n\n<p>“Patrick! Pretty please…”  </p>\n\n<p>She started to twirl her hair around her finger as she directed the perfectly fake smile at him.         </p>\n\n<p>“No. You go.”   </p>\n\n<p>Suddenly, a whiny scream filled my ears.  </p>\n\n<p>“We need some hot guys out here. I mean seriously, what is a girl to do with two men who are taken?”  </p>\n\n<p>Savannah was the wild one of the group. Some would call her a slut, but I preferred to use the term “free spirit.” Either way you slice it, she was a fun girl and was always getting mixed up in the best kind of trouble.  </p>\n\n<p>“April! Don’t you agree?”  </p>\n\n<p>Her words bounced around in my head. I knew what she was asking me, and I wanted to say yes, but I was always so shy around guys. If we were going to invite more guys to hang out, I would have wanted some notice. Some time to plan a cute outfit, a heads up to NOT pack my fruit of the loom underwear…  Her voice rung low in my ears, this time with an edge of annoyance.  </p>\n\n<p>“Um, hello…Earth to April!”  </p>\n\n<p>My lips contorted into a fake smile and with all the courage I could muster, I replied. </p>\n\n<p>“Yeah, um. Totally. That’d be fun. To, you know, have some hot guys here.”  </p>\n\n<p>I blushed at how awkward it felt to mutter those words. I was trying to push myself out of my comfort zone, but it wasn’t easy. Plus, I think everyone could tell how nervous I was with the talk of boys, which made me that much more nervous to try and fake the confidence I so badly lacked.  Luckily, Claire piped up for me, “It’s all in the company you keep guys. We don’t need boys to have fun.”  She shot me a sly grin, always on my side, always looking out for me.  </p>\n\n<p>Holly stood up from the circle, brushing the crumbs off her lap from her third s’mores and turned towards the street. You could see the annoyance on her face.  </p>\n\n<p>“God, Patrick, you’re of no use. I’ll be back, guys, I’m going to grab those marshmallows out of my car.”  </p>\n\n<p>Her silhouette faded off into the shadows of the darkness as she headed up the hill towards her car. I had a sudden nervous feeling in the pit of my stomach as I watched her disappear.  </p>\n\n<p>“Patrick, maybe you really should go with Holly. It’s so dark out, there could be, like, raccoons out. She might need some help.”  </p>\n\n<p>Claire scooched to the edge of her seat and licked her lips with excitement which sent a jolt of anticipation in my already fluttered stomach. She crossed her arms in front of her chest and leaned forward onto her knees. The flicker of golden light danced along her cheeks as a wicked grin spread across her face.  </p>\n\n<p>“You should probably go with her, Patrick. We wouldn’t want her to get snatched by the creature that hangs around the lake.”  </p>\n\n<p>Patrick was sitting straight up in his chair now.  </p>\n\n<p>“What the hell you talking about?”  </p>\n\n<p>The flames grew bright in her eyes as she continued with her story with a snarky comeback.  </p>\n\n<p>“What? You haven’t heard?”  </p>\n\n<p>Patrick, Savannah, Brett, and I sat as still as statues, waiting for her to continue with the story. Each of our faces cast shadows of worry that bounced off one another.  </p>\n\n<p>“Well, now you know. There’s a creature that hangs around the lake. When you hear about people who were great swimmers that drowned out here, or people that just somehow went missing, that’s because that thing got them.”  </p>\n\n<p>Savannah, on the edge of her seat now, began to pipe up, “Stop, Claire. We all know that isn’t true. We know you love a good horror story, but enough is enough. Look at April, you’re scaring her to death.”  </p>\n\n<p>All eyes were on me now.  </p>\n\n<p>“I’m sorry, April, I won’t tell the story if you are scared.”  </p>\n\n<p>I fidgeted in my seat, I was tired of being viewed as the scaredy cat. Besides, I knew what Claire was trying to do. She was making this story up to get at Patrick for not helping Holly. That’s how Claire was, always pulling our legs.  I looked up to the midnight black sky, it was a new moon which made each star shine brighter than normal, like diamonds in a coal mine. I looked back down to my circle of friends, all eyes on me, waiting for me to reply. I could tell they were somewhat curious about Claire’s story, but also embarrassed to admit they were afraid to hear the rest.  The fire continued to roar under the pressure, a pop and a crackle broke the silence of the circle.  I sat straight up in my chair, I wanted to show everyone that I wasn’t afraid of some story. With a lick of my lips, I squinted my eyes to meet Claire’s and replied, “Go on, I want to hear the rest.”  </p>\n\n<p>Claire had the biggest toothy grin plastered on her glowing face.  </p>\n\n<p>“Ok, guys. When I was like, a baby, there was this neighbor that lived a few houses down from my relatives.”  </p>\n\n<p>Brett interrupted the story before Claire could dive into details, he always had a knack for calling out bull shit, he was going to get clarity on every detail of this story.  </p>\n\n<p>“Your relatives that moved out to California?”  </p>\n\n<p>She seemed annoyed, but continued, “Yeah, and you wonder why they moved away….”  </p>\n\n<p>Brett was in an uproar of laughter. Claire waited a few seconds, then her fun demeanor turned serious.  </p>\n\n<p>“Just forget it. It’s not fun to tell the story if you can’t take it seriously, for once.”  </p>\n\n<p>I piped up to play the peacemaker, as usual, “Ok, everyone, just calm down. Let’s hear the rest of the story. So, what if it’s fake? A good scary story is always fun to hear around a campfire.”  I shot Claire a sly grin, always there for each other. She shot me a grin back, then leaned in even closer towards the fire.  </p>\n\n<p>“Ok. So, as I was saying, we had these neighbors that lived a few houses down. There were three of them that lived in the house, except, they didn’t vacation here. They actually lived down here year-round.”  </p>\n\n<p>I shuttered at the thought of living here year-round. How boring would that be, to live out here in the winter. Everything was closed, nobody visited in the winter.  </p>\n\n<p>“It was a husband and wife with their teenage son at the time. Anyways, he loved to go night fishing. Every night around midnight you would see him sitting on the shoreline with a fishing pole.”  </p>\n\n<p>Savannah sat up from her chair and interrupted, “Ok. I can’t sit here and listen to this any longer, it’s killing my buzz.”  She got up from her chair, the grass crinkling beneath her feet as she walked towards the shoreline. My eyes followed the silhouette of her arm, the long slender limb had her swimsuit top dangling at the end of her left hand; she looked back at us and gave a sharp wink. Then all at once, she dove into the lake, splitting the black water as her body disappeared beneath the waves.  </p>\n\n<p>That awful gut feeling crept up again as I watched her disappear into the night. This wasn’t smart, she shouldn’t have been swimming at night after having so much to drink. It dawned on me that only half our group was around the fire, Holly still hadn’t come back with the marshmallows, and where was Emily? Had she wandered too far to find a signal? My thoughts were interrupted as Claire cleared her throat.  </p>\n\n<p>“As I was saying, he would always go fishing at night, when nobody else was around. Apparently, he went missing, and after a couple weeks, they found his body floating in the lake.”  </p>\n\n<p>My eyes met with Patrick’s, I could tell he was starting to get nervous. Was he wondering the same thing as me? What was taking Holly so long? It suddenly dawned on me, and I tried to stifle my laughter. Gosh, Holly was going to get him so good.  I could practically feel her watching us, waiting along the side of the house to get to the best part of the story before she jumped out and scared us all.  I tried to pull off the perfect poker face as my inner self jumped up for joy at my discovery. This time, I was in on the joke, this time, I wasn’t going to be the one scared. I pulled the story along to avoid giving away the surprise ending.  </p>\n\n<p>“So, what happened to him? Did he drown?”  </p>\n\n<p>Claire, barely sitting on her seat at this point spoke in a hushed whisper, “No, April. When they pulled his body from the lake, his insides were completely gutted out and his eyeballs were missing.”  </p>\n\n<p>At this point, Patrick had lost his patience. He stood from his chair and stumbled a few feet as he made his way towards the street. He turned around and yelled back to us in his usual slurred fashion.  </p>\n\n<p>“Whatever, Claire! I don’t believe your dumb ass story. I’m outta’ here. I’m goin’ to find Holly.”  </p>\n\n<p>Our group was starting to dwindle. Claire, Brett, and I were left sitting around the fire. I looked up to the hill as the last moving shadow of a person faded into the night. Why hadn’t Holly jumped out yet? Surely, she would want Patrick to be the one to get the grunt of the scare.  Brett, now standing, looked Claire in the eyes. His face just a few inches away from hers as he bent over to get as close as possible.  </p>\n\n<p>“If this is true, I’ll just go next door and ask the family that lives there.”  </p>\n\n<p>“You can try, but they won’t answer. They refuse to go outside after dark. Something about the creature only coming out at night. There is one thing they did tell us though, you’ll know when that creature is near when you hear a low humming sound.”  </p>\n\n<p>A shiver ran up my spine as I thought about seeing a dead body floating down the lake, the lake that Savannah was basking in.  </p>\n\n<p>“Whatever, dude. I’m going to go take a leak. I swear if I find Emily texting some other dude…I’m going to flip my shit.”  </p>\n\n<p>Claire and I exchanged worried glances.  </p>\n\n<p>“Well, and then there were two.”  </p>\n\n<p>She let a giggle escape her lips as the words fell off her tongue.  I started to pick the nail polish from my pointer finger, “Hey, Claire, so was that story actually true? I mean, you made it up…right?”  She sat back in her chair and crossed her legs, “I don’t know. My dad used to tell me that story. I think he knew we were drinking out here though, so he’d make up anything to scare us from coming out here as much.”  </p>\n\n<p>Before I could breathe a sigh of relief, a sharp scream flooded my ears; Savannah.  Claire and I bolted from our seats and ran towards the shore of the lake. My heart was nearly beating out of my chest, and my legs were sure to give away in the slick dew of the night.  We stood at the edge of the lake, peering out into the blackness. It was a dark night, there was no moonlight shimmering on the lake tonight, it was just, all-consuming.  </p>\n\n<p>“Savannah! Savannah! Can you hear us? Are you okay?”  </p>\n\n<p>There was hardly a wake or a ripple to disturb the silent lake. Where had Savannah gone? Why wasn’t she answering us, and what made her scream?  </p>\n\n<p>Panic began to set in.  </p>\n\n<p>“Claire. What do we do? Something is wrong. We need to get help!”  </p>\n\n<p>Claire looked at me with a darkness in her eyes, “April, we have been drinking. I don’t want to get a MIP, do you? Let’s just take a second to think things through, ok?”  </p>\n\n<p>Her hand was now on my shoulder. I could tell that the alcohol was fogging her mind as she used my shoulder to steady herself.  </p>\n\n<p>“Claire! Let’s go find the others. Something isn’t right here. Savannah is GONE.”  </p>\n\n<p>Our eyes met in the still of the night, pupils glistening with reflections of the lake bouncing off. Claire was biting her bottom lip, eyes locked on mine. Then, out of nowhere, Claire grabbed my face between her palms and forced her lips to mine.  Adrenaline spiked through my veins.  </p>\n\n<p>“What the hell was that?”  </p>\n\n<p>I had taken three steps back and blurted out my question before my mind could process what had just happened. I didn’t mean to hurt Claire’s feelings, but what the hell was she thinking?  </p>\n\n<p>“Sorry, I just thought since we were alone…”  </p>\n\n<p>Before I could croak out a response, I noticed something terrifying out of the corner of my eye.  Adrenaline spiked through my veins as a low humming noise filled my ears. I slowly turned my head to align with the view I saw from afar. My eyes met with a dark figure peering at us.  What the hell was that?  It was walking upright like a human, but the knees were bent in backward. It had a bald head, pitch black skin, and glowing red eyes. I could tell that it didn’t want to be seen, because it was standing against the side of the house, peeking around the edge at us.  </p>\n\n<p>I froze. </p>\n\n<p>Did Claire notice this creature staring at us? Its eyes were menacing, studying our every move, spying on us.  Then, it started to take off up the hill, disappearing before me until it was a mere memory in my mind.  </p>\n\n<p>“C-Claire. Claire. Claire.”  </p>\n\n<p>I couldn’t make sense of my words. I wanted to know I wasn’t alone in this moment, I needed to know that Claire had seen this thing also. My eyes met hers and noticed the dark spot between her legs, a stream of urine still trickling down her pale legs.  My legs felt like they had bags of sand tied around each ankle. I tried to walk towards her, to comfort her, but I was just as freaked out as she was. I lunged forward and wrapped my arms around her, her eyes were still stuck on the spot that the creature was standing.  </p>\n\n<p>A bubbling noise delayed our fear. </p>\n\n<p>My body whisked around to face the lake, something was rising from beneath.  I felt the vomit cropping up my throat as the body appeared before us. A hollowed-out torso of a woman. My eyes followed her torso, up to her exposed breast, followed by her face; the face of Savannah.  </p>\n\n<p>A scream fell from my lips, and I let my feet carry me away from the shoreline, towards the hill that leads to the street. I looked behind me to see if Claire was close behind, but she was still stuck in that same position as before, eyes wide, looking at the spot that the creature once stood.  </p>\n\n<p>The darkness of the night made it hard to see where I was running, which resulted in me face planting on the dew-covered grass. Pain shot through my nose as the throbbing ache spread deep into my head. I pushed myself up to a seated position and traced my fingertips along the tip of my nose. The wetness dripped down my middle and pointer fingers, a bloody mess of a nosebleed. I shifted to stand up and then paused in mid-air. I felt the heat of a million fire ants run down my spine as I saw what had caused me to trip.  </p>\n\n<p>Brett’s body laid sprawled out in the yard, his torso had been gutted and his eyes were nothing but hollowed out sockets of raw muscle.  Why was this happening to us? Who was doing this? All I could do was sob, I couldn’t believe that I had just witnessed two of my best friends’ deaths in a matter of minutes.  </p>\n\n<p>A faint, muffled noise broke me from my hysterics. </p>\n\n<p>I was completely on edge, if I saw that creature lurking nearby, I would surely die of pure fright. I slowly turned my head to peer up the hill towards the street and saw Emily standing at the top.  </p>\n\n<p>Oh, thank god.  </p>\n\n<p>I shot up from the grass and ran towards her, tears streaming down my face.  </p>\n\n<p>“Emily! Emily, oh my god. We have to get out of here!”  </p>\n\n<p>She wouldn’t respond to me though. She just stared at me as she stood in the pathway of the two neighboring houses. As I approached her, I realized something that made my insides twist, her eyes were missing.  </p>\n\n<p>“Emily! It’s going to be okay, I’m going to get you help. Just hang in there!”  </p>\n\n<p>A gurgling sound left her throat followed by a small stream of blood that ran down the side of her mouth. I tried to pull her with me to walk towards my car, but she wouldn’t come. I tugged at her arm once again to get her to follow, but she wouldn’t budge. I grabbed the phone that was still clutched in her hand and turned the flashlight mode on. My face ran white as I realized that her body had been impaled on a wooden stake.  </p>\n\n<p>A good 10 seconds went by as I stood there with my hands over my mouth, in shock, as I watched my friend pass away in front of me. Once her head fell limp, I knew I had to get out of there before that creature came for me.  </p>\n\n<p>I ran towards the back of the house again to grab Claire. She wasn’t safe back there, and I hated myself for leaving her alone for those first few minutes.  My eyes glided along the shoreline, but there was no trace of Claire anywhere. My heart began to drum in my chest as a million thoughts raced through my mind. Did that thing get her? Did she go get help? Did she leave me?  I was frantic, like a chicken with their head cut off, running along the side of the lake. I knew I couldn’t linger around any longer. I had to escape if I wanted to live, with or without my friends in tow. Finally, I ran up along the other side of the house. </p>\n\n<p>I could hear my feet thudding along the ground, but I couldn’t feel them at this point.  I was almost to the front of the house when I heard a rustling sound coming from a tree to the right. I stopped dead in my tracks, the sound of a low hum sang a melody that only I could hear.  Through the break in the leaves, I could see two glowing red eyes. The branches gently shook as the red dots moved up the limbs of the tree. Then, to my bewilderment, I saw an arm fall down the trunk of the tree, followed by a leg, then a head. It was Patrick. That thing was dismembering him from up in the tree.  </p>\n\n<p>Horrified, I ran as fast as I could towards the street without looking back. I didn’t have time to go inside the house to find my purse or my keys, I knew it would be the death of me if I did that. I just kept running towards the street until I couldn’t run any longer.  </p>\n\n<p>As my feet hit the pavement of the street, I noticed a trail of marshmallows littering the ground. My first thought was Holly, this thing had to have killed Holly.  The dark pavement led me to a straight path in front of me that grew narrower the farther I tried to run. The branches of the trees whispered to me as they blew in the wind over the pathway that I ran along. I couldn’t help but see red eyes in each bushel of leaves.  Was the thing following me? Was it in the trees? Was it behind me? My legs burned, but I knew I had to keep running, or I’d be dead.  </p>\n\n<p>My legs carried me further throughout the night, and I noticed that each perfectly white marshmallow began to have a tint of red. As I ran further, each marshmallow became more and more red, until finally, I reached the rest of the bag which was dripping in crimson.  </p>\n\n<p>There was so much blood, too much to come from one person.  </p>\n\n<p>A low humming noise began to fill my ears, and I knew it was close. Where was it coming from though? Perhaps, if I had a head up on this thing, I could beat it.  The humming noise grew louder, and that dreadful sound lingered closer, and closer until I could hear it humming ever so softly behind me.  </p>\n\n<p>I slowly turned around, praying I wouldn’t see it, but to no avail, there it was, in the center of the street, walking towards me.  It was walking upright, but the feet were ahead of the body. It looked like a cartoon character would look when they were sneaking up on somebody. However, the thing that really sent shivers down my spine is what the thing had in its mouth; Holly’s head dangling with her mouth opened in a horrifying snarl.  </p>\n\n<p>I let out the loudest cry, then ran for my life. The humming became louder and I thought this was truly the end, my life flashed before my eyes as tears ran down my cheeks. The humming grew louder, and louder until I realized that the humming was the engine to a car. Eventually, two bright lights shown at the end of the street and I ran for dear life, with both hands waving in the air.  </p>\n\n<p>*  </p>\n\n<p>Everyone’s parents were in hysterics when they found out what happened. They went back for the bodies, and each of my friends were somewhat laid to rest (they were cremated).  </p>\n\n<p>Everyone has been accusing me of doing this. </p>\n\n<p>Can you believe it? I was a shy girl, I could barely talk to boys, yet here I am being accused of a violent murder. I have been seeing a psychiatrist weekly, and have been diagnosed with PTSD. I know everyone thinks I’m crazy, but I’m not, this all happened. I saw my friends die before me. It was truly horrifying, and I will probably be disturbed by this for the rest of my life.  </p>\n\n<p>As for Claire, I don’t know what happened to her, and nobody was able to locate her body. If there was ever a time I needed her to have my back, now was the time. I know if she could tell everyone what we saw that night, people would finally believe it.  </p>\n\n<p>I promise I’m not making this up. It really happened, you must believe me.  I’m afraid of what might happen if you don’t. </p>\n\n<p>You see, that thing is still out there, lurking around the lake, waiting for its next unsuspecting victim.  </p>\n\n<p>You could be next.</p>\n</div>\n","author":"briannaappling"}