{"rank":"3","title":"The Mechanical","id":"8m538l","url":"/r/nosleep/comments/8m538l/the_mechanical/","time":"1527282002000","body":"<div class=\"md\"><p>So, this happened to me a few days ago. I&#39;m a 20 year old male who lives in the second oldest city in Georgia, that runs right along the Savannah River, about 10 minutes from the border of South Carolina. I have only lived here about a month, and haven&#39;t had a lot of luck making friends. I moved here from Pennsylvania. I like it a lot down here. I&#39;m close to downtown, and I am even closer to the Savannah River. </p>\n\n<p>I have been planning with my best friend, Ron for him to come down here and visit. Our schedules hadn&#39;t worked out enough until last weekend for him to actually come down. It all started last Friday night. I live with just my mom. She works overnight as a CNA at a nursing home near here, so I spend most nights alone. I&#39;m a very paranoid person, so being alone here at night makes me very anxious. I will lock the door after my mom leaves, and then check it about 30 times before I actually go to sleep. I sleep on the couch most nights because I like having the tv on, and the ceiling fan makes it easier for me to sleep. </p>\n\n<p>So, Friday night. My mom left for work around 10:15. I did my normal routine of double locking the door, then I went back to watching TV. Before my mom had left, I ordered a pizza, so I was expecting that. Like I said, I&#39;m extremely paranoid, so I keep a baseball bat next to the front door, just in case. At around 10:30, I heard a knock on the door. I stood up and walked to the door, looking through the peep hole, I could make out the figure of someone standing off to the left of the door. Figuring it was the pizza guy, I unlocked the door, and slowly opened it. No one. &quot;What the fuck?&quot; I looked around the &quot;hallway&quot; (I say that because it isn&#39;t exactly a hallway. It&#39;s all open, no doors that lead into a building.) &quot;Hello?&quot; I called into the nothingness. I sighed, rolled my eyes and went back inside. I relocked the door, </p>\n\n<p>After sitting back down on the couch for about 5 minutes, I heard another knock at the door. I groaned, walked to the door, and opened it the same way as the first time. The pizza guy was standing there. I took the food, signed the receipt, and put the food down. As I went to close the door, I stopped. </p>\n\n<p>&quot;Excuse me.&quot; I said to the delivery guy. </p>\n\n<p>&quot;Yeah?&quot; He responded. </p>\n\n<p>&quot;Did you come up to the door about 5 minutes ago?&quot; I questioned him. </p>\n\n<p>&quot;Nope, wasn&#39;t me.&quot; He replied. </p>\n\n<p>&quot;Alright, thanks.&quot; I said as he walked off. Weird. </p>\n\n<p>I was sitting down on the couch, eating food, watching TV and trying my hardest to stay awake. It was about 11:00pm now. I picked up my phone and dialed Ron. It rang about 4 times before he picked up. We shot the shit as he continued driving. I told him about the weird knock at my door, he said it was probably just some jackass messing with me. After being on the phone with him for about 15 minutes, I heard another knock at the door. &quot;Fuck me.&quot; I groaned as I went to the door. Ron stayed on the line. I checked the peep hole again. Same thing, a black mass standing off to the left. &quot;What the fuck...&quot; I whispered as I grabbed the baseball bat, then proceeded to slowly open the door. As soon as I opened it, I heard someone walked down the wooden steps at the side of the building. &quot;Fuck off!&quot; I yelled at the person. Then, I took notice to the steps. They sounded...off. There are quiet a few steps, but it doesn&#39;t exactly take long to get down them. I&#39;ve seen most of the others that live in this building, and they&#39;re all really young. Mostly people in their late twenties to early thirties. And, I&#39;ve never seen anyone use those back stairs. </p>\n\n<p>I explained the situation to Ron, and he passed it off as just some weirdo. I agreed and went back inside. I sat back down on the couch. Now, if you&#39;re sitting on the couch in my house, the TV is directly in front of you, and off to your left side is a large sliding glass door. I keep the blinds on that door closed as soon as the sun goes down. The door leads to a patio, which has a plastic fence on it to separate it from bushes out front and the patio. It also has another sliding glass door that leads to my moms room, which is always locked. I stayed on the phone with Ron, as he was only about an hour away from the house at this point. After about another 30 minutes had passed since the last knock, it happened again. This time, I decided not to answer. I walked over to the door and just stared out the peephole. I could see the now familiar black mass off to the left, but I wasn&#39;t opening that door. After about two minutes of waiting, something happened. I saw what looked like an arm from the left side, and knock on the door again. This sent shivers down my spine. </p>\n\n<p>As all of this was happening, I was whispering everything to Ron. He couldn&#39;t fully believe me. He said it didn&#39;t make sense. After about 5 minutes of watching, another knock came. &quot;That&#39;s the third time.&quot; I whispered to him. As I continued to watch for about another 3 minutes, finally, it moved. I saw the thing cross from left to right, toward the from to the building. It was a person. But, they didn&#39;t look normal. From what I could see, they had blonde hair, and was wearing a white dress shirt, and black pants. But, the shirt and pants were one backward, as if this grown person was a child, and couldn&#39;t correctly dress themselves. His movements were also strange. He walked like his knees barley worked. Bending them ever so slightly as he moved, and his elbows did the same. By this time, I&#39;m screaming inside. What the fuck was that? Why was it at my door? What did it want? </p>\n\n<p>I ran back into the living room, turning off all the lights in the house, and the TV. I sat on the far end of the couch, talking to Ron. I sat there for maybe 5 minutes before I heard it. I heard the sound of something messing with the plastic railing on my patio. I told Ron what was happening. I told him that I had to call the cops. He said we would be there as soon as he could before I hung up. As I went to dial the cops, I heard what I was most afraid of. Three knocks coming from the sliding glass door. I ran to the front door and grabbed the baseball bat. Then, again, three more knocks. Fuck. I stood around the corner out of the living room, just in case. I was shaking so much I couldn&#39;t even dial 911 anymore. I waited for more knocks, but what came next was worse. </p>\n\n<p>A loud crash filled the apartment as glass flew all over the carpet. The thing had literally punch its way into the apartment. I didn&#39;t know what to do. I heard more of the glass shattering. I leaned around the corner, and saw this person walking into the living room. As I watched, the &quot;person&quot; looked up at me. This is something I will NEVER forget. It looked like a person. But, a very generic person. It had a slim face, blonde hair, no facial hair, but... its eyes. They were glowing. I can&#39;t be positive on the color, because I&#39;m color blind, but I am almost certain they were glowing blue. I screamed, vocally as this thing continued to enter the apartment. </p>\n\n<p>At the moment it had both of its feet in the door, my flight or fight sensation kicked in. I decided to fight. As adrenaline pumped through my vein, I charged the thing. I looked at me, as I swung the bat with all of my might at the side of its head. I was expecting to hear the crunch of bone, and see blood go everywhere, but it didn&#39;t. Instead, I heard the sound of metallic parts collapsing on themselves, then I saw metal flying through the air, scattering all over the floor. The thing made what sounded like a synthesized scream. I proceeded to unload all of my fear into this thing. Continuously bashing its head in. After hitting it maybe 15 more times, it stopped moving. </p>\n\n<p>I collapsed backward, sitting on the floor with my knees pulled to my chest. Everything else was a blur. The cops had busted in my door about 4 minutes after I  completely murderized this thing. At this point, the thing looked like someone had shot a desktop computer tower with a .50 Caliber round. The cops took me out of the house, my mom was called, and Ron showed up about 30 minutes later. Here is where everything gets even more weird. I was sitting outside on in the backseat of my moms car, with the door open. Ron had went into the house, under the lie that he was getting me something to drink. He made his way inside, and while filling up a glass of water, he snuck pictures of the thing. </p>\n\n<p>Fast forward to around 12:00pm that Saturday, we had a knock at the door. My mom answered it, as I stood around the corner with a bat. There were two men standing there. They were dressed in all black suits from head to toe. With black hats, and dark sun glasses. They asked if they could come in. Mom let them in. The sat us all down that the table and explained that what happened is Highly Classified, and that we need to understand this. They also asked if any of us had pictures of the thing. I responded no. Mom responded no. Ron didn&#39;t respond. One of the men took Ron&#39;s phone, the other pull USB Lightning data storage device, and plugged it in. He did a bunch of shit on Ron&#39;s phone before handing it back. Before they left, they basically threatened that if they had to come back, it wouldn&#39;t be pleasant. </p>\n\n<p>I&#39;m not entirely sure what I saw that night, or what I killed. It wasn&#39;t human. I wish I could tell you what it was. I&#39;m not sure whats going to happen if they find this. Frankly, I don&#39;t care. I think everyone needs to know about this. So, please, be careful. I&#39;ve dubbed them &quot;The Mechanical&quot;. If you see one, aim for the head. </p>\n</div>\n","author":"Citizen_Sixteen"}