{"rank":"6","title":"The Ambition of the Musician","id":"8m57gz","url":"/r/nosleep/comments/8m57gz/the_ambition_of_the_musician/","time":"1527283022000","body":"<div class=\"md\"><p>I awoke in a half-asleep state to the echo of a melodic keystroke, a musical note reverberating in the night.</p>\n\n<p>The bedroom was dark, darker than it had ever been. There was no light for my eyes to adjust to, no shapes to be made out in the darkness. I could not determine the time; my digital clock that typically offered a comforting neon glow in the night air was nowhere to be seen.</p>\n\n<p>I was laying facedown upon a foundation that felt cold and hard. I must have fallen off my bed and onto the hardwood floor in a fit of rough dreams, only one of which I could vaguely recollect. I had a fleeting memory of lying on my bed as all of my loved ones were gathered around me, and one by one they had slowly disappeared as everything had gone black. It was a strange dream, one whose feeling stuck with you even after you woke.</p>\n\n<p>I sat up and reached out in the dark, longing to pull myself back into the comfort of the soft mattress and warm blankets, but where I expected to find my bed, instead, my hand fell through thin air. </p>\n\n<p>I was attempting to remember what it was that brought me back to consciousness when, as I placed my hands on the floor to stand up, a chord of notes rang out and I realized it was coming from the living room of my house, from my beloved grand piano, though it sounded more distant than usual. Fear gripped me; had someone broken in in the middle of the night?</p>\n\n<p>I slid back against the smooth wall and set my hand against it to steady myself, and in that instant, a clanging of notes rang out in the night, like a grandfather clock signaling the midnight hour. The sudden shift in noise startled me and caused me to fall backwards, and as I planted my other hand against the floor, another chorus of notes rang out.  </p>\n\n<p>I became still as I waited for the last remaining notes to fade. Then, with a hunch, I pressed my forefinger to the floor. Immediately, I heard a singular note play, high and pretty, and with its sound came a realization. </p>\n\n<p>I was inextricably linked to the piano in the living room, my fingers somehow manipulating the musical keys without any physical interaction. Testing my theory, I sat with my back against the wall and placed my hands on the floor, and doing my best to imagine it without the guidance of physical keys, I started playing <em>Clair de Lune</em>. The notes from the classical song permeated the air. </p>\n\n<p>This was amazing, and at the same time, impossible. I had to be dreaming. I closed my eyes and longed to wake up, to return to a place where otherworldly phenomenon did not serve to terrify me in the middle of my rest.</p>\n\n<p>Through my closed eyes, I could sense the room was getting lighter. I opened them and looked up in confusion as it appeared the roof of my house had separated ever slightly from the wall, with light pouring in and shining upon the room. But this light was not warm and glowing, like the early morning sun; it was cold and blue, and through the wide slit it looked as if the sky above was made of ice. </p>\n\n<p>“My condolences,” said a voice from behind me. </p>\n\n<p>I whirled around to see a figure dressed in suit and tie, clearly not human. His eyes were large blue dots, and he had two long vertical nostrils. His skin was blue and oily and gave the impression that ice was melting off of his body. </p>\n\n<p>“Who - who are you?” I responded, terrified at the sight of him.</p>\n\n<p>He clicked his tongue in disappointment. </p>\n\n<p>“Ah, I have yet to meet one of your kind who remembers after he has passed over. I suppose that is to be expected, it has been many years on your plane since we last met. </p>\n\n<p>“My name is Atheus. I came to you once when you were much younger, playing your guitar on the streets for no one in particular, looking for scraps of change, selling your dignity for a fleeting hope of being recognized in your ambitions.”</p>\n\n<p>It was starting to come back to me now, though the memory was blurry. I could see myself playing my acoustic with my guitar case sitting open before me for the hundredth time, dotted with a measly amount of coins, remembering the hopeless feeling of doubt, of debating if it was worth pursuing my passion after so much rejection. I would have given anything then to be noticed. A man who appeared quite normal at the time stopped and watched me for about ten minutes. He walked up to me when I’d finished playing and shook my hand, introducing himself. </p>\n\n<p>“I came to you and offered you my services for a chance to be something greater, to be given fame and desire for your talents. In exchange, you promised me your essence, your very existence, after your physical death. Through you, I learn, and by you, I teach. Through the unspoken language of Song, I have been allowed to enter the minds of anyone who desired to listen. </p>\n\n<p>“You see, my master, whose name you know all too well, desires entertainment, but more importantly, he hungers for souls. Through my entrepreneurship, I have found the solution to appease both.”</p>\n\n<p>My tentative fears swiftly turned into anger.</p>\n\n<p>“What are you talking about?!” I yelled at him. “Where are we?”</p>\n\n<p>“This,” he indicated, waving his hands around, “is your new home.”</p>\n\n<p>I looked around at the dimly lit space, whose features I could finally make out in the cold light. There were multiple thick strings spanning the room, attached to something long and round on the wall. It was a feature I recognized from the beloved object located in my living room, or rather, my old living room.</p>\n\n<p>“Are we in my piano?” I asked, half-laughing at the absurdity of my question.</p>\n\n<p>A small smile curled at the end of his lips.</p>\n\n<p>“Not in the literal sense. That which Man has sold his soul for tends to become, and forgive me the cliché, his personal hell. The tool you used to give yourself purpose has now become your prison.” </p>\n\n<p>I slumped down against the wall and felt the reality of my fate weighing on my chest as a chord of crashing notes echoed like a knell. My memory was becoming clearer as I thought back on my past life, at the career I spent traveling the world and playing my songs, reveling in my fame and fortune.</p>\n\n<p>“I don’t suppose I’d have a chance to take it all back, to start over?”</p>\n\n<p>He walked over and kneeled down to look me in the eyes.</p>\n\n<p>“There’s no turning back now,” he said matter-of-fact, with no hint of sadness or pity in his voice. “The deal has been made, and you have enjoyed your end of it. Now it is time to enjoy mine. Do not despair. You were a great musician in earthly life. Now, you will become music incarnate, for eternity.” </p>\n\n<p>He gave me a pat on the shoulder and disappeared, and the opening of my prison closed, and I was left alone in the darkness.</p>\n</div>\n","author":"SomaSimon"}