{"rank":"16","title":"The Black Knight","id":"8m59xm","url":"/r/nosleep/comments/8m59xm/the_black_knight/","time":"1527283619000","body":"<div class=\"md\"><p>There was a huge painting of a black knight hanging in the foyer of my parents’ house when I was a kid. The painting was the height and width of a full grown man, and the ornate, gilded frame surrounding the painting made the thing look even more monstrous, somehow. The subject matter was pretty monstrous, too--there was a huge black knight, clad head to foot in pure black scale armor, sitting atop an armored black horse. The great beast seemed to be charging directly at you when you looked at the painting, and you were literally staring down the business end of a long, fat, black lance. A sunset bled behind the knight and his horse. When I was 8 years old, I thought the black knight was the coolest thing in the world--much cooler than any of the lame-ass Partridge Family or Julius “Dr J” Irving posters any of my friends had in *their* houses.</p>\n\n<p>My grandfather’s nickname had been the Black Knight of Wall Street, because of how he did business. He was a ferocious, unkind man who died before I was born but whose legacy as a sonofabitch lived on in sickening glory. “A downright bastard, and proud of it,” my dad used to cringe resentfully when describing his late unlamented father in law.  In addition to a small fortune, he left my mother the painting, with the stipulation that it should be hung in a prominent place in the house. She had worshipped her father, and hung the painting right in our cavernous foyer where any guest, upon entry, could not help but look up across the room and see the black knight and his black steed poised to hop right off the canvas and run them through with the huge, fat, black lance that was pointed right at eye level. </p>\n\n<p>On a June night the summer I turned 9, I couldn’t sleep and I was bored with all of my toys, so I came down to our big, over air-conditioned foyer to look at the painting of the black knight, and play with my erector set. I was trying to build a huge Brontosaurus. I sat on the floor with my half-finished dinosaur model, when I heard a noise that sounded like hooves striking against dirt.</p>\n\n<p>I was a pretty standard, upper middle class East Coast suburban child of the 70s, so I’d never actually heard the sound of hooves striking against hard, parched earth; but for some reason I knew the sound instantly and my first thought was “hard hooves pounding on a scorched earth.”  I looked up in horror and fascination and utter disbelief as the black knight in the painting began to move. </p>\n\n<p>At first, it looked like the hose was jogging in place with a sluggish, rhythmless lurch. But then, right in front of my young eyes, the hooves began to gallop a purposeful, powerful cadence and the knight and his powerful black horse lifted themselves right off the canvas and hung for a moment in mid-air before the hooves struck sparks on our polished wood floor and the horse was charging right toward me and I was as scared as I had ever been.</p>\n\n<p>Our foyer was enormous--long and high-ceilinged with rich red floral wallpaper and dark wood floors-- and the black knight was still all the way on the far side, but the horse was moving fast and, having escaped the confines of the canvas, horse and rider were both larger than life and closing the gap by literal leaps and bounds. I heard the driver shriek in a high, savage baritone what sounded like “Pop-ay Satan, Pop-ay Satan!” and felt the hot slimy breath of the horse all the way where I was standing. </p>\n\n<p>I shrieked and jumped out of the way, tumbling across the floor and landing in a heap in the corner of the room. </p>\n\n<p>When I looked up, of course, the painting was just a painting and there was no satanic knight menacing me in the middle of my parent’s home and no jet black steed in our foyer and even my half-constructed brontosaurus, which would have been right in the path of the charging knight, was fully intact.</p>\n\n<p>I was crying and noticed that I had wet myself with fear.</p>\n\n<p>I remember that I went to bed feeling like something hard and cold was sitting in the middle of my stomach. I went to bed feeling powerful dread, and with the certainty that something bad had just happened to someone I loved. I can’t explain how I knew, I just did. </p>\n\n<p>The next morning, my father broke the news to me that my older brother, Peter, had been killed the night before by a drunk driver. Peter had been 18 years old, and my hero. He had graduated as valedictorian of his high school and was going to leave for Stanford later in the summer. Decades later I still sometimes think of Peter and the brilliant future that was cut short and I just start crying fat, hot tears. </p>\n\n<p>After that, I spent a year or so cultivating a hostile obsession with that damned painting. This was long before the internet made information cheap, so gathering information about the painting was a challenge. It took a lot of conversations with my good old local librarian, a fiercely fortyish woman named Daisy who seemed to have intuited that my quest for information about the painting and its artist was somehow deeply personal. </p>\n\n<p>Thanks to Daisy, I learned that the painting I had already mentally re-titled “Death Knight”  was probably from the mid 19th century. It had been painted by a man named Kemper Drood, who had been a Virginia plantation owner who dabbled in painting--mostly images of “chivalry” (or his idea of it). Kemper was an evil man, I decided, who had slaves to whom he was cruel and he had painted an evil painting. Sometimes, if a person is bad enough, I already knew at such a tender age, that badness can infect the things they create. Kemper, I decided, had loved lost causes and black knights.</p>\n\n<p>As a child, I didn’t have a nuanced view of the kind of man who could own slaves. Still don’t. Evil bastards, through and through--Kemper just happened to be more evil than the rest and, more to the point, had been so evil he’d left some evil in the world long after he was safely dead.  The evil that men do lives after them, while the good [if there is any] is oft interred with their bones, as the man once said. </p>\n\n<p>I learned Kemper’s biography  had a happy ending (as far as I was concerned): he was killed before the Civil War when several of his slaves rose up in revolt and killed Kemper and escaped. I hoped they made it all the way to Canada and lived to be old and fruitful. As far as I was concerned, Kemper had run into his very own band of black knights, and they had taught him what real chivalry looked like.</p>\n\n<p>None of this brought Peter back, of course.</p>\n\n<p>By the time I started high school, I had mostly convinced myself that the black knight never materialized out of that evil painting, that it had never charged at me. I convinced myself I’d had a fever that night, and I had probably invented the story about the black knight and his Pop-ay Satan chant *after* I had found out the terrible news about my brother. I was a thoughtful and introspective young man who understood just how plastic and malleable memory really is, especially the memories of a sensitive child on the worst night of his life. </p>\n\n<p>Except  on some level I knew that wasn’t true. I’d developed an alternative theory, although I’d only let myself think about it very late on starless nights or when I was stoned and listening to Husker Du or The Talking Heads: The knight had been testing me when he charged at me, and that by cowering instead of standing and facking the knight I had given up my last chance to save my brother. </p>\n\n<p>Heavy shit, dude.</p>\n\n<p>I grew up strong and smart and ambitious. I was never as smart as Peter--not quite, anyway--I graduated as salutatorian and also as our tennis team’s second best men’s player. I got into Stanford too.</p>\n\n<p>My junior year, I was home for a few weeks in the summer, and very late one night I was sitting down in our foyer again reading The HItchhiker’s Guide to the Galaxy.  I had just gotten to the part where an alien named Bowerick Wowbagger was using his dubiously obtained gift of immortality to fly around and insult everyone in the universe, alphabetically. The section was so funny and I was laughing so hard that I had forgotten, for a moment, my discomfort with that goddamned painting which had not moved an inch from its prominent spot through the years. (Save for whatever trips the Death Knight might have made on the sly, with no one around to fix him in his place by observing him.)</p>\n\n<p>Then, midway through a sentence whose punchline I would never quite get around to reading, I heard the sound of heavy hooves pounding against a scorched earth. I felt a dreadful sourness in my stomach and looked up to see the horse’s hooves jogging in place, lurching awkwardly. This time the lurching lasted longer, but it felt like the horse was deliberately tormenting me. I’d swear I saw the goddamn beast  wink at me before its hooves were galvanized into a purposeful, powerful cadence and then horse and rider were emerging from canvas (an even more vertiginous and disorienting thing to see now that I had left behind childish things and understood how absolutely impossible this was) and I heard “Pop-ay Satan! Pop-ay Satan!” and the knight was charging at me.</p>\n\n<p>I already knew what was at stake. I didn’t have time to sort all my thoughts out until later, but in the amount of time it took to blink I knew that what was at stake this time was the life of my best friend and off-campus roommate, Thomas Farina . Thomas had been in a frightful state the last time I saw him--wild-eyed and unshaven and gripped by an unbreakable depression. His fiancee’ had dumped him and his grades were low enough to put his scholarship in jeopardy and all the poor son of a bitch knew how to do in response was drink and smoke and binge on all the other emotional desiccants he could find until he sunk down into oblivion. In my heart, I was convinced that if I acknowledged the knight and jumped out of his way again like a little coward, Thomas would be dead.</p>\n\n<p>So I stood my ground.</p>\n\n<p>I stood my ground and closed my eyes and felt a furious force flow through me. My eyes were shut too tight to *see* the knight’s lance plunging closer and closer to my throat, but I felt the force of an impact so hard it knocked me off my feet and back into the same corner where I had once been a crumbled up and crying eight year old. I scrambled to my feet elated. I had faced the frightful black knight and his satanic battle cry down and had not flinched (much) and now I was Thomas would be just fine. </p>\n\n<p>I went to bed and slept like a graven image.</p>\n\n<p>Thomas, of course, was dead. He had been at his family’s place in the Cleveland suburbs. He had been alone because his parents were spending part of the summer at a cabin they had in the woods. Thomas had carefully cleaned the pistol his grandfather had brought back from WWII and he had put it in his mouth and he had pulled the trigger.</p>\n\n<p>That goddamn painting.</p>\n\n<p>Decades have passed, and now I have a family of my own. My parents are both long dead, and as their only living heir the painting came to me. The house did too, but I sold it. </p>\n\n<p>I have kept the painting, though, because through the years I have learned that it is sometimes best to keep the things that frighten you close. The painting hangs in my study. I’ve studied it. </p>\n\n<p>I’ve studied the painting, and I’ve studied Mr. Kemper Drood, gentleman and planter. Sadist and son-of-a-bitch. Slaveholder, landowner, artist. I’ve spoken to Kemper’s living heirs--my first thought was that perhaps the best thing to do with the painting would be to return it to the damned Drood family.</p>\n\n<p>As it turns out, though, the living Droods are decent people who have no love for old times way down in the land of cotton. They’re ashamed of their legacy as Virginia planters, as ashamed as the living can be of something that happened generations ago. A many-times great granddaughter told me that if any of Kemper’s paintings had been worth a dime she’d have sold them and given the money to the Southern Poverty Law Center years ago. I asked her what she wanted to do with the painting of the black knight, and she suggested I burn it.</p>\n\n<p>So I did. You bet I did. Or, I tried.</p>\n\n<p>One night years ago, while my wife and kids were out of town, I took the fucking thing out to my backyard and I burned it in our huge backyard barbeque pit. Do I need to tell you what happened?</p>\n\n<p>When I woke up the next day, there was the painting hanging big as the devil and twice as ugly in my study. Pure evil can be a tough motherfucker. </p>\n\n<p>Last night I was in my study. My wife was already asleep in bed. My daughter, Susan, was away at tennis camp. My son, Jonathan, already poised to begin his senior year at U Mass, was spending the summer in Stockholm doing….something or another with atoms. My wife and son are the physics whiz kids in the family--I stick with Infinite Improbability Drives and Pangalactic Gargleblasters. </p>\n\n<p>I should have been finishing up some of my own writing to meet a deadline with my publisher, but I was half-awake and lost in my own thoughts, listening to old Elvis Costello songs instead.</p>\n\n<p>Elvis was singing the last chorus of “Less Than Zero” when I suddenly got that old, sour feeling in my stomach and heard the faint-but-growing-steadily-louder sound of hooves beating against the ground. I looked up, and saw the sickening sight of the horse hooves beginning their first erratic, desultory steps and then growing steadily more purposeful, more powerful.</p>\n\n<p>I looked up, and the horse and rider began to emerge from the canvas one more time. Once again, I heard “Pop-ay Satan! Pop-ay Satan!” This time I did not cower. This time I did not steel my nerves and brace myself to simply stand my ground without cowering too much. </p>\n\n<p>This time I yelled “Fuck you you black knight bastard!” This time i pushed myself forward, out of my chair, and dove into the air toward the painting with my body full extended, my feet far off the ground. I didn’t think about it at all--it was an act of purest spite and desperation; my life is pretty good these days and whatever the Death Knight was coming for I had no intention of letting him take without a fight.</p>\n\n<p>“Jesus you old fool, you’re going to break your neck,” I thought.</p>\n\n<p>But I didn’t break my neck.</p>\n\n<p>It felt like the first time I ever had the chutzpah to push my feet off the shore and put my head in front of me and swim--really for god’s sake swim!--in the ocean. I didn’t skid across my wooden floor. Something picked me up and for a moment--for one glorious goddamn moment--I was floating forward, off the ground. I was flying.</p>\n\n<p>I thought of that passage from the Hitchhiker’s Guide that talked about how flying is nothing more than throwing yourself at the ground and missing. I had thrown myself at the ground and missed. Then I hit the knight.</p>\n\n<p>I thumped up against something hard, but I hit it solid. It felt like when you hit a perfect forehand with the sweet spot of your tennis racquet. I shuddered with pleasure. I felt something warm and electric and realized I’d come in my pants for the first time since I was in my 20s. </p>\n\n<p>I opened my eyes, and I was still sitting in my chair.</p>\n\n<p>The painting was still on the wall. Some of it was, anyhow. Mostly, there was a hole in the middle of the canvas where the knight had been once. I swear I saw a puff of smoke come out of the hole, like a smoking crater.</p>\n\n<p>We live in a much more immediate age now than ever before. There was no need to wait until morning to find out what had happened. My phone rang right then and there and my son was on the other end.</p>\n\n<p>My normally stoic, sometimes infuriatingly unflappable son was calling breathless and raving to let me know that he had just survived a terrorist attack. Some NeoNazi prick had crashed a white van into a crowded restaurant, and then hopped out of the van with a box cutter to attack the stunned and the wounded. He was yelling (“Pop-ay Satan! Pop-ay Satan!”) some kind of Nazi bullshit as he made his way into the heart of the stunned and wounded crowd.</p>\n\n<p>My kid, who has his mother’s quick brain and his father’s old tennis reflexes, had grabbed a metal pitcher from the silverware and broken plates and shards of glass that had fallen at his feet as the entire restaurant was rocked by the impact, dodged a clumsy swipe from the box cutter, and then bopped the bastard right on top of the head. </p>\n\n<p>He was calling just to let me know he was okay. He was close to tears, and I was bawling outright. I woke his mother up and, after bracing her for the shock, handed her the phone and went back to my study. Walking away, I couldn’t hear the words she was saying but I could hear the joy and relief and pride in my wife’s voice.</p>\n\n<p>I walked back into the study and stared with pride and relief of my own at the smoking hole where the Death Knight had been. “Fuck you, Kemper Drood and fuck you, Death Knight,” I said to the empty room. </p>\n</div>\n","author":"goldvine_throwaway"}