{"rank":"12","title":"The Beginning of The End","id":"8m59hh","url":"/r/nosleep/comments/8m59hh/the_beginning_of_the_end/","time":"1527283503000","body":"<div class=\"md\"><p>I am an investigator for an inter-agency group that liaisons with the FBI and state Bureaus of Investigation.  Almost, a real-life “X Files” scenario without the aliens.  State BI’s call us in when they have a case that has hit the wall, and they need to keep the facts of it out of the public domain.  Yes…there are things happening daily, everywhere, that never make it to the news, or the alt-news, or the fake news…or youtube.   And the FBI can’t deal with those types of cases without putting itself in enormous legal jeopardy, because it is a government agency that must abide by the Freedom of Information protocols that hamstring so much of what our government does.  Some things are better left unknown and in the dark…trust me.  </p>\n\n<p>So, yeh, I am coming here, and telling you about this.  Why?  Because, after 10 years, my mind is about to shred.  The fuse is near the ballast…I am going to blow soon.  I don’t know if that means I will take the mask off and go public in a big way, or just disappear for ever and ever.  But, I can’t handle it anymore, and I know…I know…something big and bad is coming, and it will be coming for all of us.  </p>\n\n<p>It is important for you to know about the cases that line up in a chain, that are connected, that are part of a larger pattern.  If you know about them, maybe you will be able to prepare yourself…if you can see the pattern.  I am not going to spell it out for you - they would know my identity immediately if I did that.  </p>\n\n<p>So, for me, it started in Atlanta, GA.  The GBI called us in on a case that had come to a grinding halt.  In an upper middle class subdivision in north Atlanta, over the course of a few weeks, several dogs and cats had disappeared.  No big deal…didn’t even make the news, though it did make the local grapevine.  </p>\n\n<p>Then, in the course of two weeks, three small children disappeared, all from the same subdivision.  It was a startling and disturbing situation, way beyond the resources of local LE, and the GBI was called in.  </p>\n\n<p>Standard investigation protocols were followed, and went nowhere.  No signs of violence, no ransom notes, no real indication of foul play.  Just three kids…a girl and 2 boys, gone.  All of them had been in their homes, all of them had been playing in the basement, no other connections or similarities.  </p>\n\n<p>It became a big local and regional news item.  The GBI was gobsmacked, and reached out to the FBI…who reached out to us.  We were experienced at assessing strange, evidence-deficient events.  We tended to see things - patterns, similarities, residue of crime - that others did not see.</p>\n\n<p>So we went to Atlanta, and began our work.  We had been there for three days when the first of what turned out to be seven more people disappeared, over a period of 10 days.  </p>\n\n<p>It was truly fucked up.  Two whole families, both two parents and a child, just vanished.  An older gentleman who lived alone was the last victim.  </p>\n\n<p>All had disappeared from their homes.  All of the homes were nice, well-kept, upper-middle class homes.  None of the individuals had criminal records, no known criminal connections.  No indications of threats against them.  </p>\n\n<p>We didn’t even know where to begin.  The only piece of evidence, which we didn’t know how to understand, was the appearance of pieces of fine webbing - like silk, or spider webbing - at every scene, though not always in proximity to where the individuals were last seen.  There wasn’t a lot of it, not enough to really be curious about, but because of our obsessive approach to forensics, we had it sent to the GBI lab for analysis.</p>\n\n<p>Two nights after the elderly gentleman went missing, a person of interest was picked up by local LE.  He was only “of interest” because he was walking, alone, through a neighborhood near where one of the missing families resided…at 2am in the morning.  </p>\n\n<p>When they got him to the station, they called us…and not just because of where they found him.</p>\n\n<p>I was part of the three person team sent to interview this guy.  When we entered the room where he was being held…well, I was blown away.  He was absolutely the strangest person I had ever seen.  His skin was as close to milk white as you could get, and still be alive.  His hair was thin, like corn silk.  His eyes were nearly solid black.   And his skin…I couldn’t figure it out, but it looked…hazy, like it was a tightly woven fabric.  His clothes seemed to be a part of him, like they were painted on, or attached somehow to his skin.</p>\n\n<p>He wouldn’t talk to us, wouldn’t say a thing.  But he did look at us, and his gaze terrified me…all of us, really.  It was intense, probing…and…hungry.  I felt as if I was in the presence of pure evil, or of a cold blooded predator.  I was convinced, almost before we sat down to interview him, that he was our perpetrator.  </p>\n\n<p>We grilled him for over an hour, each of us taking turns, asking the same questions over and over again.  Nothing.  He barely moved, never spoke.  </p>\n\n<p>My partner, Eric, grew increasingly frustrated and banged his hand on the table in the interview room.  He stood up, and reached over and grabbed this guy’s shoulder, as it to shake him or startle him.</p>\n\n<p>What happened next was the first step in a nightmare that has lasted 10 years.  </p>\n\n<p>The guy’s body disintegrated before our eyes, and millions of spiders burst from a billowing web structure that filled the room.  Eric yelled out in what sounded like torturous agony.  Me and my other partner, Janine, jumped up, batting spiders off of our bodies, spitting webbing out of our mouths and pulling it from our eyes.  I was so panic-stricken that I did not know what to do…rational thought was impossible, I was driven by the survival instinct to get out of the room, but I could not think clearly enough to find the door.</p>\n\n<p>Fortunately, someone was watching the interview on closed circuit, and opened the door for us.  Janine and I fell out of the room just before a huge web-like structure filled it and began to harden.  The door slammed behind us, not of our own doing.  </p>\n\n<p>Eric didn’t make it.  </p>\n\n<p>Janine and I were both covered in spiders and web, and it took several members of the local cops to get all the spiders off, kill them, and clean us up.  By the time it was over, more than an hour had passed.  Janine and I were so shaken we could barely function and were covered in hundreds of small spider bite marks.</p>\n\n<p>At some point, the local sheriff took us aside and told us that the closed circuit camera in the interview room had been non-functional because it had been covered with web.  But now, the webbing was gone, and…well, he said, you need to see it for yourself.  </p>\n\n<p>We went into the primary office area, where several cops were staring - in a state of bewilderment and fear - at the monitor for the CCTV.  The webs that had filled the interview room were gone.  Eric was gone, though he had never left the room.  </p>\n\n<p>The guy we had been interviewing, who had exploded into millions of spiders, was sitting back at the table as if nothing had happened…and he was looking directly at the CC camera…at us.  </p>\n</div>\n","author":"aquariusdon"}