{"rank":"5","title":"Starbound Steam Code Hacks My Landline, Headphones, & Printer.","id":"8m5ik4","url":"/r/nosleep/comments/8m5ik4/starbound_steam_code_hacks_my_landline_headphones/","time":"1527285736000","body":"<div class=\"md\"><p>Ah, 8th grade graduation, what a great way to end the torture!</p>\n\n<p>I am a gamer. My first video game was an emulated version of Final Fantasy VI for the SNES. So, it would seem logical to get me a game for a graduation present, right? Well, normally I would like my games in a box or case, my cousin, who I will keep nameless, gave me a steam code for the game &quot;Starbound&quot;. I have been gushing over this game for the past month whenever I saw him. I would tell him about some of the cool things that I found on YouTube of this game (Even though there wasn&#39;t much). </p>\n\n<p>A few days passed after the party and I still haven&#39;t redeemed the code. So, when boredom got the best of me, I decided to redeem it. The steam code, which I still have the piece of paper that had the code on it (Don&#39;t know why), was: NOV2K-4DH27-2O6E1. I wouldn&#39;t even try putting it in if I were you, since I&#39;ve already redeemed it (Hah, sucks to be you). Anyways, I started playing, and it told me to choose my race. I went with the Novakid, because he looked the coolest to me. I went through the main campaign on casual mode, which means there is no hunger and no penalty for dying. It took me 24 hours to beat the main story, and as soon as I claimed my reward for beating the main campaign, the phone rung. </p>\n\n<p>Normally we don&#39;t answer the landline, so I didn&#39;t. But as soon as it said to, &quot;Please leave a message after the tone&quot; I kept hearing weird sounds coming from the phone. It started out with heavy breathing. Then, it sounded as if the phone was dropped. Then, gunshots. *BEEP. The message stopped, then the message deleted itself somehow. Normally, all voicemails would be saved, but this one didn&#39;t. When I tried to play the most recent voicemail, all that played was a reminder for my sister&#39;s orthodontist appointment.</p>\n\n<p>I started exploring around the world in-game, when I found a galaxy with only one planet. It was extremely strange, because normally, the minimum amount of planets per galaxy was 2. So, I started heading over there, and what I found, blew my fucking mind. The only planet there was a scorched planet. Scorched planets are home to Novakid villages. But, in galaxies, there are unidentified areas only labeled as a combination of 6 numbers and letters (<strong><em>-</em></strong>). This galaxy had two, NOV-2K4 &amp; DH2-72O. These were the first 12 characters in the steam code.</p>\n\n<p>After that, I beamed down to the planet. It seemed like a fairly generic scorched planet when I landed, but when I went to my left,  there was a Novakid village immediately. I began talking to the residents of the village, grabbing loot from the chests, crates, and barrels, until I came across the sheriff of the village (Looks like this: <a href=\"https://starbounder.org/mediawiki/images/0/04/Sheriff%27s_Set.png\" rel=\"nofollow\">https://starbounder.org/mediawiki/images/0/04/Sheriff%27s_Set.png</a>). I had a chat with him, until he said (...). Then, in my headphones, I heard the same breathing that was on the voicemail. Then, my character seemed to interact with him on his own. The sheriff said, &quot;Hey, haven&#39;t I seen you before?&quot;. That is just a generic line said when you play a Novakid, talking to other Novakids. But this line, was actually spoken. Normally, it would just be a random sound effect, but the actual words were spoken.\nThis place was too weird. So I beamed back up to my ship, and bookmarked this planet. Just in case.</p>\n\n<p>I pulled out the sheet of paper that had the steam code, and decided to decipher it, because I knew something was up. Then, I got another call. The number displayed on the phone, was the steam code. I answered the phone. &quot;Hello?&quot;. &quot;Hey, haven&#39;t I seen you before?&quot;. I slammed the phone, and turned off the call. Then, it clicked. The phone. I grabbed the phone, and looked at the number pad. There are normally 3 letters designated to 1 number (EX: ABC = 2), except 7, because seven is a bitch. I deciphered the code, and it read, &quot;NOVAK-IDHAS-COME1&quot; I uninstalled the game. Not to return to it, until now. I have finished up my freshman year in high school. And on discord, my friend asked me that he got this new game that he saw I had. So I said that I would. Fortunately, he was excited to play with me. Unfortunately, the game he got, was Starbound. </p>\n\n<p>I was reinstalling the game. He asked why I was taking so long. I lied, and said that I have an update to take care of. As soon as it was finished, the printer, for no apparent reason, started to print out forest green sheets of paper, saying, &quot;Hey, haven&#39;t I seen you before?&quot;. I unplugged the printer, but even so, it still kept printing these sheets, over and over. Until the last sheet was printed, and said &quot;NOVAKID HAS COME&quot;. After that, a green gas came spewing out of the printer, and I fainted.</p>\n\n<p>I woke up to a warm hand, lifting up my head. And I heard, &quot;Hey, haven&#39;t I seen you before?&quot;</p>\n</div>\n","author":"NorthanDX"}