{"rank":"602","title":"My parents run a successful business in the Black Market. (Part 2)","id":"8m5mrc","url":"/r/nosleep/comments/8m5mrc/my_parents_run_a_successful_business_in_the_black/","time":"1527286795000","body":"<div class=\"md\"><p><a href=\"https://reddit.app.link/lkSLbrmydN\">PART 1</a> </p>\n\n<p>Part ll: The Playroom </p>\n\n<p>I walked in and was immediately in awe of the room. The first thing I noticed, surprisingly, was the cylindrical shape of the room. It didn’t make sense how it could fit in a building this shape. The floor and walls were white. Disturbingly white. It’s like when you see someone with Snow White veneers and they are so perfect they almost make you uncomfortable. It was so clean it almost glittered. </p>\n\n<p>The walls of the cylinder room were lined with shelves and racks. Each holding tools, saws, surgical instruments, and restraints. From the ceiling hung three big leather contraptions that took me a while to figure out. They were restraint swings. </p>\n\n<p>In the center was a chair that looked similar to a dentist chair. It had a mayo instrument stand positioned beside it with a sterile sheet. On the sheet was orthopedic instruments. If you’ve ever seen orthopedic instruments they stand out from the general laparoscopic instruments. Lots of hooks, retractors, surgical hammers, and things that resemble pliers. They were so clean they sparkled. For a minute I was in a trance. </p>\n\n<p>Shock is a weird thing. When you find yourself going through the motions of shock it seems like we get caught up in the most mundane things. I think it’s a coping mechanism for our brains. </p>\n\n<p>I heard another bang and I snapped out of it. </p>\n\n<p>I looked up and to the right of the chair I saw another metal door. Whatever that noise was, it was coming from there. By now I’m scared shitless and my brain is now allowing me to understand the heaviness that I’m feeling in the room. </p>\n\n<p>I shouldn’t be here. I wish I’d never walked in here. </p>\n\n<p>I walked toward the metal door. I didn’t want to. It was like in the scary movies where the dumb white people run toward the danger. I was the dumb white girl. </p>\n\n<p>As I approached the door I realized that if I proceeded that nothing would ever be the same again. Even at such a young age I was aware of the magnitude of this. </p>\n\n<p>I pushed the door and it opened. A part of me was hoping it would be locked. </p>\n\n<p>I entered a small hallway. All black. Clean black marble floors. Clean black marble walls. In the hallway I saw 6 doors. 3 on each side. The doors had small windows in the top of each. I imagined that’s what doors in a psych ward looked like. Maybe not as expensive though. Man, did my parents love marble. </p>\n\n<p>For a second I forgot while I was in there. </p>\n\n<p>Bang! </p>\n\n<p>I whipped around and it was the second door on my right. That’s where the noise came from. Shit.....</p>\n\n<p>“Just turn around now!” The smartest part of my brain told me. “No, go check it out!” The slow part of my brain clapped back. I had to. </p>\n\n<p>I walked up to the second door on the right. I took a deep breath before I could muster up the courage to stand on my tippy toes and have a peek. </p>\n\n<p>I pressed my hands against the cold, clean, marble and raised up on my toes. I reached the window with my eyes but I saw nothing. </p>\n\n<p>I peered around to look for anything or anyone in the room but I saw nothing. </p>\n\n<p>“HELP!!”</p>\n\n<p>A woman banged against the window so hard it vibrated my face sending me rearing backwards onto the hard floor. </p>\n\n<p>Although it happened so fast, I still saw more than I had wanted to. </p>\n\n<p>She was Asian. Her head had been shaved and from her right temple was thick, dried blood. When she banged, she banged with her arms only. I know this because she had no hands. Fresh stitches lined the smooth sides of where her wrists should connect to her hands. </p>\n\n<p>I jumped up and bolted. I ran out of the hallway and back into the white room. When I was almost to the door I heard the metal door at the top of the steps shut. </p>\n\n<p>“Shit!” I said in a whisper. I looked around for a place to hide but there was no way I would go unseen down here. </p>\n\n<p>“No, Katie. I’m not coming back to the office today. I’ll be back on Monday. Just take whatever inquiries from my upcoming surgeries and put them on my desk. I’ll get back to everyone then.” It was Dad. </p>\n\n<p>I turned around so fast I was spinning and ran back to the black hallway. I ran to the second door on the left and entered the room. Thank God it was empty. I heard him enter the white room. </p>\n\n<p>I sat in the corner with my hands wrapped around my legs and pleaded with God in the weakest whisper. Then I heard the door. </p>\n\n<p>My heart stopped. I couldn’t breathe. I was in full blown fight or flight. </p>\n\n<p>Dad approached the Asian lady. </p>\n\n<p>“Knock, knock.” He laughed. </p>\n\n<p>“You ready Miri?” I could hear the smile in his voice. </p>\n\n<p>“No! Please sir! Please I not say anything. I not say anything.” She screamed. </p>\n\n<p>It hurt my ears. Her accent was thick and full of dread. I covered my ears and kept wishing I’d wake up. </p>\n\n<p>But this was no dream. </p>\n\n<p>Who was this new man that I called Dad? How long had this been going on? What would happen to me if they knew I found about this? Whatever this is...</p>\n\n<p>My whole life was turned upside down. Everything was a lie. I wasn’t like them! Was I? </p>\n\n<p>I snapped back from my thoughts as I heard her screams trickle off in the distance. </p>\n\n<p>He drug her out into the white room. It felt like hours had went by before I heard another sound. </p>\n\n<p>A loud sound ripped through every part of my body. Even being separated by metal doors and marble walls I felt it. It was a sound I knew. A sound I learned about on “Bring your kid to work” day. </p>\n\n<p>It was a bone saw...</p>\n</div>\n","author":"GlitterKricket"}