{"rank":"7","title":"PLEASE HELP ME I'VE BEEN KIDNAPPED","id":"8m5pnd","url":"/r/nosleep/comments/8m5pnd/please_help_me_ive_been_kidnapped/","time":"1527287512000","body":"<div class=\"md\"><p>PLEASE HELP ME, I’m so scared and I don’t know where I am and I think they’re going to kill me. I was kidnapped from my house, they just came into the house and took me. They keep saying they care about me, that they’re helping me, that they know me. They’re trying to get me to trust them. They’re terrifying and keep grabbing me and trying to brainwash me. They’re dressed really weird and won’t let me leave. I think they&#39;re going to kill me.</p>\n\n<p>One man in particular never leaves me alone, he&#39;s always watching me and always needs to know everything I do. I think there might even be a camera in here but I can&#39;t find it. He ties me to my bed, or has one of his friends do it. They lock me inside this weird fucked up room and they inject me with God knows what all the time and constantly try to shove chemicals inside or on me. They force me to take drugs too. At first they forced me, tying me to the bed and shoving a tube up my nose. It was painful and they wouldn’t tell me what they were pumping into me. I managed to rip it out multiple times but I feel sick. I have no privacy. No freedom. I want to go home, please help me if you can read this. They barely even feed me, the stuff they give me is disgusting. I&#39;m in pain and I&#39;m scared please. They keep trying to kill and hurt me. I don&#39;t want to die.</p>\n\n<p>They have armed security guards like the ones that came and kidnapped me, that come by sometimes to try and intimidate me and brainwash me. It won’t work. I’ll never let my guard down. I already made that mistake once. I think the place I&#39;m in is called LAPD but I can&#39;t tell for sure because they keep lying to me.</p>\n\n<p>I don’t know what to do and I’m so scared. I stole one of his friend’s phones and if you’re reading this please help me. I&#39;m sending this on reddit but I don&#39;t know the return address. I hear others locked in this building too. Sometimes I can hear their screams. They won’t let me even see the others. I don’t know if I want to. It sounds like they’re going through hell. I can&#39;t even look at what they did to me. I have yellow spots all over from where they touch me, my face is ugly and I look like I&#39;m dead. They&#39;re KILLING ME. PLEASE HELP ME.</p>\n\n<p>I remember when I was 12 I snuck a movie from my daddy’s shelf called ‘Hostfl’ or something and watched it. I think this is where they’re keeping me but it&#39;s newer, it’s real like daddy said and I’m stuck here. Please help me, I don’t know when they’re going to kill me but they said they’re going to bathe me even though I don’t want it. I think it’s going to be soon. I thought refusing showers would make me undesirable but they won’t hear it.</p>\n\n<p>I stole one of their knives, it’s small but it’s sharp enough that I can defend myself I think, or kill them if they get in my way I hope. I don’t care anymore, they want me dead and my dad’s probably lost his shit looking for me. There are so many of them around here that I don’t know if I’ll be able to escape or not. I have to wait for night and maybe kill whoever has the key to get outside. I don&#39;t know who it is though. I can&#39;t see a key hole, just a box with numbers on it. But I remember in that movie the guy who tried to escape did it by dressing like them so I have to do that.</p>\n\n<p>They untied me last week because I pretended to be good for them. They don’t know I did that just to steal their costumes. I&#39;m a good liar even though daddy says I&#39;m not. They don’t have good security at night, but the doors to the outside are still locked. The clothes I stole are loose and will make me look fat like they all do, and the white face mask will conceal my identity I hope. I also stole a nametag, it says ‘RN’ and I don’t know what it means. PLEASE KEEP LOOKING THOUGH PLEASE. I&#39;m so scared I don&#39;t know what to do. I don&#39;t want to die. Daddy if you&#39;re reading this I&#39;m so sorry. I didn&#39;t tell them anything and I&#39;m scared. Please come save me. I didn&#39;t do anything wrong they just took me.</p>\n\n<p>Their guards just stormed our house and grabbed me out. They kept asking where my daddy was but I’m not stupid. I always knew this was going to happen, daddy always told me it could. I didn’t believe him at first but that was my mistake because now I’m stuck in this place and I might die because of it. I should have been more prepared, if the cops ever come to save me, if anyone ever finds me here, he’s going to be so mad. But even that isn’t compared to how terrible this is.</p>\n\n<p>PLEASE JUST HELP ME.</p>\n</div>\n","author":"AL_Hero"}