{"rank":"1","title":"The devils work","id":"8m5s6t","url":"/r/nosleep/comments/8m5s6t/the_devils_work/","time":"1527288176000","body":"<div class=\"md\"><p>So I don’t know where to start with this but I have something bad going on. BAD! It all started when I had my first child with my husband, we were all good for so long and had never ever experienced anything in our house. When we were younger we had fucked about with spirits when we didn’t know each other and we had when we were together. We did Ouija boards, exploring abandoned building and many more things. I thought it was cool back then and so much Happened that was so fucked up I will have to explain it later. But everything that happened after that stopped and it all chilled out once we grew older, got married and when I fell pregnant. But when I was 8 months pregnant, things started happen it wasn’t anything too bad it was just objects moving here and then. And I just thought it was me and my husband both just moving the same objects again and again. I asked my husband about it and he said the same to me thinking I jkept moving things. But it wasn’t either of us. This freaked us both out but we left it. </p>\n\n<p>The next week it got worse. We both went out for a little while just to spend quality time together before I gave birth and we came home to find a drawing on the fridge and it was like a child’s drawing. Guessing it was my nieces, Alaska, and my brother had come round whisky I was out I just ignored it and was gonna view it later. Because I was 8 months heavily pregnant I went to bed for a nap and awoke very sweaty and shaken up just thinking I had a nightmare. I wandered downstairs feeling like my mood has lightened. That was until I saw my husband come round the corner with the drawing in one hand and a very concerned look in his face. I asked what was up and he showed me the drawing it was my husband and me. My husband looked sad and was crying and then me I had a knife stabbed into my stomach and there was a devil by use holding a baby and it was signed Alaska and the devil. I called my brother and asked if he had come round and he had and wondered why I asked and I told him about the drawing he said she drew but he never saw it so he asked her and Alaska said she had and the devil in our home helped her and told her what to draw. We kind of found it weird but never thought bunch never really scared us both. It was very violent for my niece but I brushed it off as just her over hearing a programme. </p>\n\n<p>A few weeks passed and I was put on bed rest by my doctor as I was due to give birth any moment and I needed the toilet but something came over me and make me freak out and step back. All of a sudden I felt like someone had pushed me and all I could rn ever was cashing and banging down the stairs and then black. I woke up and saw this figure over me that had red eyes and then the next thing I knew I was in a hospital bed. My husband was by my side and explained everything to me and that the doctors check the baby and that I’m had given birth. Even though I was passed out o screamed so much they though I was awake and they all freaked out.  They thought I had given birth to my baby boy that is named Kendall and then another bay popped out baby girl Harri but she was tiny and they thought she was gonna die. </p>\n\n<p>4 months later to the present, I still have no idea what happened that day I fell down the stairs. But Kendall screamed the place down until his sister appeared in the room and slept silently. He started waking up at 3 am and laughing the most evil and in baby like laugh you have ever heard. It did not sound normal. The children’s toom is trashed when we awake but you can never see Anthony happen on camera or anything and I’m sending soemthing very bad is happening and that the evil spirit is getting stronger. I heard Kendall cry for the first time in a while st 3 am in te morning and ten I saw it. The figure at the end of my bed. The figure I saw aged I feel down the stairs, he came back. He came back to a track me and get revenge for escaping him and I was so so petrified. He came over to me but I couldn’t move I was having sleep paralysis but when I work I had bruises up and down my arms. The evil happenings have got worse and more drawings have appeared but this time they aren’t from Alaska...</p>\n</div>\n","author":"Becca-louise"}