{"rank":"44","title":"The Sweltering Heat Of An Alabama Summer","id":"8m5ynv","url":"/r/nosleep/comments/8m5ynv/the_sweltering_heat_of_an_alabama_summer/","time":"1527289782000","body":"<div class=\"md\"><p>You’d be surprised how much money you can make flipping a farmland in rural Alabama. If you look at the right time you can get the place for next to nothing thanks to a foreclosure. It’s how I made most of my money for the last couple of years. A lot of the time these places really only need a fresh coat of paint and a new fence and they’re ready to be put back on the market. Last summer was the last time I’d ever try and flip any farms though. </p>\n\n<p>The place seemed normal enough. 42 acres up for sale about an hour and a half north of Mobile. Comes with a small one bedroom farmhouse and a detached garage with a dirt driveway. All for only about $135,000. This was exactly what I was looking for, the place seemed a little run down but nothing I couldn’t handle. I contacted the bank and after a background check and a few days of waiting the place and all that it contained was mine. </p>\n\n<p>I didn’t have a chance to drive out and see the property myself for about another week. By this point it was mid July and the temperature was rising. Now I’ve lived in this area my whole life but this year was on record to be the hottest one yet and it seemed to be happy with that. Climbing out of my truck and wiping the sweat from my brow I headed up to see what that little house had in store for me. I had brought along my trailer so I could take anything worth value that was left behind. </p>\n\n<p>The house was in good condition. Needed a new roof, and maybe some floorboards installed but for the most part it seemed sturdy as can be. Nothing too noteworthy was inside the house, an old dusty couch, some pots and pans left behind, the usual stuff places like these have. The bedroom still had family pictures in there, some of which seemed to be going back to the early 1900’s. It seemed like whoever last owned this place had it in their family for generations. </p>\n\n<p>Heading back outside I went to check the garage. The door was rusted pretty heavily and difficult to open. I had made a note of planning on installing a new one when I got the chance. Inside was a rusted out tractor, some old rusty farming tools, and a whole assortment of various chemicals and insect killers. The chemicals were all but worthless at this point, but there might be a few parts of the tractor I could sell for something, and then just scrap the rest. </p>\n\n<p>I spent the better part of the next month salvaging what I could from both the house and the garage. Everything that wasn’t worth something went straight into the garbage. At this point the temperature was well over 100 degrees consistently and still in the high 80’s at night. It was all but unbearable to be inside the house because of it, so I tried to spend as much time fixing up the garage and checking out what the actual farmland looked like. The land was in great shape, it was obvious whoever used to live here took a lot of pride in their work. </p>\n\n<p>That’s when I noticed the shed. Out in the distance at the very edge of the property was a little rundown shed. I was confused because as far as I was aware there was no mention of as shed in the listing but that’s not completely unheard of here in rural Alabama. A lot of farmers need a dry place to store something and just build a shed out of whatever materials they have lying around, and it just goes unnoticed by the surveyor. The thing was in pretty rough shape though so I figured I would probably just tear it down, but who knows there might be something inside.</p>\n\n<p>Hoping into my truck I drove it out to the edge of the property so I could get a better look at what might be inside. As I got closer the first thing that hit me was definitely the smell. Growing up in these parts you get used to the odor of dead fermenting animals in the Alabama heat and this was no different. </p>\n\n<p>“Great a coyote probably up and died in there. That’ll be a joy cleaning up.” I mumbled to myself. </p>\n\n<p>I grabbed a flashlight from my truck and headed up to one of the windows to see if I could get a good look inside. Dust and cobwebs covered just about everything and my flashlight could barely make it through dirt caked window. The place was absolutely filthy and covered in dust. It seemed like nobody had been in there in god knows how long. Grabbing a dust mask from my truck I headed up to the door and prepared for what would probably be the hardest part of this flip. </p>\n\n<p>The door was stuck shut, I had to pry the damn thing off its hinges just to get inside. The heat and the smell only got worse once I entered. It had to be least pushing 120 in that little shed. There was junk everywhere, piled up to the ceiling was various boxes, books, and tools. Some of the stacks had already fallen over and were spilled out onto the floor splashing caustic chemicals everywhere. I could feel myself gagging over and over on the sickly sweet mixture of rot, decay, and who knows what else. After only being in there for a half an hour I was already pouring sweat. My shirt was stuck to my body, my pants felt heavy, and my socks were completely drenched. </p>\n\n<p>I figured I had to make quick work of this or else it was never going to get done. It was obvious that nothing was of any value so I began just chucking things out the front door. I’d sort through them another day. As I got further and further into the shed the smell only got worse. Whatever was the cause of it seemed to have been at the very back of the junk pile.</p>\n\n<p>After two hours of the heat all that remained was a pile in the back and whatever was causing the smell. I braced for the worse and cleared the top layer of junk from the pile. I didn’t brace hard enough. </p>\n\n<p>Underneath the boxes lay a bloated rotting corpse of a man. His stomach was swollen and burst from starvation and gases, his flesh lay in strips and puddles. I could feel the bile immedieatly rise in the back of my throat but I couldn’t get my dust mask off in time. Vomit filled the small paper mask, and soon the rest of my face, as I heaved forward and fell to the ground. I ripped the mask off and threw up again, only making the smell of the shed even more putrid. The man lay there eyes half melted with his mouth in a permanent scream.</p>\n\n<p>I stayed there head pounding from the heat, smell, and vomit, trying to get my bearings when I noticed something about the man. He had thick heavy chains around his neck, hands, and feet. Somebody had locked him up and cooked him alive in here. I had to call the police immediately.</p>\n\n<p>I got up to run back to my truck and grab my phone when I felt something tug against my leg. Paralyzed I slowly looked down and saw the man’s hand, flesh shredded around the wrist from struggling, holding tightly onto my pant leg. </p>\n\n<p>“Eeeeeell………..eeeeeeeeee” I heard escape his torn vocal cords.</p>\n\n<p>I fell to the ground and began crawling for my dear life. The corpse held on for a second before I heard a sickening crack and felt my leg get free. I bolted out the door and phoned the police. Looking down I realized with horror that the corpse’s hand was still hooked onto my pant leg, it was now oozing a thick black sludge from the wrist that was seeping into my sweat soaked shoe. I stomped the hand off with my other foot and lost whatever contents were left in my stomach.</p>\n\n<p>The police showed up about half an hour later and found my huddled in my truck sobbing, and covered in my vomit, piss, and sweat. I started screaming that the man was still alive and needed obvious help, but they informed me that that was impossible. The body was in advanced stages of decay and nobody could have survived in the heat that long to begin with. They took down my statement and gave me a lift back to my house a few hours later. I layed there in agony for weeks. The man’s face burned into the back of my eyes. The look of pure desperation mixed with an agony I’ll never even begin to comprehend. </p>\n\n<p>After several more rounds of questioning I was finally told what the police had discovered. The man, Jon Bergman, was the original owner of the farmland. Was last seen about 18 months ago. He didn’t have any family to speak of and kept mostly to himself so it didn’t strike anyone odd that he was no longer around. It appeared as if someone had trapped and chained him up inside the shed and left him for dead. Jon had tried to escape only to knock multiple boxes of chemicals down on top of himself, all but sealing his fate. He laid there in agony slowly burning from the fertilizers and pesticides that had fallen on him, and cooking to death at the same time. </p>\n\n<p>The police were only able to find a partial fingerprint on one of the chains that held Jon in place, but they weren’t able to match it with anyone. His face still haunts me every moment I let my mind wander. The pure anguish he must have endured. His skin slowing flaking off leaving large raw patches of flesh exposed to the elements so they could fester. The smell will probably last the longest though, long after I’ve buried how he looked in his final moments. That sickly sweet mixture of cooked human flesh and plant nutrients. </p>\n\n<p>One thought continues to keep me up at night though. Above Jon’s rotted face, above the scent of body fluid and lawn care products. It’s the thought of the shed. Jon’s final tomb was as unassuming as any other shed in rural Alabama. There are thousands just like it, and Jon’s imprisonment didn’t seem like the first of its kind.</p>\n</div>\n","author":"Yuebeo"}