{"rank":"539","title":"An ancient relic in government posession has blinked for the first time in 500 years (Part 3)(Final)","id":"8m64to","url":"/r/nosleep/comments/8m64to/an_ancient_relic_in_government_posession_has/","time":"1527291385000","body":"<div class=\"md\"><p>You can catch up by reading part 2: <a href=\"https://www.reddit.com/r/nosleep/comments/8lwv5h/an%5C_ancient%5C_relic%5C_in%5C_government%5C_posession%5C_has/\">https://www.reddit.com/r/nosleep/comments/8lwv5h/an\\_ancient\\_relic\\_in\\_government\\_posession\\_has/</a></p>\n\n<p><em>“When men are on the path to extinction, and they have created their own demise. I will make the world again.”</em> </p>\n\n<p>The words from the letter played back to me, the three of us stood in front of the presumed lock.</p>\n\n<p>I don’t think anyone wanted to make the first move and do what we had to. However I thought to myself that if my whole life was spent looking after myself, working on this mysterious artifact for no reason besides self-profit, the one thing I could do was suck it up and do this one great thing.</p>\n\n<p>I was ready to give myself to whatever lay ahead for mankind’s sake.</p>\n\n<p>“I know what we’re all thinking, I’ll do it.” I mumbled out, still somewhat unsure of myself. </p>\n\n<p>I stepped forward regardless.</p>\n\n<p>I placed the medallion into its place - or rather it did it on its own with my assistance. It seemed to have some sort of magnetic property because it quite literally flew into its spot once I held it close enough.</p>\n\n<p>Then it turned up exactly 90 degrees to the right, making an “E” which to me at this point signified something was going on that wasn’t quite right.</p>\n\n<p>“Well well, it’s an E now.” Said Halloway, his breathing grew heavier. All of ours did.</p>\n\n<p>“End. The end.” Sanchez quickly mumbled out, he was practically panting. They were more tired than I was.</p>\n\n<p>Especially when the ancient gates doors started to open up, screeching against stone and sending prehistoric dust into the air all around us. </p>\n\n<p>“Who’s first?” Sanchez motioned the way for us, a slight smile on his face. </p>\n\n<p>At least he was trying to lighten the mood. The conditions down there were getting worse by the second, and the trembling continued and continued.</p>\n\n<p>I took the first step.</p>\n\n<p><em>At last, my children.</em></p>\n\n<p>“What the fuck! Did anyone hear that? Where did that come from?” Halloway was shaking, I wanted to say I didn’t hear it, but I did. </p>\n\n<p>“Let’s try to be calm here gentlemen.” Sanchez held his composure despite what had just happened, we heard a voice. I know we all did.</p>\n\n<p><em>Yes, remain calm.</em></p>\n\n<p>We stared down the open gate, a large sanctum was laid ahead of us. Something appeared in the shadows ahead. It was as still as stone, and as large as a whale.</p>\n\n<p><em>Come, come closer. Let me get a good look at the three of you.</em></p>\n\n<p>I noticed that there were already lit braziers leading towards the giant shadowy figure, someone tended this place regularly. No way the braziers could’ve been lit up for this long, but how would anyone have gotten in?</p>\n\n<p>We pressed on.</p>\n\n<p>We walked forward to the figure and the shadows dissipated, our visual on him - or it, was clear.</p>\n\n<p>The <em>thing</em> I saw I will never forget, until my dying day.</p>\n\n<p><em>You’ve received my message, well done.</em> </p>\n\n<p><em>Are you prepared?</em></p>\n\n<p>A large statue, crude in its look sat atop a mammoth sized throne to match the statues gigantic frame. It had no facial features besides chiseled marks on its face depicting lips and eyebrows, with more chiseled marks around the crown of its head. It appeared to be a man.</p>\n\n<p>“Where is that damn voice coming from?” I muttered to myself, I was listening to its every word carefully but I couldn’t place it while staring at this stone monument, frozen by time. </p>\n\n<p>That’s when I realized it’s chest moved, it was breathing.</p>\n\n<p>“W-who are you… ?” Sanchez said behind me, his hands trembling as he dropped his light.</p>\n\n<p><em>I am the creator of all, the three of you and everything else. This world is mine, and all others.</em> </p>\n\n<p><em>I was your start and now that you’ve created your own means of extinction, I am your end.</em></p>\n\n<p>“You cannot do this, I don’t give a shit who you are. My family isn’t going anywhere, asshole!”</p>\n\n<p>Halloway was growing angry, a stupid thing to do to a god I would think.</p>\n\n<p>I was right.</p>\n\n<p>The creator raise only a finger and the stone floor around Halloway lifted up into a hand of stone, gripping him in place.</p>\n\n<p>“What the fuck do you think you’re doing!” Halloway shouted and screamed and squirmed about, but it was useless. Even more useless to try and help him which is why me and Sanchez remained silent and watched this grisly execution.</p>\n\n<p>Halloway’s eyes started to glow.</p>\n\n<p>I never knew a man could scream so terribly, his voice cracked and he coughed as he eyes grew brighter and brighter.</p>\n\n<p>Until they popped.</p>\n\n<p>He lay still, still in the clutches of the hand.</p>\n\n<p>The creator before us lowered his finger, and in sync with his action, the hand returned to the earth from where it came.</p>\n\n<p>Sanchez motioned to talk when the voices returned to our head.</p>\n\n<p><em>You must have many questions, but you have such little time.</em></p>\n\n<p><em>I will give you one answer, so choose wisely as I have little time as well.</em></p>\n\n<p><em>We all have our own agendas, don’t we?</em></p>\n\n<p>I looked to Sanchez, this one was all his.</p>\n\n<p>He stood there, mouth open as if he were going to say something but in an instant he put his head down. I could practically sense the frustration.</p>\n\n<p>“Why?” He muttered, with a dismal voice which I haven’t heard him speak in before.</p>\n\n<p><em>For the other creator, my brother. 500 years ago, a young King found our mark and came to this very place, at the time my brother was the warden of this place. He loved earth because he loved humans, the realism of it all and the emotion which defines their every action. He saw it as an escape from the great responsibility he thought we had. When your fellow man led him out of this sanctum, into a trap. I felt his death from light years away and came. It was too late for my brother but I swore to myself as they closed the gate to this place that one day when mankind has led themselves into their own trap, sealing their own demise, I would take vengeance and remake the world where humans would no longer run on their own intent. They would run on mine.</em></p>\n\n<p>“The mistakes of our ancestors is not on us, can’t you understand that much?”</p>\n\n<p><em>You’ve all made mistakes, humans were one of our great flaws in the methods of creation.</em></p>\n\n<p><em>I could’ve sent beings from another world to end you, but for my brothers sakes.</em></p>\n\n<p><em>I made this personal.</em></p>\n\n<p>I saw the creators movements, he was becoming uneasy, it was almost time for our lives to end.</p>\n\n<p>That was my cue.</p>\n\n<p>“Sorry, old friend.” The gunshot echoed through the deep.</p>\n\n<p>I dropped the gun on the floor, in the moment I felt bad but ultimately I knew it was for the greater good. He was a thief anyways. </p>\n\n<p>Sanchez was sprawled out on the floor - as still and dead as a ragdoll.</p>\n\n<p>The creators head shifted towards me.</p>\n\n<p><em>And what was that about? What are you poking at, mortal?</em></p>\n\n<p>I raised my arms and motioned to talk, but paused.</p>\n\n<p>It was a ruse.</p>\n\n<p>With all the haste I could muster I twirled around and threw my satchel I brought with me, what my “colleagues” thought to be heat signature reading devices was actually a sufficient amount of C4 capable to collapse a theater. </p>\n\n<p>I practically slid out of the sanctum and onto my cable cord when I heard his deep, frankly terrifying voice once again, I hadn’t noticed but I was shaking.</p>\n\n<p>I pressed the trigger device.</p>\n\n<p><em>Explosives? You’re</em> really that stu-</p>\n\n<p>Boom.</p>\n\n<p>The earth around me shook greatly one last time before I rose above ground and walked out of the smoke and dust that was once stonehenge.</p>\n\n<p>Our escort had left us, I guess all the noise and trembling of the ground beneath them had them running on their heels.</p>\n\n<p>No matter though, I had elsewhere to go.</p>\n\n<p>______________________________________________________________________________</p>\n\n<p>My name is Daniel, I am a direct descendant of one of the founders of the original Royal Expedition League. I was told when I was young by my father that our organization was no</p>\n\n<p>“Short term group” and that we’d have to continue on for the sake of humanity.</p>\n\n<p>There are evil and mysterious things out there, most of us don’t even know of the horrors that await us on the other side of our perceived reality. Reality is far different than that which our governments have shown us.</p>\n\n<p>These horrors the governments of the world try to preserve, for the sake of their own sinister schemes are things that should not be toiled with except for those who seek to carry out appropriate measures to ensure the survival of our kind amidst all this shadowy chaos.</p>\n\n<p>The government, like my fathers organization seeks them out at every cost. We knew we had to destroy this based on a message received 500 years ago. However at that time it was said the medallion spoke our language, why morse code this time? I don’t know.</p>\n\n<p>What I do know is that there are many artifacts left to recover - or destroy.</p>\n\n<p>I will have to travel back to our HQ on an unmarked isle, but that won’t even be the hardest part.</p>\n\n<p>Then again, I can’t guarantee his death. We are safe for now though, I would hope.</p>\n\n<p>Till next time, Reddit</p>\n\n<p>- Daniel K, Chief fieldsman, Royal Expedition League</p>\n\n<p>____________________________________________________________________________</p>\n\n<p>The creator holds knowledge beyond any of us.</p>\n\n<p><strong>He still fell for the same trick.</strong></p>\n</div>\n","author":"Gorbado"}