{"rank":"14","title":"There Might be a Monster Under My Bed","id":"8m651v","url":"/r/nosleep/comments/8m651v/there_might_be_a_monster_under_my_bed/","time":"1527291446000","body":"<div class=\"md\"><p>I live in a haunted house. I’ve lived here for about 5 months now. Over that time, I’ve experienced a number of inexplicable occurrences I’d like to detail here, concluding with my most recent incident, which is by far the creepiest and most disturbing. </p>\n\n<p>When I bought this house, I wasn’t aware of the state of things. I was told by the realtor that the house was “vintage” and “rustic,” but what really stood out to me was when he said “Trust me, you’ll really like this house; I can tell because it’s calling your name.”  I now know he was just trying to quickly sell me the house to get it off his hands. I’m the type of guy who enjoys nature, so an isolated rustic/farm house, would suit me perfectly. Based on this, and the fact that it was relatively cheap, I jumped at the offer. In retrospect, maybe a little too quickly.</p>\n\n<p>About a month after my move I began noticing that something was off. I’d hear frequent bumps in the night, and strange thuds, along with other strange, unexplainable noises throughout the house. At the time, I tried to attribute these sounds to the age of the house, but they happened so frequently, and were so unnatural, that I soon began to suspect something else was to blame.</p>\n\n<p>Furthermore, every now and then items of mine would go missing, and turn up in places they shouldn’t be. For example, I once misplaced several pairs of socks, only to find them stuck to the ceiling in different rooms. No matter what happened though, I would still try to come up with a reasonable explanation but the following occurrence has no reasonable explanation:</p>\n\n<p>It was late one night, and I was getting ready to go to sleep, when I heard something coming from downstairs. (<em>To be clear, my bedroom and bathroom were on the second floor, and the living room and kitchen were on the first floor.</em>) I walked out into the hallway, and stood there listening for a moment to try and understand what I was hearing. After a few seconds, I realized I must have left the television on in the living room. I was pretty tired, so it wasn’t impossible that I simply forgot to turn it off before coming upstairs. I walked down the stairs and stopped when I reached the bottom; the lights in the kitchen were still on. I found this rather odd due to the fact that I clearly remembered turning them off before going upstairs; however, I shook this off because I figured if I was tired enough to forget to turn the television off, than I probably forgot to turn the lights off as well. </p>\n\n<p>I turned around to face the living room, which is just off from the kitchen, and jumped at what I saw; the dark shape of a man seated on my couch. I called out to him, “Hello,” but got no response. I walked over to the couch, and became even more bewildered by what I saw. I didn’t realize it at first but due to the fact the lights were on, the man should have been fully visible but was not; I could only see his silhouette. I suddenly realized why it looked so strange; it was as if someone had taken the shape of a man and made it into a cardboard cutout. The silhouette was two-dimensional! As I stared at it, I saw…no, felt, something was odd. And there was something popping in and out of its chest. It was a heart. My eyes were fixated on it as it continued to throb vigorously. I could swear that I felt the heart pulsating in my head; like an uncontrollable pounding.</p>\n\n<p>I picked up the television remote, which was sitting on the arm of the couch, and hit the power button. The television screen went black, and just as quickly as the display dimmed, the silhouette was no longer there. I almost didn’t believe what I had just seen. There was no scientific or logical explanation for this encounter whatsoever.</p>\n\n<p>The next occurrence is distressing and extremely off-putting and made me start to wonder if this was personal. </p>\n\n<p>After a long day of work, I had come home, and decided I’d take a shower to calm down and relax. Upon getting out of the shower, I heard a strange noise coming from the kitchen. The walls in the house were very thin, so any sound made anywhere in the house could be heard very clearly, regardless of which room you were in. I exited the bathroom, wrapped in nothing but my towel, and stood in the hallway for a minute listening to see if I’d hear the sound once more. I didn’t, so I cautiously went down the stairs, calling out, “Hello? Is anyone there?” Of course I got no response, but what I saw when I reached the base of the staircase confuses me to this day. There, on my countertop, was all of my silverware. They weren’t simply sprawled around or anything like that; they were all standing upright. Now, my silverware had curved hilts and handles, so it’s absolutely impossible to stand them up on their own like that. The only way it would be possible to do so is if someone were to stand there holding them that way.</p>\n\n<p>I just stood there, dumbfounded by what I was seeing. Suddenly, the silverware dropped, and I flinched as a loud clang sounded throughout the house as forks and knives clattered onto the floor. I walked over to where they’d fallen and noticed they were aligned on the floor in such a way that they all pointed towards me; as if I was a magnet that had drawn their tines and blades my way. Utterly confused and startled, I ran upstairs to get dressed before cleaning the mess; but upon returning downstairs, observed that the silverware was no longer there. I opened the silverware drawer to find every piece back where it belonged. To this day, I have no explanation for this disconcerting event.</p>\n\n<p>The next occurrence is something even stranger, and more unsettling. As usual, I’d hear the occasional strange noise and such, but that was it. No silverware standing by itself on my countertop, or two-dimensional silhouettes watching television. A few months had passed since my last two incidents, and I felt that things had gotten better, but I was wrong.</p>\n\n<p>It was late one night, and I had been sleeping soundly, when I suddenly awoke with a chill. I didn’t know why I was so cold, because I had turned up the heat, and bundled up with three blankets before going to sleep that night. I sat up in my bed, and just listened for a moment, expecting to hear something but did not. I glanced down at my bedding and noticed one of my blankets was missing; my thick quilt, the blanket that had been the main source of my warmth that night. I leaned over and checked both sides of my bed to see if it had fallen onto the floor while I was sleeping, but it hadn’t. </p>\n\n<p>I pulled off the rest of my blankets, now shivering from the near freezing temperature in my room, put on my bathrobe, grabbed the flashlight off my nightstand, and walked over to the thermostat (<em>it was one of those old round ones</em>). I shined the flashlight on it, and noticed the little red indicator was on the 50 degree peg and the AC was running. Now, I was even more confused. I had turned on the heat and set it to 70 degrees before going to sleep that night; there was no way it could have changed on its own. Anxiety crept over me as the thought that perhaps someone else could be in the house shot through my mind.</p>\n\n<p>I exited my room and slowly shined my flashlight down the hallway to check for signs that someone else was in the house. I saw nothing, so I proceeded down the stairs and paused when the kitchen came into view; my heart nearly stopped. You know how people put a sheet over their head to pretend to be a ghost? That’s what I was seeing. Just beyond the countertop, standing at the sink, was something wearing my quilt. </p>\n\n<p>Due to the sheer size and length of the quilt, it fully covered whatever was under it. My flashlight only provided me with so much light, but I could roughly make out the physique of the figure, and what disturbed me most was its face, or lack thereof. I could make out where its head and shoulders were, and naturally I would have been able to make out where its nose and face were, but it appeared that this figure didn’t have one. Where the protrusion of its nose should have been, it was flat, as if its face was just a blank canvas. Against my better judgment, I called out to the figure; “What are you doing here? Please leave!” At this, the figure turned towards me. Startled by its sudden movement, I jumped a bit, nearly dropping the flashlight. </p>\n\n<p>Slowly, the figure began walking towards the stairs. “Please, just put the quilt down, and leave. There’s no need for a confrontation.” My voice wavered as I spoke; my words falling on deaf ears as the figure continued.\nI instinctively began backing up the stairs out of fear that this thing would dart up and try to overtake me. I suddenly realized I hadn’t blinked for the duration of the encounter, and my eyes were beginning to sting. I blinked quickly, and in the split second my eyes were closed, the thing had moved and was now 4 steps away from me. Startled by this, I jumped back and thudded against the wall behind me; the flashlight fell from my hand and landed on the stair below me. Out of pure panic, I ran back up the stairs, into my room, and locked the door. I just stood there in the darkness, listening for the footsteps of the figure. After several minutes of silence had passed, I slowly felt my way through the the inky blackness, back to my bed. Knowing there was no way I was getting back to sleep after all that, I sat on my bed shivering until sunrise.</p>\n\n<p>Once light illuminated my house, and I was more tired than afraid, I unlocked my bedroom door and opened it; there, on the floor right in front of the door, was my quilt, neatly folded. Sometimes I think I was just really tired, and dreamt the whole thing because nothing like that has ever happened to me before, and after this incident, nothing like it ever happened again, but there simply isn’t an explanation for how my quilt could have ended up outside my room, neatly folded all on its own. </p>\n\n<p>The following occurrence is the final, most recent one. Having happened just two days ago, I’m still conflicted about what exactly I should do about it. </p>\n\n<p>(<em>For context, every so often, I’d have vivid dreams that are extremely strange and symbolic. Sometimes they’d be of a room, with one door. I’m standing outside of the room, looking at the door, and all of a sudden the door will begin to violently shake as something trapped inside begins pounding furiously on it; the desire to escape is palpable. Other times my dreams would consist of a lone cage seated in a white room; inside the cage is an indistinguishable black silhouette. Similar to my previous dream, the silhouette has a palpable desire to escape. Usually, after the dream, I’d wake up, and sit bolt upright in my bed, beads of sweat dripping down my forehead; other times, I’d swear I could feel the pounding door beneath me as I slept. Sometimes, before I even fell asleep, I’d feel something pounding underneath my bed. The bed would shake violently, as if something was trying to escape from underneath it. The pounding didn’t happen every night, only nights I’d have one of the two aforementioned dreams.</em>)</p>\n\n<p>It just so happens that I had been having those dreams almost every night for a week before this most recent incident and the pounding associated with the dreams got progressively worse each night. On the night of the incident, the pounding had been so violent that I was thrown out of my bed. I decided enough was enough; I was going to move my bed to try and find the cause of the pounding and put a stop to it once and for all. I stood up, turned on my bedroom light, and walked over to the foot of my bed. I stood there for a moment just staring at the mattress, waiting for the pounding to resume, but it did not. I grabbed the foot-board and moved the bed aside. I walked over to where my bed had been, and stood within the indentation it made on the carpeted floor. I knelt down and knocked forcibly on the floor. To my surprise, I heard a hollow thud, as if I had just hit a wooden panel. I immediately ran downstairs and grabbed a box cutter to remove the carpeting. </p>\n\n<p>Upon removing the carpet, I discovered there indeed was a wooden panel. I could tell it was really old, because the wood had that sickening grey color it gets when it begins to rot. I forced the box cutter’s blade into one of the crevasses in the wood, and used it as a lever to lift the panel. When I peered into the hole, the most intense, gut-wrenching smell filled my nostrils. I almost vomited right there. The smell of old pipes mixed with rotting…something… did not make for a pleasant aroma. Holding back my vomit, I took a good long look down at the gaping hole in my bedroom floor. There was a set of old wooden stairs, seemingly leading into a hidden room under my bed. I was confused because my bedroom was right above the kitchen, and in order for this space to be here, there’d have to be some structure jutting out of the kitchen ceiling, but there was not. Despite this logical flaw, and the uninviting scent, I carefully made my way down the rickety stairs. </p>\n\n<p>The room was really small; I’m talking not even half the size of my bedroom, which wasn’t very big at all. The ceiling was really low and I had to crouch in order to fit. Along the right wall was a long desk that ran the length of the wall; I could see rusty piping underneath it. Above the desk were several metal cabinets; each padlocked. All along the opposite wall, were several large bins. Each bin had a faded label on it, except for the bin closest to the farthest wall. That bin was open and the label appeared relatively new. From where I was standing, I was able to make out what was written on it; the date I moved in. An intense feeling of anxiety crept over me. <em>Why was that date written on that bin? These bins had to have been down here for a very long time, and there was no way that the previous owners could have known the date I’d be moving in.</em> While this information did creep me out, I wanted to know what was in one of these bins. My curiosity got the better of me, and I walked over to the nearest bin, and lifted the lid; I wish now, that I hadn’t done that. </p>\n\n<p>Inside were the skeletal remains of a young child. I dropped the lid, and fell backwards; disgust and anguish overwhelming me. <em>Why was this under my bed? And who put these bins here?</em> These thoughts ran through my mind as I tried but failed to make sense of what I had just discovered. I hadn’t noticed before due to my shock but my lungs were burning, and my eyes were watering from whatever fumes I was inhaling while down in that room; I had to leave. I ran up the stairs, threw the wood panel back over the hole, and ran out of my bedroom, down the stairs, and out the front door.</p>\n\n<p>Once I regained my composure, I went back inside and sat down on my couch in the living room. It then occurred to me that I had only glanced into one of the several bins. I could only imagine what other atrocities could be hidden within the others. All at once I thought back to the banging underneath my bed. <em>Could something be alive down there? Could it now escape since my bed was no longer trapping it?</em> Now, scared that something could escape, I ran back upstairs and into my bedroom; my eyes immediately darting to floor. The wood panel was still in place over the hole. I walked over and grabbed the loose section of carpet, picking it up and throwing it to the side. I then pushed my bed back to its original position over the wooden panel; hopefully keeping whatever malevolent forces beneath it at bay.</p>\n\n<p>Suddenly, the pounding began; the mattress shook violently, bouncing up and down on the metal bed frame. For a second, I thought about throwing myself on top of it to keep it in place but did not. I felt as though I was going insane; the pounding seemed to infiltrate my mind. I covered my ears with my hands and ran out of the room, back downstairs and into the living room. I sat down on my couch, and curled up into a ball, hands still over my ears, praying that the pounding would stop. I just sat there on the couch for the rest of the day, listening as the pounding continued to assault me.</p>\n\n<p>I’ve since moved out of that room, and now sleep on the couch in my living room. Every night I hear the pounding; getting louder and more forceful. It’s only a matter of time before whatever’s down there breaks free. I have no idea what to do. I’m thinking about moving heavier objects on top of the panel, but I’m too scared to move the bed in order to do so. There’s something very powerful and very evil in that small room and I don’t know if I want to stick around much longer to find out what it is. I think I might have to give my realtor a call…</p>\n</div>\n","author":"TheShapeShifter20"}