{"rank":"6","title":"Gina.","id":"8m6al4","url":"/r/nosleep/comments/8m6al4/gina/","time":"1527292987000","body":"<div class=\"md\"><p>It all started when I was 1. Don&#39;t ask me how I remember these things but be prepared. my mother abandoned me when I was born so my dad raised me. we lived with my grandma until I was 2. while we lived with her, I remember having and imaginary friend named Gina. I never saw her, she would always hide from me. all I would ever see were her black sneakers. she told me terrible things. and I mean terrible. the things got progressively worse and when she began telling me to hurt my dad, I didnt want to be her friend anymore. then I never saw her again. my toys would move by themselves but I never thought anything of it. after all, I was only almost 2 at this point.\n      then, my dad got us our own little house. we only rented but I loved the place. about 3 months after we moved in, I told my dad &quot;i see ghosts dad.&quot; he would always laugh it off. at this house, we didn&#39;t use the front door because it was a bit hidden, so we always used the side door which you could see from the front of the house. when you walked in the (side) door you were in the kitchen. from there you had 2 ways you could go. there was a doorway on the right which led to the living room and a doorway directly in front of you which led into the hallway. on the left side of the hall, there was the laundry room and the bathroom, at the end of the hall was my room, and on the right side was my dad&#39;s room. it&#39;s a really simple house to be honest, but it was only me and my dad, so we were very happy there. we always kept the laundry room door shut because my dad didn&#39;t like that room. \n      we had a childhood cat named Loaf. one time I was walking out of the laundry room and Loaf was sitting there hissing at me. that&#39;s when I moved and realized that Loaf had been hissing at something behind me, and from that day on, the nightmares came. they were of Gina. \n     I refused to sleep in my own room, so I always slept in my dads. when he would go to bed after me I would cry and cry because I was so scared to be alone. there were no windows in the hallway, only a very dim that we never turned on since it was a relatively short hallway.\n      you know on those sunny days when you are in a room with a window and you can see rays of light coming through the window and you can see all the dust flying through it? yeah, those. in our hallway, I would always see those moving through it. the only problem was that they were straight up and down. the thing is, is that there was so skylight. \n     as I got older, these &quot;occurances&quot; became less frequent and I slept in my own bed. when I was 10, we moved into the house I live in now. when we moved here I started experiencing sleep paralysis and lucid dreams. they started off so simple. my first one was as followed: I &quot;wake up&quot; not able to move anything but my eyes. I look towards the door and an old woman, a typical grandma, walks into my room, sits on the end of the bed and stares at me. I did not recognize the woman, and weird enough, she didnt feel like a threat.\n      they started getting worse. the woman would pull me off the bed and try to get me into the mirror. it was terrifying. my dad got married and so I have a brother and everyone in the house agrees that something is here. my stepmom&#39;s keys are frequently not where she puts them, my brother sees things in his room at night, although, my dad refuses to acknowledge any said spirit or being. he did in our last home too, and he is barely acknowledging it now. \n     I&#39;ll keep you posted.♡</p>\n</div>\n","author":"talaiahlee"}