{"rank":"49","title":"A Very Pretty Princess","id":"8m6agg","url":"/r/nosleep/comments/8m6agg/a_very_pretty_princess/","time":"1527292949000","body":"<div class=\"md\"><p>Being a single dad is hard.</p>\n\n<p>Don’t get me wrong, there’s nothing on this earth that could ever make me resent my daughter. But since her mother passed things have been rough. There are just some ways that a mother can love a daughter that a father just can’t manage. I do what I can though. I’m a trucker and I work long hours, for days sometimes. So Riley (my beautiful babygirl) has been living with her grandparents full time for a while now. I see her every opportunity I get, I just want to make her happy but I know I’m missing important parts of her childhood and it kills me.</p>\n\n<p>When she told me over the phone that she wanted a princess dolly for her birthday, well I knew immediately what I had to do. If my daughter wants a princess for her birthday then I’ll be damned if she doesn’t get one.</p>\n\n<p>It was honestly pretty easy picking her out, I went to a few places just to check and see what my options were. I only want the best for my princess. When I saw her I knew she was the one. I absolutely had to have her, she was perfect! Beautiful pale skin, piercing blue eyes, heart shaped lips, and long blonde hair that was delightfully silky. I mean, she was also pretty grimey but that’s nothing I can’t fix.</p>\n\n<p>Have I mentioned that I hunt pretty frequently? When I’m not on the road or trying to see Riley you can usually find me in the woods. I have quite the collection back at my home, my office area is full of stuffed buck heads, ducks, and there are a couple of bobcats in the mix. I’m pretty good at hunting and even better at stuffing a good kill.</p>\n\n<p>But human skin proved to be much more delicate than than a deers, not to mention the tools I was using were probably not suited to skinning a young girl. It didn’t matter though, all those ugly marks would be well hidden by a gorgeous dress that I’m ashamed to admit I dropped a couple hundreds on. But it’s like I said, only the best for Riley!</p>\n\n<p>I really don’t know how you girls do it! Makeup is incredibly hard and so precise it took me a couple tries to get her face looking perfect. I had stopped at Walmart to pick up some things to get this princess all fixed up. Like a curling iron, some makeup (I really didn’t know what to get so I just threw some stuff in my basket) along with some bleach, sponges, and bins. The cashier gave me a suspicious look but stayed quiet. This was coming together so perfectly, I knew the moment Riley saw her present she would lose it! What other girl her age had a life sized princess?</p>\n\n<p>Once I was finished with everything I carefully wrapped the body in some old gift wrap I found and carefully placed her in the bed of my truck. I was literally shaking with nerves when I pulled up to Riley’s grandparents house. There were pretty pink balloons tied up to the mailbox, one in the shape of the number 6. I bounced up the stairs leading to the front door and knocked. I waited patiently, when I got no answer I knocked a second time but louder and with more purpose. The door creaked open slowly and was stopped by a chain lock, I could see Riley’s grandfather Tim peeking at me.</p>\n\n<p>“Go home Jim, you need to leave now.” His voice was wavering. I promise you there are no words for the rage that settled at the bottom of my stomach when he said that. But I kept my cool, this was a special moment for me and Riley and I didn’t want to ruin things just yet.</p>\n\n<p>“Tim please, it’s my daughters birthday and I haven’t seen her in months. I brought her a princess doll. Could I at least see her long enough to give it to her?” Custody is a tricky thing, after her mother passed the court ordered me unfit to parent because of the hours I worked and a few misdemeanors here and there. So sneaking around and showing up at her window at night, or on the playground of the daycare she attended was usually my way of getting to see her. Until a couple months ago and now I’m technically not allowed within 100 yards of her. But it’s her birthday and I’m her father! They can’t keep her away from me like this it’s just cruel.</p>\n\n<p>Tim sighed heavily and shut the door, I heard the rattle of the chain being unhooked and let go the breath I’d realized I’d been holding. “Let me see the toy first okay Jim.”</p>\n\n<p>“Yeah, sure of course.” I led him to the car and opened up the truck bed, I wanted Riley to unwrap the gift herself but I wanted her grandfather to see what I’d been working so hard on. He’d believe I was a good father when he saw how hard I’d worked on this gift for Riley.</p>\n\n<p>When I peeled back the wrapping paper, his face paled and he brought his hand to his mouth gagging a bit before stepping back. “What the Fuck Jim? Please tell me this is some sort of sick joke, and for the love of god tell me that girl isn’t dead.”</p>\n\n<p>I rolled my eyes, of course he hated it. He hated me, he hated me when I married his daughter, and he hated me even more when she died. That’s why he took Riley away from me, it’s just some sick personal vendetta. But I’m a good father! I work hard and Riley is the light of my life. I really didn’t want for this to get messy but I knew what I had to do to protect my princess. So I grabbed the gun in my waistband and hit him with it, and I hit him haaaard.</p>\n\n<p>“Daddy?” That sweet voice hit me like a ton of bricks, and I whipped around to see my angel looking up at me with those big brown eyes. “Daddy is grandpa okay? Why did you hit him?”</p>\n\n<p>I was sweating, this had gotten a little out of hand. “He’s just playing dead baby, have you ever seen a dog do that? Where’s your grandma?”</p>\n\n<p>“Haha! grandpa you’re silly!” She bent down to pat him on the back. “She’s getting cake for my party tomorrow! Are you coming daddy?” She really knew how to make my heart melt.</p>\n\n<p>“Uhm.. You wanna get some ice cream Riley? It’s my treat for your birthday, and you can even sit up front with me.” I was stammering, we needed to get out of here.</p>\n\n<p>“Yes daddy!” She giggled and held her arms upwards, motioning for me to pick her up. I got her in my truck as fast as i could and sped the hell off.</p>\n\n<p>My nerves were starting to ease a couple hours into the drive, I told Riley we were going to a special ice cream place far away and since then she’s slept peacefully right next to me. She hasn’t seen her gift yet, only commented on how weird the car smelled. My phone buzzed and made a screeching alarm sound that made my heart sink, I didn’t want to look at my screen in fear of what I might see. I guess I didn’t hit the bastard hard enough because he managed to get my license number and now there’s an amber alert out for my vehicle. It doesn’t matter though. They won’t manage to catch me, I’m willing to do anything to protect my princesses.</p>\n</div>\n","author":"crimewave001"}