{"rank":"5","title":"midnight greyhound to barstow","id":"8m6bb2","url":"/r/nosleep/comments/8m6bb2/midnight_greyhound_to_barstow/","time":"1527293218000","body":"<div class=\"md\"><p>it was a friday afternoon in phoenix arizona when I had my ticket ready to depart out to barstow california </p>\n\n<p>first of all if you have never been to barstow dont plan anything soon that place is literally one small half ghost town in the middle of the fucking desert.</p>\n\n<p>well I had to visit my mom and my stepdad (I ship off to the army in 3 months) and it was there while i was standing in line there was this weird smell next to me kinda of like rotting meat but for some reason as close as I was to all the other people standing in line I was the only one who was able to detect it. </p>\n\n<p>The time was about 6pm and I had a 8 hour journey ahead of me so I stocked up on as much caffeine as I could because there was no way i was sleeping on a bus headed to barstow ( nothing good comes in or out of that hell hole) </p>\n\n<p>I turned my head to figure out where the smell was coming from but I could not find a source but thats when I saw a man who was gazing right at me sitting in one of the seats closer to the center of the large lobby it made me slightly uncomfortable but i kept my cool and just turned away </p>\n\n<p>we all boarded the bus and i was one of the last ones in in front of an asian and some african fellow who was talking about anime over the phone and was headed  to LA to catch a place to japan for some odd reason. </p>\n\n<p>well I got settled in one of the back rows which no one really sits by because they dont like the smell that comes out of the bathrooms from the back of the bus, but I open up the restroom window which is almost impossible to open but it kills any bad air coming into the cabin. </p>\n\n<p>we were about 3 hours in i believe it was almost 10 and that same smell appeared again i quickly looked around with slight panic and anxiety wondering if i would make the sane grim connection as i did in the lobby with that creepy old man and to my own belief 2 seats of head i saw him staring right back at me.. same glaze he had earlier except this time he was much closer he had these baby black eyes and a really oval looking head kind of like dr phil if you could imagine he was wearing a hat that was labeled &quot;luxor&quot; on it to my guess he was a vegas man. </p>\n\n<p>I shrunk down lower to the seat and closed my eyes and thought and whispered to myself my god how can this be, he was clearly not in line or did i ever see him board the bus I thought i was going nuts for a second like all i could think of was the episode of twilight zone where that women picks up the sailor headed west with that weird hitchiker following her the entire way</p>\n\n<p>but anyways i looked over to the man sitting next to me didnt speak a work to him the whole ride kind of like we both knew the gig and just stayed quiet, well the bus was completely dark except for one light up ahead by the driver a very dim light and the sound of the bus engine buzzing only if one was to pay much attention </p>\n\n<p>well i spoke to the man next to me chill guy as he seemed in his late 20&#39;s early 30&#39;s i didnt catch his name but i felt a slight connection that we both had something in common i have a slight sense to single people out who are like me with any common trait </p>\n\n<p>but i asked him if he saw the man up ahead and he said no but from the crack of both seats in front of us i could see his shoulder resting and for a brief second his eyeball glanced through the crack and looked right at me ... at this point i freaked and quickly turned over to the window side where i was not in view of anyone the guy next to me asked if i was good.</p>\n\n<p>i told him it was that same guy again looking at me very strangely and that darn smell that stupid smell only i was able to smell but i just let it be, the man next to me offered me a bump of some blow. i agreed took some he said it would take the edge off at the point i found the slight connection i had with him we were both middle class coke heads. </p>\n\n<p>we had a small conversation to draw away the fact that there was a man who was following me and he said its probably all in my brain i agreed and followed up with another question i asked him if  hes ever done enough coke to change a certain smell, &#39; its happened to me &#39; and he said yes </p>\n\n<p>i asked him to continue about how when and where he told me in barstow (where he lived) there was this abandoned building he snuck into with a few friends and did a bunch of drugs and partied it up a  bit when they stumbled upon a dead body of a man. he paused looked at me and looked ahead then looked back. then he just stopped talking </p>\n\n<p>we got off in indio and took a smoke break i was the first to stand up and walk right by the strange man whos been watching me for what it felt like an eternity and i had this cold feeling go up my shoulder i walked out took a smoke break and got back on the bus it was a pretty darn cold. I got on and the bus drove away i had a feeling something was missing untill i looked over to my right and the man next to me was left behind i looked around for his belongings and i could not find any its like he came on with the clothes on his back</p>\n\n<p>well we were in san bernardino when a different man boarded and sat right next to me he seemed kinda off like he was a little nuts he claimed he was a preacher at this point i had no sight of the strange old man who had been looking at me it had been about 2 hours i didnt even see his face when i boarded on back from my smoke break</p>\n\n<p>well the man next to me kept talking and talking about god and just some weird shit then he got into the 2-pac revelation and thats when i closed my eyes and drifted off hoping i could get some sleep i was worn out by all the caffeine. I opened my eyes again only to see the lights of barstow not so far away</p>\n\n<p>to my amazement the man next to me was still fucking talking i dont know if he knew i was asleep but at that point i figured he was just downright nuts.. well i got to the barstow station got up into the isle of the bus and the crazy dude i was sitting next to said something that sent chills up my spine. </p>\n\n<p>what I heard you wont believe but to his exact words he said &quot; tell me if you see him &quot; my eyes just opened i hurried off the bus and started walking thats when that smell hit me again and I heard footsteps coming right up behind me</p>\n</div>\n","author":"victorlara666"}