{"rank":"3","title":"German Ghost Knocking","id":"8m6bhd","url":"/r/nosleep/comments/8m6bhd/german_ghost_knocking/","time":"1527293269000","body":"<div class=\"md\"><p>Hey everyone! First post on my part but being a fan of paranormal stories I think it is time to share one of my experiences for all the other fans out there. </p>\n\n<p>I was born and raised in Germany and this is also where it took place. </p>\n\n<p>In 2000, when I was 13 years old, my parents and I moved from an apartment into a house.</p>\n\n<p>I knew the house for as long as I can remember since my grandparents lived right around the corner and still do. </p>\n\n<p>The house was built in 1903 and at that point it was in pretty bad condition inside and out, but my mom fell in love with it one day and so we started to renovate. </p>\n\n<p>It is a fairly big house. High ceilings, had an unfinished 2nd story with a half finished room and a huge attic. The family that lived there before did not take good care of the house and themselves and the grandma of the family stayed in the half finished room on second story. My dad took out the walls on second floor, divided the now open space in smaller sections and 2/3 of the second floor became my room. </p>\n\n<p>I loved it! It was big and me being a teenager at that point I was able to spend most of my time in my “little apartment”. Outside my door was now a little corridor with a door to the bathroom and another leading to my parents bedroom before the staircase starts. </p>\n\n<p>But now onto the main events.</p>\n\n<p>One night around one and a half years after we moved in, my parents went to a family gathering, but since I didn&#39;t feel well I stayed home, watched some TV in my room and slowly drifted off. </p>\n\n<p>Suddenly I woke up to a knock on my bedroom door. It was around 12:15 at night and assuming it was my parents being back and wanting to check on me I answered for them to come in. Nothing happened. A few seconds later another knocking. This time twice. Again, I said “come in! I’m awake”. I was getting a bit annoyed at this point. And again, nothing happened until it knocked twice again. I got out of bed yelling what was wrong. I flung the door open and stared into the black emptiness of the hall way. And yes, that was the moment where I freaked out a bit. </p>\n\n<p>I closed the door very slowly and wandered back to bed. Sitting on the edge of the bed I started thinking. While renovating we kept the old wood floors upstairs, they are crazy noisy, not to mention the old staircase leading downstairs. Without any doubt I would have heard if someone moved away from my door. I knew the familiar sound of the boards squeaking. But there had been NOTHING! I got up again, looking outside my window to see if there was light coming out of the windows of the first floor, but there was nothing either. I started to tell myself the same thing I have read and heard a lot of other people do when they experience something strange, that it was just imagination. But somehow I didn&#39;t really believe it. </p>\n\n<p>In the year of 2002 I didn’t have a cellphone yet and the closest landline was in front of my parents bedroom door on the other end of the hall way. I thought about calling my dad on his cellphone but decided I was not brave enough to open my door again and walk through the dark corridor. </p>\n\n<p>I am not sure for how long I was laying there with my heart pounding like crazy but the next morning I woke up wondering if it all was a dream. I opened my door and heard my parents from the first floor talking. For a few hours I was debating wheatear or not I should tell my parents but decided to just do it. They laughed it off as I expected and assumed it was my vivid imagination.</p>\n\n<p>My parents did not believe in the paranormal so of course they contributed the knocking to an old house making settling noises. </p>\n\n<p>I, for my part have always been positive that something paranormal happened that night but sliding more and more into puberty other things became more interesting. I did have some other experiences in the house but that’s not the time and place for it.</p>\n\n<p>Fast forward to 2016. I started attending grad school in the U.S. Very important info at this point, after I moved out my parents took over my old room and made it into their new bedroom.</p>\n\n<p>One day while skyping with my parents my mom told me a story that sent shivers down my spine.</p>\n\n<p>My dad works nightshifts once in a while and she was alone at home. She is very careful with locking the doors and everything so that she can sleep with peace of mind. She even locks the bedroom door (my old room door). </p>\n\n<p>She told me she was woken up in the middle of the night by knocking at the bedroom door. Knocking at first once, then twice and twice again. She said she immediately remembered my story from years ago. She even called my dad at work and he came home early. After realizing every door and window was still locked they checked the security camera footage outside which also showed nothing. </p>\n\n<p>My mom told me she believed me now and somehow I felt satisfied that she experienced it too. </p>\n\n<p>Nothing happened to her after this and so I think it just became a distant memory. But fast forward again to last summer. </p>\n\n<p>My grandma lived in her house around the corner her whole life and somehow the topic of the family that lived in my parents house before we moved in came up. We talked about in what horrible condition the house was and that the families&#39; grandma had to stay in that tiny room upstairs. And then my grandma told me that the old lady actually died in that room 12 years before the family moved out and she always wondered why no one of the family moved into that room after that. </p>\n\n<p>Well, having this knowledge now I think the ghost of that poor old lady wanted to get back into her room that was part of my old room and now is part of my parents&#39; bedroom. </p>\n</div>\n","author":"Nico120987"}