{"rank":"398","title":"Online dating really isn't for everybody.","id":"8m6bvc","url":"/r/nosleep/comments/8m6bvc/online_dating_really_isnt_for_everybody/","time":"1527293367000","body":"<div class=\"md\"><p>I know a number of people for whom online dating has led to lasting, meaningful relationships, many still going strong as I write this. A close member of my extended family met his wonderful wife online, so please don’t take this as a criticism of the entire subject. My situation is just a bit...different.</p>\n\n<p>Please don’t take this as me being arrogant, but I’ve never had trouble attracting the attention of girls. I’ve had several relationships both long and short term, some good, some awful. Over the past half a decade or so, however, I’ve become sort of a recluse. I work from home, and really only have one friend with whom I stay in regular contact; the rest of my old friends are still involved in a lifestyle that would have killed me if I’d stayed. That being the case, I don’t find myself with many opportunities to meet women. So I decided to try online.</p>\n\n<p>About a year and half ago, I made a profile on one of the most popular sites, something along the lines of “abundanceofsalmon.com”, and began looking around casually, not really expecting to find anyone with whom I’d see a chance with. Six fruitless months or so had gone by when I checked my email and found an alert from the service saying that someone was interested in me. This had happened before, but they were from women I didn’t have much interest in. This one was different. She had a look to her that just caught my eye, and her profile picture caption was a quote from <em>Captain America: The Winter Soldier</em>, so I thought she might be worth looking into.</p>\n\n<p>Her name was Heather, and she lived about an hour away from me. She had shiny brown hair that hung past her shoulders and a matching set of eyes. Her teeth were perfect, annes d she had a wonderful smile. Her body type was such that I was curious if I’d unwittingly commissioned someone to build her in a factory to my preference. She was short and thin, with a tattoo on each shoulder blade. She was very pretty, and the other details of her profile told me she had a sense of humor, which is of the utmost importance to me. I decided I was going to move forward, so I sent her a simple message “introducing” myself.</p>\n\n<p>She responded a few hours later, and we hit it off immediately. We discussed our likes and dislikes, our favorite movies, music, places we’ve been. After a bit we got into more baseline personal stuff, where we were in our lives, jobs, etc. More time went by and we delved into our past relationships, what we were looking for in any potential future ones, etc. One afternoon a few months into our correspondence, which spanned first the website, then email, then texting and phone calls, I asked if she would want to video chat. She informed me that her laptop camera was broken, but that she would do so on her phone later on in the day.</p>\n\n<p>I know what you’re thinking, huge red flag. I thought the same thing. When she told me that, I was all but ready to never talk to her again. But as it were, later that night, my phone lit up with her contact information and jingled the tone that accompanies an incoming FaceTime. I answered, and there she was. She began the conversation with <em>”I thought about the fact that I said my laptop camera was broken. That’s basically a play from the catfish handbook. Sorry about that.”</em>. We laughed about it, and we continued our great conversations.</p>\n\n<p>Heather had gotten out of a severely abusive relationship a few years earlier, so it took her some time to warm up to the idea of us meeting in person. Eventually though, she did.</p>\n\n<p>We finally met for dinner about six months after I’d opened that first email that informed me she was interested. Me met at a restaurant almost exactly between our respective homes, it went wonderfully. We talked, laughed, and ate. When we were done, she went to the restroom while I paid the bill, which she’d insisted we split, and outside the restaurant, we shared our first kiss. I walked her to her car, and we went our separate ways. I was confident that it had gone well, and was excited to see her again in the future.</p>\n\n<p>Every girlfriend I’ve ever had has had some sort of issue with their weight, no matter how outlandish it was. Despite my proclamations that their bodies were perfect, they insisted to some degree of seriousness that the needed to lose weight and get skinnier. I told them as long as whatever they did was healthy, I’d support them. The day after our date, Heather seemed a little off. For the longest time she wouldn’t tell me what was wrong, but after a few days she let slip that she was embarrassed to have met me, that she was “fat”. </p>\n\n<p>Naturally, I told her that was ridiculous, that she had an incredible body. She swore up and down that she was overweight, which put me in the awkward position of not wanting to invalidate how she was feeling while also not wanting to encourage any unhealthy eat behaviors. Eventually, she apologized for being dramatic, that she knew how to lose the “little bit of weight” she wanted to lose, and we moved on from the conversation. We continued video chatting over the next few months, and met up twice, once for a movie and the other for mini-golf. Each time she would make mention of having body-image issues, which I did my best to respectfully quell. After the mini-golf date, things began to get weird. </p>\n\n<p>Her focus on her weight seemed to get more and more intense, to the point that it was getting to be too much for me. I finally insisted that her body was fine, that she didn’t need to lose weight, and that if she continued obsessing over it, it might do her some good to take a step back from our relationship to focus on those issues, after which she apologized, saying sometimes she just got wrapped up in her own. I think it was because I talked to and “saw” her every day that I didn’t really notice it, but I came across a picture of her face she’d sent me early on in our conversations, and when I compared it to the face I was currently talking to, it looked much healthier and full; her face in its current state was gaunt and pale.</p>\n\n<p>I tried not to think too much of it, rationalizing that it could be from any number of things. Then, whereas our conversations over FaceTime could generally take place anywhere, with her walking about her house doing things, gardening in her backyard, relaxing in the bathtub, they now seemed to take place entirely in one room. Where she’d always seemed vibrant and spirited, she now seemed glum and distant. The frequency of our calls lessened.  I became worried, but didn’t want to express my concern for fear of alienating her, so I simply asked if she’d care to meet for dinner again.\nShe countered with an invitation to her house, where we could eat and watch comic book movies (a mutual interest of ours), with the implied addition of...extracurricular activities.  Naturally, I accepted the invitation, which was for a week later. For the two days before our next date, I didn’t hear from her. I wasn’t even sure if I should still go to her house. Finally I heard back from her with a phone call. She apologized profusely, telling me she’d been very sick the past couple days, and asked if we could reschedule our plans, which I of course accepted. Then I offered to bring her some soup and medicine and do what I could to make her comfortable, which she accepted. She texted me her address and after a stop at the store, I was on my way.</p>\n\n<p>When I texted her letting her know I was just a few minutes away, she responded by telling me to just walk in and go down the hallway to the room on the right, that she’d unlocked her front door for me and understandably gone back to rest, not feeling like getting up again. I parked my car and with supplies in hand, I walked up the walkway to her front door. I turned the knob and pushed it open, getting hit with a wall of the foulest stench I’d ever encountered. I covered my nose and mouth and stepped in. On the carpet were several dark colored stains, some that looked old and dried, and another that looked fresh, a series of drips of different sizes leading through the front room and down a hallway.</p>\n\n<p>I stepped carefully through the house, trying to avoid the blemishes underfoot. I heard what sounded like a low-powered vacuum cleaner running, which made me wonder what she was doing, considering she was so sick. I made it down the hallway and saw the door on the right slightly ajar. Within, it looked like the light was off but a TV was on, with changing degrees of light flashing. I pushed open the door, and when I saw what lie within, I immediately dropped everything in my hands and vomited. </p>\n\n<p>Heather was naked on the floor in the corner, and waved to me when I entered the room. Both of her feet layed next to her, the stumps at the ends of her legs rudimentarily cauterized with a clothing iron that was plugged into the wall at her left. Blood, urine, and shit covered the floor around her. Several long strips of skin that had been flayed from her stomach and chest laid in a stack next to her feet, and several hundred tubes of antibiotic cream both full and empty were scattered around her, newspaper over the wounds where her skin once was, blood and antibiotic cream soaked through it. One of her breasts had a gash through it, which makes me think she was attempting to remove them.</p>\n\n<p>But the worst part, without question, was the wet/dry vacuum cleaner. A tube ran from the body of the appliance deep into an incision on her left side, a cut made in an area of her already flayed torso. The sound was possibly the worst part. It was a wet suction, accompanied by the intermittent sound of something solid passing through it. When i was done throwing up I attempted to say something to Heather, but all that came out was a whimpering <em>”what the fuck?”</em> before I stumbled backwards out of the room. Though I could barely hear her over the vacuum, she responded with <em>”It’s okay, I really just need to lose just a few more pounds.”</em> before letting out what seemed to be an involuntary groan.</p>\n\n<p>I immediately called the police. They showed up with emergency services and tried to provide aid for Heather, though it didn’t save her life.</p>\n\n<p>Needless to say, it’ll be a little while before I try online dating agai<a href=\"http://www.nickbotic.com\">n.</a></p>\n</div>\n","author":"Nickbotic"}