{"rank":"2","title":"INCORRUPT","id":"8m6bgc","url":"/r/nosleep/comments/8m6bgc/incorrupt/","time":"1527293259000","body":"<div class=\"md\"><p>This day is just another day in the life of me, Thomas Standifer. Boring and deadly dull from morning till night until I finally laid down to hopefully sleep.</p>\n\n<p>I cannot begin to tell you how I came to be in this situation. All I did was place an online ad on one of these large classified ad websites. You know, you place a free ad for a lark and wait until someone responds to it. That’s  when you zing them for some cash.</p>\n\n<p>Most of those who read my classified ad, knew what the ad was. A laugh and then you move on to the next classified ad. My particular game is, I pretend to be a powerful psychic who can change your life forever. Well, if bullshit is a virtue, then I must be very virtuous, yeah buddy.</p>\n\n<p>I have done this twenty times in the last few years. It always makes me a small amount of cash for very little work. You know this, because like me. You have discovered there is a sucker born every minute. </p>\n\n<p>It is amazing how many losers there are out there. They look for something magical to better their dull and drab lives. What they find out is a big fat zero for their troubles. The money they spent, gone like it never existed. Busted flat broke like the day before, the month before and every year before.</p>\n\n<p>When things started to get strange. I should have paid more attention to it instead seeing many, many envelopes with 100’s sometimes over a 1000.00 dollars in the envelope. After a few days, the people at the post office began to hand me my mail in large post office bags with instructions to bring back the bag when empty.</p>\n\n<p>Wow, what a week I had. All that money on a free classified ad that was an adventure to see if anyone would bite on the bait in the ad.</p>\n\n<p>Of course, I was delighted for the first time of my life. I had money and I was able to pay the rent on time. After bringing up to date the rest of my bills, I still had a boat load of cash to spend and I am going to have a great time spending it till it runs out.</p>\n\n<p>After I had opened all of the envelopes and put the money in the closet. I turned to go take a shower, getting ready to go out on the town. You know, big steak with all the trimmings. A really good wine to go with it, was the real class act to wash the steak down.</p>\n\n<p>The steak went well and was delicious. Hey, I even tipped the waitress a ten dollar bill.\nThe look on her face was terrific as I never tipped before.</p>\n\n<p>As I walked the short blocks to my apartment, it suddenly struck me there was no return address on the envelopes. Without a return address or a piece of paper with the return address written on it in the envelope. He could not send anything to the person for the money they paid.\nThey were all the same. Money, but no way to respond. Except for the money, the envelopes were empty.</p>\n\n<p>A sudden exhaustion quickly came over me. Leaving me dragging myself up to my apartment. After fumbling with the key, including dropping the keys several times. I finally got into my itsy bitsy apartment just before I hit the floor. Exhaustion finally winning, the oblivian sending me down a dark inky blackness that was a deep sleep.</p>\n\n<p>I slept till two o’clock in the afternoon, waking up with a desert mouth. You know very, very dry mouth that penetrated every cell in my body. Even after drinking two bottles of water. I was still parched. I was about to start drinking another bottle of water when I noticed the message notifications on my cell. Of course I picked it up and looked at it. There was 14 text messages saying the same thing, Please come and pick up your mail. You have 15 bags of mail.</p>\n\n<p>Stunned I showered, dressed and drove down to the post office. It was fortunate that I drove an old beat up van, so I could get them all at the same time. I got there in a few minutes and went to the window to get the mail.</p>\n\n<p>The guy at the window hesitated a second or two and told me to drive around to the dock and he would bring out my mail. As I arrived I could see him and two others bringing the large bags of mail out to where I had backed the van.</p>\n\n<p>As quickly as I could, I threw the mail bags in the back of the van, wondering beyond wonder about what I would find in them. I began to get the mail bags to my apartment as quick as I could. Anticipating a lot of money in the envelopes, excitement roared through me. I thought of all the things I would do with it. Finally I got the last bag to my apartment and abruptly sitting down to catch my breath.</p>\n\n<p>The thrill and anticipation cascaded through me like an electric shock. I began to open the first letter and took out the $100.00 bill in it. Putting it aside I opened all the letters but one, putting the cash in a pile beside him. The last letter stood out, because of the pink color of the envelope.</p>\n\n<p>A feeling of dread washed over him and he didn’t have a reason why. I shook it off and took the pink letter and opened it. It was empty except for a letter. I found no money in it, just the letter.</p>\n\n<p>Slowly, I picked up the letter. I quickly glanced at it, intending to toss it in the garbage can. Something about the letter got his curiosity going. The letter turned out to be turn by turn instructions on how to get somewhere. I will say it again, what the blazes is going on?</p>\n\n<p>First the money, then this letter. Maybe whoever is doing this wants me to follow it. That is not going to happen. For the first time in my life. I have no money worries. Why should I follow this letter?\nI decided without a second thought to grab a bit of supper. You probably guessed it. A steak with all the trimmings and a really good wine to wash it done with.\nYep, that is the life for me. Till of course, the money runs out.</p>\n\n<p>The steak was delicious and so was the wine. What a dinner! I have never eaten this well, not ever and it tasted so good. There is another thing I have to do is get new clothes and a better car, absolutely no junk cars.</p>\n\n<p>He headed back to the apartment and flopped on the coach totally content. The world had finally turned around, just for him. From now on he was going to live good.</p>\n\n<p>I got up and went to the closet to check my money in the large chest. It was still there, untouched. No one can ever find out the money was there. They would steal it if they find out it is there.</p>\n\n<p>The next day I went to a car lot and bought a decent car that wouldn’t attract attention to me. At the same time it had to be dependable. Well, the old man who owned it was totally surprised when I laid down $12,000.00 for it. I was feeling great and so content that by the time I got back to my apartment. Weariness was settling over me, but for some reason I felt that I needed to put all the money in an old duffel bag I had picked up some where. After completing that chore I took the duffel and laid it on the bed. I used it for a pillow that night. No one could get to it without waking me in the process.</p>\n\n<p>The next morning after I woke. The letter was laying on the bed, open. I was so strangely attracted to it, my eyes could not leave the sight of it. The incredibly strong urge to rise to my feet and follow the instructions and go where ever it leads was sickly, overpowering.</p>\n\n<p>The next thing I remember is loading my clothes, the stuffed duffel bag and my cooler with the rest of my money into the car. I found myself in the car starting it and heading down the road to the first turn. I stopped just long enough to check the instructions, then continued on till the next turn.</p>\n\n<p>This went on for about four hours till I got to the last turn. I got out and looked around the intersection. There was an old sign still partially legible. So I went over to get a closer look at it. Hard as I tried, the only word that was still readible was “Convent”.</p>\n\n<p>As I headed back to the car. I stopped and turned back to look at the sign.\nI felt troubled by the sign. A convent was a women’s religious organization and the sign looked really old. The gnawing was growing in the pit of my stomach. Making me want to turn my car around and run far, far, away.  I was getting very scared, really scared of what I was getting into.</p>\n\n<p>I laid my head on the steering wheel. The feeling of dread washing over me like a violent thunder storm. The urge to continue, was forcing me to start the car and make the final turn towards whatever was waiting for me.</p>\n\n<p>As I pulled up to the convent, I noticed It was a burned out cinder. Nothing left, with grass and weeds growing everywhere. The only thing left was a fancy stone building towards the back of what once was a building many decades ago. As I walked into the wreckage, I could feel a crunching sound under his shoes. I looked down and was shocked at what I saw laying among the weeds. A skull with a rosary laying close by it. Other bones were scattered all around the skull.</p>\n\n<p>The terror was increasing by the minute as I forced myself to get closer to the stone building. I could see the building had a door that was partially open, but was dark inside. My breathing was deep and ragged as I stepped across the threshold to the building, the sweat poring off of me in sheets. The fear building to a cresendo till I thought I would die.</p>\n\n<p>The skylights gave a small amount of light that was enough light to see the glass coffin at the back of the small building. The closer he got to the coffin the less afraid I was. The feeling of ease spread through me, leaving me relaxed.</p>\n\n<p>I approached the glass coffin and gazed at the incredibly beautiful girl reposed in it. As if she was only resting, about to wake. He looked down to the bottom of the coffin to where a brass plate was inscribed. Sister Aia, died in the spring Year 1145, inscribed this year 1962. The next line sent shivers down his spine causing him to back away a step or two away. It said “Death to anyone who opens this coffin!</p>\n\n<p>“Out of here.” Thomas said to no one in particular.\nHe turned and ran towards the door and then stopped. The door wasn’t there anymore, he was trapped, with no place to go.</p>\n\n<p>“The people of the town burned the convent down, killing all the sisters that lived there,” the voice out of the semi-darkness of the tomb said. \n“I am the last of the caretakers. I could not bury the sisters because the town checked from time to time. I know you have questions about Sister Aia. She was a new sister at the main convent in Europe, where I do not know. They found her in religous ectasy. She wasn’t dead, but she wasn’t alive either. So they placed her in this glass coffin and sealed it for all eternity. It was not to be opened, ever,” the voice said.</p>\n\n<p>I thought about what she said and walked over to the coffin and just gazed at the beautiful, youthful appearing woman.\n“Are you the one who sent the money,” I asked quietly.\n“I know nothing of any money,” she said forcefully!\n“Maybe it was one of the monasteries. I was told by the one who delivers the things that I need to survive on. That someone else would come to relieve me from my duty.  I am one hundred and four years old. You will not see me again,” Her voice cracking as she turned away from him.\nThe very elderly lady walked back the way she had come, vanishing the same way that she had come.</p>\n\n<p>He quickly checked for doors where the old lady came and went from. The was no door that he could find. The front door had not returned so he could exit this place of death..</p>\n\n<p>As far as he could fiqure out, This corpse was 873 years old and still looks fresh, ready to rise and go about her business.  Who ever put her there intended her to stay in her coffin.</p>\n\n<p>“This needs to end,” Thomas said loudly.\n“And it ends NOW!” As I picked up a tall candle stick from the side of the coffin raising it over my head striking with all of my strength the glass side of the coffin. The glass shattered instantly, throwing shards of glass everywhere. The massive explosion ripping throughout the stone building.  The ceiling, over the coffin, was blown outward and the main door returned and was off its hinges, hanging by only one of the hinges. My face had small cuts all over and the force of the blast had thrown him against the wall,  but I survived.</p>\n\n<p>I turned to look at the coffin. The corpse was untouched by the glass shattering. The breeze coming from the broken door refreshing as it touched my face. With the roof mostly gone. He could see clearly pretty much everywhere inside the tomb.</p>\n\n<p>Then a small delicate voice said something in a language I did not know. I turned and a beam of light was coming from the sky striking the floor. The spirit of Sister Aia waved as she walked into the light and vanished. Her soul had been trapped for 873 years and was now finally free.</p>\n\n<p>He decided to go back in the stone building to look once more on the sister that had been buried there. He went over to the remains of the coffin and looked at her. I guess it is not surprising that the only thing that remained were a few bones. </p>\n\n<p>Returning to my car, I checked my duffel bag and cooler, then with one final look at the remains of the stone building. I turned, got in the car and left.\nI got back to the apartment and went to the post office to check for mail. It is not any wonder there was no mail for me. As for myself, I am leaving here and I will never be back. With the money I have in the car, there will be no money worries for a while.</p>\n\n<p>I don’t know where I am going. I guess I don’t really care. Just away from here. Maybe I can find some small place in this world that I can feel comfortable and content again.\n“Well I guess this is goodbye,” Thomas said to no one in particular.</p>\n\n<p>His car started easily and began to move towards the interstate highway, putting distance from what is now the horrible, unbelievable past of the last month.</p>\n\n<p>“Goodbye,” he said to no one.</p>\n</div>\n","author":"keiros142"}