{"rank":"44","title":"Case #7- The Village of Lost Souls- Part 6","id":"8m6dnm","url":"/r/nosleep/comments/8m6dnm/case_7_the_village_of_lost_souls_part_6/","time":"1527293857000","body":"<div class=\"md\"><p><a href=\"https://www.reddit.com/r/nosleep/comments/8loaqi/case_7_the_village_of_lost_souls_part_5/\">Part 5 can be read here.</a></p>\n\n<p>“Get the fuck out!”</p>\n\n<p>I jolted awake to see Mark standing near the bed, shaking. His face was red and contorted in rage and tears were streaming down his cheeks. “Mark? What happened?”</p>\n\n<p>“Get out of my house!”</p>\n\n<p>I read his aura and the wave of grief emanating from him would have staggered me if I’d been standing. There was only one thing that could have caused him such pain. “Oh, God. Jane, no…”</p>\n\n<p>“You promised you would help her. I opened my home to you! You came here and talked about curses and auras and psychic visions and for what? Your fucking salt didn’t help! Your fucking bullshit theories didn’t help!”</p>\n\n<p>“Mark, I am so sorry. I thought we had more time-”</p>\n\n<p>“Sorry isn’t good enough!” He clenched his fists and I thought for a moment we were going to fight. “My mother is dead because you weren’t good enough. Get the fuck out of my house. Now!”</p>\n\n<p>I hurriedly gathered Moxxy’s and my things and left the house. I walked to a motel on the outskirts of town and rented a room. Then I curled up in the corner of that room, sunk my face into my hands, and cried. It was the ugly kind of crying, the kind you’d never willingly let anyone see. Unfortunately for me, someone did see.</p>\n\n<p>“How long are you going to be doing this? Daylight’s wasting, you know.”</p>\n\n<p>I looked up and saw someone familiar sitting on the bed. She was the girl from my vision, the one with deathly pale skin, white hair, and red eyes. She hadn’t been there when I entered the room and the door didn’t open while I was there. “What are you?”</p>\n\n<p>“Why does everyone always ask me that? Maybe I’m biased but I don’t think what I am is nearly as interesting as who I am.” She cocked her head and smiled at me. “My name’s Levi. I’m your… spirit guide? Fairy godmother? Whatever you want to call it. I’m here to help you.”</p>\n\n<p>“Help me? Fucking bang up job you’ve been doing! If you’d let me contact Jacob like I wanted to, he could have saved Jane!”</p>\n\n<p>“No, he couldn’t. In the time it would have taken him to travel here, it still would have been too late for her. The only thing that would have changed is you wouldn’t have worked as hard on the case and you wouldn’t know as much as you do now.” She walked over to me and kneeled down so we were eye and eye. “I see right through you, Emily. You say you need Jacob because he’s more experienced, because he’s better than you. We both know that’s bullshit. You’re trying to push the responsibility off onto him because you’re afraid of failure. This case is yours, not his, and you need to own that or a lot more people are going to die before it’s over.”</p>\n\n<p>“Why don’t you just tell me what’s going on? You clearly know.”</p>\n\n<p>“No can do, kangaroo. I hate spoilers.” She winked at me and stood. “I’m here to give you a gentle push in the right direction, that’s all. If I give you all the answers, you won’t learn anything.” She took out a pocket watch and checked the time. “By the way, Donnie’s going to send you an email right about… now.”</p>\n\n<p>My phone vibrated and I checked it. Donnie did send me an email. The room was empty when I looked up to question Levi further. I texted Moxxy, telling her what happened to Jane and where to meet me, and read what Donnie sent me.</p>\n\n<p>Two hours later, Moxxy knocked on my door. I let her in and she immediately launched into what she’d found. “Okay, so I talked to this guy from UWM who specializes in magic and whatnot and he told me something huge. That ritual we smashed up? You were right about it being a binding spell. But it’s not for binding a demon, it’s for binding the dead. It’s necromancy. Larson must have been forcing spirits to do his bidding. The sick son of a bitch killed Jane with the spirit of her own husband. We have to pay him back for that.”</p>\n\n<p>“Someone else beat us to the punch.” I held up my phone. “Donnie set a program to monitor local computer and radio traffic for mentions of Larson. Well, they found him in his office this morning. He’d been dead for a while. It must have been bad too because the police think it was a bear attack. They just can’t figure out how the bear opened and closed all the doors without breaking them down.”</p>\n\n<p>“Fuck me.” Moxxy sat on the bed and processed the information. “So what are we thinking now?”</p>\n\n<p>“Well, I had a vision last night. You remember how Mark told us Wren Kingston was abused by her dad because he was trying to exorcise a demon from her? That’s not what happened. He said she had a darkness in her, and that they needed to wake it up. We know Larson’s related to the Kingstons and I think he was using necromancy to bind Wren’s spirit. Why else would he be doing it at the mortuary, where she lived and died? So he had her kill the kid, Tony, and Mark’s dad. But what I don’t get is why did he switch to using William’s spirit instead of Wren’s? And why go after Mark’s family at all? I get why he wanted Tony dead.”</p>\n\n<p>Moxxy picked up my train of thought. “I think when we smashed up that altar, it removed Larson’s control over Wren. She has to be the one who killed him. She’d want revenge.”</p>\n\n<p>“But then why kill Jane if Larson wasn’t controlling her anymore?”</p>\n\n<p>“You said Wren had a darkness in her. What if it’s out now? Larson set it free but without anyone controlling it, she’s still attacking people.” Moxxy snapped her fingers in realization. “The mass grave from the original settlement. That has to have something to do with Wren’s darkness and what’s going on today. There was a Kingston back then too. No way that’s a coincidence.”</p>\n\n<p>“I agree. I’ve already asked Donnie to look into Mark’s family’s background. In the meantime you and I need to figure out where exactly that mass grave was. I’ve got a hunch about it.”</p>\n\n<p>We went to the library and badgered the librarian into pointing us in the direction of someone well-versed in the town history. That led us to the home an eighty year old man who used to run the now defunct Dodgerton Village Historical Society. He was happy to give us a history lesson and confirmed what I’d suspected all along: Reverend Jebediah Kingston used the location of the mass grave to establish the town cemetery. Which meant that centuries later his descendent built Kingston Mortuary on top of it.</p>\n\n<p>I checked my phone after we left old man’s house. “Another email from Donnie. Holy shit, it’s starting to make sense now.”</p>\n\n<p>Donnie included a family tree in his initial report on Mark Neil’s family. Generations ago, Sarah Kingston, daughter of Reverend Jebediah Kingston, married a man named John Neil and took his family name.</p>\n\n<p>“Larson and Mark are related? Do you think he was trying to get rid of the competition?”</p>\n\n<p>“What competition?” I asked. “I can’t exactly see anyone in Mark’s family dabbling in necromancy.”</p>\n\n<p>“Maybe Larson was just being thorough. Mark’s the last Kingston we know of. I’m thinking maybe he’s the one who can stop all this, once we figure out what this is.”</p>\n\n<p>“Maybe. If he even listens to us.”</p>\n\n<p>We went back to the cemetery. I stood outside the mortuary and stretched my mind deep into the ground. The black energies that surrounded the mortuary were stronger the further down I got. When I reached the source, the pain and rage of all those lost souls overwhelmed me and I heard screaming in my mind and felt flames lick my skin...</p>\n\n<p>“Hey!” Moxxy shook me and I disconnected from them.</p>\n\n<p>“Oh my God, Moxxy… it’s horrible. They weren’t all dead. In the mass grave, when Kingston burned them. Some of them were alive when they burned.”</p>\n\n<p>“Jesus, that’s fucked up.”</p>\n\n<p>“There’s something else too.” I reached out with my mind again and felt a presence under the mortuary. It wasn’t like the other angry, lost souls. That thing was cold and devoid. It didn’t have a soul. “There’s something evil under the mortuary. It’s not human. I think it knows we’re here.”</p>\n\n<p>(Case #7 will <a href=\"https://www.reddit.com/r/JacobMielke/\">continue in an update.</a> Updates are posted every Monday, Wednesday, and Friday. Mielke Investigations is an <a href=\"https://www.facebook.com/jacobmielkeswriterprofile/\">ongoing account.</a> )</p>\n\n<p>Update: <a href=\"https://www.reddit.com/r/nosleep/comments/8mtxu5/case_7_the_village_of_lost_souls_part_7/\">Part 7 can be read here.</a></p>\n</div>\n","author":"JacobMielke"}