{"rank":"0","title":"Dead Men (Part 2)","id":"8m6kdv","url":"/r/nosleep/comments/8m6kdv/dead_men_part_2/","time":"1527295787000","body":"<div class=\"md\"><p><a href=\"https://www.reddit.com/r/nosleep/comments/8khtqd/dead_men_part_1/\" rel=\"nofollow\">Part 1</a></p>\n\n<p>Hi, I’m back. I apologize for the information dump last time. I know it’s a little weird (understatement) to recount events in the lives of people that died a hundred years ago, but I did live it. In a dream. A dream in which I saw an ancestor’s memories through her eyes. The dreams began back in Charleston, two years ago – visions carried by the dewy marsh wind, the peppery nutmeg smell of Frogmore Stew.</p>\n\n<p>New York City smells a lot different (another understatement). Sure, if I’m strolling through an ethnic enclave – Chinatown, Little Italy, <em>El Barrio</em> – I’ll smell the various delicious cuisines, but cooked as though they’re masking the sooty miasma flowing from the exhaust pipes of the MTA buses, or the oil burned by the hundreds (thousands?) of taxis milling about all five boroughs, or the overwhelming amount of shit defecated by the fucking nine million people who live here – but that smell mostly just floats down to Hoboken, no big deal.</p>\n\n<p>And then you have the apartments – or dorms, in my case – where the scent is reliant on how well you clean, or which incense stick you burn. That’s where I was most of last Saturday: curled up in my “lounge pants” in the Upper West Side triple with one of my roommates, burning balsam &amp; clove tea lights and streaming the royal wedding on my laptop.</p>\n\n<p>“I’m rather surprised at Meghan’s dress,” Phoebe was telling me as she sipped Boba tea through a big fat straw. She’s a fashion design major. From London. “It’s so… A-line. Pretty décolletage, though.”</p>\n\n<p>“I know, you were hoping for Princess Di 2.0,” I said as I jotted down a note for my Anthro class.</p>\n\n<p>“Bloody hell, not that! The meringue can <em>stay</em> in the eighties, thank you!” she exclaimed, to my surprise. “But I was hoping for more… like, sparkle, I guess. I don’t know.”</p>\n\n<p>“Ahh, you wanted lots and lots of beadwork. Most people these days, though, seem to be opting for lace, or no embellishments. Also, mermaid skirts.” Then my throat got dry. “Pheebs, could you hand me my water bottle, please?”</p>\n\n<p>“Well, the mermaid skirts are very flattering, they can stay!” she replied as she went to retrieve my water. “But I’m bringing sparkle back…”</p>\n\n<p>She trailed off, and I smiled. “Them other <em>fashionistas</em> don’t know how to act?” But when she didn’t laugh I looked up, and saw her holding my Student I.D., which had been lying on my desk. As she handed me my water bottle she said, “You know, I keep forgetting that your name is really Praxis.”</p>\n\n<p>I grunt-sighed. “You know who’d really <em>love</em> to forget my name is Praxis? <em>Me</em>. Eternal-Sunshine-for-the-Spotless-Mind that shit right outta here.”</p>\n\n<p>She laughed at that. “Fuck, it’s just… like, on paper you sound posher than me! I mean, Phoebe’s Greek, but everybody’s heard of that. <em>Praxis?</em> Don’t wanna tread on her toes!”</p>\n\n<p>“You know who’s gonna tread on <em>your</em> toes if you don’t stop callin’ me that?” I told her, a grin on my face. But I was only half joking. Subsiding, she remarked, “Princess Meghan makes me happy, though. There’ll be mixed members of the royal family now – if they have kids. That makes me happy.” Which made sense – she was biracial herself. Came from a wealthy family, but there was still that <em>difference</em>. There were between two and three million black people in England, as opposed to America’s fifty million. Sometimes I wanted to ask her what it was like, being black in England, but I never knew how to broach the subject. So I turned my attention back to the wedding ceremony, and let the Bishop of the Episcopal Church’s preaching carry me away, back to a happier day…</p>\n\n<p>Strangely, that happier day was one summer when I was about eleven, maybe going on twelve, and I confronted <em>Maman</em> about why she would give me such a ridiculous name. Because, you see, it’s not just Praxis. My full name is Praxis Evangeline Zaïre Arouet Sutton. You can see why I go by Evie, now, can’t you? So I approached her in our library one day, and demanded answers.</p>\n\n<p>“Praxis is an epithet of Aphrodite, the goddess of love!” she’d called down, as if that were explanation enough, as she climbed a short ladder to reach the top shelf.</p>\n\n<p>“Then why not just name me Aphrodite?” I asked. Aphrodite was certainly longer, but much more recognizable.</p>\n\n<p>“Because kids might tease you, and call you a hermaphrodite!” Maman called down once she found the book she was looking for.</p>\n\n<p>“Uhh, okay… Well, what about Venus, the Roman version?”</p>\n\n<p>She was descending the ladder now, sunlight from the Monticello window glinting off her dark curls to give them an almost scarlet glow. “That would probably have been worse, as it rhymes with a certain part of the male anatomy – which I know you’ve learned about it health class, so don’t start saying ‘Ew!’” I zipped my lips. “Either that, or you would’ve been bombarded with questions about how well you play tennis.”</p>\n\n<p>“So, clearly, you and Dad had no choice but to name me Praxis…”</p>\n\n<p>“It was certainly the best of the three,” she finished, as though that were a reasonable assertion. “Besides, that’s why we have middle names!”</p>\n\n<p>“What’s yours? I forgot.”</p>\n\n<p>She cast me a sideways glance – she knew full well I remembered – before putting the book she’d retrieved on the desk so I could see the cover. <em>Herodotus: The History. Translated by David Grene.</em> “Mariamne. <em>Mémé et Bon-Papa</em> loved Biblical names, but why they thought the abused and murdered wife of King Herod was a good namesake…” She shook her head and opened up to a page whose contents I couldn’t quite discern.</p>\n\n<p>“Wasn’t that also one of Voltaire’s plays?” I asked, this question genuine, as Voltaire was held in high regard by the whole family. She nodded, barely listening. “It wasn’t initially well-received.”</p>\n\n<p>“Didn’t <em>Mémé</em> and <em>Bon-Papa</em> also name you after Mary Magdalene?”</p>\n\n<p>“They did, they did. But they…” She searched for something on the page. “Didn’t name me Magdalene, or even the far more palatable Madeleine, but instead went with the actual name of the city: Magdala. Which is, of course, why I go by Maggie. All us Arouets have weird names, <em>petit-chou</em>. The Suttons, too. Don’t worry, you’ll get used to it.”</p>\n\n<p>My mother was an impressive lady – not very tall, nevertheless her presence commanded respect. Bearing dual citizenship in the United Stated and France, she wielded French terms of endearment like cabbage (<em>chou</em>) and flea (<em>puce</em>) as deftly as her incising wit and her glossy chestnut and gold fountain pen. A tenured instructor in the Classics at an Ivy League institution, “Professor Maggie” was respected by all, an admirable woman. Inspirational.</p>\n\n<p>“What are you looking for?”</p>\n\n<p>“There’s a passage in here…” <em>Maman</em> trailed off. “Yes, the Persians adopted pederasty from the Greeks.”</p>\n\n<p>I was unfamiliar with the term “pederasty” back then, so I had no idea why <em>Maman</em> would be looking it up in the library in the middle of the day. Or why she would get a look on her face like she’d seen a ghost, color draining from her cheeks, her eyes brilliant, glassy even, in the sunlight. “But that was… they were adolescents, it was still different from… was it?” she mumbled, before raising her head and running her fingers through her hair and over her face, roughly, in the matter of one fighting the sensation of going mad. “Jesus, why… why do I do this to myself?”</p>\n\n<p>I didn’t know what was tormenting my mother – only a minute ago, she was bright and cheery – but I got the sense that I was missing something vital. Searching for a way to comfort her, I said, “<em>Maman</em>, it’s okay, it… maybe it’s not true!”</p>\n\n<p>She laughed a little at that, quietly, bitterly. “Sure, from the ‘Father of History’…”</p>\n\n<p>It was my turn to laugh. “Really? I thought Herodotus was the ‘Father of Lies’?”</p>\n\n<p>Now she laughed genuinely, big and loud, closing the book and abandoning it on the desk to walk over to me and pull me into a tight embrace. “My little girl, who’s growing up way too fast. I’ve taught you well… Tell me, what was one of Herodotus’ lies?”</p>\n\n<p>“That chameleons change color to blend in with their surroundings!” That was the one whose memory was easiest for me to retain.</p>\n\n<p>“Aaaaaand why do they <em>really</em> change colors?”</p>\n\n<p>“To reflect their emotional state!” I beamed as <em>Maman</em> pulled back to press a kiss against my forehead. “Very good! One of the things Aristotle actually got right about our world, ‘wandering wombs’ notwithstanding. The color of a chameleon reflects its emotion in that moment – avoid a pitch black chameleon, because it’s ready to fight you. Probably a red one, too.” She continued as she climbed up the ladder to put the offending book away, “The idea of the common chameleon camouflaging with its environment should never have caught on as much as it did, since it’s so easy to disprove with simple observation. But sadly, people are often both gullible and too lazy to investigate things for themselves.</p>\n\n<p>“Remember this, Evie,” she told me when her feet were on solid ground again. “The easiest person to sniff out is the Chameleon. The one who tries too hard to go unnoticed.”</p>\n\n<p>I didn’t really understand her at the time, but I nodded all the same. Satisfied that I got the message, she placed her fists on her hips and wondered aloud, “Well, <em>petit-chou</em>… now what? What should I read?”</p>\n\n<p>“This usually cheers you up,” I offered as I retrieved the worn, well-loved novel: <em>Candide, ou l’Optimisme</em>.</p>\n\n<p>“We have so many books,” <em>Maman</em> remarked as she took it gently in hand. “A library full of books. Why do I always come back to this one?”</p>\n\n<p>“Be… cause it cheers you up?” I reiterated. She smiled, and kissed me on the cheek this time. “Very well, I’ll be in the backyard. Go outside, Evie, get some fresh air!”</p>\n\n<p>With that, she left the room. I stood in the center for a little while longer before following her. The library rested in the center-front of our large historic home in Westchester County, a forty-minute or so train ride from Manhattan. It wasn’t the grandest mansion in the county, but it was up there, and I often took for granted that not everyone had such a beautiful place to rest their heads at night. I turned to the empty space on the Voltaire shelf, the most-visited one in the whole room, and smiled.</p>\n\n<p>In addition to the obsession with Ancient Greece, my <em>maman</em> was a bit obsessed with Voltaire – though that’s perhaps a family-wide fixation. Her maiden name, and my fucking <em>third</em> middle name – because all Suttons get their mother’s maiden name in there somewhere – was also his real name: François-Marie Arouet. We’re not descended directly from him, since he didn’t have any children (no legitimate ones, anyway). I think we’re descended from his brother, or something. Not nearly as exciting; but I find it amusing that his family probably tried to distance themselves from their writer relative, what with his stays in the Bastille and his books being burned and all, but now the descendants clamor for any sort of connection to the man whose ideas did much to foment the founding of a new country and actually shape the world centuries after his death.</p>\n\n<p>It wasn’t long after that day, maybe a couple weeks, that my parents revealed they were expecting another child. Upon receiving the news that I was becoming a big sister, I was excited – but also scared. Up until that point, I had been an only child. I would have to share my parents with my little brother or sister – actually, since they’d be a baby, while I was fairly self-reliant, they’d probably get all my parents’ attention. For the last month or so, right when the weather heralded springtime and my normally graceful <em>maman</em> was reduced to waddling, I grew apprehensive. What if the baby was evil? What if, in addition to my normal schoolwork and chores and stuff, I had to manage a tiny sociopath? Or, less outlandishly and since <em>Maman</em> was over forty years old, what if the baby had birth defects? Would I be an adequate sibling for a child with Down syndrome? What if some other anomaly occurred, and we had to relocate in order to cope with it, or some other drastic change?</p>\n\n<p>What if <em>Maman</em> and the baby died?</p>\n\n<p>Right around the vernal equinox, all my questions were answered: <em>Maman</em> was alive and well – apparently this birth was easier than my own – and my baby brother was the most adorable, precious little thing in the world. He had no eyebrows to speak of, and only the faintest wisps of blond hair on his scalp, which he must have inherited from our father. He mostly slept for those first weeks while <em>Maman</em> was on maternity leave and a colleague took over the remainder of her classes, but even in slumber, he was so dear that I could content myself just watching him. I quickly realized I would do absolutely anything in the world for this little guy, including standing up to anyone who bullied him for his name and teaching him to do the same. Because of course he also got a crazy ass name: Ares Lafayette Zadig. Ares is for the Greek god of war (our parents named us Love and War, essentially), Zadig for the famous Voltaire work, and Lafayette because… I guess just because my parents liked it? Or maybe for the Marquis de Lafayette – in which case my little brother has the most American name of all of us.</p>\n\n<p>Also around this time, we received a welcome update from my aunt and uncle in Charleston. They said Aunt Rosie’s cancer had gone into complete remission. Everyone rejoiced – my Sutton uncle, aunt, and cousins even came up to New York to visit that summer. I showed my cousins – who were twins, two years older – my new baby brother, whom we all gushed over because who doesn’t lose their shit over a newborn baby? Especially one just learning to smile! I remember my cousin Vinnie (yes, I know) holding little Ares in her arms, butting her nose against his, and then pretending that she stole his nose and was holding it between her knuckles. The pitch of her voice combined with her native Charleston accent must have been hilarious to Ares, because he giggled and giggled, beaming toothlessly.</p>\n\n<p>“He’s a cute little guy,” Val said, declining to hold Ares when Vinnie and I offered. “But now I’m thinkin’ ’bout how when he’ll be our age now, I’ll be almost thirty.”</p>\n\n<p>Vinnie rolled her eyes at her brother as she handed Ares back to me so I could lay him down in his crib. “Come on, Val, don’t be like that!”</p>\n\n<p>“Yeah, Val, don’t be like that!” I told him, imitating Vinnie for comic effect more than anything.</p>\n\n<p>“I’m just sayin’, it’s a little, uh… bizarre to think about, you know? We’re gonna watch ’im grow up, but then we’ll get older, too. Just made me think, you know?”</p>\n\n<p>“Come on,” I told him. “Don’t have an existential crisis on us.”</p>\n\n<p>“A what?” Val and Vinnie asked at the same time.</p>\n\n<p>“Existential crisis,” I reiterated, surprised my teen cousins didn’t know what I was talking about. There were several seconds of silence, and I had to force myself to remember that not everybody had professor parents who always used big words around them and suggest they take <em>The Plague</em> to read outside if they’re bored. “It’s when you, uh… look at your own existence, realize you only have a small amount of time on earth, and just… completely freak out.”</p>\n\n<p>“Well, I’m not ‘freakin’ out’ just yet,” Val told me.</p>\n\n<p>“And you gotta stop doin’ that,” Vinnie interjected, giving me a hard stare with her sloe eyes that seemed to hold an obsidian incandescence.</p>\n\n<p>“Stop… doing what?”</p>\n\n<p>“Talkin’ over people like that. Above people. Usin’ big-ass words you know the people you’re talkin’ to don’ use, so you can soun’… bettah.” Her accent was really coming out now. And it was angry. “Jus’ <em>stop</em>, all right? Ya britches fixin’a bust!”</p>\n\n<p>“I… <em>what?</em>” I exclaimed, confused and angry – at my confusion more than anything.</p>\n\n<p>“See? See how mad that just made you there? Me usin’ phrases that you don’ know, directin’ ’em at you? That’s how <em>you</em> made <em>me</em> feel! It’s hateful. Stop it.” With that, she darted out the nursery, down the steps, and out the back door into our yard.</p>\n\n<p>“Why’s Vinnie throwin’ a hissy fit like that?” Val muttered to himself as he ambled out of the nursery. I stayed behind a few moments longer, absorbing my cousin’s scolding. Maybe she was right. Maybe I did act like I was above people, employing the vocabulary I learned from my parents and their circle like I was flashing jewelry. I didn’t do it intentionally.</p>\n\n<p>Humbled, I caught up with Val, who was still complaining about his sister. “She’s been carryin’ on, bein’ cranky, since we got here.”</p>\n\n<p>“I’ve noticed.” Which I did. Any time she wasn’t around Ares, she looked like it was a chore to be here. “Does she hate Yanks that much, or is it just us?”</p>\n\n<p>“Pay her no mind, Evie.” Val patted my back in the playfully rough manner of friends, making me smile.</p>\n\n<p>When we reached the bottom of the stairs, which opened into the connecting hallway between the kitchen and the front room, we heard hushed voices ahead of us. Making a motion for Val to be silent and creeping along the kitchen wall, I realized the adults were having a serious conversation in the dining room. I peeked once past the archway separating the dining room and a short corridor leading to the kitchen – peeked long enough to see my parents had broken out the cognac and the carafe, which were usually employed for celebratory occasions. Which I thought this was. But if so, then why did everyone look so… harrowed?</p>\n\n<p>I glanced at Aunt Rosie, freshly cancer-free. She wore a wide-brimmed white hat on a slant, and on the left side of her head I could see short blond hairs growing once more. She was missing her Virginia Slim in the long cigarette holder, but she’d understandably kicked those, because… cancer. Still, holding that snifter deftly between her middle and ring finger, steadily swirling the amber liquid while her other hand rested on her hip, she was the picture of a Southern Lady. Aunt Rosie could skin a raccoon without messing her manicure – and the glare in her eyes gave me the uneasy feeling that skinning <em>something</em> was on her mind.</p>\n\n<p>“So glad I could play the welcoming host,” my father said in an enunciating southern drawl that fairly dripped with condescension, before taking a healthy gulp of cognac. The display was crass and unnerving. “Is everything to your… expectations?”</p>\n\n<p>“Renard,” my Uncle Ted said, looking hot under his polo collar. He was older and less handsome than my father, but the cerulean eyes were the same. “You know I would love nuthin’ mo-ah then to wrap my fingas ’round yuh throat an’ sqeeze till you turn purple, then white.”</p>\n\n<p>The malice in the statement made me gasp, and Val slapped his hand over my mouth to block any further sound. Luckily, the adults didn’t hear us.</p>\n\n<p>“But doin’ so would attract the wrong kinda ’tention,” Uncle Ted continued, sipping his cognac much more carefully.</p>\n\n<p>“And a senator needs the utmost circumspection.”</p>\n\n<p>“You know why we’re here – we’re here to make sure nuthin’s goin’ wrong.”</p>\n\n<p>“Oh, nothing’s wrong, nothing at all!” my father carried on in exaggerated jubilance. “After all, my wife just had a baby, why would anything be wrong?!”</p>\n\n<p>At that, Uncle Ted looked at Aunt Rosie, and strangely started laughing. “You hear that, baby? He’s forgotten what we can do!”</p>\n\n<p>“<em>I ain’t forgot nuthin’!!!</em>” my father yelled as he slammed his glass down, dropping the act. “I’ve had to <em>live</em> with it the las’ eight fuckin’ years!”</p>\n\n<p><em>Maman</em> had jumped at the sound of glass hitting cherry wood, nearly sloshing ginger ale out of her glass – she was breastfeeding Ares, so it made sense that she wasn’t drinking alcohol, and ginger ale was one of the few things that settled her stomach during the pregnancy so we didn’t exactly have a shortage. Aunt Rosie walked over to her and rubbed the space between her shoulder blades. Satisfied that she was calm, my aunt then proceeded to take my father’s abandoned cognac glass, empty the contents into hers – nearly filling it to the brim – raise it to her lips, and then say, “Ren, dear boy… shuddup.”</p>\n\n<p>My eyes had grown so wide that they nearly popped from their sockets. I turned back to look at Val, who was having more or less the same reaction, his hand having dropped from my mouth a while ago. I was completely astonished, true, but curiously enough… I wasn’t offended on my father’s behalf. And sadly enough, I didn’t ponder at that time why that was.</p>\n\n<p>“I been sick fuh couple years now,” Aunt Rosie continued after taking a healthy – but far more ladylike – sip from her snifter. Her normally honeyed voice had turned icy. “Didn’t wanna catch you slippin’. Because then we’ll have a <em>real</em> problem, if you didn’t think you had one before. And you’d want Ted to get to you rather than me. You barely seen me angry.”</p>\n\n<p>Looking at the panic in my father’s eyes, set rather deep in an increasingly ruddy face, I had no choice but to believe that my father believed her. Why were my aunt and uncle ganging up on him?</p>\n\n<p>Val pulled at my shoulder in a gesture for us to leave. I didn’t want to, but he pulled harder and I didn’t want to make any noise, so I had no choice but to follow him out into the backyard. The scents of peonies and lilies and fuchsias mingled with one another under the hot sun in a perfect spring perfume, but none of it wiped the encounter I’d witnessed from my mind. I prodded Val about it – or rather, I tried to, but he didn’t seem to be paying attention to me, focused instead on reaching his sister, sitting alone by the white rose trellis, staring straight ahead at nothing.</p>\n\n<p>“Vinne, what’s goin’ on?” Val asked, with no reaction. “What’s wrong?”</p>\n\n<p>Still nothing. When he turned to me and asked if they could have a couple minutes alone, I shrugged and walked away. Apparently, nobody wanted to talk to me today. So I went over by the small fuchsia tree, leaning up and grabbing a cerise bulb to sniff. The sweetest flowers in our garden, they almost smelled fake in their dessert-like odor, but I loved it. Reminded me of custard. Made me happy.</p>\n\n<p>A shout snapped me from my reverie, and I turned to see Vinnie fighting to get away from Val while he kept his arms wrapped tight around her, saying over and over again, “Calm down, jus’ <em>calm down</em>.”</p>\n\n<p>“Lemme go lemme go <em>lemme go</em> –” she fairly grunted as she continued to struggle. I ran over and grabbed Val by his shoulder. “Fucking let her <em>go</em>, Val!”</p>\n\n<p>Looking surprised at my swearing, he relaxed his grip enough that Vinnie shoved herself from him. Gathering enough breath to scream, she shouted, “Why we here, Val? <em>Why are we in this house?</em>”</p>\n\n<p>“We’re here to see our baby cousin, Lavinia!” Val replied, clearly irritated given that he’d resorted to her full name. “Not errythin’s about you!”</p>\n\n<p>At that, Vinnie gave a grunting scream of anguish that haunted me for days. It was the kind of sound someone made when even their simplest dreams were forever crushed, and it reverberated in my bones. Silence prevailed after she took several deep breaths and walked slowly back inside.</p>\n\n<p>“Val, <em>what’s wrong?</em>” I demanded. He gave this grand shrugging gesture of “I have no idea,” except I didn’t buy it. Thing was, he didn’t care what I bought: “Come on, Evie, let’s jus’ go back inside.”</p>\n\n<p>So we did, and it didn’t take us long to catch up with Vinnie. As soon as she approached the entrance to the dining room, however, and saw all the adults standing together, she immediately turned around and headed back outside. Without a word. Uncle Ted sighed and said, “I’ll see ’bout punky,” and walked out after her. My ear caught the sound of my father snorting derisively, and I turned my head to see him exit the room from the other end, looking as though he were headed upstairs. Then I noticed <em>Maman</em> furtively watching his every step.</p>\n\n<p>“Mags, want me to go up?” Aunt Rosie whispered. <em>Maman</em> started, then motioned for her to drop the subject. “No, it’s all right.” Then she looked at me: “<em>Petit-chou</em>, how long have you been standing there?”</p>\n\n<p>“N-Not long,” I stammered. It was technically the truth, but I wasn’t counting the conversation I’d witnessed earlier.</p>\n\n<p>Then Aunt Rosie piped up, “You really think I didn’t see you and Valentine there earlier?” At that, Val coughed nervously – his momma smiled and continued, “I’m sure you have a lot of questions –”</p>\n\n<p>“And they can wait!” <em>Maman</em> exclaimed, cutting her off. Aunt Rosie looked like she wanted to debate the issue, but my mother pleaded, “<em>Not. Now.</em>”</p>\n\n<p>“All right, all right,” my aunt replied, conceding the issue. Then she went about finishing her cognac. <em>Maman</em> then went upstairs after all, and I heard Aunt Rosie mutter under her breath, “You’d stay in a leaky house till the water was in the attic.”</p>\n\n<p>The rest of their stay in New York is a blur – they didn’t even stay at our house, though we had room for them and then some – and life carried on as usual. My father continued at his law firm, <em>Maman</em> returned to the university, and little Ares grew into a ham and a half. He was a curious little man, loved to explore. Life was good.</p>\n\n<p>The summer before my senior year, however, my Aunt Rosie passed away. She had cancer again, a different type than before, and couldn’t beat it this time. We flew down to her funeral, and I was greeted by the warm, spicy water scent of the South Carolina shore. I really did enjoy The South, but it often moved too slowly for my liking.</p>\n\n<p>I remember looking at my aunt in the casket, all the former liveliness and gumption gone. Although, for being dead, she looked pretty good. I comforted Val and Vinnie, who were crying, and then I started crying too. Poor little Ares didn’t understand why everyone was so upset, or that someone could “go to sleep and never wake up.” For their part, my father and Uncle Ted were cordial to one another, betraying no animosity – most likely out of respect for Aunt Rosie and her family, most of them from the Savannah area.</p>\n\n<p>She was interred in the crypt on the grounds of Sutton Hall, and a new inscription was added to the front: Rosemary Elise Wickham Sutton, 1969 – 2015. Way too young to die. And with Val and Vinnie in college, my uncle was all alone now.</p>\n\n<p>When we returned home, the atmosphere in the house was… different. My parents seemed to make conscious efforts to not be in the same room. I didn’t know how to ask what was wrong. We couldn’t have been back in New York for more than two weeks when one day, Ares was begging somebody to take him to the park: “Pwease, pwitty pwease!” (It took him a while to master his Ls and Rs.)</p>\n\n<p>“Evie, <em>petit-chou</em>, could you take Ares to the park today?” <em>Maman</em> asked me. “Your dad and I have a few errands to run.”</p>\n\n<p>“But I was gonna go by Desi today!” I said. We’d even planned it.</p>\n\n<p>“But that’s not till later today - <em>please</em>?” she asked me. It was so odd – she had an almost desperate glint in her eyes. Why was she begging me?</p>\n\n<p>“Sure, <em>Maman</em>. I’ll take him,” I told her. “Ares! Ares, are you in the front room?”</p>\n\n<p>“Sissy?” he asked as he ran to me, perpetually beaming. “We going to da pawk today?”</p>\n\n<p>“<em>Are</em> we going to the park today,” I corrected. I was trying to get him to speak in more complete sentences, though our parents assured me he was doing fine for his age. He wouldn’t begin kindergarten till next year. “And yes, we’re going to the park.”</p>\n\n<p>“Yay!” he celebrated. “Yay, <em>Maman</em>, da pawk!”</p>\n\n<p>“Yes, <em>ma puce</em>,” she told him, leaning down to hug him and kiss his cheek. She hugged him a little longer than usual, and Ares started giggling. When she stood up he turned and ran back into the front room to get his jacket and shoes, her face was awash with… serenity? Resolve? It was a difficult emotion to place – or lack thereof. “You’ll have a lovely time, <em>mon petit-chou</em>,” she told me. Then she hugged me too. I held it for as long as I could, before hearing Ares running around in his sneakers.</p>\n\n<p>I didn’t look back as I called goodbye to my parents and headed out with Ares. If I’d known it would be the last time I’d see them, I would’ve handled my departure much differently.</p>\n\n<p>The park itself was normal. I supervised Ares climbing up and down the jungle gym with other little kids as I talked to some parents I’d seen in the neighborhood. I even pushed him down the slide a couple times. After he got tired out, we returned home. Our parents were still gone, and at first, I thought nothing of it. But then the time I was supposed to go to Desi’s house grew closer and closer, and there was still no sign of them. I decided to call <em>Maman</em>, but got her voicemail. Figuring she just didn’t want to answer while she was driving, I said, “All right, I’ll call Dad.” Then I called my father’s cell phone. That one <em>also</em> went to voicemail. I left a message: “Hey, Dad, it’s just Evie. I’m wondering when you and <em>Maman</em> are getting back home, because I was going to Desi’s later and I can’t leave Ares alone. Let me know when you’re coming home! Love you, bye.”</p>\n\n<p>Another hour passed. Nothing. Desi texted me, asking if I was still coming over. I told her the truth: my parents still weren’t home, and I was getting worried. Desi told me not to worry, that they’d be back soon, yada yada yada. </p>\n\n<p>Then my phone started ringing. Hope lit my face as I looked at the number – it wasn’t either of my parents’ numbers, though. It wasn’t even one I recognized, although it was a New York number. I decided to answer. “Hello?”</p>\n\n<p>“Am I speaking to Praxis Sutton?”</p>\n\n<p>Nobody called me Praxis. <em>Nobody.</em> Bracing myself to tell off a spam caller, I said, “May I ask who is calling?”</p>\n\n<p>“My name is Lisa Burgess, I’m a detective with the Rye police department. Am I speaking to Praxis Sutton, the daughter of Renard and Magdala Sutton?”</p>\n\n<p>I felt my stomach drop. “Yes, this is she. But everyone calls me Evie. What is this about?”</p>\n\n<p>“Okay. Evie.” The detective paused. “I’m afraid I have some very bad news for you. Your parents got into a car accident near the shore today. They drove through the guard rail into the water. They… they were pronounced dead at the scene… I’m so sorry.”</p>\n\n<p>I heard the detective tell me to meet her at the police station, and all I could do was reply numbly, my eyes filling with tears – but they didn’t feel real. Nothing felt real. This couldn’t be happening. When I hung up with the detective, I looked at Ares, playing with his train set on the floor of his room. “Ares, sweetie?”</p>\n\n<p>“Sissy?” he looked up.</p>\n\n<p>“Sweetie, we have to go,” I told him. “We have to go now, you have to come with me.”</p>\n\n<p>“Sissy, wha’s wong?” he asked, running up to my sitting form and wiping at tears on my face. “No cry! No cry, ’sokay! No cry!”</p>\n\n<p>I couldn’t take it – a dam broke. I openly wept as I held my little brother to me. Our parents were gone. He only had me. I had to take care of him.</p>\n\n<p>“We have to go, we have to go,” I kept repeating as I got his sneakers and jacket. He must have been so confused, and by extension scared, but I couldn’t explain anything right then. The drive passed in a fog – it’s a miracle I didn’t get into an accident, I must’ve been on autopilot. I was on autopilot for the next several days, cooking crappy meals and talking to my parents’ lawyers. And that was the weird part: neither one of my parents left anything to each other in their wills, and only <em>Maman</em> made any provisions for Ares. Everything else was left to me, most of it in a trust that I could access once I was thirty-five.</p>\n\n<p>That brings me to the other issue: I was still a minor. I wouldn’t turn seventeen for another month. It didn’t matter if I <em>seemed</em> self-sufficient, I couldn’t be left alone to take care of Ares any longer. My Aunt Lydia - <em>Maman’s</em> sister – had volunteered to take us both, but she lived in France with her family. Uncle Ted had argued that while Ares would probably fare no better or worse, I should not be uprooted from my home country for the last year of my compulsory education. So without much arguing, Uncle Ted won custody of both of us.</p>\n\n<p>The funeral was in Charleston. Another Episcopalian service. Aunt Lydia and <em>Mémé</em> even came from France (<em>Bon-Papa</em> had passed away when I was little). Our house in New York had already been cleared out in record time by that point, and it was so bizarre to know this time, I wouldn’t be flying back. Ares seemed to better understand now what it was to “go to sleep and never wake up,” and he was more somber this time as a result. Being near me seemed to help him, I suppose because I was familiar, so he rarely left my side in those first couple weeks. And once again, interment was in the family crypt, and new inscriptions were added: Renard Arsenius Bonner Sutton, 1967 – 2015; Magdala Mariamne Arouet Sutton, 1969 – 2015. <em>Maman</em> and Aunt Rosie had been the exact same age.</p>\n\n<p>Heading back into Sutton Hall for the repast, Val ran up to me: “Hey, Evie, hey, I wanted to talk to you.”</p>\n\n<p>“About what?” I asked, stepping out of the way of other mourners.</p>\n\n<p>“About how you really feel,” he said. “Now how you think you’re supposed to answer the question –”</p>\n\n<p>“I feel abandoned,” I told him, before I could think about my response. Looking around to make sure people weren’t listening to me, I let the words pour out. “I feel like there had to have been a way to stop it. I feel like Dad and <em>Maman</em> were too young to die. I feel like Ares is entirely too young to be an orphan, I don’t want to be an orphan, and most of all I can’t be this orphan’s mother!”</p>\n\n<p>Val looked taken aback, like he hadn’t expected such an impassioned response. Well, then, why did he ask the fucking question? He should’ve known –</p>\n\n<p>“You know, you’re not alone here,” he told me. “Honestly. You’re with family. Daddy, Vinnie, me. We’re all here with you. We’re here for you. Shit, my momma’s been gone, what, a month? That still hurts. But we’re in this together.”</p>\n\n<p>He held out his hand, as if wanting to shake on an agreement. I didn’t “shake hands” with family – I reached out and embraced him, then started crying all over again. Why couldn’t I stop already?</p>\n\n<p>“Did you make Evie cry, Val?” Vinnie asked from behind me. Out of the periphery of my vision I could see her standing with one hand on her hip, looking so much like her mother it broke my heart into even more pieces. Seeing me cry had made Ares start to cry, so Vinnie swooped down and lifted him high into her arms.</p>\n\n<p>“You’ve gotten so <em>big!</em>” she marveled as she held him aloft. I could hear laughter breaking up his sobs. “How did you get so <em>big?!</em>”</p>\n\n<p>“I’m gonna –” Ares hiccupped. “I’m gonna gwow big as a TWEEEEE!”</p>\n\n<p>“Big as a tree, huh?” Vinnie teased. “But if you grow big as a tree, how you gonna fit in the house, then? Didn’t think about that, did ya?” This made Ares laugh even more, which in turn made me feel better. She took Ares into the house, and I leaned on Val’s shoulder as we followed.</p>\n\n<p>I didn’t tell them about when I’d gone to the police station with Ares. I didn’t tell them about Detective Burgess’ investigation of the accident. I didn’t tell them about how I’d eavesdropped on a conversation between Burgess and another detective, where Burgess posited the theory that my mother had <em>intentionally</em> driven the car off the road, therefore making the “accident” a murder-suicide. I didn’t tell them that the only reason that wasn’t the ruling was “insufficient evidence.” I didn’t tell them that, in a very sick and twisted way, Burgess’ theory seemed like the truth. But why, exactly, would my mother want to kill my father, and then herself? Why would she want to leave her children behind?</p>\n\n<p>As I stared at the daunting mahogany door of the estate, my mind raced back to the peaceful resolve on <em>Maman’s</em> face the last time I saw her. That blankness overtaking her slate blue eyes. Then it raced even further to that day in the dining room, cognac flowing and threats flying. Vinnie panicking. <em>What didn’t I know?</em></p>\n\n<p>“Evie!” I heard a voice calling me as I felt hands on my shoulder, shaking me. I nearly jumped out of my skin. I turned to see Phoebe, sipping the dregs of her Boba tea through the same big fat straw, and returned to the present: my dorm in the Upper West Side of Manhattan.</p>\n\n<p>“Evie? Are you poorly?” she asked me. I vigorously shook my head. “No, it’s fine. I was just… remembering something.”</p>\n\n<p>Phoebe nodded. She has an idea of what I’ve gone through, but not the whole picture. “Are you… going to be all right?”</p>\n\n<p>I looked her in the eyes and told the truth: “I will be.”</p>\n</div>\n","author":"EvieSutton99"}