{"rank":"2","title":"Something from my childhood nightmares is haunting me, but I'm 17","id":"8m6kqp","url":"/r/nosleep/comments/8m6kqp/something_from_my_childhood_nightmares_is/","time":"1527295891000","body":"<div class=\"md\"><p>This is my first time posting something on here, or anywhere, but i figured this would be a good place for these happenings, if anyone knows what&#39;s going on I&#39;ll gladly take help. I haven&#39;t told my parents yet, they&#39;ll just think I&#39;m crazy. You can decide yourself if it&#39;s true or not, but i know what I&#39;ve seen. </p>\n\n<p>It all started about 2 nights ago, but i feel like i should at least give a bit of back story to this.\nAbout 4 or 5 years ago, i had a strong fear of the dark and my closet. Now this sounds normal right? most kids are afraid of the dark and their closed closets with the door, the darkness stopping them from seeing past. But you see, i slept with a lamp, and my closet didn&#39;t have any doors, it was open and full of light... but i never felt... safe around it. that was until i turned about 13, and finally shut my door turned off my lamp and tried to sleep (with the help of a nightlight of course). And from there the nightlight cut out, and i just stopped. I never heard any weird sounds, no noises, nothing. I used to wonder why i slept with the lights on in the first place.</p>\n\n<p>Now here i am, 17 years old and still sleeping in the tiny twin bed in my upstairs room, I couldn&#39;t see any reason to leave, as i am getting out of high school in just about a month. Besides the fear of collage. work, relationships and all that, life was pretty good. That was until, as i said, 2 days ago. on Wednesday, the 23rd of May, was the first time i heard a noise come from the closet. It was late at night and i had been watching horror story&#39;s, videos, all that stuff, anything really scary. I hadn&#39;t noticed the time, it was nearing 3am. I deiced to get to sleep, as i had a test the next morning. I turned on the same lamp that had stayed with me about my whole life, got outta bed and set my laptop down on my desk. But as i tucked myself back in to bed, pulling the covers over my shoulders and reaching for the lamp, I heard a sound that will haunt me from this day forward. A gentle... laugh. It was just a slight giggle, like that of a little boy. I instantly shot up outta my covers and raised my fists. My parents were in the other room next to mine. I grabbed my door key from above my bed and ran out of my room, locking the door. I ran back downstairs and, grabbing a knife, ran back up. The door was still locked. &quot;Thank god...&quot; I can remember muttering under my breath as i fiddled with the key. As soon as the lock clicked, I kicked open the door, knife in hand and walked around the room. It wasn&#39;t a big room at all, just big enough to stay in. But also big enough to become worried and turn around constantly. I checked my small closet type deal, nothing... There&#39;s no way i just... heard something... right? I remember thinking, and i really do wish i had just heard something and that it was all in my head. I checked the whole room more times then I&#39;d like to admit. after making sure everything was in order, I set the knife down on my nightstand and checked the time... It was 3:45 AM, Almost time for school. I settled down in to bed, taking off my glasses and after setting them near the knife, passed out. </p>\n\n<p>I awoke about 4 hours later, almost at 8 o&#39;clock, School didn&#39;t start till 9, I was good. I just figured that i had a bad dream or something and brushed off the strange memory, got ready for school, and completely forgot about it 3 hours later. It wasn&#39;t untill about 15 hours later, around 12 PM, when i remembered the true horror of the incident. I wasn&#39;t watching horror this night, so i knew it wasn&#39;t from that. In fact, i was just reading a light hearted book. My mind was trailing and i figured i should get some sleep. It seemed to happen in the same order. I got in to bed, tucked myself in, and as i pulled the covers and got ready to hit the light... i didn&#39;t hear anything.. no, i felt something. I recoiled my hand back, swearing loudly, as i felt another human hand... another BLOODY human hand touch mine.... &quot;this can&#39;t be real, this can&#39;t be real... there is no way....&quot; I kept thinking and saying. I sat up, staring around my room this way and that... hoping to see something... and not hoping all the same. It took about an hour and a half before i fell to sleep. I woke up only minutes after. there was a little boy standing outside my door frame. About 8 or 9 years old, short hair, a buttoned up shirt, and shorts.... with only black eyes, no whites or anything and pale gray skin... He gave me a toothy grin, his teeth were yellow and decaying. Then, with a quick giggle to himself... walked through... my wall. I sat there in a state of fear and shock. A little boy... walked in to my wall and vanished... there was no way this was a prank... Needless to say I&#39;ve been running on low sleep, as i hadn&#39;t gotten any sleep at all last night. So here i am, in a coffee shop at 10 pm, dreading the next night... I went to the church after school and told them about my.... situation. They gave me a cross and just told me to wear it. I don&#39;t think this is going to help... but it might stop him from touching me. </p>\n</div>\n","author":"Dryden_"}