{"rank":"3","title":"Best Day in School","id":"8m6xn7","url":"/r/nosleep/comments/8m6xn7/best_day_in_school/","time":"1527299645000","body":"<div class=\"md\"><p>My school life is nothing but torture, all my life I am known as the one guy who snitches, outsmarting everyone, and just takes abuse like I want it or something. I want to skip school, but I can&#39;t since my father and grandmother wants me to succeed well in school. Little do they know about my issues, the only one person I can go to is my girlfriend. God I love her so much, she is the only one to understand me as she had been back-stabbed so many times that she had lost count 2 years ago. So many failed relationships, and so many lost friends. When she chose me, she lost many friends because I am the high school loser. I don&#39;t care what they think though, and neither does she; that is the way it is and life with her is the best. Even when either of us gets upset, we&#39;ll even resort to making sweet, passionate love in order to make each other feel better</p>\n\n<p>One day, however, is the day I started losing control. My girlfriend was walking home alone one night - usually I come with her so we can chat and tease each other. A group of guys from my school found her alone and they ganged up on her. When she came over to my house at midnight, she was in tears with makeup running down her face. She held onto me tightly and said goodbye, then left. I noticed white stains on the floor as I looked down; at that moment I realized what had happened. She was raped.</p>\n\n<p>From that point on, I learned that she broke up with me to protect me. She would be the jocks&#39; &quot;slutty whore&quot; just so they won&#39;t kill her nor will they come and attack me. However, every second without her brought me further down into anger. She was my release, but now she is gone, and I have no reason to live.</p>\n\n<p>I was working in class one day, the day was almost over when someone behind me and chanted to his friend: &quot;What a nice piece of ass she is, she won&#39;t miss him&quot;. This started the most relieving, the most beautiful day of my life. </p>\n\n<p>I took my pencil and plunged it into his neck, he gasped for air as I caught him right in the vital vein. I then pulled it out and looked at the others before me, their fear only made it a lot more satisfying. One charged at me bravely, but I took his head and cracked his nose with mine. I then slammed him to the wall as I took the cord for the projector screen and choked him with it. Others tried and ended up as another number to the list, others cowered in fear as the teacher called the police.</p>\n\n<p>The police arrived, they tried to stun me but I knew I had another list to carry out. I wanted the heads of the jocks who raped my girl.</p>\n\n<p>I run to the stadium with my bloody #2 pencil in hand as I catch them banging my girl. It was so easy to slit their throats, so easy to end it all. Why hadn&#39;t I done it sooner?</p>\n\n<p>I look at my girl, so happy that it is done. I expected her to be happy too, but she wasn&#39;t. She looked at me like I was a monster, she was scared of me. It was then I realized why I didn&#39;t do it at all. I had given in to my dark desires, I was a monster. I had became the demon of the hell I endured for years. The police came in, and I knew what to do. I charged at them, ready for the bullet to end me. The trigger was pulled instantaneously.</p>\n\n<p>The next thing I see is my ceiling, and my alarm going off. It was 5:30AM, time to get up and go to school.</p>\n</div>\n","author":"SSGSSMiller"}