{"rank":"49","title":"My Neighbors Never Go Outside [Part 2]","id":"8m7198","url":"/r/nosleep/comments/8m7198/my_neighbors_never_go_outside_part_2/","time":"1527300709000","body":"<div class=\"md\"><p><a href=\"https://www.reddit.com/r/nosleep/comments/8lxwl1/my_neighbors_never_go_outside_part_1/\">[ Part 1 ]</a></p>\n\n<p>I should have listened to Jenny.</p>\n\n<p>But, I didn’t. </p>\n\n<p>I walked right over there like I knew what I was doing. I knocked. The camera whirred. Nobody came to the door. I could hear them in there. I knocked again. I stood there for a good ten minutes, listening. I could hear them, murmuring, just on the other side of the door.</p>\n\n<p>I knocked so hard my knuckles stung and my hand shook. The camera regarded me silently.</p>\n\n<p>I got angry. How could they just ignore me like that? I looked at the camera, I looked over my shoulders. I put my hand on the knob and twisted.</p>\n\n<p>To my complete surprise, it opened.</p>\n\n<p>I stepped inside, leaving the door partially ajar behind me. It was dim and my eyes took a moment to adjust. </p>\n\n<p>It was an open floor plan. Just like Becky’s. The living room, dining room, and kitchen were all visible from the entrance. There were dozens of men, sitting in office chairs staring at screens mounted to the otherwise bare walls. Their backs were to me. They all wore headsets and whispered into microphones, oblivious of me, still. </p>\n\n<p>“Hello?” I said. I meant to shout but croaked instead.</p>\n\n<p>No one seemed to notice.</p>\n\n<p>I shuffled on nervous feet over to the closest man. The screen he was staring at was divided into about a dozen different sections. Some sort of surveillance feed, it seemed.</p>\n\n<p>“Initiating minor cardiac event, subject number 42142159. Dr. Vietor receiving.”</p>\n\n<p>I peered over his shoulder and recognized different rooms in my friend Becky’s house down the street. In one corner of the screen, the master bathroom was shown. Becky was there, sitting on the toilet, staring at her phone. One of the segments of the screen seemed to be a mirror of her phone screen. She was scrolling through images of birthday cakes on pintrest. Then, the screen went black and a seemingly random pattern of flashes erupted. Becky’s body tensed, her eyes remained glued to the screen. </p>\n\n<p>The man’s hand moved calmly to the mouse and clicked. The mirror image of Becky’s phone disappeared.</p>\n\n<p>“Sequence initiated,” he said into the headset. </p>\n\n<p>I remained frozen in place, watching my friend on the screen. She dropped her phone and clutched at her chest. She stood up on unsteady legs and stumbled forward a few feet before sinking to her knees on the floor.</p>\n\n<p>Then, I sensed movement to my left. I turned to see a man silently striding towards me, headset around his neck. When I turned, he pulled a headset off the man closest to him and gestured towards me. “Help me hatch her,” he said, as the man rose to his feet. </p>\n\n<p><em>Hatch? Certainly, he said catch.</em></p>\n\n<p>No. He took something out of his pocket and pressed a button. A section of the floor behind him began to rise, revealing a dark cavity beneath.</p>\n\n<p>It takes much longer to explain all of this than it took for it to happen. At this point, I had probably been inside for less than 30 seconds. </p>\n\n<p>I felt as if I was moving through mud as I made for the door. It was like trying to run from something in a bad dream. My legs nearly refused to cooperate. In the end, they got me where I needed to go. Good old legs.</p>\n\n<p>I swear I felt fingertips brush the small of my back just as I burst through the door and into the sunlight. I heard the door slam shut behind me, but I kept running, all the way back home. No one followed.</p>\n\n<p>I locked the front door behind me. I stood there gasping for breath and willing my legs to stop shaking. I had barely begun to process or understand what I had seen and heard. There were dozens of screens visible from the entry. How many more were there? Was the entire neighborhood under surveillance? My eyes combed the corners of the room. Were they watching?</p>\n\n<p>What had they done to my friend? Just as the question occurred to me, I heard the warble of an ambulance in the distance. </p>\n\n<p>I took a deep breath and peeked out of the window that looked out on my front porch. No army was swooping in on me, not yet. I took a deep breath and trotted into the kitchen where I’d foolishly left my cell phone. I entered the passcode and dialed George. My hands shook. I listened to the crackling silence for several moments before a robotic voice proclaimed that the cellular network was currently unavailable. I tried a couple more times as I walked the perimeter of the downstairs, checking the windows. Fine. I’ll just drive to the office, I thought. </p>\n\n<p>I grabbed my keys and went to the front door. It wouldn&#39;t open. Neither of the locks would budge. I tugged uselessly at the knob with all my weight. No give at all. It didn’t even creak. I tried the phone again, fruitlessly, as a silent panic wormed it’s way into my bones. </p>\n\n<p>The warble of the ambulance grew closer and closer. Its pitch rose high and then dropped off as it passed the house. <em>On it’s way to Becky</em>, I thought.</p>\n\n<p><em>Minor cardiac event. Sequence initiated</em>, I thought.</p>\n\n<p><em>Hatch her</em>, I thought.</p>\n\n<p>I thought about the eerie hollowness of the house, an empty mirror of Becky’s. No cabinets, no fixtures. Just screens, and chairs, and men wearing headsets. I thought of the section of the floor in the would-be living room. The hatch.</p>\n\n<p>I examined the rug in the hallway. Heart racing, I picked up a corner and flung it aside. I got down on my hands and knees and examined the grooves between the wood planks. Some seemed deeper than others. I traced the rectangle the deeper grooves made with my finger.</p>\n\n<p><em>Hatch her.</em></p>\n\n<p>I pressed my ear against the hardwood, like an Indian in an old Western listening for buffalo. Did I hear something? A click?</p>\n\n<p><em>Did I?</em> </p>\n\n<p>I jumped to my feet. I pushed the hutch, a sturdy wooden deal, over the grooves I’d found. I armed myself with a long, sharp knife from the kitchen. I tiptoed up the stairs and locked myself in the bedroom.</p>\n\n<p>I waited.</p>\n\n<p>It didn’t take very long. I heard the long, deep groan of wood against wood and the thundering crash of the hutch. I expected that.</p>\n\n<p>What I didn’t expect was his voice. </p>\n\n<p>“Jesus Christ, Marie!” George said, followed by an incoherent, but familiar string of muttered curses.</p>\n\n<p>“Don’t be afraid, honey,” He called. “I just want to talk.”</p>\n</div>\n","author":"lazykill"}