{"rank":"5","title":"The Dead Town is leaking","id":"8m7204","url":"/r/nosleep/comments/8m7204/the_dead_town_is_leaking/","time":"1527300923000","body":"<div class=\"md\"><p><a href=\"https://www.reddit.com/r/nosleep/comments/8l6q96/the_dead_town/?utm_source=reddit-android\">part 1</a></p>\n\n<p>I&#39;ve since rebuilt <em>another</em> ultralight for the upcoming trip. This one is a gyrocopter type, with a 124 horse power turbocharged four cylinder aircraft engine. Its bug enough for three people, and holds twenty gallons of fuel, for 6 hours flight time. I thought I was ready to go back.</p>\n\n<p>I, however, am starting to rethink my position in going back. I no longer <em>want</em> to, but I might actually <em>need</em> to. Let me tell you about what happened last night, and why I&#39;ve been interrogated by half a dozen alphabet agencies over the last 24 hours. Fun, right?</p>\n\n<p>I had just smoked my &quot;good night&quot; bowel and was ready to crash out for the night. The kids were bathed and in bed, ready for their last day of school today, the wife was already in her gown and reading a book in bed. I was tired from working my normal 4:00 am to 9:00 pm shift at my shop, so bed was all I could think of.</p>\n\n<p>I think I had just drifted off, you know that fuzzy floaty feeling when you get almost to sleep, and get woken up, suddenly, quite rudely? Well, that&#39;s what I was feeling when the phone on my nightstand started ringing. It was an automated call from my alarm company, informing me of a break in at my shop. At the end if the robotic female voice recording, was a live person, a dispatch officer from my local sheriffs department. She informed me that police were in route and that I should wait for them to clear the scene before going down to the shop. I hung up the phone, got dressed, told the wife what was going on, and walked out the front door. I jumped in my old truck, and drove to the shop, probably breaking half a dozen speed limits in the process.</p>\n\n<p>When I arrived at my shop, I was met with half a dozen cop cars. It was more than the usual two officer turn out for an alarm trigger, so I kinda figured something was wrong. I approached the sheriff, and asked him what had happened, and if it was safe for me to enter.</p>\n\n<p>&quot; Well, sir, I can&#39;t rightly answer either question as of yet, but if you&#39;ll have a seat in your vehicle, I&#39;ll find out for you.&quot; Was all he said before turning and rushing to another officer who was posed at the front walk door of my shop. </p>\n\n<p>I sat in my truck, and lit a Marlboro, while I waited. I was about half done with my smoke, when the older portly officer from the door approached me, with his hand on the butt of his holstered pistol. I thought it was simply muscle memory, so it didn&#39;t phase me too much.</p>\n\n<p>&quot; Mr.[redacted], I&#39;m going to have to ask you to come with me, I need you to walk through the place and identify any damage or possibly stolen items. Please, I&#39;m sure you want to be back at home, and honestly we do too, so if we could get his done, but don&#39;t rush, take your time, but hurry. Hahahah, an old army joke, hurry up and wait.&quot; He chuckled as he lead the way to the front door. </p>\n\n<p>I flipped the overhead lights on, and was utterly floored by what I was met with. The entire shop was coated in that same flaky white shit from the town. It almost looked like everything in my shop, had been covered in a layer of frost. Not completely covered, but you could definitely see the shit. I walked through, careful not to touch anything, just in case the cops were actually going to do anything.</p>\n\n<p>I made it through the shoo, and I to my office, where I keep some memorabilia from races, and other motorsports. I&#39;ve got an old <em>ORIGINAL</em> <strong>RUNNING</strong> 1909 F-Head Harley Davidson engine along with many other expensive items in my office. Nothing was <em>missing</em>.</p>\n\n<p>However, something had been added to my collections. It was about the size of the palm if my hand, yellow in color and tacky with some type of slimy filth. It was a piece of the wing cloth from my original ultralight. I know what it meant, but I tried to act like it was all normal.</p>\n\n<p>&quot; No, officer, nothing here is missing. Let&#39;s check the pneumatic tools, and the parts in the store room.&quot;</p>\n\n<p>The cop never even looked up, just nodded and muttered an approximation of &quot;UhUh&quot; before leaving the office and following me to the store room. </p>\n\n<p>In short, nothing was missing, or damaged, aside from the overhead door that had been torn off the rails and left in the parking lot. The cops asked me half a dozen times if I had any enemies, if I had any thoughts about who could have broken in or why. Yadda yadda yadda. Then they left. </p>\n\n<p>I called the emergency number for the door company, and told them I needed a new door as quickly as possible, due the break in, they were actually polite, and said they sent a tech with a new door before the call was even finished. I decided to get the pressure hide and nozzle and blow that disgusting filth of dust out of my place of business. </p>\n\n<p>It took me three hours, with a broom and the hose to clean the worst of the shit out, and during that time I found several things that made my skin crawl. The empty cans of mixed fuel from the old hardware store were scattered around the work floor, I found a long, twisted black thing, that I believe to be one of the claws from that thing I had chase me from that town. </p>\n\n<p>I was rolling the hose up, when the first black SUV pulled up. I knew it wasn&#39;t the door guy, because they drive bright yellow and white vans. Before the driver could open the door, two more black SUV type things pulled up and shut off, leaving their bright ass fucking lights shining into my eyes. The driver of the first one got out of the vehicle and walked briskly toward me. I felt my heart drop.</p>\n\n<p>The guy was in his forties, built like a tank short cut Army hair, no facial hair, dead blue eyes, and a scar across the right side of his face, running from his ear to the corner of his eye. &quot; Mr.[redacted] I am special agent Johnathon Breely I need to have a word with you. I happen to be privy to some high tier information that may or may not affect your life. Depending on how honest you are with me, this may be a long night for you. Is there anywhere we can sit, and talk? Oh, do you have any coffee brewed?&quot;</p>\n\n<p>&quot; Uhmm...yeah, okay, my office is right over here, and I can have some trucker style sludge ready in three minutes. So, what the hell broke into my garage Agent Breely?&quot; I said, as I walked the shirt distance to my office, pausing to push the brew button on my Bunn. </p>\n\n<p>&quot; Well, son it seems like you&#39;re asking the right questions, but you need to answer some for me before I can answer anything for you. And trucker style sludge is just what I need. &quot;</p>\n\n<p>We sat in silence in my small office, with two other silent and large agents standing on either side of my closed door. The questions were rather predictable, how did I discover the creatures, where were they when I discovered them, had they managed to physically touch me and on and on and on.</p>\n\n<p>In the end I told the guy pretty much the solid truth, just not that I planned on going back. In fact I told him I had no idea where the town was, or how to get back, and used my landing in the police station lot as my proof of aviation ignorance.  He seemed happy with my answers, and finally agreed to answer five questions for me, so long as the answer wasn&#39;t highly classified. I figured since I already posted this much, I may as well post the questions and answers that followed my odd interrogation.</p>\n\n<p>Me: What was that thing?</p>\n\n<p>Agt. J. Breely: That was what we affectionately call a flake. Its not dead, but not technically alive either.</p>\n\n<p>Me: Where did they come from?</p>\n\n<p>Agt. J. Breely: That&#39;s the funny thing. See this town you <em>accidentally</em> found, was in fact a research station for a classified wing of the government. It was supposedly destroyed, and all evidence of its ever existing scrubbed from record.</p>\n\n<p>Me: Did they make that thing, or did they find a way to breach our world, and bring them here?</p>\n\n<p>Agt. J. Breely: Both actually. They discovered some DNA in a mine in another county, blew the mine to seal it, and brought the samples to the town where a breach in containment allowed an agency doctor to become exposed to the sample directly to his blood via a piece of broken glass.</p>\n\n<p>Me: Is my family in any danger at all, what so ever?</p>\n\n<p>Agt. J. Breely: No, we already have agents stationed in surveillance positions around your home. As if now the family is completely safe, and they will stay that way.</p>\n\n<p>Me: What agency is it that you are from exactly?</p>\n\n<p>Agt. J. Breely: Well, its been a different type of experience speaking to you, Mr.[redacted] but I am afraid our time is up. Listen to me very carefully son, stay away from that place, do not go back. If you see a flake, run, and call me immediately. </p>\n\n<p>He gave me a card and left the garage as the door crew was pulling in. I didn&#39;t get my fifth answer. The door guy was a young dude in his twenties, typical late night stoner looking guy. As the SUV trio peeled out, he nervously looked at me and said &quot; Long night huh?&quot; </p>\n\n<p>&quot; You have no fucking idea man.&quot; I went back to the office to get me and the door dude a coffee, and when I returned the door guy was already laying out my new panels. I handed him the coffee and asked him if wanted to smoke a joint when he got finished. Of course he did. He turns down free pot at four AM?</p>\n\n<p>He finished we smoked, and I started my day. Already tired, grouchy and in an all around bad fucking mood. I texted my ex marine buddy Joey, he is down to go with me to the town, and is coming tonight, so we will be leaving about 3:30  in the morning Saturday morning. I&#39;ve got weapons water and power bars packed, Joe says he has a few surprises for me. He even said he would try to find out some information about the town, by having a friend look up the agent that questioned me. </p>\n\n<p>I&#39;ll let you know what happens.</p>\n</div>\n","author":"KyBluEyz"}