{"rank":"20","title":"I Can't Go Back to the Hospital Because of the Rats","id":"8m76jg","url":"/r/nosleep/comments/8m76jg/i_cant_go_back_to_the_hospital_because_of_the_rats/","time":"1527302246000","body":"<div class=\"md\"><p>After I didn’t get into med school I took a job working as a lab tech for Dr. Leake. The campus was part university, part medical school and part teaching hospital. They did a lot of medical research there and Dr. Leake had a grant from a pharmaceutical company to test out a new antibiotic in rats. She would start the experiment and I would come in and give the treatments. We were studying skin infections so I had to go into the lab every 4 hours and rub the ointment on the rats. </p>\n\n<p>That part wasn’t too bad. I put the rats to sleep by filling their chambers with gas, and after that it only took about half an hour to treat of them.  What I didn’t like was having to go in to the lab at night and kill the animals.</p>\n\n<p>Sacrifice, not kill. Dr. Leake was always telling me to say “sacrifice” instead of kill. She thought it was more respectful, but I didn’t like it. Sacrifice isn’t a scientific word; it’s a ritualistic, religious word. </p>\n\n<p>Anyway, I went into the lab one night at 1:30 am to kill, I mean, sacrifice the rats so we could collect their blood and organs for our study. The treatments seemed to be working, the rats that got the drug got better while the ones on the placebo died; but Leake was worried the drug might be toxic so we had to collect the rat’s organs and check for drug buildup. It was messy work.</p>\n\n<p>I put the rats to sleep and put them into the CO2 chambers. The CO2 pumped in asphyxiates the rats and they die peacefully, well sometimes.  Sometimes if they weren’t knocked out they’d twitch across the floor of the chamber.</p>\n\n<p>After the CO2 chamber I stacked the rats on the table for the second kill method. Federal protocols require that we always use two methods to make sure the animals are dead. Sometimes a researcher would get in a hurry or get sloppy and an animal would survive. That leads to inquiries, write ups, and a closer eye on your protocols, which would have pissed off Leake.</p>\n\n<p>Our second method was “cervical dislocation.” It sounds fancier than it is; we popped the skulls from their spines, severing the spinal cord. </p>\n\n<p>I had some problems with the last rat. He was fatter than the others and I couldn’t dislocate him. I put on pair of large tweezers against the base of his skull, held his tail with my left hand and pushed hard. You can normally feel a little click when it’s done, but I couldn’t get it. I felt the skin beginning to tear, but I pushed harder. </p>\n\n<p>The rat’s head snapped off, slid across the table, and turned in my direction. The rat’s bulging pink eyes blinked at me.  I gasped and jumped back, knocking my cart of tools over. Next door, the macaques in Dr. Quinten’s lab starting hooting. </p>\n\n<p>“Just reflexes,” I said. I laughed at myself. “Get it together.”</p>\n\n<p>I picked up the tools and slipped the rat’s head into the plastic sack with the other heads.</p>\n\n<p>The organ collection went normal; I put the livers, hearts, and spleens into their tubes and on ice. I think it was about 2:15 or so by the time I slid the bloody rat carcasses into the sack and tied it off. </p>\n\n<p>Down the hall on the right was the cold room. We kept the animal carcasses in there until burn day. I never liked the cold room, the smell was nauseating and I’ll admit I  had a childish fear of being locked in with all those dead rats. </p>\n\n<p>I opened the door and stuck my left foot back to stop the door, you know, just in case. The room had a dozen large red plastic containers with the plastic sacks from the other lab’s projects. I tossed my sack onto the pile and it landed with a wet thump </p>\n\n<p>Something in the box moved. </p>\n\n<p>I stared as a large rat pushed my sack aside and crouched at the top of the pile. Its back was to me and I could see its shoulders rising and falling as it worked its hands across the top of its head. Clotted blood was streaked wildly across its back and I thought about how hard it must have struggled to get out of its sack and literally claw its way up through the weight of all those other dead animals. </p>\n\n<p>The rat turned around and looked at me over its shoulder. The left side of its face was gone; I could see its wet teeth through the gap in its skin. Its claws were long and seemed disturbingly human as they cleaned the blood stained fur on the back of its head. It turned back around and continued to groom itself. </p>\n\n<p>“Oh shit,” I said. Someone had forgotten to do the second kill method and this rat had survived. Protocol said I should capture it, kill it, and then call the lab vet on call. To the left was a small broom. I thought I could hit it with the broom and then slip it into a sack. I was pretty sure I couldn’t snap its neck, no, I would just put it into the CO2 chamber, that would be good enough </p>\n\n<p>I tried to reach over and grab the broom, but I couldn’t reach it with my foot propping the door open. </p>\n\n<p>“Get over it,” I said as I stepped fully inside. The rat turned around and glanced at me as the door shut. I froze under its silent gaze, but after a minute it turned back around. Quietly I pulled the broom off its hook and crept forward. I got within striking distance and raised the broom over my head.</p>\n\n<p>All around me I heard the squeaking of plastic bags shifting. It was coming from the other boxes, and as I looked I could see the carcass filled bags undulating. The bags were ripped over and I could hear the wet bodies sliding over each other. Rats, two or three dozen from each box, rose out of the mounds and stood back on their haunches, staring at me. Many were maimed, missing limbs or with their chests cut open. More than a few were headless, but they turned their shoulders to face me anyway.</p>\n\n<p>I froze, the broom still over my head. I could taste the stench of the rotten rats mixed with bile in the back of my throat. The first rat, what I now irrationally thought of as the leader, turned fully around to face me.</p>\n\n<p>“I’m sorry, I’m sorry, I’m sorry,” I whispered through a choked throat. I shakily lowered my broom and set it on the floor. I kept mumbling I’m sorry over and over again as tears ran down my face. </p>\n\n<p>The leader leaned over and crouched, prepared to leap at me. In one motion, all the other rats did the same. </p>\n\n<p>I bolted for the door, slamming into it. My hands were slick with sweat and I fumbled with the handle. I pounded on the metal door with my left hand, screaming, begging, pleading. I could feel the rats coming up behind me, rushing across the floor and running up my legs; their tiny claws tearing my scrubs, their teeth ripping small chunks of my skin.</p>\n\n<p>The door handle turned and I fell forward into the hallway. I flipped over and began crawling backwards across the tile. </p>\n\n<p>The rats hadn’t moved. They stood erect, silently watching me. </p>\n\n<p>I lurched forward and slammed the door shut. The door latched and I threw my shoulder against it, sliding to the floor, gasping for air.</p>\n\n<p>Then I heard it. From inside the cold room I could hear the rats scratching at the inside of the door. They weren’t scratching randomly or wildly like rats should. No, the scratches were in unison, in rhythm. Up, down, pause. Up, down, pause.  </p>\n\n<p>I got up, ran out of the lab and to my car. I didn’t stop till I got home. I’m pretty sure I ran at least two red lights. It was after three in the morning, but I sent Dr. Leake an email telling her I was quitting. </p>\n\n<p>Next summer when I reapply for medical school, I’m going to apply out of state. </p>\n</div>\n","author":"Ragin_Rlyehian"}