{"rank":"94","title":"It’s not a dog...","id":"8m7azm","url":"/r/nosleep/comments/8m7azm/its_not_a_dog/","time":"1527303614000","body":"<div class=\"md\"><p>I’m writing this now after something I experienced last night. It’s a warning... this is an attempt to protect someone else from what this thing could possibly be. Because it’s not what it seems. At all. </p>\n\n<p>Let me start this off this way first: I’m an animal lover. I have always been since I was little and saving injured animals and strays have always been something I’ve been known to do, so picking this one up from the side of the road was not unusual when it comes to character. It was around 7 at night here in Arizona, when the sun just began to set and I was heading home from a really long day at work. All I wanted to do was go home, take a bath and relax. I was just getting to my driveway when I saw it.</p>\n\n<p>It was a disheveled, mangy looking dog. I parked my car in my driveway and got out of the car and started whistle and talk sweet to the dog to get it’s attention. I had some dog food in my back seat for when I do come across strays or random puppies that deserve a treat. It turned to me, skittish at first and slowly headed in my direction. </p>\n\n<p>It had a limp, it’s back left leg seemed to have been bleeding, it’s white fur was patchy and most of the fur around its skull was gone between its ears. Pink scabby flesh was prominent in more places around its legs, along its ribs and it’s neck. This poor dog was a far cry from its original form.. this dog was supposed to be an elegant looking white standard poodle. </p>\n\n<p>Feeling bad for this poodle I knelt down, got some food out of the bag and put it in my hand to draw the dog in closer and by the time he got to me, something felt off. There was something... disturbing... about his eyes. Pitch black eyes... eyes that seemed to know too much. He didn’t seem to trust me but I guess he was hungry enough to eat food from my hand. </p>\n\n<p>“There you go buddy... what in the world happened to ya? Your owner dropped you off out here in the woods?” I asked it as it munched away. </p>\n\n<p>Where I live is out in the woods, away from civilization for about 30 minutes. I clean cabins for a job, and that is even further away from where I live. People tend to drop off their animals here to fend for themselves, and it can get rather bad. I assumed this dog must have been wandering for a long time to get this bad. </p>\n\n<p>He licked my hand when he was finished and sat back on his haunches, whimpering slightly as if asking for more... so I grabbed another hand full of food and offered it to him. When he ate and licked my hand I looked at his condition more. Poor thing seemed to have had some sort of serious mange going on, his back leg was injured to the point I could see some bone sticking out around the knee, and there were ticks all over the place. Poor thing had been out in the woods for a long time it seemed. I don’t know what happened to his leg though. Perhaps he lost his balance climbing on a rock or got attacked by an animal of some sort. </p>\n\n<p>He had no collar, but he seemed tame enough. If he had been dropped off the people definitely didn’t want him traced back to him. </p>\n\n<p>“Well pooch, I don’t know where you came from but I’ll take care of you for now. Come along and let’s get you cleaned up and comfortable. Let’s see if I can get those ticks off ya.” I said, standing up, the dog watching me at first before following me. </p>\n\n<p>He was slow, still limping, and there was just some kind of creepy presence to him but I wanted to help. I figured I was just psyching myself out over how disheveled his condition was, and his eyes seeming odd. I decided that once he was washed up and had more nutrition than he’s had for a while that he would be like a new pup. I would have to take him to the vet in the morning and find out what else he needed besides possible medication for his mange. </p>\n\n<p>I lead him to the door, opened it for him and like any regular dog he went in and started sniffing around the place. I decided to go get the bathroom ready to give him a bath while he let his curiosity be fulfilled. I grabbed a bunch of towels and I found the dog shampoo I had for fleas and ticks, and started filling the bathtub with warm water. I was going about to turn around to call him in there when I felt a light nibble on my hip. Nearly jumping out of my skin I spun around to see him staring up at me with those pitch black eyes. </p>\n\n<p>I swallowed my fear, dogs can sense if you are scared of them and the last thing I needed was this dog to think it needed to show aggression towards me in this small bathroom. I have to admit it’s really hard to try to calm your heart beat when it feels like it’s gonna pop out of your chest. </p>\n\n<p>“Well hello there pooch, you done looking around? Ready for a bath?” I asked him. </p>\n\n<p>Besides looking up at me there was no movement from his part. No tail wag, no whimper, no eyebrow movement. Nothing. That creeped me out too.</p>\n\n<p>I don’t know why but at this point the room started to smell foul.. like when you leave meat in a fridge that had been turned off for a while. I hadn’t smelled this when we were outside. Maybe because he wasn’t confined out there, that the smell wasn’t so prominent like it was in the bathroom. I know mange makes dogs smell bad but I hadn’t smelled this before... like decay, rotting meat. </p>\n\n<p>My heart started to pound in my ears. I closed the bathroom door, opened the window above the tub and turned off the water. I felt the temperature and turned around to address the dog. </p>\n\n<p>“Well pooch, you ready? I promise you’ll feel better after this. We gotta be careful with that leg of yours though.” I said. </p>\n\n<p>Like he completely understood he timidly got into the tub. Weird. Usually dogs put up more of a fight than this. Especially strays. He must have been really well trained, I thought. </p>\n\n<p>I got the detachable shower head down and turned on the water again and began to wash him with the shampoo. He stayed perfectly still. I thought it was going very well until the water began to turn red. </p>\n\n<p>Blood started to pour into the tub. Not just blood, but clumps of fur and skin. I reached into the tub to drain the water so it wouldn’t get nasty and infect his leg, when the dog growled at me. I froze and didn’t move. Move slowly, I told myself, no sudden moves. The dog must be in pain, I thought. Maybe the shampoo was stinging his wounds. He growled some more, so I then jerked back, holding my arm out to protect my face in case he tried to bite me. I moved quickly to the door, looking at the dog who then put his forepaws on the bathtub ledge and snarled at me. </p>\n\n<p>Now this is the weird thing. His face remained still. All the noises that he made were typical angry noises but any form of expression... didn’t happen. I was getting ready to open the door to go get a weapon of some sort of this got dangerous when he STOOD UP on his hind legs and stepped out of the tub.</p>\n\n<p>I was freaking the fuck out. Screams were trying to escape my mouth but nothing was coming out. More blood fell onto the floor, along with more matted fur and skin. I was staring at his hind legs.. and he took another step toward me this time literally stepping out of his paws.. like we would if we took off our pants and stepped out of them.. and in the place of dog paws was.. hooves. Deer hooves.</p>\n\n<p>The matted mangy dog fur was gone, instead lean, course skinny suede covered deer legs took its place. I rose my eyes up it’s body. All the dog fur, anything that would make this creature a dog was gone. He was as tall as me, lean, deer fur covered him, lean neck... and it’s face... oh God it’s face. Huge large alien almond eyes stared right back at me. He had no ears, just large antlers... and his snout.. what normal deer look like... he had no snout like a regular deer. He had an alien head in general... I just.. I don’t know how to explain this. </p>\n\n<p>I was scared shitless. It’s not a dog, I kept repeating in my head. I don’t know what I brought into my home but it’s not a dog. He moved in closer to me, quiet, stealthy, and reached out his right arm to touch my shoulder with a tiny hoof... </p>\n\n<p>And I woke up several hours later... in the bathroom, on the floor. No blood was there, no signs of what I had went through was evident. I was freaking out. I got out of the bathroom and started running around my house checking every room for this thing that I had encountered. It was no where. I don’t know how I managed to sleep that night but I tell you it wasn’t peaceful. </p>\n\n<p>I gotta leave for work soon. It’s now the day after... I don’t know if it’s still out there somewhere.. but if you see a dog like this.. just remember... </p>\n\n<p>It’s not a dog.</p>\n</div>\n","author":"nanerpus69"}