{"rank":"12","title":"I Fell Asleep on a Stranger and He Started Following Me","id":"8m7c19","url":"/r/nosleep/comments/8m7c19/i_fell_asleep_on_a_stranger_and_he_started/","time":"1527303926000","body":"<div class=\"md\"><p>He smelled like sweat and nicotine, but it was cold at four-thirty in the morning.</p>\n\n<p>The sun hadn&#39;t managed to peak it&#39;s way through the clouds yet, and we were stuck outdoors. There was week-old snow around our feet that had turned to putrid brown shit and slush that happens only without a fresh coat or hot day to melt it away. </p>\n\n<p>There was about ten of us at the bus stop. On these commutes, you got to the point where you saw the same folks every day. It was a mixed bag of randoms; kids you went to High School with but didn&#39;t really know, former unfriendly neighbors, and even a couple nobodies whose faces were seared into memory just from seeing them five days a week, twenty days a month, fuck knows how many a year. </p>\n\n<p>Nobody ever talked. There was some beauty in that. We were all just too tired to hold up meaningless conversations about the weather or how bad it sucked being up that early. </p>\n\n<p>One of the popular girls from high school was there. She had picked up a job at a nice department store in the city to make up for the fact that she was still living at home at thirty. She had dated my best friend once, when we were fifteen. It was never enough to spark a conversation. There was a guy I recognized from one of my nephew&#39;s baseball games, and an acquaintance&#39;s father.  </p>\n\n<p>And then there was the Marlboro Man. </p>\n\n<p>Marlboro Man was there every morning, and he earned his moniker from me, because he worked his way through half a pack of Marlboro Reds every morning before the bus arrived. He was an unassuming man, somewhere in his late forties with greying hair and a kept together waistline. He wore a jean jacket and jeans, which always seemed odd. Must of us were dressed in professional clothes, and Marlboro Man looked like he was off to go farm the ranch.</p>\n\n<p>Nobody ever talked, but there was an unwritten rule that was almost weirdly tribal in nature. We would all sleep, and Marlboro Man would keep watch for the bus with his cigarettes and morning paper. </p>\n\n<p>Nobody ever asked him to do it, he just did. A couple of times I had managed to stay awake and wait with him, but he seemed to never have an interest in sleeping. He was always bright and perky with his morning paper and smokes.</p>\n\n<p>When the bus came, he would rally the downtrodden troops with the same lyrical chant and chuckle.</p>\n\n<p><em>&quot;All aboard! Heh&quot;</em></p>\n\n<p><em>&quot;All aboard! Heh&quot;</em></p>\n\n<p><em>&quot;All aboard! Heh&quot;</em></p>\n\n<p>I heard it every fuckin&#39; day. </p>\n\n<p>This morning was a particularly rough one. I had stayed up late the night before, writing and neglecting any shot at six hours. As soon as I got to the bus stop, I was looking forward to conking out on the bench. </p>\n\n<p>But same as every morning the past six months, Marlboro Man beat me there. As soon as I pulled into the parking lot, I saw his jean-clad silhouette casting a shadow on the bench. I cursed him off from the car. </p>\n\n<p>Every fucking morning this guy beat me to the only spot on the bench. No matter how early I showed up, he was there first. </p>\n\n<p>After walking up in what must have looked like a drunken stuper, I sat down on the bench anyway. There really was not much room for two. The Marlboro Man cast me a sidewards glance when I did it, but said nothing. In minutes, I was asleep.</p>\n\n<hr/>\n\n<p>I woke up to the sound of people milling around me. It was close to bus time, I knew that from the weird internal clock thad developed inside me. I was drooling but warm, and I sat sat still in embarrassment until realizing the reason for both.</p>\n\n<p>I was leaning on Marlboro Man&#39;s shoulder and using it as a pillow.</p>\n\n<p>It was one of those things where you are so mortified, you just panick and freeze. I was fully awake and annoyed with myself at that point, but I knew that the moment I moved I would be accountable for what I was doing. So I just sat there, dumbly pretending to be asleep with my eyes open. </p>\n\n<p>In that moment of awkward social anxiety is when I noticed the contents of Marlboro Man&#39;s newspaper.</p>\n\n<p>It was absurd. So bizarre that I had to hold my breath just to keep from shouting out loud and pointing. Standing in a centerfold spread that looked photoshopped, next to a bright blue headline, was the popular girl from high school. The bold text at the top read the following headline:</p>\n\n<p><strong>Tiffany fucked another one last night. She&#39;s hoping he will stay faithful for the rest of the day while she goes to work. That would be longer than the last one, says insider.</strong></p>\n\n<p>Below Tiffany was the man I immediately recognized as my friend&#39;s father. In the photo op, he was leaning forward with his hand on his chin. The balding back of his head reflected awkwardly in the camera light.</p>\n\n<p><strong>Mike loses another five pounds as of this morning&#39;s weigh-in. Page six has editorial thoughts on whether his wife gives a shit.</strong></p>\n\n<p>Below that was the father I recognized from the baseball games.</p>\n\n<p><strong>Trouble in paradise? Angelo is rumoured to be cheating on his wife again. If confirmed by sources on page four, that would make SEVEN times total!</strong></p>\n\n<p>And then, there was me. The picture was from my college graduation.</p>\n\n<p><strong>Matt plans to propose later this week. He is moving his way up the corporate world but boy does he look like shit lately. Who knows when he showered. Best to keep an eye on Matt this morning, as sources say he may be keeping an eye on you.</strong></p>\n\n<p>I darted my eyes in the other direction. Marlboro Man must have finally noticed my stirring at this point, because he awkwardly shrugged his shoulder to move my head. I tried to handle it gracefully, hoping he wouldn&#39;t realize that I had been reading over his shoulder for the past five minutes. </p>\n\n<p>I stood up briskly and let out a clearing yawn. I checked my pockets, padding them nervously like I was looking for a wallet that was already there. I wanted to make it look unsuspecting, like I forgot something. </p>\n\n<p>And then without even glancing back back, I walked to my car. </p>\n\n<p>When the bus pulled up, I turned around to wave to my commuter comrades like I wouldn&#39;t be able to make it. They all filed into the bus like zombies, ignoring me completely. </p>\n\n<p>All except the Marlboro Man. He stared at me from his seat on the bus stop and did not move. </p>\n\n<p>There was no chant of <em>&quot;All aboard!&quot;</em>. He made no effort to get up from his seat whatsoever. He just kept his eyes on me.</p>\n\n<p>His eyes looked red. I know that sounds even more ridiculous than the rest, but I swear to anything that those eyes were red. I had seen his eyes a hundred times before and they were never fucking red. </p>\n\n<p>I unlocked my truck and stepped inside, locking it immediately but still trying to appear like there was nothing wrong whatsoever. My heart was racing and my feet felt like anvils.</p>\n\n<p>Marlboro Man wasn&#39;t buying it. </p>\n\n<p>He folded his paper neatly down the middle as the bus pulled away, and tossed his cigarette to the street before stomping it out softly. Then he started to walk towards me. He moved slowly and methodically like a robot, and his arms swayed back and forth in that ridiculous jean jacket.</p>\n\n<p>I started the engine. Marlboro Man was picking up the pace, and he crossed the street into the parking lot in a brisk stroll. I backed out of my spot like I never saw him at all, then straightened out and accelerated after exiting the lot.</p>\n\n<p>When I drove past the Marlboro Man, he broke into a jog. </p>\n\n<p>Then, a sprint. </p>\n\n<p>I had to put the gas pedal to the floor just to put in enough distance that he would not see my turns. As I pulled onto the highway, it was no use. A mile behind me in my rear-view, moving faster than I had ever seen a man run before, was the Marlboro Man. </p>\n\n<hr/>\n\n<p>I think I lost him. </p>\n\n<p>After getting home, I fell through the door and confessed every word to my wife. She didn&#39;t believe any of it.  Go figure, my boss didn&#39;t believe it either. I had to take a sick day and, probably, a drug test. It&#39;s busy season. For that reason, I will be working this holiday weekend.</p>\n\n<p>So tomorrow morning, bright and early, at four-thirty in the morning...</p>\n\n<p>I <strong>have</strong> to go back to the bus stop. </p>\n</div>\n","author":"iAmMatt1"}