{"rank":"13","title":"What I saw","id":"8m7h8i","url":"/r/nosleep/comments/8m7h8i/what_i_saw/","time":"1527305511000","body":"<div class=\"md\"><p>&quot;Hey, Red! Lawn&#39;s looking better!&quot; My neighbor from down the street, Tucker Castor waved and greeted me from the sidewalk as he strolled by. In recent years he had taken to walking from his own home at the end of the street, to the corner where I live, and back. I assumed at first that it was an excuse to check up on me, but lately his wife was joining him too.  My home is a nice house in a quiet neighborhood, at the mouth of a short cul de sac. My name is Red Weischman, I&#39;m 63 years old, I&#39;m retired and my wife passed away 2 years ago. I live alone with my dog and cat, named Rocky and Smithers respectively. </p>\n\n<p>Things had been very difficult in the wake of my wife&#39;s passing. Not that it made any complications for me or that she wasnt ready; she was sick for too long. It just made getting out of bed that much harder. Tucker and I had been casual friends for about 25 years at the time and being as he was my neighbor, he&#39;d occasionally come knocking, and with a beaming smile greet me when I opened the door. It was obvious he was making sure I&#39;d been all right but I didnt mind. We&#39;d shoot the shit about what not and he&#39;d say &quot;Welp, oughtta finish my walk and get back. Take care yourself.&quot; I&#39;d never say it to his face but it was very meaningful. Lately, since I&#39;d started to function normally again, he&#39;d walk with his wife, Mavis, and just wave from the sidewalk. </p>\n\n<p>One day as I was watering the yard, I glanced down the street hoping to see the two of them. I didn&#39;t see Mavis but I sure saw Tucker. He was just leaving his yard. Left the front door open. And I tell ya he looked like a different man. His shirttail was untucked, hair unkempt and I swear I could smell the whiskey from the corner. I was almost put off from saying hi to him. But as he shuffled his way down the sidewalk I knew he was too damn drunk to be seen on the street so I approached him.</p>\n\n<p>&quot;Y&#39;all right there Tucker? Look a little worse for wear buddy..&quot; At first it seemed like he wasn&#39;t gonna reply. And when he did, he didnt stop to do so, just kept his eyes forward. &quot;Mavis is dead. Had a stroke at 4 this morn.&quot; I was dumbstruck. I didn&#39;t say nothing, just watched him wander down to the stop sign, turn around and head home. </p>\n\n<p>I suppose some time after that, his nephew moved in to look after him, cause when I went by to check on him a bright faced fella opened the door to greet me with a familiar beaming smile. He said &quot;hiya! You must be Red! I&#39;m Tucker&#39;s nephew Donavan.&quot; I said &quot;yeah, thats me. Pleasure to meet you young man. I just come down here to make sure Tucker&#39;s been all right.&quot; Donavan practically cut off my sentence with &quot;sorry but now&#39;s not such a good time.&quot; He didnt wait for me to agree, just shut the door like he was punctuating the sentence. I made my way back home. </p>\n\n<p>I didnt see Tucker make his walk for a few months after that, and when I did Donavan was with him. Only, Tucker didn&#39;t wave anymore. He didn&#39;t greet me. He seemed to be talking to Donavan in a hushed tone, but as they got closer it became clear he was talking to himself. Donavan was holding him by the arm, and actually making shushing sounds. I was too afraid to say hello. As they passed, I caught a bit of what Tucker was saying. In a reasoning tone, &quot;I don&#39;t wanna do that. You cant make me do that. You just want me alone. I dont like to be alone with you anymore.&quot; Donavan just shushed him some more and looked at me crossways. I tried my best not to think on it too much. I stopped watering my grass in the evening. </p>\n\n<p>Just this past Saturday, I was woken up by a blaring siren. The clock glowed 4:00 A.M. on the dot. I stumbled to the window, scraping the crust out of my eyes, and parted the blinds. A police cruiser darted around the corner and down the street. Naturally I went out the front door and into the yard to see what&#39;s happening. \n  The cruiser had stopped just up the street from Tucker&#39;s house, and i could see Tucker on the ground in the front yard. He was kneeling on one knee and screaming his heart out, a panicked, pleading sound. There was a lot of screaming. His hands looked busy, prying at something wet and lumpy on the ground. When I got close enough to make out what I was seeing, I was dizzy and threw up. </p>\n\n<p>The wet lumpy thing was Donavan. He was also screaming. Tucker had both hands on the handle of a hunting knife that was stuck in Donavan&#39;s neck, right above the collarbone. Blood spurted out onto both of them as Tucker freed the blade and carried on mangling his nephew. Donavan&#39;s hands waved in the air, trying hopelessly to block the knife. &quot;Please uncle Tucker! stop...&quot; Gurgling blood slurred his speech. Tucker bellowed. &quot;HEEEEELLLLLP! I CAN&#39;T STOP!! IT&#39;S HER ITS HER GOD HELP ME!&quot; It was then that I realized Tucker was being shot. In the chaos I hadn&#39;t noticed but the officer had already fired off three rounds and was eagerly emptying the clip. Tucker didn&#39;t stop. The last bullet burrowed through his left temple and he stopped screaming. His head bobbled lifelessly on his shoulders, eyes rolled up. But his hands continued to work on Donavan, who had stopped screaming and started quietly rasping with a sputtering, dragging hopelessness. Tucker left him laying there, stood up and lunged at the cop silently, his head limply bobbling behind him. The cop emptied his clip again, into Tucker&#39;s chest and head and neck, which knocked Tucker to the ground. He lay there, twitching and jerking. His arms were drawn to his chest and his body seized. It was then that I was pushed back into my yard by the backup that had arrived. I stumbled, horrified stiff, up my walk.</p>\n\n<p>The police never came to my door to question me about what i saw. I&#39;m pretty sure they have more questions than I could possibly answer. It wasn&#39;t on the news, and none of my other neighbors will even look at one another. We&#39;re all too afraid to know what made Tucker do that.</p>\n</div>\n","author":"Ratfly_325"}