{"rank":"13","title":"An App Called Autopilot (Part 3)","id":"8m7iuh","url":"/r/nosleep/comments/8m7iuh/an_app_called_autopilot_part_3/","time":"1527306032000","body":"<div class=\"md\"><p><a href=\"https://www.reddit.com/r/nosleep/comments/8ktxdr/an_app_called_autopilot_part_1/\">Part 1</a></p>\n\n<p><a href=\"https://www.reddit.com/r/nosleep/comments/8ldi40/an_app_called_autopilot_part_2/\">Part 2</a></p>\n\n<p>Hey guys, it’s been a couple more days now and I’ve had some troubling developments.</p>\n\n<p>So first off with the whole Ben thing. False alarm on that one. Turns out he was on a business trip down in Florida for a couple days. I called him the next day after waking up, and thankfully he demonstrated to be alive and well. I still don’t know where all that blood came from but I guess maybe I just had a nosebleed or got in a fight with someone. Well, at first that’s what I thought, but now I realize how ridiculous that is.</p>\n\n<p>I was a bit on edge the next day and decided to take a break from Autopilot for a little bit. When I got to work, my coworker; Anton came up and greeted me.</p>\n\n<p>“What up Gary?” He asked with a goofy smile as we grabbed our scan guns. I thought for a moment he was talking to someone else, but no one else was in the room.</p>\n\n<p>“Gary?” I asked confused. Anton laughed and nodded.</p>\n\n<p>“Yeah that’s what you said to call you now…” He replied. What the hell? For the record my name is NOT Gary, it’s Zach, and I’ve never gone by Gary or anything similar to that. It’s not a nickname or inside joke that I’m aware of, and I have no idea where Anton got that idea from. I’ve never even known anyone named Gary aside from my old hockey coach and of course the legendary snail from SpongeBob himself. </p>\n\n<p>“Oh yeah I forgot, I was planning on faking my own death to get rid of my school debt. You think I could pull off a Gary?” I didn’t want to make things awkward, so I decided to just play along. Anton paused for a moment, crossing his arms and scrunching his mouth in thought.</p>\n\n<p>“Nah, you look more like a Eugene, or maybe a Thaddeus.” I chuckled and nodded.</p>\n\n<p>“I’ll keep that in mind.” Anton and I continued to shoot the shit for a couple minutes, until our lead called everyone in for the usual pre-shift meeting and stretching. Our lead Tony began to inform us of the order count and address a few basic issues. At the end of his little speech, he turned to me and grinned.</p>\n\n<p>“Got anything to add Gary?” I guess I’m the only one who wasn’t in on the joke. I shrugged and thought for a moment.</p>\n\n<p>“Don’t die.” I respond. Tony chuckles and several others do as well. With that he dismissed everyone, and we began the day. </p>\n\n<p>I take to my pallet jack and begin scouring the aisles for the items specified on my order. Within twenty minutes I am already regretting not using Autopilot. The loathsome thoughts seemed to descend upon me like a hive of enraged hornets. It seemed even worse than usual. I don’t know why my mind is so prone to its own detriment, and I know it only makes things worse for me, but I can’t help it.</p>\n\n<p>First break arrives two hours later, and I take the opportunity to once again utilize the app. I was a bit hesitant to do so, but not as hesitant as I was to willfully finish the shift hypnosis free. I did a two-hour period, and everything seemed fine, so I repeated the same action until the end of the day. Nothing else happened, at least that I remember.</p>\n\n<p>When I returned home afterwards, I suddenly had an idea. Some of you guys have actually suggested it as well, but at first I didn’t have the means to accomplish it. I have an old GoPro camera in my closet that I got for Christmas a couple years back. Don’t think I ever even used it before. I thought maybe I could hide the device in my shirt and use it to record my antics while under the influence of the app.</p>\n\n<p>I took an old black hoodie from my closet and managed to place the camera into the chest pocket and cut a small hole. I used a craftsman’s technique of duct tape, yarn and profuse swear words to rig the whole thing together. I then cut a small hole into the jacket for the lens, and blended the whole thing so it didn’t look too obvious. I’m actually pretty satisfied with how it turned out.</p>\n\n<p>The next day I brought my ghetto-rigged hoodie and GoPro and used the autopilot app to achieve the desired state of mind. I set the alarm to 10 hours and let the app work it’s magic.</p>\n\n<p>When I awoke I found myself with a case of Cheetos in my hands, standing beside two large pallets on my jack. I took a quick look around and checked my phone. It was just after 2am by that, point. I ensured the camera was still snug in my pocket, but after checking on it I found the battery to be dead. I thought about running the autopilot again but decided to just finish the end of my order.</p>\n\n<p>I approached Steven in the main office after finishing my order and asked him how many cases were left to pick. He told me there was only about 2,000 to go, so I decided I would just finish the shift hypnosis free. He gave me another order, and also a glance which I interpreted as almost hateful. It was weird and kind of unnerving, but Steven can be a grumpy gremlin sometimes, so I shrugged it off.</p>\n\n<p>After finishing my shift, I returned home and plugged the camera in to replay the night. I watched it for several minutes, stopping at random intervals when I interacted with another coworker. All in all it seemed pretty normal, and my hypnotized self seemed to stay mostly true to it’s source material. Even the interactions and jokes I made with my fellow coworkers were ones which I could easily see myself making. They were a bit darker though, no doubt about that.</p>\n\n<p>At one point I was talking with Jamal; a forklift operator. He and I joked, and I told him I needed 250 Mike and Ike cases. </p>\n\n<p>“Damn that’s enough sugar to give a thousand orphans diabetes…” I commented. Jamal let out a raspy chuckle and shook his head.</p>\n\n<p>“That’s fucked up man…” He replied with another laugh. I’ve always loved dark humor, but… It’s weird I don’t know. I could see myself making a joke like that I guess, but I don’t know if I would ever think of it. I know this point may seem insignificant, but why it interests me so much is because I’m curious whether my personality remains intact during the autopilot states. All along I’ve sort of just pictured myself as something like a robot during the hypnosis, but apparently that’s not the case. The ability to see myself first person in retrospect with no memory of the actions I performed is just an incredibly strange feeling. </p>\n\n<p>At one point in the video I watched as the camera replayed me entering the bathroom. I proceeded to have a tinkle and then approached the mirror. That was when I got my first look at myself. I appeared normal, albeit with slightly dilated pupils.</p>\n\n<p>After I had washed my hands, I paused. My eyes slowly lifted and fell on the mirror, staring directly at the focal point of the camera with a blank expression. It was the very same mirror which had been previously vandalized a couple nights earlier and subsequently replaced. I just stood there, unwavering for almost a full minute. Finally, my hypnotized self spoke something in a hushed whisper and my lips parted into a knowing grin. I then lifted an arm and turned off the camera.</p>\n\n<p>It was kind of unnerving to see that. I had assumed the camera had run out of battery, but that was not the case. Why would my autopiloted self willingly turn the camera off?</p>\n\n<p>I replayed the phrase I had spoken into the camera several times, but found it impossible to decipher. I had the volume on the computer at full blast and yet it still was too quiet to hear. GoPro’s unfortunately, don’t have the best audio. </p>\n\n<p>I tried reading my lips. One word, three syllables. I spent some time playing charades with my former self, but couldn’t seem to find an answer I was confident with.</p>\n\n<p>After trying and failing to figure out the phrase for some time, I decided to step outside for a smoke and clear my head a bit. I ventured out to my car and grabbed my cigarettes, while there however, I noticed something. Someone had keyed my fucking car.</p>\n\n<p>Just below the trunk someone had scraped off the paint into a single word.</p>\n\n<p>“Effugium.” Yet another Latin word I would later learn translates to escape or avoid capture. The handwriting appeared to be the same or at least similar to the mysterious vandal who had sabotaged the mirror at work. </p>\n\n<p>I thought for a second the words were the same that I had whispered on the video, but the lip movements didn’t seem to line up with one another. Plus, if that were the case, that would likely mean that I had vandalized my own car. It didn’t make any sense, but the amount of incidents thus far are now too great to chalk up to simple coincidence. </p>\n\n<p>I thought again about Clint; the emo/goth guy at work who some of my coworker’s suspect was responsible for the bathroom mirror graffiti. Could he be up to something? Maybe he hates me and this is his way of lashing out. I honestly don’t know why he would hate me, we’ve never had a problem with each other, at least that I remember. In fact, I’ve only ever said a couple words to the guy. Still, I guess people have hated others for less so it’s possible.</p>\n\n<p>The next day arrived, and the irritation I felt lingered like bricks on my mind. Not like my car is exactly a chariot of excellence but it is <em>my</em> car. I suspended the use of the app to have a word with my supervisor before the day began.</p>\n\n<p>Once inside I almost immediately locked eyes with Clint. He stared back at me, hateful and with eyes threatening rebellion. I returned his gaze with a confused one of my own. Maybe he does hate me after all.</p>\n\n<p>Almost all my coworkers have now taken to referring to me as Gary, and I’ve grown tired of correcting them, so I guess the name will stick. I walk into the office and find my manager Chris sitting at the computer attempting to appear busy. He glances to me as I walk in, but before I can say anything he begins to speak.</p>\n\n<p>“Hey Gary, can I talk to you for a second?” He asks, straight faced with no hint of irony in his voice. I cringe at hearing that name once again but agree and follow him next door into his office.</p>\n\n<p>“What’s going on?” I ask as we both take a seat at his desk. Chris sighs and folds his arms while reclining in his seat.</p>\n\n<p>“So I talked to Clint earlier on…” He starts. My heart begins pumping wildly at the mention. Chris takes a deep breath and adjusts his glasses.</p>\n\n<p>“Look man I get it. Things are chaotic and stressful right now, but that doesn’t excuse what you did…” My heart slumps in my chest, as I desperately rack my brain in a futile attempt to remember anything. I had only a split second to decide how to react, so I settled on feigning innocence. After all, I have no idea what he’s talking about.</p>\n\n<p>“What do you mean?” I ask, brow furrowing.</p>\n\n<p>“Clint told me what you said about his mom…” I almost chuckled upon hearing that until Chris continued.</p>\n\n<p>“You do realize his mom is dead right? That was kind of messed up for you to say.” I wish he would’ve just told me what I said, but I got no such luck. I didn’t even know how to respond so I just stayed quiet and nodded. Chris eyed me intensely for a moment before sitting back and surveying the area.</p>\n\n<p>“And hey look, I know how it is man. Guys talk shit back and forth all day long. I mean hell, I do it all the time. But some people just aren’t comfortable with that stuff.” I nodded again and finally spoke up.</p>\n\n<p>“Yeah, I know that’s my bad. I shouldn’t have said that to him. I didn’t mean anything by it, but I didn’t know that about his mom.” Chris stayed quiet for a second pondering something.</p>\n\n<p>“Yeah so I mean, I’ve talked to Clint and he is upset but doesn’t want to make a big deal out of it. I don’t want to get HR involved or any of that bullshit, so maybe just stay away from him for a while. Can you just promise me you won’t try and aggravate him anymore?” I think for a moment, wondering whether to plead my innocence.</p>\n\n<p>“Yeah no worries man.” I end up saying. We both get up to leave when I remember my car.</p>\n\n<p>“But hey Chris… I don’t know if this was Clint that did this or someone else but, someone keyed my car last night.” Chris’ eyes grow wide.</p>\n\n<p>“Are you serious?” I nod. Chris groans and shakes his head.</p>\n\n<p>“Ok… shit I’ll take a look at it and maybe talk to Clint. Dammit sorry man we’ll figure this out though okay?” I nod, somewhat content and both of us leave to attend the pre-shift meeting.</p>\n\n<p>I began work hypnosis free, and soon find the dark thoughts creeping back into my mind. It’s almost like my mindset has gotten worse when not under the influence of the app. I considered going home sick, but then why bother doing that when I could just use the app once again? So that’s what I did. Pissed off and knowing all too well of the long night ahead, I set the app for 16 hours and put myself under.</p>\n\n<p>When I finally regained consciousness, I was met with a burning sensation. A towering fire raged in front of me with the wind blowing sparks and cinders around and creating a cascade of lights. The pyre was stacked with pallets and other random wooden materials. The flames must’ve been pushing at least five feet high. The fire smelled putrid and smoked relentlessly as if something wet had been set ablaze. Below me I felt my feet digging into the soft patches of sand. The gorge, down by the river, what the hell was I doing there?</p>\n\n<p>I looked around but saw nothing and no one aside from my car parked several dozen yards away. I stared back into the burning pile as a pit began to form in my stomach. In the midst of the crimson dance, something caught my eye. It was a small circular symbol, one which I recognized immediately. It was a Carhartt logo, embroidered onto my jacket. </p>\n\n<p>Why in the name of fuck would I burn my own jacket? It was in almost brand new condition, and those jackets aren’t exactly cheap. Why would my unconscious self do that? Was that the whole reason I was out there?</p>\n\n<p>All questions I have no way of answering. A glance at my phone revealed it to be almost 5AM. I quickly doused the fire using the sand and a couple water bottles from my car. Wasn’t easy though, that damn thing was burning red-hot.</p>\n\n<p>I got out of there soon after, burned out in the metaphoric and literal sense. My mind spiraled into oblivion during the drive home, and by the time I stepped inside the sun had begun peaking over the horizon. I wanted so desperately to collapse into bed, but I couldn’t. I had to recount the memories while they were still fresh.</p>\n\n<p>I was hoping all of this was sheer coincidence somehow, but I now know that’s not possible. When I got back to my apartment, and with the now bright atmosphere, I noticed one final thing which had been previously hidden by the dark.</p>\n\n<p>“Imperium.” The single word was scrawled on the hood of my car in that same familiar calligraphy. This time though, the medium was not black sharpie or scraped away paint. It was blood. I quickly washed it off with some water bottles in my car and scrambled inside, mind racing and heart pounding in my chest.</p>\n\n<p>I had a vague idea what that word meant but googled it just to make sure. It translates directly to government, which had me confused. But then I thought of the secondary meaning behind that word. It could also convey something more akin to dominate, or rule over. No matter what the interpretation of the word though, the implications cannot be good.</p>\n</div>\n","author":"zachariusfrost"}