{"rank":"11","title":"I Don't Know What's Happening...","id":"8m7jkj","url":"/r/nosleep/comments/8m7jkj/i_dont_know_whats_happening/","time":"1527306261000","body":"<div class=\"md\"><p>   I actually have no idea what&#39;s going on right now. All I know is that I need to document this, and if you&#39;re hearing this, I need you to help me.</p>\n\n<p>   I woke up around noon today, from what I believe. The sun was pouring light though my window, I heard the bustling and talking that meant my grandparents and mother were up. I rubbed my eyes, rolled over to check my phone for the time, twelve thirty seven. Of course I had some texts, missed calls, and some other notifications. I called up the people who I had missed calls from, it was the weekend so I figured the calls were people seeing if I wanted to hang out. However, not one person picked up the phone. Whatever, I&#39;d play video games or whatever till&#39; somebody called me back. I checked my texts, a few texts from the people who called me, asking if I wanted to hang out or play games. I&#39;d missed the messages by an hour to two hours, normal for me over the summer, I tend to stay up late and sleep in even later. I set my phone back down on my bed, stood up, opened my door and stepped foot into the hallway.</p>\n\n<p>   When I set foot in the kitchen, not too far from my bedroom, we live in a one floor house, I became acutely aware of the lack of noise, when just a second ago I swore I heard people up and moving about. I checked the living room, the TV was on, but my grandfather wasn&#39;t seated in his normal recliner, my grandmother wasn&#39;t on the couch. I disregarded it, they must be outside smoking or something. I&#39;d check on them later, I walked through the kitchen to the stairs leading to the basement, my mother and her boyfriend had a room downstairs, so I went to see if they were up. Walking across the basement to where the room was, I peeked inside. Nobody. Once again the TV was on, but nobody was there. I checked the patio underneath our porch where my mom and her boyfriend normally smoked, they weren&#39;t there. I thought that was a bit odd, they normally paused their TV if they weren&#39;t in their room. Nothing seemed off until I checked the garage. Once again, nobody was there, my grandma&#39;s car wasn&#39;t even there. I checked the driveway, neither my mom&#39;s car nor her boyfriend&#39;s truck were there. That was the first sign I got that something was off, very off. Normally my mother texted me or left me a note when she left, and she wouldn&#39;t just leave her TV on, neither would my grandparents for that matter. I stepped back inside, a bit perturbed now. I walked back to my room, snatching my phone off my bed, I texted my mom. A simple &quot;Hey, where are you?&quot; would suffice.</p>\n\n<p>   I turned off both TVs, the electricity bill wouldn&#39;t do any better if they were left on. I played video games for a few hours, made lunch, and generally just waited around. Nobody ever responded to my texts, my friends never called me back, my mother never responded to my text. I just thought today was a slow day, and that my mom&#39;s phone was dead, until I realized something was definitely off. Walking to the kitchen to grab a snack, I looked out one of the windows in the living room, it was around seven now, when the TV in the living room switched back on, by itself. I stopped looking out the window when I saw the TV flicker back to life in my peripheral vision. I pivoted on my heels, staring in disbelief at the TV, who or <em>what</em> turned that TV on? Once again, I grabbed the remote, and turned off the TV. Within seconds it was back to life, almost defiantly.</p>\n\n<p>   Once again, I turned the TV off, and it was back on within seconds again. Off and on, it felt I was battling with this sentient electronic. I gave up after a minute or two, and just unplugged the TV. The screen finally flickered out for good. I figured the same had happened with my mom&#39;s TV downstairs, so I just left it be and went back to my room, making sure to close the door behind me. I checked my phone again, no texts, no calls, nothing. I was starting to get this feeling, unlike anything I&#39;d felt before, like something was watching me. I&#39;d read stories of people feeling like they were being watched, it always sounded so stupid to me, like it was just a trope to add foreshadowing for the monster to show up. But I knew with unsettling certainty that this was the feeling that I&#39;d heard about. My doubt submerged my feeling as I frantically tried to rationalize my predicament. All of a sudden, everyone in my house aside from me were just gone, their cars too, the TVs were left on. The only plausible explanation was that everyone either up and left, or they were abducted. I hadn&#39;t even noticed I was crying until the tears had fallen onto my hands, I was thinking so much I had become almost numb. I could feel my breath quickening, I was on the verge of a panic attack when it happened.</p>\n\n<p>   I loud crash came from just outside my door. I jumped up, head snapping to the door. The door creaked ever so slowly open, and I heard a voice. The voice was my mother&#39;s, she called my name, asking if I was okay. I ran to the door, crying uncontrollably now, all I wanted was to be free from this nightmare. I threw open the door and went to embrace my mother, but all I embraced was the darkness. My house was completely dark now, the lights I could&#39;ve sworn I&#39;d turned on were all dead, they almost seemed to be generating darkness. I fell to my knees, and started to sob. The moment I looked up, I noticed something dark slip right past me into my room. I stood up, my entire body convulsing with sobs, I turned around, and stumbled back into my bedroom. I slammed the door shut, all I wanted was to be rid of this hell. I flipped my light off, and I stumbled though the dark, I finally felt the wood of my bed frame and collapsed onto my bed. I couldn&#39;t feel my hands, arms, or legs at all as the panic attack gripped me. I could actively feel the numbness consume more of my body, when I made the mistake to pick my head up off my pillow and gaze around my room.</p>\n\n<p>   In my closet were a pair of white, blinding eyes staring right back at me. I froze in pure fear, that numbness spread throughout my entire body, from the tips of my fingers to my very core. A new feeling fought to emerge from the sea of panic and fear within me. A feeling of action, a voice pierced the darkness that clouded my mind, and it told me to run. I needed to run as far as I could, run till my legs stopped working, so I did. I ran, ran as fast as I could, I threw my bedroom door open with a loud thud, I ran down the hallway, turned into my kitchen. I could hear footsteps behind me as I threw the door open, followed by the storm door. The cool midnight air brushed against my skin, feeling extra cool against the tears that flooded my face. I ran into the night, into the driveway, onto the road, I turned to run down the road, leading down a hill and further away from this nightmare. Before I could act, the headlights of a car were upon me, blinding me with almost supernatural luminosity. I felt no pain, I heard no noise, all I did was see the light before everything went black.</p>\n\n<p>   I wasn&#39;t expecting to wake up, but I did. I woke to my bedroom, light filtering through the blinds of the one window I had. I heard noises outside my door, people talking and moving about, I was almost afraid to check my phone. Twelve thirty seven. I sat up straight, listening for anything that may seem out of the ordinary. I got out of bed, set my phone down, and rushed out to my living room. Nobody, the TV was still on however. I didn&#39;t think it strange before, but the TV wasn&#39;t even making any noise. It just sat there, broadcasting sports. I immediately rushed to my computer, switched it on, and starting writing my experience down. I need to get this out to everyone, I don&#39;t know how, but I will. I need help, I don&#39;t know what&#39;s happening but I&#39;ll try to update this if possible. I don&#39;t know if things are going to play out the exact same, all I can do is hope. Thank you for reading this.</p>\n</div>\n","author":"Lord_Chemm"}