{"rank":"110","title":"Creepy Backroad Experience","id":"8m7jz6","url":"/r/nosleep/comments/8m7jz6/creepy_backroad_experience/","time":"1527306384000","body":"<div class=\"md\"><p>So something really weird happened to me about a week ago, and I wanted to share this to see if anyone has ever experienced anything like this. (And also because I really can&#39;t get it out of my head and I feel like sharing it will somehow help.) I&#39;m not on any medications, nor do I have any history of hallucinations or really anything of that sort. I&#39;m also not a spiritual person, not religious, which probably really doesn&#39;t matter so I&#39;ll stop rambling now. </p>\n\n<p>Okay so here we go. I live in the south in a small city with my fiancé. We had gotten into a bit of a fight, so I&#39;d immediately just decided to jump in my car and leave to go to my parents&#39; house, which is about an hour away.</p>\n\n<p>Well there are two different ways to get to my parents&#39; from our home. One route is a newly built highway, and the other is nothing but curvy backroads. I decided to take the curvy-backroad-way instead, partly because my fiancé never lets us take that route when we go to visit my parents. (He prefers the highway because it&#39;s faster, safer, and actually has cell-service.) </p>\n\n<p>These backroads truly feel like a scene from a movie. They&#39;re gorgeous and secluded, with those trees that arch over one another where you can hardly see the sky. Just picture the most beautiful country backroads that you can, and that&#39;s what these are. So despite knowing I would lose cell-service and the radio for about 20 minutes through taking this way, I decided the scenery was worth it. It was a bright cloudless day, and all the negative feelings I had had before leaving seemed to just disappear as I enjoyed my drive. </p>\n\n<p>Well anyways, when I was about 30-35 minutes from the house I glanced down at my phone as it sat face-up on my lap, checking to see if I had gotten service again. I still hadn&#39;t yet, so I looked right back up and psychically jerked with shock at what I saw in my rear-view mirror. A car was suddenly tailing me, appearing just inches from my bumper. </p>\n\n<p>And it wasn&#39;t just any car. It was my fiancé&#39;s. </p>\n\n<p>Now, I&#39;ve driven on this road dozens of times without ever once encountering another vehicle; so since there hadn&#39;t been a single car behind me for the entire drive yet, I thought &quot;Wow, he really came out of nowhere.&quot; I knew that the driver, who was my fiancé, had to have been flying, because when I pulled away in my car he had been lying down on the couch. </p>\n\n<p>So anyways, my fiancé drives a uniquely-colored vehicle with no tinted windows and paint scraped off of the hood. It&#39;s not a popular make by any means, and it has our hometown (which is not the same as the city we currently live in) on his front plate. I had also noticed that morning that he had been wearing the mint-colored shirt that I&#39;d given him for his birthday.</p>\n\n<p>I stared into the mirror again and again to make absolutely sure it was my fiancé. Meanwhile I gradually got this weird feeling in my stomach, almost like a really mild sensation of dread. All I could think was that it had to be an emergency for him to have been driving so fast and close behind me to get my attention like that, and it kind of shocked me that he&#39;d known which route I had taken. See, I hadn&#39;t even told him I was heading for my parents&#39; house. If anything I would have figured he&#39;d assumed that I was heading to one of the typical places that I go when I&#39;m upset; which is definitely never to my parents.</p>\n\n<p>I kept trying to tell myself that it had to just be a similar car but sure enough; there was the unique paint job, scraped off paint on the hood, our hometown plate, and him in the driver seat, clearly glaring dead at me in his mint-green shirt. </p>\n\n<p>And I&#39;m telling you, the look he had on his face was absolutely horrifying. </p>\n\n<p>I kept on going for a couple minutes, almost locked in a total stare with him until I could find a long driveway to pull up into. I&#39;ve never been anything close to afraid of my fiancé, so to see him driving that aggressively and looking so furious made me extremely reluctant to pull over. But of course I still did so anyway, in some random person&#39;s driveway, to give him enough room to pull in behind me. As he slowed down I could feel my heart beating faster, confused by what I could have done to make him that angry. He had been completely fine (besides being slightly annoyed after our argument) when I left the house; it just really didn&#39;t make any sense. Gradually he began to slow down more and more until he reached a near stop, rolling his window down to turn his head and glare at me once again. Then he promptly laid on his horn, and passed me by completely and continued on down the road. Never once did he look away from me, and never once did he let off of the horn as he drove by. </p>\n\n<p>It still plays over and over in my head, my fiancé passing by me in his car, with an angry glare on his face, holding the horn down for almost 10 whole seconds. I don&#39;t even like picturing it in my head now as I write this, late at night in bed. It just... it just gave me this weird feeling that still hasn&#39;t really gone away. </p>\n\n<p>Anyways, I immediately wondered why he hadn&#39;t just pulled in behind me; so I quickly peeled back out to follow where he was going. As I did this I glanced down to see that I had finally gotten a couple bars again, so I called him and as soon as he answered I asked what on earth he was doing. It was then that I turned the next curve, only to see that his car was nowhere in sight. The road, which had opened up into a long and straight stretch with no more driveways to turn into, was completely empty. </p>\n\n<p>&quot;Nothing,&quot; he replied, and I could hear the sound of our television playing in the background, &quot;I&#39;m just sitting in the living room.&quot; </p>\n\n<p>I told him I didn&#39;t believe him, told him to FaceTime me to prove it and surely enough there he was still in our living room. He even showed me that his car was parked right outside of our apartment. </p>\n\n<p>Now this is when I really started to feel afraid. That feeling of dread became so much stronger, and I immediately started crying. It was just very strange. I felt like I couldn&#39;t get off of those roads fast enough, especially when I passed through another area without any cell-service. Needless to say, as I drove home I opted to take the highway instead. </p>\n\n<p>I&#39;ve tried to calm myself down and rationalize that this was probably someone of the same build with the same car from our hometown. A strange coincidence, but a coincidence nonetheless. But then there&#39;s this other part of me, that tells myself that I have seen my fiancé and his car and that shirt enough times to know that it was him; especially from the way they slowed down and pressed their horn for so long as they passed. Why would a stranger do that? I hadn&#39;t been driving slowly, and the way they looked at me felt like they were trying to send me a message. A creepy, angry, weird message that made the hair on my arms stand on end. </p>\n\n<p>Anyways, the feeling I got from all of this was definitely not a good one. It feels like I saw something I wasn&#39;t supposed to see, and not simply a typical person who looked just like my fiancé. I have this eerie feeling that I&#39;m going to see my fiancé again, and that it isn&#39;t truly going to be him. </p>\n</div>\n","author":"booferal"}