{"rank":"85","title":"Therapy","id":"8m7n4i","url":"/r/nosleep/comments/8m7n4i/therapy/","time":"1527307385000","body":"<div class=\"md\"><p>I don’t want to remember her name or the details she gave me. They are fucking horrible. I don’t want to think about the far away look in her eyes as tears rolled over her sharp cheekbones and fell silently into her lap. But I do. I’ve been treating her twice a week for the last 6 months. At first I was just doing my job. Trying to connect the dots and apply a proper diagnosis and treatment plan. Now everything has changed. I thought she was making progress. I thought <em>we</em> were making progress. Right up until the day she killed herself. </p>\n\n<p>There is no reason to get into a long winded description of what I do for a living or why I do it. It’s no secret that a lot of mental health professionals get into the field because they themselves have had issues. My childhood was rough and I was taken into foster care at age 5. The state provided psychological treatment and it worked, the end. My therapist was amazing and became a fast father figure to a lost and broken boy. The foster parents were great too. But it was Doctor Shane who inspired me to want to help others. Thanks to him the only scars I carry from my past are physical and come with no memories. We are still in close contact as I call on him for advice quite frequently. For a long time I was proud to be making a difference to other people who have struggled like me. Until I met her. </p>\n\n<p>She walked into my office at 10am on sunny Tuesday morning. Usually I have an introduction/getting to know you routine for first time meetings with my patients but she had her own version planned for me. I was barely able to introduce myself before she sat on the gray suede loveseat across from my chair and pulled a spiral bound notebook out of her bag. She opened the red cover, skimmed the page, and closed her eyes for a moment before looking up at me. Sensing her hesitation I simply nodded and smiled to let her know I was listening. \nShe did not return the smile.</p>\n\n<p>“I don’t want to put any pressure on you Doc, but I really can’t afford to do the whole ‘getting to know you’ thing. Like, in the very literal sense I can’t. No insurance.”</p>\n\n<p>“Okay” I said. “I understand if time is an issue.”</p>\n\n<p>“And money.” she added. “You’re not cheap. None of you are.” </p>\n\n<p>I wanted to make some kind of joke about being cheap in college to break the ice a little but I decided against it considering her businesslike approach so far. Usually the first session is very one sided and it seemed she would be doing most of the talking. I settled on agreeing that I am, in fact, expensive and she seemed satisfied enough with that to continue. </p>\n\n<p>“The first thing I need to address is my paranoia. I didn’t come here with my cell phone and I need to ask if yours is in this room.”</p>\n\n<p>I assured her that my personal cell phone never enters the room as a matter of ethics and to maintain quality of care in sessions. I also pointed out the lack of any other electronic device as she scanned the room carefully. After a few moments she nodded and went back to her notebook, scribbling something down and crossing something out before looking at me with tears welling up in her eyes.</p>\n\n<p>“I don’t know why I bother asking that.” she said sadly. “It just makes me look crazy.”</p>\n\n<p>I shook my head. “We can’t make any progress here if you are worried about looking crazy. You don’t think you’re the first person to ask me that kind of question do you?” </p>\n\n<p>She smiled a little. “I suppose I’m not.” </p>\n\n<p>“Just don’t ask me if you can do a body cavity search and we’ll get long fine. Unless of course you already brought your rubber gloves.” It was a stupid joke. But she smiled fully and relaxed enough to continue.</p>\n\n<p>“Can you help me convince myself that something I experienced wasn’t real?”</p>\n\n<p>I decided to quickly jot down “possible hallucinations” and “paranoia” under her name in my own notebook. I leaned forward a little and instinctively reached for the box of tissues sitting next to me. “Can you tell me what you experienced, Samantha?”</p>\n\n<p>She bit her lip and looked away. For a split second I thought she was going to get up and leave but hoped she was just checking out the framed degree I had mounted on the door. She shifted uncomfortably in the love seat and fiddled with the worn edges of her notebook. I could almost feel her trying build up the courage to speak and it was heartbreaking. Most patients go through this the first time. It’s unimaginably difficult to talk about traumatic events despite the desperate need to do so. I handed her the tissues and told her to take as much time as she needed. She took them and pulled out several squares, balling them up in both hands. </p>\n\n<p>“I...I saw something. Something awful. It’s ruined my life.” </p>\n\n<p>I waited a bit to respond as I could see her physically reacting to whatever trauma was replaying in her mind. Her lips and hands were trembling. She looked like she could be sick at any moment and had gone a shade too pale. I cursed myself for not remembering to put the trashcan next to the sofa as getting up to get it in that moment would risk losing any potential breakthrough. Her breathing became rhythmic and controlled. I decided to take a risk.</p>\n\n<p>“Samantha.” I said gently, pausing for effect. “No matter what you have been through I promise I can help you cope. You said you can’t afford to waste time, right? You can talk to me. You are safe here.”</p>\n\n<p>She laughed. </p>\n\n<p>It was not a happy laugh. It was not a sad laugh. It wasn’t malignant nor benign. It wasn’t sane or crazy. It was <em>exhausted</em>. It was the laugh of a woman resigned to her fate. Something in the way she was crying, smiling, laughing, and frowning seemingly all at once put me on a slight and unexpected edge. For the first time in my career I felt vulnerable. I’ve seen far more unsettling shit than a woman laughing in this office. My first patient had a full on PTSD flashback and regressed into childhood on that very couch. Another had convinced themselves that their face was made of ice cream and it was melting too fast and the ants would be there any minute to eat what was left of it. </p>\n\n<p>Yes, you read that correctly. I had to set the thermostat to 32 degrees to deescalate the situation while we waited for Behavioral Health to pick them up and get them stabilized at the hospital. In other words, my being creeped out by Samantha was completely unwarranted.  </p>\n\n<p>“Doc...” she finally choked out, aggressively wiping away tears with the crumpled tissue. “You don’t understand! What I experienced <strong>was real</strong>. I’m here so you can help me convince myself it <strong>wasn’t</strong>.” She was staring intensely at me now. </p>\n\n<p>“Ok, Samantha.” I said, meeting her gaze. “But I think we both know that I won’t be able to convince you of anything without knowing what happened.” </p>\n\n<p>She looked at the door then back at me and completely broke down into heaving, wracking sobs. After a few agonizing moments of this she suddenly stopped, got up, and calmly left. I checked my watch. There was still about thirty minutes of session remaining. I sighed and sat my notebook on the desk behind me. It wasn’t the first time a patient has walked out, but it was the first time I had to suppress the urge to run after one. Her request to be convinced that something allegedly real was actually not both fascinated and unnerved me. I wanted to know more and I wanted to accept the challenge, whatever that might bring. As hard as it was my only choice was to hope she decided to return on her own. Most people never did.</p>\n\n<p>When I saw her name on my itinerary two weeks later I practically ran into my office. My case notes for her were still in my desk and I wanted to be more prepared this time. It doesn’t paint me in the best of light on a professional level but getting through my first couple of appointments was rough. I was unfocused and almost giddy with nerves. I had spent the last fourteen days going over in my mind what I could have done differently. Did I push her too hard? Not enough? Was it the corny jokes? Why was this bugging me so much? I didn’t know. I just knew it felt unfinished. I really needed another chance and didn’t want to screw it up. I was <em>so sure</em> I could help her. I was so fucking sure.</p>\n\n<p>She walked in the door, closed it behind her and took a seat on the sofa. “I want to apologise, Doc.”  </p>\n\n<p>“That won’t be necessary Samantha.” I said with a wave of my hand. “It’s good to see you again.”</p>\n\n<p>“I, uh, didn’t get a bill for last time.” </p>\n\n<p>I smiled. “And you won’t. It wasn’t a full session.”</p>\n\n<p>“Thanks, Doc.” We smiled at each other for a moment in mutual gratitude. </p>\n\n<p>And then it all went to shit. </p>\n\n<p>At first, she was merely glancing at the door while we talked. Pretending to not notice, I kept right on talking. Just chit chat. Nothing heavy. No reason for her to be thinking of running out again. She was responding appropriately but clearly getting more...agitated. Desperate to gain common ground and keep her there I started rattling on about myself and why I got into mental health care. How my own therapy made the difference in my life. It was having no impact. She had become transfixed on the door. Looking back I can’t believe how stupid I had been to not have seen what was happening sooner. Still, it wouldn’t have made what she told me any easier to hear.</p>\n\n<p>“Doc?” Her voice was a strangled whisper. A pleading cry. “I can’t see this again.” </p>\n\n<p>With the realization dawning on me I slowly looked over to the door. “Samantha… are you hallucinating right now?” </p>\n\n<p>She started shaking so hard I could actually hear her clothes vibrating and scraping against the suede upholstery. Fat, glittery tears began soaking her shirt and her face kept contorting from horrified to sad to angry and back again like some deranged version of emotions roulette. Like I said, I have seen psychotic breaks before so for me to freeze up in that moment was completely unexpected. I realized I still needed to guide her through what was happening and quickly scrambled to regain my composure. She spoke before I had the chance.</p>\n\n<p>“I thought I was hallucinating for a really long time” Her voice was monotone and robotic. “But after a few months I realized I was seeing the same things over and over again. Like snippets of a horror film I’m being forced to watch.” </p>\n\n<p>She spent the rest of that session describing to me what she had been seeing in full detail. Snot ran over her trembling lips as she explained it wasn’t the door she was looking at. It was the frame mounted to it. Specifically, the glass in the frame. She began telling me she saw “movies” in reflective surfaces like glass, plastic, metals, and even highly polished wood. She said it looks almost like they were being intentionally projected onto these surfaces. She didn’t see them all the time but when she did, it lasted for days. Sleep deprived and horrified her mind would grind away and rebel against itself in a desperate bid to rationalize the situation. This only proved to further the delusion from visual (seeing things) to auditory (hearing voices or sounds) and tactile (feeling) hallucinations. </p>\n\n<p><em>Have you ever seen something completely impossible, Doc? Until you have you can’t begin to imagine what it does to your psyche.</em></p>\n\n<p>She had been up late reading and decided to finally turn in for the night when she heard a small noise outside her home. Living alone with no family and having no means of protection she decided to take a look out of the bedroom window for any signs of danger. Seeing nothing down the empty street or near the house she went to close the curtains when she noticed vague movement in the reflection of the darkened glass. Like any rational person she thought the movement was coming from behind her, so she spun around fully expecting to find some masked intruder. Of course, no one was there. Or anywhere else in the house. Unnerved, she stood in front of the window trying to see the movement again. At first she only saw herself standing there dumbly in her nightgown so she sat down on her bed. From this new angle the “movie” gradually revealed itself.</p>\n\n<p><em>It was like trying to look through a camera with the lens zoomed in too far. Up close the image was nonsensical. But when my eyes adjusted back…</em></p>\n\n<p>It took her 2 more sessions to tell me what she had been seeing. What she had continued to see for the past year. Children. Very young children. Being horrifically abused in the worst way a small human being could. Sometimes adults were in the “scenes” with them. Sometimes they were only there to force the children to abuse each other. I refuse to repeat the details, as they are beyond anything I ever wanted describe, but it needs to be understood that the details were incredibly vivid to Samantha. Vivid to the point that she can describe <em>everything</em> about these hallucinations. The clothing they wore before it was removed. The type and color of carpet in the rooms they were in. Complete physical descriptions of their attackers, down to moles and skin blemishes. The pain, confusion, and fear on their innocent little faces. Their tears. Their screams. </p>\n\n<p><em>The attackers varied but the same little girl and boy was in every one. If I tried to shut my eyes I would hear it. If I plugged my ears...I would feel it.</em></p>\n\n<p>She voluntarily checked herself into the hospital the next day, unable to endure the cruel things her mind had decided force upon her. The stay was only helpful to get the hallucinations to stop. Long term aftercare would be needed. Medications. Therapy. Neither had benefitted her and the horrific “movies” continued, the same 6 or 7 different scenarios playing over and over in the various reflective materials around her. </p>\n\n<p>She became paranoid and delusional, thinking something or someone had to be behind it all. That somewhere two children were enduring a living hell and they had to be saved.  She began to fear for her life from having witnessed such a horrific crime. She became obsessed with trying to figure out the how’s and why’s and withdrawing from society due to possibly anyone being a culprit.</p>\n\n<p>From the first time it happened until she sought my care the hallucinations drove her to be hospitalized 3 more times. Within that one year span she had lost her job, acquired over twenty thousand dollars in medical debt, been left by her boyfriend of 5 years, and become the resident crazy lady in her small town. </p>\n\n<p><em>I had called 911 out of panic so many times the responding officers asked dispatch to flag my number and reroute my calls to low priority. They still came, eventually. But the look on their faces told me what a joke I had become.</em></p>\n\n<p>Before this she was just a normal everyday person trying to get by like you or I. No history of mental illness or abuse in her past. No PTSD, anxiety, or depression. One regular night of her regular life she was reading a book all cozy in bed when a switch was flipped in her brain. Just like that. When I asked about her drug and alcohol consumption she admitted there was a brief period where she was abusing drugs to cope with the breakup, but she was very reluctant to tell me what they were and if she had been using them when it all started. </p>\n\n<p><em>Doctors hear the word “drugs” at any point in your history and they will look no further. Scapegoat acquired.</em></p>\n\n<p>She had a point. The information did change the direction of my diagnosis. The possibility of drug induced psychosis was very much on the table as it covered the majority of her symptoms including the sudden start of them with no prior history. If she was abusing any kind of stimulant, illegal or prescribed, it could have easily created the conditions leading to a mental break. Especially during a time of increased stress or strain, like ending a relationship. </p>\n\n<p>I decided to forgo discussing this with her until exhausting all other options. If she had already made up her mind that I would dismiss her as a drug user who was creating her own problems we would cease any meaningful progress and she would suffer further without aid. That would have meant catastrophic failure. For both of us.</p>\n\n<p><em>I know what I’ve experienced isn’t really real. But my brain does not. It won’t let me let it go. Sometimes I feel like it wants to me to believe. It NEEDS me to. Because if don’t I will spend the rest of my life questioning the integrity of my perception.</em></p>\n\n<p><em>If something can seem so real when it is not, how can I be sure anything is real?</em></p>\n\n<p>She continued to see me for another 6 months. During that time I created a treatment plan that challenged her delusions in a way that still allowed her to explore their possibilities. It was a 3 step method to take the facts of what would need to occur for the hallucinations to be real and applying those facts until it is impossible to proclaim it real. The visual hallucinations were so lucid to her she had at one point started to believe they were somehow coming from her own eyes. So we researched that idea using the 3 stage method to essentially debunk it. For example:</p>\n\n<p>Stage 1: The technology to project video onto a reflective surface does exist. (Yes, it is possible)</p>\n\n<p>Stage 2: The existing technology is not capable of being hidden to the point of someone not knowing its origin of projection or no one else also seeing it. (It is still possible but not probable.) </p>\n\n<p>Stage 3: There is no existing technology that can be inserted into the eyes of an individual without their knowledge and project video onto reflective surfaces or any other surface. (It is not possible)</p>\n\n<p>Of course it wasn’t perfect; the disturbing subject matter of the hallucinations were a sick and sad reality and there was no getting around that. But when applied to many other issues it worked wonderfully and slowly Samantha began to win the fight against her own brain. By the time we had reached her last session she had weaned herself down to a very low daily dose of anxiety medication and an as needed sleep aid. She was no longer seeing the “movies” and was working hard to get her life back. It was a beautiful thing to witness. I had also benefited on personal and professional level and had been toying with idea of getting the method and results possibly published in a medical journal.</p>\n\n<p>I was joyfully telling her all about it in the last moments of her final session when I got too animated in my hand gesturing while holding a mug of coffee, splashing it down the front of my button up. She tried to hide her giggle but failed and we both had a hearty chuckle at my expense. It was so good seeing her smile and laugh, no longer shackled to the darkness that had invaded her life. I always kept a spare shirt in a small standing closet in the office so without thinking I removed the stained one and got up to retrieve it. Her shocked gasp stopped me.</p>\n\n<p>“Oh, I’m so sorry!” I said, my face growing red with embarrassment. Even though I had a plain white T-shirt on underneath the button up, it was probably not the most professional move. “I suppose I have become a little too comfortable around yo-”</p>\n\n<p>“How did you get that scar, Doc?”</p>\n\n<p>I looked down at the long discolored line across my upper left arm. I’d had it all my life and frequently forgot it was there. “From the past.” I told her with a shrug. “Honestly, I don’t know.”</p>\n\n<p>She looked sad for brief moment before finding her smile again. “I’m so thankful you have healed after everything you’ve been through.” She stood up, hugged me, and walked out of my office.</p>\n\n<p>She was found dead 2 days later.</p>\n\n<p>Shocked and grief stricken, I called my mentor Dr. Shane. He was long retired at that point but still like a father to me and was gracious enough show up at my front door within 45 minutes, large bottle of scotch in hand. We sat at my kitchen table for hours refilling each others glasses and talking about what happened. He knew this was the first time a patient I have treated had committed suicide and offered to try and soothe my crippling guilt. </p>\n\n<p>“Let me see your case notes.” he said.  “Between them and what you just told me about the applied method I can guarantee you did everything within your power to help that woman.” </p>\n\n<p>At that point I was drunk and on the verge of losing it so I slid my notebook over to him and quickly excused myself to the bathroom. I lingered in there a bit longer than intended as I fought to regain my composure. Between the crushing weight of failing Samantha and almost crying in front of Dr. Shane I was ready to call it a night. I did my business and washed my hands, hoping the robotic routine of it all would allow me to compartmentalize my emotions. As I finished drying my hands I heard a small crashing sound.  </p>\n\n<p>When I got back to the kitchen Dr. Shane was still sitting at the table with the notebook in his hands. His whiskey glass was in shards on the floor by his feet, surrounded by a small puddle of scotch. The expression on his face in that moment has haunted me as equally as the words he spoke when I asked him what was wrong.</p>\n\n<p>“That’s not possible, Ethan.” His wide eyes were quickly skimming the notes as he flipped frantically through the pages. “What she saw… It can’t be possible.”</p>\n\n<p>I sighed heavily. The man must have been drunker than I thought. I decided to offer him the guest bedroom once I figured out what the hell he was talking about. </p>\n\n<p>“What do you mean? Of course it’s not possible.” I grabbed a dustpan and mop to clean up the mess. “Are you alright? Let me get you some water. Listen, the guest bedroom has fresh shee-”</p>\n\n<p>“We had those videos destroyed after the trial.”</p>\n\n<p>I dropped the mop and dustpan. </p>\n\n<p>“Yo-you didn’t remember any of it.”  </p>\n\n<p><em>Have you ever seen something completely impossible, Doc?</em></p>\n\n<p>“There was only one copy an-and it was destroyed, Ethan. I watched it burn with my own eyes along with 5 other arresting officers.”</p>\n\n<p><em>Until you have you can’t imagine what it does to your psyche.</em></p>\n\n<p>“We were protecting you. You were minors and the case was sealed. Everyone involved in the trial that had to see what happened to you wanted it destroyed.”</p>\n\n<p><em>Can you help me convince myself that something I experienced wasn’t real?</em></p>\n\n<p>“You had survived hell. YOU SURVIVED! There was nothing we could have done to save the girl, Ethan. She had been dead for days when we found you.”</p>\n\n<p><em>I’m so thankful you have healed after everything you’ve been through.</em></p>\n\n<p>This isn’t a story with a satisfying ending. There aren’t any answers. There is no twist where I was the one who was mentally ill and Samantha was a figment of my imagination that represented the little girl. Nor was she some kind of adult version of her in ghost form. This is the ending of a story about something completely impossible that happened anyway. Samantha had no connection to me whatsoever. Even if she did, it would still be unexplainable. She saw something that hasn’t existed for 30 years. She heard it. She <em>felt</em> it. I had spent half a year convincing her it was all in her head. That it was just not possible. Me. The little boy with a body marred by abuse. Specifically, a deep cut in his upper left arm. </p>\n\n<p>Dr. Shane was convinced I had somehow experienced total recall while treating Samantha and the details she gave me about the video were actually my own. Since she was gone and I never recorded sessions there was no way I could prove it to him. He agreed to attend her funeral with me and was supportive of my grief but as soon as we got back in the car to leave he begged me to seek counseling. I agreed and he called a trusted colleague and got me an appointment. I don’t see any other choice at this point considering the circumstances. If Dr. Shane refuses to believe what happened knowing what he knows, there is no chance anyone else will. I’m going to bring my notebook. And I’ve already decided the first question I want to ask the doctor.</p>\n\n<p><em>Can you help me convince myself that something I experienced wasn’t real?</em></p>\n</div>\n","author":"TheEofmyEismyF"}