{"rank":"41","title":"The Creatures of the Woods: The Screaming Devil (Part 1)","id":"8m7nt0","url":"/r/nosleep/comments/8m7nt0/the_creatures_of_the_woods_the_screaming_devil/","time":"1527307605000","body":"<div class=\"md\"><p>The following is a true story (you can choose to believe it or not). For the sake of keeping my own identity safe, I am going to use a pen name: Nikolai, or just Nik for short. I have a few other friends that will show up in these stories and to keep their identities safe, their names shall be changed as well. Some of the dialogue has been changed because I either have completely forgotten what everybody had said, or to protect myself. Now, with all that aside, why don&#39;t we jump on into this.</p>\n\n<p>About four years ago (I was 14 at the time) me and some friend; &quot;James,&quot; &quot;Anthony,&quot; and &quot;Paul,&quot; decided to go on a camping trip. You see, all of us live in a neighborhood nestled right into an extremely large forest. We had gone on several camping trips before but it had been a month or so since our last one. So, after a few days of convincing our parents, gathering some camping gear, and secretly stockpiling an entire sh*tload of candy, we set out on the usual trail.</p>\n\n<p>It was actually a trail that Paul&#39;s uncle (a nature nut) had made. It went maybe a mile out into the wood line and ended at a small stream. Now, the stream is usually the place that the four of us would have stopped at and set up camp. A metal fire-pit was already set into the ground, the clearing was nice and flat, almost perfect for sleeping on. Yet, most importantly, there was the stream. I cannot BEGIN to count the times I had returned home absolutely soaking wet, preparing myself for a decent scolding.</p>\n\n<p>I remember Anthony had set down his backpack in the sand and was about to pull out his tent when James stopped him. &quot;Hey, why don&#39;t we explore into the woods first? I want to see if we can find a new campsite.&quot; James was always the explorer out of the four of us. Also, he was the one that got into the most trouble. One time he had even snuck fire into school and set them off in the bathroom. Sure enough, there was a three day suspension after that.</p>\n\n<p>&quot;What? Why? Its safer if we stay here.&quot; Paul was the most cautious out of all of us (effects of overprotective parenting I guessed).</p>\n\n<p>&quot;Dude, we always stay right here. I&#39;m starting to get board of this place,&quot; James said with a raised eyebrow.</p>\n\n<p>&quot;I don&#39;t know man. I just don&#39;t want to get lost in the woods and end up starving to death.&quot; Paul sighed.</p>\n\n<p>Anthony looked up with a smile. &quot;Trust me, there are much worse things that will happen before you starve to death. There are random holes and cracks you could fall into. Cliffs you could walk right off of. Don&#39;t forget the bears and lions.&quot; Anthony had a tendency to try and freak people out.</p>\n\n<p>&quot;There aren&#39;t any lions in the wood&#39;s dumba**.&quot; Paul tried to write him off.</p>\n\n<p>&quot;Well no...&quot; I piped in. &quot;But there are cougars. Remember I saw one outside a few weeks ago.&quot;</p>\n\n<p>&quot;Yeah, and you also said it was completely black. Cougars are brown.&quot;</p>\n\n<p>&quot;Hey, I know what I saw!&quot;</p>\n\n<p>&quot;Will the two of you just shut the F**K UP!?&quot; James had become agitated. &quot;Look, if you&#39;re scared of getting lost and then killed by something out here then why don&#39;t we just follow the stream?&quot;</p>\n\n<p>&quot;But it only leads to the lake, doesn&#39;t it?&quot; I argued.</p>\n\n<p>&quot;Downstream. Not upstream. We don&#39;t know what&#39;s up there.&quot;</p>\n\n<p>I became excited. Normal we don&#39;t do a lot of exploring. We lived in a small town and the most exciting thing that ever happened was a house fire. &quot;Alright! Lets do it!&quot; I was almost hopping about.</p>\n\n<p>Paul didn&#39;t look so sure. &quot;I&#39;m not sure man.&quot;</p>\n\n<p>&quot;Chicken.&quot;</p>\n\n<p>Now, to most, being called a chicken is no insult whatsoever, but to us, it was sacrilege. It was a demand to defend our honer and defend our name. Sure enough, Paul refused to be called a chicken.</p>\n\n<p>We set off on our journey and soon we were feeling pretty good. We were laughing, telling jokes, and overall having a good time. James had even pulled out an Ipod full of &quot;refined&quot; music and &quot;safe&quot; comedy. In other words, rap, heavy metal, and Kevin Hart joined us on our adventure into the woods. About twenty minutes in, we stopped dead in our tracks.</p>\n\n<p>&quot;What the hell is that?&quot; I asked, pointing in front of us.</p>\n\n<p>Anthony stepped forward. &quot;A house?&quot;</p>\n\n<p>&quot;No, I don&#39;t think so.&quot; James was peeking through the trees.</p>\n\n<p>&quot;Then what is it?&quot; I was still trying to tell what it was.</p>\n\n<p>&quot;I think its just a concrete building.&quot; Paul was peeking around my shoulder.</p>\n\n<p>I tilted my head. &quot;Why is it out here? I thought nobody came this far out into the woods.&quot;</p>\n\n<p>&quot;Dunno. It looks abandoned. maybe its from a long time ago.&quot; Anthony began taking steps towards the building. &quot;Why don&#39;t we check it out.&quot;</p>\n\n<p>&quot;Yeah.&quot; Me and James said simultaneously.</p>\n\n<p>&quot;Uh-uh. No way guys.&quot; Paul put his hands up. &quot;For all we know there could be a bear or cougar or a murderer in there. There is no way I&#39;m going there.&quot;</p>\n\n<p>James, Anthony, and I shared a look. &quot;Fine then. You stay here, we&#39;ll go check it out.&quot;</p>\n\n<p>Paul agreed immediately and the rest of us began to walk towards the strange building. When we got there, we were slightly disappointed. The structure we had found was simply a collection of concrete walls, covered in moss and slowly decaying away. However, inside and surrounding the open topped box was hard, flat, and even concrete. I don&#39;t remember who suggested it first, but we came to the decision to stay there.</p>\n\n<p>&quot;Okay, who&#39;ll go get Paul?&quot;</p>\n\n<p>I sighed and set my bag down, leaving it leaning against one of the walls. &quot;I will.&quot; I twisted around as I was walking away. &quot;Stay out of my bag.&quot; I knew they wouldn&#39;t, seeing as how I was holding most of the food, but I figured it was worth a shot. I leaped up on a small log, attempting to see if I could spot Paul anywhere. Strangely, I didn&#39;t see him through the trees. I took a few steps towards the stream and looked down where we had left him. Still there was no sign. &quot;Paul?&quot; I called out.</p>\n\n<p>&quot;Paul!&quot; I sat in silence for a moment, yet was only greeted by the sounds of trickling water and my own echo bouncing off the concrete walls behind me. I took a few more paces down the creek bed, looking for Paul. I began to feel a little fearful. &quot;PAUL!!! Where are you!?!&quot; I shouted at the top of my lungs. Suddenly, off to my left I heard something. A shuffling noise. &quot;Paul?&quot; I walked towards the noise, which was coming from behind a tree. As I near the tree, I began to grow a little fearful. Was this actually Paul? For some reason my mind began to think about every horror movie ever. &quot;H-h-hello?&quot;</p>\n\n<p>Without warning, an enormous mass bursted out from behind the tree. I jumped straight up in surprise, a startled wail escaping my lungs. I thought I was dead. Some creature had just caught me and I was it&#39;s lunch. However, even worse than being welcomed by extreme pain and the loud crunch of bone, I was greeted by the shrill, high pitched sound of laughter.</p>\n\n<p>Paul was doubled over, holding his sides. &quot;Whats wrong Nik? Did a bear get ya?&quot;</p>\n\n<p>&quot;A**hole,&quot; I grumbled, tempted to sucker-punch him in the gut.</p>\n\n<p>After a while he calmed down. &quot;So what is that place up there?&quot; He asked, pointing to the barren walls.</p>\n\n<p>&quot;Nothing much. Just some concrete walls and floors. We&#39;re going to camp there.&quot;</p>\n\n<p>&quot;Okay.&quot;</p>\n\n<p>So, about an hour later camp was set up. We had a tent set up, a small fire going, and we were all pigging out on various food items. After a while we all sat back, full and content.</p>\n\n<p>Anthony belched rather loudly.</p>\n\n<p>&quot;That&#39;s nasty.&quot; I told him as I prodded our fire with a stick.</p>\n\n<p>&quot;Not as nearly as nasty as this.&quot; James suddenly ripped a fart.</p>\n\n<p>&quot;Dude....&quot; I looked up. Suddenly the breeze began to blow my way. &quot;DUDE!!! Oh my good god!&quot; I began to cough. Anthony and Paul followed my lead.</p>\n\n<p>&quot;Did a skunk crawl up there and die?&quot; Paul said sourly, making all four of us laugh. After a while, our laughter began to die down. We sat in silence for a bit, all of us clearly becoming sleepy.</p>\n\n<p>&quot;I know its early, but I think I&#39;m going to go to bed.&quot; Anthony said.</p>\n\n<p>I looked at him in disappointment. &quot;Already? Dude, are you 14 or 40?&quot;</p>\n\n<p>&quot;What? I&#39;m tired. Plus, nothing is really happening. The woods are boring.&quot;</p>\n\n<p>Both James and I looked at him in offence. I was about to say something, but James beat me to it. &quot;Boring?&quot; He reached ever and picked up a small branch on the ground. Holding it like a gun, with the butt of it tucked into his shoulder he stood up. &quot;Commando Elites, sworn to protect their country have found themselves in the wild jungles of South America. They have been sent on a mission to destroy a drug cartel, but have come up on heavy resistance.&quot;</p>\n\n<p>I saw where it was going and stood up beside him. &quot;A small army has formed in order to protect the cartel, and we must destroy them first.&quot; I reached down and grabbed the stick I had been poking the fire with. I waved it in the air, the hot red end giving off sparks.</p>\n\n<p>Paul and Anthony were obviously excited, seeing as to how they also stood up and were grabbing &quot;guns&quot; as well.</p>\n\n<p>&quot;Come one men,&quot; James raised his fist in the air, &quot;TO WAR!!!&quot;</p>\n\n<p>All four of us rushed into the woods, making very bad machine gun noises, and throwing pine-cone grenades. We were having an awesome time, sometimes changing up the story. Soon, we were cowboys defending our town against outlaws, space rangers defending out spaceship against aliens, and everything in between. We were having the best time of out lives. Or at least it was, until... the scream.</p>\n\n<p>Now, there are several types of screams. Joy, anger, and pain are the three main ones. If I had to classify this scream, I would mark it as a cross between anger and pain. But not just ordinary anger and pain. It was the wailing of pure and utter rage, crossed with the crying of thousands of years of torment. It was if satin himself had decided to preform a heavy metal screamo song right in the center of the woods. Now, when we first heard this, everybody stopped dead in their tracks. The scream was rather distant, therefore it was muffled by the leaves and the pine needles in the trees.</p>\n\n<p>James had his back pressed against mine. &quot;What was that?&quot;</p>\n\n<p>&quot;I...&quot; I found myself unable to speak, partly because I was out of breath, but only partly.</p>\n\n<p>Paul&#39;s eyes were wide in terror. &quot;Um, why don&#39;t we just go back to the campsite?&quot;</p>\n\n<p>For once, none of us argued. We began to slowly creep back when we heard it again. That horrid, awful, terrifying screaming. Only this time, it was closer.</p>\n\n<p>We ran faster than our legs should have been able to carry us. Somehow not one of us managed to trip. It didn&#39;t take long for us to get to that cement structure and dart into our tent.</p>\n\n<p>&quot;Bro, what was that?&quot; Anthony asked.</p>\n\n<p>&quot;How the hell should we know?&quot; Paul was pale with fright.</p>\n\n<p>Even James was shaking.</p>\n\n<p>I stared at the three of them. &quot;Maybe... Maybe it was the vixen&#39;s Scream?&quot; You know, its funny the little bits of knowledge that you collect over the years is completely forgotten until you&#39;re put in a situation where your fearing for your life.</p>\n\n<p>James, Anthony, and Paul looked at me for an explanation.</p>\n\n<p>&quot;The Vixen&#39;s Scream is a mating call that foxes have. Its supposed to sound like a woman screaming.&quot; I said, happy to share my superior knowledge with my friends. &quot;People have called the cops before, saying there is a woman screaming in the woods.&quot;</p>\n\n<p>Everybody seemed to relax. I was happy with myself, thinking I had debunked the source of the terrifying wails.</p>\n\n<p>&quot;So its a fox?&quot; Paul asked.</p>\n\n<p>&quot;I think so.&quot; I smiled to myself. I love dogs. Though I am generally a cat person, if I get the chance I play with dogs for hours on end. And foxes always looked so, well, cute. I chuckled, &quot;Well sh*t. I suppose there&#39;s a couple of foxes out there getting it on right now.&quot; Everybody laughed.</p>\n\n<p>&quot;Hey, do you think-&quot; James had only gotten halfway through his sentence when he was interrupted by another scream. This one was even closer than the first two.</p>\n\n<p>&quot;What the f**k?&quot; Anthony mouthed quietly.</p>\n\n<p>I was clenched up in total fear. Then Paul said the very thing that I didn&#39;t need to hear. &quot;That sounds nothing like a woman.&quot;</p>\n\n<p>The scream came again, closer this time. No one said a thing. Then, it came again, getting even closer. The source of the screams was heading straight for us. The fox, or whatever it was was so close, I could almost pinpoint its exact location on the hillside. But then, it stopped. It was silent for so long. Not a single one of us dared to make a noise. But it was so quiet, the fire in front of our tent was the only noise, its gentle crackling almost telling us that there was nothing there.</p>\n\n<p>&quot;Is it gone?&quot; James whispered.</p>\n\n<p>It took me a while to build up the courage to respond. &quot;I think it is.&quot;</p>\n\n<p>A large and heavy sigh came from all of us. &quot;Thank god. I was actually starting to get worried.&quot; Paul said coolly.</p>\n\n<p>&quot;Please, you nearly sh*t yourself.&quot; Anthony chuckled. James laughed with him, his laugh ending with a snort.</p>\n\n<p>&quot;Da&#39; hell was that?&quot; I asked James, trying to relive tension.</p>\n\n<p>&quot;The hell was what?&quot;</p>\n\n<p>I stared at him. Normally James fessed up when he did something like that. If he didn&#39;t, he would have an enormous smile on his face. Strangely, he didn&#39;t. He merely looked curios. &quot;That snort. Don&#39;t try and hide it.&quot;</p>\n\n<p>&quot;But... that wasn&#39;t me, that was one of you.&quot;</p>\n\n<p>&quot;Mm-mm. Nope, don&#39;t try and play that one off, I know it was you.&quot;</p>\n\n<p>James became defensive. &quot;Dude, it wasn&#39;t me! I don&#39;t snort when I laugh. I&#39;ve never.....&quot; He trailed off and twisted his head around. At first I couldn&#39;t tell why but it quickly became apparent. Just behind him on his side of the tent there was a faint snorting sound. James scooted away from it slowly. The snorting sound came closer. Then there was a strange ticking noise that paired with the snorting. It sounded just like claws hitting concrete. Bit by bit, the ticking came closer and closer to out tent, the snorting joining it.</p>\n\n<p>&#39;Please be a fox. Please be a fox. Please be a fox.&#39; The words racked through my brain a million times a second as this thing got closer. Within a few seconds it was right by the tent. All of us held our breath, frozen in complete fear. The snorting was right next to our tent. Then, the sound of fabric being brushed against sounded in our ears. I know it was quiet, but to me it sounded like a tornado crossed with a bomb. The side of the tent pushed in slightly as this thing walked passed us.</p>\n\n<p>My heart raced and I could feel it pounding in my chest. It walked by tent, passing it at such a slow pace. Slowly but surly it walked away, its snorts and clicking claws leaving us behind. Then, it stopped. I heard shuffling, then something fall over, then a dragging sound. I looked around the tent in confusion. What was this thing getting into? Then, in one of the worst childhood horrors of all, I realized that everybody&#39;s&#39; backpacks was inside the tent. All but mine. Whatever this creature was was getting into our stash of food and candy. Being the dumb person I am, I twisted around, getting ready to defend my sweets against this creature. James reached out and grabbed me, and I&#39;m glad he did. I turned to see why and he just pointed to the side of the tent.</p>\n\n<p>Outlined against the dying flames of our campfire was one of the oddest creatures I had ever seen. It looked as if it was hairless, its outline almost completely smooth. It looked like a person, a short and lanky person that was crawling around on all fours. However, two things told me it was not human. It turned its head and the outline of its face looked as if he had no face at all. Just a rounded surface and an enormous mouth with large jagged teeth. The other thing? This creature opened its mouth wide and tilted its head back, letting out an ear-piercing, gut-wrenching, soul-stabbing scream.</p>\n\n<p>Part 2 of this story is up. Click the link here <a href=\"https://www.reddit.com/r/nosleep/comments/8mk3kx/the_creatures_of_the_woods_the_screaming_devil/\">The Screaming Devil (Part 2)</a></p>\n</div>\n","author":"Irat3Ch33tah666"}