{"rank":"995","title":"I wrote a letter to myself. I got a response. Part 2.","id":"8m7o9u","url":"/r/nosleep/comments/8m7o9u/i_wrote_a_letter_to_myself_i_got_a_response_part_2/","time":"1527307745000","body":"<div class=\"md\"><p><a href=\"https://redd.it/8lxrvb\">Part One</a></p>\n\n<p>&nbsp;</p>\n\n<p><em>Scott, I know you’re a good guy at heart.  I know that because, well, you’re me.  And despite my flaws, I like to think I’m a good guy too.  I understand that your world is different than mine and that has to have affected you a lot.  Whose to say what you would be doing, who you would be as a person, if you had grown up like I did?  My point is, I don’t blame you for anything.  I just need you to listen to me.</em></p>\n\n<p>&nbsp;</p>\n\n<p><em>I spent a lot of time with my Dad growing up.  I don’t know if that was true for you, or what your version of Dad was even like, but mine was great.  He was always there for me, and not just out of some sense of parental duty, but because he really loved me and wanted me to succeed in life.</em></p>\n\n<p>&nbsp;</p>\n\n<p><em>One thing we did a lot was go hunting.  Sometimes for wild pig or rabbit, but mostly for deer.  I remember the first time I killed a deer.  It wasn’t a clean shot, and we had to track it over a mile before finding it dead in some underbrush at the edge of an empty field.  My father took out his knife to show me how to field dress it, but before he handed it to me he stopped and put his hand on my shoulder.</em></p>\n\n<p>&nbsp;</p>\n\n<p><em>”You never kill things or hurt things unless it is necessary either for your survival or some greater good.  This deer is clean, healthy meat that will feed us and your mom for several weeks.  Us being willing or able to kill this deer doesn’t make its life unimportant.  It just means that we have to value ourselves above others while still trying to live a good and virtuous life.  You understand?”  I said that I did, and I was being honest at the time, but of course that was the understanding of a child, and the world has taught me to more fully appreciate the importance of his words now.</em></p>\n\n<p>&nbsp;</p>\n\n<p><em>My father would also tell me stories about his own childhood.  My favorites were always about the dog he had growing up named Rex.  Dad had gotten him when he was eight, and he loved that dog more than anything.  They really were best friends I think.  They would play together, explore the forests around the farm where my dad grew up, and were generally inseparable as much as life allowed.</em></p>\n\n<p>&nbsp;</p>\n\n<p><em>When Dad got old enough to drive, Rex would ride everywhere with him.  He was big for a dog apparently, so he could easily sit in his seat and stick his head out the window to catch smells as they drove to town or out to go camping.</em></p>\n\n<p>&nbsp;</p>\n\n<p><em>My version of our father never went to college, but he was a smart man and a hard-worker.  He opened up a little hardware store at 19, and within a couple of years he had bought a house and was saving up ring money for the girl that is our mother.</em></p>\n\n<p>&nbsp;</p>\n\n<p><em>One night, as he was closing up the shop, he heard Rex start growling.  He turned to see where the dog was and found him at the back door, hackles raised and teeth bared.  At first my father thought it was a raccoon or another dog maybe.  He grabbed Rex by the collar and opened the door to look out.  It was dark and he couldn’t see much, but suddenly he was knocked down and being attacked.  He would never say by what, though I’ve always suspected that was more to keep from scaring me too much than because he didn’t know.</em></p>\n\n<p>&nbsp;</p>\n\n<p><em>Rex broke free of his grasp and charged the thing, whatever it was.  He snapped and snarled, bit and clawed, and after a moment my father was free of it.  It was preoccupied by Rex, who was fighting it for everything he was worth.  He was an older dog now, but no one was going to mess with our daddy.</em></p>\n\n<p>&nbsp;</p>\n\n<p><em>Rex drove the thing off into the woods, but he was hurt badly.  Too badly to make it, in fact.  My father held him crying as he died.</em></p>\n\n<p>&nbsp;</p>\n\n<p><em>The first time Dad told me that story, I was fifteen.  I was horrified.  I had been hearing stories about Rex for years.  I loved Rex, felt like I knew him even though he died well before I was born.  And truth be told, Rex wouldn’t have lived that much longer anyway, but still.  It was so sad.</em></p>\n\n<p>&nbsp;</p>\n\n<p><em>I sat there crying my eyes out, and I remember my father started crying too.  It was one of the few times I ever saw him cry.  He reached over and hugged me before explaining why he was telling me the story in the first place.</em></p>\n\n<p>&nbsp;</p>\n\n<p><em>”Scott, this world is a hard place, and it’s only going to get harder.  Rex and me…we loved each other with everything we had, and he sacrificed himself to save me.  That’s the lesson.  If you are going to live a life worth living, you can’t be afraid to make sacrifices.  Whether its something that is important to you or to someone else, sometimes a cost has to be paid and you have to be willing to pay it.  Being too afraid or too weak to do what needs to be done is a greater sin than trying and failing or making the wrong choice.  Always remember that.”</em></p>\n\n<p>&nbsp;</p>\n\n<p><em>And I have, Scott.  I’ve tried to make the best decisions in my life, and all things considered, things have turned out well for me.  For instance, I remember the first time I saw our Christine.  I felt such a strong surge of excitement and anticipation that I didn’t even know what to say to her.  And later, when we made love for the first time, I remember she cried.  If I’m honest, I cried a little too.</em></p>\n\n<p>&nbsp;</p>\n\n<p><em>And I think I was too hard on her initially, Scott.  I thought she was a whore like the old Christine, but I think living in a softer, kinder world kept her from developing some of those rough edges that I was trying to wear down on old Christine.  She’s still got a slut look about her face at times, so she bears watching, but I do think she can be rehabilitated if you are firm with her.</em></p>\n\n<p>&nbsp;</p>\n\n<p><em>I want to apologize to you too, Scott.  When I came back and took you by surprise in your bed…well, I’ll be honest, I was disappointed.  I expected more of a fight.  But you were half asleep, and just like our Christine, you’ve had the luxury of a softer life than I’ve had.  I don’t think less of you because you couldn’t stop me from forcing you through the door.</em></p>\n\n<p>&nbsp;</p>\n\n<p><em>I also want to say I’m sorry because I know from your perspective I may seem like a bad guy.  I took your girl—and then you—from this cushy life and pushed you into a world that, well, from your point of view might seem a bit like hell.  I want you to know I didn’t do that out of some ill will towards you or even Christine.  But I had to get out of there, and sacrifices had to be made.  And those sacrifices are valued by me, Scott.  It’s important that you know that.</em></p>\n\n<p>&nbsp;</p>\n\n<p><em>Don’t worry about trying to get back, either.  I know from the peeks I’ve managed to get in the last couple of weeks that you were trying, and you had figured out that combining our two papers was a part of it, but you won’t get the rest.  And I made sure to not leave any of your letters or envelopes on my side anyway.  This letter and envelope will be the only paper from your old world you will have, and trust me, it isn’t enough.  I don’t say this to trick or discourage you, but because I don’t want you wasting time and energy chasing some impossible goal when you should be focused to getting your feet under you and making a new life.</em></p>\n\n<p>&nbsp;</p>\n\n<p><em>I really hope you two crazy kids make a go of it over there.  Lol!  Whose to say?  You might be better at that life than I ever was.  As for me, I just got back from walking in the park across from your…I mean my…apartment.  It seemed like I could hear birds singing everywhere!  And I saw a woman walking a dog!  Can you believe it?  A real, live dog!</em></p>\n\n<p>&nbsp;</p>\n\n<p><em>I know this world isn’t perfect.  I can already see a lot of impurity and corruption.  Maybe I can help correct some of that in time.  But for now, I’m just going to enjoy my new life.  I won’t be writing you again I’m afraid, but I’ll think of you often.  I’m going this afternoon to buy a puppy.  I’d name it after you, but well, that’d be weird.  Lol!  Have a good life!  Sincerely, Scott.</em></p>\n\n<p>&nbsp;</p>\n\n<p><a href=\"https://redd.it/8mg4sv\">Part Three</a></p>\n</div>\n","author":"Verastahl"}