{"rank":"9","title":"2 Doors Down","id":"8m7o0l","url":"/r/nosleep/comments/8m7o0l/2_doors_down/","time":"1527307668000","body":"<div class=\"md\"><p>Something is wrong with the apartment 2 doors down from mine.</p>\n\n<p>Apartment 10 of my condominium complex has been abandoned since before I moved in with my family in 2003.  I was only 2 years old when we got here, and even then, it was almost as if the condo was trapped in the nineties. Only, it wasn&#39;t - it was 2003, and the apart from the dirt on the unkempt door and entrance, it looked ordinary and exactly like my own new place.</p>\n\n<p>What struck me as odd about this apartment is that every window and every door inside the condo was covered by white sheet (which, from age, has now turned an unsightly yellow, as if stained with urine). There was no way to see into the house from the front, back, or sides, which contrasted every other house with mere blinds and nothing else.</p>\n\n<p>Nobody has entered or exited the condo since we moved in. It has been completely untouched; even by the current landlord, Joe. My landlord should have cleaned the thing out by now. Either him, or the government, but we&#39;ve gotten no response about apartment 10. It&#39;s just sat there, a relic of the 90s or earlier collecting rot and dust from the years that have passed. Joe, I feel is part of the reason it sits. Something is off about him.</p>\n\n<p>The reason we don&#39;t know much about that apartment is because we never ask; but, the one time my mother did, Joe said he didn&#39;t have the key to it. This never sat well with me. As the landlord, he needed to have a copy of the key to every condominium on this complex to give them to new residents and to clean out the house. However, even though we knew he had a copy of ours, he swears he had no key to apartment 10. </p>\n\n<p>He started to distance himself from our family ever since. My dad had joined the complex board, and even there, Joe had rarely spoken with him. Between awkward greetings and waves towards my sister and I, we never got to know him. Over time, he&#39;s disappeared completely from our lives. I haven&#39;t seen him emerge from his apartment in 5 years. Between the key and us knowing about it, there&#39;s a good chance he&#39;s involved with what&#39;s been happening. I just don&#39;t know anymore.</p>\n\n<p>Most of the residents have agreed that it was abandoned because the owner got too old to care for the place and was sent to a nursery home to be senile. I don&#39;t believe it, for a specific reason. There is one set of windows that weren&#39;t covered by those white sheets, and they looked into the garage. The owner&#39;s (or, previous owner&#39;s, I guess) garage was a complete mess. Shit was everywhere. And I mean, literally everywhere. However, something was wrong. Not only was the stuff in the garage completely dusted and untouched, these items would not belong to someone old enough to be senile. Between Halloween costumes to pool supplies to random toys just tossed around, all of it looked like it belonged to a family; or, at least, mother or father and son. The senility story didn&#39;t check out one bit. I started to get suspicious of Joe right around now.</p>\n\n<p>Also, even though the apartment has not been touched nor has anyone entered or exited the building since we arrived in 2003, the rent is somehow still being paid. The bank hasn&#39;t even come to reclaim the abandoned place, nor has the landlord even tried to scope it out in decades. It couldn&#39;t be abandoned. It just could not be. Not if someone paid rent.</p>\n\n<p>On top of that, newspapers still get delivered to the place. This also costs money, and yet every week, someone puts the weekly paper into the mailbox. They have stacked to the point where the box can&#39;t even close anymore. I decided today to grab a paper from the stack.</p>\n\n<p>Something struck me as odd when I picked up the paper though. I brought back the ones from April 30th of this year, meaning they were not even a month old. Yet, as I examined them, the same unsightly yellow from the sheets on all the windows completely covered the paper. It was only a month old, yet the paper itself was about as old as the apartment itself. Somehow, even though the apartment was never dusty or destroyed, this paper looked like it had been sitting there since the time whoever owned apartment 10 actually resided there. It was almost as if the apartment itself had started to age everything around it to keep itself looking new. It was bizarre, to say the least.</p>\n\n<p>The question remains though; if nobody has touched this apartment, old or not, since before 2003, who pays the rent and has the paper delivered? Why is the garage&#39;s contents that of a modern family, even though it&#39;s been there since the 1990s? Why is the key &#39;missing&#39; from Joe&#39;s collection?</p>\n\n<p>And, most importantly, what happened to that newspaper?</p>\n\n<p>The curiosity really got to me. I wanted to what Joe was hiding from me inside apartment 10. So, one day, I decided the time had finally come. Around midnight yesterday, I picked the back door, and went inside. I wish I hadn&#39;t.</p>\n\n<p>The basement was completely clean. There was no dust, no rodents, no insects, nothing. It looked as if someone cleaned it earlier today. Yet, there was nobody home. I knew there wasn&#39;t. There couldn&#39;t be. I continued up the stairs to see a completely maintained living room. &quot;No surprise there,&quot; I said to myself, chuckling nervously as I continued to the kitchen.</p>\n\n<p>The smell hit me the second I walked in. It was rotten, something you would expect to smell if you investigated an abandoned fridge. Rotting meat, expired fruit, and sour dairy do not combine to give comfort to this expedition. Yet, no food was rotten. I opened the fridge expecting to find the source of the smell, but all of the food was fresh. I could eat anything out of there and it would have been no different from my own house. It was like the groceries were brought back and put away sometime this week. Not to mention, the kitchen itself was spotless. No dust anywhere. In fact, this place had even less of a bug problem than our own apartment. It didn&#39;t make sense. If anyone was in here, they would have caught me by now. I was honestly hoping to be caught by now. I thought I was dreaming.</p>\n\n<p>I almost forgot to mention that the yellow tinted sheets were completely spotless white from the inside. I could figuratively see my own reflection looking back at how spotless they were. They, at least on this side, had never seen a speck of dust or dirt on them.</p>\n\n<p>By now, I was thoroughly wierded out, so I went upstairs and found nothing but a computer sitting in the bedroom facing the staircase.</p>\n\n<p>Everything was gone. All three other rooms, bathroom included, were completely stripped of furniture. There was no beds, no dressers, and no decorations, not even what you would expect to see on the walls of someone from the 90s. The only hint I got was the wallpaper, confirming the suspicions I had that a family lived here with the ugly blue and white wallpaper pattern in the small bedroom, something only a kid would use. </p>\n\n<p>Anyways, back to the computer. It was on, and logged in to an account named &quot;1.&quot; It wasn&#39;t a PC from the 1990s, either - it had windows 10 installed, and it was a Dell model I later discovered to have been made in 2015. The note pad application was open. Though thoroughly creeped out by this, being the idiot I was, I approached the PC, and typed &quot;Hello?&quot; into the pad.</p>\n\n<p>Almost as if it were a chatroom, I got a read receipt. Then, someone typed back. All it said was &quot;find us.&quot; Then, the application closed, and the computer shut down.</p>\n\n<p>I got up and ran back to my house without stopping. I had enough of this. I wanted to say Joe was behind it, but nobody could pull off something like this without being in the apartment at some point. I was done. At least, I thought I was.</p>\n\n<p>All I could dream last night was about that message. &quot;find us.&quot; I didn&#39;t know what it meant. I didn&#39;t know who I was finding. But I had to find them.</p>\n\n<p>My dream was the perfect place to start. I went back to the apartment without waking up, and what I found was a deteriorated rotten mess. The previously clean furniture was a complete mess, most of it broken. The living room was similarly destroyed, and the food had turned black with age in the kitchen. This didn&#39;t bother me - I went upstairs and heard them calling my name behind the closed door to the kid&#39;s door. I walked up in my dream, turn the knob, and opened my eyes.</p>\n\n<p>I woke up in apartment 10, inside of the empty bedroom. Horrified, I ran back home. I couldn&#39;t get to them. I couldn&#39;t find them. But I had to. It was my purpose. It IS my purpose.</p>\n\n<p>I&#39;m going back to investigate. I have to know what happened to the owners. Who knows, maybe I&#39;ll finally reach them inside. I&#39;ll bring them their papers. That will make them happy. Don&#39;t worry though, there&#39;s a computer in there I can update this post with!</p>\n\n<p>I think it&#39;s time to go to them. I&#39;m starting to feel sleepy.</p>\n</div>\n","author":"subspxce"}