{"rank":"111","title":"A Journal Found at the South Pole","id":"8m7t0d","url":"/r/nosleep/comments/8m7t0d/a_journal_found_at_the_south_pole/","time":"1527309324000","body":"<div class=\"md\"><hr/>\n\n<hr/>\n\n<p><strong>NOTE FROM THE DIRECTOR:</strong></p>\n\n<p><em>This journal is perhaps the most important artifact we’ve discovered in our research into the origin of the Outbreak.  Nearly everything else was destroyed by the time we reached the base.  I want a team sent over to the remains of Ambolt station immediately, diplomacy be damned.  We&#39;ve lost too many lives, and we&#39;ll only lose more if we don&#39;t act now.  We WILL find out what happened here<a href=\"https://www.nationalgeographic.com/content/dam/adventure/rights-exempt/Antarctica-Rescue/amundsen-scott-south-pole-night.jpg\">.</a></em></p>\n\n<hr/>\n\n<hr/>\n\n<p><strong>Friday, July 7 2017</strong></p>\n\n<p>Henry sat at the end of the dining room table, shaking his fist to make his point.  He’d just returned from an excursion to the nearby Norwegian research base.  Apparently, it had been an eventful trip.</p>\n\n<p>“So Roy and I walk up to his door all quiet, and we knock on it,” Henry said, pounding on the table.  “And Jenkins just shrieks at us to go away from his room.  But we knock again, and he slams his door open, then jumps on Roy!”</p>\n\n<p>I turned away from him to take a sip from my soup.  Henry always embellished his stories, but living on an Antarctic Research base meant that you took all the entertainment you could get, even if it meant a few tall tales.  </p>\n\n<p>It was early July, and that meant that no one here had seen the sun for several months.  Living so far from civilization was difficult, but harder still was the negative 50 degree temperatures outside.  Still, I didn’t mind it.  Being an astronomer, I’d leapt at the opportunity to come to this station.  Uninterrupted darkness meant you had an perfect view of the stars for several months uninterrupted.</p>\n\n<p>Henry continued with his story.  “Jenkins is biting and scratching, but I manage to pull him off Roy, and we use the rope to tie him up.  He thrashed and screamed, but we kept him down.”  </p>\n\n<p>Henry was a beefy mechanic whose job was making sure our generators kept us alive through the winter.  I didn’t doubt he could’ve easily held down some crazed Norwegian.  </p>\n\n<p>Henry leaned forward, enjoying the attention from everyone sitting around the table.  “The craziest thing was that Jenkins was bleeding from his ears and nose.  Isn’t that something?”</p>\n\n<p>Dr Bobert, an older graying man perked up from where he sat near Henry.  “Really?” he said.  “He’d have to have suffered serious trauma for that to happen.”</p>\n\n<p>Henry shrugged.  “All I know is that by the time I left, he was still all tied up.  They’re hoping he calms down after a few days.  If he stays like that all winter...”</p>\n\n<p>Rachel nodded from where she sat next to me, her brown hair bouncing with the motion.  “Yeah, that would be bad,” she said.</p>\n\n<p>“Really though Henry?” I asked.  “Blood from his ears? I mean c’mon.”  I could hear the doubt in my voice.  </p>\n\n<p>Henry rolled his eyes at me.  “Yes James, blood from his ears and nose.  You can call up the folks over at Ambolt Station yourself if you don’t believe me.”</p>\n\n<p>I held up my hands in apology.  “I didn’t mean to offend.”</p>\n\n<p>He waved his hand dismissively.  “It’s nothing.”  He turned his attention back to his own food, and conversation at the table resumed. </p>\n\n<p>We all cleaned up after the meal and I headed to my room.  I had been living on the station for several months, and it was getting harder to maintain professionalism.  I pulled out the small notebook I always carry with me and made a note to keep better control of myself before heading to bed. </p>\n\n<hr/>\n\n<p><strong>Saturday, July 8 2017</strong></p>\n\n<p>I woke up early and moved my telescope to a new section of sky.  I had been hoping to discover an exoplanet, and the data from this star cluster looked very promising.  After I set the system to run for a few hours, I headed towards our comms room.  Halfway there I stopped in a hallway and pressed my face to the window, looking out at the flag that marked the geographic south pole.</p>\n\n<p>Scott Station was located just a few dozen feet from the pole.  During these winter months, our station was completely impassable by air, and by most forms of transportation on land.  The only people who remained were scientists like myself, and the support staff who made remote life here possible like Henry and Dr Bobert.</p>\n\n<p>I reached the comms booth and saw Rachel sitting at the display with her headset on.  She shot a grin at me and pulled off the headset.  </p>\n\n<p>“Hey James,” she said.  “How about you and Henry last night huh?” </p>\n\n<p>I shrugged.  “I know I shouldn’t antagonize him.  He’s just trying to give us all a little entertainment.”  </p>\n\n<p>“You’re right,” she said.  “I’m sure it’s fine, Henry’s not the type to hold a grudge.”  She reached out and squeezed my hand.  </p>\n\n<p>I gave a small smile and sat down next to her, scratching her back absentmindedly.  “It’s just… living with the same 30 people for months can get a little crazy, you know?”  </p>\n\n<p>Rachel raised an eyebrow and looked me up and down.  “Oh, I know.”  </p>\n\n<p>I gave a laugh.  “Ok, I probably deserved that one.  Rachel 1, James 0.”  </p>\n\n<p>She laughed and leaned against me.  “I’m pretty sure it’s Rachel 39, James 0 actually.”</p>\n\n<p>Before I could respond, the radio blared in her headset, loud enough for both of us to hear.  The voice of a young man was audible from where I sat.  “Scott Station, do you copy?”  </p>\n\n<p>Rachel immediately picked up the headset and hit the microphone.  “We copy, please identify.”</p>\n\n<p>“This is Ambolt station, Marius Olsen speaking.  I’m the junior communication officer.  Please, we need help.  Jenkins got loose last night, and started attacking everyone.  And it’s not just him, four more people have started acting crazy.”  There was desperation in his voice.  </p>\n\n<p>Rachel flipped open a map of Antarctica looking for Ambolt station, then hit the microphone again.  “We copy you Marius.  How many people live at Ambolt station during the winter?”  </p>\n\n<p>There was no response on the radio.  A long minute passed, but finally a voice responded.  “I heard someone in the hallway.  They tried the door.  We...we only have twelve people living here.  Please hurry.”  A loud cracking noise sounded out through the comms.  “Helvete, they know I’m in here!  Please!”</p>\n\n<p>The line went dead. </p>\n\n<p>Rachel looked at me, wide eyed.  </p>\n\n<p>“Let’s call everyone together,” I said.</p>\n\n<p>We all grouped together in the living room of the station to discuss what happened.  Most people thought that Jenkins was just having a psychotic break, but no one knew for sure.  The only thing people could agree on was that we had to go check.  </p>\n\n<p>Henry raised a hand.  “I’m the only one who’s already done that trip, so I’m going.  Besides, I’ve had enough of my teeth kicked in that I’m nearly used to it.”  He grinned, showing his missing tooth.</p>\n\n<p>I stood in the doorway, listening to the discussion.  </p>\n\n<p>“I’ll go with you,” I said.  “Rachel can monitor my telescope, and it’s not like I’m doing much here anyway.”  I shot a grin at Henry.  “Besides, I need to be there to make sure you don’t make anything else up.”</p>\n\n<p>Henry gave a laugh.  “Alright James, you got a deal.  I won’t be making anything up this time.”  </p>\n\n<p>Henry and I spent the rest of the night getting our two snowmobiles ready.  We loaded up extra fuel and satellite phones in case we ran into trouble, and planned out the trip for the next day.  When all that was finally done I fell into bed feeling exhausted.</p>\n\n<p>I didn’t sleep well that night.  Marius had said another four people had gone crazy with Jenkins.  Why would five people just snap like that?  It didn’t make sense.</p>\n\n<hr/>\n\n<p><strong>Sunday, July 9 2017</strong></p>\n\n<p>Ambolt station was something like 40 miles away, a journey that would take us a few hours on our snowmobiles.  We left early in the morning, though you wouldn’t have known it from the pitch darkness that always covered the landscape in winter.  </p>\n\n<p>Still, the lights on our machines were powerful and we made good time, cutting around the obstacles between us and Ambolt station</p>\n\n<p>The weather was bitterly cold, even through my specially designed gear.  It doesn’t much matter what you wear when you’re riding in temperatures that could kill you in minutes.  Life in Antarctica is strange.  I could be a thousand years in the past, or on another planet and I still wouldn’t feel further from home then I felt then.  </p>\n\n<p>After an hour or two of riding, Henry signalled for us to stop.  I pulled my machine next to his and flipped it off.  He reached into his bag and took a swig of water.</p>\n\n<p>“How much further do we have?” I asked.  </p>\n\n<p>He looked at me coldly.  “I don’t know, you think you’re gonna believe me if I tell you?”</p>\n\n<p>A moment passed in silence.  I scratched my head.  “I uh, didn’t mean to…” I trailed off.</p>\n\n<p>“Uh huh,” Henry said.  He finished his water and stuffed it back into his bag.  Then he flipped his machine back on and set off again without another word.</p>\n\n<p>I sat in silence for a moment, trying to process what happened.  Henry didn’t slow down, so I turned my machine over and started after him.  </p>\n\n<p>Another two hours passed with nothing but the drone of the snowmobile engines.  When the bright lights of Ambolt station appeared on the horizon, I breathed a sigh of relief.  </p>\n\n<p>That relief quickly turned to dread when I realized that the lights I’d seen didn’t come from bulbs.  The lights were from fires.  Ambolt station burned, the yellow flames licking up the sides of the structures.  Henry and I stopped our machines just outside the compound, and walked up to the site.  Some structures had already burned themselves out; only the furthest buildings from the center still remained ablaze.  </p>\n\n<p>We walked to the center of the camp, and saw what remained of their fuel tanks.  They were a heap of twisted and blackened metal.  Henry knelt down next to them.  </p>\n\n<p>“This tank was blown up,” he said, as if to himself.  He didn’t look at me.</p>\n\n<p>“But why would anyone blow up their own fuel tank?” I asked.  </p>\n\n<p>Henry stood up without responding and walked into the main building.  I followed him closely.  Bodies littered the floor, some more burned than others.  </p>\n\n<p>One relatively unburnt body lay in the hallway, and I noticed something sticking out of its chest.  I knelt down and felt it, only to realize it was an axe handle.  </p>\n\n<p>“Henry,” I said.  “You’ll want to take a look at this.”  </p>\n\n<p>Henry came over and stared down at the body.  Almost all at once I felt nauseous and lightheaded. I moved away from the body, hot bile rising in the back of my throat.  I leaned against a wall and closed my eyes, forcing myself to not be sick.  </p>\n\n<p>That’s when I heard a strange crunching noise coming from the body behind me.  </p>\n\n<p>“Hey James,” Henry said.  “What am I lying about this time?”</p>\n\n<p>I turned around.  Henry held the fire ax in his hand.  Blood dripped from his eyes, ears, and nose.  His eyes were unfocused, yet angry.  He stared at me with a fury I can’t even describe.</p>\n\n<p>Then he ran at me, swinging the axe and shouting.  “AM I LYING ABOUT THIS?”</p>\n\n<p>I ducked, and the axe sunk into the wall next to where my head had been.  I stumbled back, nearly losing my footing. </p>\n\n<p>Henry was twice my size, there was no way I could take him in a fight.  On top of that, he had an axe.  Henry pulled at it where it was stuck in the wall, the blood falling from his face like thick droplets of rain.  </p>\n\n<p>I took advantage of his distraction to turn and run, praying to come across a door to the outside.  I knew it wasn’t likely, doors in these stations were expensive, closer to airlocks than anything else.  As I ducked into a sideroom I heard the splinter of wood as the axe ripped free from the wall.  </p>\n\n<p>Heavy footsteps echoed down the hall towards the room where I stood.  I looked around desperately, and saw that the flames had eaten away at one of the side walls of the room.  I took one last look towards the hallway, then ran at the wall with my shoulder.  </p>\n\n<p>The fire-weakened wood splintered and shattered under my weight; I crashed through, hitting the ground hard.  Deep snow cushioned my fall, turning a fall that should’ve broken my arms and ribs into one that just knocked the air out of me.  I struggled to my feet, but my winter gear was heavy and bulky.  I had only made it a few dozen feet when I heard Henry hit the ground behind me.  </p>\n\n<p>“YOU KNOW YOU SHOULDN’T LIE JAMES,” he called out.  </p>\n\n<p>I ran without looking back, finally reaching my snowmobile.  I jumped onto it and turned over the engine.  Henry was a dozen feet from me with the axe in his hands, swinging it wildly. </p>\n\n<p>I gunned the engine and hit him square in the chest.  It made a terrible crunching noise with the impact, and he spun like a ragdoll into the snow. </p>\n\n<p>I turned my machine back toward Scott Station, and hit the gas.  A few hundred feet later, I slowed down and looked over my shoulder.  The station burned brightly in the night, and I could see Henry’s body in the snow.  He wasn’t moving.  </p>\n\n<p>I glanced at the clock on the snowmobile, and saw it was just past midnight.  I shook my head, then turned my attention to my driving, setting off towards home.</p>\n\n<hr/>\n\n<p><strong>Monday, July 10 2017</strong></p>\n\n<p>I called everyone together and told them what we’d found, then what had happened.  After I finished my story Dr Bobert stepped forward.  </p>\n\n<p>“Well, it sounds like this man Jenkins caught some disease,” he said.  “It’s not a disease I’ve ever heard of, but it’s the only thing that fits.”  He looked around at us.  29 people stood in the room, faces somber.  “This disease sounds very communicable,” he said.  “I’m no epidemiologist, but I think we should quarantine ourselves.  Even standing in this room together could be dangerous.”  </p>\n\n<p>Everyone nodded.  Dr Bobert looked at me.  “Those who had the closest contact with Henry should be kept behind locked doors I think.”</p>\n\n<p>I felt a chill run through me.  Was I sick with… with whatever this thing was?  Henry had gone from normal to homicidal in just a few hours.  I nodded to Dr Bobert.  </p>\n\n<p>“Of course, that makes sense,” I said.  </p>\n\n<p>The eight of us who were with Henry the night he told his story moved to our individual rooms.  I caught Rachel’s eye as she walked into her room, holding it for a long moment.  She gave me a sad smile and shut her door.  I did the same.  </p>\n\n<p>I heard the sound of motion in the hallway as the others put drop bars or furniture in front of our doors to block us in.  </p>\n\n<p>I heard Dr Bobert speak through his door in the room next to mine.  “Henry exhibited symptoms after just two days, so hopefully we shouldn’t have to do this for long.  Just try to relax for now, and if you feel anything strange, please let us all know.”</p>\n\n<p>The rest of the day passed in excruciating boredom.  I spent most of my time doodling in my notebook.  I put my hand to my nose every ten minutes or so to see if I was bleeding, but thankfully none appeared and I didn’t feel strange at all.  Long after the hall lights had been turned off, I fell into an uneasy sleep.  </p>\n\n<hr/>\n\n<p><strong>Tuesday, July 11 2017</strong></p>\n\n<p>I awoke to the sound of a loud bang from somewhere inside our building.  I pounded on my door and demanded to be let out, but heard no response.  Then I stopped making noise and listened harder.  There was a soft moaning sound coming from outside.  </p>\n\n<p>I unlocked my door and kicked at it.  Each blow forced it open another inch or two.  I finally began running my shoulder into it, knocking over the dresser that had been put in front of my way.  </p>\n\n<p>A body lay at my feet, blood leaking from its eyes and mouth.  Its chest was wet with what looked like stab wounds.  It moaned again, and I backed away from it, trying not to vomit.  </p>\n\n<p>Several rooms were open along the hallway, rooms where sick people had been staying.  I spied Rachel’s door and was happy to see it was still closed with a desk pulled in front of it.  </p>\n\n<p>I walked up to it and knocked.  “Rachel, you ok in there?” I asked.</p>\n\n<p>“James?  Yeah, I’m fine,” she said.  </p>\n\n<p>I pulled away the desk in front of her door and opened it.  </p>\n\n<p>“We have to get out of here,” I said.  </p>\n\n<p>Rachel saw the body in the hallway and brought her hand to her mouth.  Then she blinked and nodded.  “Where do we go?” she asked.  </p>\n\n<p>My mind raced.  “We don’t know how many sick there are.  I say we grab a snowmobile and head for Edmund Station.  It’s far, but if we bring extra gas we should make it.”</p>\n\n<p>Rachel nodded.  We started down the hallway, passing scene after scene of carnage.  Some of the bodies had blood leaking from their eyes, but most didn’t.  We reached the garage of the station, and I looked through window on the door.  Dr Bobert was hacking away at the last remaining snowmobile with a crowbar, its gas tank already torn away on the ground.  He stopped occasionally to wipe away the blood that dripped from his chin.  </p>\n\n<p>I pulled Rachel away from the door, and we walked back.  The sounds of several pairs of footsteps echoed down the hall in front of us, so we ducked into the kitchen.  I looked around and saw the huge walk-in freezer that held most of our supplies.  I pulled Rachel into it and shut the door behind us.  </p>\n\n<p>I turned towards the freezer door, preparing for a fight, for anything, when it opened.  Dr Bobert stood in the kitchen surrounded by six other people, each dripping blood.  All were armed with some kind of weapon.  Axes, knives, I even saw one holding a club made from a table leg.  They stared at us, smiling.  </p>\n\n<p>Rachel yelled.  “Why are you doing this!?”  </p>\n\n<p>Dr Bobert didn’t respond, he just grimaced and rubbed away the blood dripping from his chin.  Then he smiled and did the one thing I hadn’t prepared myself for.  He slammed the freezer door shut.  I heard the sound of the lock turning from the outside.</p>\n\n<p>“No,” I whispered.  “No no no.”</p>\n\n<p>I ran at the door, but it was no use.  The freezer was made of stainless steel, and the door was inches thick, composed of insulation and metal.  </p>\n\n<p>Rachel and I looked at each other.  We were both wearing t shirts and jeans.  I felt tears well up.  “Rachel, I’m sorry.” I said.  </p>\n\n<p>I felt my pockets for tools, but all I had was my notebook from my room and a pen.  I looked up at Rachel in disbelief.  She walked up to me and buried her face in my chest, her tears soaking into my shirt.  We collapsed to the ground.  </p>\n\n<p>I’ve spent the past few hours writing out these entries, but I can’t feel my fingers too well anymore.  But I’m with Rachel. </p>\n\n<p>They say that freezing isn’t too bad, as far as ways to die go.   </p>\n\n<p><a href=\"https://www.youtube.com/channel/UCrnIYJW3bRrbLmCF6MJ1uvQ\">I’m so, so, so sorry.</a></p>\n\n<hr/>\n\n<hr/>\n</div>\n","author":"Worchester_St"}