{"rank":"0","title":"Somethings Are Never Just In Your Head.","id":"8m7tfx","url":"/r/nosleep/comments/8m7tfx/somethings_are_never_just_in_your_head/","time":"1527309477000","body":"<div class=\"md\"><p>So, to go ahead and give you some backstory to this story. When I was 9 my parents were separating and being only 9 neither of my parents would tell me what happened to cause this. So as a kid I try to figure out for myself which didn&#39;t help that to me it was my fault. I wasn&#39;t doing good in school, me and my older sister were always fighting, and I was constantly getting sick because I wasn&#39;t taking care of myself like I should have. </p>\n\n<p>So I ended up in a shell, not talking much to not bother anyone. I spend a lot of time in my room and in my head. Because of this I started getting into a depressed state, I tried telling my mother but she wouldn&#39;t take me to get checked out or anything and for this I started to have nightmares when I was 10. It got to the point I was so scared that I thought the monsters would actually come out of my mind and get me. I would stay up so late thinking if brain is too exhausted it can&#39;t make this nightmares (F.Y.I it didn&#39;t work) </p>\n\n<p>As my life went on,  I pulled myself out of my depressed state, and now for the reason I wrote this. </p>\n\n<p>I&#39;m still 19 as I write this and this took place only a few short months ago. Me and my mother have been in church a little over two years and I started to really get into my faith. And some may know this, when we get into our faith the enemy (The devil) will try to stop us. Well my mom was dating again after two years when the second marriage failed.  She was staying at the guys house she had known for months now, this wasn&#39;t new by now. </p>\n\n<p>I was used to being home alone at night, it was around 11 and I was in my room sitting on my bed messing with my phone. Now I&#39;m not one to sleep with my door closed I hate it and right outside my door I can see my mom&#39;s door way. And it was starting to freak me out it was all dark like something evil could crawl out of it any minute. It was unsettling to me for some reason after plenty of nights being alone, this came out of the blue, but I ignored it and went to sleep and didn&#39;t say a word about it. I thought it was reality kicking in that if something does happen I don&#39;t have my mom immediately near me. </p>\n\n<p>But it didn&#39;t go away, as night&#39;s went on and my mom kept leaving me alone I would get thoughts something was waiting outside my door way, but again I ignored it thinking it was the new re-adjustment of my life that I had to started cutting the rope away from my mom to be an adult and it was causing this paranoia. But more night&#39;s alone go by and I would get the thoughts of this blank black figure in my door way no features just standing there. It would pop in my head no reason I could be watching something light heart and funny and there it comes the black figure. </p>\n\n<p>And every night I spend alone it only got closer to me. I thought it was like when I was 10 it was all in my head it will go away eventually but the thing was getting closer, the monsters when I was 10 never did. As if this thing was teasing me slowly getting closer, I still didn&#39;t tell anyone. And it ONLY came when I was alone late at night another reason I thought it was just me, it never came when my mom was here or during the day when I&#39;m home alone. When I see it I would act like everything was fine, I didn&#39;t draw attention to it turned on my light and watching more YouTube. </p>\n\n<p>Now the night that will forever stay with me. AGAIN I&#39;m alone and I was watching Chilled Choas I was finally getting exhausted so I shut off my phone and laid down in the darkness thinking of happy stuff like a good anime. But again it came back only this thing was right up against my face with huge yellow cat eyes and sharp Long teeth. It NEVER had features before until now. I was actually scared to open my eyes afraid I would really it with my own eyes. But I finally open them and it wasn&#39;t there thank god. I turned on my light against turned on more Chilled Chaos and I didn&#39;t sleep that night, when my mom came home after work I finally told her and I was in tears terrified. </p>\n\n<p>She told me I was to never stay home alone again. But one night when we were both home, my mom dead asleep the dam thing got cocky. And was walking back and forth my door way casting a small shadow on my other wall as I had my back to my door. Finally I had enough, I told my mom and we talked to our six pastors. They told us to pray and rebuke it in the name of Jesus. So before my mom left to go back to her boyfriends we prayed, I told her I wanted to this myself as it was after me. And I guess I won, it hasn&#39;t been back since, but when I&#39;m home alone I turn on the little lamp in the living room to help make my mom&#39;s door way not look so scary. </p>\n\n<p>But I think the weird thing about it was it never left the apartment. And what I mean is during this time period. I have visited my grandmother and stayed the night with my mom at her boyfriend&#39;s when I did tell her. And it never showed up, it was only when I was alone in the apartment. </p>\n</div>\n","author":"OneRW"}