{"rank":"7","title":"Kidnapped","id":"8m83vv","url":"/r/nosleep/comments/8m83vv/kidnapped/","time":"1527313288000","body":"<div class=\"md\"><p>Part 1-</p>\n\n<p>“I need you to wake up now Nora”</p>\n\n<p>I could hear him but I couldn’t see him my eyes where covered, I couldn’t move my hands where tied together.  I tried to get up but this man just shoved me down hard. </p>\n\n<p>“Now Now you don’t want me to hurt you now do you?”</p>\n\n<p>I couldn’t help but cry I don’t understand why is this happening to me, how did this happen I was just going home. When did he grab me?</p>\n\n<p>“I’m so happy you are here Nora I have been watching you for so long”</p>\n\n<p>“Why are you doing this?”  It was hard to talk I couldn’t calm down. </p>\n\n<p>“Oh Nora it doesn’t matter why I’m doing this all that matters is now we are together”.</p>\n\n<p>I could hear him moving around me, his fingers ran down my cheek and wiped my tears way.</p>\n\n<p>“My sweet girl don’t cry, I will show you how happy you can be with me”.</p>\n\n<p>“I want to go home that’s what will make me happy, if you want me to be happy that’s what I want”</p>\n\n<p>He started to laugh walking away from me. Then he just stopped and I hear a door slam. I started to tug at the tape around my wrist after while I could tell I was fucked. I stopped crying when I realized that my boyfriend was meeting for dinner and I would never miss that. He would try to call I wouldn’t answer he would come to my place I wouldn’t be there. He would know something was wrong he would call the police. I just have to wait this out, they will find me.</p>\n\n<p>I don’t know how much time has passed but it felt like a few hours and I needed to pee so dang badly. </p>\n\n<p>“Hello? Is anybody there?”   Nothing just silence around me.  “Sir I umm I need to pee.. Can you take me to the bathroom?” Still nothing. \nanother few hours pass and it feels like my bladder is going to burst.  I couldn’t hold it anymore and I let go. I hated my self but at least I don’t feel like I’m a bomb waiting to explode. \nI passed out I couldn’t stop my self but at least maybe by morning all of this will be over.</p>\n\n<p>I wake up to water being thrown into face it makes me scream.</p>\n\n<p>“Did you like your punishment? Sleeping in your own piss, don’t ever talk about leaving again because if you do I’ll do something that will make you wish I you could always just pee your pants.”</p>\n\n<p>“Okay.. okay I won’t”\n“Good now lets get you changed and scrubbed off”</p>\n\n<p>Now this next part is something I didn’t think would happen I thought he would do it for his own pleasure but he cut the tape and lead me to different part of the room. He pulled off the cover that was on my eyes. Everything was blurry at first, when I looked at him he had a mask on that was made of silicone  that covers everything all the way down to his neck and was tucked into the jump suit he was wearing.I wasn’t able to see any part of him which sucks. We where in a room well it looked like a makeshift room that had a shower and toilet. He walks backwards out of the room and shuts the door making a loud sound like he slammed his back against it. I think he was leaning on the door so I wouldn’t get out.</p>\n\n<p>“Alright now take a shower Nora, you will see that I have all your favorite brands of beauty products so you can feel like your at home here.”</p>\n\n<p>“How did you know what I use?”</p>\n\n<p>“That’s for me to know and you to never find out. I also put some new clothes out for you I hope you like them, they are a bit different from what you normally wear but I think you will look amazing.”</p>\n\n<p>When I looked at the clothes I almost laughed they were different alright. It was a damn dress and I hate dresses, also he wanted me to wear fishnet stockings also something I also hate. </p>\n\n<p>“You better wear them or else you will sleep naked and I will turn the AC to the lowest it can go”</p>\n\n<p>“Fine I’ll do it I guess” I took a quick shower mainly washing where pee had gotten on, I put on the stupid dress and stockings and knocked on the door “I’m ready to come out”.</p>\n\n<p>He opened the door looking me up and down and does the hole move his finger around wanting me to let him look at the back side. I hated this I wanted to run but I didn’t know if he had anything on him that would hurt me or what he would do with me if he had caught me. I just kept telling myself to stay put all this would end.</p>\n\n<p>“Oh Nora you look so amazing, I wish you would wear dresses more they make your body pop”\n“Uhh.. thank you” I kept looking down I didn’t want to look at the stupid mask he was wearing.</p>\n\n<p>“Hungry? It’s been about a day since you have eaten, we can sit down and talk about how all of this is going to work and how all of this could be easy with you and me being happy OR it could be difficult with you always tied up and in pain every day. I’m hoping you chose the easy way.”</p>\n\n<p>My mind was going a mile a minute, if I go the easy way what would that mean? I would become his slave? His girlfriend? </p>\n\n<p>“I’m kinda hungry”\n“Oh good good, let me go get the food go into the room and sit down at the table in the corner, after that do not move till I get back”\n“Okay”</p>\n\n<p>He makes sure that I sit down before he leaves,while he’s gone I look around the room was smallish. No windows and had padding all over the walls. Sound proof maybe I don’t know. It had a bed on the other side of the room facing the table. A chair in the middle guessing that’s where I was for a hole day. Then what looked like a closet of some sort I could tell it had clothes in it. Nothing else in the room just dullness. It was a pretty long wait, he must of had to cook the food. Just thinking about it made my stomach growl. Just a few minutes later he was walking in with a plate and a glass. When he put the food down I could see it was my favorite food, chicken and rice ( i know lame favorite food but it’s just so good) I look at him when he sits down. He only brought food for me.</p>\n\n<p>“Are.. you not going to eat with me?”</p>\n\n<p>“No just you Nora, go ahead and eat then we will talk”</p>\n\n<p>END OF PART ONE</p>\n</div>\n","author":"shylomoon"}