{"rank":"161","title":"Ive been kidnapped and sent to a conversion camp","id":"8m894h","url":"/r/nosleep/comments/8m894h/ive_been_kidnapped_and_sent_to_a_conversion_camp/","time":"1527315245000","body":"<div class=\"md\"><p>Before I start this I should explain: I am a very very blatantly gay woman. I’ve been dating the same girl for about 2 years. We were happy and healthy... </p>\n\n<p>About a week ago, my girlfriend and I were headed to our local Walmart. We both work at a restaurant, so naturally it was kind of a late Walmart run. </p>\n\n<p>Now we all know and love Walmart, and sometimes the things we see in Walmart are worth enough to be on <a href=\"/r/nosleep\">r/nosleep</a> by themselves. </p>\n\n<p>As we were making our way through the isles, we noticed another gay couple. 2 women, just like us. </p>\n\n<p>No big deal, it’s always nice to see people in our community as in love as we are. They noticed us and we waved. </p>\n\n<p>They both stared at us with wide eyes and an empty expression. We brushed it off as us interrupting an argument. </p>\n\n<p>We continued our shopping as normal. Finishing up about 20 minutes later, we head to the check out. We went through self check out and 2 people behind us was the couple. They weren’t talking, and they had 1 thing in their basket. They didn’t even look at each other. </p>\n\n<p>One girl was looking around and the other was just staring.. directly at me. She didn’t even look at my girlfriend or anything else. Every time I turned around I could feel her eyes on me. </p>\n\n<p>After we checked out and left I booked it out to our car and we back out of the store. After we were on our way, my girlfriend asked why I was so shaken up. I told her about the couple and she told me not to worry about it and made some cheesy joke about how they though I was cute. We went home, no problem. </p>\n\n<p>In the middle of the night I heard our dog bark. She doesn’t usually bark unless someone’s in the house or someone’s moving around. I kind of freaked out and i shot up right to find my girlfriend not next to me. </p>\n\n<p>I heard the sink running, so I assumed she was in the bathroom. I laid back down and that’s when I saw her tied up in the closet. </p>\n\n<p>Instantly I sat up and I went to get up and i felt something hit my head and everything went black. </p>\n\n<p>I woke up again when the trunk door opened and I was thrown out of the trunk by the ropes that were tying me up. My girlfriend was unconscious, but alive next to me. </p>\n\n<p>I got told to get up and start walking. That was the last time I’ve seen her. </p>\n\n<p>I walked into a huge building and the first thing they did was stuck a syringe in me and take blood. </p>\n\n<p>Then they put me in a basic gray sweat suit and gave me 3 shirts to change into. Next, they took me to my cage where they branded me with my number: 56221. </p>\n\n<p>As I was being forced into my cell, I saw the girl I saw at Walmart leaving. They were congratulating her on finding someone else to rehabilitate and wished her a peaceful life. </p>\n\n<p>Everyday, they pull me into room where they show me videos of my girlfriend and I and put me through torture or cause me to get sick. I’ve been tased, poisoned, electrocuted, and one day when I didn’t respond the way they wanted; they cut off my finger.</p>\n\n<p>I’ve been told countless times that I’m going to die here. I’ve been told I’m never going to be cured. I’ve been told this is my resting place. I belong here. </p>\n\n<p>I only get fed once a day because I’m “failing rehab.” </p>\n\n<p>I don’t know what’s happened to my girlfriend. </p>\n\n<p>I’m only posting this because instead of taking my sleeping pills I hid them under my tongue and I put them in the guards drink when he tried to come into my cell. I took his phone and he’s knocked out on the floor. </p>\n\n<p>I don’t know what to do. I’m scared, and I need help. Please. Help me. </p>\n</div>\n","author":"Supersydney0829"}