{"rank":"3","title":"Terrorized by the Pyscho Nazi doctor Ghost","id":"8m8nto","url":"/r/nosleep/comments/8m8nto/terrorized_by_the_pyscho_nazi_doctor_ghost/","time":"1527320931000","body":"<div class=\"md\"><p>This happened many years ago, as they say, when I was a spring chicken – jet-setting around the world for a great business, trying to drum up sales. My favorite country to visit was and still is Germany. I loved the liquid bread – a thick beer the consistency of honey – and their awesome food, as well as the old towns and country estates.</p>\n\n<p>One of the estates I stayed at was an old homestead that used to belong to a doctor. The owners at the time advised me that this doctor was a Nazi who apparently conducted gruesome experiments. He was also known to be addicted to surgery himself. I was shown a photo of him, which chilled me to the bone, because he had a terrifying smile.</p>\n\n<p>This smile was permanent, as he’d suffered a freak accident where he had tripped and fallen on a wire, which sliced his mouth and went through to his cheeks – all the way to his jawline. As much as I was creeped out, the present owners assured me that I was safe and that they’d even had a local priest perform a cleansing when they’d moved in.</p>\n\n<p>Nonetheless, I could still see his creepy smile in my mind’s eye</p>\n\n<p>When I prepared for bed, I did my best to think about the next day, which was going to be a trade expo with lots of glorious European food and alcohol. I tried to ignore the feeling of my prickling hairs and the occasional blasts of cold air on my face. I reasoned with myself that it was an old house with drafts and ancient plumbing.</p>\n\n<p>I read over my notes in bed and soon fell asleep. I don’t remember turning the bedside lamp off, but when I woke up a couple of hours later, the room was dark. I could still see most of the room because the light of the moon was flooding through the stained glass windows. Then I saw my breath coming out in white clouds. The chill was intense.</p>\n\n<p>It baffled me because we were in the middle of a pleasant summer. My blood started to freeze when I smelled the distinct stench of formaldehyde. I could’ve sworn I heard several sinister whispers in German. Just as I decided to sit up and turn the lamp on, a hideous face appeared – hovering over me. It was the vicious Nazi doctor!</p>\n\n<p>Keep in mind that I hadn’t had a drink before bed – which was usually something I liked to do. The face had a strange blue hue and I don’t mind saying that I screamed like a little girl. With his terrifyingly wide smile, he leered at me as his wild eyes stared right through into my soul. I slid under the sheets and then fell out of bed.</p>\n\n<p>When I jumped up, I saw that the face had disappeared, but I could still smell the formaldehyde, the room was still ice-cold and I could faintly hear the constant whispering in German. I could barely speak the language but three words stuck in my mind: “Hallo kleine Schweinchen” – which translates as “Hello little piggy.”</p>\n\n<p>I leapt over to the bedside table and flicked the switch of the lamp. When the room lit up, the stench and chill disappeared, much to my relief. I knew that the room across the corridor was empty so I didn’t wait to relocate, not bothering to ask permission from the owners. It took ages to fall asleep, but I left the light on, just in case.</p>\n\n<p>When I woke up several hours later, I saw that once again, the light was off. I wondered if the lamps operated on a timing device, but I reached my hand out to turn it back on. That’s when I felt a pocket of icy cold air, which made me withdraw my hand in terror. That familiar smell of formaldehyde crept into my nostrils. I shuddered and sat up.</p>\n\n<p>The room was a lot darker than the other one and it seemed like the moon was blocked from illuminating the room. When I looked over at the window, I couldn’t believe my eyes. I saw a shadow bobbing up and down, like a man floating in front of the window. When I heard the whispering again, I screamed and raced over to the door.</p>\n\n<p>I screamed again when I felt a strong blast of cold air on my neck. When I spun around, the shadow man was gone, but the smell was intense while the whispering became maniacal. Then the door swung open. I fell back and saw the owner staring wide-eyed at me. I pointed to the window and yelled, “The doctor – he’s here.”</p>\n\n<p>He laughed and asked what I was doing in that room. When I told him what had happened he laughed again and said that maybe they shouldn’t have showed me the picture of the doctor – that I had an overactive imagination. I didn’t stay in that house for fear of seeing that face again. Worst luck, he’s appeared in my nightmares ever since.</p>\n\n<p>When I think back on the face of the owner of the hotel, and the photograph I saw of the doctor, I get chills. There&#39;s an odd similarity, dampened by the fact that the owner of the building didn&#39;t seem to have had any plastic surgery done.</p>\n</div>\n","author":"Woodstabber8790"}