{"rank":"17","title":"Help I don’t know what to do...","id":"8m8xeq","url":"/r/nosleep/comments/8m8xeq/help_i_dont_know_what_to_do/","time":"1527324893000","body":"<div class=\"md\"><p>I live in a house with my family. My mum and my 6 brothers. Recently, they all went in holiday to Cuba as I couldn’t go because I am in exams. Anyways I was home alone for this week and decided to have some parties as you do when your home alone so I had around 2 parties because I did have to revise. They were absolute bangers and everyone love them but there was strange things happening and I put it down to having loads of people there. So basically the music kept changing to really old music, none that anyone really liked so I guessed someone put it on for a joke so I just turned it back. But I realised I had my phone do I just put it down to Spotify’s recommendations. Anyways time went on and people started screaming saying they saw something down in the basement I just said it was our cats and left it. But the people kept explaining to me it wasn’t just a cat. But I put that down to them being drunk as it was a party. I put everything down to some kind of excuses because it was a party and I didn’t think anything would happen. </p>\n\n<p>We have had some shit happen before. In our old house thins moved and we were fine about it but then it it worse there was knocking on walls,doors. Thing thrown across the room and it was getting very scary so my parents got the house saged had the priest in and we moved away to another house. We hadn’t had much experiences in our house this times. We had doors slamming and that was about it so the priest had told us previously to tell the spirit to get out so we had. Nothing happened after that so that’s why I put everything down to something else. </p>\n\n<p>The parties were over and I was tidying and I kept hearing my name thinking someone was calling me but whenever I replied it stopped. It kept happening and I guess it was my friend messing with me and hiding in the house after the parties. I texted my friends to stop and replied and hour later and we’re all confused I realised they were all In exams that day. </p>\n\n<p>I left it at that and wasn’t bothered by to but it’s been getting worse when I’m in the shower I see shadows behind the curtain I look behind it and nothing there and I feel like someone’s watching me all the time. I don’t know what changed. I’m trying not to be scared to feed whatever this is fear but I can’t not be afraid I was alone and scared. My dogs won’t come near my room or the basement they basically have a freak attack on me and run away and find some corner to hide and just shake for and hour. I took them to the vets and they said they were absolute fine so I got even more creeped out. </p>\n\n<p>I left it at that for a few days and nothing really happened until I woke up at 3 am and heard the door open I was guessing it was my parents but they weren’t due home for another 6 days so I freaked out and called the police. They came and checked the house out and said nothing was here and there was no forced entry or anything. I called some friends and they came and stayed at mine for 2 nights until they had to leave but they woke up in the middle of the night and heard their names being called. One of my friends decided to figure out which one of us was messing with her and walked down closer to the voice and then she screamed so much and we all rushed downstairs because none of us was messing with her.  My cat. My cat...was. It was dead there was blood all over the cupboard and she said that she saw this dark figure over it and then disappeared. I had to call the police and they came they saw the horrific sight and got us checked out to make sure none of us got ptsd from seeing how bad it was. They said I needed to stay at my friends for a night and I called my parents they said they were trying to get the first flight home but they were unable but I told them to go for the full 4 more days and just to enjoy it because they would have a shit storm about to happen when they were home but I still needed to revise so I had to go home. </p>\n\n<p>I went home the next night and was revising for my exam and I heard my shout me we had a full on conversation before I realised she wasn’t home she was in Cuba. So I quickly and quietly went to run into my room when I saw my brother around the corner say I heard that too she’s not here. But nor was he. He wasn’t meant to be here and I was so panicked and had to call the police again and when they came my ‘mum’ answered and she said no ones home except me my daughter and son. She made us come down to see the police so I had to stand next to these strangers and not freak out. The police could tell u was wary of these people and said they were going to station people outside the house just incase because of the events that happened. They were going to station them for the night until they saw the rest of my family in the morning. I then went back up and pegged it away front rude strangers who looked and sounded like my family. I looked myself away and was scared for my life. I called my mum on the phone and she answered I couldn’t believe it I was right these people really wasn’t my family. I didn’t want to sound crazy so I just had a normal conversation with her until the fake mum called me down. My mum wanted to know who it was I said my friend but she knew something was up. I put the phone down and tried to ignore the fake mum and then my brother started they were banging on my door trying to get in. I sat there in silence all night and until my parents messaged me saying they were on the way home. </p>\n\n<p>This comes to the present. They are on the way home and the fake mum and brother stopped banging on my door a while ago. I felt safer they weren’t there but I still am having a massive freak out inside. Right now I keep hearing them talking trying to get me to answer but I am not going to answer.</p>\n\n<p>My parents are here now and so much commotion is going on. My mum called me saying am I safe, am I okay. She knew I wasn’t okay and wasn’t safe and she started to freak me out more.  All I hear in the background is the police wanting backup right now. My mum explains that the police now believe there is people in our house people that look like her and my brother. They told me to stay put stay in my room. I am. I have been. I don’t want to ever leave I’m scared. The fake mum and brother realised people knew about soemthing and started screaming. This blood curdling scream it felt like it burst my ear drums it was horrible. I can see this cuts and bruisers magically appear as this scream carries on. The police have started to come in but I don’t know whether I will survive or ever be safe...</p>\n</div>\n","author":"Becca-louise"}