{"rank":"32","title":"My Boss Murders His Customers.","id":"8m924q","url":"/r/nosleep/comments/8m924q/my_boss_murders_his_customers/","time":"1527326710000","body":"<div class=\"md\"><p>Ok guys, I have to be quick. I finally found an unsecured terminal that the boss assumed I couldn&#39;t get to. I don&#39;t know who to go to for this kind of thing as I don&#39;t have time for the police to laugh off my claims, and calling a P.I. will most likely make another missing persons case crop up. There&#39;s already too much weighing on my conscience for that. Maybe someone here can help.</p>\n\n<p>It started three weeks ago when I was emailed a job offer from a design firm. I needed this job, I’m a broke freshly graduated engineering student. </p>\n\n<p>Everything started out fine, my main job was to pore over designs submitted by other engineers and determine if there were any design flaws that would be potentially harmful, notate them, add suggestions on how to correct them and then submit them for review to my higher-ups. I felt really good about it, I was helping keep the world a safer place.</p>\n\n<p>The desk I was assigned was, from what I was told, an old colleague&#39;s desk who had just retired. I’m sure someone out there has experienced the same; Where bits and pieces of the older coworkers are left behind when they leave. A handwritten note here, a flower pen there. Well this guy left behind stacks of  blueprints for the oddest of devices, buildings, and transportation. A few of them looked really really old as well. For the most part I ignored them as they had no relation to my current job. </p>\n\n<p>But one day as I opened a drawer in search of another red pen, my own having just run out of ink, I found yet another loose stack of papers that I was only too keen to toss aside in my quest for a writing utensil. That is, until I glanced a corner of one of the loose papers. It was designs for the Hindenburg, and not copies either from what I could tell. I was baffled. What the hell were these doing here? And why was my old colleague’s handwriting all over it, scrawled notes that were barely legible, almost seemingly the work of a man feverishly writing at maximum speed to put his thoughts down before they escaped him… or someone else. His writings captured several inherent design flaws that have been covered time and again by the world over since the disaster in the late 30’s, except for one strange thing: His annotations were dated “July 1929.” Confused by this, I grabbed the papers and decided to approach the head boss about them.</p>\n\n<p>The boss was out of his office, but the door was ajar and the lights were out. I swear I only intended to drop the papers off on his desk, but I couldn’t help but stop and stare at what sight greeted me when I walked into his office. Rows upon rows of filing cabinets lined the edges of the room. Each one had a faceplate with different years on them. I glanced back at the dated papers in my hand, and then at the filing cabinets again. A sense of dread intermingled with curiosity filled me for reasons I had yet to comprehend. I found myself drawn inexorably towards the filing cabinet drawer labeled “1908,” a date which had lived in the back of my mind ever since I had learned of it back in grade school. </p>\n\n<p>I thumbed the trigger on the cabinet and pulled, and to my surprise it was unlocked and came forward without protest. Towards the rear of the file, I found the folder that I was looking for. “RMS Titanic.” A light shudder ran down my spine as I cracked open the file folder, yellowed with age. Sure enough, there were annotations all over these designs as well, but something was off. The flaws that made the Titanic disaster such a disaster were not present in these blueprints. Instead the annotations seemed to suggest redesigning the ship to incorporate the flaws that would later doom the lives onboard. Scribbles here and there like “reduce the amount of lifeboats. Only half capacity allowed.” and “Introduce reverse gear 50% less torque” were present. Surely this cannot mean what it seems to suggest? </p>\n\n<p>A sharp voice penetrated the dark room. </p>\n\n<p>“I see you found my curio closet.”</p>\n\n<p>It was the boss. I whipped around, flipping the file folder behind me, panic surely visible on my face.</p>\n\n<p>“I’m sure you’re smart enough to have figured it out, which is unfortunate. For you.”</p>\n\n<p>His voice was full of malice.</p>\n\n<p>“How could a company do this for so long and not get caught? What is the purpose? Why ruin so many lives? How many bloodstained hands has this company passed through before you?” I asked, barely holding the hysterics back as I started to fear for my life. </p>\n\n<p>“Fool. I AM the company, and always will be. And you are now property of the company from here on out! Go back to your desk and get back to work and maybe sometime in the next few decades you’ll be let out again. If you last that long.”</p>\n</div>\n","author":"JetSetStallion"}