{"rank":"92","title":"Down to the Bleach Stain on his Shirt","id":"8ma4px","url":"/r/nosleep/comments/8ma4px/down_to_the_bleach_stain_on_his_shirt/","time":"1527341151000","body":"<div class=\"md\"><p>I was working late this day, as I had overslept and to make up for it I decided to stay late, at a local jewelry store until 6:30pm. It was the dead of winter in Michigan, so it was quite dark outside at this time, and being so frigid there was little to no foot traffic coming in or out. Earlier in the day I had made a few sales, one to a couple looking for wedding rings, and another do a desperate looking man trying to bribe his wife to stay with him. We were getting ready to close for 7 when a man came in. He was tall, probably about 6’7” and huge, like he could have been a defensive end in the NFL. This man was wearing a black shirt with some sort of bleach stain on the sleeve, black pants and dark sneakers. </p>\n\n<p>Upon seeing him, I got a sinking feeling in my stomach. We, as employees selling an expensive product, are taught what to look for in a suspicious person. And this man had one glaringly obvious indicator: a ski mask over his face. He came up to my register, stood directly in front of me, and told me to give him the money I had, as well as all the jewelry in the locked counter in front of me. He told me he was armed, and so I obliged, scared he would hurt me or one of my coworkers. </p>\n\n<p>Then, very fortunately, a civilian came in at this time probably to look around, as most people do. They saw what was going on and pulled out their phone, beckoning to me that they were going to call the police. I did not acknowledge them, and thankfully the robber had not noticed them as of yet. At this moment, my supervisor was coming back from the bathroom and saw what was going on. The robber saw him as well though, and demanded he get on the ground. </p>\n\n<p>My manager held up his hands and kept walking forward, trying to talk down the man. Now was not the time to play hero, especially with a presumably armed and dangerous man. However, this is when we discovered he was not in fact armed. He jumped up and tackled my manager, and just began beating him. I froze, and the civilian gasped.</p>\n\n<p>At that sound, the man turned around and looked at him. He saw that he was on the phone, and by some magnetic or telekinetic force, shattered it in the man’s hand. The screen popped off, and the civilian dropped it as if it were on fire. The robber then turned back to me and said “thank you for your hospitality” and ran out the door. </p>\n\n<p>After this, I thought I must have been dreaming. There was no way someone could have robbed us in our small town, nevermind have that kind of power. I was trying to figure out what had happened when I started to hear a beeping, like some sort of alarm sounding.</p>\n\n<p>I woke up to my phone ringing, and it was my supervisor calling me asking where I was. He told me I was late for work, and needed to come in as soon as possible. I jumped out of bed, got ready, and tried to shake the eerie feeling that dream had left me with. As I was driving to work, I just could not stop thinking about how creepy and vivid that dream was. </p>\n\n<p>Once I arrived at work, my day continued as normal. I helped a couple who was looking for their wedding bands - they had just gotten engaged and were trying to plan their wedding on their own. They were very sweet people, and ended up making a purchase which was nice. Another man I helped seemed very distraught, and told me about how his marriage was failing. Too much information for me, but I helped him pick a pair of earrings for his wife in his effort to keep her around a little longer. </p>\n\n<p>I ended up staying late this day, as I was late and wanted to still get my full 40 hours for the week. My manager had just gone into the back to grab a few things when this man with a ski mask came in. He was a massive dude, probably about 6’7” and 300lbs. In this moment, everything played back in my head that had happened today. From the staying late to the man looking to hold onto his wife, this day was all too similar to my dream. And this man, this terrifying man was the same as the one in my dream, down to the bleach stain on his shirt; my heart sank and I knew exactly what was going to happen next. </p>\n</div>\n","author":"insomnia_storyteller"}