{"rank":"18","title":"Drip Panic.","id":"8ma4aw","url":"/r/nosleep/comments/8ma4aw/drip_panic/","time":"1527341020000","body":"<div class=\"md\"><p>It Didn&#39;t Move (PART 1)\n<a href=\"https://www.reddit.com/r/nosleep/comments/8lt4l5/it_didnt_move/\">https://www.reddit.com/r/nosleep/comments/8lt4l5/it_didnt_move/</a></p>\n\n<p>Drip. Drop. Drip. Drop.</p>\n\n<p>The cold water dripped down on to my face. I tried to move my right arm, and then my left. Neither arm would budge. It was at that moment for whatever reason that  I realized I couldn&#39;t see. Had I been sleeping? My wondering was cut short.</p>\n\n<p>I started to panic in my head. My thoughts screamed at me, desperate to make sense of where I was and why I couldn&#39;t move. How had I gotten here? Was I kidnapped, taken from my home in the middle of the night and dragged kicking and screaming, dropped into this void? Worse yet, was I dead? Is this what death is? Exposure to a silent black that gave nothing to your senses except the maddening realization that there would never be senses again?</p>\n\n<p>Drip. Drop.</p>\n\n<p>Water. Rain water judging by the smell. It was a comfort to realize I wasn&#39;t dead if I could hear and smell. I was happy to be alive, at first. I started to focus on my sense of touch as a means of figuring out where I was. I could feel that my back and face were wet. My mouth was dry like sandpaper, and I ached as if I hadn&#39;t moved in days.</p>\n\n<p>I tried to move my arms, my legs, even tried turning my head. All attempts were met with failure. I wasn&#39;t panicked until I heard it again.</p>\n\n<p>Drip. Drop.</p>\n\n<p>Shit.</p>\n\n<p>I didn&#39;t know if I was in an enclosed space or not really, but I had the sinking feeling there was a puddle forming underneath me. I was definitely laying down, that much I could tell. I didn&#39;t feel restrained but I couldn&#39;t move. If it was water...</p>\n\n<p>Drip. Drop.</p>\n\n<p>...Then I would soon be on my back, in an enclosed space, slowly filling with water.</p>\n\n<p>Drip.</p>\n\n<p>I&#39;m going to fucking drown.</p>\n\n<p>Drop.</p>\n\n<p>It was all adrenaline after that, which is the only reason I truly believe I was able to move. The adrenaline was like lightning in my veins. My right arm reawakened and pulled away from my body with a sickening crunch, although it didn&#39;t go far before it bumped into a barrier. I started to feel around in front of me and to my right.</p>\n\n<p>Drip.</p>\n\n<p>The space I was in was very tight. Coffin sized even. Fuck.</p>\n\n<p>Drop.</p>\n\n<p>My left arm came loose with some effort, and it felt like it pulled something away from my body with it. I wasn&#39;t in the attention paying mood then. The droplets of water acted like a clock. Each drop I was a second closer to death. The back of my neck was starting to get wet.</p>\n\n<p>Drip.</p>\n\n<p>I moved both my hands in front of my chest and pushed against the barrier in front of me. It had a lot of give which shocked me. If someone kidnapped me you&#39;d think they would have wanted to keep me there. I pushed against the barrier and it groaned again, definitely the sound of old water logged boards. For a minute I wondered of they had locked me in a fucking outhouse.</p>\n\n<p>Drop.</p>\n\n<p>That thought made me finally catch the smell in there. It was absolutely vile, like death had been sealed up in an old shoebox at the bottom of a landfill. Panic was setting in again.</p>\n\n<p>Drip.</p>\n\n<p>I heaved against the barrier again, with more force this time. It didn&#39;t give. Fuck.</p>\n\n<p>Drop.</p>\n\n<p>I pushed again, and again. The dripping water urged me to escape. The bottom of my ears were wet which made the panic worse. My whole body was moving now. I was kicking, punching, throwing myself against the wooden barrier. It creaked and cracked, and I cursed the craftsman who made it for being so damn expert. I wondered then why the hell it felt like there was a layer of soft stuff under me. I only realized it then because I was slamming my whole body into the barrier.</p>\n\n<p>Drip. Drop. Drip. Crack.</p>\n\n<p>The barrier gave way, but instead of light I was greeted by a face full of wet earth. I was suffocating. </p>\n\n<p>Fuck.</p>\n\n<p>My arms moved automatically, pushing through dirt in front of me as I scrambled to stand up and climb. I was in a hole, and my brain knew it before I did. I clawed my way to the surface, spitting out dirt and earthworms as I made the ascent. I finally pulled myself out of the hole and into the blinding light of an overcast day.</p>\n\n<p>I was overcome with laughter initially, and it burned my dry throat. My conscious baskinin having survived that horrible ordeal. Then I saw my right hand. It was barely there. I could see bone, shredded muscle, veins hanging uselessly, pumping no blood. I turned and examined my left hand. It was worse. Earlier I had felt something come away from my body as I moved my left arm, and now I could see it.</p>\n\n<p>Three of my rib bones had come away with my left arm. It was like the bones were glued there, still holding my heart and a lobe of my left lung. My heart wasn&#39;t pumping, and my lung was still. That was when I realized I wasn&#39;t breathing. I wasn&#39;t alive, there was no way I could be. Looking down at myself, at my tattered clothes, my bloated yellow skin, my exposed tissues and organs, I remembered.</p>\n\n<p>I remembered the drive to the cemetery. I remembered building my coffin. I remembered the darkness.</p>\n\n<p>I knew I was to be unborn without ever questioning what that meant, what the darkness would do to me.</p>\n\n<p>Fuck.</p>\n</div>\n","author":"willweis2020"}