{"rank":"13","title":"I Remember the Night I Died (Part 2)","id":"8ma9d6","url":"/r/nosleep/comments/8ma9d6/i_remember_the_night_i_died_part_2/","time":"1527342573000","body":"<div class=\"md\"><p>I wasn’t sure if I was going to update this, I actually didn’t think I’d be around to do it, but here I am. I found some notebooks that had a few months of journal entries from around the time I died, they’re pretty unsettling, but I think they might help figure out what happened and what is happening to me. If you haven’t read about the night I died, you can do that <a href=\"https://www.reddit.com/r/nosleep/comments/8m0yvh/i_remember_the_night_i_died/\">here</a>. That happened eleven years ago, and I think I was part of a deal with the devil gone wrong.</p>\n\n<p>After I posted here earlier, I decided to go through the other room, hoping to figure out why I’m alive. Not that I really wanted to question it, but I just couldn’t let it be. I couldn’t get into the computer, there was a password on it, and the username didn’t give me any insight into who my ‘roommate’ was, it was a string of 10 numbers. I checked the closet, and to my surprise it was full of brand new clothes, most of them with the tags on still. There was a stack of notebooks in the corner, partially hidden under a stack of towels that had fallen over. Each one was numbered, there were five in total. </p>\n\n<p>Only two had writing in them; the third was simply full of drawings of pentagrams with strange symbols around them, and the last two were blank. The first one seemed like a normal journal at first, it told a tale of a girl struggling with college, her boyfriend cheating, and losing her job, someone who just needed a place to vent. She never gave a name, not to herself or anyone else in her life, simply an initial, as if she was afraid someone she knew would find it. The first entry was almost a year before I’d died, it wasn’t anything special.</p>\n\n<p><strong>‘So I’m going to try this out. I can’t afford a therapist, but I need to talk to someone… someone who won’t judge me and can’t talk back. I can’t talk to J or A, M and D would never understand, I can’t leave him. I know he’ll get better, he’ll stop fooling around when things get better at home. I just need to get this semester done and we can focus on each other. Then things will get good again. Right? Maybe that’s why people go to therapists, they can answer them. When I get working again, we’ll go to therapy. I’ll tell him we do that or it’s over. He’ll have to listen, right? L’</strong></p>\n\n<p>Pretty harmless right? I thought so too, until I kept reading. The further I got, the more obsessed this girl got. This guy had her wrapped around his finger, and didn’t really seem to care about her one bit. He cheated constantly, yelled and blamed her when she called him out on it, but would always apologize and say he would change. She lost her job and was having no luck finding work, every position had been filled or she wasn’t qualified. Then one day, eight months before I died, there was an entry that made it sound like everything had changed for her..</p>\n\n<p><strong>‘Its done! I made him promise that now that the semester is over we would focus on each other and he said yes. He deleted the other girls numbers out of his phone and even agreed to go to counseling with me! I got that job I interviewed for at the library, and I’m even going to dinner with M and D tomorrow! I’m going to tell them the good news then. I can’t wait to see the look of surprise and pride on their faces! You’ve been such a good listener, almost as good as the old woman in the park. I can’t believe my best friend is an 80 year old woman, but she’s so kind and helpful. She said it would all work out, and she was right! I’ll talk to you soon, I promise, if life doesn’t get too good. L’</strong></p>\n\n<p>That wasn’t the first entry to mention the old woman, but it was the first one to make me question her intentions. In all of her other appearances she’d simply offer kind advice, and listen to L’s problems. After that, there wasn’t another entry for two months, six months before I died was the first mention of a deal. That time, she referred to her ‘best friend’ as him, something which struck me as odd because she never mentioned a him except her boyfriend before.</p>\n\n<p><strong>’He told me I’d have to pay to renew my time. I didn’t know what he meant at first, but then I got a call today. They’re firing me. No reason why, I just don’t fit the position. D cheated again. I read the texts in his phone from her. I don’t know who she is, he never has names, just fucking colors. Magenta. I don’t care anymore. I don’t know how I’m going to pay his price, but I have to, I made the deal. I can’t lose D like I lost everyone else. L’</strong></p>\n\n<p>Things got darker and more vulgar from there. Every entry mentioned the deal, daily she questioned what she would do. She shifted from calling her friend him and her randomly, sometimes even during the same entry. Every time she mentioned D it was to say he was getting better, she swears, he’s changing. There were almost no mentions of the other people in her life. She was struggling to find work and was torn. The next entry turned my stomach and made me wish I hadn’t read any of it at all.</p>\n\n<p><strong>‘He told me the terms today: I give him one of them, if they go quietly and stay with him, everything goes well for me. Deal fulfilled, payment rendered, and my life would go on as it was before. Things will be good. I have to give him A or J, no exceptions. She said I can choose who, but it had to be one of them. If I don’t choose by tomorrow, I lose them both, and the deal is off. I thought she cared. I don’t know what I’m going to do. Why can’t you just tell me the right answer?’</strong></p>\n\n<p>That was the last entry before I died and everything started to click together at that point, I knew who had written these journals: my older sister, Lauren. She’d chosen to give me up in favor of our other sister Jessi. We’d all wondered if her boyfriend, Derek, was right for her, but none of us could ever prove he wasn’t. The next page was stained in what looked like wet tears and drops of blood.</p>\n\n<p><strong>‘I failed. A ran and died, the deal fell through. He’s going to take J, unless I give him someone else. I can’t lose her too. I can’t fucking believe what I did. I hate myself. I shouldn’t have listened to her. She lies and lies and now A is dead and someone else dies. I can’t. I think I should just die. That would save everyone, wouldn’t it? Maybe I should stop writing for a while. I’ll make a deal. He’ll give me time we’re friends aren’t we he has to do it. L’</strong></p>\n\n<p>It made me sick, my sister was losing her mind. Something had happened to her. She made a deal with some sort of demon, and it went wrong. Horribly wrong. I’m alive now, but she said someone else dies. I haven’t read any more, I can’t stomach it right now. I’m leaving this apartment though. There’s no way it’s safe to stay here. I’ll try to find my parents house, or I’ll find a shelter or something. I just can’t stay here.</p>\n\n<p>I’m taking the journals, and the laptop computer from my sisters room, hopefully I can get into it now that I know who it belongs to. My computer is too big to even attempt to take. If I can get into her computer, I’m going to read more from the journals, and try to find my sister I can’t find her profile on Facebook since she’s blocked me, but I sent a request to my sister Jessi’s profile. It looked abandoned though, the last public update was a profile picture from 2010. </p>\n</div>\n","author":"thrashm"}