{"rank":"4","title":"Demon Scars [Part 8]","id":"8max4s","url":"/r/nosleep/comments/8max4s/demon_scars_part_8/","time":"1527348982000","body":"<div class=\"md\"><p>Part 7 of 8: <a href=\"https://www.reddit.com/r/nosleep/comments/8m0wuw/demon_scars_part_7/\">https://www.reddit.com/r/nosleep/comments/8m0wuw/demon_scars_part_7/</a></p>\n\n<p>The next few days were pure hell. My subconscious was scorched with a burning guilt.</p>\n\n<p>What was worse surprisingly, was my sudden loss of purpose. For months we planned and rehearsed obsessively. </p>\n\n<p>I soon realized that the ritual itself wasn&#39;t what was valuable, it was the love of being involved in something. </p>\n\n<p>Now it was gone, leaving an empty hole in my life. My lack of importance washed over me like an impending doom.</p>\n\n<p>Questions regarding Shane&#39;s disappearance started to mount and Randy and I made wise to avoid each other. </p>\n\n<p>Day by day, the public&#39;s interest in Shane escalated. Lac Soul Police and volunteer teams searched tirelessly for the missing teen. </p>\n\n<p>Paranoia grew to the point that my dad installed a motion-activated security light in the yard. </p>\n\n<p>Keep in mind this was a long time ago when these devices were uncommon for home use. They had to be special ordered, they were expensive, and most importantly they barely worked.</p>\n\n<p>Either no amount of movement would set the light off, or in our case, they were ultra-sensitive and a mere breeze would light up the yard outside my window. </p>\n\n<p>My nights became even more restless as the constant clicking sound of the light went on and off like a strobe light.</p>\n\n<p>Randy and I stayed tight-lipped when interviewed about Shane&#39;s whereabouts. It seemed the ploy to keep Shane quiet with offerings of porno mags had worked. </p>\n\n<p>A brilliant strategy.</p>\n\n<p>Then it happened. Alone in my room one night, I sat on my bed hopelessly awake from a tortured mind and dad&#39;s new security contraption. </p>\n\n<p>I stared out my window as the light would be activated every few seconds by a falling leaf or an ant scurrying on the ground.  </p>\n\n<p>In varied bursts of light, I saw a black cloud hover across the grass. Suddenly the shape of a man&#39;s upper body rose out of the cloud. </p>\n\n<p>The light would turn off and the shape would be in a different location the next time the light activated.</p>\n\n<p>This wasn&#39;t the only chilling event to happen in ensuing days. </p>\n\n<p>My dad was working in the garage while I was watching tv inside. He suddenly ran into the house short of breath. </p>\n\n<p>He hurried to the window behind me and asked if I noticed anyone standing outside looking in. \nHaving an idea of who that may have been, I asked what he saw.</p>\n\n<p>In a shaky voice on the verge of panic, my dad said that he saw a &quot;bloody guy.&quot; Staring through the window.</p>\n\n<p>Another awful night, I was sleeping in bed and I now kept my window curtains tightly sealed. I was awoken by the sound of my cat pacing the floor and growling at the window. </p>\n\n<p>I had never seen him this agitated. I pulled the covers over my head and shivered with horror. </p>\n\n<p>I heard a faint clicking sound on the window followed by Randy&#39;s voice whispering words I couldn&#39;t decipher. </p>\n\n<p>What the fuck?</p>\n\n<p>I slowly crawled out of bed and made my way to the window. Through the curtain, I could see the silhouette of a head and shoulders every time the security light activated. The hair on my cat&#39;s back rose. He hissed aggressively at the shape outside. </p>\n\n<p>I approached the window and pulled back the curtains expecting to see Randy.</p>\n\n<p>Except it wasn&#39;t Randy. </p>\n\n<p>Directly outside my window was Shane&#39;s decrepit face. He was caked with blood and dirt like that night we buried him in the forest. </p>\n\n<p>The axe wound on his forehead was black and his preserved eye stared at me as his lips quivered, struggling to silently chant in unison with Randy&#39;s voice. </p>\n\n<p>Behind him Randy stood at a distance. His head tilted upward as he chanted to the sky like he did on that abysmal night when I slept on his couch. </p>\n\n<p>Both of them appeared to be under a conjuration controlled by some unseen malevolent force. I was once again paralyzed with fear and disbelief as the light continued flashing its broken rhythm. </p>\n\n<p>When dark, the terrible incantation persisted. When light, I bore witness to the plunders of my flirtation with the demonic. </p>\n\n<p>As before, I lapsed into darkness with no recollection of the rest of the night. </p>\n\n<p>When I awoke the next morning, I was in my bed. My chest and shoulders were covered with strange bruises and lesions.</p>\n\n<p>I couldn&#39;t take it anymore. </p>\n\n<p>The next day I went to the police and told them everything. The killing, the ritual, the witchcraft manuals, the demon Admant, the Vietnam War report. </p>\n\n<p>I told them how we had lured and slain Shane in Randy&#39;s basement. </p>\n\n<p>I told them how I had delivered the killing blow with an axe and how we had buried the body and burned all the evidence. The officer sat silently as he listened to my confession, not showing the slightest tinge of emotion. </p>\n\n<p>In the woods by Randy&#39;s house, I instructed, they would find a freshly dug hole that contained Shane&#39;s remains. Next to it were the burned pieces of an axe and a knife.</p>\n\n<p>I told them about our encounter with the cannibal and that they should proceed with caution. When I had finished giving my statement, a homicide unit was sent to the location.</p>\n\n<p>The findings were even more horrible than I expected. The officer returned with my parents and told me of their discovery. </p>\n\n<p>There was no body in those woods. </p>\n\n<p>The hole was there, but contained no body or trace of one. The axe head and broken knife were found but once again held no proof of crime. In fact, they were too charred to be even taken in as evidence. </p>\n\n<p>This was impossible! The cannibal must have exhumed the corpse and eaten it, scattering the bones deep within the forest where they couldn&#39;t possibly be found.</p>\n\n<p>They also searched Randy&#39;s house. </p>\n\n<p>When they arrived, the officer explained, Randy was alone with his catatonic grandmother. \n&quot;Catatonic grandmother?&quot; I erupted, &quot;Are you kidding me, she&#39;s fucking dead!&quot; </p>\n\n<p>The officer was taken back by my outburst. My parents came to my side and begged me to calm down. The instability in their voices gave away their distress.</p>\n\n<p>In the basement, the officer continued, not a single drop of blood was found. </p>\n\n<p>The candles and altar that I had described where still there, but there was no sign of the violent struggle and bloodshed I had caused. </p>\n\n<p>I asked if they found Shane&#39;s severed fingers. Randy intended to fashion a necklace out of them. They must still be in the house. Did they check his bedroom?</p>\n\n<p>Again, the policeman denied any such findings. In Randy’s room, they reconciled the black magic books to my accounts, but that was it. After all, there was certainly nothing unlawful of owning literature and absolutely no body parts were found on the premise.</p>\n\n<p>After the officer detailed his findings, he chastised me for making light of a young man&#39;s disappearance. While my tales were in poor taste, he said, I had done nothing illegal and would be free to go. The officer left with my parents to discuss privately amongst themselves. </p>\n\n<p>Why didn&#39;t they find anything in the basement? Randy&#39;s grandmother? Did they even search the right house?</p>\n\n<p>The place was a slaughterhouse that night. Had the demon absorbed every single speck of blood? Had Randy diligently cleaned the place while his mother lay passed out drunk upstairs? </p>\n\n<p>I couldn&#39;t believe it.</p>\n\n<p>I was in that police interrogation room for what felt like a lifetime. Left with my questions and my thoughts. </p>\n\n<p>Little did I know, but my time with Randy was over. </p>\n\n<p>During their search of the house, the police were appalled by Randy&#39;s lack of adult care. His mother was a gambling alcoholic who was never home, the pantry was bare, and they felt he was left to fend for himself. </p>\n\n<p>This wasn&#39;t acceptable parenting in the eyes of the law.</p>\n\n<p>Randy was taken away and placed into foster care in another community. Shane was never found and his kase went kold. </p>\n\n<p>They say the only evil here was child neglect. I never saw or heard from Randy again. </p>\n\n<p>Until now. As I held this letter and obituary in my hand.</p>\n\n<p>I&#39;ll never know if he did get the ability to fly or if he was merely shortchanged by the demon as he was with his childhood.</p>\n\n<p>As I sat there with that godforsaken letter in my hand, I shed a tear for Randy. He was dead and I couldn&#39;t help but feel somewhat responsible. </p>\n\n<p>I broke a promise to a dear friend. </p>\n\n<p>There was only one way I could make it up to him, and that involved another sacrifice. </p>\n\n<p>I&#39;ve lost track of how many there have been now, but this one would be the most gruesome. The recent taste of suffering rest on my lips. </p>\n\n<p>Mortal Kombat had seven playable characters.</p>\n\n<p>Luckily, I already had the offering chosen. Skyler, this loser from my neighborhood. </p>\n\n<p>Skyler. What a fucking douchebag name.</p>\n\n<p>It was time to get to work.</p>\n\n<p>The sound of crystal rang three times.</p>\n\n<p>Part 1 of 8: <a href=\"https://wh.reddit.com/r/nosleep/comments/8i4y6o/demon_scars_part_1/\">https://wh.reddit.com/r/nosleep/comments/8i4y6o/demon_scars_part_1/</a></p>\n\n<p>Lindsay: <a href=\"https://www.reddit.com/r/nosleep/comments/739xje/lindsay/\">https://www.reddit.com/r/nosleep/comments/739xje/lindsay/</a></p>\n</div>\n","author":"Rich_Brady"}