{"rank":"27","title":"I Am A Deep Web Archivist - Case 16","id":"8mbbj1","url":"/r/nosleep/comments/8mbbj1/i_am_a_deep_web_archivist_case_16/","time":"1527352762000","body":"<div class=\"md\"><p>It turns out that the Morticians have been neglecting a section of their casefiles from me. While I have archived some of the more known cryptids, I wasn&#39;t even aware of the sub-category until I was summoned to an incident scene.</p>\n\n<p>In a large field there was one of those dopey crop circles, but the actual scene was on the edge of a neighbouring forest area. I saw a young female dead, and scorched by a weapon or energy I couldn&#39;t readily identify. And I saw an eight foot tall black skinned humanoid with a head that was larger than a normal person. Given the colour of the skin and the dwindling ambient light, it was not readily apparent why this entity was there as well. Only complete lack of movement indicated that it was dead also.</p>\n\n<p>When it was rolled over, I saw that the nose was almost non-existent, and the teeth looked more like fangs. The eye sockets appeared to be a bit larger than the victims. Looking at this new corpse, I turned to the attending active Mortician. He looked at me and sighed deeply.</p>\n\n<p>She pulled out a large folder. Using the light from my cellphone, I saw the casefile name.</p>\n\n<p>ALIEN EVENT #0001 - CIVILIAN</p>\n\n<p>I looked at the Mortician, and before I could asked the obvious question, she told me the worrying answer.</p>\n\n<p>&quot;Eight hundred and thirteen. Including this incident.&quot;</p>\n\n<p>The file in my hands was quite thick, thicker than the others I have looked at in the past when I got my hands on the physical file. I offer to help the Mortician with this incident, then I would document both. She acquiesced, and she gave me the instructions. UV lamps, and two gurneys. I grabbed the lightstands and carried them over, positioning them in the places indicated. When they were turned on, the alien corpse glowed softly, and the injuries inflicted upon the human corpse glowed as well.</p>\n\n<p>&quot;Map out the crop circle.&quot; Came an instruction I was not expecting. I will need exact measurements of any circles, the area would be good to. Also total length of the whole thing as well.&quot;</p>\n\n<p>I paused for a moment and nodded. I had always figured out that the crop circles were bored teenagers or farmers, which when you think about it makes absolutely no sense. Not that they can&#39;t be man-made, but the reason for it. What would increased visitors to a farm do in terms of sale of product?</p>\n\n<p>I found a headlamp and a measuring tape with a spike on the end, as well as a notebook. I set about my task. It was simple, but several times, I stopped. I was being Watched. Something was observing me with an intent I could not identify. Looking around I saw nothing the first three times, but while measuring the largest circle, I both heard and saw it. Another eight foot black-skinned humanoid was standing in the cornfield with me. It had partially stepped out of the corn and was partially onto the circle. It&#39;s slightly bulbous eyes had no discernible pupil. It&#39;s chest moved deeply with its breathing. We stared at each other for about forty seconds. Then it walked away.</p>\n\n<p>I resumed my measurements , noting them all down. eight circles in total Three were quite large. While I reported the measurements to the Mortician, she nodded along as I read it all out. But she froze after I finished, I immediately looked to see if the other one was back, but there was no sight of it.</p>\n\n<p>When I enquired as to her freezing, she explained that there is an arrangement between their organization and the black ones. She then immediately refused to elaborate further. We loaded the bodies in and drove to a compound.</p>\n\n<p>I mentioned that I saw one of the black ones while measuring. Her glance seemed to be concerned. Then I had a flash of insight.</p>\n\n<p>&quot;You autopsy their experiments, and that was all you ever did. But with the corpse of one of them along with an experiment indicates that there is greater trouble than we are aware of. Right? Things have changed, and you are unsure of how...&quot; I trailed off.</p>\n\n<p>&quot;How quickly can you conduct an autopsy on the black one?&quot; I ask, my gaze peering into the side and rearview mirrors.</p>\n\n<p>&quot;Couple of hours.&quot;</p>\n\n<p>&quot;Know anything about them biologically. Weaknesses, capabilities, things that might be useful, just in case.&quot;</p>\n\n<p>&quot;Only what is reported in the first case. It is a long read.&quot;</p>\n\n<p>So, after I wheeled the bodies to the Mortuary, I read the casefile</p>\n\n<p>CASEFILE - Serial Killer &#39;Eyeless&#39; - Related Topics - Black Xenos</p>\n\n<p>It is not often that we directly interfere with the lives of the regular populace. But this was one time where we forced to act. What is not known, is that before Jack the Ripper, there was another active serial killer. However, we made damn sure nobody knew about him. &#39;Eyeless&#39;, as he would refer to himself was the only known surviving member of the Xeno experiments. However since the failed to deliver his corpse, he went completely insane and start to kill people at random. The first victim was a 28 year old dock worker, Jeremiah Langston.</p>\n\n<p>Little was recorded about the abduction of Jeremiah, but the only indication of anything unusual was a &#39;deranged scream about how he must be made to see&#39;. Jeremiah&#39;s body was found with an extra set of eight eyes inserted into wounds on his corpse. The one thing that would normally set the rumour mill ablaze was the fact that the eyes were still functional. The only other oddity, which was significantly more mundane was that the skin was rubbed with charcoal, making it completely black.</p>\n\n<p>One of the attending policemen was a Mortician, who paled at the sight, because he didn&#39;t see the corpse as human, but as a black Xeno. He offered to escort the corpse to the morgue. Fortunately the mortician on duty was also one of the Morticians as well. They realized the problem, and they needed to do something obscene to divert any mounting public perception of the events.</p>\n\n<p>They knew of a killer was putting eyes onto one corpse was unlikely to stop at one, but they couldn&#39;t allow this to continue. So the Mortician who found the corpse elected to do a two-fold operation. Search for the killer they sought was the obvious one, but they had to divert attention away from this as well.</p>\n\n<p>Many are familiar with Jack the Ripper case. Some of you reading this may also be &#39;Ripperologists&#39;, so instead of rehashing the case I will point out that the ACTUAL murderer was a Mortician, who used his police officer skills to create the sensational kills, and to get any information about the killer he truly sought.</p>\n\n<p>Three weeks, that is how long it took to find the killer the Morticians sought. Did it never strike you as strange as to why the murder of prostitutes made the headlines in Victorian London?</p>\n\n<p>However the killer himself was unusual. His skin was artificially black, like his victims, but he lacked the extraneous eyes his victims had. He had the right holes for the extras, but they were empty. He turned to the Mortician, and he froze.</p>\n\n<p>They conversed for a few hours. It turns out that the Black Xenos will take a human test subject, and try to figure out how to get past the death problem. The Xenos would inflict countless experiments on the subject, and record everything to do with the many limits of the human body. But this &#39;man&#39; was another experiment. He was given a serum that modified his body chemistry to a point that the modern term for it is &#39;zombie&#39;. His brain function has severely limited, but judging by the bruising still evident on his skin, he has been struck by lightning and it seems to have awakened the higher functions that had been deactivated.</p>\n\n<p>The &#39;zombie&#39; remembered every hellish experiment he was subjected to and then after they neutered most of the higher functionality, was sent to back to Earth. It is hypothesized that a lightning strike triggered a chemical reaction that allowed the brain to recover memories of the experiments that the zombie went through.</p>\n\n<p>Five people were killed by this zombie. Five bodies with eyes that were not connected to any ocular nerves, but still able to move. The Zombie explained how he suffered repeated traumas to allow the black Rigellans to understand the limits of the human physiology. He was then healed afterwards, and his memories were wiped. Then the process would repeat. After the lightning strike he would have flashes of memory, involving tall back humanoids with large eyes watching him as he would suffer significant biological trauma. This caused him to freak out and start finding his &#39;tormentors&#39; and, in the zombie&#39;s words, &quot;make them see&quot;.</p>\n\n<p>After reading the casefile, I looked over at the Mortician.</p>\n\n<p>&quot;So, you know where the Mush corpses come from, then?&quot; I asked as I walked over to her.</p>\n\n<p>She shot me a questioning look.</p>\n\n<p>&quot;Repeated significant biological trauma. Like injuring someone over and over again. Or killing them, over and over again.&quot; I glare at her before I continue. &quot;Did you ever wonder what their true intentions were? Just because they say one thing, doesn&#39;t mean they don&#39;t mean something else. For all we know, they treat their guinea pigs as science shows like they did when they performed surgeries for the rich and elite. Or they use them as props in a science fair. Or they are trying to figure out the most effective ways to kill us, when there are plenty of things that can easily kill us one this planet already, before we even venture into cryptid territory.&quot; I end with a snarl.</p>\n\n<p>&quot;Or they actually are trying to remove death from us. Slaves that are weak, as humans are, would be a huge waste of time, unless they couldn&#39;t stay dead...&quot;</p>\n\n<p>&quot;Maybe their intentions are honest. If so, why the Mush corpses? Someone is trying to send us a message and you people are too thick to even notice that is what is going on. It could be a test...&quot;</p>\n\n<p><a href=\"https://www.reddit.com/r/nosleep/comments/7swcbf/i_am_a_deep_web_archivist/\">Beginning</a></p>\n</div>\n","author":"Voidbearer2kn17"}