{"rank":"1","title":"The Bookkeeper of Angelwing Home Part II","id":"8mbcjl","url":"/r/nosleep/comments/8mbcjl/the_bookkeeper_of_angelwing_home_part_ii/","time":"1527353031000","body":"<div class=\"md\"><p>This post is part of an ongoing series: <a href=\"https://redd.it/8knh7a\" rel=\"nofollow\">Part I</a></p>\n\n<p>Angelwing Home was more of a big house with a library than a proper orphanage, but that didnt matter for the kids, compared to what some of them faced in the past, any moment of respite, with a proper bed and two meals a day would be more than welcome.</p>\n\n<p>Apparently the place belonged to a rich guy with no heirs that commited suicide after the economic crisis, would be a waste if a mansion on the beachfront were claimed by the hoodlums, but all that is in the past, and who owns what doesnt matter anymore, what mattered the most was that .</p>\n\n<p>The fact that winter was coming, so town scavenging needed to provide enough supplies to last the next couple of months where we would need to stay holed next to the fireplace so hypothermia or freezing doesnt make the population count even lower.</p>\n\n<p>Following the shore to town was the best part of my days, the sound of the waves crashing made me relax and forget for a while what was happening around me, but every once in a while, some forms in the wave broke the trance, and I was forced to run away or play dead until there was no risk of being attacked.</p>\n\n<p>Today the trail was good, and in a couple of hours i was in the edge of the city, making my way through piles of debris and piles of decomposing bodies that laid there as if to warn everyone of who were in charge of the place.</p>\n\n<p>Things like that made me feel certain that what we’re dealing with isnt just a mindless animal, but a highly inteligent lifeform of unknown origin, but if I could bet, they must be in this earth for much longer than we do, and that scares the hell out of me.</p>\n\n<p>Another proof of their inteligence what what I like to call their “nests”, places where they kept stuff of value, like electronics, guns, jewelry and books piled up in a likely trap to attract greedy fools such as me, that can’t help but to check out the contents every time i come close to one.</p>\n\n<p>But today wasnt the time to take risks, so i took a different route, avoiding downtown and keeping to the residential areas, where the grocery stores are plenty and I could get in and out as quickly as possible, without losing any supplies in the process.</p>\n\n<p>Today’s target was a deli, plenty of food and a few hygiene products for the daily needs, the front entrance was locked but with the power supply gone for as long as it did, no alarms would sound if i broke a window or two, taking extra care with the noise so i dont startle anyone.</p>\n\n<p>I still feel bad about breaking and entering, even if the previous owner is now deceased, but morality in the apocalypse wont do you any favours, and I grab anything that wont rot in the near future and try to fit in my bags, one slung over each shoulder to be sure that the haul was good enough to feed 6 people.</p>\n\n<p>From the store’s windows, I caught a glympse of a human shape, walking calmly down the street, without a care in the world, which presented a moral dilemma: To provide food and shelter to someone in a crisis, or keep to myself and avoid more trouble.</p>\n\n<p>Don’t get me wrong, being selfish is almost a virtue in these situations, but it’s plain to see that nobody can survive alone in a situation like this, where not even the army could hold these monsters back, even the smartest guy couldnt hold back a horde without using any gadgets.</p>\n\n<p>Before I could make any decisions, they were already there, half a dozen of the creatures, springing as if burrowed on the ground, surrounding the man and tearing him apart, limb by limb, but as strange as it seemed, the motive for killing wasnt to feed or to protect their offspring.</p>\n\n<p>Either way, there was no time to mourn, there were six of them and one of me, being discovered wasn’t an option, neither was leaving the bags with weeks of food for the freaks, the back door was the only way out, but even so, i had to hope there werent any of these things waiting for me there.</p>\n\n<p>But before exiting the place, checking the counter and the owner’s belongings for anything that could be used as a weapon may give an edge in the encounter, although gunshot noises could attract more unwanted guests.</p>\n\n<p>Behind the counter, a shotgun was neatly placed in perfectly sized case, I thanked the heavens for Uncle Joe, a gun nut that used to take us in hunting trips when I was a teenager, but hunting for deer should be kinda different than what i’m about to do.</p>\n\n<p>The box of shells beside the gun made me think of what happened to the owner, if he was attacked by surprise or wasnt here when it all began, either way, stuffing the shells in the bag, and making a run from the back side when there was an opening was the next logical thing to do.</p>\n\n<p>Surprisingly, the back door was unlocked, and there were none of them outside, making dashing away from the store a lot easier than expected, but something felt wrong, the fact that they didnt ate people left me thinking... How did they survive, and why are all the supplies untouched?</p>\n\n<p>Then, the realization came in, what if the holes on the ground and collapsed buildings werent the work of a bombing? The possibility of this species living underground and making its way to the surface could fill a lot of blank spots, but still, nothing could explain why the might of earth’s largest army was no match for them.</p>\n\n<p>A sudden shockwave made the ground tremble, again, and again, as if something of gigantic proportions was strolling around the neighborhood, and with it, the clicking sounds of the Burrowers alien language, and the sight of their pale, protruded heads coming out of impossible angles in the walls and streets announced something.</p>\n</div>\n","author":"donger1no"}