{"rank":"1020","title":"Not All Lighthouses are Built to Guide Ships","id":"8mbhsr","url":"/r/nosleep/comments/8mbhsr/not_all_lighthouses_are_built_to_guide_ships/","time":"1527354358000","body":"<div class=\"md\"><p>Most old lighthouses have turned into useless remnants of the past. New technology, modern ships, and GPS have made them almost obsolete.</p>\n\n<p>Not in my town though. Our old lighthouse is still very much operative and watched over by an old lighthouse keeper. Each night, the light beam is moving over the surface of the ocean till the sun comes up.</p>\n\n<p>My town is a small, remote coastal town in northern Germany. Only a few thousand people live here and we scarcely get visitors. It also isn&#39;t too farfetched to say we are a bit behind. </p>\n\n<p>I graduated school with barely average grades. For the first two years, I worked here and there to earn some money, but it never was anything substantial.</p>\n\n<p>It was earlier this year that I found out that the old lighthouse keeper was retiring. Of course, someone was needed to replace him.</p>\n\n<p>It wasn&#39;t exactly my dream job, but at least it would be a permanent position. I visited the old man, Mister Wallace, right away and told him about my interest in the job.</p>\n\n<p>I somehow must have made an impression on the old man. During the interviews he singled me out between the candidates and told me, he&#39;d give me a chance. </p>\n\n<p>On my first official day, the old man and I met up in front of the lighthouse. I was first to arrive and noticed the old man from afar. He was walking in my direction, dragging one of his legs behind. A limp, I thought. Once he reached me handed me a cup of steaming liquid.</p>\n\n<p>&quot;For you,&quot; he said with a bright smile.</p>\n\n<p>&quot;The wind today must be gettin&#39; to ye, boy.&quot;</p>\n\n<p>&quot;Thanks,&quot; I answered taken a bit by surprise.</p>\n\n<p>The old man took a deep sip from his cup, took out an old keyring and stepped towards the entrance door.</p>\n\n<p>&quot;This thing is a bitch to open!&quot;</p>\n\n<p>He started to turn the key around, but the door didn&#39;t budge.</p>\n\n<p>&quot;Come on you bloody, ugh!&quot;</p>\n\n<p>Finally, there was a loud clang as the door sprang open.</p>\n\n<p>&quot;You comin&#39;?&quot;</p>\n\n<p>As I followed him inside, I noticed how dirty and narrow the lighthouse was. When I was a kid, it had been this imposing, grand building. Now I saw that it was pretty unimpressive.</p>\n\n<p>There was another door opposite the entrance door. The old man didn&#39;t address it at all and instead began his ascent up the stairs.</p>\n\n<p>Before I followed, I took a sip from the cup he had given me. I almost spat it out again. This wasn&#39;t coffee as I&#39;d expected. </p>\n\n<p>&quot;The hell&#39;s that stuff?&quot;</p>\n\n<p>&quot;Grog! Warms ye right up, doesn&#39;t it?&quot;</p>\n\n<p>I frowned, at which the old man started laughing.</p>\n\n<p>&quot;You&#39;ll get used to it!&quot;</p>\n\n<p>The old man had quite a hard time with the stairs. He had to almost drag himself upwards.</p>\n\n<p>&quot;Must be the leg. No wonder he is retiring,&quot; I thought.</p>\n\n<p>I heard him wheeze and groan as he clung to the railing. A few times he had to stop to catch his breath. </p>\n\n<p>&quot;You ok there, Mister Wallace? Need a hand?&quot;</p>\n\n<p>&quot;I&#39;ve been making my way up those damned stairs for half a century, boy. I&#39;ll be fine doing it a few more times.&quot;</p>\n\n<p>Once we&#39;d made it upstairs, the old man showed me around.</p>\n\n<p>&quot;Better get comfortable around here. You&#39;ll be spending a lot of time in this room.&quot;</p>\n\n<p>As I looked around, I saw an old radio system. Other than that, there was a table, a few chairs, a telescope, two cupboards and a small oil stove. The rest of the room was empty.</p>\n\n<p>There was a metal ladder that led up from here to the lantern room above.</p>\n\n<p>&quot;Ain&#39;t much need to get up there,&quot; the old man said, &quot;except to give the thing a checkup before it turns dark.&quot;</p>\n\n<p>With that, he motioned for me to follow him upstairs and showed me how to make sure the lamp was working. It didn&#39;t take long and we soon went down again.</p>\n\n<p>&quot;There ain&#39;t much to do up here. Keep watch till mornin&#39; and make sure everything goes well.&quot;</p>\n\n<p>&quot;So, do you get many calls up here? There aren&#39;t many ships coming to town anymore, aren&#39;t there?&quot;</p>\n\n<p>With that, I motioned to the old radio system behind him.</p>\n\n<p>&quot;Haven&#39;t gottan a call in years. There ain&#39;t no one coming here. And if they ever do, it&#39;s in those new, modern ships. They don&#39;t need no old lighthouse anymore.&quot;</p>\n\n<p>&quot;Then why are we even here? Doesn&#39;t it mean this place is useless? I mean, not like I am complaining or anything, I can-&quot;</p>\n\n<p>&quot;This place ain&#39;t useless, boy. Now you listen and you listen close. You don&#39;t know what is out there, do ye? It ain&#39;t those ships that need us. It&#39;s the town.&quot;</p>\n\n<p>For a moment I looked at him before I burst out laughing.</p>\n\n<p>&quot;Ok, you almost got me,&quot; I said.</p>\n\n<p>The old man frowned. &quot;Ain&#39;t joking around, boy.&quot;</p>\n\n<p>Yeah sure, I thought, but I kept my mouth shut. Now here is the thing about my town. You could say it has a history. Over the decades a number of strange things have happened.</p>\n\n<p>One such story is about a fisher boat that went out one morning with a crew of eight. That same evening the boat returned, but without any sign of the crew. The men stayed missing.</p>\n\n<p>Another tale is about an artist who decided to pain the moonlit sea. The next morning they found the man babbling nonsense. He had gone mad overnight.</p>\n\n<p>By now natural explanations have been found for almost all these stories. The artist had a history of mental illness. The fisher boat most likely got caught up in a storm. Back in the day though these stories fed into people&#39;s superstition. With the years they became local legends.</p>\n\n<p>There are many people in this town, even today, who believe in the supernatural.</p>\n\n<p>From the way the old man had talked, I could tell he was one of them. Who was I to blame him though? After half a century up here, I&#39;d most likely tell myself similar things to give meaning to what I was doing.</p>\n\n<p>&quot;There&#39;s one more thing I gotta show ye.&quot;</p>\n\n<p>With that, he made his way down the spiral staircase again. Once we reached the bottom he opened the door I&#39;d seen before.</p>\n\n<p>&quot;This is the generator room,&quot; he said as he led me inside.</p>\n\n<p>&quot;This lighthouse is old. The cables and power lines are too. When it storms a little too much, the power can cut out. If that happens, you turn on this baby here.&quot;</p>\n\n<p>With that, he pointed at the generator.</p>\n\n<p>&quot;The light has to stay on, at all times.&quot;</p>\n\n<p>Then he showed me in every minute detail how to handle the generator. Turn this here and that there. If this happens, you need to add some oil. If that happens, the fuel is empty. If the light doesn&#39;t turn on once you start it, check the cables. This went on for almost half an hour and multiple times he asked me if I understood him.</p>\n\n<p>Once he finished his explanations, the old man told me he&#39;d stick around for the first couple of nights. He&#39;d show me the ropes, he said.</p>\n\n<p>The three nights he stayed at the lighthouse with me were quite alright. I had expected the old man to be somewhat uptight and boring, but he wasn&#39;t at all. He cursed like a sailor, knew a sheer endless amount of dirty jokes and had quite a few stories to tell. He even brought some booze. It was to keep the mood as merry as possible, he said.</p>\n\n<p>One of the things he did first thing after arriving was to give the old generator a checkup. After that, he made his way up to the lantern room to do the same to the lamp. His diligence surprised me.</p>\n\n<p>On the last day, I told him I&#39;d be sure to pay him a visit in time. He said, that instead of making empty promises I&#39;d do well to remember what he&#39;d told me on the first day.</p>\n\n<p>&quot;Whatever happens, always make sure the light is on, boy.&quot;</p>\n\n<hr/>\n\n<p>On my first day alone I made sure to follow the old man&#39;s routine to the point. First the generator, then the lamp and then everything else. &#39;Everything else&#39; pretty much meant the radio system.</p>\n\n<p>To be honest, I&#39;d no idea why we even kept bothering with the damned radio. There&#39;d been nothing but static on it and I doubted it would change any time soon, if ever.</p>\n\n<p>The first night alone was terribly boring. For a while, I rearranged the room to my liking and then cleaned it out a bit. Unfortunately, this could only fill so much time.</p>\n\n<p>The rest of the night I was sitting in one of the chairs, staring out at the dark sea. I played around on my phone for a bit, but without any reception, there wasn&#39;t much to do. I cursed at myself for not bringing anything else. I&#39;d not make that mistake twice.</p>\n\n<p>For the first two weeks, I was serious about everything. I was new on the job after all. Once routine settled in, things changed.</p>\n\n<p>Nothing had happened so far and I was sure it would stay that way. Quite a few times I turned the radio&#39;s volume up in the unlikely case of an emergency and settled in for a nap. At other times I brought my laptop and spend the night watching movies or a TV show. To be honest, I felt a little bad about it.</p>\n\n<p>I&#39;d been on the job for a good month when the first power outage occurred. A terrible storm was raging and when the power turned off, I went down to the emergency generator. In the room, I could hear the raging of the storm, the shrieking of the wind and the waves crashing against the beach. That&#39;s one hell of a storm, I thought.</p>\n\n<p>The power outage lasted till early morning, long after the worst of the storm was over.</p>\n\n<p>The second power outage came out of nowhere. The lights flickered and soon went out completely. Again I made my way down to the generator. Again I heard sounds from outside and wondered if a new storm was coming up. Soon the rattling of the generator replaced the sounds. This time the power outage didn&#39;t last for long. After not even half an hour I was on my way back down to turn the damned thing back off.</p>\n\n<p>&quot;What a complete waste of time,&quot; I cursed to myself.</p>\n\n<p>I turned the thing back off, locked the generator room behind me and made my way back up. Once I was up again I slumped down in my chair. \n“Why did I even go through all that trouble? Not like it mattered anyway. Wasn&#39;t like any ships would crash.”</p>\n\n<p>For the next couple of weeks, nothing happened. Then, one night, the power went off again.</p>\n\n<p>&quot;Oh come on, really?&quot;</p>\n\n<p>I was watching a movie on my laptop. I wasn&#39;t in the mood for getting up and making my way down to the generator yet again. The power would most likely be back in an hour anyway. Not like there was a storm or something.</p>\n\n<p>I had one look out at sea and saw that it was completely calm.</p>\n\n<p>I turned the movie back on, but after a while, I started to hear something. At first, I thought it as part of the movie, but when I paused it, the sound was still there. It was a low melody or a type of wordless singing.</p>\n\n<p>I looked around the room for the source of the sound but found nothing.</p>\n\n<p>It couldn&#39;t be the radio, could it? Wasn&#39;t it off due to the power outage? I went forward, but before I could reach it, the weird singing got louder.</p>\n\n<p>It must be coming from outside I realized. As I turned to the window, I saw that the calm sea had turned into ranging waves. </p>\n\n<p>&quot;What the hell? How did the sea change so quickly?&quot;</p>\n\n<p>Then I saw something emerge from between the waves. I stepped to the telescope and used it to see what was going on. </p>\n\n<p>As I focused the telescope the first thing I saw was dark hair. What followed was white skin that shimmered in the moonlight. I gasped as I finally saw a face. It was the face of absolute beauty. Soon I could see the naked, upper body of a young woman above the waves. I stumbled back from the telescope, shook my head, opened and closed my eyes and looked again. She was still there.</p>\n\n<p>&quot;Is this a... mermaid?&quot; </p>\n\n<p>It couldn&#39;t be. Mermaids weren&#39;t real. But then what was I seeing?</p>\n\n<p>As I watched on, more started emerging from the sea. They all were swimming together towards the beach. All the while the sea was raging around them. I wondered how these frail beings were able to move so swiftly and carelessly in this choppy sea.</p>\n\n<p>Suddenly a flare was fired into the sky. It illuminated the sea into glaring, red light.</p>\n\n<p>The beings in the water recoiled from it. They were screaming and shrieking, throwing themselves backward. </p>\n\n<p>Before I could wonder who had fired the flare, I saw something horrific. Now their beautiful faces and perfect bodies were replaced by a nightmarish reality. Where I had seen beautiful mermaids before, I now saw bloated, fishy monstrosities.</p>\n\n<p>There was no hair or skin anymore, just scales. There were no beautiful faces, just empty, staring eyes. Where I had seen smiles before, there were now giant jaws that opened to rows of fangs.</p>\n\n<p>I watched in utter fear as those gigantic creatures burst through waves and water alike.</p>\n\n<p>I was glued to the telescope, watching in utter horror. Then the light of the flare died away. The monstrous beings transformed back into beautiful mermaids. Yet again they were frolicking in the water.</p>\n\n<p>This time though, the illusion wasn&#39;t perfect anymore. My brain had seen reality, so it refused to discard it altogether. The beautiful faces of the mermaids were disfigured by maws filled with fangs. Their bodies were still shimmering in the moonlight. Now though they were bloated and disgusting.</p>\n\n<p>For a few seconds, I stood there, dumbfounded. From where was I could see more and more of them appearing in the water.</p>\n\n<p>Then my grip on reality returned and I remembered the words of the old man.</p>\n\n<p>&quot;You don&#39;t know what is out there, do ye? It ain&#39;t those ships that need us. It&#39;s the town.&quot;</p>\n\n<p>It finally dawned on me. It must be those things he&#39;d been talking about. They&#39;d recoiled at the flare. The light was to... keep them out?</p>\n\n<p>As this thought crossed my mind, I realized the terrible mistake I&#39;d made. If not for the flare I&#39;d never...</p>\n\n<p>I rushed to the stairs. Taking multiple steps at a time, I made way to the generator room.</p>\n\n<p>I tried to open the door, but it was locked as always. I reached into my pocket and tried to find the right key. The noise outside grew louder as well as nearer. I couldn&#39;t concentrate. All I had on my mind was the image of the monsters out there.</p>\n\n<p>Any moment now they could reach the beach and with it this lighthouse. There was no singing anymore, now I only heard loud roaring.</p>\n\n<p>As the door sprang open, I hurried inside and tried to turn the generator on. Nothing happened.</p>\n\n<p>&quot;What the fuck? Why aren&#39;t you working?&quot;</p>\n\n<p>I kicked it and tried again, but still nothing. I was starting to panic. I tried again. Then I remembered the oil. Since the last power outage, I&#39;d not checked the thing at all.</p>\n\n<p>&quot;Why the fuck now? Why the hell-&quot;</p>\n\n<p>I was cut off by a noise coming from outside.</p>\n\n<p>&quot;It is just your imagination, it is just your imagination, there is noth-&quot;</p>\n\n<p>Something hard and sharp scratched alongside the outside of the sturdy, metal door of the lighthouse. I froze up. I held my breath. Each second turned into an eternity. </p>\n\n<p>Once I was sure that everything was quiet I dared to breathe again.</p>\n\n<p>Right at this moment, something heavy hit the door and I could hear one of the things roaring from outside. It was only a few meters away from me! I rummaged through the shelf to find the oil.</p>\n\n<p>&quot;Where the fuck is it? It must be here somewhere!&quot;</p>\n\n<p>Fear had overtaken me completely. I looked at the shelf but wasn&#39;t seeing anything. My eyes wandered from left to right and then to the left again. There was nothing there.</p>\n\n<p>My eyes grew wide and I winced, as another bang hit the door. Something was trying to tear its way through the metal. At that moment I saw the bottle of oil, but as I picked it up, it slipped right through my fingers. I cursed again, then picked it up once more. Then I started to purr the oil into the generator. Sweat dripped from my forehead. My body was shaking. I spilled more than half of the oil.</p>\n\n<p>Would the light even do something? The flare worked but if those things are already out of the water? What if...</p>\n\n<p>I didn&#39;t get to finish the thought. The banging and tearing at the lighthouse door stopped. Moments later I saw the doorknob turn.</p>\n\n<p>The image of the old man locking the door each morning appeared in my mind. He held the keys in his hand, put it into the keyhole and turned it twice, giving me a nod. &quot;You never know who shows up out here.&quot;</p>\n\n<p>I hadn&#39;t locked the door. I hadn&#39;t locked it in weeks.</p>\n\n<p>I stood there, but couldn&#39;t move as I heard the door open. For a moment slim, feminine fingers pushed themselves between doorframe and door. Then reality replaced them and a claw-like hand ripped the door open.</p>\n\n<p>Right at that moment, the bloated body of one of the fishy abominations appeared outside the door. In the dark of the night, I wasn&#39;t sure what I was seeing. There were too many appendages. It looked to me as if it was a grown together mess of various creatures. I saw legs and arms, but also fins and gills. The body itself was long and much more muscular than I&#39;d thought.</p>\n\n<p>I tried to start the generator again, but nothing happened. The monstrosity roared at me, this time so loud that my ears were ringing. I saw its dead eyes focus on me. The jaws started to open and close in anticipation before it slithered forward. Then it started to squeeze its body through the door.</p>\n\n<p>As the massive body came closer and closer, I tried the generator again and again. Long scaly appendages shot forward, clinging to the door of the generator room. As it dragged itself forward, inch by inch, the generator finally rattled to life. </p>\n\n<p>With it, the lights of the room and in the stairway flashed to life. The abomination roared and screamed up in pain. It raged and yanked itself backward to escape the light.</p>\n\n<p>The stare of the empty, fishy eyes rested on me the whole time. They promised that the thing would return one day and it would drag me down into the dark depths it had come from.</p>\n\n<p>Then the creature had all but vanished.</p>\n\n<p>I threw the door shut and locked it. Then, for the remainder of the night, I sat shivering in the room at the top of the lighthouse. I sat there, covered in a blanket, shaking and scanning the sea. Thankfully I saw nothing.</p>\n\n<p>Even at dawn, I didn&#39;t move. After more than an hour, I started to go through the old man&#39;s routine. It wasn&#39;t my sense of duty, neither was it diligence. It was fear. I pushed the moment when I&#39;d leave the lighthouse off as far as possible. In my mind, the thing was still out there, waiting for me. </p>\n\n<p>For a long time, I contemplated if I should stay inside.</p>\n\n<p>After I had checked the outside from the top more than half a dozen times, I decided to leave. By now it was past eight in the morning and the sun had been up for more than three hours.</p>\n\n<p>Everything was normal outside. Nothing reminded me of the abomination I had seen.</p>\n\n<p>On my way home, I noticed a commotion near the beach. As I got closer, I saw that the police was there as well.</p>\n\n<p>I pushed myself through the crowd to see what had happened. The sand in front of me was splattered with blood. In the middle of it was a covered up body. </p>\n\n<p>&quot;He must&#39;ve been torn to pieces,&quot; I heard one of the police officers say.</p>\n\n<p>Then I noticed a flare gun lying next to the corpse.</p>\n\n<p>&quot;Who?! Who is it?&quot; I yelled towards the police.</p>\n\n<p>At first they ignored me, but finally, one of them came towards me. He recognized me as the new lighthouse keeper and took me aside. The name he told me made my heart drop. It was Jeremy Wallace, the old man.</p>\n\n<p>I later found out that, even though he had retired as the lighthouse keeper, he still went out to the beach each night. After he gave up his job, he had still continued to keep watch.</p>\n\n<p>He must have been concerned when the lamp of the lighthouse turned off and didn&#39;t come back on. Once he saw the beasts closing in on the beach, he must have used the flare gun to ward them off.</p>\n\n<p>Once the light of the flare died, and the light of the lamp didn&#39;t return, those beasts must have come after him.</p>\n\n<p>I remembered the limp. There was no way he could have gotten away. If I&#39;d only turned on the light earlier.</p>\n\n<p>I thought back to the flare. Without it, I&#39;d never even recognized what danger I was in. These beasts might have very well entered the lighthouse and torn me to pieces. Not only that, they might have gone for the town as well.</p>\n\n<p>Tears of frustration came to my eyes. While I had ignored my duty, it had been this old man who had saved us all. And he had done it at the cost of his life.</p>\n\n<p>After that day I often catch myself thinking of the old man. Now I know what is out there. I never sleep or take my job lightly anymore. I don&#39;t bring anything to read. Instead, I am busy making sure the lighthouse is in prime condition. </p>\n\n<p>Many times now, I am using the stove to heat up grog. At first, I drank it only to keep the memory of those days with the old man alive. But in the end, he was right. <a href=\"https://www.facebook.com/r.rehnwriter/\">I&#39;d get used to it.</a></p>\n</div>\n","author":"Rakushasu"}