{"rank":"6","title":"Overactive Imagination or Demon?","id":"8mbitm","url":"/r/nosleep/comments/8mbitm/overactive_imagination_or_demon/","time":"1527354601000","body":"<div class=\"md\"><p>I was going on an overnight residential trip with my school. We were all 3rd graders. At the time, I was considered the kid that the others would follow/believe; I don&#39;t know if my friends were just extra gullible or if they looked up to me (probably the latter as I doubt they would look up to me haha). This was a true childhood experience. My personal views at the moment are that I was likely just paranoid.</p>\n\n<p>We were all in the outdoor area, this particular part of the residential was very grassy and had a large amount of hills. However, one structure stood out to me. It was a small wooden box labelled something like &quot;Seb&#39;s Shed&quot;. I pointed it out to my friends and we all joked about some kinda ghost. Deep inside, I wasn&#39;t joking; it was to my belief that &#39;Seb&#39; was a ghost. Whenever I was near that shed I felt uneasy. One factor that really makes it seem creepier is how the general area was surrounded by legends and mythology.</p>\n\n<p>Additionally, we went on a mini field-trip during the residential through a creepy forest. Of course this doesn&#39;t sound scary but paired with Seb&#39;s Shed, this really creeped little-me out. Also, we had to walk up the &quot;Witch&#39;s Staircase&quot;. </p>\n\n<p>I also seemed to have a lot of bad luck during that trip, my lucky teddy that I took everywhere with me vanished (it was later found outside on the floor despite there being no way of it getting there), my social anxiety peaked for no logical reason, etc.</p>\n\n<p>To top it off, whenever I think back to this journey I get a memory in my head of a bald-headed man with white skin. By white, I don&#39;t mean natural human white, I mean colorless blank white. I don&#39;t recall ever seeing this man, but I&#39;m convinced he is Seb. Perhaps I did see him; this was many years ago after all but I still believe this is a supernatural memory. For a detailed visualisation: he has blank, smooth skin and two red, almost hay fever-affected eyes. He wears a suit with no shirt or tie and is bald. He has an average body build. I&#39;m not sure if this is linked, but my TV started glitching when I started writing about this memory of Seb. In fact, when it comes to it, I remember having a childhood fear of a tall man with colorless skin. I&#39;ve even seen something like this before in real life. He was stood next to my bed seconds before vanishing. </p>\n\n<p>In addition, I remember seeing &#39;Seb&#39; stood by my bedroom door, this time wearing a white suit instead of a black one. </p>\n\n<p>Guardian angel, ghost haunting the residential site or just an overactive imagination? </p>\n\n<p>I usually don&#39;t believe in the paranormal but I can&#39;t think of any decent explanations for all of these coincidences at once. To this day, I have absolutely no idea who Seb is; and I doubt I ever will.....</p>\n</div>\n","author":"thecomputerboy"}