{"rank":"47","title":"My Date Has Sent Another Snap","id":"8mbj6q","url":"/r/nosleep/comments/8mbj6q/my_date_has_sent_another_snap/","time":"1527354698000","body":"<div class=\"md\"><p>I’m an awesome dog owner. A few days ago I took my Rottweiler for a walk. We strolled through the local bushlands (I live in Australia) and my dog, whose name was Bob, loved to meet other dogs. The bushwalk was populated by other dog owners. Normally we’d go for a quiet stroll in the afternoon, a little after work. </p>\n\n<p>On my way through the bush, Bob met a dog named Sally. She was a big bitch. I’m not going to suggest my dog liked thicker women. The two immediately became best friends. Bob and Sally spent enough time together that it could’ve been considered a date. The owner was a young woman in tight yoga pants. So we talked and connected instantly. </p>\n\n<p>“Oh, you have church Sunday. Well, how about Saturday instead?” </p>\n\n<p>“Tomorrow?” She laughed. “Why not. I’ll give you my Snapchat.”</p>\n\n<p>We arranged a date (Yeah – over Snapchat). We’d have a doggy sort of date in the city. Go for a relaxing stroll. Grab some food and enjoy one another’s company. Our dogs adored the city and we visited a beautiful park with cups of coffee. The day was beautiful. So was Janet. We let our dogs loose for a bit while we relaxed beside the dog park. </p>\n\n<p>Janet told me she was attending University. She was passionate about photography and looking after children. Another thing I loved. What inspired my desire for photography was a camera; an early birthday present from my mother. Janet, however, discovered her hidden passion through Snapchat. Snapchat. We added a picture of us together to her story. Must admit, we looked like one happy couple. Overall it was a nice date. </p>\n\n<p>We collected our dogs from the park. I had my leash ready and so did Janet. Sally ran up to Janet with slobber all over her mouth. Bob was absent, so I whistled and called his name. No answer, no dog. I yelled his name only louder. “That’s strange,” added Janet. It got dark and I couldn’t find him anywhere. </p>\n\n<p>Bob helped me through emotional despair. I haven’t told Janet about my previous relationship. I broke up with an Ex four weeks ago. Since the terrible breakup over email (of all other forms of communication) I had been consistent in leaving the house after work. Everything about the house reminded me of my ex. Janet, on the other hand, behaved differently. She was a breath of fresh air in my life. Unlike my ex, Janet smiled more often and listened to my stories. </p>\n\n<p>The next day arrived. After work, I jumped into my car and drove out into the city. Sundown arrived and I stood out beside the empty dog park. I called and shouted Bob’s name. “Bob, here boy!” He loved bones so I dropped one below my feet. At work, I printed a dozen sheets with details about Bob and I pinned them around the area. I called his name, picked up the bone and headed home for the night with little luck. One flyer left. The picture of happy Bob made me wonder where he must’ve been hiding. The days are only getting colder and wetter.</p>\n\n<p>Two days after the date with Janet I received a snap. It was getting later into the night. I was playing fortnight with the boys when my phone buzzed. A red snap from Janet243. I held off the snap until I died in the game. Then I checked my phone and noticed it was a photo of her dog. The caption ‘I think she wants to visit Bob’. Her soft voice giggled in my head as I read the snap. Then a second snap arrived right after the first image closed. The next photo was of her face as she looked away from the camera. </p>\n\n<p>I believe Janet was a natural when it came to smiling. In this picture her jaw had dropped a little, her eyes gripped elsewhere and the caption, ‘Dog’s at the window.’ My friends over the headset demanded my attention, my focus to pull our squad through the upcoming match. A third snap? I muted my friends as they all started to mock my romantic love for a girl. The third snap was pointed to a dark window and my dog was looking inside with a doggish-smile and his tongue out. </p>\n\n<p>I laughed in my next snap and videoed my reaction. It ended with a view of my excited expression. As I hit send, a fourth snap, popped onto my screen. I tapped it and the snap was of two dogs. One laid happily over a lime green rug and the other stood in the background with an object gripped in his mouth. The snap automatically flicked to the next, only this one, the dog in the blurry distance had its head pointed to the camera. ‘</p>\n\n<p>Then the next snap automatically flipped onto the screen. The dog, now stepping into the light held a strong, familiar appearance. It couldn’t be. This awful joke, for whatever reason poised my smile. I pursued the idea that maybe she was dog sitting someone else’s pet who looked like Bob. She did that often. The snaps soon played like a very slow and unsteady video. Image by image. The dog stepped closer while Sally held her tongue out and laid in a comfortable position on the rug. The snaps wouldn’t stop. </p>\n\n<p>The dog got close and personal to the camera. A lot faster in the end. It took my brain an unhealthy amount of time to process each image as it popped onto my screen. God – The dog’s mouth gripped and buried its teeth into a bone. The dog, who looked like Bob, I swore smiled at the camera. I exited the app and dialed her number. Her phone buzzed. </p>\n\n<p>“Hello?” Answered a voice. </p>\n\n<p>“Yeah is everything alright?” My voice peaked.</p>\n\n<p>“Yeah-why? Who is this?” </p>\n\n<p>I explained my name. I repeated a few details about our date in the city. I even described Bob and the time he stole her ice cream. Our dogs shared the stolen ice cream and – no, she continued to ask questions. Why. How. When. All over again. And then she hung up. I turned off the game and felt a little ill in my stomach. With that, I headed to bed with a sense of guilt.</p>\n\n<p>I rolled and moved in my bed. For half an hour I replayed the snaps in my head. What it must’ve meant. I went so far as to check the most recent messages on the app. It was Janet243. My phone buzzed - another notification from Janet243. The notification arrived just as I flicked off my phone. A red snap. I thought to wait a few minutes. Give any prankster the false idea that I had better things to do. No, I opened it as soon as possible. </p>\n\n<p>A picture of a road somewhere down a dark street. In front of the blurry image was a caption in glowing, red letters - ‘Are you awake?’ I took a photo of a black screen and replied a yes. The second snap pictured a house and a front door. The caption, ‘I haven’t got anybody to talk to’ and automatically the next image appeared. Next, I recognized my front door and a window made of glass. The glass, it reflected a light, as well as hind legs and a tail. </p>\n\n<p>I’d send a series of messages to her phone. I asked where she was if she was feeling okay and almost closing her off completely. Images of my house continued to play on my phone. No matter the question I’d ask, I’d receive a rough reply. ‘I want to grab a bite,’ and ‘Good boy’. On one occasion, somewhere between the storms of blurry images, my phone rang and I answered.  </p>\n\n<p>“Janet, where are you?” </p>\n\n<p>“Hey, we should go out again. When are you free?”</p>\n\n<p>I looked around my bedroom, then at the time, “Now – I guess. Are you okay?” </p>\n\n<p>“I’m fine. I found Bob. Sally wants to go on a date with him.” </p>\n\n<p>“I have work tomorrow –“</p>\n\n<p>“Please? I want you.”</p>\n\n<p>I sighed. “Sure, I’ll be over at your place in a few?” </p>\n\n<p>“Good boy! See you soon,” and the phone hung up. </p>\n\n<p>As I got dressed in my room, I also called the police. I explained my situation to the woman over the phone. Online bullying? Was I on drugs? No, Janet or somebody was at my house. I waited forever for the authorities. The snaps had stopped. Deep down I wasn’t ready to leave my bedroom or my property.</p>\n\n<p>The longer I sat in my dark, silent room, the more I felt terrible about my circumstances. Guilt crippled me as the minutes passed. I had given up on getting dressed for Janet’s house, just as the police had given up. Here things truly went dead silent. On my bed I sat alone, trapped in my own home. One more snap. A red Snap. My phone buzzed and I immediately opened it. This one was a photo of my bedroom door. The caption ‘I smell you somewhere,’</p>\n</div>\n","author":"IsaacJMadigan"}