{"rank":"6","title":"On the Way Home","id":"8mbq25","url":"/r/nosleep/comments/8mbq25/on_the_way_home/","time":"1527356412000","body":"<div class=\"md\"><p>This is a true story. I&#39;m not making this up. I&#39;m posting my story to see if anyone knows what happened to me. I fear that this experience could mean I&#39;m in danger or something. If you have any ideas or theories of what this could mean, please let me know in some way. Now for my story.</p>\n\n<p>This happened about a week ago. I was on my school bus, on the way home. I live in an area with pretty low altitude, so when I get to high places, my ears will either ring or get clogged, and/or my nose will start to bleed, and I will always, always, get a headache. Nose bleeding is highly unlikely. It&#39;s only happened to me about 3 times. Well, on this particular day, I got a headache and a nosebleed. I always ride the same path home, so I don&#39;t understand what the problem was. Usually, whenever this happens, it&#39;s a habit of mine to close my eyes. I honestly don&#39;t know why I do this because it doesn&#39;t benefit me in any way, but I guess it&#39;s a way my body is trying to escape or something. But anyway, I shut my eyes. I knew my neighborhood was the next stop, so when the bus stopped, I knew it was time to get off of the bus for home.  I stood up and gently opened my eyes.</p>\n\n<p>I froze. I remember my nose stopped bleeding and the remainder of blood was dried right above my lip. My eyes widened and I couldn&#39;t believe what my eyes were showing me. I looked around at everyone standing up, since most people got off here (it&#39;s a very big neighborhood). What made me so shocked? It was the fact that everybody was transparent with a golden hue around their shapes. It may sound simple enough, but it&#39;s very hard to describe. The strange part was that I could still touch them. I know this because days before this, I was in a talent show, singing. a lower classmen then congratulated me and gestured for a fist bump. I obliged and did so. It seemed normal, like he didn&#39;t notice anything. When I got off, I looked at everyone&#39;s cars, which I never seemed to notice before. They seemed different, however, as if I had a picture in my mind of what it was supposed to be. I wanted to say something, but I assumed this was a lucid dream, which would be weird because I&#39;ve never experienced one before. Once I got home, something seemed off. The cars were ones I&#39;ve never seen before. My porch has always been green, even painted different shades of green. But, my porch was a completely different shade. It was yellow. My door was recently painted green. However, It was now an orange-green hue that I don&#39;t know how else to describe.  I gently knocked on the door. </p>\n\n<p>It only took about five seconds for the door to be answered. However, the person who answered was someone I didn&#39;t recognized. It was a woman with chestnut brown hair, in a very sophisticated short hairstyle. She then had to be at least 5&#39;7.  She was wearing black everything. Black shirt, black suit jacket, black skirt, black tights, black heels. The only thing that wasn&#39;t black was her golden jewelry and the green jewel in both of  her earrings. She then said, Aw, hi there!&quot;, as if I were a puppy. I then said &quot;Um, hi&quot;, in a hushed voice. She then looked very confused. &quot;Is something the matter?&quot;, she asked. &quot;Um, do you know these people?&quot;. I then stated the names of my family members. She then got a upset look on her face. &quot;Oh no...&quot; she said quietly. &quot;What?&quot;, I asked. She then said, sadly and even more quietly, &quot;You must be Maya, aren&#39;t you?&quot;.  I was flushed with a wave of relief. &quot;Yes! How did you know that I was-&quot;. I stopped myself. I noticed she started to tear up. She stepped closer and crotched down to my level (I&#39;m only 5&#39;4). She then said in almost a whisper, &quot;I&#39;m so sorry...they&#39;re dead...&quot; At this moment, I froze. How could this happen? Everything was fine this morning. This has to be a prank. Is was I thought. Then, at this moment, I knew this was real. I don&#39;t know why, I just knew. She then wrapped her arms around me. She was on her knees, completely sobbing, actually getting my shoulder wet with tears. &quot;They got in a plane crash. The neighbors said they heard your mom scream before getting everyone in the car. They said she screamed, &#39;This is all Maya&#39;s fault!&#39;&quot;. </p>\n\n<p>I was completely shaken from what I was hearing, and it was apparently obvious that she was, too. She kept on whispering, &quot;I&#39;m so sorry&quot; , while holding onto me tighter as she said this. How could this all happen in the span of one day? How was this all my fault? All I wanted to do at that moment was cry. So I did. I broke down in tears, leaning on the woman. I tightly shut my eyes. I lost track of time. But I knew it was a while. While my eyes were shut, I fell over onto my doormat. My eyes then opened quickly, tears still filling them and running down my cheeks. I then sprung up. My porch and my door were green again. I looked to my driveway. There were no cars. That made me worry a little, but I then stepped inside my house .Both my dogs were missing, but my cat was in the kitchen. Then, my nose began to bleed once more. I tried to distract myself by watching YouTube. At around 6:00 pm, my family came home along with my dogs. I was so relieved. The only person missing was my stepdad, which I found out was at work. </p>\n\n<p>As I said at the beginning, I have no idea what that was or what happened. If you know or have a theory of what happened to me, please let me know. I have and will continue to do research and see if I can find anything remotely similar. Thank you for reading my story. I will update everyone if anything else strange happens ( There have already been a few). I hope this isn&#39;t supposed to be a message of death or misfortune. I have a theory this has to do with me alone. I very much believe in the paranormal and a lot of conspiracies. Hopefully, there is a logical explanation out there, waiting for me.</p>\n</div>\n","author":"MayaIsabelle05"}