{"rank":"3035","title":"There’s something wrong with the mural in my son’s bedroom","id":"8mbwoa","url":"/r/nosleep/comments/8mbwoa/theres_something_wrong_with_the_mural_in_my_sons/","time":"1527357993000","body":"<div class=\"md\"><p>My husband, Seth, has a photographic memory.</p>\n\n<p>So when he said something was off with the jungle mural in the nursery, I should’ve believed him. “Didn’t the orangutan have a baby in her arms?” he said, eyebrows knotted. “I could’ve sworn…”</p>\n\n<p>I looked from the ape’s empty arms, to the toucans above, to the tigers below. They seemed to be intently feeding on something.</p>\n\n<p>“I think it was always this way,” I said, sliding the crib against the wall. “Wasn’t it?”</p>\n\n<p>He sighed loudly – his typical sign of annoyance. “No, really look at it, Brit. I’m <em>positive</em> she had a baby in her arms, when we came through the house a week ago.”</p>\n\n<p>I walked over and stared at the mural. It was beautiful – one of the reasons we bought this house. Long branches of rubber trees, thick canopies of verdant leaves, strangler figs roping and tangling around thick trunks. Tigers down below in the grass, lemurs poking through the trees, a toucan flying near the ceiling.</p>\n\n<p>And the orangutan.</p>\n\n<p>She sat in a tree, right above the crib, orange tufts of hair contrasting sharply with the green around her. She was looking down at the floor, and… there was something profoundly sad in her black, sparkling eyes.</p>\n\n<p>I shrugged and headed towards the door. “Hey, I’m going to get some water. Want anything?”</p>\n\n<p>“Coke would be great.”</p>\n\n<p>I thumped down the stairs. Our babysitter, Kellie, was playing with Kyle on the carpet. As soon as he saw me, he cracked a toothy smile. “Hey buddy,” I said, giving him a little hug.</p>\n\n<p>He cooed back at me, and I smiled.</p>\n\n<p>When I returned, Seth was still staring at the orangutan. “She’s beautiful, isn’t she?”</p>\n\n<p>I laughed, and nudged his shoulder. “Should I be jealous?”</p>\n\n<p>He smiled, shaking his head, and cracked open the can of coke.</p>\n\n<p>He was right, though – she was beautiful, with her sparkling, black eyes looking right at us.</p>\n\n<p>---</p>\n\n<p>The first night was rough. At 3 am, Kyle’s piercing screams came through the wall:</p>\n\n<p><em>Waaaaaaahhhh.</em></p>\n\n<p>I heaved myself out of bed and walked into the nursery. “Okay, Kyle,” I said, through a fog of sleep.</p>\n\n<p><em>Waaaaaaaaaaaaaaaaaaaaahhhh!</em></p>\n\n<p>I clumsily scooped the formula powder into a bottle. “It’s okay, Kyle! Momma’s coming!”</p>\n\n<p><em>Waaaaaa – aaaaa – aaaahhh!</em></p>\n\n<p>I hoisted him up and sat down in the rocking chair.</p>\n\n<p>As he grew quiet, holding the bottle with his little hands, I stared at the mural. In the dark shadows of the nursery, it looked… almost a bit scary. The tigers looked menacing, their eyes glowing steadily in the darkness; the lemurs looked like animal versions of clowns, hiding their faces behind painted masks.</p>\n\n<p>And the orangutan –</p>\n\n<p>She was looking down at the crib, her left arm outstretched towards it.</p>\n\n<p><em>Huh,</em> I thought. <em>That’s weird. I could’ve sworn…</em></p>\n\n<p>---</p>\n\n<p>The next morning, in the bright sunlight of day, the mural looked beautiful again. And the orangutan was back to her normal place, looking straight out at me, her arms latched onto the tree. <em>Ha, I must’ve imagined it,</em> I thought to myself. <em>I was half-asleep, after all.</em></p>\n\n<p>That night, I hoped and prayed for better sleep. But I didn’t get it; at 2 am, I shot out of bed, woken by Kyle’s cries.</p>\n\n<p>Or at least, so I thought. When I actually stopped to listen, I didn’t hear him crying.</p>\n\n<p>I heard him cooing.</p>\n\n<p><em>Better check on him anyway,</em> I thought. I lifted myself out of bed and started towards the door.</p>\n\n<p>But then I realized –</p>\n\n<p>There was another noise, mingled with his coos. An <em>oo oo oo</em> sound, in short, soft bursts. Curious, I stepped across the hall, and swung the door of the nursery open.</p>\n\n<p>In the gray shadows, there was a fluttering of movement. In my sleep-addled state of mind, I couldn’t quite interpret what it was. I curiously stepped towards the crib.</p>\n\n<p>“Kyle, what are you –”</p>\n\n<p>My breath caught in my throat.</p>\n\n<p>The crib was empty.</p>\n\n<p>“Kyle?” My voice grew from a hushed whisper to a piercing shriek. “Kyle! Kyle!”</p>\n\n<p>But then I stopped.</p>\n\n<p>Something on the wall… was terribly different.</p>\n\n<p>The orangutan was smiling, looking proudly at something in her arms. Something pink and pale, painted with meticulous detail. I squinted, trying to make sense of it in the shadows.</p>\n\n<p><em>No.</em></p>\n\n<p>It was a baby. With a tuft of black hair, shining brown eyes, and a toothy grin.</p>\n\n<p><a href=\"http://blair-daniels.com\">Kyle.</a></p>\n</div>\n","author":"BlairDaniels"}