{"rank":"19","title":"They Came From the Sky and Stayed in the Sea Part 4","id":"8mc2vw","url":"/r/nosleep/comments/8mc2vw/they_came_from_the_sky_and_stayed_in_the_sea_part/","time":"1527359501000","body":"<div class=\"md\"><p><a href=\"https://www.reddit.com/r/nosleep/comments/8ha5ac/they_came_from_the_sky_and_stayed_in_the_sea/\">Part 1</a></p>\n\n<p><a href=\"https://www.reddit.com/r/nosleep/comments/8iz8dg/they_came_from_the_sky_and_stayed_in_the_sea_part/\">Part 2</a></p>\n\n<p><a href=\"https://www.reddit.com/r/nosleep/comments/8lealv/they_came_from_the_sky_and_stayed_in_the_sea_part/\">Part 3</a></p>\n\n<p>Seeing the cove in the daylight caused a strange sensation. It was exactly as I had dreamt it but lacked the horrid sea structure that I watched rise from the ocean. I knew that something terrible had happened there and I could feel a melancholy air about the place but it just didn’t look as menacing with the sun shining high above it. It was almost like looking at a picture of a crime scene after all traces of the crime had been cleaned up; you know it is a tortured place and something incredibly evil happened there but at the same time, it just doesn’t appear evil in itself. </p>\n\n<p>With no sign of Sophia anywhere on the beach or standing on either cliff, we opted to leave and come back at night. I assumed that because the dreams always took place under a night sky, that would be our best bet at seeing anything happen or hopefully coming across my aunt if she was here somewhere. It was lucky for us that night wouldn’t take too long to arrive, either, seeing as we had headed to the cove as soon as Chuck had gotten into town just after noon. </p>\n\n<p>Under the cover of darkness, around eleven, we almost missed the turn for the cove, as it is more of a grassy path tucked amidst trees with only worn tracks from tires being the indication that it actually lead anywhere. After following the makeshift road a second time, we agreed that parking in the trees and not on the beach, as we had done earlier, would be the best choice. In case anyone showed up, hopefully Sophia, we didn’t want to be seen in case that would avert her course and cause her to avoid the cove entirely that night. Chuck and I exited the car and walked fully onto the beach, looking for any sign of anyone but when we found none, we both took a seat on the hood of the vehicle. </p>\n\n<p>Almost an hour passed without any word. We both tried to have conversations at some point about meaningless things but found neither one of us could hold a topic for longer than a couple of minutes. The sound of a branch snapping caught both of our attention and we jumped off of the hood, spinning around to look behind the car, the direction the sound had come from. There, in the waxing moonlight, stood Sophia, her hands held up with her palms facing us as if to indicate that she meant no harm.</p>\n\n<p>“Sophia?” I asked, a bit more incredulously than I expected.</p>\n\n<p>Her hands immediately dropped and she continued to approach us as she spoke, “What are you doing here?”</p>\n\n<p>“We came to find you. When you just took off without a word, we got worried,” I answered.</p>\n\n<p>“We? Who’s this?” She pointed at Chuck.</p>\n\n<p>“This is Chuck, my husband. And yes, we. Mom called me and couldn’t understand why you had just left,” I said.</p>\n\n<p>She was now standing only a few feet from me and I could see her eyes widen and horror cross her face, “Is she here with you?”</p>\n\n<p>“No,” I shook my head with a sigh. “I didn’t even tell her that we were coming down here or thought that you might be here.”</p>\n\n<p>She visibly relaxed and nodded then reached for the door handle of the back passenger door. When neither Chuck or I made a move, she motioned with her hand for us to all get in. We obliged and once we shut the door, she began.</p>\n\n<p>“Get turned around. It isn’t safe here. I’ll show you where we can go.”</p>\n\n<p>Without a word, Chuck started the car and pulled onto the beach to turn around. We followed her directions and found a more overgrown path that led up to the left cliff, the one she was always on in her and my own dreams. She indicated a place for us to park and advised Chuck to get the car turned around first, in case we needed to get out of there quickly. I have to admit, at that point, I was beginning to think she was just delusional and really needed to be back in a mental institution. The main thing that kept me playing along, though, was the fact that I had started having those horrifying dreams. I think for Chuck, he had decided to just follow my lead. Every now and then I would catch a glimpse of his expression and it made me want to scream. I knew that expression, it was the one he always had when he thought something didn’t make sense and was completely unnecessary or a waste of time. I just tried to remind myself how thankful I was that he was here, especially knowing that he didn’t want to be.</p>\n\n<p>The three of us exited the car after the engine was shut off and I followed Sophia to the edge of the rocky wall. She lied down on her stomach and motioned for us to do the same. After lying there, with Sophia on my left and Chuck on my right, for a few minutes, Sophia pointed to the water below us.</p>\n\n<p>“Can you see it? How the water gets darker there?” She asked.</p>\n\n<p>“Isn’t that because it’s deeper?” Chuck responded with his own question. </p>\n\n<p>“Yes,” Sophia’s voice held a hint of sadness. “That’s where it hit. That’s the crater part of Crater Look Cove. That’s how it got its original name.”</p>\n\n<p>“How deep does it go?” I asked, noticing that the water seemed to lighten closer to where it met the open ocean.</p>\n\n<p>“I don’t know. Maybe someone knows but I don’t,” was her response.</p>\n\n<p>We sat in silence for a while longer. When Chuck checked his watch and relayed that it was half past midnight, she shushed him hurriedly. I looked to her with a questioning expression. </p>\n\n<p>“It’ll be starting soon,” she whispered so low that I wasn’t sure Chuck could even hear her. I turned my attention back to the beach below and waited. </p>\n\n<p>“What will be starting?” I asked.</p>\n\n<p>“They come here every night. They have for years, maybe even centuries. Just wait and you’ll see,” she answered.</p>\n\n<p>Another few minutes past that seemed to drag on in the same manner as the last few minutes of a workday. Then, finally, something happened. We heard the drumbeat from the distance before we saw anyone approach the beach itself. It was the same beat that I had heard over and over in my dreams. I scanned the treeline until I saw a figure with a drum strapped to it emerge from between the leaves. I was sure it was a male, due to the size, but it was difficult to tell much more than that due to the distance and shadows that were still covering his body as he approached the moonlight. He beat the drum steadily with both of his hands and was soon joined by four others doing the same. </p>\n\n<p>The drummers stopped a few short feet from the water’s edge and stood motionless, save for the movement of their hands on the instruments. They were soon joined by more figures, male and female, that broke through the trees silently. They all took their places amongst the musicians and the entire group stood there, facing the entrance of the cove. After they were all in their places, a final couple, a man and woman, walked onto the beach and stood at the back of the group. Instead of staring at the sea, the two stopped and faced one another. Overall, I counted twenty-three people, including the drummers. </p>\n\n<p>First, the male of the couple handed the female a horn that reminded me of a Viking horn used to make calls during battles. The female then handed the male a baton or rod of some sort. It looked like it was made of the same material as the coral from my dreams and was half the length of his body. The drumbeat stopped and in tandem, the woman blew through the horn, causing a loud and low sound to echo out, while the man stamped the rod vertically into the sand three times. When the echo was the only thing left to be heard and the woman had stopped blowing the horn, the drums began to sound again. </p>\n\n<p>Sophia nudged me and pointed towards the sea. When I saw the water begin its familiar bubbling, I did the same with Chuck and he nodded, having already noticed the change. Everyone, the three of us hidden on the cliff and the group down on the beach, watched as the water churned and roiled quicker until the nightmarish mass of decaying, volcanic looking coral, rose to the surface. I felt my breath catch in my chest and reached beside me to squeeze Chuck’s hand. </p>\n\n<p>The first of the creatures I noticed were strange things that appeared to be a cross between a snake and a newt, having the body one would expect of a newt but the length of a large boa constrictor. Next, unlike in the dreams, I saw the shadowy beings that shifted forms easily. In person, their amorphous bodies looked even more like they contained dust from the farthest reaches of space than they had in my dreams. Not only that, but now that I saw them with my own eyes, I could tell when I squinted that they did, in fact, have something more tangible to them. It was deep within the swirling dust but I was able to faintly make out a shape of what I could only compare to a heart. Unlike the rest of their bodies that were a constant ebb and flow of tendrils and blobs, the heart-shaped thing stayed unchanged and I thought I could detect a single point on it that flickered barely brighter than the rest of their starry bodies. </p>\n\n<p>Various masses of them snaked through the holes in the structure, pooled on the platforms, and reached and contracted with long tendrils of darkness that was as thick as smoke from a raging forest fire. I’m not sure if it was the sight of these evil entities or the smell of rotting fish and decaying flesh that pushed me to clasp my hand over my mouth in an attempt to keep the contents of my stomach from joining us there on the ledge. </p>\n\n<p>I watched as more unnatural creatures began to appear from the recesses of the dark formation, each as hideous, if not more, than the one I noticed before it. I looked towards the sea beyond it and saw that the water appeared darker than it had just a few minutes before; this thing was even more extensive than I could imagine or tell and not all of it seemed as if it would breach the surface. The horn sounded once more in a short burst and I turned my head to look back at the people on the beach.</p>\n\n<p>The couple that had been facing one another was now looking out at the water, just like their cohorts. Something seemed to shift in their group and I followed their gaze back to the water, where I realized what they had seen and what was approaching them. It was strange to see the scene unfold from above the sand, as I was used to being the one on the beach in my dreams. I watched with a strange calmness as the creature from my nightmare lifted its head from the water and continued to make its way to the group. </p>\n\n<p>“That’s it,” I whispered breathlessly to Chuck. He turned his head to look at me with complete horror and I could tell in that instant that he believed everything I had told him and understood why I had become so scared to go to sleep. </p>\n\n<p>Unlike in my dream, the creature this time was accompanied by some of the astral amoebas. With their constantly shifting bodies, if you could even call them that, it was difficult to tell just how many had left their home to join the monster swimming through the water. Just as they reached water shallow enough for the creature to walk on, the drums ceased and the group parted and moved, altering their positions until only four of them stood near the waterline. The rest of them took to standing about ten feet away, the man and woman, who seemed to be the leaders or something of the sort, changed from standing behind everyone to standing between the group and the few next to the water. They all watched stoically as the starry dust stretched out and raced suddenly across the top of the water, beating their companion to the people standing there, waiting. Their forms lengthened and twisted as they separated into four different beings and entered the humans in the same manner Sophia had described in her dream. We watched from our safe little edge as the smoke-like things prodded and then pushed their way into every orifice imaginable. </p>\n\n<p>From Sophia’s recounting in her journal and my own dreams, I didn’t know what to expect next. I assumed that the humans blacked out and lost consciousness but their bodies remained upright, waiting for the monstrosity to finish its watery trek. Once it had completely left the water, it stood before one of the humans inhabited by the dark being and stared at him for a moment. It snorted and the man fell to his knees, then his side, as the demonic cloud left his body. The oozing amalgamation of animals moved onto the next person, a female, and did the same. When it snorted again, she, too, fell to the ground, the dark being expelling from her body. It did this with the final two and then stood still, looking at the rest of the group that still stood a short distance away. </p>\n\n<p>And then it sounded the call, the very same screeching groan that was pulled from history itself. I felt myself wince and squeeze Chuck’s hand even harder than I already had been. It must have been too hard because he flexed his hand and shook mine off before opening and closing his fist. I mouthed a ‘sorry’ to him and he just shook his head with a clench of his jaw. I glanced at Sophia before looking back down. She didn’t seem to notice we were even still there, as she seemed to be completely focused, her eyes transfixed to the beach and the creature that was issuing its cry. </p>\n\n<p>When I looked back down, the animal had stopped for a moment and while the echo resounded, bouncing off the cliffs on either side of it, its body turned to face the water once more. It didn’t leave or enter the ocean, though. Instead, it threw its head back, the stocky neck stretching and skin splitting open to offer up more oily liquid, and renewed its holler. It held the tone for an indeterminate amount of time; all I could be sure of was that no living creature should have been able to keep a call going for that long. </p>\n\n<p>In answer, the water between the coral and the sand began to displace and I saw what the creature had been calling for. From the crater of unknown depth, a gigantic being began to rise. It rose from the water just as an ancient and massive god would rise from the deepest, darkest pages of a Lovecraftian tale. If I had been able to breathe before, I felt as if I couldn’t anymore in that moment. </p>\n\n<p>More massive than one could imagine, a large head broke the surface and broad shoulders rapidly followed, dispelling the water that had previously covered them. Its head was that of a shark, with two dark eyes set on either side and a mouth that sat slightly open to show rows of teeth that appeared oddly blunt. They weren’t flat by any means but were more akin to knives that had been dulled by years of use without sharpening. The snout didn’t end at a point, either, but ended rather abruptly, falling shorter than a typical Great White’s, although the size of the creature resembled something much larger and older than a Great White Shark. Stretching out languidly from its shoulders were squid-like tentacles, four or five, maybe six, to an arm. They were in constant motion, making it difficult to tell just what the number was. The way they moved and curled made me wonder if this thing had been asleep for a while.</p>\n\n<p>The beach monstrosity, now diminutive in comparison, then did something that I don’t think any of us expected. It looked up to the cliff where we hid. </p>\n\n<p>The beast, still more in the ocean than in the salty air, turned its attention to follow the indication set forth by the one who called it forth. In only a second, we knew that we had been found. I have no idea how the deer-moose-canine being knew we were there, but not only did it know, it had picked us for something. A hand reached out and groped towards the rocky edge. In line with the mismatched creature on the beach, the titanic hand that raised from the sea was more of an eagle’s talon than any humanoid or even primatial form. The three of us leapt to our feet and turned to the trees. As we began darting away from the ocean view, I heard Sophia yell at us to run.</p>\n\n<p>Chuck and I bounded through the forest, tripping over branches and doing our best not to fall down in the process of getting to the car. Thankfully it wasn’t too far and we made it less than a minute. When we reached the vehicle, I slammed my hands on the trunk to steady myself and turned back to tell Sophia to get in, except she was nowhere to be seen. </p>\n\n<p>“Where?!” I sputtered out, more of a demand than a question, to Chuck. He shrugged and shook his head.</p>\n\n<p>“I don’t know, I thought she was right behind us,” he said through ragged breaths. Looking back now, I’m sure he was as terrified as I was. I looked back in the direction we had come from with wide eyes and horror gripping my spine with icy fingers almost as frigid as the sensation I remember from my nightmares. Without a second thought, I pushed off of the car and raced back to the edge of the cliff.</p>\n\n<p>“Sophia!” I cried when I saw her. She stood, teetering on the edge of the rocky face, staring at the thing from the depths of the crater. The immediate response I received wasn’t from my aunt, though, but rather a long-winded and sad sounding whinny. Without being able to see what made the noise, I instinctively knew that it had come from the mare Sophia and I had both witnessed in our own nightmares. </p>\n\n<p>She turned away from the colossal god-like monster and looked at me, her eyes full of shame, sadness, and yet I also saw the slightest hint of hope. </p>\n\n<p>“You were the girl on the beach,” she said in a calm tone with recognition as if finally getting the answer to an age-old question. “Go, Brooklyn. This is what I was meant to do. It’s okay, but you have to go now. You have to get away.” </p>\n\n<p>I shook my head, tears beginning to collect in my eyes. I made a movement to move towards her and grab for her but strong hands wrapped around my waist and held me back. I looked behind me and saw Chuck there, holding me tight, not allowing me to try to save her. </p>\n\n<p>The thin tip of a tentacle rose up and wrapped around Sophia’s shoulders, gently at first, then gripped her tight as another snaked its way to hold her legs. She was lifted in the air and I watched in abject horror as she and the creature departed, moving backward to the ocean. Chuck’s grip lessened and I tore away from him, rushing to the edge. The mare whinnied again, a tone so full of sorrow that I felt my heart shatter as the sound accompanied my aunt’s departure. She looked at me one last time and gave a small smile before blowing me a kiss and returning her sight to match that of the beast that held her. From her throat, the melodic chant from my dreams began. I’m not even sure she knew what she was saying or what language it was. </p>\n\n<p>As the water quickly covered both Sophia and her captor, Chuck grabbed me once more and began pulling me in the opposite direction. I tried to fight him but as the tears began to expel themselves from my eyes, I felt my strength wane and my willpower fail. He half-dragged me back to the car and pushed me into the passenger seat before running over to take his place behind the wheel.</p>\n\n<p>“We can’t leave her!” I shouted at him as soon as the key was in the ignition.</p>\n\n<p>“We have to!” He shouted back at me with enough force that I could only stare at him, tears streaming from my eyes and shock deeper than anything I knew I could feel settling into my chest. I knew he was right but at that moment, I could only feel fear, heartache, and anger. </p>\n\n<p>Chuck shifted the car into first gear, then second, as he tore through the grassy path to get back to the main road. Once on it, he pushed past the speed limit effortlessly and worked to put as much distance between us and that dreadful cove as possible. In my state of near-catatonic trauma, I didn’t even notice where we were until I realized he was turning off of the highway and headed towards the airport. Even then, I couldn’t bring myself to say anything. </p>\n\n<p>After returning the rental car to the agency inside of the airport, I followed him to the ticket counter. Honestly, most of the night after we left Sophia at Crater Look Cove is mostly a blur. I know we left the airport in Savannah in the early hours of Friday morning and made it back to the mountains of Montana in the afternoon. Upon returning to our apartment, we quickly collapsed into bed without discussion and slept for the rest of the day and night. </p>\n\n<p>Although I woke up a few times throughout that period, I didn’t have any more dreams of the cove or of Sophia or any of the monstrosities we had witnessed. When I woke up in the morning, I felt oddly refreshed and rested for the first time since I read Sophia’s journal of horrifying night terrors. I still don’t have all the answers and I can’t say just what it was that we saw or that took my aunt into the ocean with it. I feel a strange sort of emptiness that only the loss of someone, who is probably the reason I’m still alive, can bring. I do wish I would have been able to know my aunt before she was stolen from us but I try to remind myself that at least she went with a sort of peace in her heart. </p>\n\n<p>Of course, there are so many questions that run through my mind and likely will for a long time to come, maybe even for the rest of my life. Chuck and I have discussed the events a little but neither of us can come up with solid answers to everything. Why did Sophia dream of me so many years ago? What if she had never left the facility? Would I still have inevitably ended up at the cove? Why were those people offering themselves up to the company of demons and evil beings? Are the dreams gone from my sleeping mind for good now? </p>\n\n<p>As many questions as I still have, I can take some comfort in knowing that I can and will answer some of my mom’s questions. We plan on having lunch in the next few days and I am going to fill her in on everything. I’m going to tell her the absolute truth and explain everything I know. Even if she thinks I’m insane, she will have to accept it because I refuse to be institutionalized. I’m hoping that she will be able to tell that I’m not crazy and that it was all real. Even more important to me, though, is the hope that she won’t blame herself or feel overwhelming guilt for her sister spending her life locked away for something true, no matter how unbelievable the logical world thought it to be. </p>\n\n<p>For now, though, I leave you with this: there are things older and more terrifying than even the most savage bear or mountain lion. They live in the shadows of the ocean and maybe even the shadows of the land. Some, I know, came from the sky and stayed in the sea, taking up residence in and around that cove. Beware of ancient places and ancient things. And most of all, I advise you, if you begin to have dreams of unknown events from the world’s past, maybe it’s best you just opt for no sleep.</p>\n</div>\n","author":"boewhiskey"}