{"rank":"1","title":"My Demon","id":"8mccxj","url":"/r/nosleep/comments/8mccxj/my_demon/","time":"1527362073000","body":"<div class=\"md\"><p>This is a real thing that actually happened to me when I was 5 years old. In my room, I always left the bathroom light on and my bedroom door open (I was scared of the dark). I did share a room with my mom. We lived at her moms house because she was in college close by. We shared a bunk bed, Me on top, her on the bottom. I usually woke up in the middle of the night to use the bathroom but this night was different. When I woke up, I sat up and saw a little girl I&#39;ve never seen before. I did have a big sister but she looked nothing like this little girl. The little girl was in the hallway staring at me. I still remember exactly what she looked like. She had on a white night gown with pink dots that came up to about her knees. She had short brown hair that was about shoulder length. She just stood there and stared at me. I instantly throw the covers over my head. When I thought she was gone, I peaked my head out. She was gone, but when I turn my head to the ladder of the bed her hand was there. I called my moms name and when I did the hand disappeared. My mom didn&#39;t wake up though. So I jumped off the bed and got in with her. She asked what was wrong and I didn&#39;t say anything. I squinted my eyes open to see if she was back. All of sudden I see her hanging over me staring into my eyes. I rolled over and tried to go to sleep. When I woke up, I told my mom and she just said it was a dream. I know for a fact it wasn&#39;t. To this day I still see her peak around corners but when I look she&#39;s gone. I&#39;ve also seen her in my dreams and in my thoughts. I&#39;ve seen her shadows in the night. There something different about her now. She looks about my age, as if shes grown up(I&#39;m 15 now), but she&#39;s still in the same clothes. She doesn&#39;t seem to want to hurt me. I think it&#39;d be cool if I could talk to her to see why she follows me. I&#39;d like to know her name and where shes from or why she&#39;s here. I hope she comes back. I haven&#39;t seen her in about a week. The last thing I have seen of her is when I went in the woods. I felt like I was being pulled by something. I was so heavy set to go into the woods. When I went in, I found a small valley. I went down the hill letting this force like pull lead me. I found a small white night gown folded up on a log at the bottom of the valley. The night gown had pink dots on it. It was also really small, as if a 4 or 5 year old would wear it. When I went back that day, I was pretty creeped out.</p>\n</div>\n","author":"Tropxcs"}