{"rank":"0","title":"Black Sky","id":"8mcuoo","url":"/r/nosleep/comments/8mcuoo/black_sky/","time":"1527366673000","body":"<div class=\"md\"><p>Its been about a week since there was a black sky instead of blue, and I don’t mean regular night time type I mean pitch black. No stars. Everyone has a light on their head or a lanturn everywhere they go. Its like when your locked in a closet when all you see is black. You have to have a light everywhere you go  or else you cant see anything.  Even electricity has stopped working so you cant even turn anything on in your house. Of course everyone is scared and so am I. No one has a single clue about why the sky is black and the sun and moon are gone. Plus everything else has gotton so much weirder. I cant go anywhere without seeing something out of place.</p>\n\n<p>Just yesterday I was out in my backyard trying to start a fire with a headband flashlight. I had a fireplace out there. So anyway I went to go get more wood from behind my cabin when I noticed something off. There was a man on top of it sleeping. I didn’t think anything weird of it because that happens from time to time, so I turned away and contined working. I looked at my cabin again to see the man was gone. A little bit spooked I drew back. I turned away from it and tried to put it behind me. I went to go inside my house since the fire wasn’t working. As soon as I pressed my fingers on the doorknob I heard a glitched dark voice.</p>\n\n<p>“Hey!”. I shot back and saw the same man with his shirt off charging at me. I screamed as I realized that their were strings on him. I looked up to see who was puppeting him to be greeted by a red hand just above the clouds moving its fingers. As soon as I got back into my house I felt lightheaded and everything went black. That man was my son.</p>\n\n<p>The sky is still black. Things have got weirder. It’s a lot more scary than how it was. My son died right after I passed out. Its been a month since I wrote down that draft. I have been carrying a headband light on me everywhere I go now. And another weird thing, it never turns off. I woke up in my bed with my light still on my head. I could see the its yellow reflection right in front of my eyes. I got up and walked past my doorway. What made everything so unsettling for me was that my light only went about 5 feet in front of me. Than my fears came true. As soon as I looked upstairs I saw a man sitting at the top whispering to himself. I overheard some of the things my visitor was saying. “Why is he doing this? Why is he above he is supposed to be down. Why is he controlling”.</p>\n\n<p>Those were the only things he said. He kept repeating them over and over again while I was listening paralyzied in fear. I soon began to realize he was saying these things growing a bit louder each time. Than he started yelling. “WHY IS HE DOING THIS!!!!! WHY IS HE CONTROLLING!!!!” Then when he was going as loud as he could his voice started to become more deep up until the point where he wanted me to cut my ears out. After he was done saying those things a volcano of black liquid exploded from his mouth while his eyes were rolled back. </p>\n\n<p>Than he feel back. I was so scared I felt like passing out again but it was like someone was refusing to let me. I snapped out of my shock and ran out my door. Now before I tell you what I saw when I looked up, let me tell you im not a smoker. I don’t drink, or do drugs. I never messed with any of that stuff in my life. Lightning struck in the sky and I caught a glimpse of something. Someone or something red with horns was looking down at me. It had black eyes and was bigger than a giant. Im still debating to myself. Was that Satan watching over me?</p>\n</div>\n","author":"Robert_Walter68"}