{"rank":"1","title":"They came for us in the night (Part 2)","id":"8mcusl","url":"/r/nosleep/comments/8mcusl/they_came_for_us_in_the_night_part_2/","time":"1527366702000","body":"<div class=\"md\"><p>Link to part one of my story: <a href=\"https://www.reddit.com/r/nosleep/comments/8lwkwb/they_came_for_us_in_the_night_part_1/\" rel=\"nofollow\">https://www.reddit.com/r/nosleep/comments/8lwkwb/they_came_for_us_in_the_night_part_1/</a></p>\n\n<p>I opened my eyes, greeted by darkness, and I had a moment of relief, thinking that it was all a terrible dream. It was the smell of blood and the screams that shattered this brief moment of happiness though. I was in some sort of medical room, dimly lit by several lanterns that were hanging from the ceiling, their light provided by fluttering red insects. Their bioluminescence, alien and beautiful, was unlike anything I had seen before.The air in the chamber was humid and hot, and had an earthy musk that made me gag. My clothing had been removed, and both of my arms were outstretched and locked into place. I was suspended off the ground against the wall, which was made of a fleshy, pulsing organic material. The materials that comprised the environment seemed to be alive and moving of their own accord. The walls were textured in dark brown and red bumps and ridges, and were covered in a thin layer of slime and viscera. I could feel the wall behind me steadily pulsing, and a warm, viscous liquid had spread down my body where I made contact with it. I tried to tell my limbs to fight back and struggle, but they failed to respond, and I felt a general lethargy seep into my bones. I fought the urge to sleep and got a better look at my surroundings, which was when I saw that I wasn&#39;t alone.</p>\n\n<p>There was another man in the room with me, who was also strapped down naked against the wall. His face looked familiar but I couldn&#39;t place where I might&#39;ve known him from. My head was still foggy from everything that had happened. Sarah was facing away from me on a black table, polished and clean, next to him. Several tools, their designs and utility unfamiliar to me, sat next to her on the table. Their surface, as smooth and black as the table, reflected the red light of the lanterns, further adding to the strangeness of the situation. My heart beat a little faster when I saw her, hoping she was okay. Against the wall opposite Sarah and the man was a glass tank filled to the brim with dark water. Something in the tank bumped against the glass, but it was too dark in the room for me to make out any details. The other man was whimpering and praying to himself, saying the words of the Lord&#39;s Prayer over and over again. I could see deep cuts all over his body, and his face and limbs were drenched in blood.</p>\n\n<p>&quot;Hey! Where are we, how did we get here?&quot; I called out to him. The man looked up at me, shaken from his prayers. </p>\n\n<p>&quot;I didn&#39;t know you were still alive.&quot; He said, &quot;You were here when I woke up. I don&#39;t remember much, only that they came for us in the night. The power went out, and I went to go check the fuse box and that was when...&quot; </p>\n\n<p>&quot;Yeah, same thing happened to us.&quot; I said after he trailed off, lost in his own thoughts. &quot;Do you think we can get out of here and escape? I can&#39;t move my arms, it&#39;s like they&#39;re asleep or something. They won&#39;t respond.&quot;</p>\n\n<p>&quot;There&#39;s no getting out of here,&quot; the man said, getting louder with each word. His eyes were wild with fear, and seemed sunken into his face, giving him a crazed, hollow look. &quot;We&#39;ve died and gone to hell, ONLY GOD CAN SAVE US NOW!&quot;</p>\n\n<p>As I opened my mouth to tell him to quiet down, one of the walls opened up, forming a circular hole, and two of the creatures walked into the room, their golden eyes flashing over both of us. One of them was the female from before, and the other appeared to be male, tall and well built, and his flesh was dark grey in appearance. It also had horns, though his were shaped and colored differently than the female&#39;s were. </p>\n\n<p>&quot;There will be no escaping from here, Brian Taller, and your God can&#39;t save you now.&quot; A deep, masculine voice sounded in my head. The female walked over to me and the male approached the other man, peering down at him. Brian Taller, I thought, wait, I know him..</p>\n\n<p>&quot;That&#39;s correct, James. This is the same Brian Taller that your sister met at church, whom she has been letting watch over her children when they are out of town. Yes, it&#39;s all coming back to you, isn&#39;t it?&quot;</p>\n\n<p>And it was. Brian and his wife Melinda had watched over my nephews and nieces when my sister and her husband had gone out on dates or on vacation. I had been both relieved and somewhat annoyed that neither of them had asked me to watch over their kids for them. But that wasn&#39;t all that he had done, Brian and Melinda had also watched over Sarah for me a few times when I had been forced to go out of town for work trips. It hadn’t been my choice the first time, as I was caught off guard by the suddenness of the work trip, but they had come through for me in the end, and I was appreciative of their willingness to take Sarah in, despite her being strangely shy and withdrawn around the pair. Brian and Melinda were good people, what were they doing wrapped up in all of this? I looked over at Brian, though much of his body was shielded from sight by the large frame of the male creature, and saw him shaking his head vigorously, his eyes closed.</p>\n\n<p>&quot;Are they good people though, James? Are you a good person?&quot; The female said, speaking in my mind. &quot;They are broken in ways that my kinsmen here finds particularly appetizing. He savors their forbidden proclivities, delights in their darkest desires, not in a way that is unlike how I have bonded with you.&quot;</p>\n\n<p>&quot;We&#39;re not bonded, you crazy bitch, we&#39;re nothing alike!&quot; I said, summoning what little courage and conviction I had left. What she said had surprised me, as I had never considered the character of the Taller’s very seriously. My sister had had no complaints, and as far as I knew the children hadn’t either, but was there something more to them, or was the creature misleading me? Maybe there was something to Sarah’s odd behavior around them..</p>\n\n<p>&quot;We are very alike, James, whether you would admit it or not. I sought you out, much like how Brian Taller was sought out. Your pain and grief and loneliness are delicious to me, they are the things that I feed upon and take pleasure in. You&#39;ve spent your whole life angry about being left out, angry at your family for not including you in their lives, angry at the world for passing you by. You&#39;ve been searching for meaning and purpose and a family who would accept you for who you are, and I am here to answer that call.&quot;</p>\n\n<p>I didn&#39;t want to admit it, but a lot of what she said felt true to me. I could be in a room full of people and find a way to divide myself from them. I was particularly skilled at making enemies wherever I went, but not particularly good at making friends. The aching loneliness and desire to be with people who would accept me were all things that I had felt throughout my life. Even when surrounded by my own family, I would feel this loneliness. Work, sleep, work, sleep, work, sleep. That was all that life had become for me.</p>\n\n<p>&quot;I believe you&#39;ve played with your food long enough, haven&#39;t you?&quot; The female called out, and this time I knew she wasn&#39;t just speaking to me.</p>\n\n<p>The golden eyed male bent itself down to the restrained Brian Taller and began to feed. I closed my eyes tight against what little I could see from behind his large frame, but I heard the sound of tearing flesh and bones cracking. Brian began screaming in pain, and in horror, and for his life, but the screams would eventually die down to a faint gurgle. The only thing I could hear now was the sound of blood splattering against the floor. Tears that I didn&#39;t know I had cried fell down my face, clearing away tracks of grime and mud that had accumulated during this nightmare. </p>\n\n<p>&quot;Shhh, James. We will be together soon. I would tell you my name but your human tongue would not be able to pronounce it.&quot; She said to me, wiping away my tears in a way that I found disturbingly affectionate. &quot;I told you no harm would come to you. Your fate will be different than his. Everything will become clear soon, and you will know your place in this world.&quot;</p>\n\n<p>The female stepped away from me, her hand trailing down my chest as she walked over to the glass tank, and the activity inside reached a peak, seemingly reacting to her presence. The water began sloshing around violently, and splashed up to the top of the tank, which was covered in the same smooth, black material that comprised the table and medical tools. I could see slithering shapes pressed up against the glass of the tank, their bodies and tails crashing against the glass as they thrashed around. The female touched the glass of the tank with her long thin fingers, her black nails clicking audibly, and strange alien symbols displayed on the glass. After a few more inputs, the top of the tank slid away, and some of the dark water splashed over the side, leaving black trails down the exterior of the glass. She reached into the tank and pulled what looked like an eel out of the water. It was several inches long, dark red in color, and was covered in black spines all down its body. The eel began to thrash in her hand, but she stroked its back, whispered something to it, and it became docile and immobile in her palm. She began to walk over to me, eel in hand, and I had a terribly uneasy feeling about what was about to happen. </p>\n\n<p>&quot;This will be the end of your life as you know it, James. You will shed your human skin and be one with me and our kind.&quot; She had reached me and had placed the eel up towards my face. I attempted to twist my head away from it, but the lethargy that had set in had reached my upper body, and I was only able to move my head a few inches away. </p>\n\n<p>&quot;The walls in this room secrete a paralyzing toxin, which helps us subdue our prey. Your body will not feel the pain, but your mind will know and remember.&quot; She said, opening my mouth gently with her fingers. I could no longer speak, my mouth and tongue seemingly frozen in place. She caressed my forehead, wiping the sweat from my brow, and moved the eel closer to my mouth. My eyes opened wide in horror when I realized what she was going to do, and the last thing that I saw was those two golden eyes, burned into my consciousness.</p>\n\n<p>We sat on the topmost branches of the oak tree, Sarah, the female, and myself. She had revealed to us the nature of her kind following our rebirth at the hands of the eels, and we had returned to this place so that I could taste the closure I desperately needed. I was driven back to this place, feeling the calling that my mate had mentioned to me. The loneliness and pain that I felt deep within my heart had called her to me, our minds and souls linking across the vast chasm of time and space, and now my rage, and anger, and frustration would drive me to them. My old life, my old family. Their end would be my beginning. We looked down from our perch into the window, six golden eyes reflected in the glass, and my mate, who embodied both beauty and terror incarnate, reached out with her mind and touched that of the feeble thing sleeping in the room. I felt its fear through my connection with her, raw and palpable, its taste intoxicating to me. I looked over at my mate, growling deep in my chest as I traced the edges of her feminine form with my eyes, anticipating the thought of our imminent coupling.  </p>\n\n<p>The rain continued to come down, with more intensity than before, and it showed no signs of slowing down. Lightning flashed across the night sky, and illuminated the numerous children&#39;s toys strewn haphazardly across the patio. The recently built pool overflowed with water, the winds of the storm spinning a lone floatie wildly around the edges of the concrete structure. The power was still out, and I knew now that the power outage and the static on the radio was no accident or coincidence, but was by design. From the room below us, a young child cried out in the night, scared not only of the lightning and thunder produced by the storm, but also by the swirling darkness of the nightmare that was still fresh in her mind. She saw golden eyes, blinding in their intensity, all knowing and all seeing, probing and tearing her mind. Her mother came into the room shortly after hearing the cries and attempted to comfort her.</p>\n\n<p>&quot;Mommy, there&#39;s a monster outside my window!&quot; the child told the mother. &quot;It felt so real! No matter where I tried to hide in my dream, they were always there! They could always see me!&quot; \nThe mother laughed gently, and told the child that it was just a bad dream. The mother told her that the storm would pass soon, and that she should go back to bed. The child was comforted by this, and the mother stayed in the room until her child had fallen back to sleep.\nI looked over at Sarah, our eyes meeting, our minds in unison. Our connection in my past life had carried over into this new one, something my mate had told us was a rare occurrence amongst our kind. Sarah licked her lips, her long dark tongue passing over her multiple rows of fangs, relishing in what was to come. I could practically taste the blood and sinew as well, and knew that I wouldn&#39;t have long to wait until I could gorge myself upon their flesh. I would tear my old life apart, limb from limb, and my rebirth would be complete. </p>\n\n<p>I can feel the last vestiges of my humanity slip away as I write this account of the final day of my human life. I didn&#39;t want this to happen, but it did, and now what&#39;s been put into motion can&#39;t be stopped. This is a warning, because I want you to know that we&#39;re coming. We&#39;re in your minds, watching your dreams, feeling and feeding off your hopes and desires. Some of you call out to us, crying out for more, crying out for purpose and meaning and a way out of your pitiful human existence. Those will join us, but the others among you will not be so lucky. We are here, in your present and in your past, and we are coming for you, hungry and patient. Think of my story if you find yourself trapped in a thunderstorm that has no end, think of my story if you find the power has gone out and the radio is only static, think of my story and know that what happened to me could happen to you. We are coming.</p>\n</div>\n","author":"MidnightVigil"}