{"rank":"5","title":"The mysterious cabin on Grandfather Mountain","id":"8mcvhc","url":"/r/nosleep/comments/8mcvhc/the_mysterious_cabin_on_grandfather_mountain/","time":"1527366886000","body":"<div class=\"md\"><p>Grandfather mountain is a very famous mountain within the Blue ridge mountains in Northern North Carolina. Most people who see the mountain from far away see a man who is laying down on his back. The top of the mountain is his forehead, the nose and the mouth are also in shape to give its name. But why grandfather and not father or mother? Well that&#39;s something that I didn&#39;t really think about that much, I really didn&#39;t care about the name of the mountain except that it looks like a persons face. A mountain is a mountain, people hike it, people take pictures and unfortunately people sometimes get hurt.</p>\n\n<p>When I was hiking the mountain and following a designated trail, me, the adventures adult I was at the time decided to wonder off the trail and see what was actually out there. I was thinking that nobody ever did that and I was doing this unlike everyone else but I was wrong, I found many things like trash, old bottles, cans and just camping materiel every once in a while. It says no camping but I guess people really didn&#39;t care and decided to go as far away from the park rangers so they can camp there and enjoy the view. But while I was off the trail, I noticed something strange, I noticed this small cabin. I knew that there were no houses or cabins on this mountain so this seemed very suspicious. I wasn&#39;t thinking right at the time so I decided to get closer, as I got closer this horrid smell started coming from what I thought to be a dead animal near the house.</p>\n\n<p>While I was around the cabin I found a door leading into the cabin. I walked in, it was very dusty and it seemed like really nobody has been there but it seemed like the cabin has been there for a very long time, like maybe around 100 - 200 years. I almost forgot about the smell until it came back, even worse this time. I decided to try to ignore it, but I could not. I ventured around the house and I found some stairs leading up. I didn&#39;t trust the stairs but I decided to start climbing anyway. The stairs didn&#39;t break thank god but still, it seems like nobody has been here for over 100 years, but the smell was getting even worse. When I was outside the cabin a few minutes before this I saw a chimney. I didn&#39;t think so much of it because every old house/cabin had a chimney because air conditioning and heating didn&#39;t exist at the time. I decided to go back downstairs when I found the fire place. It looked old, there was no wood, no ashes, no nothing. It was just a fireplace and the hole where the smoke releases through the chimney. That&#39;s where the smell was the worst. I could not really figure out what it actually smelled like, smelled like something I&#39;ve never smelled before.</p>\n\n<p>But I decided to look up the chimney, what I found still scared me to this day. It was a corpse, but it didn&#39;t really look like one though, it seemed like it has been there for only a week or two but this looked more human than animal but non human at the same time. How did it get there and what was it? I decided to leave the cabin, found the trail that I was originally on, I felt nervous and scared walked down the mountain and to the park rangers cabin. I asked one of the rangers if there have been any missing people on the trail lately. He said yes, but they all have been found alive after getting lost.</p>\n\n<p>This seemed very odd to me, because its almost impossible to climb the mountain without going through the front gate and leaving through the front gate but I guess the rangers really didn&#39;t notice that someone has signed in and never signed out. I went back to the cabin with the ranger, the smell still very unsettling I walked through the door, and before I stepped all the way in I saw it, standing there in the room, the thing that was in the chimney earlier was not sitting at a small table waiting for me, before I could think of something to do or to say, the ranger was gone and I was all alone with this thing so I decided to run as fast as I could away from this thing, I ran for at least 5 miles maybe 6 with this thing following me. I knew for a fact that other people saw me and this creature running after me. After I ran past the gates the creature was gone and I never went back to Grandfather mountain ever again. Do not ever wonder off the trail on the mountain or this creature will come after you. </p>\n</div>\n","author":"megaoof69"}