{"rank":"8","title":"People Fly Too","id":"8md4ur","url":"/r/nosleep/comments/8md4ur/people_fly_too/","time":"1527369233000","body":"<div class=\"md\"><p>Diane held her mother&#39;s hand joyfully. Her pink hoodie buried her jet black hair. Blue eyes were hardly noticed beneath her midnight bangs. She held a smile upon her face as the two of them made their way to the park.</p>\n\n<p>Her mother kept Diane close as she sighed in content. Just a bit ahead was a colorful stand, which they attended everyday. Bright balls filled with helium were attached to the little stop labled &#39;Balloons&#39;. </p>\n\n<p>After they were close enough, Diane sprinted to the balloon stand. The owner, Lucus, smiled at the young girl. &quot;Came back for another?&quot; He asked, letting out a laugh. &quot;Pretty soon your house will go flying, if it hasn&#39;t happened already.&quot;</p>\n\n<p>Diane laughed as well, before her mother made it to the stand. &quot;Good morning Lucus,&quot; her mother said to the man. </p>\n\n<p>He handed Diane a lavender balloon, which was the only one left. &quot;Good morning Kate. So the house hasn&#39;t flown to space yet?&quot;</p>\n\n<p>&quot;Nope, not yet,&quot; she replied. After digging in her purse, Diane&#39;s mother handed him five dollars to pay. Her mother bent down to Diane&#39;s level with a kind smile. &quot;Would you like me to tie that to your wrist?&quot;</p>\n\n<p>Diane smiled as she nodded. &quot;Yes please,&quot; she replied and held her wrist out patiently. </p>\n\n<p>Later, the mother returned home with her daughter. Diane ran to her room to release her balloon with the many others. &quot;Diane, are you ready for lunch?&quot; Her mother asked as she walked into her child&#39;s room. She let out a sigh seeing the mess of clothes on the floor and deflated balloons in a pile. &quot;You know sweetie, we have to get rid of these old ones. You want room for more right?&quot; </p>\n\n<p>Diane sighed and nodded as she began cleaning up the pile. She let out a deep sigh before smiling and carrying them downstairs. </p>\n\n<p>Her mother sighed and began to set the table for their lunch. </p>\n\n<p>Diane frowned before she began eating a grilled cheese sandwich that was just brought off the stove. &quot;Mommy?&quot;</p>\n\n<p>Her mother stopped eating and looked up and across the table to her daughter. She felt a chill run down her spine as her daughter had a smile almost unsettling. &quot;Yes Diane?&quot; She asked after finishing the food in her mouth. </p>\n\n<p>&quot;Can people fly?&quot; She asked, sounding completely innocent even though her smile was terrifying. </p>\n\n<p>&quot;Of course not sweetie, we&#39;re not birds,&quot; her mother replied as she shook her head gently. &quot;You should know this.&quot;</p>\n\n<p>Diane frowned as she looked at her mother. She stood up and walked to the stairs. &quot;Silly mommy, you just haven&#39;t tried yet.&quot; And with that, Diane walked to her room. &quot;I&#39;ll prove you wrong.&quot;</p>\n\n<p>That night Diane smiled widely as she looked at her mother in awe, Lucus stood next to her. &quot;I told mommy people can fly. She just hasn&#39;t tried yet.&quot;</p>\n\n<p>Her mother was hanging from the ceiling by balloons that had once been in her room. Diane shook her head lightly as she giggled happily.</p>\n\n<p>The next day Lucus was standing at a balloon stand with a wide smile and Diane stood next to him. A little boy ran over and bought a balloon from them happily.</p>\n\n<p>&quot;Hey, did you know people fly too?&quot; Diane asked the little boy before his eyes lit up in awe.</p>\n</div>\n","author":"CreepypastaTravelers"}