{"rank":"24","title":"So... I went camping last year.","id":"8mdb9y","url":"/r/nosleep/comments/8mdb9y/so_i_went_camping_last_year/","time":"1527370879000","body":"<div class=\"md\"><p>A year ago, my friend and I went camping. \nIt was a regular thing we did since we had been friends since high school. \nThe south of France was the place. \nWe packed up and started driving. </p>\n\n<p>The drive went really well... at first </p>\n\n<p>After a few hours, Madeleine (my friend) said she had to use the bathroom and honestly, I felt like having a coffee.\nSo, we made a quick stop at a gas station. \nIt was the middle of nowhere, of course. We were just a few hours into the trip and the environment was starting to become a dense forest. </p>\n\n<p>The sun was also starting to set since we left in the afternoon. \nMadeleine rushed out of the car and entered the building. \nI got out of the car and locked it. Forgetting my phone inside. </p>\n\n<p>As I walked inside the building, I wasn’t creeped out or anything. Just the feeling like you want to leave but that you really need to do something. That. \nI didn’t focus on my surroundings at the time, because I was already tired. \nBad thing to do. </p>\n\n<p>The coffee machine was pretty basic, so I got a cup, payed for it, and got back to the car. \nThe second I walked out the door, I froze. \nMy driver side window  was shattered. Someone broke it. \nI ran towards the car as fast as I could to save my phone. \nToo little, too late. </p>\n\n<p>Luckily, Madeleine had her phone with her and we could still communicate. But this was really, really bad. \nI waited in the car, for Madeleine to return. \nAs she saw the car, she gasped. \n“What happened!?” She said. \nI explained and both of us were really unsettled. All of my information was on that phone. \nWe didn’t cut our trip short, but did go to the local police station to report the incident. \nI gave them Madeleines number and we continued our journey. I was upset but I still needed the trip. Things weren’t too good at home. </p>\n\n<p>This might’ve been the worst decision I made on that entire trip. \nAfter hours and hours, we arrived at the cabin where we went “camping”. It wasn’t really fully in nature. \nBut it was basic enough to call it camping. \nAs it was really dark outside, Madeleine and I only took the stuff we needed and went inside to sleep. \nWhen we were all set and I was ready to fall asleep, I let the events of that day sink in and I slowly went to sleep. </p>\n\n<p>Until I heard a loud crack. \nMy eyes opened instantly. \nMadeleine also heard it, since she immediately asked me: “Did you hear that?” \nI tried to comfort her. \n“Madeleine, go to sleep. It was probably just an animal or something. We’re in the middle of nowhere. You know, nature?”\nBut the events of that day weren’t forgotten and still floated in the back of my head. \nLuckily, Madeleine agreed with me and we both tried to go back to sleep. </p>\n\n<p>After five minutes, Madeleine was snoring and I couldn’t sleep since I wasn’t used to sleeping together with someone else. \nI was beyond annoyed, it was really late. You could almost say early, and I still wasn’t sleeping. \nThere wasn’t anything better to do, so I got up and took my flashlight. \nI got a glass of water and sat down, looking at the forest. At the grassy hill that faced the cabin. \nThis was one of my favourite things to do when I couldn’t sleep, it always put my mind at ease. </p>\n\n<p>Not this time. \nAs I was pointing my flashlight at things that surrounded us, I could see more than when it was dark, obviously. \nThe moment I pointed it at a big tree to the left, someone or <em>something</em> quickly moved behind it.\nIt was dark, like, cloth dark. \nAt this point, I was beyond scared. \nIt was the size of a grown man. </p>\n\n<p>I turned the light on. \nMadeleine was extremely annoyed since it apparently woke her up. \nShe was instantly awake when I told her I saw someone or <em>something</em> big behind the big tree.  (we both knew which tree.)\nI told her to put her clothes on and pack to get back to the car. \nThe trip was officially cut short. </p>\n\n<p>I was able to connect the dots now. My code wasn’t to hard to crack. (0432) And all of the information about the trip was on there. \nLuckily, I was able to control my paranoia and get the hell out of there. \nIt took less than 5 minutes to get everything ready and leave. </p>\n\n<p>But both of us were scared to get out of the door. \nSo she and I used the “back door” which was a hatch that connected to a ladder into the basement. \nAnd the basement had a big wooden gate which was about 10 meters away from the car. </p>\n\n<p>We turned off the light and slowly moved towards the hatch. \nMadeleine tried to say something but I put my finger on my mouth. Telling her to be quiet. \nI opened the hatched and slowly climbed down the ladder. She closed the hatch and  did the same. \nLooked like we were right on time. We could hear someone pulling the door handle upstairs. \nMy eyes widened when I heard that and it was even more motivation to keep going.</p>\n\n<p>I opened the gate. No longer caring about the fact that it made a lot of noise. \nMadeleine and I sprinted towards the car and quickly opened it. </p>\n\n<p>As I started the car, I looked at the door. It was wide open. \nMadeleine shouted: “Go Go Go!” \nAnd I quickly proceeded to drive away from the cabin. </p>\n\n<p>After about 8 hours straight. We arrived at my place. \nI didn’t wait for the local police to call me back and reported the incident to the police station of my town. \nThey never caught the guy/girl. \nAnd I bought a new phone the next day. </p>\n\n<p>Last week, when I arrived at home from work. There was a package at my front door. \nGuess what was in it? \nMy phone. \nI haven’t dared to charge it since...</p>\n</div>\n","author":"Starsign0"}