{"rank":"153","title":"I Volunteered at an Animal Shelter.","id":"8mdezu","url":"/r/nosleep/comments/8mdezu/i_volunteered_at_an_animal_shelter/","time":"1527371884000","body":"<div class=\"md\"><p>Recently, I’ve had a bit of extra time, so I decided to start volunteering at an animal shelter. The shelter is family run, no kill,  and severely understaffed, so I sometimes was there with just a couple people or even alone caring for a lot of animals. Now to the part you came to hear.</p>\n\n<p>We recently got a new dog in our shelter. I don’t know exactly how how we got him, but I assume he was found on the street and dropped off to us. The dog was tall and spindly, almost like an Irish wolfhound with a lot less hair. He was grey with smooth, short fur and had oddly tight skin. His tail was clipped too, which is odd for a dog like him. I’ve never been scared of a dog, or any kind of animal for that matter, but this one made me uneasy. The way he would look at you while you filled his bowl, never approaching and never backing down, it was almost like he was trying to use telepathy on me. We nicknamed him Alien, because he reminded us all of a xenomorph. </p>\n\n<p>Yesterday I went into the shelter as another volunteer, Abby, was leaving. </p>\n\n<p>“Sorry! I’m leaving you alone. My brother needs help moving to his new apartment.” </p>\n\n<p>It’s not that big of a deal. I was only going to be there for a few hours. Since all of the dogs were already fed I was probably just going to sit around with Rambo, the old pug.</p>\n\n<p>“Ah it’s no problem. Rambo will keep me company.” I smiled at Abby and walked into the shelter.</p>\n\n<p>Rambo trotted up to me and snotted on my shins.</p>\n\n<p>“Hey bud.” I patted Rambo and scooped him up. I plopped him onto the counter and sat in the spinning chair up front. The other animals were quiet so I just sat on my phone petting Rambo to sleep.</p>\n\n<p>Almost an hour passes when I hear a yapping from the cage room. I get up and open the door behind me. Only one dog is barking, the little dachshund across from Alien. Alien is staring through the grate at him.</p>\n\n<p>“Hey, hush now-“ I’m cut off by Alien screeching as if his mouth was a gate to hell. It’s so loud. It’s like an engine. </p>\n\n<p>“Hey! Alien. Sh!” I command sharply. Alien looks at me like a wolf looks at a sick fawn. I’ve never seen a dog with ill intent in it’s eyes. I get creeped out and close the curtain in front of Alien’s cage. Soon, I’m back to Rambo watching youtube videos on my phone.</p>\n\n<p>Just a few minutes pass before I hear more ruckus from Alien. This time, his spindly arms are flailing at the curtain, shredding it with his long, thin claws. I pull the curtain back.</p>\n\n<p>“ALIEN!”</p>\n\n<p>I look at him in awe for a few seconds. He’s completely upright, four feet tall, looking at me. His paws reach out and wrap around the grate of the cage like hands. He starts whispering nonsense. His mouth is chattering while he breathes out hot air.</p>\n\n<p>“Alalalalalalalalalalalalalalalala.” It sounds like a human voice. I break from my shock and speed out of there. I scoop up Rambo and run to my car. I start to dial the manager’s number when I see the front door open. Alien steps out from the front door, a foot taller than he was before, with a humanoid shape and a limping bipedal gait. </p>\n\n<p>I clutch Rambo and watch Alien walk around the side of the building, towards the forest. The horrible noise gets louder and more high pitched.</p>\n\n<p>“Alalalalalalalalalalala.” It was almost deafening. As I watched him walk further into the forest, it almost seemed that he got more and more human the further he was from me. </p>\n\n<p>I don’t know what happened, where Alien went, or how I’m going to explain this, I just hope I never see Alien again.</p>\n</div>\n","author":"VilePug"}