{"rank":"71","title":"Villagers in China are disappearing (part 1)","id":"8mdgxm","url":"/r/nosleep/comments/8mdgxm/villagers_in_china_are_disappearing_part_1/","time":"1527372402000","body":"<div class=\"md\"><p>I&#39;m what most people would call an agent. I&#39;m not a James Bond clone through, like many expect when I tell them I work as an agent. My combat skill amounts to a single firearms lesson and half a year of karate when I was 14 years old. My job was to contact informants and help our cell with logistics and computers.  A single cell has 10 or so agents. My cell was based in Urumqi in Xinjiang, China. </p>\n\n<p>For those of you not in the know, Xinjiang has been the site of an insurrection against the central government for the better part of a decade. Our task was to monitor the military and their activity and provide covert aid to local resistance groups. \nThree days ago, we got a tip from our party insider informant Jiang about a suspect event. Now there have been many rumors about death squads or mass disappearances but this was the first time a credible informant could give anything that resembled a hint. Naturally, it became our top priority to check it out. </p>\n\n<p>There was a village 214km southwest from Urumqi that suddenly went dark. Villagers from the nearest village some 45km away sent some people over when they couldn&#39;t contact them by radio. Not many hours later, the second village had also gone dark.</p>\n\n<p>We decided to leave half the crew to watch the safehouse. Me, Jacob, Julie and Mike would go check out the area. The area was not under curfew, so we would be able to check it out if we posed as tourist hikers. We expected to stay there and speak with the locals over several days in addition to passing as real hikers, so we packed tents and camping equipment along with our best hot weather clothing. Jacob being a former marine got to carry a MP5 in his backpack, while the rest of us got glocks for self defense. </p>\n\n<p>It took us a little over 3 hours to cover the trip to the first village. Jacob parked the pickup truck and the rest of us went to investigate. I almost fell right out of the door when I tried to get out, but Julie grabbed my hand. It&#39;s like a curse for me. Ever since that time I walked into a rake and had a concussion, my balance would suddenly fuck itself from time to time. Regardless, I appreciate Julie&#39;s attention. I&#39;ve seen her dropping hints to me from time to time as well. It&#39;s just slightly embarrasing you know? Stumbling in front of your crush.</p>\n\n<p>Back at the village, there wasn&#39;t a single life-form in sight. The tiny village was dominated by the commune gathering place, a slightly larger shack. Its party insignia had been defaced with Arabic writing and the flag of the Islamic Resistance Party with its two crossed AK47s hung where the Chinese flag should have been. </p>\n\n<p>Terrorists. But that didn&#39;t explain the complete lack of people. They had clearly been here to take over the town, or they wouldn&#39;t have left the buildings intact nor raised their flag. </p>\n\n<p>Julie and Mike took crowbars and went to work on the doors. It was a complete overkill given that the village hall shack likely hasn&#39;t been renovated since the Mao era and its defenses consisted of a tiny rusty padlock. </p>\n\n<p>The two story shack had dim electrical lightning and a few desks and chairs for the local gatherings. Mike checked the scattered papers, James stood guard and Julie went upstairs while I checked the cupboards. I almost jumped out of my skin when I heard a small scream before I realized it was Julie&#39;s. </p>\n\n<p>She had found two bodies. A Chinese male and female, both lying on the bed in the living quarters upstairs with their brains blown out. </p>\n\n<p>&quot;Pistol bullets,&quot; Jacob reasoned. &quot;Dude got shot first in his sleep. Poor wife must have woken up and reached to turn on the lamp before getting shot herself.&quot; </p>\n\n<p>&quot;Perps are likely the same people who hung the flag outside&quot;</p>\n\n<p>The murder of the local cadre and his wife still didn&#39;t answer any questions regarding the disappearance, if anything it deepened the mystery. The town was likely completely Muslim. Even the cadre had a quran by his nightstand. Why would Islamic terrorists execute an entire town filled with Muslims? A false flag was impossible, given the party member&#39;s death. Perhaps people fled when the terrorists took over and the terrorists pursued them?  </p>\n\n<p>Also none of these explanations could explain the complete lack of bodies. Even if people were fleeing, at least some should have been shot and killed. </p>\n\n<p>Mike&#39;s voice interrupted my thoughts. He had gone back down the stairs in search of a toilet, but instead found the back door. However, it wasn&#39;t intact like the front door. It was almost completely gone, like someone had tried to turn it into firewood.  </p>\n\n<p>&quot;Look at the way the chopped boards landed. The door was chopped down from here, not out there,&quot; Julie chimed. </p>\n\n<p>&quot;Julie, what do you mean &#39;here&#39;?&quot; </p>\n\n<p>&quot;I mean from the inside. <em>They didn&#39;t broke in through the back door. They broke out</em>&quot;</p>\n\n<p>My veins froze. Someone was in a real hurry to get out of this shack. There was something here. Something the killers fled from. </p>\n\n<p>&quot;Check the other houses!&quot; </p>\n\n<p>I have never heard Jacob sound so urgent before. He must have also realized the implications. </p>\n\n<p>We all had a fairly gung ho attitude when we first arrived, but our discoveries put a heavy dent in the mood. No one was making any idle talk on our way to the other village houses, walking past sheep pens with no sheep and untended fields filled with crops. </p>\n\n<p>What we found by the houses did not calm our fears one bit either. Almost every house had their doors or windows broken. <em>All of them were broken from the inside</em>. I was convinced we had to get away as far as possible. The whole place just didn&#39;t feel right.</p>\n\n<p>And night was coming. What if whatever creature or demon that made people desperate enough to destroy their own houses to escape would also come for us at night? None of us wanted to stay overnight at the village. Julie was truly scared and just wanted to go back to base. Mike and Jacob would rather head to the second village to further investigate. If the &quot;thing&quot; came from inside the houses, it should be locally restricted. At least that was Jacob&#39;s reasoning to calm us down. </p>\n\n<p>We hurried back to the truck. Jacob would drive, as he seemed the least creeped out and had experience in hostile country from his tour. The lot of us calmed down once we settled in the truck. Mike switched on some music, which seemed to put us all back into ease. Julie was worried about the second village, but I assured her it was going to be okay. </p>\n\n<p>We started sharing our theories of the strange events from before. Julie had heard from locals about spirits. I also recalled a few things from more superstitious villagers. Before communism and Islam, the locals believed in spirits. There were good and evil spirits. Offerings had to be made in the form of burning food or effigies of money or items.  Today, some Chinese families burn paper smartphones or computers to pass them on to their deceased grandparents. It was a sign of respect. </p>\n\n<p>&quot;But,&quot; Julie continued. &quot;With the introduction of Islam, such sacrifices were forbidden&quot;</p>\n\n<p>&quot;You think these spirits are for real?&quot;</p>\n\n<p>&quot;Elison, don&#39;t you see? When Mao brought Communism, he did not dare outlaw sacrifices. Don&#39;t you think there is a reason for that?&quot;</p>\n\n<p>&quot;Really Julie. Who filled your head with superstitious garbage?&quot;</p>\n\n<p>Julie was about to retort when Jacob suddenly stopped the car and looked at us, visibly pale.</p>\n\n<p>&quot;Bodies ahead.&quot;</p>\n\n<p>Any calm built up from Mike&#39;s playlist and the safety of sitting inside a vechicle evaporated in an instant. Hell, Julie was visibly hyperventilating. She begged Jacob to just drive away and get back to base, but Jacob insisted to stop and inspect the bodies. If we didn&#39;t take a look at the victims, how would we know what had happened back at the village? </p>\n\n<p>Jacob was right. Mike slowly nodded. I held Julie and we stepped out together. To our surprise, the first corpse didn&#39;t have any visible wounds at all. It was almost naked and was starting to shrivel due to the oppressive heat. </p>\n\n<p>What did he see at the village that sent him into running 30km or so through a desert barefoot in his briefs?  </p>\n\n<p>There were a lot more corpses. I counted at least ten others. Mike waved us over. He was standing around five uniformed corpses, three of them clad in ski masks. </p>\n\n<p>&quot;Guess we found our perps. What do you make of it, Jacob?&quot;</p>\n\n<p>&quot;A low quality knockoff M92 pistol. Something is wrong with it, but I can&#39;t put my finger on what.&quot; Jacob paused. </p>\n\n<p>&quot;That&#39;s right. All shots have been discharged, but this fella pressed the trigger so hard, the cheap plastic broke. Whatever chased him is either too fast or too durable to be hurt by bullets, or he was a really poor shot. His friends also spent their magazines.&quot;</p>\n\n<p>&quot;None of them managed to reload though,&quot; Mike filled in. &quot;All their spare cartridges are still there&quot;</p>\n\n<p>I swallowed and inspected one of the dead terrorists. Just like all the other corpses, there were no visible wounds. He must have died from exhaustion combined with exposure and dehydration. What a horrible way to go. </p>\n\n<p>The sun was going down. Jacob suddenly stiffened and motioned us to quickly get back into the car. For the first time since we met in Beijing during the start of my tour in China, Jacob was speeding. And not by 10km/h or so, but almost twice the speed limit. We were far from the corpses when Jacob spoke up again.</p>\n\n<p>&quot;Don&#39;t you see? Those poor guys died from exhaustion while running. That means <em>they never lost whatever the fuck was chasing them</em>. That thing. It could have been out there while we were outside the car. We had to get out of there quick.&quot;</p>\n\n<p>No one dared say anything after that. I hugged Julie hard, more to comfort myself than to calm her down. </p>\n\n<p>It was dark outside when we came to the second village. There was no one outside, but that was to be expected at this hour. We parked our car and went towards the nearest building. I felt a pang of fear when we walked past an empty sheep pen. Jacob lead the way. He turned around and looked at us gravely when he reached the front. </p>\n\n<p>The door had been chopped down, as if with an axe. And the splinters showed that it had been <strong>torn down from the inside.</strong> </p>\n</div>\n","author":"Comrade_writer"}