{"rank":"258","title":"My Niece Has Been Having Trouble at School. Any Advice?","id":"8mdheh","url":"/r/nosleep/comments/8mdheh/my_niece_has_been_having_trouble_at_school_any/","time":"1527372522000","body":"<div class=\"md\"><p><strong>Roselover1219</strong> </p>\n\n<p>- Hi loves! I’ve been ‘stalking’ this thread for a while and I think I need your help. My nine-year-old niece has been having a lot of trouble at school lately. She’s been having difficulty making friends and communicating appropriately with her teachers. Her mom and dad moved her upstate just recently and so she’s had to change schools, which I think is part of the problem. What should I do to help her? </p>\n\n<p><strong>MommyofFour</strong></p>\n\n<p>- This is certainly a tough one, Rose! I would definitely talk to your niece’s mom and dad before taking any action, but maybe you could help set up a playdate or chaperone a field trip to get a better idea of her behavior at school. Best of luck to you, and please update us with any more questions!!! </p>\n\n<p><strong>ShannonHesse</strong> </p>\n\n<p>- I agree with <strong>MommyofFour</strong>. It’s always hard to watch a child struggle, especially one that you’re close to, but her parents should definitely have the final say before you decide to step in. </p>\n\n<p><strong>Roselover1219</strong></p>\n\n<p>- Thank you both for your advice! I really appreciate it, however I have a slight problem. My niece’s parents don’t actually know me, and I feel that it would be a bit strange to ask them for permission/help them set up a playdate. Any advice? </p>\n\n<p><strong>MommyofFour</strong></p>\n\n<p>- I’m pretty confused now, Rose. How would your niece’s parents not know who you are? Isn’t one of them a sibling of yours? Please write back soon. We would love to help but the information you’re providing us with is rather strange </p>\n\n<p><strong>Roselover1219</strong></p>\n\n<p>- I understand how that might be confusing. I’d rather not get into it, other than that technically I’m not biologically related to my niece. She’s just a child that I’ve grown to care for and that I know very well. I think I’m going to try and attend parent/teacher conferences to gain more understanding of how the school operates. </p>\n\n<p><strong>MommyofFour</strong></p>\n\n<p>- In total honesty, I’m very concerned. How does this child know you, and why do you think it appropriate to attend conferences if you are not a parent or guardian? </p>\n\n<p><strong>Roselover1219</strong></p>\n\n<p>- It’s very presumptuous of you to assume I am not her guardian. I am always watching her to make absolutely certain she is safe. Now, just to update those that are actually worried about my darling: her teacher hasn’t an ounce of concern for her wellbeing. When I asked about her grades, all she said was that my niece is doing just fine. I also wasn’t provided with a full behavioral report, which is something I have written to the district about numerous times, telling them that I think this would be beneficial. I truly believe she would just be better off without this woman. </p>\n\n<p><strong>Roselover1219</strong></p>\n\n<p>- Just a quick update: I found the teacher’s home address! I believe she lives alone in an apartment complex very close to where I live, and, not to scare you all, but it shouldn’t be that difficult to get rid of her. She’s weak. </p>\n\n<p><strong>ShannonHesse</strong></p>\n\n<p>- I hope this isn’t real </p>\n\n<p><strong>MommyofFour</strong></p>\n\n<p>- I just reported your account. If this is some sort of sick joke, it isn’t funny. And if it’s not, I urge you to speak with the police. Please do not do anything to the teacher. </p>\n\n<p><strong>Roselover1219</strong></p>\n\n<p>- My niece didn’t go to school today. She always buys a smoothie from me, and even if she doesn’t, she walks right by the store window so I can see her. They probably found the body of her teacher and had everyone stay home. I don’t mind. She’s safer that way. </p>\n\n<p><strong>MommyofFour</strong></p>\n\n<p>- Leave this child alone and turn yourself in. I’m begging you. </p>\n\n<p>Roselover1219</p>\n\n<p>- So sorry that it’s taken me so long to update you all. I’ve been busy. My niece walked home with another girl today and they played together at my niece’s house after school. I don’t like the other girl. She stole a doll from my darling girl and had the nerve to cry about it when my niece’s mother asked if she had taken it. What should I do? </p>\n\n<p><strong>MommyofFour</strong></p>\n\n<p>- Let the children work it out themselves-<em>please.</em> I cannot emphasize this enough: leave both children alone. </p>\n\n<p><strong>Roselover12199</strong></p>\n\n<p>- To whomever got my account deleted: nice try, but I’m back! I just wanted to let you all know that I certainly scared the other girl off. She won’t bother my niece again. Don’t worry, she’s still alive, but a few hours alone in a dark basement generally makes people do what you want. </p>\n\n<p><strong>MommyofFour</strong></p>\n\n<p>- Stop. Please. </p>\n\n<p><strong>Roselover12199</strong></p>\n\n<p>- I have a plan. </p>\n\n<p><strong>Admin158</strong></p>\n\n<p>- We are concerned about some posts you have been creating, <strong>Roselover12199</strong>. Please direct message us. </p>\n\n<p><strong>Roselover12199</strong></p>\n\n<p>- In a couple days you won’t have to worry about me anymore. I’m making a plan for me and my darling to be together forever. What do you all think of traveling to the Dominican Republic? </p>\n\n<p><strong>MommyofFour</strong> </p>\n\n<p>- Do you know how much trouble you would be in if you took the child out of the country? </p>\n\n<p><strong>Roselover12199</strong></p>\n\n<p>- I’m not worried. They won’t find us. Do you want to know my plan? </p>\n\n<p><strong>Roselover12199</strong> </p>\n\n<p>- In just a few hours, I will have her. </p>\n\n<p><strong>Roselover12199</strong></p>\n\n<p>- Do you think she will love me? </p>\n</div>\n","author":"anxiousivy"}