{"rank":"1387","title":"My wife did something really weird last night . . . (Part 2)","id":"8mdus5","url":"/r/nosleep/comments/8mdus5/my_wife_did_something_really_weird_last_night/","time":"1527376066000","body":"<div class=\"md\"><p>This is an update on a weird thing that my wife(?) had done a few nights ago. You can find that <a href=\"https://www.reddit.com/r/nosleep/comments/8m3tyz/my_wife_did_something_really_weird_last_night/\">here.</a></p>\n\n<p>So, after getting so many helpful comments suggesting things like sleep walking, burglars, skinwalkers, interdimensional crossovers, and ghosts, my curiosity was tickled. I decided to have a sit down with my wife to tell her what happened and to see if she had noticed anything out of the ordinary.</p>\n\n<p>She seemed simultaneously relieved and worried when she told me that she had, in fact, noticed something unusual. She is not a normally calm person, and so it was difficult for her to tell me what had happened in an easy to follow manner. I&#39;ll summarize it as best as I can.</p>\n\n<p>She said that it had happened a few days before the night that prompted me to make the last post. She had been asleep in bed when she was woken up by the bedroom door opening. She saw me slowly walk into the room. At first, she thought that maybe I had come to tell her something, but I didn&#39;t say anything or sit on the bed like I normally would.</p>\n\n<p>She said that, at that point, she assumed that I was just being frisky. We used to have a pretty adventurous love life, and one of the things that she had liked was for us to start out with her pretending to be asleep. She figured that maybe that was what I was doing. She even noticed that I had apparently put on a new after shave, as the room had smelled like salty copper ever since I had walked in. And so she did that. But I didn&#39;t pounce. I just putzed around the room, slowly and quietly, looking at stuff. I looked at the pictures on the dresser. I looked at and even smelled the clothes in the hamper.</p>\n\n<p>Then she realized something. She could very clearly hear me snoring out on the couch in the living room. </p>\n\n<p>She lie there frozen in fear and trying to wake herself up as I continued to creep around the room. I was deliberately being quiet, but I was also definitely interacting with my environment and that led to the occasional creek or light tap when something was set down. She had had a history of night terrors and sleep paralysis as a kid, so she figured that was what was going on. At one point, she says that she whimpered, and I jumped like I was startled, went stiff as a statue, and stared at her with a furrowed brow for several minutes before going right back to what I was doing. Eventually, I just walked out of the room and closed the door. She&#39;s pretty sure that she heard the front door being opened as closed as well. She didn&#39;t leave the room for the rest of the night. </p>\n\n<p>She had just figured that the whole thing was just a nightmare or an episode of sleep paralysis. It hadn&#39;t been worth mentioning. Of course, now that I had told her what had happened to me, she&#39;s really freaking out. That was definitely not me in the bedroom that night. I&#39;ve never sleep walked in my life. She is certain that it was definitely not her in the living room two nights ago, either.</p>\n\n<p>I got to thinking about that smell that both of our experiences had had in common. I had definitely smelled it before. I mean, like anyone else, I&#39;ve given my keys or a handful of change a good sniff a few times in my life. But I&#39;d also definitely smelled it out in the real world before, too. I distinctly remember catching a few whiffs of it back in November while deer hunting in the early morning. Around that same time, I&#39;d caught it while raking leaves in the evening before a starting a nice fire. Sometimes over the winter, the inside of the car had that smell in the morning on my way to work. I&#39;d always given it literally zero thought.</p>\n\n<p>We&#39;ve never been burgled and the area is really safe. Still, we took an inventory of our stuff. There was nothing missing. Everything was value was where it was supposed to be. We looked around the house, inside and out. There were no ominous scratch marks along the walls or anything like that. There were no giant monster tracks outside, just the normal deer tracks along the drive way and around the bird feeders. </p>\n\n<p>The whole time that I was checking outside, I did have those prickly-hair inducing feelings like I was being watched. I chalked that up to my most recent experience and the scary story that my wife had just told me. There were no critters out and about, not even the handful of squirrels that always seem to be around the birdfeeders, so I&#39;m sure that I was alone. Either way, I got myself back inside without dillydallying. </p>\n\n<p>We checked, closed, and latched all of the windows. The house has two doors. The back door is always locked. The front door is never locked, because we live way up in the country and, again, it&#39;s always been really safe. It&#39;s nothing but woods, and I&#39;m confident that raccoons can&#39;t work doorknobs yet. We made sure that the back door was locked and we locked up the front door as well. </p>\n\n<p>Some people suggested getting a camera. I&#39;m pretty cheap and lazy, but I&#39;ll definitely consider that if anything further happens. We&#39;ve never had anything spooky like this happen before. We&#39;re homebound for the weekend, but, come Tuesday, I think I&#39;ll ask around town and work. Maybe someone else has had something similar happen. Maybe some local teenagers are out stealing underpants and loose change or something. </p>\n\n<p>We&#39;re going to sleep in the same bed tonight. For her, at least, it&#39;s going to be a long night. I&#39;ll sleep great, especially since I think that her new anxiety will keep the bathroom trips to a minimum. </p>\n</div>\n","author":"JohnQK"}