{"rank":"920","title":"Something strange happened to my sister's best friend when she was a kid. When we caught up with her in later years she filled us in. This is what she told me.","id":"8mdy42","url":"/r/nosleep/comments/8mdy42/something_strange_happened_to_my_sisters_best/","time":"1527376976000","body":"<div class=\"md\"><p>Emily was my sisters best friend from childhood. In the 90s on Saturday mornings they would always be at each other&#39;s homes doing whatever little girls would do. Truly inseparable. Both families were close. I used to play for the same club as her brother (but that&#39;s not important). </p>\n\n<p>Anyway it all came to an abrupt halt and ultimately Emily&#39;s family moving away under unclear circumstances. Many years went by to no explanation of why they moved. Thus the miracle of social media reconnected us. A now grown-up Emily filled us in, along with her parents. </p>\n\n<p>Emily&#39;s mother works nights for a local radio station. When coming home from a night shift she would stay in the spare room downstairs. Emily thought this was so as not to wake up her father who works from an early start (postman). Her mum would always make some scrambled eggs for herself before bed. Emily always remembered the stench of the eggs filling the house most nights. </p>\n\n<p>Now Emily had a small bladder. So she had to make a few trips to the toilet during the course of a night. Like most bathrooms, Emily&#39;s is facing the top of the staircase leading downstairs. </p>\n\n<p>Occasionally during the night, Emily&#39;s mum would call up to her from the spare room to turn the upstairs hallway light off. From what Emily told us in later years, she was never nice about it either. She always seemed super pissed that Emily would constantly need to have the upstairs hallway light on to guide her to the bathroom. </p>\n\n<p>On one such occasion, Emily emerged from the bathroom during the dead of night. Her mother&#39;s voice lingered at the bottom of the stairs in the main hallway. &quot;Emily. I need you to come here&quot; said her mother in a calm manner.  &quot;I need your help with something, come down here please.&quot; Normally her mum would call from the downstairs spare bedroom and in a less polite manor. This time the voice was coming from the bottom of the seldom lit staircase. </p>\n\n<p>Emily replied &quot;I can&#39;t see the steps. Turn the light on first and I&#39;ll come down&quot;.\n&quot;Emily&quot;, this time in a more authoritative tone, &quot;Come to me. Now.&quot;. </p>\n\n<p>According to Emily. Something was off. She couldn&#39;t put her finger on it, but some primal instinct inside her was screaming not to go down. </p>\n\n<p>At that point being the 11 year old girl she was, she wanted her daddy. Emily walked into the bedroom and turned the light on......</p>\n\n<p>Ok so in later years Emily&#39;s father also told my mum of what he saw. Little Emily walked in and turned the light on, she seemed to stand there for a short moment. Then her face went completely pale and her eyes widened. She let out a screeching wail. </p>\n\n<p>Her mother was in the bed beside Emily&#39;s dad. Emily&#39;s mum never stayed in the spare room downstairs and hated scrambled eggs period. </p>\n\n<p>So.... yeah. They moved to Emily&#39;s uncles for a few weeks until they sold the house for half the market price. Then moved somewhere else. </p>\n\n<p>Emily told me that she had to see a therapist, because every time she sees or smells eggs, she has a panic attack. Even today. </p>\n\n<p>To be honest I don&#39;t fucking blame her. </p>\n\n<p>-----------------EDIT-----------------</p>\n\n<p>This was my first time writing something of this scale. So thank you all for your kind words.</p>\n\n<p>You&#39;re awesome! </p>\n</div>\n","author":"donalc93"}