{"rank":"209","title":"\"Save 26 minutes by taking an alternate route.\"","id":"8mdzxb","url":"/r/nosleep/comments/8mdzxb/save_26_minutes_by_taking_an_alternate_route/","time":"1527377491000","body":"<div class=\"md\"><p>When I was 21 years old I went with my brother and some friends to a concert in north Texas. The experience was great and accompanied with loads of alcohol and drugs as one would expect. My brother and I weren&#39;t exactly big on drugs though but being born and raised south Texas we could handle our fair share of liquor. Now the reason I&#39;m explaining the alcohol is because it is the only thing that could possibly explain the experience I encountered when heading back to south Texas. While driving on the high way my google maps app advertised a shortcut. </p>\n\n<p>&quot;Save 26 minutes by taking an alternate route.&quot;</p>\n\n<p>Normally we wouldn&#39;t go for these little 5 min shortcuts but this one was a 26 minute shortcut so naturally we took it. The only problem was unbeknownst to us there were no gas stations leading down this route and we only had an 8th of a tank left in our car, which led to us being stranded. </p>\n\n<p>Naturally being the oldest my brother took responsibility and decided to take the 3 mile walk up the road to the nearest gas station. Before leaving my brother reminded me to not wander off and avoid interaction with strangers.</p>\n\n<p>&quot;Yes I know I&#39;m not a kid Eric&quot; I replied.</p>\n\n<p>&quot;Just making sure, also James remember I have a gun in the trunk in my backpack incase anything does happen&quot;</p>\n\n<p>My brother always kept a gun in his car as a just in case thing. He&#39;d always tell me \n&quot;Better to have it and not need it than need it and not have it.&quot; I assured him I&#39;d be fine and he walked off. I sat in the heat of the car for about 45 mins until I decided to get out and sit on the trunk. A little while later I saw in the distance what looked like my brother walking my way. </p>\n\n<p>&quot;God damn that was fast what did he run the whole way?&quot; I told myself.</p>\n\n<p>The person walked up to me and I could immediately tell it wasn&#39;t my brother after all as it got closer. Eventually it walked right up the the back of the car and talked to me.</p>\n\n<p>&quot;Ready to go?&quot; It said while lifting a full jerry can.</p>\n\n<p>&quot;What... do I know you?&quot; I replied confused.</p>\n\n<p>&quot;James it&#39;s me Eric, stop messing around.&quot;</p>\n\n<p>&quot;What is this a joke? I know you aren&#39;t my brother. </p>\n\n<p>I jumped down from the trunk of the car and kept my eyes fixed on this man. I quickly noticed he never blinked, not once just kept direct eye contact with me at all times.</p>\n\n<p>&quot;Umm... so where the fuck is my brother&quot;</p>\n\n<p>&quot;Fuck... I knew I should&#39;ve gotten a closer look&quot; it said.</p>\n\n<p>In an instant the figure closed in on the gap between us and swung... that was the last thing I remembered before waking up crammed in a tight space which I quickly realized was the trunk. My hands and feet were bound and I was gagged. The noise that woke me was the voice of my brother. </p>\n\n<p>&quot;Hey, was a long walk but I&#39;m back, brought some snacks and water too&quot;</p>\n\n<p>&quot;Thank you&quot; a voice responded.</p>\n\n<p>&quot;Is something wrong man?&quot; I heard my brother ask.</p>\n\n<p>&quot;No I&#39;m fine&quot;</p>\n\n<p>&quot;You sure man? You&#39;ve been staring at the dash, if you&#39;re getting sick you better not puke in my car&quot;</p>\n\n<p>&quot;IM FINE&quot; the voice that I could now distinguish as my own replied.</p>\n\n<p>I sat in the trunk puzzled trying to peace together what was going on... was I having an out of body dream? Did I take something? The car roared to life and I heard my brother let out a small woo of joy. </p>\n\n<p>&quot;Alright man let&#39;s get going, but first things first play some music. I would but I need to charge my phone.&quot;</p>\n\n<p>There was a pause then I heard the other voice reply to Eric.</p>\n\n<p>&quot;Erm... I don&#39;t know where my phone is.&quot;</p>\n\n<p>&quot;All good man I&#39;ll just call it.&quot;</p>\n\n<p>Within seconds my phone rang from my pocket.</p>\n\n<p>&quot;Your phones in the trunk man, go get it.&quot;</p>\n\n<p>The trunk lid then flew open and I felt a rush of fresh air and the warm hit sunlight my back. I knew it was my chance I rolled my body out and felt my wallet slip out of my pocket as I fell onto the ground while making as many grunts I could and slapped the flirt with my bound hands and feet. The commotion I created worked as I heard my brother get out of the car and yell. </p>\n\n<p>&quot;Okay, I knew something was going on, so what the fuck is up? Who the hell are you?&quot; </p>\n\n<p>&quot;You know damn well who I am Eric&quot; </p>\n\n<p>&quot;Yup, just as I thought&quot;</p>\n\n<p>I turned over and saw my brother draw his gun and heard two gun shots. My ears rang and eventually I felt consciousness slip away as I felt my brother pick me up.</p>\n\n<p>When I woke up I jumped and quickly looked around. </p>\n\n<p>&quot;Woah you okay man? You have a bad dream?&quot; My brother asked.</p>\n\n<p>&quot;Umm no but what happened? Didn&#39;t you shoot someone?&quot;</p>\n\n<p>My brother&#39;s face turned serious as he stared at me the he quickly laughed.</p>\n\n<p>&quot;Man you really need to stop watching all of those crime shown on Netflix&quot; He laughed.</p>\n\n<p>The rest of the trip went smooth and I began to realize I just had a bad dream. That was until I went to get my bags from the trunk. I picked up my suitcase and backpack and sitting on the trunk floor my wallet. How did that get there? I thought to myself. Then I remembered the dream.. when I squirmed out of the trunk my wallet fell from my pocket. I quickly felt around and looked for anymore evidence that this dream was real. In the corner of the trunk I found a silver spent .45 casing... just like the self defense hollow point rounds my brother uses. </p>\n\n<p>I&#39;m not sure what to make of it but this pretty much confirms that what I felt wasn&#39;t a dream. The wallet, casing and the soreness of being hit and falling out of the car were all enough to prove to myself it was no dream. I don&#39;t know what it was that attacked me and my brother, nor can I guess why my brother seemed to know whatever it was, but I need to find out what&#39;s going on. I&#39;ll supply updates if I do find anything. </p>\n\n<p>Also forgive the lack of indenting on paragraphs and any small errors, I wrote this out on my phone.</p>\n</div>\n","author":"TheRoomM8"}