{"rank":"35","title":"My girlfriend has rough feet","id":"8me45m","url":"/r/nosleep/comments/8me45m/my_girlfriend_has_rough_feet/","time":"1527378737000","body":"<div class=\"md\"><p>My girlfriend Sarah has rough feet. Okay, they are pretty much like coarse fine sandpaper. So recently she has been trying some remedies. First she took to the internet to see what she could do. Trying out all kinds of lotions, oils, and rubs. She eventually came across something called a “Foot Mask”. If you’ve never heard of a foot mask before, it’s a chemical treatment you leave on your foot for about an hour and then a few days later your skin peels ultimately leaving you with nice baby smooth skin. This was exactly what she needed, or so she thought. </p>\n\n<p>After a few trips to our local drug store she ended up trying all of the different types of foot masks they had to offer, and after 3 weeks of trying, nothing seemed to work. I kept explaining the best course of action next would just be a quick trip to the dermatologist. But, as stubborn as she is, she knew that there was something out there that could solve her issues. One magic salve that would transform her feet into soft pillows. After some searching she believed that she just might have found the right one. </p>\n\n<p>It was from a Chinese beauty site, but all of the reviews seemed to be in English and they were going on and on about how their feet have never felt smoother. This was a sign to her, the fact that all of these people were describing the same issues she had gave her all of the convincing that she needed. Being from China the shipping would take about two weeks. Well worth the wait she said if it cured it like it claimed it could. While we waited I began working the late shift  and getting home while she would already be asleep. But knowing the fact that she has been having so many issues with her feet, I would gently rub them while we laid in bed. It helped her, and in turn became part of our nightly ritual so much in fact that I couldn’t go to sleep either without giving her a foot rub first. The next part of the story is verbatim what has been told to me. I felt it has been a very strange experience and thought that you all might find it interesting, or even maybe know what had happened. </p>\n\n<p>The foot mask came in just shy of three weeks from when she bought it. The packaging was nominal but it was covered in Chinese characters, Sarah figured it was just the Chinese version of Amazon or something. She never gave it a second thought. Opening the box gave her pause though. It wasn’t in some neat sleek hipster container covered in gold or bright colors. No, this was just white powder in two plastic bags. Next to it were the instructions. It was all in pictures so it would be universal. It showed a diagram of someone emptying the bags into a bowl, mixing it with water, and then applying it to a foot. </p>\n\n<p>It seemed simple enough, the only issue to her was that it didn’t even mention how long to keep on the cream. She figured it was like all other foot masks so she decided an hour would do it. She could not wait to get this magical cream on to her feet and decided that night all of her problems would go away. After we had dinner and I set off for work I could tell she couldn’t hardly contain her excitement. She kept referring to it as her “big day”. She nearly pushed me out the door so she could get started. Seeing me off she slammed the door and ran to the bathroom where she had a bowl and supplies already prepared. </p>\n\n<p>She took the first bag and carefully cut a slit in one of the corners with a clean snip from her scissors. She expected a smell but the powder was seemingly odorless. She grabbed the bowl and emptied the contents of the bag. She was about to add the water when she realized there are two bags. She wasn’t quite sure if this was something you could do multiple times so they gave you two bags, or you needed to mix both bags for one application. She consulted the diagrams but it wasn’t clear. After a shrug of her shoulders she snipped and emptied the second bag into the bowl. </p>\n\n<p>She turned on the bathroom sink faucet and allowed some water to drip into the bowl. She realized another thing. The diagram also didn’t specify how much water to add. She decided she would go for a nice pancake batter like consistency and and did just that. Stirring up the mixture with a spoon it suddenly hit her. The smell. Obviously the mixing of the water and the powder had started a chemical reaction. It smelled of pure chemicals and reminded Sarah when she used to help her father clean out the septic tank of their family RV. It was putrid. She quickly turned the bathroom fan on in hopes that it would clear out some of the stench. It did not. She set the bowl down and ran out of the bathroom nearly retching. Sarah covered her mouth and wiped the tears that started to fall from her red irritated eyes. She couldn&#39;t believe it, she waited all this time for this? Wiping more tears from her eyes she made a decision then and there. She was going to use the cream no matter what. </p>\n\n<p>She headed back into the bathroom and quickly picked up the bowl. She slathered the cream onto her feet with the spoon and made sure that every inch was covered. She didn’t notice it at first but she slowly started to notice a slight burn between her toes. It wasn’t enough pain for her to immediately want to rinse the cream off, but it burned enough that she began to doubt what she was doing. Just before she decided it might be a bad idea, she realized that the pain was starting to go away and soon she didn’t feel the pain at all. So there she was sitting on the closed toilet with Chinese foot cream covering every inch of her feet. She waited an hour.</p>\n\n<p>The timer on her phone vibrated on the kitchen counter and she motioned for the tub in order to rinse off. She set the faucet to full blast and began rinsing her feet. That’s when she knew why she didn’t feel the burn anymore, her feet were numb. She could hardly feel them at all. Rinsing the rest of the cream away she saw that her feet were also now a bright lobster red. Lobster red and numb are not good side effects of any beauty product. At this point she began to panic and hurriedly rinsed the rest of the cream off. She shuffled into the bedroom and sat on the bed. She wanted to call 911 or go to an urgent care but something was telling her that it would be all okay. Maybe it was her eagerness for this cream to work, or maybe it was just plain old denial. Whatever the reason, Sarah decided to wait it out and see how it looked in the morning. She  also hadn’t noticed at all at how tired she had become. She laid straight back and closed her eyes and quickly drifted off to sleep; her putrid smelling bright red feet dangling off of the edge of the bed. </p>\n\n<p>Sarah laid there in a dreamlike state for a few hours. At that point she had noticed the numbness spread to her entire body. She couldn’t move at all except her eyes. She also noticed something else. Her body was moving slightly. She could tell as she looked up at the ceiling that there was slight movement. She tried to say something that the numbness denied. Her eyes rolled about in a panic to get a glimpse but she couldn’t see anything out of the ordinary in her bedroom. She could however still hear things. Listening intently she could hear a wheeze, no it was a breath. </p>\n\n<p>Sarah at first thought it was just me home from my shift and started the nightly foot rubbing ritual. But this presence she said was different. It felt wrong, and it scared her like nothing she had ever encountered before. Someone or something was in the room. Her body moved again and the bed jostled slightly. Her vision was clear, whatever was moving her and the bed was just out of sight. She could hear her heart racing and her breathing became uncontrollable. She was in full panic mode. Beyond her breathing she began hearing something else. A familiar sound. A sound that everyone knows and hears every day. The sound of eating. Chewing. Gnawing. Crunching. </p>\n\n<p>At first a slight tearing sound, and then a crunch. It sounded like someone peeling a sticker. Peeling. Tears began to roll down her cheeks. She was paralyzed and she has now just figured out that something had began to eat away at her feet. The noises continued. Peel. Crunch. Peel. Crunch. And the wheezing. The slow breath of something or someone eating your flesh was enough to make her yell in terror, if she could yell. She could hear it feasting, and swallowing as if it was enjoying a regular meal. The bed jostled again and that’s when she saw it. A hand, it looked human enough but it was covered in red sores and blisters, like the kind you see on someone that has been badly burned, but then the wounds got infected. She could smell it and realized she had just smelled that smell not too long ago. </p>\n\n<p>It smelled exactly like the cream. The hand was in front of her face and closing in on her. She wanted get up and run or fight but her body wouldn’t respond. The hand then touched her. It covered her face and closed her eyelids. Sarah screamed internally but the scream then turned into an echo and became distant. She was passing out, and soon she drifted back into that dreamlike state. </p>\n\n<p>The next morning she woke me up screaming. A scream I had never heard before. I can still hear that scream and it curdles my blood to this day. She told me this story that I have now told you. We tried to look up the website but apparently it has since been shutdown or deleted. We may never truly know what happened, but hey, her feet do look pretty soft now. </p>\n</div>\n","author":"Constantine1991"}