{"rank":"870","title":"Something Escaped From the Human Auction","id":"8me40d","url":"/r/nosleep/comments/8me40d/something_escaped_from_the_human_auction/","time":"1527378697000","body":"<div class=\"md\"><p>My employer didn’t contact me after <a href=\"https://www.reddit.com/r/nosleep/comments/8kycig/last_night_i_went_to_a_human_auction/\">the auction</a>. I broke protocol by trying to reach him myself, but no luck. It&#39;s probably just as well he didn&#39;t answer. My instructions are extraordinarily clear, you see: I only come when called.</p>\n\n<p>And to be fair, radio silence isn’t entirely unusual. Once I’ve served my purpose, my employer occasionally pretends I don’t exist.</p>\n\n<p>So I decided to go home, rest, and wait for the next assignment in peace.</p>\n\n<p>I did this for four days.</p>\n\n<p>But I woke on the fifth knowing something was wrong.</p>\n\n<p>I reached for my weapon and searched the house. My home is small and clean, with no convenient hiding places. It took only a few minutes to clear. </p>\n\n<p>My heart thumped heavily, pulsing in my guts and my throat. I could hear the soft whisper of my feet against the carpet, as well as the gentle settling of my body every time I took a step.</p>\n\n<p>Every internal alarm continued to scream. Something was very wrong. And whatever it was, it had to be outside.</p>\n\n<p>My home sits in the hills between two tiny towns you’ve never heard of. It’s surrounded on all sides by sheer drops and dangerous slopes covered with pines and twisted valley oaks. Even on the best days, it looks like a haunted forest.</p>\n\n<p>This definitely wasn’t one of its best days.</p>\n\n<p>I stepped out the front door and scanned the landscape. Still and quiet except for the soft buzz of insects. I tightened my grip on my gun and circled the house. Everything looked normal.</p>\n\n<p>Then I reached the back patio.</p>\n\n<p>On the bleached concrete lay a scattering of leaves, needles, and fresh twigs arranged in a pattern. The shapes looked like letters, but not from any alphabet I knew. A line of dirt trailed from the last symbol, spilling off the patio. A sharp dropoff lay just beyond.</p>\n\n<p>I drew a deep breath and crept to the ledge. </p>\n\n<p>I know my property. At the bottom of that dropoff sits a grove of small, stunted oak trees. But that grove was gone, replaced with a black obelisk. Perfectly smooth, neither dull nor bright. And it didn’t even look entirely solid. More than anything, it reminded me of a hole. </p>\n\n<p>I checked for signs of tree stumps and disturbed earth, but saw none. You couldn’t even tell someone had uprooted the trees. Actually, you couldn’t tell trees had ever been there in the first place.</p>\n\n<p>I glanced over my shoulder. My house stood there, silent and welcoming. Crows cawed and bees droned past. Dandelions and orange poppies fluttered in the breeze. It should have been a beautiful day.</p>\n\n<p>A steep, circular path spirals around the patio and down into the land below. I followed it to the bottom of the dropoff. The obelisk loomed, fat oval tapering to a narrow point. Up close it didn’t look like a hole. More like an abyss. Nonexistence incarnate. </p>\n\n<p>Who’d put it there? How had they done it?</p>\n\n<p>And <em>why?</em></p>\n\n<p>The trailed rounded the obelisk and stopped at the base. </p>\n\n<p>Something flickered in that indistinct darkness, like a light. It died, then exploded: a thousand shreds of neon bursting into being. Multicolored lights cascaded through that nothingness, dancing and swarming into hypnotic shapes. They stretched and contracted, spun in and spiraled out. And finally, after a small eternity, they resolved into letters.</p>\n\n<p><em>SOTEIRA SOTEIRA</em></p>\n\n<p><em>SEE THROUGH MIRRORS</em></p>\n\n<p><em>LOOK BEHIND YOU</em></p>\n\n<p>A sharp, deafening <em>crack</em> shattered the silence. I backed into the obelisk, taking advantage of its scant cover, and turned.</p>\n\n<p>For perhaps the first time in my career, I froze.</p>\n\n<p>A great horned worm, easily the size of an oak, dragged itself across the dirt. Scores of luminescent parasites squirmed across its skin. They flared, glowing bright purple as they disappeared into open sores.</p>\n\n<p>The worm shuddered and shot upward, throwing me into shadow. A rush of faint, wet clicks sounded as a thousand eyes blinked open all over its body. Long and narrow, round and wide, human and mammal, fish and reptile, every kind of eye imaginable, peering from nests of ravaged skin.  </p>\n\n<p>Its mouth quivered and contracted, spinning open to reveal a vast, toothless void. Soft light flickered within, mesmerizing and beautiful as bioluminescent waves.</p>\n\n<p>I realized I was sinking. Not to the ground, but backward. Like the obelisk was rotting.</p>\n\n<p>Or opening up.</p>\n\n<p>Suddenly I fell. A pall fell over that bright spring day, dark and shadowed, like I was looking through a fine mesh screen.</p>\n\n<p>The worm lunged. I kicked back and rolled, but there was no need; it slammed violently against an invisible barrier. Head and eyes smashed together. Vast quantities of fluid and threadlike worms oozed down like a drizzle across glass.</p>\n\n<p>It drew back and charged again, but no luck. It was trapped.</p>\n\n<p>Or rather, <em>I</em> was trapped inside the obelisk.</p>\n\n<p>I stood and surveyed my surroundings.</p>\n\n<p>A vast checkered floor spread before me. Black and white tiles reflected a mad cacophony of colors overhead. Towers of bright light soared upward. Several bent and zigzagged, creating a wild geometrical tangle of neon. </p>\n\n<p>I looked behind me. The horned worm waited, curled like a snake preparing to strike. That was it, then. There was nowhere to go but forward.</p>\n\n<p>I crept to the nearest wall. It was black as the ceiling and filled with images rendered in colors too dark to make out. Barely more than impressions, they played tricks on my eyes. The illustrations seemed to blend into each other and move until I looked straight at them. Then they were still, verging on nothingness, until I turned away.</p>\n\n<p>The room was incredibly vast and empty. But it wasn’t silent. A low drone permeated the space. It was almost comforting, like a white noise machine.</p>\n\n<p>After a long, long time, I stopped. Behind me, the entrance had disappeared into that neon-tinted darkness. Nothing before and nothing behind except a sea of black and white tile.</p>\n\n<p>Panic exploded for just a second, but I buried it quickly. This was the weirdest situation I’d ever faced – weirder even than the auction – but hardly the most dangerous. I had a gun. I was alone. I was in control. </p>\n\n<p>I was fine.</p>\n\n<p>I kept going.</p>\n\n<p>Finally, just as my legs began to hurt, a pinprick of clear white light appeared in the distance. </p>\n\n<p>Panic reared its head again. This time, I gave in and ran.</p>\n\n<p>It grew quickly, resolving into another oval doorway. </p>\n\n<p>Just beyond it was Harlequin.</p>\n\n<p>He sat across from a suited man. The stranger looked slick, strong, and imposing. Or would have were it not for his guilty, pained expression.</p>\n\n<p>“We don’t know,” the man said. “That’s why we sent you.”</p>\n\n<p>Harlequin stood up. “No. I’m supposed to be infiltrating goddamned drug rings and whatever shit goes with it. This isn’t a drug ring. This isn’t even <em>people.</em>”</p>\n\n<p>Carnes hesitated. “Maybe something affected your memory. Did they give you anything to eat or drink?”</p>\n\n<p>Harlequin froze for a brief instant. I could practically read his thoughts: the butchered victim, the raw flesh we’d both eaten.</p>\n\n<p>He regained his composure almost immediate. “These people do not drug their security testers! I know exactly what I saw!”</p>\n\n<p>“Guerin –”</p>\n\n<p>“I need your help. Look at this. Fucking look.” Harlequin slammed a cell phone on the desk. “They think I stole something.”</p>\n\n<p>“I know. I saw the messages. But...are you sure?”</p>\n\n<p>“Is anything in that text <em>ambiguous</em> to you?”</p>\n\n<p>“Could it be a language barrier? I mean…they describe the missing lot as ‘the Cult’. That doesn’t make sense to me.”</p>\n\n<p>“I don’t care what makes sense to you. I care that they’re chasing me down!”</p>\n\n<p>“And if they are? They don’t even know what you look like, Guerin. <em>I</em> don’t know what you look like. The mirror keeps you -”</p>\n\n<p>“Bull<em>shit</em>. You have cameras. They have cameras. I’m fucked because you didn’t do your job. Now I need help.”</p>\n\n<p>“Well, okay. Okay. Can you find whatever went missing? Could your contacts help you track it?”</p>\n\n<p>Harlequin exploded just as the door went dark.</p>\n\n<p>I gasped and ran forward, running my hands over the surface. No door, no window. Just smooth, black wall.</p>\n\n<p>At that moment, my phone rang.</p>\n\n<p>I looked around nervously. Nothing. No movement and no sound other than the echoing chirp of my cell. </p>\n\n<p>I checked the number. Relief immediately flooded me: it was my employer. </p>\n\n<p>Then, right in front of my eyes, the contact name rearranged itself into a message:</p>\n\n<p><em>DO NOT STEP INTO THE TRAP</em></p>\n\n<p>Something wet and hot pattered onto my hair. Thinking absurdly of summer rain, I looked up.</p>\n\n<p>The first thing I noticed was its skin. Tricolored and striped, bursting with dripping sores. Long eyes wrapped halfway around its head and spilled down to the tip of its nose. Four-pointed pupils slid wildly from one end to another.</p>\n\n<p>It was humanoid, but barely. I watched, stunned, as it detached itself from the wall and stretched a long, puffy hand toward me. It hesitated for an instant, then snatched my phone.</p>\n\n<p>That broke the spell. I retreated and shot at it. </p>\n\n<p>The monster uttered a bone-shaking, explosive wave of sound that forced me backward. The dark wall cracked and shattered, offering a glimpse of a nondescript room. </p>\n\n<p>I shot at the creature several times. Each bullet split my eardrums apart. The monster dodged easily, climbing until it disappeared into the neon web above.</p>\n\n<p>I glanced longingly at the room, then up at the ceiling. Empty. Silent.</p>\n\n<p>It was stupid. Probably the stupidest thing I’ve ever done.</p>\n\n<p>But I was hungry, thirsty, and tired. Besides, I had a gun.</p>\n\n<p>So I crossed the threshold.</p>\n\n<p>It was a living room, Spartan and nondescript except for signs of old neglect. Cracked walls, water-spotted paint, threadbare carpet. The vaguely third world scenery outside the window suggested do.</p>\n\n<p>I turned nervously. The doorway was still there: a vast, dark oval. Not an obelisk so much as a massive hole in the wall.</p>\n\n<p>Darkness spread over it, quickly forming a dark, flat surface. Small lights flickered into being once again. I waited patiently as they spun and spiraled into words.</p>\n\n<p><em>SOTEIRA SOTEIRA</em></p>\n\n<p><em>WAIT HERE</em></p>\n\n<p><em>SEE THROUGH THE MIRROR</em></p>\n\n<p>Shuddering, I turned my back and explored the apartment. </p>\n\n<p>I was in an apartment. The power and water worked, and the fridge held a surprising amount of food. The dish drainer held a skillet and a single set of dishes, but nothing else.</p>\n\n<p>In the bedroom I found a cheap platform bed, a few changes of men’s clothes, and a miserably slow, unsecured laptop.</p>\n\n<p>Otherwise, the apartment is empty. No furniture, no TV, not even soap. </p>\n\n<p>I wandered back into the living room. The neon message remained, bright and blaring as a neon sign. </p>\n\n<p><em>WAIT HERE</em></p>\n\n<p>The instructions are clear. I’m going to follow them for two reasons.</p>\n\n<p>First, if Harlequin is to be believed – and I have no reason to think the scene I witnessed was false – something escaped the auction. The auctioneers are after Harlequin because of it.</p>\n\n<p>This means they’re probably chasing me, too.</p>\n\n<p>Second, I looked up the word soteira. It means “savior.” I don’t know what’s happening, but I do know that people don’t generally kill their saviors. There are no guarantees, but I think it’s a reasonable assumption.</p>\n\n<p>I’ve been here several hours now. The obelisk hasn’t opened. The message changed. Now it says:</p>\n\n<p><em>SOTEIRA SOTEIRA</em></p>\n\n<p><em>WHERE DO YOU COME FROM?</em></p>\n\n<p>“Where do you come from?” I asked suddenly.</p>\n\n<p>The lights flared and spun together, forming a single word:</p>\n\n<p><em>KHTHONIOS</em></p>\n\n<p>I looked it up. It’s an Anglicized translation of the Greek word that means subterranean. I don’t understand the significance. Maybe they’re trying to tell me they’re demons or mole people. </p>\n\n<p>I’m sure I’ll understand soon enough. In the meantime, I’m trying to relax. I don’t know what I’m waiting for.</p>\n\n<p>But I’d like to be rested when it comes.</p>\n</div>\n","author":"Dopabeane"}