{"rank":"10","title":"These people kept following us..","id":"8me7e5","url":"/r/nosleep/comments/8me7e5/these_people_kept_following_us/","time":"1527379673000","body":"<div class=\"md\"><p>This is my first post here. I feel like I really need to get this creepy ass story off my chest. </p>\n\n<p>Today, I was driving through town with my girlfriend and my little brother, when this blue van pulled in directly behind us, out of all the empty lanes. I didn’t think much of it, so I kept driving, until I noticed them still following us to Walmart. I wasn’t skeptical until I saw them, a tall blonde girl and a short red head girl, step out of their car. When we walked into the store, they followed us everywhere. I turned to say something to them, but they seemed to have disappeared. I sighed, walking onwards, until I hear their footsteps again. My girlfriend, Alex, a tough girl with short hair and tan skin, grabbed one of them by the shirt, angry. “You got something to say, punks?” She shouted, angry.</p>\n\n<p>I grabbed her shoulder and coaxed her away. “Calm down, Alex.” She grunted and backed off. I looked at the two woman and said, much more calm, “I’m going to ask you guys nicely to leave us alone before I get the police.” I turned, taking Alex’s hand, walking away. I sighed, and we left. On the road I saw the SAME FUCKING BLUE VAN following us again. I pulled over to let them pass, but they pulled over too. I shifted into 3rd gear and booked the fuck out of there (yes I drive a shift). When we pulled up to my parent’s house to drop my little brother off, those fucking ladies once again pulled in after us. I got out and took a picture of their license plate, before knocking on their window. When they rolled down the window, I could’ve fucking swore their eyes were dead black. I didn’t stay long, before I got the hell out of dodge. </p>\n\n<p>Pulling into my apartment, I got out and rushed Alex up to our room. I locked the door, shut and locked the windows, close the curtains and blinds, grabbed my shotgun, and went to bed, holding onto Alex and my shotgun for dear life (I’ve been known as a sorta-pussy). I heard knocking that night: knock, knock, knock. Knock, knock, knock. I went to the door, clenching the gun, and looked through the peephole. I almost screamed. There was a picture, taped up to it, of my entire family dead. I hear shuffling in my room and Alex shout. I rushed in to see Alex pinned up by the blonde. The red-head came out of my closet, but I hit her, shot the blonde, and then shot the red-head when she got back up.</p>\n\n<p>After calling the police, I held Alex close, shaking and crying, until they questioned us. After checking their house, they were married, named Dean and Jane Fox, they found my dismembered family in their basement, pictures of me, Alex, my family, and all kinds of people they had killed. </p>\n\n<p>They moved me and Alex into a new complex, and in my restless sleep that night, I heard a knock, knock, knock. Needless to say, we moved the fuck out of town.</p>\n</div>\n","author":"blue_turtle_bunny"}