{"rank":"144","title":"I never existed.","id":"8me8xw","url":"/r/nosleep/comments/8me8xw/i_never_existed/","time":"1527380082000","body":"<div class=\"md\"><p>May 24th, 2018: <em>The</em> <em>RCMP are attempting to solve a case of an apparent missing, unidentified female, known by the name of Hallie. The following are transcripts from video recordings and diary entries found on an abandoned cell phone found in Northern Ontario. The missing female in question may be mentally ill, but is unlikely to be dangerous. Anyone with information on the identity or whereabouts of this individual are encouraged to contact RCMP immediately.</em></p>\n\n<p>________________________________________________________________________________________________________________________________________</p>\n\n<p>Diary Entry: January 20th, 2016:</p>\n\n<p>Something isn&#39;t right. I don&#39;t even know how to process this. I must be dreaming. I woke up in my room this morning, but my room was completely different. I jolted in my bed when I realized that there were none of my pictures, none of my artwork, and absolutely none of my clothes. My room was my sanctuary, and a place where I could be creative. I expressed myself through my art. To see it all disappeared was a huge shock to me. Had I been sleepwalking? If I had been, where the hell would I have put all my stuff? I leaped out of bed and darted down the hallway to my kitchen.</p>\n\n<p>&quot;Mom? Where&#39;s all my stuff from my room?&quot; I called out when I saw my mom, making breakfast for my dad as she did every morning. She turned at the sound of my voice, and a look of disgust crept over her face. </p>\n\n<p>&quot;Who are you? What are you doing in my house?&quot;</p>\n\n<p>I halfheartedly laughed. My mom had always had an odd sense of humour. She&#39;s play pranks on my sister and I a lot as kids. That&#39;s just always how she&#39;s been. I was in no mood for joking, though.</p>\n\n<p>&quot;Funny, Mom. Now what happened to my art? And my clothes? Everything is gone.&quot;</p>\n\n<p>The look on her face doesn&#39;t disappear. </p>\n\n<p>&quot;Kevin! Kevin! Come here! Please!&quot; She yells as she drops her frying pan on the ground. Kevin is my dad, and I was super confused as to why she&#39;d be calling for him.</p>\n\n<p>&quot;Mom! What is the matter with you? Why are you calling for Dad? You dropped the frying pan, too. Are you okay?&quot;</p>\n\n<p>I heard my dad storming down the stairs.</p>\n\n<p>&quot;Talia, what is all this commotion at eight o&#39;-&quot; He stops dead in his tracks.</p>\n\n<p>&quot;What the hell are you doing in my house?&quot; He gets right up in my face. Tears begin to stream down my cheeks. </p>\n\n<p>&quot;Dad!&quot; I Plead. &quot;Dad, it&#39;s me, Hallie! I&#39;m your daughter! You have me and Laurel. I&#39;m 18 and she&#39;s 12.&quot;</p>\n\n<p>The scowl on his face sent a chill down my spine. I had never seen my dad, a docile man, so angry before in my life.</p>\n\n<p>&quot;Look, punk. I don&#39;t know who the fuck you think you are breaking into my house. You come in here, call us your parents, and you know my 12 year old daughter? You a stalker or something? Call the cops, Talia. And make sure that Laurel stays upstairs. I&#39;ll handle this.&quot; </p>\n\n<p>My dad reached for the baseball bat that he had always kept at the front door in case of an emergency. I wasn&#39;t taking any chances. I booked it out the front door and down the street. I couldn&#39;t help but notice our family portrait from about 2005 that my mom always had displayed so proudly. I wasn&#39;t in it.</p>\n\n<p>__________________________________________________________________________________________________________________________________________</p>\n\n<p>Audio: January 20th 2016, 8:07am:</p>\n\n<p>*Heavy breathing*</p>\n\n<p>&quot;Okay, I figured I should document all this in audio too. There has to be someone who can help me. Maybe someone will recognize my voice. I think I&#39;ve outrun my dad. I&#39;m hiding in a small wooded area right now. I won&#39;t say much because I don&#39;t want anyone to hear me. I&#39;m going to try my school.&quot;</p>\n\n<p>__________________________________________________________________________________________________________________________________________</p>\n\n<p>Diary entry: January 20th, 2016:</p>\n\n<p>Okay, I just went to my school. I ran in, wearing my pyjamas I had worn to bed the night before. I had no choice, all my clothes were gone. I felt a wave of relief when I saw my best friend, Andrea. Andrea and I have been inseparable since we were 4. I had her back, and she had mine. She knew more about me than anyone else. More than my parents. </p>\n\n<p>&quot;Andrea! Andrea, stop! You have to help me, please.&quot; I gasped. I was out of breath from running so much.</p>\n\n<p>&quot;Do I know you? Are you okay?&quot; She had a similar look on her face that my mother had when I approached her. She took a step back from me. The realization that she had no idea who the fuck I was. Reality was a slap in the face. I began to cry again, my face already stained from the tears earlier in the day. Everyone in the hallway went silent, and turned to stare at me. Their stares burned. I collapsed to the ground, and melted down. </p>\n\n<p>&quot;Guys!! It&#39;s me! It&#39;s Hallie!&quot;</p>\n\n<p>Everyone turned to each other and began whispering and pointing. To them, I was a nobody.</p>\n\n<p>I didn&#39;t blame them for staring. I was a crying mess wearing pyjamas in the middle of the hallway. I was escorted out by the principal, and received a warning that I were to never enter the school again. My pleading was futile. They threatened to have me arrested. I shamefully walked out, and I kept walking for miles. I walked until I couldn&#39;t go on anymore.</p>\n\n<p>_________________________________________________________________________________________________________________________________________</p>\n\n<p>Diary entry: January 25th, 2016:</p>\n\n<p>I haven&#39;t had the energy to write. I&#39;m losing hope that anyone will recognize me. I&#39;ve been hiding out in mall bathrooms, trying to keep sheltered. I have no money. No ID. No credit card. I have nothing. I&#39;ve tried talking to anyone I see on the street, but to them, I&#39;m just a nuisance. What happened? One day I was laughing with my friends and family, going to school, going to Starbucks for my morning latte. Not even my regular barista recognized me. I&#39;m living a nightmare. I&#39;ve began to pull out my hair in frustration, and I have a few very thin patches. I tried to go back home yesterday night. I knocked on my door. My dad answered. Immediately, he told me he &quot;wasn&#39;t interested in whatever you&#39;re selling&quot; and attempted to close the door. I begged and pleaded with him, but he threatened to call the police. I don&#39;t know what&#39;ll</p>\n\n<p>__________________________________________________________________________________________________________________________________________</p>\n\n<p>Audio: January 25th, 2016, 8:34pm:</p>\n\n<p>*Heavy breathing*</p>\n\n<p>&quot;My last entry got cut off. The police are coming for me. I guess my dad called them. Shit. I&#39;m running, but I know they&#39;ll find me. I have nowhere to hide. (inaudible) LET ME GO! PLEASE, I CAN EXPLAIN!&quot;</p>\n\n<p>&quot;Ma&#39;am, turn off the recording.&quot;</p>\n\n<p>________________________________________________________________________________________________________________________________________</p>\n\n<p>Audio: February 4th 2016, 1:32am:</p>\n\n<p>&quot;Someone...anyone...help me. I&#39;m in the woods. The last time I was able to charge my phone at a mall was almost two days ago. My phone is dying. I don&#39;t know where I am. It&#39;s not too cold tonight thankfully. After I was arrested, I explained why I was trespassing. Of course, no one believed me. They took me to a mental hospital, and held me for a few days. I escaped two days ago, and I&#39;m just on the run so they won&#39;t find me again. They think I&#39;m crazy. I think I&#39;m crazy.</p>\n\n<p>I was able to start a fire to keep warm. I had to steal a coat, mittens, a pocket knife and food from a few stores I passed in the last few days. I&#39;m so sorry. (Inaudible) someone please...I need someone who can help me. I can&#39;t live like this. Why does nobody know who I am? It&#39;s been nine days.&quot;</p>\n\n<p>*Muffled cries*</p>\n\n<p>__________________________________________________________________________________________________________________________________________</p>\n\n<p>Audio: February 6th 2016, 3:40pm:</p>\n\n<p>&quot;I can&#39;t do this anymore.&quot;</p>\n\n<p>*Loud sobbing for 45 seconds*</p>\n\n<p>&quot;I&#39;m so sorry. I can&#39;t. I&#39;m ending it. No one recognizes me. I have nothing. What&#39;s the point of going on?</p>\n\n<p>*Muffled movement*</p>\n\n<p>I have the knife. I&#39;m slitting my throat. Goodnight, everyone. If anyone hears this, I tried.&quot;</p>\n\n<p>__________________________________________________________________________________________________________________________________________</p>\n\n<p>Diary entry: January 26th, 2016:</p>\n\n<p>I awoke in my bed after a peaceful night&#39;s sleep. When I opened my eyes, I realized that my room had none of my stuff in it. I wasted no time, and ran out of bed to my kitchen.</p>\n\n<p>&quot;Mom! Mom!&quot; I cried. </p>\n\n<p>She turned and looked at me with disgust.</p>\n\n<p>&quot;Who are you? What are you doing in my house?&quot;</p>\n</div>\n","author":"falling_into_gravity"}