{"rank":"15","title":"Two Riders [PART 1]","id":"8melll","url":"/r/nosleep/comments/8melll/two_riders_part_1/","time":"1527383921000","body":"<div class=\"md\"><p>I used to work in Potato Town. Ever hear of it? Was located in Lawrence County, South Dakota. It was one of those little towns that got thrown up overnight during the gold rush. Gone long before I came along. Up till a few years ago all that was left of it were some dirt roads and a few old foundations. There’s a hundred places just like it all over the Dakotas, failed dreams that faded away when gold panned out or the railroad went into another town. Everyone packed up and left the buildings to rot, or burn, or blow over in a twister. A few survive to this day, but Potato Town wasn’t that lucky.</p>\n\n<p>Then, a few years back, one of those fellas from California who made big money in the Internet decided he’d had enough and moved out this way. I can’t say what made him do it, but he got one look at Potato Town and wanted it more than anything. Within a week his lawyers had signed all the papers and given the county a check big enough that they gladly handed it over to him. Ballard was his name, Hugh Ballard. Like all rich men he wanted big toys to play with. Now, he owned a whole town.</p>\n\n<p>Wasn’t long before he announced he was going to restore Potato Town as it was back in the day. This amused a lot of the locals. No one knew a thing about the place, except that it had been there and now it wasn’t. There were no pictures, no old newspapers. No one knew where the mayor or the sheriff or anyone sent their journals, if any had ever been kept. All there was besides the remains of the town itself were a few mentions of something called the Potato Town Massacre in a newspaper from a few towns over. These reports didn’t give a lot of details. Myself, I got to wondering if they weren’t some kind of joke, the paper men of the day being known for their tall tales to fill an empty page. A place with a name like Potato Town was, if you’ll pardon the expression, ripe for such treatment.</p>\n\n<p>Anyway, Ballard made this big announcement in the paper and on the radio that he was going to turn Potato Town into a living history museum, one of those places where you can go and see people in old clothes walking around old buildings, pretending it was 1875 or something. Construction would begin as soon as the county signed off on the permits. Seeing as Potato Town was out in the middle of nowhere and no one really cared what he did with it things got moving pretty quickly.</p>\n\n<p>Ballard’s “restoration” ideas were a little out-there. He was going to cobble the streets and put up Edison-style street lamps, neither of which Potato Town would have had. He also planned on building a fire house and putting an engine in it from a time after the town was abandoned. Guess he figured the tourists wouldn’t notice. But the biggest head-scratcher by far was his intention of building a fort. You’ve seen the old Westerns like <em>Fort Apache</em> with the stockades that had wooden walls and towers. One of those. Far as anyone can tell, there was never one even near the place.</p>\n\n<p>Wasn’t a few months later that he had the first part of the new Potato Town up and built. This included the fort. I saw the ad in the newspaper for employees and figured it might make a good retirement job, taking tickets or manning the snack bar. So, I drove over there and they hired me that day. In fact, it was Ballard himself who hired me.</p>\n\n<p>He came walking in, a well-fed young guy wearing a blue Oxford shirt, Bermuda shorts and penny loafers. We shook hands, and he gave me the once-over.</p>\n\n<p>“Mitch” – that’s my name –  “you have the bearing of a military man. Ever been in uniform?”</p>\n\n<p>I nodded. “Sure, I was in the Army during the Vietnam War. Got lucky, though. They sent me to Alaska for a year.”</p>\n\n<p>“Well, now. I have a role in mind for you here at Potato Town. I’d like you to portray one of the living history interpreters in Fort Pleasant.”</p>\n\n<p>“Fort Pleasant?”</p>\n\n<p>“Yeah, the stockade. I let my girlfriend pick the name. Anyway, what I want is for you to assume the role of a Sergeant in the Cavalry. Can you ride?”</p>\n\n<p>“Sure.”</p>\n\n<p>“Great! That’ll be handy when we get some horses. For now, all you have to do is dress in the uniform of the time, greet the visitors and tell them stories about the place. We have a few outfits in your size, just take the one that fits best.”</p>\n\n<p>I gave it some thought. “Beg pardon, Mister Ballard, but exactly what stories would those be? Potato Town’s been abandoned nearly a century now. And, far as I know, there was never a fort here.”</p>\n\n<p>He shrugged. “Yeah, I’m not gonna sweat the details. Point is, there were forts like this all over the western US back then. Who can say if there was one here or not? Fort Pleasant will be authentic in every way. I’m making a place where history can be experienced! Most people won’t care if I shuffle the deck a bit.”</p>\n\n<p>“Well, it’s a bit late to say, I know, but you might want to ask the Lakota. This was their land once. Building a cavalry fort in the shadow of the Black Hills might have rubbed them the wrong way.”</p>\n\n<p>He thought about it for a second. “Really? Meh, everything’s negotiable. If they don’t like it, I’ll build them a community center or something. Hey, maybe we can set up an Indian Town near the fort! Bet they’d be into that.”</p>\n\n<p>I was set back a bit by his insensitivity, but I let it slide, putting it down to nerves over his business. I’d regret that later. He continued. “But, hey, I need a guy like you, asking questions. Keeps me honest. So! What do ya say, Mitch? Reporting for duty, Sergeant?”</p>\n\n<p>I took the job. The pay was okay and I got to eat at the snack bar for half price. And I needed something to do. Retirement wasn’t working for me, sitting around doing nothing. Better to be out there and meet new folks every day. Could get interesting.</p>\n\n<p>Or, so I thought. First day we were open, three cars came in. Eight people in all. There were more people working there than visitors. Mister Ballard came around and told us all not to worry, things would pick up once the word got out. That’s fine, it gave me a chance to get to know my co-workers better. </p>\n\n<p>One of them was the caretaker, fella by the name of Murphy. He drove all the way from Wyoming to take the job because it came with a bed and two meals a day when the snack bar was open. Had to give up his old job at the factory when the arthritis set in. That lead us to talking about our own old bones for a bit, making jokes and such. Then he got quiet for a moment, like he was deciding something. Gave me a peculiar look.</p>\n\n<p>“Want to see what they found when they were building the place?”</p>\n\n<p>There was no one there to visit, so I said, “Uh, sure, I guess so. What is it, Al Capone’s gold?”</p>\n\n<p>“Ha, I wish. Come on.” We walked over to one of the towers that was secretly a tool shed. Murphy unlocked the door and we went in. The place was a mess, everything tossed here and there. He went right to a sturdy old box stuck up the back.</p>\n\n<p>“They were clearing out the old foundations, the original ones for the houses, and they found this in one of ‘em.” He lifted the lid, and I saw it was filled with bones. Human bones, with three human skulls sitting on top. They were old, picked clean and bleached white. Stuck to the inside of the lid with tacks was a yellowing piece of paper on which had been written in ink:</p>\n\n<p>“POTATO TOWN MASSACRE  1883”</p>\n\n<p>“Holy Moley”, was all I could manage to say.</p>\n\n<p>Murphy nodded and gave a quiet, “Yeah.”</p>\n\n<p>I cleared my throat. “Does Mister Ballard know about this?”</p>\n\n<p>“Of course he does.” Murphy lowered the lid. “It’s his land now. He was here when they found it.”</p>\n\n<p>“Did he tell anyone? Someone at the county?”</p>\n\n<p>“I doubt it. He got all wound up, afraid of the county taking the town away from him, making it a graveyard or a dig site or something. Besides, these fellas might be Lakota, in which case the OST Council’s gonna want to get involved. I told him that was a good thing, showing respect for the dead and all, and he should let them know. He told me I could go back to Wyoming if I couldn’t shut up.” He stared at the ground, shuffled his feet a bit. “I got nowhere to go back to.”</p>\n\n<p>We walked back outside so Murphy could lock the place up again. “Doesn’t sit right with me”, I said, “but we’ll leave it as it is for now. Maybe Ballard will be in a better mind about things once he’s all settled in.”</p>\n\n<p>“Maybe.” Then some folks came in, and I went to greet them.</p>\n\n<p>That night, I had a strange dream. A man stood before me in a bright light. He was obviously Lakota, and though he was a man he wore the traditional clothes of a woman. I knew this meant he was <em>winkte</em>, the ones who walk a third path. I saw his left hand was missing his ring and little fingers.</p>\n\n<p>“I am Wind-Upon-Water”, he said in a mild and quiet voice. “I speak for the others.”</p>\n\n<p>“What others?”</p>\n\n<p>“You are a soldier at the new fort. Your Captain has no honor. He keeps us from our people.”</p>\n\n<p>I shook my head. “I have no Captain. I am not a soldier.”</p>\n\n<p>He stepped back into shadow. “They are coming.”</p>\n\n<p>That’s when I woke up. I felt a headache setting in so I got up for an aspirin. As I drank some water I thought about the dream. Was this about that box of bones? Guess it troubled me more than I thought. Strange way to show it! Still, I had to agree with my dream friend. It wasn’t very Christian of Ballard to treat those bones like a box of broken tools.</p>\n\n<p>I’d been telling myself that everything was above my pay grade, that what he did with his place was his business. I only worked there. But I couldn’t let this go. Time to take Ballard at his word. Maybe he really did want someone around to question him, maybe he didn’t, but he sure <em>needed</em> someone to do it. I decided I’d have a talk with him.</p>\n\n<p>[END OF PART 1]</p>\n</div>\n","author":"TheAncientMarinade"}