{"rank":"16","title":"The Thirteenth Vampire","id":"8menlu","url":"/r/nosleep/comments/8menlu/the_thirteenth_vampire/","time":"1527384542000","body":"<div class=\"md\"><p><a href=\"https://www.reddit.com/r/nosleep/comments/8d9zzy/vampire_in_the_national_park/\">https://www.reddit.com/r/nosleep/comments/8d9zzy/vampire_in_the_national_park/</a>\n<a href=\"https://www.reddit.com/r/nosleep/comments/8djhqf/the_quantum_vampire/\">https://www.reddit.com/r/nosleep/comments/8djhqf/the_quantum_vampire/</a></p>\n\n<p>This is a continuation of a series of papers that I am working on which detail the dreadful events surrounding the existence of Quantum Vampires. Strange and otherworldly occurrences have been frequently increasing in recent times around this part of the world. This is my attempt to chronicle them.</p>\n\n<p>-Warning Signs-</p>\n\n<p>I am a haunter of strange and far away places. The catacombs of Paris, the mausoleums of Timbuktu. I have climbed the ancient towers of the Chechen mountains. I have descended the cobwebbed steps beneath Istanbul. I have visited places where ancient evil once walked. I have dedicated my life to researching and understanding things that should not be.</p>\n\n<p>The city the reader is asked to consider is Karswell. It is located just north of the 55th parallel north. It was originally founded as a series of trading posts in 1892. The city is surrounded by farmland to the north, east, and west. To the south is the vast boreal forest which is populated by aspen, tamarack, lodgepole, pine, jack pine, and black spruce. All of this extends well into the foothills of the Canadian Rockies south and southwest of the city.</p>\n\n<p>However, the forests in and around the city have long since been reduced by human activities such as oil and natural gas exploration. The terrain around Karswell is generally flat to gently rolling, with ravines and deep river valleys. The city is bisected by the Tskany River which originates in the ice fields of (Redacted) National Park which is located 260 kilometres from Karswell. I journeyed to this part of the world to investigate a new cycle of vampirism. We are now at a unique point in time and space to witness such an event.</p>\n\n<p>I met with Audrey during midsummer of 2012. She arranged to meet with me at the Royal Museum located in downtown Karswell. Audrey was aware of my research and discovered something that would be of interest to me.</p>\n\n<p>She was an archaeologist from Ashvale University who was involved with a year long excavation in (Redacted) National Park, Alberta, Canada. Audrey was an elderly woman with a weathered, oblong face. Her green eyes were tired and blood shot. Her frizzy winter white hair was hastily tied up in a ponytail. Her clothes hung loosely off of her weak and frail form. Her movements were lethargic and painful. It was as if she was on sanity&#39;s edge.\nHer team had stumbled upon an area rich with a concentration of artifacts.</p>\n\n<p>The importance was clearly evident right off the bat. Her team went to the location and dug a couple of holes and uncovered archaeological materials. Spear points, arrow tips, knives, scrapers, that all would have been fastened to a wood or bone handle.</p>\n\n<p>Her team was pulling this stuff up in chunks of boreal loam every time they put a shovel into the ground. Ancient nomadic people frequented this area about twelve thousand years ago when the glaciers were gradually retreating.</p>\n\n<p>Further exploration of the surrounding area revealed a stone circle in the centre of a field overgrown with beautiful sunflowers. It was constructed by the ancients thousands of years ago. It was a Medicine Wheel that had an astronomical significance.</p>\n\n<p>It was an observatory that was built specifically to point to the sunrise and sunset of both summer and winter solstices. It also marked the positions on the horizon of the helical risings of certain bright stars such as Aldebaran, Sirius, and Rigel.</p>\n\n<p>Audrey had noticed a patch of turf was gone, perhaps removed by an animal. She decided to probe the soil there for evidences of artifacts. She began scraping away the earth. A portion of soil collapsed inward revealing a small cavity.</p>\n\n<p>There was indeed a small object within the niche. A figurine that stood thirty centimetres tall, five centimetres wide, and five centimetres thick. It was a zoomorphic sculpture. It seemed to be a sort of primeval monster, or a symbol representing ancient peoples interpretation of such a thing. It had a vague overall human form with the head of a panther, membranous wings, and a serpentine tail.</p>\n\n<p>The statue displayed a curious gesture with it&#39;s right hand. The thumb and little finger contact one another while the first, middle, and third finger remain straight. It was carved out of ivory from the tusk of a woolly mammoth. Radio carbon dating determined it to be ten thousand years old.</p>\n\n<p>The trouble began, however, right after Audrey made physical contact with the figurine. First she heard what sounded like a low ringing noise in her ears, like tinnitus. It would gradually begin to rise with intensity and volume until it changed into a sort of desolate and threatening cry. It sounded like a man and something else. It had a quality of what could only be described as infinite distance.</p>\n\n<p>Intrusive thoughts began to harass her. A series of images formed in her mind. She saw a vast expanse at nighttime, the stars were prominent in the inky abyss that was the sky. Nearby tree&#39;s gently swayed from a cool breeze and she saw a field of sunflowers surrounding a circle of cyclopean stones. It was the medicine wheel. A shuffling sound caught her attention. She glimpsed shifting soil at the sacred site.</p>\n\n<p>An indistinct personage began to rise from the ground to stand fully upright with soil crumbling off it&#39;s frame. The shape began to make a guttural clicking noise like some kind of prehistoric carnivore. Two red pinpoints of bioluminescence sparked into existence in it&#39;s eyes. The form raised it&#39;s right hand and touched the tips of it&#39;s thumb and little finger while keeping the other fingers straight. The spectral shape spoke to her with a daemoniac voice.</p>\n\n<p>“I see you.”</p>\n\n<p>From her colleagues perspectives they thought she was having a heat stroke or something of that nature. She would snap out of this state and collapse to her knees, her mind reeling.</p>\n\n<p>The things Audrey said would make little sense at first. But in the back of my mind the memory of the &#39;Demon Monk&#39; would return to me. The bronze amulet I discovered in the permafrost of the Tibetan Plateau. In that position of time and space I would become momentarily entangled with ancient evil.</p>\n\n<p>Immediately afterwards a strong gust of wind would kick up dirt and dust nearly knocking her over. The burst of wind shook the tree&#39;s and the field of sunflowers. After that day Audrey would never feel alone. She would hear incomprehensible whispering in her ears. Sometimes she would hear footsteps directly behind her, she would turn around only to find nobody there.</p>\n\n<p>She felt as if she became trapped in a spider web and she was overwhelmed by depression and fear. Soon she would start seeing movement in her peripheral vision, dark shapes darting back and forth and yet again nothing was there.</p>\n\n<p>Faces would appear in the windows of her home forcing her to close all the blinds and curtains. Her phone would ring and on the other end would be disembodied gibberish distorted by static. When she looked at the caller display, no identification would appear.</p>\n\n<p>Audrey went to see the doctor and was given a prescription to calm her nerves and to help her relax. For a time the prescription helped ease her anxiety allowing her to focus. She felt it deep within her mind that these strange occurrences were not psychological and that something was truly happening to her.</p>\n\n<p>That&#39;s when she contacted me.</p>\n\n<p>Audrey brought with her a dusty olive knapsack, inside it was the accursed figurine wrapped in a towel. She told me not to touch the nameless statue with my bare hands. She explained to me that everyone who handled the figurine was found brutally murdered. The cause of death was exsanguination, afterwards their necks were brutally snapped or their heads crushed by some unknowable strength. She was the only one left alive, and that whatever committed those horrible acts was leaving her for last.</p>\n\n<p>She handed me the knapsack and told me to lock the artifact somewhere safe. She walked away from me with her head hung low, leaving me alone on the upper level of the dinosaur exhibit overlooking a massive Brontosaurus skeleton.</p>\n\n<p>My attempts to contact her ended fruitlessly. Her colleagues told me she had gone missing. I questioned them if she said anything. They told me that she was speaking about strange things. Ranting about &#39;shadows watching&#39; and &#39;the spirit of the lonely places&#39; . I felt my heart sink into my stomach.</p>\n\n<p>One week later the mutilated remains of a female washed up onto the bank of Tskany River with deep puncture marks on her body. The majority of her blood was missing. Her head was hanging on only by a few shreds of muscle tissue. Her mouth was full of sand and stones. Her teeth and jaws smashed to bits.</p>\n\n<p>Further investigation revealed that her remains were infested with an unknown species of protozoa. She suffered the same fate as those who handled the figurine. And just as the same, she too was shipped off to the CDC because of the mysterious biological contamination. Audrey had been visited by the wrath of the Quantum Vampire.</p>\n\n<p>The Quantum Vampire is a loathsome thing, ancient and primitive, yet more advanced than Homo sapiens. It is an outside alien consciousness that is capable of infiltrating a host body and taking complete and total control of the nervous system. It does this by entangling itself with the molecular makeup of the vessel.\nThe body and mind succumb to the will of the otherness and is subsequently changed into a hideous blood thirsty parasite with an indefinite lifespan. According to eldritch tomes it takes one full year for the process to complete. Afterwards the newly formed organism is more hardy and resistant, and possesses several frightening abilities. The vessel becomes the embodiment of gluttony, greed, and excess. It is never satiated after drinking the blood of it&#39;s victim, or several.</p>\n\n<p>It is always seeking to inflict endless cruelties unto mankind. It is the great enveloping cosmic darkness. It likes to indulge itself on the suffering of man. It likes to watch us despair. It forces us to see ourselves as animal and ugly. To remind us that we are beasts with big brains.</p>\n\n<p>It originates from a place that is distant yet close. It comes from the spaces between. I think there is a real possibility that one day the Large Hadron Collider may offer a glimpse into these spaces. I worry that for a brief moment in time the barriers between the real and unreal will be down and the Great Old Ones might be looking in on us, perhaps to sit next to the campfire and tell us the true horrors of reality.</p>\n\n<p>Throughout the history of mankind the Quantum Vampire has been invited into our plane of existence through forbidden and arcane rituals. There are eldritch tomes around the world that have been written about these entities. They are records of mankind&#39;s attempt to comprehend these otherworldly beings whose existence stretches back to an unfathomable gulf of night.</p>\n\n<p>These are the known avatars of the Quantum Vampire:</p>\n\n<p>1) The 170,000 year old remains of a female neanderthal were discovered in a cave located in Italy. The skeleton had several &#39;unusual&#39; characteristics that belong to the creatures of the night.</p>\n\n<p>2) Sometime during the last ice-age a Paleo-Siberian would become the next manifestation.</p>\n\n<p>3) The third would take on the form of a young aboriginal boy named &#39;Little Crow&#39; on the Canadian plains. I believe the legend of the &#39;Wendigo&#39; was inspired by the creature.</p>\n\n<p>4) During the 13th Dynasty of Egypt a Pharaoh willingly summoned the being into himself to gain everlasting life. He was defeated by the Egyptian army – they decapitated him, dismembered his body and burned him to ash. To their horror the entity was released from the Pharaohs body and was carried away by the wind to seek another host.</p>\n\n<p>5) After inhabiting the Pharaoh the disembodied being invaded the body of a slave and escaped into the wilderness. To this very day there are stories of a lone figure who stalks the desert at night.</p>\n\n<p>6) The daughter of a Praetorian Guard was bitten by a cloaked fiend. She would go on to terrorize the Roman Empire.</p>\n\n<p>7) A Greek astronomer who was suspected of being a sorcerer inadvertently became the vessel for the Quantum Vampire.</p>\n\n<p>8) During the Middle Ages the people of Central Asia were tormented by the so-called &#39;Demon Monk&#39;. I would have a horrific experience with the fiend on the Tibetan Plateau as a child in the year 1988.</p>\n\n<p>9) The Southern Uplands of Scotland are said to be the hunting grounds of a druid with black eyes and a torn mouth with jagged teeth.</p>\n\n<p>10) There are legends of an Aztec Priestess who fed on the blood of children during the night.</p>\n\n<p>11) Near the Big Cypress Swamp is an ancient burial ground that is said to be the lair of a female native warrior that drinks the blood of those who dare to trespass.</p>\n\n<p>12) A Polish priest who strayed from his beliefs sought out a new supreme being during the Age of Discovery. He made a Black Pilgrimage into the Carpathian Mountains seeking a new lord and found it.</p>\n\n<p>-Incident at Gemini Lake-</p>\n\n<p>A young woman named Terra has spent the last several months seeking treatment for PTSD and Depression at the Zenith Centre for Mental Health just an hours drive west from Karswell. I was granted permission to interview her. This is her own story, told in her own words.</p>\n\n<hr/>\n\n<p>We had an Indian Summer in the autumn of 2012. Imagine 28.9 °C around this part of the country in the middle of October? That doesn&#39;t happen very often. Me, Emma, Dalton and Rusty (his Rhodesian Ridgeback) all piled into the Subaru Outback and made the forty minute drive to Gemini Lake for one last dip in the water before the cold.</p>\n\n<p>The lake was abandoned at this time of the year and we had the place to ourselves. It was ideal. There was still some light in the sky when we arrived. Dalton barely brought the car to a stop when Emma yanked off her hoodie and cracked open a beer. Dalton let Rusty jump out onto the sand as he lit up a smoke. The sunset behind Sentinel Mountain was such a beautiful sight. The way the light rippled on the water.</p>\n\n<p>On the lake I could see a flock of Common Loon preparing for their winter migration. The black and white tuxedo birds indifferent to our presence. Have you ever heard the haunting call of the Loon? It travels for a long distance. It sends shivers down my spine every time I hear it. We were all transfixed to the song on the lake.</p>\n\n<p>I spotted something just a bit down further on the lake shore. I pointed it out and made our way down to take a closer look. It was just a stack of flat stones. From the way it was piled it kind of resembled a human figure with it&#39;s arms stretched out facing the lake. There was something wrapped around it. I knelt down next to the stone pile and picked it up. It was an old necklace made of bird skulls. They looked like they came from crows. It was something an indigenous person might have worn a long time ago. Rusty was circling it with intense curiosity sniffing it and wagging his tail. I pocketed the bone necklace.</p>\n\n<p>“Finders keepers.”</p>\n\n<p>Dalton turned to face me with a weird smirk on his face.</p>\n\n<p>“Halloween is going to be here in a few weeks you know.”</p>\n\n<p>Emma punched Dalton on the shoulder and laughed. Rusty jumped up on his hind legs and playfully pawed at Dalton with his forelegs. Emma motioned towards the lake with her can of beer.</p>\n\n<p>“Maybe some weirdo in a hockey mask is gonna jump out of the lake and hack us to pieces with a machete!”</p>\n\n<p>Dalton flicked his cigarette butt out onto the water and grabbed a beer from the cooler. He took a long swig of it and let out a burp.</p>\n\n<p>“If anyone even thinks about messing with you girls out here I&#39;ll tear his fucking dick off!”</p>\n\n<p>Dalton knocked over the &#39;stone man&#39; with his foot and chugged down the rest of his beer. Just then a breeze of wind came out of nowhere. I thought nothing of it until it became a sudden gust that nearly knocked me over. All of the trees swayed in the wind, causing the dry autumn leaves to crumble off the branches. And just as fast as the wind came, it stopped. Rusty froze in place and perked up his ears. It was as if he heard something that we could not. In fact everything became quiet, even the song of the Loons stopped.</p>\n\n<p>Rusty began to whine and whimper tucking his tail between his legs. He was spooked by something. That&#39;s when he started digging into the sand with his paws and pushing it aside with his nose. Rusty bit down onto something with his teeth and yanked out a object of some sort. It was an old and cracked leather wallet. </p>\n\n<p>He brought it to Dalton.</p>\n\n<p>“Would you look at that! Good boy.”</p>\n\n<p>Dalton brushed off the remaining sand and opened up the wallet. He pulled out crumbling banknotes and some coins. There was also a drivers license. Dalton examined it.</p>\n\n<p>“Looks like a mister Jacob Wingate forgot to take his wallet, poor sucker!”</p>\n\n<p>Emma grabbed the license from Dalton&#39;s hands and took a look for herself.</p>\n\n<p>“I thought that name sounded familiar. Wasn&#39;t he the guy that went missing just a while ago? My dad was part of the search team looking for him.”</p>\n\n<p>Emma put the license back into the wallet and placed it next to the knocked over stone man. She had a weird look on her face, I had never seen her look so nervous before.</p>\n\n<p>We stripped down to our swimwear and raced down the wooden dock with Rusty not far behind. Although I noticed something strange about him, he kept pausing to look back at the trees. Dalton was the first to jump off the dock and dived right into the lapping water. I can remember his screaming.</p>\n\n<p>“Holy fucking hell I can feel my balls pull right up into me!”</p>\n\n<p>Emma let out a hoot and jumped right in after Dalton. She resurfaced and let out a scream from the cold water. I stood on the edge of the dock with my arms crossed, hesitating. Dalton had a big grin on his face as he stared up at me.</p>\n\n<p>“Don&#39;t worry Terra your black shirt will hide your nipples! “</p>\n\n<p>I reminded them that there was snow on the forecast for the following week. Emma was doing a backstroke and scoffed at me.\nI was distracted once more by the whimpering of Rusty, I turned around to look at him to see him looking back the dark trees again. I saw, or rather at the time, thought I saw something. It was just for the blip of a nanosecond. For a infinitesimal amount of time I could have sworn I spotted a flash of red moving between the trees. I felt a tingle go down my spine and goosebumps began to make themselves known.</p>\n\n<p>Before I could get a better look, cold and wet arms wrapped around me, Dalton&#39;s grinning face pressed up against the side of my cheek and the next thing I knew I found myself falling into freezing cold water. My heart skipped a beat from the temperature shock.</p>\n\n<p>Afterwards when we finally had enough of the water we made our way back to the shore, Dalton built a small fire. We all huddled around the dancing flames basking in the gentle glow of the beach fire. Emma rested in Dalton&#39;s arms as I sat across them staring into the flames with Rusty at my side. I remember gazing up at the sky to see the first stars of the evening twinkle into view. The Big Dipper became clear as the sunlight began to fade behind Sentinel Mountain. Emma slowly stood up and stretched.</p>\n\n<p>“Well I gotta pee.”</p>\n\n<p>I watched Emma make her way towards the nearby brush for some privacy. Rusty was curled up on the sand next to me staring off into the distance. I had also noticed that Dalton was unusually quiet, staring into the fire. It was as if he was in deep thought, like he had entered some kind of a trance. He started singing to himself.</p>\n\n<p>“This old man, he played one, he played knick-knack on my thumb. With a knick-knack, paddy whack, give a dog a bone, this old man came rolling home.”</p>\n\n<p>A blood curdling scream startled us, bringing Dalton out of his trance. Rusty jumped up letting out a whine. He took off running towards the source of the scream. Once again another scream sounded, it was the high pitched scream of a woman, it was Emma! I glanced at Dalton with concern, and he looked back at me with wide eyes. We got up and rushed towards the brush on the trail of Rusty.</p>\n\n<p>This time there was another cry, a loud painful yelp. A dark shape came flying towards us from the brush and landed onto the sand between us. The crumpled and mangled heap was Rusty. The dogs body twitched and convulsed violently. He was broken in half, folded like an accordion. Dalton let out a sorrowful cry.</p>\n\n<p>“Oh Jesus Christ! Oh God! What the fuck? “</p>\n\n<p>Amid the chaos and confusion Emma emerged from the brush, shambling towards us holding the side of her neck with a hand. There was blood spurting out a wound on the side of her neck, she was sobbing in complete horror and shock. Dalton took one step towards her.</p>\n\n<p>“Emma?”</p>\n\n<p>And just as soon as she appeared, there was a powerful gust of wind and something grabbed a hold of Emma and pulled her out of arms reach. Emma&#39;s desperate cries echoed through the twilight on the shores of Gemini Lake. Soon the screams stopped. There was now only total silence. We had no idea or understanding of what had just happened. I think our minds were swirling in a daze of shock and confusion.</p>\n\n<p>Childhood memories of the monster under my bed returned to me. I could feel a deep chill creeping throughout my entire body. I think the fight or flight animal instinct was kicking in. A cold burst of wind kicked up sand and debris around us and the next thing you know a shape appeared several metres in front of us. It was a person standing barefooted on the sand.</p>\n\n<p>He was wearing a red zip-up jacket with the hood up and blue jeans. His clothes were frayed and tattered. They were covered in dirt and mould, it was as if he climbed out of the ground or something. He had a shock of blond hair on his head that waved from the wind gusts. There was something very wrong with him. His skin was really pale like ash. And there was something wrong with his eyes. The whites of his were black like obsidian, and his pupils were red like the glowing embers in a campfire. That&#39;s when I knew who or what we were looking at was not a human being. I know that sounds crazy.\nIt had the appearance of a man, it stood like a man, but there was no way it was a man. It was something that just passed off as a human at a glance.</p>\n\n<p>The stoic look on it&#39;s face suddenly changed into a grinning smile, revealing sharp teeth. It started to sing, it&#39;s voice was deep and gravelly.</p>\n\n<p>“This old man, he played two, he played knick-knack on my shoe. With a knick-knack, paddy whack, give a dog a bone, this old man came rolling home.”</p>\n\n<p>The next thing that happened occurred so fast, it was a blur. Dalton was knocked onto the ground by the thing in the red hoodie, pinning him down. It&#39;s movements were frenetic like a rabid animal. It pulled Dalton&#39;s swim shorts off of his hips and grabbed his genitals. </p>\n\n<p>It began pulling.</p>\n\n<p>Dalton let out a high-pitched, agonizing scream. I remember the sound of tendons ripping. Dalton writhed in pain and torment. The thing suddenly buried it&#39;s face into Dalton&#39;s neck, sinking it&#39;s teeth right into the jugular. It began to drink.</p>\n\n<p>I was completely frozen in place. I could not move. All I could do was stand still and watch the violent act before me. I knew my heart was racing, I could hear it beating against my chest. I started to feel numb and weak. My breathing was becoming laboured. After the screams stopped, after Dalton stopped struggling, the thing that looked like a man reached for a nearby rock and caved Dalton&#39;s face in with one powerful swift blow.\nIt&#39;s frenzied state lessened and it&#39;s mannerism changed. It almost seemed to become drowsy or relaxed, like all the tension in it&#39;s body left. It became lethargic.</p>\n\n<p>It stood up and slowly turned to face me.</p>\n\n<p>The thing approached me. The smell of mildew and decay, blood and dirt, radiated from the creature in waves. I collapsed to my knee&#39;s sobbing, the world around me began to phase in and out of existence as if I was going faint. I swear to you I could feel the air around the thing rippling. It was like there was some kind of charge in the air. It sat down cross-legged on the sand in front of me. It stretched out an open hand, palm facing skywards.</p>\n\n<p>“You took something that is mine.”</p>\n\n<p>The thing was referring to the bone necklace that we found on the pile of rocks, the stone man. I reached a trembling hand into my pocket and retrieved the bone jewelry and handed it over. The creature put the necklace on, the crow skulls resting on it&#39;s chest. It spoke once more.</p>\n\n<p>“How fortunate for you. I am allowing you to go on and live a long happy life until you return to ash and dust. But never forget that I am everywhere and everything here is mine. I am the land. I am the wind. I am the trees and animals. I am everlasting.”</p>\n\n<p>In the blink of an eye the thing that resembled a person was gone. I was all alone on the beach of Gemini Lake. The music of the Common Loon began to resonate across the lake once again, like a coffin choir for my dead friends. Those aquatic birds with red eyes that were witness to the events that occurred on the sand. I gazed up at the sky with teary eyes and caught sight of the majestic northern lights rippling and dancing across the night sky.</p>\n\n<hr/>\n\n<p>People still remember that year when a young woman was found wandering alongside the highway three days later so deranged by what she encountered that she had to be committed. Nobody wants to admit it but there is an air about the place, something beyond our comprehension has been going on for a long time and things are only going to get worse.</p>\n\n<p>I asked Terra if she could take a look at a picture, she agreed. I withdrew a missing persons poster and presented it to her.</p>\n\n<p>MISSING</p>\n\n<p>JACOB WINGATE, age 23, was last seen around 9:00 p.m. on October 28 2011 at Karswell Public Library. He was leaving the parking lot driving a blue 1977 Pontiac Ventura. He is 6&#39;1” tall, weighs approx. 198 lbs., has blue eyes and blond hair. He was wearing a bright red hoodie with blue jeans. Anyone with information should contact the Karswell RCMP Detachment or Makkapitew County Dispatch or call 911 if seen.</p>\n\n<p>The expression that formed on Terra&#39;s face was confirmation that Jacob Wingate is the thirteenth vampire.</p>\n\n<p>Next in the series of these papers will focus on the events surrounding Jacob Wingate and his metamorphosis into the Quantum Vampire.</p>\n</div>\n","author":"Celephais1985"}