{"rank":"79","title":"Nightshift At The Plant - Showdown","id":"8mepvb","url":"/r/nosleep/comments/8mepvb/nightshift_at_the_plant_showdown/","time":"1527385246000","body":"<div class=\"md\"><p><a href=\"https://old.reddit.com/r/nosleep/comments/8k041i/nightshift_at_the_plant_thats_not_a_pony/\">That wasn&#39;t a pony</a></p>\n\n<p><a href=\"https://old.reddit.com/r/nosleep/comments/8kf49e/nightshift_at_the_plant_the_unwelcomed_visitor/\">Unwelcomed visitor</a></p>\n\n<p><a href=\"https://old.reddit.com/r/nosleep/comments/8kv0az/nightshift_at_the_plant_malachai/\">Malachai</a></p>\n\n<p><a href=\"https://old.reddit.com/r/nosleep/comments/8lcb7f/nightshift_at_the_plant_uncle_harry/\">Uncle Harry</a></p>\n\n<p>Malachai wanted to see the lotion Micah had given me to use that night, of course.  He also wanted to go through everything in Micah’s office, including his private journal.</p>\n\n<p>Even though I knew he had good reason to want all that, I didn’t like how it made me feel that this strange man would have intimate knowledge about me and about my deceased husband.</p>\n\n<p>My expression must have told him how I felt, because he sighed and sat down on the chair by the couch.  “Remember me telling you I had memories of my own?” he asked softly, and pulled out his wallet.  Not saying another word, he handed me a photo from inside, one that was worn around the edges.</p>\n\n<p>A pretty brunette, and a little girl that was the spitting image of Malachai looked out  from that photo, and I felt my heart clench hard in my chest.</p>\n\n<p>“Sasha would have been eight this year,” Malachai told me, his face pained.  “Sam and I had been married for four years – Sasha was three in that photo.  We met at church, Selene.  Sam was … one of my best singers in the choir.”</p>\n\n<p>“You … were a preacher?” I asked, gobsmacked.</p>\n\n<p>A sad smile appeared.  “Yeah, I was, Selene,” he confirmed.  “Started when I was twenty-five.  I had a good congregation, a nice little house, but I wanted a family.  Sam was shy, sweet, compassionate.  I fell in love with her the second year she’d been a member.”  He paused.  “Harry took them both from me, Selene.  I thought my faith in God would save them, would protect them from that sort of evil.  I was horribly wrong.”</p>\n\n<p>“Was Micah …?”</p>\n\n<p>“No, angel, your husband was a little too young back then to be helping Harry, I think,” Malachai said.  “Suffice it to say, when Harry took them from me my faith got shaken in a way I couldn’t restore.  God couldn’t help me – he hadn’t lifted a finger to help me, rather.  So, I quit and started studying the occult instead.  I was determined that Harry would never touch another soul, if it meant me dying with the son of a bitch.  It’s been a grueling five years, Selene, but I swear on my wife and daughter that I can end Harry for good this time.”</p>\n\n<p>I let him have the bottle of lotion, and full access to Micah’s office.</p>\n\n<p>For the next two nights, Malachai studied everything he found regarding Harry.  Micah provided the link he didn’t have before, a more intimate look at Harry Thomas Woods than he’d had prior.</p>\n\n<p>Friday was unusually busy at the plant; I ran from the time I walked in until nine that night, weighing trucks out and delivering mail plus taking care of the contractors working in the plant.  Malachai watched Chloe, keeping her busy with her mobile and her toys until I caught a break.  Once everything settled down, I pulled out my water from the little fridge to drink.  “It’s not usually quite that busy,” I explained, blowing hair out of my face.</p>\n\n<p>Malachai nodded, his eyes on Chloe who babbled happily and watched her mobile go round.  “Harry will try for her again this weekend,” he told me plainly.  “It’s Halloween weekend, Selene.”</p>\n\n<p>“My God, it is isn’t it?” I echoed, surprised at how fast the time had gone.  I’d taken two months after Chloe was born to get adjusted, and then returned to my shift at the plant.  I’d thought everything was going to be okay, when nothing happened the first two weeks I was back.  “What do we do?”</p>\n\n<p>Those black eyes locked on mine.  “Whatever I tell you to do, you need to follow it to the letter,” he replied.  “Don’t deviate, Selene.  I know you’ll want to, but you can’t.  If you do, you’ll lose Chloe for good.”</p>\n\n<p>“Alright,” I agreed weakly, frightened by his words.</p>\n\n<p>At around two in the morning, the headless creature returned.  This time, it was a lot closer to the guard house, and I got a better look at it.  Where the neck would have been was raw, oozing flesh.  The moth-eaten fur hid dead flesh.  Its paws were raw and inflamed, and that was what was causing the stilted movements I guessed.</p>\n\n<p>Malachai just watched it go, silent.</p>\n\n<p>I wanted to ask him what it was, but the expression on his face was angry-looking.  So I said nothing, trying to get back into the book I’d been reading.</p>\n\n<p>The rest of Friday night passed uneventfully, and I was thankful for that but I knew tomorrow would be worse somehow.  Tomorrow was Halloween.  Tomorrow Harry would try for Chloe again.  I just hoped that Malachai was strong to beat him.</p>\n\n<p>I had taken to lying down with Chloe in bed with me, after my shower.  I didn’t want to leave her in her crib in her room, not with Harry so determined to get her.  She and I went to bed around eight that morning, and my alarm was set for four.  She went off to sleep easily, and I drifted off not long afterwards.</p>\n\n<p>When I next opened my eyes, Chloe wasn’t there.</p>\n\n<p>At first it didn’t sink in, that my baby was not in bed with me.  But when it did, I panicked.  Lunging out of bed in just my night shirt and panties, I tore out of my bedroom and started looking for her in the house.</p>\n\n<p>I was the only one in the house.  Malachai was missing too.</p>\n\n<p>“What the hell is going on?” I screamed, pulling at my hair and going in circles trying to figure out what I needed to do next.  The door to Micah’s study was open slightly, drawing me over to it.  </p>\n\n<p>Inside stood Harry and Malachai both, and they had Chloe on Micah’s desk in the middle of some elaborate symbols.  Micah was there also, and when he saw me at the door he smiled broadly.  “Won’t you join us, Selene?” he beckoned.  “Join us, and have all the power you could ever want.”</p>\n\n<p>“No!” I yelled, and tried to shove through the door to get my daughter, but the door slammed shut in my face.  Screaming, I beat at the door …. and abruptly found myself thrashing about in the sheets.  Panting for breath, I immediately looked for Chloe.</p>\n\n<p>She was sound asleep, a tiny smile on her face.</p>\n\n<p>“Oh, God,” I breathed, tears running over my cheeks.  The dream had seemed so real to me.  I laid back down, but somehow I didn’t think I was going to get very much sleep after that.</p>\n\n<p>When my alarm went off, I felt like I’d been dragged through the mud face-first and then run over by a semi.  Groaning, I got out of bed and got dressed, then scooped Chloe up to go to her room to pack her diaper bag with what I’d need for the night for her.  She cooed happily, her blue eyes staring up at me.  “I’m so glad you’re an easy baby,” I told her, running a hand through my hair.</p>\n\n<p>After I got her packed and changed, I took her into the kitchen to find Malachai already in there cooking breakfast.</p>\n\n<p>“You sleep okay?” he asked, those black eyes slanting over at me.</p>\n\n<p>“No,” I told him.  “I dreamed that you, Harry, and Micah were going to sacrifice her in his old office.”</p>\n\n<p>He nodded, turning the bacon over.  “Tonight’s going to be Hell itself, Selene,” he murmured.  “Be prepared for anything, and remember what I told you about doing what I say do.”</p>\n\n<p>“I will,” I assured him, going to fix a bottle for Chloe.</p>\n\n<p>This time, we rode in his truck to the plant.  I’d never been in his truck before, but if he thought that was what we should do I wasn’t arguing.</p>\n\n<p>Saturdays at the plant were long and boring.  There weren’t any trucks coming in or going out, and the administration building was closed.  It was just the supervisors and employees that worked in the plant itself, other than me and Chloe – and now Malachai too.</p>\n\n<p>Huey, Rooster, and John all three came out to the guard house on their first break, and all three men looked more serious than I’d ever seen them look.</p>\n\n<p>“We brought you something,” Rooster said, and set something on the counter.</p>\n\n<p>It was a small glass jar full of what looked like water.</p>\n\n<p>“Good call,” Malachai told Rooster, eyeing the jar.</p>\n\n<p>“What is it?” I asked.</p>\n\n<p>“Holy water, sweetheart,” Huey answered.  “Real holy water.”</p>\n\n<p>“What do I do with it, though?” I asked, looking at all four of them.</p>\n\n<p>“Exactly what I say do,” Malachai expressed.  “Stick that in your side pocket, Selene.  You’ll need to have easy access to it, if this night goes the way I think it might.”</p>\n\n<p>“We’ll be watching from the plant,” John said.  “If we see that shiny car of his, we’ll be on our way out here.  I know you can handle him, Malachai, but we’d make for a good distraction.”</p>\n\n<p>“Too late,” I breathed, watching a silver car glide up the drive to the employee parking lot.  “He’s here.”</p>\n\n<p>All of us watched it circle the parking lot like a shark that scented blood.  Malachai had killed the lights in the guard house, making it harder for him to see in and easier for us to see out.</p>\n\n<p>“Selene, do you have a key to the mailbox room there?” Malachai asked softly.</p>\n\n<p>“Yes, why?” I said.</p>\n\n<p>“Take Chloe in there.  Take Chloe in there, wrap her up warm with a blanket, and dab a little of that water on her forehead.  I want you two to sit back behind that door out of sight.”</p>\n\n<p>I immediately did what he told me to, taking Chloe out of her play pen and putting her in her carrier to go unlock the door and go inside.  Locking it tight behind me, I set her down on the floor out of sight of the window that was around the corner and tucked her blankets around her warmly.  Then I took the bottle of holy water out of my side pocked and gently dabbed some of it on her forehead.  She grinned at me, and I put the lid back on and put it back in my pocket to sit right beside her.  “Okay, honey, we need to be very quiet,” I murmured.  “The bad man is back, and I don’t want him getting you.”</p>\n\n<p>When the door whooshed open, and I heard the tap of his cane, I closed my eyes and prayed that he wouldn’t know we were in there.  I prayed that Malachai would beat him, send him to Hell, whatever.  And I prayed that all of us in that guard house minus that old son of a bitch made it out alive and unscathed.</p>\n\n<p>“Where’s the girl, boy?”</p>\n\n<p>I held my breath, tears welling out of fear.  Harry scared the living daylights out of me.  I could almost smell how evil that man was.</p>\n\n<p>“It’s just us tonight, Harry,” Malachai drawled.</p>\n\n<p><em>“You lie.”</em></p>\n\n<p>I’d never heard such rage in someone’s voice, but I was hearing it now.</p>\n\n<p>“Do you see her, Harry?” I heard John ask.</p>\n\n<p><em>“You tell me where she is, Malachai Brooks, or I swear I’ll kill you where you stand.”</em></p>\n\n<p>“You and what army, Harry Thomas Woods?” Malachai countered, and something in his voice had gone dark.  “Do you really think I’m still that same God-fearing coward I was?”  A pause.  <em>“You get a good look, old man.  You get a real good look, and then you tell me.”</em></p>\n\n<p>A loud, booming laugh echoed through the guard house then, and my blood turned to ice.  Something black and viscous began tracing its way down the walls, and quietly I moved Chloe and myself away from them.  “Please don’t let him find us,” I breathed, trembling.</p>\n\n<p>Shadows began to move in the backside of the mailroom.  Shadows with long, clawed fingers and what looked like rows of horns on their heads.  They swarmed around us, their long fingers grasping for Chloe.</p>\n\n<p>A roar rattled the doors and windows, and suddenly the mailroom door blasted open.  I threw my body over Chloe to shield her from the flying debris and felt something stab me deep.  I admit that it was tempting to grab Chloe and run, but I hadn’t driven my car and Harry would just follow me I knew.</p>\n\n<p>Something growled outside the door in a tone that told me it meant me and Chloe harm, and I found myself hugging her carrier to me tightly to keep her shielded from whatever it was.  There was another growl, and then needle-sharp teeth bit deep into my back to try to dislodge me from my daughter.  I cried out from the pain, but didn’t release my death grip on her carrier.</p>\n\n<p>A new growl was heard behind me, followed by a deep hiss like from a jungle cat.  I wanted to turn and look, but keeping Chloe shielded took priority.  The new growl sounded again, followed by a pained cry and the teeth in my back let go abruptly.</p>\n\n<p>Then all Hell broke loose in the guard house.</p>\n\n<p>I had two creatures fighting tooth and nail behind me, just at the door out of the mailroom, so I didn’t dare move an inch from my position.  Beyond them, I could hear that evil, booming laugh combined with colored light that flashed like a strobe.  The shadow creatures came again, trying to pull me away from my daughter, but I fought against them.  I could hear screaming and yelling, but who it was I couldn’t decipher.  I could feel blood running down my back and sides, down my arms from where those hellish things clawed me trying to make me let go of Chloe’s carrier.</p>\n\n<p>There was a sudden boom, like a bomb going off, that rocked the whole building and sent plaster raining down from the ceiling … then, dead silence.</p>\n\n<p>I remained motionless, unsure of what had just happened.  Chloe remained quiet beneath me, but I could feel her little hands playing with my hair and shirt buttons.  She was still alive, and I still had her as of right then.</p>\n\n<p>“Selene?”</p>\n\n<p>The voice sounded like John, but I couldn’t be sure it wasn’t a trap, so I didn’t respond.</p>\n\n<p>“Selene, are you alright?” John asked again, sounding worried this time.  “Hey, Huey, give me a hand – I think she’s hurt bad.”</p>\n\n<p>Slowly I raised my head, cutting my eyes to the side.  It was John, not a trap.  “I’m alright,” I told him, sitting up slowly.  “Is he …?”</p>\n\n<p>“Gal, if he ain’t, I’ll eat that playpen of your daughter’s,” Huey stated.</p>\n\n<p>I let them help me to my feet, and let John pick up Chloe’s carrier to tote it back to the main section of the guard house.</p>\n\n<p>The destruction was unreal.  Windows were busted out, there were chunks taken out of the counters, and there was a huge black mark on the floor that was smoldering.</p>\n\n<p>“Where’s Malachai?” I asked, realizing that I didn’t see him.</p>\n\n<p>John and Huey exchanged a look.  </p>\n\n<p>“He’s gone, gal,” Huey replied.  “He took old Harry out … but he’s gone.”</p>\n\n<p>“Gone … permanently?” I echoed, surprised at the pang I felt at Malachai’s loss.</p>\n\n<p>John nodded, solemnly.</p>\n\n<p>“You’re safe now, Selene, and so is Chloe,” Rooster said, walking up to us.  “I ain’t ever seen nothing like it in my entire life, though.  But that old bastard is gone, and he’s not ever coming back.”</p>\n\n<p>“How do I get home?” I heard myself ask.  “He drove us here, and ...”</p>\n\n<p>John handed me a set of keys.  “Malachai gave ‘em to me before it got bad.”</p>\n\n<p>I sat down on a chair, trying to process everything.</p>\n\n<p>“Honey, it sucks, and I won’t lie and say it doesn’t,” John told me.  “Malachai was a damned good man.  But he did what he had to do, to stop Harry and keep you and Chloe safe.”</p>\n\n<p>I nodded, blinking hard.  “Well.  How am I going to explain this mess?”</p>\n\n<p>Huey, Rooster, and John all laughed.  </p>\n\n<p>“Don’t worry about that, gal, we’ll explain it for you,” Huey assured me.</p>\n\n<p>And they did.  When day shift showed up, those three were standing in the guard house with me, and they explained to my relief what had happened overnight.  It wasn’t the truth, no, but they made it believable enough that my relief just nodded and told me I was a lucky woman.</p>\n\n<p>I put Chloe in Malachai’s truck and drove us home.  It was strange, driving that big, black truck and knowing I’d never see its owner again.  He’d saved us, though.  My daughter would see her first birthday, and every one after that thanks to him.</p>\n</div>\n","author":"RhapsodyinVelvet"}