{"rank":"1","title":"Strange story how my friend lost his parents","id":"8mep9d","url":"/r/nosleep/comments/8mep9d/strange_story_how_my_friend_lost_his_parents/","time":"1527385063000","body":"<div class=\"md\"><p>Just want to tell the creepy story of the friend of mine, which actually inspired me on creating the game based on it. I will call him &quot;The N&quot;.</p>\n\n<p>I firstly met N in the school, when I was 8 years old. Due to the reason that he was older than other guys and knew nothing, he was ignored by most of the guys. No one was playing with him, and he seemed quite shy to talk with someone. In canteen, classroom, street or wherever we went he was sitting or walking alone. So I decided to make an icebreaker and talked to him. It did not take long for us to become really good friends. We spent most of our time in school together. But one day he disappeared. Teachers told us that he moved to another school. I was sad to hear it but did not pay a lot of attention to it.</p>\n\n<p>After couple weeks, kids started to spread quite creepy rumors, about him killing his parents in the car, when they were riding in the countryside. I did not believe them, cause I knew him better than them and I could not even imagine how he might find a way to kill both of his parents.</p>\n\n<p>But after couple days, when I was sleeping in my room, I suddenly woke up, because of some sounds from the other room. I moved closer to the door to hear, what is going on. It was my parents... It did not take a while for me to understand that they were talking about N. They were watching some crime news, where this story was reviewed. As they described, N the night before he killed his parents, heard that they want to get rid of him. He clearly heard, that his dad wanted to kill him and bury him in the woods. He was terrified, by hearing it, and hid the swiss knife in his pants. In the next day, the parents were ignoring N and told him that they are going to the countryside to visit grandma. He was trying to talk to mom asking her to not kill him, while they kept ignoring him. When they were driving he took the knife and stabbed his dad and his mom on the neck. The police investigation found the rope, stone, an ax in the trunk. As it was said in the news, due to his age, he was sent to the psychiatric clinic.</p>\n\n<p>I was really scared when I heard that he killed his parents. Actually, I did not get all that was said in this news at that moment, I found most of the info afterward. I was the kid and if I had some doubts before hearing this news on tv, after that, I just truly believed that it was 100&#37; truth.</p>\n\n<p>Growing up and recalling this story a lot of questions pop up in my mind. Firstly how can the 8 years old kid kill 2 people, who as he guessed wanted to kill him? Why he did not run from the house when he heard it. And lastly, how can any kid kill his own parents, even if he heard that they want to kill him? Obviously, the story seemed to at least possible for me, but I had a strange feeling of doubt, which was increasing by years. More questions and misconceptions came to my mind, more I was thinking that something is hidden in this story.</p>\n\n<p>Years were passing, I entered the high school and rarely was recalling this story and it did not worry me a lot by that time, due to the classes exams I was quite distracted. But one day suddenly when I was coming back from school I saw him running to the market. Firstly I did not recognize him, I thought it is just a random guy running to the market, but in one moment he turned his head towards me, and when I saw his eyes I literally was thrilled. I definitely knew that it was him. My hands were shaking and I was quite nervous, so I ran back to my house. I do not remember why I was so scared of him, probably the reason was suddenness. In the next day after school, I decided to watch him out. Just to know where he lives. Ater spending 4 or 5 hours I could not see him anywhere, so I decided to come back home. During next days, every day I was going to the building near that market and just staring at the door. In some days I even run from the classes. After couple weeks I realized that he probably is not going out when there is someone in the streets. If he was running, probably he was scared that someone would notice him.</p>\n\n<p>So one day I decided to come here when it was dark. I was waiting in my place till midnight and there was no sign of him. I was so upset that I wasted so much time and effort for nothing and was planning to leave. And just suddenly I noticed that int the ground floor window curtains shook a bit like someone touched them. Then looking closely I noticed that someone is looking out for them from the little hole. I hid immediately, cause I thought that he noticed me. I was scared again, but I did not want to leave, cause I wanted to talk with him. I spent so much time on this and I can not just leave and wait for more for the moment. I looked back from the wall and he was still watching. I decided to move towards his window, I thought that he would remember me and would probably somehow get in touch with me. Step by step, I was getting closer to his window, my hands and legs were shaking. Despite that I was getting close to his window, he was still watching from that tiny hole. I was getting more and more scared by this fact. I did not expect him watching me when I was getting closer and closer. And then I just stopped, by one strange thought. What if it is not him? Why am I sure that it is him watching right now fro the dark window? Maybe it is someone else? I decided to run away, cause it was late and dark, no one was outside. God knows what could happen to me I could be even killed by someone. I decided to not go to that place any time, even when I come back from school, I just did not want to be scared, feeling that someone watching me there.</p>\n\n<p>After several months I was coming back from school with one of the classmates to borrow his book. Surprisingly for me, he was living in the exact same building. He told me to wait outside for 5 mins, till he goes upstairs and finds the book. I could not handle myself and stared at the window that I saw a couple month ago. No one was there. But some feeling in me, kind of motivated me that, now the curtains will move. But nothing happened, unfortunately. My friend came back with a book and we said goodbye to each other. When he was going upstairs I asked him:</p>\n\n<p>&quot;Hey, don&#39;t you know who lives in that flat?&quot;</p>\n\n<p>&quot;Which one?&quot; - he told me</p>\n\n<p>I showed him the window. He strangely looked to the window for couple seconds and told me:</p>\n\n<p>&quot;As far as I know, no one&quot;</p>\n\n<p>I said him that I saw that someone was looking out of the window now and he told me that he will ask his parents. In the next day, he told me that his parents and the kids from the neighborhood did not know who lives there. It was so strange for me to hear that, cause I definitely saw there someone, I was sure that I am not crazy. I could not just sit and think about it all day long, this story was just killing me from the inside. Wherever I went, the thought of it just did not get out of my head. I wanted it to come to the end and finally made a decision go and knock that door. Any possible risks and consequences did not bother me at that moment. I knocked the door once slowly. Probably that moment was one the scariest moments of my life. I knocked it again and again. No response, no sound. I was so relieved like I did not even want someone to open this door or say something. There was some hope in me that, probably it just seemed to me that someone was watching me. Maybe it was the fold of the curtain which moved because of the wind. But... When I came out to the street and passed through the street under that window, someone from the window silently said:</p>\n\n<p>&quot;What do you want?&quot;</p>\n\n<p>I froze for 5 seconds. All the hopes and thoughts that came to my mind in last 5 minutes were false. It did not seem to me that someone was looking at me that day. I turned my head and I saw him. It was N. He was staring at my face with his cold look. I told him the whole story, that he was in our school and we were friends back then. I told him that I missed him and wanted to talk with him. All he said is to come back at midnight. I came back home and started to google again all news about that story. Surprisingly, I could not find anything on the internet, so I started to recall the story and all the questions that I wanted to ask him. After 5-6 hours I went to the exact same place and was waiting for him. Suddenly, the curtains moved again and I saw again that someone was looking from the little hole. It was him. Then I heard the door opening slowly. He called me by my name and shoed with his hands to come in. Nowadays I probably would never do that, but back then I did not even think that something bad can happen to me. So I came in, he closed the door and immediately hugged me with tears in his eyes. I was so touched by it. He started to ask questions about me, what I am doing where I am studying etc. Then I just straightforwardly asked him:</p>\n\n<p>-&quot;Did you actually do that?&quot;</p>\n\n<p>-&quot;What do you mean?&quot;</p>\n\n<p>-&quot;Your parents. I heard that you killed them. Is that true?&quot;</p>\n\n<p>N was not expecting such a straightforward question, he froze for a moment. Then he put his head down and started to talk:</p>\n\n<p>-&quot;I will tell you everything from the beginning. Something happened, my parents were worried about something, they were talking about something every night on that week. They were not paying any attention to me, not properly talking with me like I am not their son anymore. Whenever I came close to them they were going away. One night I decided to snitch them. And I heard my dad saying that he tired of everything and he wants to finish it. He told that he wants to kill me and start a new life. Then my mom interrupted him, saying that I am their son...&quot;</p>\n\n<p>-&quot;Are you sure that they were talking about you?&quot;- I interrupted N.</p>\n\n<p>-&quot;I don&#39;t clearly remember, but at that time I definitely was sure that they were talking about me, cause they were quite cold to me in last days. All night I was crying, cause I did not want to die, I did not know what to do. I was just scared. In the morning I ran to mom begging her not to kill me. She was just staring at my face, with her cold look and did not say anything. I stopped crying and understood that there is nothing that I can change. Let it be as it is. Then we sat on the car and me... I do not remember much of it. But my dad accidentally stopped in the middle of the road and started to look to the side mirrors. Like he was seeing someone following us. Then suddenly two people in masks broke the window and stabbed my mom and dad. I was so shocked that I could not even scream. But at some moment I screamed and they noticed me in the back seat. One of them opened the back door and hit my face. When I woke up, the knife with blood was in my hand and all the front seats were in the blood. I did not cry or scream, I remember that I just was staring at the stabbed and covered in blood. Then in the police station, they were asking me why I killed my parents, while I was telling them that I did not do that. I told them everything, that two people in the mask just came out of nowhere and killed them, and they kept asking me why I did it.&quot;</p>\n\n<p>I was really shocked by this story. I knew that he would never, in any case, kill his parents. I asked him:</p>\n\n<p>-&quot;Then they put you in the clinics?&quot;</p>\n\n<p>-&quot;Yes...They were all talking to me in a strange manner, giving me a lot of pills. I do not remember much on that period, but after couple years they discharged me from the hospital. Seems like none of my relatives wanted to take care of me, so I was sent to the orphanage...&quot;</p>\n\n<p>I will stop by this place cause all the rest of the story is really creepy and I promised N to not tell about the next part of his life to anyone. This story shows that anything can happen to anyone, by someones stupid plan. There are some people, who just do something without any thought or sentiment of pity, destroying others life and future. And unfortunately everyone and you will trust in what they say, without even trying to find the answers, without even questioning yourself, was that true or not.</p>\n\n<p>I always wanted to do something to kind of show people how falsy their first impression could be. This story motivated me to create the game, to show people how it is easy to deceive them with a beautifully written script.</p>\n\n<p>Link: <a href=\"https://play.google.com/store/apps/details?id=com.SupGames.Horror\" rel=\"nofollow\">https://play.google.com/store/apps/details?id=com.SupGames.Horror</a></p>\n</div>\n","author":"rufat2494"}