{"rank":"26","title":"The Bottom of the Bay","id":"8mer2w","url":"/r/nosleep/comments/8mer2w/the_bottom_of_the_bay/","time":"1527385628000","body":"<div class=\"md\"><p>My father is not an easily shaken man. Born in an out of the way town in the forested hills of Pennsylvania, he had been raised his entire life in an environment of rural hard work and basic outdoor survival. I don&#39;t like to use the blanket term &quot;redneck&quot;, but if it helps you to picture what sort of person my father is, then I suppose it fits. This man has been through two divorces and a lengthy battle with alcoholism and has come out the other side with a smile every time. There isn&#39;t much in this world that can make my father feel truly scared.</p>\n\n<p>During a family visit over the holidays, he pulled me aside and told me the story I am about to recount to you now. When he had finished, his skin had turned a shade of pale white I had never seen on him before, and his hands were trembling on the wooden table we both sat at. If I&#39;m honest, I didn&#39;t know what to think. It sounded like complete bullshit, like a story we would tell around the campfire during one of the many camping trips we took when I was a kid, but seeing my dad, this unshakeable statue, reduced to a quivering wreck after telling me this has spawned many questions in my head.</p>\n\n<p>It&#39;s been almost 6 months since that visit, and this is the only place left I can think to go with this information. I only pray that someone can tell me it’s all untrue, that it really is just a story. I shudder to consider the alternative.</p>\n\n<p>This is what my father told me...</p>\n\n<p>------------------------------------------------------------------------------------------------</p>\n\n<p>After I had moved out of our family house and gotten a place of my own, my father didn&#39;t see much reason to remain there. He had always been more of a practical man than a sentimental one. He sold the house and moved a bit further south into the state of Maryland, something he had wanted to do for a long time. He loved hunting and camping as much as any other red-blooded outdoorsman, but down in Maryland, he could fully pursue his one true love among all outdoor sports: fishing.</p>\n\n<p>Dad had found several serviceable fishing lakes and rivers around our house in Pennsylvania, but he would often tell me he could hear the Chesapeake Bay calling to him. &quot;That&#39;s where the big fish are, boy!&quot; he told me with a laugh on more than one occasion, &quot;Doorway to the ocean!&quot; It had always been my dad&#39;s dream to buy a legitimate bass boat and go fishing out in the big waters, and the first step to achieving that was obviously to go where said big waters were. Unfortunately, it seemed that the nearest connection to his beautiful bay was in the city of Annapolis, and the only thing I heard more growing up than about how the big fish were in the ocean was how he would rather drop dead than deal with the chaos of city life.</p>\n\n<p>It took my father months to find a place close enough to the bay that he truly loved, but at long last, a house finally became available in a backwater town that I shall keep nameless here. This place was the definition of &quot;remote&quot;. I helped him move in when the big day came, and I commented on how I only saw three other houses on his street. &quot;That&#39;s why this place is great! I don&#39;t have to deal with all those annoying humans!&quot; he said with a friendly slap on my back.</p>\n\n<p>The true selling point for the property, my dad had decided, was right down the road, barely a ten-minute walk from his house. Jutting out of the rocky coastline and into the waters of the Chesapeake Bay was an old wooden pier. It looked like it had been around since the days when the town was first founded. Barnacles grew along the old wooden posts, and the whole surface looked like it could use a serious power-washing. At the end sat a covered sitting area with wooden benches facing out into the water. In other words, the perfect deep-water fishing spot for my as-of-then boatless father.</p>\n\n<p>It was on this pier that the story really begins.</p>\n\n<p>On a particularly warm night at the end of September, Dad snuffed out the cigarette he&#39;d been smoking on the back porch of his still semi-new home and looked at his watch. 11:45 PM. He checked the weather on his phone and saw it was going to be clear skies for the rest of the night and into tomorrow. Without another word, he went back into the house, grabbed his rod and tacklebox, and made his way down the road towards the pier.</p>\n\n<p>My father adored fishing at night. &quot;The heat of the day makes the fish go deeper into the water. Makes &#39;em more elusive,&quot; he would tell me, &quot;At night, when things cool off again, they all come back to the surface, and I&#39;ll be waitin&#39; for &#39;em.&quot; He was also secure in the knowledge that no police officers would be around to question why he was out on the pier so close to midnight. If they did, he could probably just hand them a Pepsi and ask if they wanted to join. Cops in that area were fairly laid back; not much crime when there isn&#39;t a lot of people.</p>\n\n<p>The watch on his wrist had just clicked to midnight when my father made it to the bench at the end of the wooden structure. He popped open his tacklebox and pulled out a Styrofoam cup full of fresh nightcrawlers he had bought that morning, something that never seemed to be in short supply when I was growing up. He baited his hook and walked to the edge of the pier, testing the direction of the wind. &quot;Alright, baby, catch me the big one&quot; he said lovingly to the worm on his hook (another tradition I remember from my childhood days) and let it fly out into the water. It disappeared beneath the murky depths with a barely audible <em>gloop</em> and a spreading concentric circle of ripples. Then, my father settled back on the bench, popped the tab on a can of Pepsi, and waited.</p>\n\n<p>I would often watch my father when he fished, and for the life of me, I never understood how the man could be so still and so patient. Maybe I&#39;m remembering it through the mind of a hyperactive eight-year-old, but I always felt like my father could sit there for weeks if he really wanted to. No food, no water. As long as he had his precious fish, he was content.</p>\n\n<p>According to him, this night was very much the same as all the others. He sat and he waited and he waited and he sat, polishing off can after can of soda, baiting and rebaiting his hook. Every now and then he would get a tiny nibble on his line, but when he pulled it in, the wily fish had merely taken his bait and run off into the depths again. Another nightcrawler, another soda, another round of waiting.</p>\n\n<p>Finally, a deep yawn bubbled up from inside him, prompting him to check his watch again. It read 2:50 AM. He concluded that the fish just weren&#39;t biting that night and prepared to pack up when an enormous tug yanked on the end of his line. He jumped to his feet and remained as still as he could, trying to peer into the water that the night had dyed jet black as if he would see the monster that had snagged his hook. Another tug caused the rod to briefly bend into a crooked upside-down J, and Dad yanked back hard. A huge grin spread across his face. This was it. He had finally landed the big one.</p>\n\n<p>As he reeled in his prize-winning catch, he told me something began to niggle at the back of his mind. A wisp of thought that told him something was...off. The thing on his line was heavy, that was for damn sure, but it didn&#39;t appear to be fighting him. He was used to feeling fish pull and yank as he reeled them in in a vain attempt to get away, but such was not the case here. It merely hung off his reel like a lead weight, allowing itself to be pulled in closer and closer to the pier. My father said that was when he began to doubt it was a fish at all; maybe he&#39;d snagged a tree limb or an old crab trap.</p>\n\n<p>When his catch finally breached the water, Dad had been right about one thing: it wasn&#39;t a fish. What it WAS though...god almighty...</p>\n\n<p>Floating in the dark waters of the bay, clinging to the end of my father&#39;s line, was a man. Even in the minute moonlight, the color of his skin could be seen. It was...blue. A sickly shade of pale blue. His arms, neck, and torso looked unnaturally swollen, as if he had absorbed a horrific amount of water, causing his eyes to become just a pair of black pinpricks in his waterlogged cheeks. His whole face seemed like it was almost melting, the corners of the mouth and eyes pulled down into a perpetually somber grimace, and what little hair he had was forever matted to his balding head. He was naked, according to my father, though he told me he could only see the figure from the stomach up, and his clothing was the last thing he was focused on in that moment.</p>\n\n<p>Dad froze, staring at the abomination he had unearthed from the black water. He couldn&#39;t even find the strength to let go of his fishing rod. All he found the strength to do was watch as the figure pulled a swollen arm out of the water, the hanging skin nearly sloughing off the bone, and reached out towards him. The mouth dropped open farther than a normal human jaw should allow, revealing a gaping black abyss within, a black hole of pure absence and nothingness. Then, the creature wailed. It was a long drawn out howl of echoing despair, a noise that a human who had reached the uttermost depths of their own depression could only dream of uttering. &quot;It was the sound of Hell, boy&quot; he recounted in a voice that was barely above a whisper, &quot;It was mourning. Pure mourning in a single sound.&quot;</p>\n\n<p>My father watched the thing in the water wail in desperation for what felt like hours, though in reality it must have been barely a moment. Then, the line snapped, and the creature sank back into the depths, it&#39;s echoing cry becoming a watery gurgle before fading into silence.</p>\n\n<p>When it had finally vanished from view, Dad told me he found the strength to run. He grabbed his rod and tacklebox and bolted for his house like the Devil himself was on his heels. For all he knew, that could very well have been the case. He burst into his house and locked every door and window he could find. Needless to say, he didn&#39;t sleep a wink until the morning sun finally crept over that accursed bay.</p>\n\n<p>He held onto that story for months, not breathing a word to anyone before me. He didn&#39;t bother phoning the police; they would never have believed him. That thing in the water looked like a man, but he swore on every holy saint that ever existed that it wasn&#39;t, at least not anymore.</p>\n\n<p>It was at this point that I noticed tears in my father&#39;s eyes, which he quickly wiped away on the back of his arm. &quot;That didn&#39;t matter though,&quot; he said, &quot;Human or not, that...whatever it was...it was in pain. I thought it was reaching out to try and pull me down with it, but I&#39;ve thought long and hard about it since then, and I&#39;m almost certain now that that wasn&#39;t the case. It was reaching out for help. I had pulled it up, and it needed me to help escape the water. And I let it go...&quot; He would tell me later on that for the first time in his life, in that moment, he had truly felt like a coward. I reassured him as best I could that he wasn&#39;t.</p>\n\n<p>----------------------------------------------------------------------------------------------------------</p>\n\n<p>I went home that night with my father&#39;s words buzzing in my head. It had to be just a story. It just HAD to be. Drowned human-like creatures didn&#39;t just live in the deep waters of the world, writhing in pain. This is reality. These things don&#39;t happen in reality. I repeated this like a mantra for weeks on end, until at last, I was finally able to get a full night&#39;s sleep without waking up from nightmares about churning oceans and wailing wraiths. I was able to chalk it up as just another campfire story.</p>\n\n<p>That was before last week. I had been lazily surfing the internet news sites when a particular story caught my eye. The headline made my blood turn to ice in my veins.</p>\n\n<p>&quot;BODY FOUND ON SHORE OF CHESAPEAKE BAY&quot;</p>\n\n<p>I clicked on the story. In the same remote Maryland town where my father lives, a skeleton had washed ashore on the rocky coastline. Police and investigators were on the scene in a matter of minutes. The news story yielded very little details, but the writer had let one detail slip through. According to one of the investigators, they were able to tell almost on sight that the bones were old. The corpse could have been down in those waters for months or even years without anyone discovering it.</p>\n\n<p>Something clicked into place in my brain. I&#39;ve read stories of paranormal happenings where, when a body is desecrated or denied it&#39;s final rites, the soul can become trapped, forced to remain in a specific location. In the case of a horrific unnatural death, the spirit is likely to haunt the area where said death had taken place.</p>\n\n<p>This is why I decided to write this, why I can no longer fully convince myself that what my father told me was just a story. The fact of the matter is someone had drowned in that bay, never being discovered or heard from for years, until lo and behold, my father unearths a wailing man-thing from the same depths with an errant fishing line. A thing that had reached out to him for help, desperate to escape its watery grave.</p>\n\n<p>I&#39;m not entirely certain if there is a Hell, but if there is, I can no longer imagine it as a place of fire. It is a place of cold, and despair, and endless black water.</p>\n</div>\n","author":"GrinningBoogeyman"}