{"rank":"21","title":"My Property Isn’t Normal (Part 5)","id":"8merd0","url":"/r/nosleep/comments/8merd0/my_property_isnt_normal_part_5/","time":"1527385719000","body":"<div class=\"md\"><p>I usually try to do some kind of intro to these posts but today I’m to exited to take the time to do that! If you haven’t read my previous posts you should though, they are quite a bit more action packed, and explain all the events that lead to where i am now. If you haven’t read them you won’t have any idea what I’m talking about. </p>\n\n<p>Do y’all remember last post when i joked about Mark being some kind of monster hunter or something? Well i went through his computer and I’ll be damned if he isn’t. He’s got files on files on even more files about all these different “Tangibles” which i think just means monsters. I even managed to find a file on the Keelut. No wonder they didn’t believe i had killed one. </p>\n\n<p>Apparently a Keelut is a creature in native American mythology that is described as a furless doglike... thing. It does have fur on its paws though, which supposedly makes it impossible to hear or track in the wild. Pretty tame so far right? Don’t worry it gets better. Apparently looking at them is supposed to immediately fry your brain and disorient you,  making you an easy kill for the creature. But that didn’t happen to me.</p>\n\n<p>The only reason i can think of for the mind cooker effect not happening to me is because i don’t process things the same anymore. Not after the events that lead me to live out here. Or maybe it wasn’t even a Keelut. There were a few more details i didn’t get to read because before i could finish i felt cold steel on my neck.</p>\n\n<p>Mark had woken up and was now pressing a knife to my throat. “What do you thing you’re doing with my computer?” “The fuck does it look like? I’m trying to figure out who the man that was passed out on my couch is.” Mark thought for a second, still not moving the knife from my neck. Then he asked, “why... no, HOW did you knock me out, i know you have a dodgy history but close quarter fighting is my speciality, but all i can remember is going to hit you then it went dark.” Careful not to move and slit my own throat, i said, “you got desperate and went for a one hit knockout, frankly your left hook is to slow to hit your opponent when you clearly telegraphed exactly what you were planning on doing with your hips. I dropped under the blow and threw an elbow to the bottom of your jaw.”</p>\n\n<p>The knife loosened a little. “You seem to know your stuff, why pretend to be a dumbass then?” “Umm, EXUSE ME? First of all I’m not pretending to be anything, second of all, fuck you.” The knife fell away completely now. I took the opportunity to turn and start asking my own questions. “So you are an actual fucking monster hunter huh.” He paused to a moment before replying. “Yea, i guess i am.” “So why is an organization that employs monster hunters also the owner of the organization that is helping me escape my past?” Mark winced this time. Not a good sign.</p>\n\n<p>“Cole, the organization that is claiming to help you escape you past probably doesn’t exist, my organization has many false companies that it uses to gather intelligence and run experiments. I have reason to believe that they put you out here knowing about your past in an effort to see if anyone could survive in an area that is known for having extremely high levels of tangible activity. They also knew that if you were to die, they wouldn’t have to worry about people looking for you. However, i also think that you have probably far surpassed their expectations. The higher ups haven’t actually told me so, but they can’t possibly expect anyone to kill a Keelut on their own. Or have fun with a creature like a flesh gait.”</p>\n\n<p>Holy shit, that was a lot to take in. I Took a deep breath, then cautiously asked, “what the fuck is a flesh gait?” Mark put both of his hands on his head and let out a “ RHHHHAAAAA, seriously dude does anything even phase you? Flesh gaits are those things that you call pales. They are only level 4 but still to much for most people to handle, let alone fuck with on a regular basis like you claim to do.”</p>\n\n<p>There goes that fucking level thing again. I had seen various levels ranging from 2s and 3s all the way up into the hundreds on the reports that i read while browsing Mark’s computer, but i had no clue what they meant. “What’s all this level shit about, all the monsters on your computer have one, but i don’t know what they mean.” Mark shot me an angry look. Guess he was still mad that i had gone through his shit. “We base a beast’s strength on how many unarmed adult men we predict it could take down before being overwhelmed. One man is equal to one level”. </p>\n\n<p>Just then remembered that the level beside the Keelut, was 107. “So hold up. You are telling me that the Keelut i killed was rated at...” before i could finish he interrupted me.”One hundred and fucking seven.” No way, i knew about the mind baking stuff but that thing was no larger than a golden retriever. No way in hell it could kill 107 people. “Your people predict that that dog thing could kill 107 people?” “No dumbass... they predict it could kill 106, then lose at the 107th.”</p>\n\n<p>I had trouble believing him “look Mark, i read about how they can cook your brain when you look at them, but i stared the thing in the eyes and it had no effect on me at all. Why?” This puzzled him. “I really don’t know, and that’s why i didn’t believe it when i first heard that some dude claimed to have shot a Keelut to death on reddit. What really confused me is why the higher ups decided it was worth getting a team to go investigate.  Now i know that they were fully aware of the caliber of shit that happens here... Speaking of caliber, can i see the gun that you used on the Keelut?”</p>\n\n<p>Damnit! I knew this was gonna happen as soon as i mentioned the gun in my posts! The organization had a no gun rule for me which is why it was a pretty big deal that the lady in the tree had helped me get my hands on one. But now they knew, and they weren’t gonna let me keep it.</p>\n\n<p>“Fuck off dude, I’m keeping the gun wether your bosses want me to or not!” To my surprise, Mark looked genuinely confused by my sudden response. “I don’t want to take your fucking gun, I just want to see it, a normal pistol shouldn’t be able to kill a Keelut with one shot no matter how perfect the aim is. I need to see what makes this gun different, and bring the bullets too, they are what I’m really interested in.” He really didn’t know about the rule i had been given about no guns. Weird.</p>\n\n<p>I reluctantly went into my room and retrieved my trusty 45 caliber thunder stick and the only box of ammo i had left. I started off with two large boxes of bullets but over time my supply was whittled down to just half of a box. As soon as i dropped the weapon and ammo onto the coffee table, Mark immediately started inspecting one of my bullets. “Knew it, do you even know what these are Cole?” “Uh, 45 caliber?” I responded somewhat slowly. </p>\n\n<p>Without looking up from the bullet, Mark began to explain. “These are NAT rounds, specially designed to deal with unholy creatures of chaos. They are created when the metals used to make the bullets are blessed by Native American shaman and medicine men. You can tell what they are by the slight warmth they give off and the small vibrations you can feel when you squeeze them between your fingers. However, these are the most active rounds i have ever come in contact with. They are much warmer and vibrate more than the rounds that am issued. If that lady in the tree gave you these, she is likely more powerful than you realize.” Mark looked up, maybe expecting some type of awe at this revelation. </p>\n\n<p>“Well that’s neat.” I responded somewhat dumbfounded. I guess it was cool to have enchanted bullets and all but it didn’t change much in the grand scheme of things. Kind of like how your car’s speedometer goes up to 120 miles per hour. Most people won’t ever drive that fast, but it’s cool to know that when the time comes you might be able to. Then again i guess the magic bullets came in handy when i shot the Keelut, as well as a few other things, so maybe i should be more grateful. </p>\n\n<p>Before Mark could scold me again for my lack of reaction to his astounding observations, we were interrupted by a knocking on the door. We look over to see one of the three guys Mark had been working with when he first arrived. Through the window in my door we could see him frantically beating on the wood and looking over his shoulder. “MARK! IT ATTACKED THE VAN! HOLY SHIT JACK IS DEAD AND PHILIPS IS HURT BAD! COME HELP ME CARRY HIM PLEASE!”</p>\n\n<p>Mark started to jump up then caught himself. “Cole this thing is good, it almost got me a second time. Shit, and it almost got me with the fucking help me technique as well.” I started to smile, at least Mark wasn’t a complete dumbass. I watched skinny as he began that stupid grin he always did when he got figured out, then he darted off.</p>\n\n<p>Not much has happened over the past few days and I’m starting to get used to my new roommate. I’ll still keep y’all posted though. Something wild is bound to happen sooner or later. Especially with all the “Patrols” Mark keeps making us go on. </p>\n\n<p>Cole signing off, for now. </p>\n\n<p><a href=\"https://www.reddit.com/r/nosleep/comments/8j9y4o/my_property_isnt_normal/\">Part 1</a></p>\n\n<p><a href=\"https://www.reddit.com/r/nosleep/comments/8l7viu/my_property_isnt_normal_part_4/\">Part 4</a></p>\n</div>\n","author":"Murderbird17"}