{"rank":"5","title":"The Mirror","id":"8mes36","url":"/r/nosleep/comments/8mes36/the_mirror/","time":"1527385940000","body":"<div class=\"md\"><p>When I was younger, about 5-6 when it started, I would sleep on a pallet by my parents&#39; bed. It wasn&#39;t like we had a small house, on the contrary; it was a four bedroom home and I am an only child. I was put into these sleeping arrangements because of my grandparents living with us, one room being used to house my granddad&#39;s tools-we called this the tool room ( I may have a story about it but I can&#39;t really remember it right now)- and the other was for storage. With the housing situation out of the way, lets get on to the story.</p>\n\n<p>The pallet was pretty big and pretty comfortable, so it came as a surprise when I said I didn&#39;t want to sleep there anymore. You see, at the foot of my pallet there was a gigantic mirror. I&#39;m not talking like a wall mirror, no, this was a highly decorative mirror that had been in my family since probably the 1940&#39;s at the very least. The thing was, it never really bothered me until I began sleeping so that I could face it. That was a big mistake.</p>\n\n<p>It started out as just a shadow, but the more I looked into it the more sinister it became. I looked kinda human, in a way. Except it was like blackened. Like someone had pushed it into an inferno. Yeah could see the scorches on it. I wouldn&#39;t, no, couldn&#39;t, sleep with it there. I began wanting to sleep with my parents, or on the couch, even one time I slept in the kitchen to avoid it. I would just stare at me. I could feel it even when I wasn&#39;t looking at it. I kept telling my parents I didn&#39;t want to sleep in there, they dismissed it as my imagination. I, at that age, had never so much as heard a scary story. So what are the odds that my 5 year old brain would come up with something like that. Yeah, very unlikely. </p>\n\n<p>At around the age of 8, my parents moved me into the bedroom used for storage. Needless to say I didn&#39;t have as many sleepless nights afterwards.</p>\n\n<p>A couple years later, I still steered clear of that mirror, but i have to admit the mirror had seen better days, and was looking as though it would fall apart any moment now. My older cousin, Cameron asked if he could take it out and use it as target practice for his BB gun. No one saw any harm in it, so they let him. We- Cameron, his siblings, and I- took turns shooting at it. I had never felt better, getting back at the object that plagued me for years. </p>\n\n<p>After it was destroyed, I never directly saw the figure again. I can still feel it sometimes and I can&#39;t really talk about it without me feeling its piercing stare. Heck, I kinda feel it right now. It is not as bad as it normally gets when I talk about it.  Last time I felt so bad that I broke down into tears and sobbed for about two hours. </p>\n\n<p>I have more stories about the creepy parts of my childhood if anyone would want to hear them.</p>\n\n<p>*Update: After I typed this out my bird went crazy and started hissing at something behind me. I&#39;m going to stay at a relative&#39;s house tonight...</p>\n</div>\n","author":"serithstar"}