{"rank":"2642","title":"Everyone is so fucking fake","id":"8meyom","url":"/r/nosleep/comments/8meyom/everyone_is_so_fucking_fake/","time":"1527387967000","body":"<div class=\"md\"><p>First of all, you should never meet someone from the internet in their own home. There&#39;s far too many stories out there of people ending up dead or kidnapped. I knew that, of course, but I figured that giving my friend Karen the address beforehand and carrying pepper spray in my purse meant that I was prepared.</p>\n\n<p>I started talking Martin on Tinder about 3 months before we decided to meet in person. I had just gotten out of a very toxic relationship and was eager to move on. I used the upgraded version of Tinder, hoping to find a match outside of town. Martin was the first person I matched with, I found his profile to be quite charming.</p>\n\n<p>He was recently divorced, loved to cook, and had three dogs. He had plenty of jokes in his bio that actually made me laugh, and to be quite frank I was happy to see any profile that didn&#39;t follow the same beats you saw with everyone. You like coffee and hiking, we get it, you all do.</p>\n\n<p>Martin’s photos were clearly airbrushed on facetune, but hey, so were mine. He wrote a hat in all of them, which screamed “I&#39;m balding,” but I didn&#39;t mind. He messaged me as soon as we matched and we just hit it off.</p>\n\n<p>We started talking on the phone every night. His voice had a child-like lull that I appreciated; he was a goof. We had long conversations about our lives… and then the first red flag appeared. We were talking about jobs we’d had before.</p>\n\n<p>“I&#39;ve been a doctor, police officer, fireman, astronaut, you name it,” he declared.</p>\n\n<p>I chuckled, “You&#39;re too much.”</p>\n\n<p>“No, I&#39;m being serious.”</p>\n\n<p>“Really? I… I mean you can&#39;t expect me to believe that.”</p>\n\n<p>“It&#39;s the absolute truth.”</p>\n\n<p>I figured that he was playing a long joke on me, he didn&#39;t seriously expect me to believe that. I wrote it off as a dumb joke that I didn&#39;t quite get and we moved on in our conversation. Still, something in the back of my mind felt… alarmed. Looking back on it now, I was stupid to meet up with him. But, in all honesty, I was desperate.</p>\n\n<p>Days later, I decided it was time that we met in person. He invited me over for dinner and I agreed. After sending one of my friends the address, I embarked on a two hour drive to “Loveville.”</p>\n\n<p>I thought the name was fake. “Loveville,” seriously?However, I entered the address in my google maps and it was actually a real place. I spent the next two hours catching up on podcasts in an attempt to calm my nerves as I made the drive down. I figured that the best way to get past my anxiety about it all was to just power through.</p>\n\n<p>As I neared Loveville, my podcast started to cut out, my phone showed no bars, but my google maps had already routed the location and continued to guide me.</p>\n\n<p>It was strange that I had no reception out here, considering how well off Loveville looked. Big houses, well groomed, no trash in sight; maybe Martin wasn&#39;t lying about his million careers. He had to be loaded.</p>\n\n<p>When I hit Martin’s street, I began to panic. I scanned the area to find his house before finally coming across it. It was a very tall pastel green house. It looked like something out of Edward Scissorhands.</p>\n\n<p>With four deep breaths, I took out my phone and attempted to text Martin that I had arrived.</p>\n\n<p><strong>Message failed to deliver</strong></p>\n\n<p><em>Great</em></p>\n\n<p>With heavy breaths, I got out of my car. The sun was bright and all of the pastels of the neighborhood weren&#39;t helping, so I tossed on a pair of sunglasses and approached the house. I pressed the doorbell and could hear a charm play through the house. The door opened, making my heart stop.</p>\n\n<p>“Cameron? How are you!”</p>\n\n<p>Martin didn&#39;t facetune his photos after all. He had perfect skin. I couldn&#39;t see a single pore. His round head almost shined, it was so smooth. He also wasn&#39;t bald<em>ing</em>, he was completely bald. The sun reflecting off of his head could&#39;ve blinded me had I not been wearing sunglasses. He wore a light pink polo with bright blue jeans. Not a wardrobe I particularly enjoy, but I&#39;m sure he thought I looked like a streetwalker. Such is life.</p>\n\n<p>“I&#39;m doing great, Martin. How are you?”</p>\n\n<p>“Never been better!” Martin had a bright, big smile on his face. “Come on in!”</p>\n\n<p>I exhaled slowly and entered his home. It was decorated to perfection. Pastels everywhere, which seemed to be the theme of the town. It was strange, but I&#39;m not going to argue with rich folk.</p>\n\n<p>“Why don&#39;t you have a seat on the couch? Dinner’s just about ready.”</p>\n\n<p>I sat on the couch, took off my sunglasses, and checked my phone. Still no service.</p>\n\n<p>“You don&#39;t get great cell service out here, do you?”</p>\n\n<p>“Nope, it’s really dodgy!” He called from the kitchen.</p>\n\n<p>That didn&#39;t sit right with me. We had talked on the phone quite a bit and there was never any problems with it then. But, it&#39;s not like I could fault him for that, he doesn&#39;t control the cell reception.</p>\n\n<p>I tapped my fingers on the phone screen and waited for Martin to return.</p>\n\n<p>“So, how was the drive?” Martin came and sat on a chair near me.</p>\n\n<p>“It was fine. I had a lot of podcasts to catch up on, so it went by pretty quick. Do you listen to any?”</p>\n\n<p>“Can&#39;t say I have.”</p>\n\n<p>“Ah.”</p>\n\n<p>We both just looked at each other and smiled. I began to examine his face much more closely. I didn&#39;t notice it before when I was wearing my sunglasses, but something about him looked off. I realized he was watching me stare at him and quickly engaged conversation.</p>\n\n<p>“Oh! Your dogs! Where are they?”</p>\n\n<p>“They&#39;re in the backyard. I didn&#39;t want them to be all over you,” he chuckled.</p>\n\n<p>“Oh, I don&#39;t mind. I love animals.”</p>\n\n<p>We again just looked at each other and smiled.</p>\n\n<p>The more I looked at him, the more something felt off. Something about his face definitely didn&#39;t seem right, but I couldn&#39;t quite put my finger on it. He almost looked like he was… plastic.</p>\n\n<p>I must&#39;ve been staring for too long because he soon broke the silence.</p>\n\n<p>“Everything alright?”</p>\n\n<p>“Oh! Y-yeah, I&#39;m just—”</p>\n\n<p>A loud ding echoed through the house. I jumped, visibly startled.</p>\n\n<p>“That would be dinner. I&#39;ll serve us up some plates, be right back.” Martin got up and returned to the kitchen.</p>\n\n<p>I started examining the living room, taking in all the details. A grandfather clock, a coffee table, lamps, potted plants. I noticed there was no tv, which absolutely was not going to work if we continued any sort of relationship. I glanced up at the wall and saw a photo of Martin hanging. He was wearing a police uniform.</p>\n\n<p>There was some truth to his joke after all.</p>\n\n<p>Martin returned and startled me.</p>\n\n<p>“Dinner is served!”</p>\n\n<p>I followed him into the dining room where he had set the table with plates on opposite ends. In the center of the table there was a silver platter with a cover on top. We each sat at our respective ends and Martin put a bib in his polo.</p>\n\n<p>I just couldn&#39;t stop staring at his face. Something was so weird about it. At first I felt rude but eventually I didn&#39;t care. There was something wrong with it, something that I had never seen before. He looked like a doll or a robotic or something... inorganic.</p>\n\n<p>Martin reached over to uncover the platter. He looked up at my face and smiled.</p>\n\n<p>“Enjoy.”</p>\n\n<p>He lifted the cover and my eyes widened. </p>\n\n<p>Steak, peas, corn, potatoes, pizza, chicken, burgers, hot dogs, spaghetti, apples, bananas, lettuce, tomatoes, ice cream, cake, cookies, fries, tacos, and sushi...</p>\n\n<p>...All made out of plastic. Miniature versions, ones you&#39;d find in a child’s kitchen play set.</p>\n\n<p>I started laughing. </p>\n\n<p>Martin started loading up the toys on his plate and I just couldn&#39;t stop laughing. Martin started laughing too. He laughed much more aggressively than I was. He was laughing loud and hard. As his laughter grew, mine softened until I sat there with a blank expression.</p>\n\n<p>Despite his hysterical laughter, no tears came from his face. He looked like a short gif of something faking laughter, just repeating the same motion again and again and again. Finally, after several uncomfortable moments, his laughter ended.</p>\n\n<p>“That was good!” He began using a knife and a fork on the toys. This guy was a fucking psycho. I needed to leave.</p>\n\n<p>“Where is your restroom?” I asked. I should&#39;ve just bolted out the door.</p>\n\n<p>“Last door down the hall,” he pointed in the general direction. His hands looked so odd. When he&#39;d put them in a position, they looked like they were stuck there for a time.</p>\n\n<p>I excused myself and made my way to the bathroom. It was a small bathroom, decorated with pastels as the rest of the house was. I couldn&#39;t help it, I vomited in the toilet. This was all too much.</p>\n\n<p>After several pants, I lifted my head up and tried to flush. It was stuck.</p>\n\n<p>“Fuck it,” I thought. I closed the lid and went to the sink to wash my hands. </p>\n\n<p>I tried to turn the nozzles but they wouldn&#39;t turn.</p>\n\n<p>“What… the hell is... wrong with this place,” I panted under my breath.</p>\n\n<p>I looked up at the mirror and was met with a shock. </p>\n\n<p>There was no reflection. It wasn&#39;t glass… It was plastic.</p>\n\n<p>I opened the bathroom door and made my way back down the hall, feeling as if I was losing myself in a sea of anxiety. I thought I was going to pass out.</p>\n\n<p>I looked at the pictures on the walls and my heart sank. They were all of Martin. As a fireman, a doctor, an astronaut, a teacher, a race car driver, an actor, a chef, a bartender, a greaser, and the fucking president.</p>\n\n<p>This guy was insane. I started towards the front door when I saw Martin standing near it. A huge smile on his face. A smile bigger than any person’s mouth should be able to make.</p>\n\n<p>“Everything all right?” Martin asked through gritted teeth.</p>\n\n<p>He looked different than he had before. Either I was hallucinating or his face was changing before my eyes. His eyebrows were thicker, looking almost as if they were painted on. His eyes looked bland, as if every bit of shine and detail was gone.</p>\n\n<p>I didn&#39;t answer, I turned around and headed the other way. I went to the end of the hall where I saw a sliding glass door. Actual, real glass. I opened it without a second thought and walked into his backyard.</p>\n\n<p>On the ground were three dogs. Three plastic dogs.</p>\n\n<p>My panting picked up speed, my eyes swelled with tears. I just wanted to go home. I looked around for a way to leave through the back. There wasn&#39;t one. I turned back to the back door and Martin was standing in it.</p>\n\n<p>“Everything all right?”</p>\n\n<p>He was still smiling. His plastic looking skin shined as if it was coated in oil.</p>\n\n<p>“I would like to leave,” I said through a pained expression.</p>\n\n<p>Martin stepped out and into the yard.</p>\n\n<p>“Everything all right?”</p>\n\n<p>“I don&#39;t feel well and I want to go.”</p>\n\n<p>Martin continued to approach me.</p>\n\n<p>Alarms went off in my head. I pulled out and pepper spray and when he got close enough I went to town on his face. It didn&#39;t phase him. He continued to approach me.</p>\n\n<p>His face twisted into a look of anger, his smile appeared to be literally upside down.</p>\n\n<p>He put his hands on my shoulders and I screamed, punching him in the head with all of my might.</p>\n\n<p>Martin’s head popped off.</p>\n\n<p>No, it didn&#39;t just fall off, it popped off. With a loud POP sound. In the bottom of his neck there was a hole with a connecting piece attached to his body.</p>\n\n<p>I screamed. I screamed quite a bit. His body stumbled around, trying to find his head.</p>\n\n<p>The time for thinking was over. I ran past Martin and back into the house, grabbing my purse and heading for the front door. On my way out, I could&#39;ve sworn I heard barking from those three dogs.</p>\n\n<p>I fumbled in my purse for my keys and hopped in my car, peeling out of his driveway. I tried to use google maps to find my way out, but all connection was lost.</p>\n\n<p>I drive around, looking for anyone to help give me directions, all while sobbing. There was nobody on the streets. I finally found a gas station and ran inside, hoping to see somebody in there.</p>\n\n<p>I wiped my tears and entered the store. It was pretty small, smaller than any gas station I&#39;ve been to before. I looked for a cashier or customer but there was nobody inside.</p>\n\n<p>As I looked around the store, I saw the common items one might buy in them. Chips, candy, soda, beer, jerky, cigarettes, frozen meals. They were all stickers.</p>\n\n<p>Every aisle and every wall was just covered in stickers that resembled products. I screamed again, sprinting out of the store.</p>\n\n<p>I didn&#39;t care anymore, I drove like a maniac. On the wrong side of the road, through yards; I just needed to get out. There was not a single person in sight. Finally, I saw familiar territory and followed the road.</p>\n\n<p>Several minutes later, I was out of Loveville and back on the highway. I was speeding, slightly swerving in and out of my lane. It was hard to see through the tears. This continued for several more minutes until I finally calmed down and pulled over to the side of the road.</p>\n\n<p>I pulled out my phone, hoping to have service again. Thankfully, I did.</p>\n\n<p>I had 47 texts and 52 missed calls from Karen. She said she was ready to call the police, and I texted back to assure her I was alright. She also told me something that made my stomach turn.</p>\n\n<p>The address was fake.</p>\n\n<p>“Fake?” I texted in response.</p>\n\n<p>That couldn&#39;t be. I entered it in google maps and it guided me to Martin’s. There&#39;s no way it was fake.</p>\n\n<p>I entered the address in google maps once more to confirm what I already knew. To my surprise, it said there was no results. My heart began racing as I was met with the news. All evidence of this place was gone. That couldn&#39;t possibly be.</p>\n\n<p>I couldn&#39;t fathom what had happened. None of this seemed real. A fake guy and a fake town. The most horrific experience of my life happened and I had no evidence to show for it. </p>\n\n<p>I considered turning around to get photos of the place. To have some type of evidence to prove I wasn&#39;t crazy. But the thought of being forced to relive any of that made me want to throw up again.</p>\n\n<p>I closed my eyes and took deep breaths. Above all, I was happy to be headed back home. A place where things made sense. I wasn&#39;t sure how long I sat there with my eyes closed before my phone vibrated. I checked it, expecting it to be a message from Karen.</p>\n\n<p><strong>Text from Martin:</strong></p>\n\n<p><strong>I just wanted to make you smooth.</strong></p>\n</div>\n","author":"10gentlemen"}