{"rank":"3","title":"My Uncle and the Backyard","id":"8mf0zm","url":"/r/nosleep/comments/8mf0zm/my_uncle_and_the_backyard/","time":"1527388731000","body":"<div class=\"md\"><p>As far as I can remember, my uncle has always been a freak for aliens. His life is surrounded by the idea that aliens are out there and possibly blending in with us. The idea freaked me out as a kid an still kinda does now. As a kid he also told me things to scare me like &quot; I&#39;ve seen aliens! A UFO crashed in my front lawn!&quot; Or something like &quot;I have aliens buried in my backyard!&quot; After saying stuff like this, he would always follow it up with, &quot; If I show you anything, I&#39;ll have to kill you!&quot; I liked his stories but it always gave me the chills.</p>\n\n<p>I&#39;m older now and we had a family reunion and I spoke with him. He still went off about UFO&#39;s and aliens and others. Being reminded of the aliens in backyard made my curiosity jump. What if it was real? What if he really is hiding something? No. It couldn&#39;t be. The government would have found out by now...right? I couldn&#39;t take it. I had to know if this was true. I can&#39;t let this opportunity get away from me. We have tried so hard only to let one man blow it. A week later I went to his house into his backyard and started digging. I dug and dug and became desperate. I was digging ferociously. Then it happened. I reached it. He wasn&#39;t lying. It was there. Aliens perfectly preserved, as they should be. We can&#39;t decompose, It&#39;s in our nature. Just as I had my hands on it, I heard the backyard door shut from behind be. I saw my uncle with a shotgun aiming at me.</p>\n\n<p>&quot;I warned you for years brat, I had my suspicions about you and I was right. You&#39;re a God damn ali-&quot;</p>\n\n<p>Just that moment, I stopped him. No one can stop the retrieval of B-X23 and B-X30. I took the carcasses, including my so-called uncle, and left.</p>\n\n<p>I made the headlines the next day. It&#39;s not the first time. It read &quot; BREAKING: LOCAL MAN DISAPPEARS! DITCH LEFT IN BACKYARD LEAVES MANY QUESTIONS FOR POLICE.&quot; Our kind excel in framing others or not leaving any trace of where we are or went. Basically we never leave evidence anywhere we do something. We are planning something. Something big. We are gonna need everyone we need for this. Which is why I was forced to do what i had and have to do. I don&#39;t like it. But I must. The future is near. The beginning is just beginning. An old race is coming to a stop and entering a new. To be completely honest, your people could have stopped it. But those that led you kept it hidden away. WE allowed people like my &quot;uncle&quot; to continue living so you people could be convinced and figure it out yourselves. But time has run out.</p>\n\n<p>T H E R E V O L U T I O N C A N N O T B E S T O P P E D</p>\n</div>\n","author":"DisastrousChip"}