{"rank":"36","title":"Something has been happening on the highway for the past couple of nights.","id":"8mf0nu","url":"/r/nosleep/comments/8mf0nu/something_has_been_happening_on_the_highway_for/","time":"1527388630000","body":"<div class=\"md\"><p>Let me introduce myself before I tell you this. I&#39;m Emma, I have one sister, a boyfriend, and both of my parents are still actively married. We live in a small two story, in a small neighborhood, with woods and the highway near by. </p>\n\n<p>No one visits us much its usually just my boyfriend or the neighbors. Most of my family doesn&#39;t know where we live. </p>\n\n<p>About three days ago I was sitting on the roof of my house since I had access to it. It helps me calm down when I am stressing over school or if I just want alone time. Where I live it gets dark around 7-8. My boyfriend, Chris, had just left since it was 8:30. For my parents that&#39;s to late to have a boy over. It was already dark outside and since it had been extremely warm out, I thought it would be good for me to go sit on my roof and listen to music to just think until Chris got home. </p>\n\n<p>I had climbed out my window and closed it just enough so I could still be able to open it with ease if I needed to go back inside. I got into my usual spot where I set my blanket at and laid down listening to some cheesy 80s music. I only keep one earbud in so I can hear if someone is calling or if someone tries to open my door.</p>\n\n<p>At first it wasn&#39;t very noticeable it sounded like someone was talking and i just thought it was one of my neighbors till I sat up and didn&#39;t see see anyone else outside. I wasn&#39;t freaking out to much since I had my dog sitting outside and he wasn&#39;t barking. I laid back down and changed the song to a more bearable song. Then I heard it again but it wasn&#39;t the same. It was sorta lower and instead of fast talking it was a low pitched, chattering in the woods. I heard my dog slightly growl and that&#39;s when i decided that it was time to inside. I was half-way through the window when a heard a chuckle come from the ground. I quickly got back inside and closed my window and set a poster board in front of my window just cause I don&#39;t want to see anything in the middle of the night starring at me.</p>\n\n<p>The next day I went downstairs to see if any of my family had went outside last night to scare me and they all said no. Thinking that they were just playing I brushed it off and went back upstairs to browse songs on my computer so I can add more songs to my playlist. </p>\n\n<p>Chris came over so we could go to the lake to explore around the waters. I asked him if he had stayed a little longer and tried to scare me last night and he also said no. He brought up that a couple of people have been going missing in the past couple days near the highway and that I should stay off my roof until they find out what has been happening. Me being my stubborn self I decided that I am going to keep going onto my roof. He didn&#39;t mention that it was the highway that I lived near.</p>\n\n<p>I decided to go out earlier than I usually do cause I didn&#39;t want to be out there long. I laid down and closed my eyes. I guess I fell asleep since it was really dark outside. I looked at my phone to see what time it was. It was 9:32. I didn&#39;t think much of it. I started to gather my things until I heard something in the trees near my house. I looked that way. I didn&#39;t know what I was seeing. It was tall, not inhumanly tall. In front of this figure, is what looked like something crawling. I stepped a tad closer to the edge to see what it was. It looked like a human, or a dog. The things both looked up at me. The tall figure grabbed whatever was crawling and dragged it into the woods. I jumped through my window and ran downstairs. I didn&#39;t want anything to happen to my dog so I led him inside and led him to my room.</p>\n\n<p>I decided before going to bed that I wanted to do more research on the people going missing. They all had one thing in common. They had brown hair. Nothing else seemed to be the same. They all varied in sizes. </p>\n\n<p>I forgot to mention that I had natural brown hair but I had recently dyed it to sliver with black roots. That steady my mind a little for me to have the courage enough to go to sleep. </p>\n\n<p>The next day I made my way down the stairs to hear over the news that another person had gone missing. Amelia Brown seemed to be her name. We all so the location on where her body was found. It was half a mile south from our house. It freaked my parents out enough to tell me not to go out onto my roof anymore without anyone else being there with me to make sure I don&#39;t get hurt. </p>\n\n<p>Some police officers came by and asked if we knew anything about it or saw anything. I told them that I heard stuff the night before and saw something last night. They said that they would petrol the area. I am sitting at my desk right now typing what all I remember cause I have not seen or heard anything from the police. They were supposed to be here hours ago but haven&#39;t shown up. My parents and my sister are quietly sleeping in their rooms with no worries. I don&#39;t know who all else to tell and if anyone could help it would be nice. I will report to you guys in the morning to see if it went how it was supposed to go.</p>\n</div>\n","author":"crystalclearwolf"}