{"rank":"29","title":"The only friend you'll never need (Pt. 1)","id":"8mf1k7","url":"/r/nosleep/comments/8mf1k7/the_only_friend_youll_never_need_pt_1/","time":"1527388932000","body":"<div class=\"md\"><p>Growing up as a kid, I had a lot of social anxiety. I struggled to make any friends all through primary school, and I would often keep to myself. I was bullied a lot because of this. It wasn&#39;t pleasant, as you could probably imagine. The only real friend I ever had in primary school moved away back in the second grade, and I never saw him again. My mum was fed up with it. She was sick and tired of knowing that I sat alone during class, that I kept to myself every lunch and that I had no friends. She made many efforts to try and fix this issue. She tried transferring me to different schools. It&#39;s because of her that I had attended three different primary schools. But alas, no matter where I went, no matter how hard I tried, I was never able to sustain a friendship. </p>\n\n<p>During the fifth grade, I had begun to fall into a state of depression. It wasn&#39;t just because I struggled to make friends, but I had also become the number one victim to bullying. I cried myself to sleep countless nights. There were days where I would go to any means to avoid attending schools. The measures I went to were often extreme. I had purposely broken bones on several occasions to avoid school. I often consumed unsanitary things, whether it be expired milk, or the gunk that built up it the bathroom sink. It got to the point of desperation, to the point where I needed something to ease my state of mind, to keep me sane. And so came the creation of my imaginary friend.</p>\n\n<p>I&#39;m sure anyone reading this is familiar with the concept of imaginary friends. I was quite hesitant with the idea of creating an imaginary friend throughout primary school, as the idea of communicating with what was essentially thin air seemed ridiculous at the time. But during the fifth grade, the concept didn&#39;t seem to bother me anymore. I was desperate for a friend after all, and this seemed like the best option. At the time, I had no self-esteem, so any hopes of making a real friend seemed impossible, especially with my reputation at the time. I realised how ridiculous having an imaginary friend would make me look, but I had already hit rock-bottom, so I didn&#39;t really have anything to lose. And so, Mina was born.</p>\n\n<p>In my mind, Mina was around my height. She had blonde hair and blue eyes, and she had a beautiful smile that would always put me at ease. She would always wear the same long silky white dress, and she would always walk around bare-foot. I would play with Mina every day. She would laugh at every joke I made, and join me with every game I played. We would talk and talk for hours on end. She would sleep next to me every night, on the opposite side of my bed. Whenever I did have to attend school, she would always follow along with me. It was a struggle communicating with Mina at school. I was afraid that people would judge me if they found out I had an imaginary friend. It would just give them all one more reason to pick on me. She would always sit next to me in class. It almost felt like she was giving my life meaning and purpose, and I didn’t really feel alone in the world anymore. </p>\n\n<p>Eventually, my classmates did catch on to her. The backlash was great. Soon enough, everyone in my year level knew I had an imaginary friend. Of course, it made me seem like the biggest loser back then. Everyone else in my year level had real friends, groups of friends even. It felt like I was the only one alone, with my only friend being my imagination. People started referring to Mina as my &#39;girlfriend&#39;. It was an understandable insult. Back then, most other boys my age were getting familiar with the concept of having girlfriends. Most of them even claimed to have girlfriends.</p>\n\n<p>Throughout the rest of fifth grade, and even sixth grade, Mina was my only true friend. I enjoyed the time I spent with her, and I was feeling better those two years. My mum felt differently about the situation though. She felt as though something was wrong with my state of mind. She said it was unhealthy for me to have become so attached to an imaginary friend. I told mum that Mina felt real to me, but that only worried her more. Her worries increases as I had just finished year six, and high school was approaching fast. She didn&#39;t want me to experience the same kind of pain I did in primary school, the pain of not having any friends; the pain of being alone. So, during the holidays my mum hired a counsellor to aid me with my state of mind. </p>\n\n<p>Throughout the holidays, he was helping me overcome my social anxiety while also helping to improve my mental state. After six weeks of counselling, I was feeling better. I had felt like my self-esteem had been increased. I felt more confident. The counsellor had told me that when I started high school, I should try making new friends and that I should leave Mina as nothing more than a fantasy, and that I should forget about her. At the end of my counselling, the counsellor asked me if I still communicated with Mina. I told him that I didn&#39;t anymore. But I lied. All throughout my counselling, I still kept Mina close by my side. We still spoke and played with each other every day of that holiday. </p>\n\n<p>However, the start of high school is when everything began to change. The first few days of my new school were a little rough, as I will still trying to get used to my new surroundings, including all my new classmates. But after a week or two, I was actually becoming more comfortable with it all. My classmates were actually communicating with me. It was a concept that I hadn’t felt familiar with in years. All of a sudden, I didn’t feel like an outcast anymore. I had made real friends. And by the end of the first term, I already had a circle of friends, not just one. I felt great. I felt better than I had ever felt in my life. School didn’t seem so horrible anymore. I didn’t have to hide from school anymore, because I had built a new reputation and I was no longer the target for bullying. I wasn’t scared anymore. I felt a happiness that I hadn’t ever felt before. Even my mum could tell the difference between me and my old self. I wasn’t depressed anymore. At the time, life was good. \nAs I hung out with my friends more often, Mina was slowly becoming nothing more than a memory, and at the end of the seventh grade, I had forgotten about her completely. I didn’t need her anymore. </p>\n\n<p>It would be nice if I could end the story here, on a happy note. But then, that wouldn’t be the whole story, now would it?</p>\n\n<p>Fast forward to the ninth grade. Most of my friendships had still been sustained. I had even made some new friends along the way. Overall, I was happy with the amount of friends I had. My life was going great, and at the time, it seemed like there was still nowhere to go but up. How wrong I was…</p>\n\n<p>It all started on that fateful night. It started off a night like any other. Our class had received some homework which had to be completed over the weekend (It was a Friday night, just to clarify). I had made plans to meet up with my friends over the weekend, so I decided to just get the homework over and done with that same night. While eating dinner with my mum that night, she told me she was going out to meet up with some of her friends, and that I’d be home alone for the rest of the night. I told her it was fine. I was used to being home alone anyway. My mum worked a lot, so while I was in my state of depression back in primary school, I’d usually be home alone while my mum was at work. \nAfter we ate dinner, my mum gave me my usual lecture on what to do if a stranger knocks on the door, and then she proceeded to leave the house. I grabbed my textbook and notebook from my school bag and took them to our study. I closed the door behind me and placed the books on the desk. Our study is a very small room, with one big desk in the corner and a bookshelf on the other side of the room. It has a computer and a printer. Other than that, it’s a pretty empty space. I sat down and opened my notebook to the next empty page. Except, the page that was supposed to be empty, wasn’t. There was writing on it, but it wasn’t my handwriting. The words were written with big bold letters. It was a message. It read: ‘Why did you leave me, Jonathon?’</p>\n\n<p>I stared at the message for a while, unsure of what to make of it. Uneasily, I passed it off as some sort of weird joke one of my classmates had left for me in my book. I turned to the next page. There was more writing. ‘Jonathon, why did you forget about me?’\nThere was more writing on the next page too. And the next page, and the page after that. There was a series of messages that continued throughout the book, all of them with different, yet similar messages. Messages like: ‘Come back to me Jonathon,’ or, ‘I miss you Jonathon,’ or, ‘I forgive you Jonathon.’ \nI had an idea of what this was, of WHO this was. But I didn’t want to believe it. It was impossible. Or rather, it seemed impossible. I kept reassuring myself that this was just some sick joke, when in my heart I knew what it really was. As if my suspicious were yet to be confirmed, the next page I turned over read: ‘It’s me!’</p>\n\n<p>I shut the book in an instant after reading that and threw it to the wall. I burst open the door and ran for my room. I shut my bedroom door behind me and curled up within the safety of my bed sheets, when all of a sudden a phone rang. The sound of the ringing was coming from within my room, except that wasn’t possible. The ringtone belonged to my house phone, but that always stays in the living room. I never take it into my room. And yet, as I peeked over the bed sheets, there it lay on my bedside table. I don’t know why, but I felt a compelling urge to answer the phone, and so I did. As I greeted the caller over the phone, an unfamiliar voice spoke to me. It was a voice I had never heard before, and yet, I knew exactly who it was. “Jonathan, do you remember me?” The voice asked. I hung up the phone and crawled back into my bed sheets. But then it started ringing again. I tried to ignore it, but the ringing grew louder and louder, to a point where I could no longer stand it. I answered once more. </p>\n\n<p>“Please don’t ignore me Jonathan. I don’t want to be alone anymore.” </p>\n\n<p>I don’t know why I felt so scared. I knew who this was. I had known her for many years. But, it didn’t seem right. It wasn’t right. This was impossible. She was just a figment of my imagination, something that I had made up to keep me company, and yet here she was back to haunt me. I didn’t reply to her. But I still held the phone up to my ear. I was too afraid, unable to move at that point. I didn’t know what to do.\n“Jonathan. Please come back to me. I love you Jonathan. I want you back. Jonathan I need you! Please come back to me Jonathan. Come back to me! PLEASE COME BACK TO ME!”</p>\n\n<p>I screamed at the top of my lungs. Suddenly, my mum came bursting through my bedroom door. “Are you okay sweetie?!” She asked. I glanced at my hand. The phone was nowhere to be seen. I glanced at my alarm clock. It was eight in the morning. ‘Was it all just a dream?’ I wondered. But I couldn’t have been a dream. It felt so real. It wasn’t just a dream, as I’d soon find out.</p>\n\n<p>Because this was just the beginning of an endless nightmare…</p>\n</div>\n","author":"_Illegal_Carrot_"}