{"rank":"10","title":"A cave best left alone","id":"8mf33n","url":"/r/nosleep/comments/8mf33n/a_cave_best_left_alone/","time":"1527389429000","body":"<div class=\"md\"><p>Here it shall be stated that I did not know about the cave upon my father&#39;s death.  I had always known there was something wrong with him, some dark secret that he&#39;d rather leave alone.  But had I known what I know now, I&#39;d have said that the cave was best left undisturbed.</p>\n\n<p>It all started as we were distributing out the spoils when I came upon a map that had a location marked &quot;do not enter&quot; not too far from a small town.  I, nevertheless, was left intrigued, so requested that I receive it from him, and I achieved this without contest.  I had made it my goal to discover what lies in the depths below.</p>\n\n<p>So, with the map in hand, I set out to find this town.  This was achieved without much trouble.  I promptly went about procuring supplies for the journey ahead.  When the owner of the general store asked me as to what the supplies were for, I told him.  He at once acted shocked and told me that the cave was cursed.  I, however, didn&#39;t believe in such savage old ideas, so told him that I would be going there.  He finished selling me supplies without anything of note.</p>\n\n<p>With a lantern in hand and a few weeks rations on my back, I headed out on a journey to discover what sort of primitive nonsense dwelled in the depths below.  Upon entry, many people pass had written warnings upon the walls, I choose to ignore them and continue on.</p>\n\n<p>The first day, nothing of note happened, apart from some strange dream, that seemed to warn me to stay back.  It was only a dream, however, it felt oddly real, but I&#39;d continue on regardless.  On the second day, I was shocked to hear a small noise around me: Tap, tap, tap.  </p>\n\n<p>Now, this was odd for several reasons, firstly, the cave was dry.  So I quickly turned my lantern around and found nothing, not even a small drop of water.  But it didn&#39;t happen at all for the rest of the day, so I assumed it was just an anomaly.</p>\n\n<p>That night, I had another strangely real dream.  This one was quite different from the first, as the voice then told me that it was utterly indifferent to my progress into the cave.  So, knowing it was just a dream I continued onward, to the third day.</p>\n\n<p>The third day I was awoken by the familiar tapping sound, still with no source.  That day I heard it several times, and it seemed to follow me as I went further.  I, while starting to regret this expedition, felt the strange urge to carry on.</p>\n\n<p>That night&#39;s dream was again different, as it encouraged me to continue onward, only to be greeted by living shadows.  While unnerved, I knew it was only just a dream, so continued on as usual.  The tapping continued, but I had long grown used to it, yet it would soon take a dark turn.</p>\n\n<p>At one point the tapping was caused by one of the shadow creatures, the ones from my nightmares.  It was an average human form, yet black with wisps coming from it.  It had no eyes or even a skull structure, yet remained oddly peaceful. It frightened me at first, but I knew that there was no going back, so continued unharmed.</p>\n\n<p>As I went to sleep, the dream took one final form.  It congratulated me and told me that I wouldn&#39;t have to wait much longer.  The shadow creature seemed to be a friend and ally in the whole ordeal.</p>\n\n<p>As I awoke, the shadow creature was watching me, and then motioned for me to follow.  Knowing it was my friend, I got up and did as it asked.  It ended up leading me to here, where I&#39;m currently writing this testimony.  There are now many shadow creatures all surrounding a marble obelisk, all, including me seem to be worshipping it.  I am writing this under my last lamplight, and intend to wait out the rest of my days here.  If you&#39;re reading this, you likely can&#39;t escape, but if you can, tell people that this is a cave best left alone.</p>\n</div>\n","author":"loltank53"}