{"rank":"2","title":"I Had a Dream","id":"8mf8x8","url":"/r/nosleep/comments/8mf8x8/i_had_a_dream/","time":"1527391281000","body":"<div class=\"md\"><p>Today was one of those days that never seem to end. Work dragged on for centuries, traffic was horrid, my boyfriend canceled our date last minute and I burnt my dinner. By the time I stumbled into bed I was exhausted, dejected, and ready for a full night’s sleep. My eyes were closed before my head hit the pillow, and it wasn’t long before I felt myself slip into a hazy dreamland. \nI batted my eyes and looked around, suddenly I found myself standing in the living room. It took a moment to realize I was dreaming but when I did I was overcome with a mixture of joy, confusion, and dread. I had never lucid dreamed before and it seemed odd that of all the things I could conjure, I dreamt of my own living room. </p>\n\n<p>I was just beginning to explore my dream house when I heard a bloodcurdling shriek coming from the bathroom. Dream me instinctively ran towards it, as if my body and mind were entirely separate. I reached the bathroom and flung the door open. Nothing. I whirled around and faced the stairs, my body began the ascent, slowly, shaking ever so slightly. Another shriek echoed out from the upstairs hallway. I lurched up the stairs, sprinting toward my own room. When I reached the doorway an odd glow emanated from the cracks. I watched as my hand pressed lightly against the door. I peered into the room and watched in horror as a dark shadowy figure slipped out my window. The glowing stopped. </p>\n\n<p>I took a moment to compose myself before my body led me into the room. I scanned every nook and cranny before determining it was safe. I sat on the bed for a brief moment, contemplating what I had just seen before my body led me back down the stairs and out the back yard where I stood still in front of the shed. Another howling shriek emanated from behind the shed door. I watched in dismay as my own hand betrayed me, swinging the lock open and barging into the shed. I was immediately blinded by light, squinting I could just barely make out a figure in the back corner. Stepping closer I could see that the figure was in fact my own mother. \nShe laid in a crumpled heap, sobbing, her face in her hands. She looked almost ethereal, shrouded in a dark blue velvet robe I’d never seen her wear before. </p>\n\n<p>“Are you okay!?” </p>\n\n<p>I cried out in horror whilst rushing to her side. She sniffled and raised her head, managing a forced smile.</p>\n\n<p>“I’m aright sweetie, it’s just been a long day.”</p>\n\n<p>“Can I get you anything?” I sat on the floor next to her, stroking her arm. </p>\n\n<p>“No, no, I’m fine. But I could use a hug, I suppose.”</p>\n\n<p>Without hesitation I threw my arms around her, nestling my head on her chest. I looked up to offer more words of encouragement but as turned my gaze something strange began to happen. My mother’s face distorted and began to morph into a dark, shadowy, hideous, beast. Her limbs began to stretch and reach towards me. This wasn’t my mother. </p>\n\n<p>I leapt from the ground and ran back to the house, all the while hearing footsteps and a shrill shrieking trail behind me. I bolted back up the stairs, trying in vein to make my dream body move faster. I could feel the creature gaining on me as I reached my room. I laid a hand on the doorknob and everything went black. When I opened my eyes I was laying in my bed, drenched in a cold sweat amplified by a chill breeze flowing through my open window. I flexed my hands to make sure I was awake. In control of my body once again, I hopped out of bed and closed the window. I laid down and took a deep breath, reminding myself that it was just a dream. Just as I began to close my eyes, I heard a knock on my door followed by a slow creak. </p>\n\n<p>“Sweetie, are you okay? I don’t mean to intrude, but I was up and thought I heard you out of bed.”</p>\n\n<p>“I’m okay, just a bad dream. Thanks, mom.”</p>\n\n<p>She stood quietly in the door way before flicking the switch on my desk lamp. It’s soft glow was just enough to force my eyes open. </p>\n\n<p>“Do you want to talk about it?”</p>\n\n<p>I propped my head up on my elbow and turned toward the door. My heartbeat quickened and my words caught in my throat. My mother stood in the doorway, illuminated by the soft light, wrapped in a dark blue velvet robe I’d never seen her wear before. </p>\n</div>\n","author":"anniewill64"}