{"rank":"1","title":"This is what happened after I snapped out of my gaming addiction","id":"8mfb8w","url":"/r/nosleep/comments/8mfb8w/this_is_what_happened_after_i_snapped_out_of_my/","time":"1527391991000","body":"<div class=\"md\"><p>It was everyday non-stop clicking of the mouse and keyboard while I was playing some video game on the PC. But of course that was taken away from me by my parents because I was apparently addicted to it. </p>\n\n<p>But it didn’t matter, I could just skip through their text like some visual novel that one could easily rush through. Or accidentally talking to the same boring old NPC saying the same thing to the main protagonist. I just wanted to finish the game already.</p>\n\n<p>Today they sent me away to another unplug camp AGAIN this summer. Now it marks year 6 of a boring summer.Yes, it is fun there, but I always ended converting back to my old ways, like most people. </p>\n\n<p>My parents don’t have a real good reason of taking away my PC. I always had good grades in school and the teachers their recommended my family sending me to the best colleges in the country. And because of that, I can still keep playing.</p>\n\n<p>‘Huh, it’s been a while since I had gotten up from the PC. I’m just going to go get something to eat’ , I thought to myself. People have limits and so do I.</p>\n\n<p>And that’s what got my mom and dad killed.</p>\n\n<p>“FBI! Open up!”</p>\n\n<p>“What was that?”, I said to myself. That could’ve been anything, I have been playing for quite a while so that’s a stable alibi. Then came the knocking on the front door.</p>\n\n<p>It wasn’t gentle, it was violent as if there was someone trying to get in here to kill me. Then it all stopped.</p>\n\n<p>All sound stopped except for the AC that I had left on. And then I started to smell something. It was a weird scent. And it was from upstairs.\nAs I got closer to the scent it was from my own very room.</p>\n\n<p>I opened the door.</p>\n\n<p>And there they were, my mom and dad.\nMangled and beaten to death, brutally.</p>\n\n<p>“Mom?! Dad?! How did this happen?!”</p>\n\n<p>It came back to me.</p>\n\n<p>It was the end of the unplug summer camp, and I went back hime with my mom. I went back to my room. And my PC was gone.</p>\n\n<p>“Mom. Where the hell did my PC go?”</p>\n\n<p>“Well, your dad and I thought that this year and from now own you should give up your gaming addiction. Live a better life.”</p>\n\n<p>“Are you kidding me?! You knew how much that meant to me!”</p>\n\n<p>“Erick, calm down. You can get over this. Don’t get pissed about this change. It’s for your own good.”</p>\n\n<p>“‘For my own good’ my ass! Where is it?!”</p>\n\n<p>“Erick! Stop screaming!”</p>\n\n<p>“No! Fuck you! For all this time, you just destroy my life?!”</p>\n\n<p>“You were destroying your own life in the first place, honey.”</p>\n\n<p>And then at that point, I snapped. I punched my in the stomach and smashed her head on the mirror on the wall. I could hear her begging me, pleading for her life for me to stop. But if course I didn’t. I grabbed one if my old textbooks from the last school year and bashed her head in. Then I stomped her face in with splatters of blood everywhere. On the walls, the floor, almost to the ceiling. And you know what happened with my dad.</p>\n\n<p>I got the PC back. But I won’t be able to use it again anyway. Not with life sentence in my record until I die. I hope I can remind my new self if I ever get reborn. Don’t try to get addicted to video games.</p>\n</div>\n","author":"SomeAsianBoi69"}