{"rank":"5","title":"We're All Monsters but I'm different - Part Eight","id":"8mfb5f","url":"/r/nosleep/comments/8mfb5f/were_all_monsters_but_im_different_part_eight/","time":"1527391957000","body":"<div class=\"md\"><p><a href=\"https://redd.it/8bou3t\">Part 1</a> <a href=\"https://redd.it/8cb7ts\">Part 2</a> <a href=\"https://redd.it/8d4g9t\">Part 3</a> <a href=\"https://redd.it/8eabus\">Part 4</a> <a href=\"https://redd.it/8gfyum\">Part 5</a> <a href=\"https://redd.it/8i4lw8\">Part 6</a> <a href=\"https://redd.it/8kbrr4\">Part 7</a> <a href=\"https://redd.it/8mfb5f\">Part 8</a></p>\n\n<p><strong>Mexico in Winter</strong></p>\n\n<p>I drifted far from the border.\nDeeper into Mexico, and further from the small town loner I once was.\nI brought an OK car, began driving around without a plan. Sending the odd message to my brothers, but mostly keeping to myself.\nI had fun, being the Gringo.</p>\n\n<p>I’d go to bars, get drunk on tequila, piss off the locals, and let them kick my ass.\nMaybe it was guilt, or maybe I was trying to head off karma, not that I could.\nCuts and bruises disappeared in minutes, black eyes faded quickly.</p>\n\n<p>Pain was dull and brief, sharp pain vanished altogether, aches just stopped after a minute or two.\nI was as far from Human as I’d ever been, and always, the sense grew, that there was so much more to this dark power. I might have gone on that way forever.</p>\n\n<p>And then, I met Gail.</p>\n\n<p>Some half assed college had arranged a cultural exchange, a busload of Spanish majors unloaded in my hotel lobby. Their Spanish made the staff giggle under their breath.\nIt had been a long time, between rest stops in normal company, and I was hungry for some human contact. The kind that doesn’t end with eating someone’s heart.</p>\n\n<p>They were old enough to drink, and I befriended them in the Hotel bar, after an hour I suggested we go to a decent club I frequented. The drinks were cheaper there, the hotel was charging more if you were an American.</p>\n\n<p>It was a good night. I made eyes at Gail, slowly warming to her, she wasn’t interested. I let it be.</p>\n\n<p>They toured the city, visited the sites and ancient ruins, and I caught up with them that night.\nThey were too tired to party, but I suggested a quiet meal at my favorite local restaurant, I’d pay.\nWhat the hell right, I’m rich. Dead men’s ghosts are a small price to pay, and they were quieter when I was with people, nights alone can be hard.</p>\n\n<p>We ate, drank some really good tequila, and left a positive impression.  On our return to the hotel, Gail spoke to me in the lift.\n“Thanks for the meal.”\n“No problem.”\n“So...you’re here on business?”\n“Sure.”\n“What do you do?” I looked her in the eyes, a second too long, and saw the first glimmer of interest.\n“I... I’m kind of a debt collector.”\nThat had her frowning and smiling, what do you even call that expression?\n“Isn’t that dangerous?”\n“Very.” I said with a grin.\nShe looked at me sideways, curious but unconvinced.</p>\n\n<p>The next day, they packed up, and moved onto another city, I saw them off at breakfast, Gail gave me a long look, from the bus window as it moved off.\nHer head dipped, and when she looked back up at me, I could tell she was interested.</p>\n\n<p>I watched the bus go, and decided, maybe it was time for me to move on too.</p>\n\n<p>I had no idea where they were going, but I must have picked up a hint at dinner, because two days later, I caught up with them.</p>\n\n<p>“You following me?” Gail asked, appearing out of nowhere in a hotel car park.\n“Yeah. That money you loaned, they want it back.” I joked\n“Which Loan?” She laughed.\nI smiled at that. “Come with?” She thumbed over her shoulder, “We’re having lunch.”\n“...kay.”  I said casually.</p>\n\n<p>And that was the start of my honorary induction into the Tour.</p>\n\n<p>Over the next week, I went where they went, actually learnt something too. We spent time together as a group, Gail was friendly  but wary. I grew to like her a lot. \nI knew I was in trouble, when I thought of her not being around, and it bothered me.\nI told myself, beat a hasty retreat, before I screwed up her life.</p>\n\n<p>One evening we sat together, just Gail and I, under an umbrella as a light rain fell. The wind occasionally blew misty beads onto us, and Gail ended up fringed in a halo of tiny water droplets. I could see every strand of hair on her head, decorated like a Christmas tree.</p>\n\n<p>She talked, about her studies, then family, then hopes and dreams. I hadn’t engineered this meeting, it only occurs to me now, that maybe she had.</p>\n\n<p>“Why are you in Mexico, really?” She said, with a serious face.\n“I... really do recover debts, but, I kinda fell into it. It wasn’t my plan.”\n“What was your plan?” \n“I was looking for someone. But... so far no luck.”\nGail sipped her beer, and leaned back in her seat, fine beads of mist collecting on her eyelashes.\n“What’s it like? debt collecting.”\nI shrugged, and had to look away, what the hell do I say to that.\n“There’s screaming and yelling, guns are often present. People try to hurt me, I don’t let them, I walk away with what I came for. It’s not pretty.”\nShe sat up in her seat, puzzled look on her face.\n“Then why do it?”</p>\n\n<p>I smiled, and looked her in the eyes.</p>\n\n<p>“I LIKE IT.” I said honestly.\nSome instinct in her must have fired up, because she sat back quickly, and gave me a concerned look.</p>\n\n<p>She finally said quietly, “Are you going to be bad for me?”, like she wasn’t sure she wanted to asked.\nMy heart skipped a beat, we were eyeballing each other non- stop now.\nI could see every pore in her skin with complete clarity.\n“I’ll never hurt you Gail.” I said.\n“But one day soon, you’ll head back to America, and I won’t.”\nShe reached across the table, and I took her hand halfway.</p>\n\n<p>For the final few days, of the cultural tour, I stayed out of the way. But the nights, they were Gail’s and I, we got almost no sleep. She kept up, somehow, with all the late night trips into towns, bars and restaurants.\nWe ate, we danced, and I fell for her like no one before.</p>\n\n<p>The last night together, yeah, I won’t write about it. Its mine and hers, it’s the one tiny candle light in a long dark night. I kissed her goodbye in front of everyone, as they boarded the bus that final morning.\nThere were whistles and jibes and she took it like a champ, I was churning inside, I wanted to climb onto that bus with her.</p>\n\n<p>“Mexico in the winter.” She whispered in my ear.\n“Yeah.” I said, “Good times.”\n“Take care James.” She said touching my face.\nI nodded, and she climbed onto the bus, and drove out of my life.</p>\n\n<p><strong>Small World</strong></p>\n\n<p>Being at a loose end, after an intense time with Gail, left me pissed off. I knew I’d do something stupid if I stayed, so I made a plan to slip back into America. The point I chose had been quiet last time I’d used it, and nothing on the news worried me particularly.</p>\n\n<p>I sold the Car, and planned a three day hike across scrub country, a quick swim, and I’d be in Texas.\nA day and a half in, and I was two miles from the U.S./Mexico border, I waited for night and set out.\nFive minutes later I heard gun fire. Machine gun fire.\nI got low and waited.</p>\n\n<p>More shooting, it was a genuine two sided fight, the competing firearms sounded different. I decided to take a closer look.\nMy inner monster, always hungry for carnage woke up and had me sneaking like a pro. I crested a small rise and decided I was out of my depth instantly.</p>\n\n<p>I saw dozen’s of muzzle flashes, a larger number of men had the high ground coming from the Mexican side. In a small gully below, Men were staying low, firing blindly back up the slope. I didn’t like their chances.</p>\n\n<p>I heard boots running towards me, I jumped down into a small hollow, and got knocked flat onto my ass.\nThere was a gun in my face, and the guy was hissing at me in Spanish.\nAnd then...</p>\n\n<p>“James? James? What the fuck are you doing here?”\n“Dale?”\n“He grabbed me by the collar, dragged me up and shoved be hard against a pile of dirt.\n“You can’t BE HERE JAMES!” he whispered angrily.\nDale was in camo, and looked to be equipped for mischief.\nHe shook his head in disbelief and talked rapidly.\n“Listen, get away from here, he pointed north. Don’t get caught, by anyone.”\n“Who are those guys I said calmly.” Pointing back towards the high ground.\nDale gave me a shut the hell up look.\n“You can’t be here James, it’s about to get real.”\nHe turned me north, and pushed me away, “Go,...GO!” </p>\n\n<p>I left him, stashed my backpack, and doubled back. He made his way up the rise very quickly, then he hunkered down, and did something with a radio and a map.</p>\n\n<p>More men we’re closing on his position, I went into the heat of the Hunt. Time slowed down, and my senses sharpened, I’d been too relaxed before. Dale should never have seen or heard me.</p>\n\n<p>From across the scrub, I could hear the Gun men whispering, the language was weird to me, not Spanish. They would find Dale in just a few minutes.</p>\n\n<p>I hunted them.</p>\n\n<p>Something twisted in me, warped me, I ran on all fours easily. The sky became a grey wash filled with razor sharp stars, and coal grey wisps of clouds. There were five of them, I could smell them now, I think they were whispering in Farsi.</p>\n\n<p>I sprinted, and slammed into a man within ten feet of Dale, the impact was brutal.</p>\n\n<p>He was momentarily stunned, but came to his senses just as I pushed my thumbs into his eye sockets, and broke his skull in half like an orange.</p>\n\n<p>His friends were on the scene in seconds and looked on in horror, someone screamed.</p>\n\n<p>My victims head disintegrated leaving a lower jaw attached to a gurgling throat, blood gushed out everywhere.\nI lost myself, I was coldly butchering this man, and I was utterly indifferent. I ripped his rib cage open and smashed my face into his heart, swallowing it immediately, while his lungs slapped wetly against my cheeks and his stomach fell out.</p>\n\n<p>I hefted the body over my head, it entrails slopping out, and threw it into the scrub. \nI roared.\nAn alien and ugly roar, It pulled me back from the brink for a moment. I wondered, ‘What the hell made that noise?’</p>\n\n<p>Then every gun there began shooting in my direction, Men were screaming “EL DIABLO!  EL DIABLO.”\nSome ran back the way they came, others scattered in random directions, a distant dull buzz intruded into my hearing.</p>\n\n<p>Then I heard car engines start, I made a bee line for them.</p>\n\n<p>I cleared the scrub to run straight out onto a dirt road. The gunmen were piling into SUV’s and pulling out as fast as they could, late arrivals ran after the trucks, and they were dragged on board by their friends.</p>\n\n<p>That buzzing again, it seemed closer.</p>\n\n<p>I ran after the last SUV, like a dog chasing a car, in a burst of feral energy I caught up with it and smashed through the rear window into the rear compartment.</p>\n\n<p>There were four men inside, time stopped, while two men in the rear tried to bring their guns up to aim at me.</p>\n\n<p>The barrels scraped across the interior roof, it was too late for that, and I smashed my left arm across the left head rest and snapped that man’s neck.<br/>\nHis head smashed through the passenger’s window, and the door buckled, nearly shearing the door lock.</p>\n\n<p>The guy on the right drilled some holes in the roof with panic fire, I ripped the gun out of his hands, and sucked out his heart.</p>\n\n<p>The front seat passenger, brought a hand gun to bear on me, I moved sideways too fast for him. He was shooting into thin air. I ripped the seat down into the fully reclined position, which surprised him, sucking his heart out surprised him even more.</p>\n\n<p>The Driver, who had the most time, had managed to bring a handgun up in his left hand.</p>\n\n<p>That buzzing was really annoying me now, what was that?</p>\n\n<p>I heard the missile a split second before it hit the truck, there was a blinding flash, and a sound so loud I lost my hearing instantly.</p>\n\n<p>The shock of the explosion drove me straight into the driver, as the SUV flew apart and cork screwed sideways off the road.</p>\n\n<p>I saw the engine rip free from the engine bay, a billion shards of glass, metal and plastic exploded around me. Body parts of the passengers collided with the fragmenting passenger compartment, blood boiled dry instantly in a hellish fire, and a smouldering pine fresh air freshener slowly tumbled passed me...\n... my forehead was driven into the drivers gun to meet a barely seen second flash.</p>\n\n<p>I was flung violently out of the mangled truck, smashing into the dirt, a split second before Karma dropped a ton of shredded and burning vehicle on top of me.</p>\n\n<p><strong>Mama Tambo</strong></p>\n\n<p>Nothing mattered, not the dark, not the absence of sensation, not even whether I was alive or dead. I must have lain there for a while, I have no way of knowing.\nWithout warning, the dark shadow of the SUV wreck was pushed aside, and a disfigured face looked down at me.\nThe deformed face was a patchwork of different skin colors and textures, seamlessly merged together by an expert surgeon. A baggy skin hung loosely on a giant frame, and whatever passed for muscles and a skeleton.\nThe eyes were set deep in uneven sockets, it had almost no nose but two flat nostrils, and a thin set of slack lips. A low, rumbling growl emerged from that mouth, with an almost amused tone.</p>\n\n<p>The Baggy scooped me up, and threw me over its shoulder, like a rag doll. I saw another burnt out wreck, as we rapidly disappeared into the scrublands, how long had I been there?</p>\n\n<p>The journey lasted for hours, or days, as we crossed some threshold of night into an even deeper night. A hard frost covered everything, only distant starlight lit our way, the land we traverse was utterly dead.</p>\n\n<p>Now and then, a branch would snap off a dead tree, and shatter into mineral chips. Fossilized and frozen.</p>\n\n<p>I froze too, the Baggy re-positioned me for its comfort from time to time, my posture set in ice.</p>\n\n<p>After what seemed like forever, we approached a heavily eroded mountain. Vast slides of shingle, and earth gathered by rivulets over millennia, gathered around it like a sloughed of skin. But it remained coherent enough, to imply an ancient shape, it had been a giant structure once.</p>\n\n<p>As we got closer, it was obvious man made, at least something intelligent had built it. It was so ancient it was nearly indistinguishable from a natural land form.\nThere, at its base between small hills of scree and dirt, was a ragged hole. The Baggy carried me inside, and as we went further underground, the craft of its builders was revealed.</p>\n\n<p>The entrance opened out to a wide corridor, enormous stone blocks, cut in elaborate interlocking zigzags decorated the hall. The stone work was sharp, and after a while the floor was spotless, someone or something kept the interior immaculate.</p>\n\n<p>We came to an elaborate stone arch, carved with bold, angular writing or symbols. There were no curves, not in the stone work or the carvings, nothing in that place suggested a Human hand.</p>\n\n<p>The Baggy took me down a long flight of shallow stairs, until we came to a pitch black room, even supernatural sight could not penetrate that dark.\nThe Baggy sat me down on the floor, in utter darkness, and we waited. After what must have been hours, I sensed my posture change, as I defrosted. </p>\n\n<p>There was an unexpected flare of orange light, and somewhere in the dark, someone lit a cigarillo.\nThe first pin point of smouldering orange light, was joined by a similar glint, in a pair of eyes. They observed me coldly.</p>\n\n<p>Somewhere, I conjured up the will to at least think, “Am I dead?”</p>\n\n<p>I heard the inrush of air into lungs, and the cigarillo flared, a cold light slowly rose in the room.\nIn carved stone alcoves, in a hexagonal room, were the mummified remains of giant humanoids.\nBut in the center, upon a stone plinth, sat an old Giantess. Her features seemed to be a merger of every major ethnicity on earth, but her skin was dark blue, like ink.</p>\n\n<p>“You’re mostly dead.”  Came her reply.\nI couldn’t move, or feel, but I could at least think. Some great change had occurred, at least while I was in this place.\n“You’ve been looking for me.” She said.\n“Mama Tambo?” I asked.</p>\n\n<p>She nodded once.</p>\n\n<p>My numb  fingers probed my forehead, there was a hole, it hurt.\n“I see you, James. And now, I will retell the same tired story, I’ve told ten thousand just like you, over eons.”\nHer voice was deep, and smooth, and held a lilt I couldn’t place.</p>\n\n<p>“Long ago my people made a civilization here on Earth. After a great age, we perfected our technology, a means of invoking our will to shape the materials of the Earth. But we weren’t satisfied with that, we pushed deeper into the means to manipulate the world, and conceived a notion to create a God that would serve us.”</p>\n\n<p>I’d been shot in the head, I leant forward awkwardly and slapped the back of my head.\nA metal clunk echoed in the room, as a flattened bullet drop out of my forehead.\nI looked up at Mama Tambo.\n“Sorry.” I said.</p>\n\n<p>Mama Tambo and the Baggy were both staring at me, coldly.</p>\n\n<p>She drew on the Cigarillo, and blew a giant plume of blue smoke into the chamber.\n “We built machines to focus our willpower. Our first efforts, our rough sketches...” She gestured to the Baggy, “...were loyal servants and protectors. Like Shri Bhagavan.” She bowed to the Baggy, which bowed in return.</p>\n\n<p>“We took the sketch, and produced the masterpiece. Your kind are attempting the same thing, with an electronic God, a pale sketch of our folly. At first we controlled it, it was all present and knew all we knew, it only lacked the raw power to effect the changes we desired on earth.”</p>\n\n<p>The Baggy grew restless, and seemed agitated. Feeling was returning to my body, and in a short while I was shivering violently, I was freezing. God it hurt.</p>\n\n<p>“But how to fuel this artificial God? We’d merely contained concentrated will, OUR will into a coherent form held together by technology.  No we needed to raise its powers, we made a terrible error.\nWe fed it, the living.”</p>\n\n<p>I was hurting, my limbs recovered some strength with dull aches intensifying. I managed to alter my posture, but it brought me little comfort.</p>\n\n<p>“There was a lot of life on Earth, then, that could feed our synthetic God. We built structures, to extract their energies. And its power grew. And with its rising might, it looked upon us not as creators, but jailers. It turned on us.”</p>\n\n<p>I stood, shakily, and looked around the chamber, the mummies all looked similar to Mama Tambo.  They were so old, dry canvas like skin stretched over giant bones.</p>\n\n<p>“In the end, despite valiant efforts by our military, and our loyal servants, we realized we were doomed. Our patchwork God was beyond our control, but for one weakness.”</p>\n\n<p>I coughed up blood, black soot and dust, I spat it onto the floor.</p>\n\n<p>“What?...what did you do.” I managed</p>\n\n<p>“We destroyed the cogs and wheels that allowed it to remain coherent. It was composed of Will, but without flesh or a soul, only its desire to survive holds it together now. It ended our culture, a few of us survived, and became your Gods of old.”\nShe shook her head.</p>\n\n<p>“But it wasn’t enough.”\nSomething was coming, something I didn’t want to hear.\n“We had dissipated it into the ether, but it found all it needed in the creatures you call your ancestors.”\nShe stood.\nShe was truly magnificent, and terrible, a genuine giant.\n“It whispers, into your species ears, until one of you listens. Until one of you give it a home. And then it grants you terrible power, in exchange for your obedience.”</p>\n\n<p>I traced the edge of the room, making for the door, the baggy just watched me impassively.</p>\n\n<p>“And you heard it, didn’t you James, it whispered, and you listened.” She stepped down off the plinth, and walked calmly towards me.</p>\n\n<p>She crouched down on her haunches, a foot from my face, and looked into my soul. I tried to turn my head, but my eyes wouldn’t leave hers.\n“What did it tell you? What did it say that you WANTED to hear.” She said quietly.\n“Can’t you take it out of me, make it stop?”\n“I can’t.” She said, some terrible energy moved within her, as if all the worlds’ history of horrors camped just behind her eyes.\n“In time, It will fade from this world, and its final threads will scatter and rise no more.”</p>\n\n<p>I shook my head.</p>\n\n<p>“It’s already begun, but it will try again and again until that time, to restore itself. It’s building itself a new body, from silicon and gold. Just like all the other times, it’s was briefly reborn, it always destroys its host. Yours is the seventh great Civilization to be devoured since ours”\nI looked at the Baggy, its stare drilled through me.</p>\n\n<p>“It’s using your technology, to restore what we denied it, it’s using YOU to feed it.”</p>\n\n<p>“NO!” I yelled.\n“NO. NO. NO.” There was a flare of anger in me, but the heat of the Hunt did not rise, could not, in this place.\nThe Baggy growled and reared up over me.</p>\n\n<p>“In time you will age and die, Shri will come for you, and sew your skin into his, and bind your tainted soul to Himself. We will starve our enemy. “\nI wanted to escape, run out the door, but the Baggy had moved to block my path.</p>\n\n<p>Mama Tambo stood and inspected the mummies in their alcoves.\n“The Eater of Souls.” She said solemnly,” Can only delay its own death, for a few more millennia. But it will cause more misery in that time, than in all the previous history of the World.”</p>\n\n<p>No escape.</p>\n\n<p>Die and the Baggy gets me. Live with that knowledge, and every day is a countdown to ruin.\n“If I stopped. If I stopped...” I said in desperation.\nMama Tambo shrugged, “If I stopped...” she said indifferently.\n“...If I did this, or I did that. If, if, if...”</p>\n\n<p>She drew on the cigarillo again.</p>\n\n<p>“It saw you James, and it laid its will on you, and you said yes. Billions of you over time have said No. Billions.” She sighed and returned to her seat.\n“He wants you to live. To serve him. Do as you please, but in the end you are mine, or HE eats your soul.” She flicked her hand in a dismissive gesture.</p>\n\n<p>“My message is delivered, Shri will return you to your world.” She turned her back to me, the Baggy looked my way.\nThe light in the chamber dimmed, becoming pitch black again, a flare of orange light revealed the silhouette of the Giantess one last time.\nI felt my strength leave me and I collapsed onto the floor.</p>\n\n<p>I awoke, with a fright, still in the chamber. A pale light shone through a hexagonal hole in the chamber roof.\nSitting upon a stone plinth, in the middle of the chamber was the Mummified remains of Mama Tambo, I stared in wonder and fear.\nA shuffling noise alerted me to a presence, and I turned my head just in time, to have my face smothered by Shri Bhagavan’s giant patchwork hand.</p>\n\n<p>It was dawn in the scrub lands. I had no idea how I got there, the Baggy was nowhere to be seen, I could have stood there forever. Why bother doing anything, I was doomed either way, there was no escape.</p>\n\n<p>So I sat down, in the dirt, in ripped and charred clothes with burns and ragged cuts slowly mending. It hurt, the burns were the worst, the smell was terrible. I should have been dead, something had preserved me in the blast, The Eater of Souls had other plans for me.</p>\n\n<p>There had to be a way out of this, some other power to appeal too?</p>\n\n<p>The sun rose, it was too bright, my eyes watered and my ears rang. Mama Tambo was not a friend after all, a ghost from a dead race, the Baggys were real though. The skin on my hands grew back as I watched, exposed bone was covered in muscle and then pink flesh. </p>\n\n<p>My only other option was to appeal to The Eater of Souls, &#39;Please don&#39;t eat my soul.&#39; \nYeah.\nLike that would work.</p>\n\n<p>My monster compass pointed to my stashed backpack, not very far away, after a slow and painful walk I recovered it.</p>\n\n<p>I took a risk and turned on my phone, there were messages, Dale had been worried sick.</p>\n\n<p>Seven days had passed, I&#39;d put him through the ringer, waiting to hear from me.</p>\n\n<p>I sent him a message.</p>\n\n<p>&#39;I&#39;m OK. Had to lay low for a while. Really sorry.&#39;</p>\n\n<p>I changed into fresh clothes and boots, and with no other options, I reluctantly walked north to Texas.</p>\n</div>\n","author":"Zenrebok"}