{"rank":"1361","title":"I met my doppelganger and she's better than me","id":"8mfcz6","url":"/r/nosleep/comments/8mfcz6/i_met_my_doppelganger_and_shes_better_than_me/","time":"1527392550000","body":"<div class=\"md\"><p>My sister Clarissa saw her first and I thought she was fucking with me.</p>\n\n<p>I was at home, binge-watching some show on Netflix when she walked through the front door and froze, staring at me. I glanced up at her, and then back to the screen, but when she still didn’t move, I looked up at her again.</p>\n\n<p>“What?” I asked.</p>\n\n<p>I looked at her face, which had this look on it, like if someone had set the worlds hardest math problem down in front of a six-year-old. </p>\n\n<p>“How did you get here so fast?” She asked, finally walking towards the couch.</p>\n\n<p>I paused the show.</p>\n\n<p>“What are you talking about?” I asked.</p>\n\n<p>“I just saw you walking down the street.” </p>\n\n<p>I narrowed my eyebrows in confusion and adjusted the pillow that I was laying on.</p>\n\n<p>“I have no idea what you’re talking about; I haven’t left the house today,” I replied.</p>\n\n<p>Clarissa stared at me, but then she just shook her head and left the room, and I went back to my show. </p>\n\n<p>She didn’t bring it up again, so I didn’t think about it again, and I just continued living my life. For about a month that is.</p>\n\n<p>Last week she showed up at my front door. My fucking front door. </p>\n\n<p>It was 8 am on a Saturday, and I was already pretty pissed off about the fact that someone was banging on the windows that early on the weekend. I knew Clarissa wasn’t going to wake up and answer the door, so I got up instead and pulled the door open in anger to reveal me. </p>\n\n<p>As in, I was standing outside. It wasn’t <em>me</em> me, but it was like staring into a mirror. Well, a mirror of what could be, actually. I was standing inside my house in the long black t-shirt that I slept in, which had random holes all over it. My hair was piled up on top of my head, and I hadn’t even washed my face yet. </p>\n\n<p>The person that I was looking at was a version of me that was a lot more put together. The way that I look when I go out, not at 8 in the fucking morning on the weekend. She-or me- or whatever, was wearing fitted plaid pants, a hole-free white t-shirt and heels. Her hair was the same length as mine, but it was brushed and curled, with two sections pinned away from her face. And she was wearing a wedding ring. </p>\n\n<p>“What the hell….” I finally whispered after a few minutes of shock.</p>\n\n<p>She smiled at me.</p>\n\n<p>“Hi, I’m...well, you know, I’m you. I&#39;m Galilea.”</p>\n\n<p>She held her hand out, but I didn&#39;t take it; I stared at her. </p>\n\n<p>She cleared her throat and glanced around.</p>\n\n<p>“Uhh, I don’t know if this is a good idea...meeting you and stuff. You know, they say it’s a bad omen or whatever, to see...well, you know. I just heard it was bad luck to see your doppelganger, I guess. But I just, I couldn’t ignore you. I mean, you’re me and...sorry I’m rambling. I just don’t know what to say.” She let out a very forced nervous laugh. </p>\n\n<p>I didn’t respond. </p>\n\n<p>“What do you want?” I asked.</p>\n\n<p>She took a deep breath and then scratched her nose. She was holding the car keys to a BMW in her hand. I rolled my eyes.</p>\n\n<p>“I just wanted to get to know you. I saw you, a few months ago while you were leaving a college campus. I was really shocked because you looked just like me, or I look just like you...I don’t know. Anyway, I found out who you were, which wasn’t hard. I ran into a few people who thought I was you. They kept calling me Cindy. I kept working up the courage to talk to you but I couldn’t. Until now.” </p>\n\n<p>I sighed. I was too tired for this shit, but I felt bad telling myself to leave. I decided to let her in, and she excitedly walked into the house. I didn’t worry about Clarissa waking up and seeing us; she never woke up before noon on the weekend.</p>\n\n<p>We sat, and we talked for about two hours. It only took about forty-five minutes to hate her though. </p>\n\n<p>She was everything I wasn’t. She came from an incredibly wealth family, grew up in New York City, studied abroad in London for two years until she met her husband, Harry. They got married, and she graduated early. They had a huge fancy house about an hour from my own, big fancy cars, big fancy everything. </p>\n\n<p>I hated her. </p>\n\n<p>I hated it more when I saw how nice and considerate she was. She even offered to pay for the rest of my studies, which I declined. I wasn’t going to let the more perfect, more accomplished version of me give me pity cash.</p>\n\n<p>Then she had her brilliant idea. I just want to get that out of the way, alright? It was her fucking idea. </p>\n\n<p>She wanted to have a baby, but she couldn’t get pregnant.</p>\n\n<p>At first, I thought she wanted me to donate my eggs to her or something, but no. She wanted me to fuck her husband, and then let them adopt the baby. She said she would pay me $500,000. </p>\n\n<p>I said yes.</p>\n\n<p>I know, I know. I know what you’re thinking. But listen, that was a hell of a lot of money, and her husband was hot. So, she quickly taught me how to fake being her, and five days after meeting her, I fucked her husband. </p>\n\n<p>That was two days ago. </p>\n\n<p>I knew I should never have agreed to it. I should have known better than to form a ridiculous plan with my more successful, more accomplished doppelganger. But I did it anyway, and now here we are.</p>\n\n<p>It was too good. The house, the clothes, the sex. It was all too good. I couldn’t help myself. </p>\n\n<p>After Harry fell asleep, I quietly got out of bed and made my way to the back door, where she would be waiting for me, as we planned. On my way down there, (which took a while; the house is giant) I realized how stupid her plan was.</p>\n\n<p>What the hell was this? She was just going to get someone who looked just like her pregnant, and then take the baby? How would that even work? How could she be sure that she would get my baby? It was stupid, and so was she.</p>\n\n<p>So, on my way to the back door, I stopped by the kitchen and grabbed a giant sharp knife. </p>\n\n<p>It was so easy to surprise her. I knew she would hug me, and when she did, I just stabbed her. She gasped, and I stabbed her again. The mess wasn’t that big. </p>\n\n<p>I was able to drag her body into the car, which I then drove into the woods, where I buried her with my identification, after stealing hers. I took the knife and washed it in a small stream and then went back home. </p>\n\n<p>Harry still hasn’t noticed. He loves me, and he tells me how happy he is that we’re having sex again. </p>\n\n<p>I’m not sorry. I have a better life. I’m rich, I’m loved by my hot husband, and we have great sex. They haven’t found the body yet, but I’m sure my sister has reported me missing by now. </p>\n\n<p>She was stupid, and that’s not my fault. Her plan was stupid, and her decisions got her killed. She should have just listened to the things she had heard; meeting your doppelganger is bad luck.</p>\n</div>\n","author":"EaPAtbp"}