{"rank":"15","title":"The Day She Felt My Pain","id":"8mfeff","url":"/r/nosleep/comments/8mfeff/the_day_she_felt_my_pain/","time":"1527393044000","body":"<div class=\"md\"><p>She was screaming helplessly as the man dragged her by the hair and slammed her to the ground. Hitting and kicking was the only thing keeping him away from her. She yelled and pleaded, yet no one came to her aid. Knowing this was soon to be the end, let me tell you how it started.</p>\n\n<p>I&#39;ve known Sara for quite some time now. Since the seventh grade we became friends, as well as keeping the friendship going into high school. I wasn&#39;t much of a social guy, yet Sara was opposite. She would hang out with her friends, leaving me feeling as though I was just another friend that she could talk to. Our friendship was very lop sided. I would want to hang out with her one day, but she would have plans or make up some bullshit excuses about having something to do that day or how she had curfews to attend to. There was one day in particular, though, that I remember that I, myself, would never forget. This is my confession story.</p>\n\n<p>It was the second week of junior year for me, (as it seems like high school years after 9th grade goes by like a breeze), and I was a little hesitant at first to ask Sara if she would like to go with me and some of her friends to watch a movie, knowing that a Friday would be the most appropriate time to go. Though I thought she would reject the offer it came to a surprise to me that she accepted. It was the end of the school day and I made it on the bus. When I arrived home, I had texted her at about what time she would be at the movie theater, that was I know in advance. She told me around 9 pm she would be there. I was changing into my clothes and getting ready to initiate my plan. Everything was going accordingly. This is where I would engage step two, which was bring a little friend with me.</p>\n\n<p>I drove to the theaters and it seemed like forever with the traffic and stoplights trying to avert me from making it there safe. I eventually found my way into the parking lot and we arrived there at about 8:50 pm. I was sitting there silently when Jessica asked, &quot;What movie are we watching?&quot;. I had know Jessica just this year, I thought she would be a great addition to my plan. &quot;I don&#39;t know yet,&quot; I replied.</p>\n\n<p>9:00 PM</p>\n\n<p>10 minutes go by and still no sign of Sara. &quot;Where&#39;s your friend at? I thought she&#39;d be here by now.&quot; I was getting anxious, yet excited at the same time. I guess a weird mix of both.</p>\n\n<p>9:30 PM</p>\n\n<p>Finally Sara had arrived, and with a group of friends that had looked like they had a little too much to drink. I stepped out of my car with Jessica and introduced her to Sara. &quot;Sara, this is my girlfriend Jessica.&quot;</p>\n\n<p>I didn&#39;t actually like Jessica, but she was dumb enough to agree to play along with my plan, not knowing my true intentions. Not worrying about Sara&#39;s late arrival, but more her response, she said, &quot;Nice to meet you Jessica, how did you two meet?&quot; I was furious. &quot;Actually-&quot; Jessica said before I interrupted her,&quot; We should probably go inside it&#39;s getting late anyways and we might not find any seats let alone a movie.&quot; We all agreed to watch Captain America, and we sat down at our seats. I was getting more and more infuriated, and mangled with thoughts full of rage at the fact that she was fine with the fact that I had a girlfriend. the friend that I knew for so long, that I&#39;ve liked for so long, is fine with the fact that I with someone else and not her. Maybe it wasn&#39;t meant to be, but I wasn&#39;t going out like a fool. I knew what had to be done, and after the movie, it would be done.</p>\n\n<p>11:00 PM</p>\n\n<p>After the movie was over, Jessica and I went to my car when she had to use the bathroom. Jessica went inside as I sat in the car, alone, anxious, confused, frustrated. With my thoughts scrambled and bent out of shape, I was thinking of what I&#39;d do next. Just as I was about to put the pieces to my plan together, Sara walks out from the movie theater, alone. My plan was to just tell her flat out about my feelings towards her, whether she&#39;d take it lightly or not, it wasn&#39;t my concern, getting this attached feeling of emotion was the only thing that would soon bring forth my sanity. Whether she&#39;d reject it or not, I would let fate decide what happens. Gripping the door handle to my car, right as I was about to open my heart to her a man came out of the shadows and grabbed her. Sara&#39;s face was a terrified, paralyzed, and shocked expression all at once, as I sat there and watched the events unfold.</p>\n\n<p>She was screaming helplessly as the man dragged her by the hair and slammed her to the ground. hitting and kicking was the only thing keeping him away from her. She yelled and pleaded, yet no one came to her aid. Knowing this was soon to be the end, I had one thing in mind at the time. Through all the pain I had suffered emotionally, and the pain I have endured all these years of liking you, and knowing you never liked me back, was a punch to the face. To pull at my heart and play with my emotions, not realizing the blood sweat and tears I would&#39;ve gone through with you makes me grit my teeth in anger. Seeing you on the ground, head warm with blood on the sidewalk, teeth dangling from their roots, face bruised, blood, sweat and tears down your warm bumpy face, makes me the happiest person alive.</p>\n</div>\n","author":"SorryTwist"}