{"rank":"8","title":"I know this kid","id":"8mff1x","url":"/r/nosleep/comments/8mff1x/i_know_this_kid/","time":"1527393256000","body":"<div class=\"md\"><p>If there were one word to describe him, I doubt it would be kind, from anyone who actually knows him. I won&#39;t use his real name, for privacy, and for my own safety. I&#39;ll just call him Miller.</p>\n\n<p>Personally, I could not dream of using simply one word to describe him, because in all honesty, he is not a simple boy.</p>\n\n<p>You see, when you first meet Miller, he seems like the nicest guy in the world. A little odd, but charming. Funny. Like-able. Right?</p>\n\n<p>Wrong.</p>\n\n<p>I&#39;ve seen him at school numerous times, and I used to sit next to him in algebra. He&#39;s smart, a little on the lazy side though. He works alone in group projects,  but not because he&#39;s shy. Shy isn&#39;t really the right word for this kid.</p>\n\n<p>We&#39;ve had a few conversations. He&#39;s clever, quirky. Charismatic. At least, it seemed like it at the time. Now i&#39;m not sure if all that charisma is a lie.</p>\n\n<p>You see, Miller lives two houses down from me. In between us lives an old man, with his pet husky. We&#39;ll call the old man Mr.Roberts, for his protection. The husky&#39;s name was Sheep.</p>\n\n<p>Well, a few weeks back, Mr.Roberts came over to my house. He seemed worried, glasses perched on the edge of his nose and stark white hair ruffled and untamed. He asked me if i’d seen Sheep, and of course I hadn’t. I’ll admit, right then I was a bit relieved. Sheep was a loud dog, and often barked at late hours. It was sort of annoying.</p>\n\n<p>Apparently, it annoyed Miller, too.</p>\n\n<p>I offered to help look for Sheep. I didn’t have to go far to find him.</p>\n\n<p>I had gone down the street in the direction of Miller’s house, on pure coincidence. Mr.Roberts went the other way, since splitting up was more efficient. The black gate to Miller’s yard was open, and there were tufts of white and gray fluff in the grass in front of it.</p>\n\n<p>Immediately I assumed Sheep had run into Miller’s backyard, shedding the whole way, none the wiser that he was heading into the wrong yard. He was an older dog, I would understand him getting confused. I expected to find him running around, panting and barking for his owner. Instead, when I stepped in front of the gate, I saw Miller.</p>\n\n<p>He wore a dark coat, and in his hand was a knife. It wasn’t a typical kitchen knife, it was small, a pocket knife. And it was dark red, even the blade. Miller was on his knees in the grass, surrounded by tufts of white and gray fur. A hatchet laid by his side.</p>\n\n<p>And in front of Miller, laid Sheep. Sheep was on his back, his legs snapped and stabbed through to the ground with tent spikes. He was cut open, chest to stomach. I don’t want to describe the gore spilling out. Sheep’s head was missing, crudely cut off and nowhere in sight.</p>\n\n<p>Miller simply shifted his eyes to me, and slowly lifted one gorey hand, making a <em>shush</em> gesture.</p>\n\n<p>I walked away.</p>\n\n<p>I never told Mr.Roberts that I found his dog.</p>\n</div>\n","author":"deadringer01"}