{"rank":"17","title":"Hell Adjacent Hotel: Part 14: Series Finale","id":"8mfi0o","url":"/r/nosleep/comments/8mfi0o/hell_adjacent_hotel_part_14_series_finale/","time":"1527394246000","body":"<div class=\"md\"><p>[Part 1] <a href=\"https://www.reddit.com/r/nosleep/comments/82uwtg/hell_adjacent_hotel/?utm_source=reddit-android\">https://www.reddit.com/r/nosleep/comments/82uwtg/hell_adjacent_hotel/?utm_source=reddit-android</a></p>\n\n<p>[Part 2] <a href=\"https://www.reddit.com/r/nosleep/comments/838avz/hell_adjacent_hotel_part_2/?utm_source=reddit-android\">https://www.reddit.com/r/nosleep/comments/838avz/hell_adjacent_hotel_part_2/?utm_source=reddit-android</a></p>\n\n<p>[Part 3] <a href=\"https://www.reddit.com/r/nosleep/comments/840hiq/hell_adjacent_hotel_part_3/?utm_source=reddit-android\">https://www.reddit.com/r/nosleep/comments/840hiq/hell_adjacent_hotel_part_3/?utm_source=reddit-android</a></p>\n\n<p>[Part 4] <a href=\"https://www.reddit.com/r/nosleep/comments/84a6sn/hell_adjacent_hotel_part_4/?utm_source=reddit-android\">https://www.reddit.com/r/nosleep/comments/84a6sn/hell_adjacent_hotel_part_4/?utm_source=reddit-android</a></p>\n\n<p>[Part 5] <a href=\"https://www.reddit.com/r/nosleep/comments/84zchr/hell_adjacent_hotel_5/?utm_source=reddit-android\">https://www.reddit.com/r/nosleep/comments/84zchr/hell_adjacent_hotel_5/?utm_source=reddit-android</a> </p>\n\n<p>[Part 6] <a href=\"https://www.reddit.com/r/nosleep/comments/85prvy/hell_adjacent_hotel_part_6/?utm_source=reddit-android\">https://www.reddit.com/r/nosleep/comments/85prvy/hell_adjacent_hotel_part_6/?utm_source=reddit-android</a> </p>\n\n<p>[Part 7] <a href=\"https://www.reddit.com/r/nosleep/comments/868tnu/hell_adjacent_hotel_part_7/?utm_source=reddit-android\">https://www.reddit.com/r/nosleep/comments/868tnu/hell_adjacent_hotel_part_7/?utm_source=reddit-android</a> </p>\n\n<p>[Part 8] <a href=\"https://www.reddit.com/r/nosleep/comments/86yypu/hell_adjacent_hotel_part_8/?utm_source=reddit-android\">https://www.reddit.com/r/nosleep/comments/86yypu/hell_adjacent_hotel_part_8/?utm_source=reddit-android</a> </p>\n\n<p>[Part 9] <a href=\"https://www.reddit.com/r/nosleep/comments/89851b/hell_adjacent_hotel_part_9/?utm_source=reddit-android\">https://www.reddit.com/r/nosleep/comments/89851b/hell_adjacent_hotel_part_9/?utm_source=reddit-android</a> </p>\n\n<p>[Part 10] <a href=\"https://www.reddit.com/r/nosleep/comments/8b1p99/hell_adjacent_hotel_part_10/?utm_source=reddit-android\">https://www.reddit.com/r/nosleep/comments/8b1p99/hell_adjacent_hotel_part_10/?utm_source=reddit-android</a> </p>\n\n<p>[Part 11] <a href=\"https://www.reddit.com/r/nosleep/comments/8c9qc2/hell_adjacent_hotel_part_11/?utm_source=reddit-android\">https://www.reddit.com/r/nosleep/comments/8c9qc2/hell_adjacent_hotel_part_11/?utm_source=reddit-android</a> </p>\n\n<p>[Part 12] <a href=\"https://www.reddit.com/r/nosleep/comments/8fd6jp/hell_adjacent_hotel_part_12/?utm_source=reddit-android\">https://www.reddit.com/r/nosleep/comments/8fd6jp/hell_adjacent_hotel_part_12/?utm_source=reddit-android</a> </p>\n\n<p>[Part 13] <a href=\"https://www.reddit.com/r/nosleep/comments/8lu2cv/hell_adjacent_hotel_part_13/?utm_source=reddit-android\">https://www.reddit.com/r/nosleep/comments/8lu2cv/hell_adjacent_hotel_part_13/?utm_source=reddit-android</a> </p>\n\n<p>I couldn&#39;t help but feel like Vincent&#39;s death was my fault. Maybe if I had done a better job building him up. Maybe if I hadn&#39;t accepted the feather he wouldn&#39;t have submitted to his monster. We could have worked it out better if I haven&#39;t lost my head. I wanted to tell N that I was sorry but I couldn&#39;t speak. Tears streamed down my face as she sobbed so hard it broke my heart. Mrs. Nowak prayed. John said something in a language that I didn&#39;t understand as he closed Vincent’s eyes. It sounded like praying.</p>\n\n<p>We finally stood and N wiped her face with both sleeves. She was way too young, too new, to be grieving this hard. Guilt shot through me sharply. She didn&#39;t want to be touched so I shoved my hands into my pockets. In the right pocket was something strange but familiar. The bundle of thread that the fate - Sandra - had given me in my dream. It was a dull grey and I untangled the two halves before holding them in my open palms. A shimmer ran through each piece. </p>\n\n<p>“N… watch this.” She silently but attentively watched my hands. Her eyes were so puffy and red that I couldn&#39;t look at her. It hurt too much just then. </p>\n\n<p>The strands flared with that odd color strewn with metallic fibers and I heard her gasp. John and the Nowaks and Megan had gathered around. The pieces writhed to some unheard rhythm and began to segment themselves into smaller pieces. Over and over the thread divided until they seemed like tiny, sparkling grains of sand before disappearing like dust on the wind. Sandra wa reminding me that his life wasn&#39;t for naught. It wasn&#39;t over completely. That it wasn&#39;t my fault. I hoped I could accept it all with time. </p>\n\n<p>“What was that?” John’s voice was quiet and reverent. </p>\n\n<p>“That was Vincent&#39;s thread of life from the fates. Every piece it split into was… was a seed sort of. Things he set into motion. Other lives he touched or… allowed to be.”</p>\n\n<p>“I was beautiful.” N rubbed her eyes again. </p>\n\n<p>“I think so, too.” I took her hand and squeezed it. </p>\n\n<p>John waited a few moments before explaining that the MVD in Vincent&#39;s head had a tracking device and that we should leave. He cut the dangling rope from my wrists and ankles. The others were already gathering what they wanted to save from the debris of our belongings on the ground. We joined them and got ready to head to Char’s Cafe in town. The place that Ben had taken me to what felt like a few lifetimes ago. It almost felt like everything before my near death was the stuff that wasn&#39;t real. Almost. The memories tugged at my heart too hard to really think about my life before all of this. </p>\n\n<p>I hadn&#39;t noticed when we had first arrived,  but around the field we had appeared in were lines in the grass from the old hotel. I stood in what had been the kitchen and looked down at my little coffee machine. Bare soil etched out the Victorian and beyond. It <em>had</em> been here, it seemed, it just hadn&#39;t come back with us. The Nowaks and N piled into my car. The old couple insisted they weren&#39;t upset about their home. It had become too much for them anyway and besides, it had turned into something that they were a bit pleased to get away from. </p>\n\n<p>In the little restaurant we were quite a sight. People had been up to Bruce Crossing looking for us and apparently it had been a circus compared to usual life for the locals. Our cell phones still didn&#39;t have a signal at the cafe but there was an ancient payphone that worked. We ordered food, bought up pretty much all the quarters they had, and took turns using the phone while dodging questions. N was mostly quiet. She insisted she wasn&#39;t hungry and only ordered hot cocoa. She sipped it and looked out the window. </p>\n\n<p>The days we were gone certainly didn&#39;t match up with the time we spent in the space between dimensions. Months! We were gone months in real time. There were lots of tears and some shouting as we called our loved ones to let them know we were okay and that we were coming home. Each of us promised to explain later. I could hear Megan&#39;s kids screaming and crying through the receiver. I lost count of how many times she said “I love you&quot;. It was emotional for all of us. I even saw Marcus’ shoulders shaking as he spoke to whomever was on the other end of the line. </p>\n\n<p>The call to my parents was easier than I expected. I promised to answer their questions later, confirmed that I was safe and healthy no less than a hundred times, and made them promise to pass the word to my brother. I promised that I would drive straight home as fast as I could. I got a little choked up but I managed to hold myself together. Until I called Charles…</p>\n\n<p>“I promised you that I&#39;d find a pay phone someday and call y-&quot; is all I managed before he recognized my voice and I broke down at the sound of his. I couldn&#39;t talk for so long as I cried and he comforted me, that I had to feed in more change before I could tell him anything. I told him I was on my way home and would tell him everything as soon as I could. I lost count of how many times we told each other that we loved each other. The Charles in the other world didn&#39;t know me but this one certainly had missed me as much as I missed him. </p>\n\n<p>Before we left, we exchanged contact information. We knew that we would be seeing more of each other and we needed to figure out some details on how to explain everything. John took possession of Ben’s belongings. He said he wasn&#39;t done with the program that had created our situation. I asked him to keep me in the loop when he decided what he was going to do with the information. I had a feeling that the cops weren&#39;t going to be invited to his investigation. </p>\n\n<p>We all exchanged hugs, more tears were shed, and we gave each other words of encouragement before dumping all the loose cash we had on the cafe tables for a ridiculous and deserved tip and piled into our cars. I had my crew all settled in for the long drive. Things got quiet quickly once we got on the road. The Nowaks fell asleep together in the back seat before too long. N was next slumped against the passenger window. I took a slug of my to-go coffee. They didn&#39;t have paper cups but I was permitted to leave with a ceramic mug. I was glad to have the souvenir in a strange, silly way. My hand went to the bullet hanging from my neck. </p>\n\n<p>I had a lot of time to think and the road wore on and my passengers snoozed. Barb snores, by the way. I had often thought, pretty much through my whole life, that if I blinked out of existence it really wouldn&#39;t matter much. Hardly a blip on the radar. That couldn&#39;t be farther from the truth. My family, my online friends reaching out mom had told me, people searching, my best friend… I mattered. All of us did. N didn&#39;t have anyone to call, she was new to the world, but she mattered, too. To me. She was certainly one of Vincent&#39;s legacies. I glanced at her curled up and breathing steadily. I had so much to help her through. Show her. We were going to get that apartment. Adopt a cat. Or a dog. Or a cat and a dog depending upon the lease agreement. I ached for what she lost but was excited for the life ahead of her at the same time. I was looking forward to see who she&#39;d become outside my head.</p>\n\n<p>No matter what happened, we would all help each other through this. We had gotten home from a different plane of existence. We could do anything after that. Monsters and gods and spirits… even our own hangups. My head swam with it all and I was overcome with not only relief but pride. I was proud of my people and I was proud of myself. The latter was kind of a surprise. A new feeling. I thought for a moment about Ben’s experiments. His people were still working out there somewhere. Mutilating other kids and trying to break into a universe that would give them control. I pushed it from my mind, though. John would let me know how we were proceeding with that. There was nothing I could do yet. That was a battle for another day. I focused on the road. </p>\n\n<p>After what was undoubtedly  the longest journey of my life, we crossed into Lake City and tension I hadn&#39;t realized I was carrying drained out of my body.</p>\n\n<p>I was home. Really, truly home. </p>\n\n<p><em>^</em><sup><em>^</em><sup><em>^</em><sup><em>^</em><sup><em>^</em><sup><em>^</em><sup><em>^</em><sup><em>^</em><sup><em>^</em><sup><em>^</em></sup></sup></sup></sup></sup></sup></sup></sup></sup></p>\n\n<p>Hey, everyone! We&#39;re back! We&#39;re really back. Thank you for everything. Following along, encouraging, helping with ideas, keeping track of our nightmare and our progress. </p>\n\n<p>N is still pretty inconsolable about Vincent but there&#39;s so much new stuff for her to experience that it&#39;s easy to keep her busy. She&#39;s going to be okay. </p>\n\n<p>The Nowaks (Barb says hi) are having a bit of a vacation hanging out with my parents. I&#39;m in touch with advocates in relation to my disability. Since they&#39;re suddenly homeless and old I&#39;m hoping we can get them set up in a new phase of their lives before too long. </p>\n\n<p>Megan&#39;s kids are fucking adorable! Gah! We talk and text every day and she&#39;s made me out to be her hero so I have two little fans in her kids. The others have been in near constant contact. Things are starting to get a little tricky explaining to authorities what happened to us for months but they&#39;re not pressing too hard... yet. We know we&#39;re not going to remain that lucky.</p>\n\n<p>John is quiet about Ben&#39;s program so far. I hope he&#39;s not doing anything stupid. I&#39;ll get on his case soon but we all really just need room to breathe for a little while. I think I slept a solid 24 hours in my own bed. </p>\n\n<p>Marcus and Jerome found out they don&#39;t live far from each other at all and have a standing night for cards.</p>\n\n<p>All of us have nightmares.</p>\n\n<p>We&#39;re sicking with our story of not knowing what happened to Sarah, Ben, or Grace. We were contacted by Grace&#39;s family. That crushes me. Sarah seems to not have family like I was told and nobody connected to Ben has reached out to us or the authorities that I know of. Thinking about them coming around eventually makes me sick. </p>\n\n<p>So, ultimately, things are going as well as they could be all considered. I appreciate everyone who&#39;s commented, messaged, and read our story so much! I cannot express how much it means to me and how much it helped me keep going. Thank you, thank you, thank you. Much love to each and every one of you! I wouldn&#39;t have been able to push through without you guys.</p>\n</div>\n","author":"Gloeee"}