{"rank":"8","title":"My Dream Felt So Real","id":"8mfi8f","url":"/r/nosleep/comments/8mfi8f/my_dream_felt_so_real/","time":"1527394318000","body":"<div class=\"md\"><p>You know when you have a dream and you know it’s a dream but it just feels so real?</p>\n\n<p>When I was 8, I had a really weird dream about me at the beach.</p>\n\n<p>It started off normally. It was another sweltering hot day in Australia’s summer season, the perfect day to go to the beach. So my family and I went to the beach, dressed in our swimsuits and lathered in sunscreen.</p>\n\n<p>First we built sandcastles, creating moats for the water. Then that got kind of boring so we went into the water. My siblings were 6, which meant my dad needed to pay closer attention to them then he needed to me. My mum didn’t like to swim so she sat watching on the sand.</p>\n\n<p>I had a small plastic bucket with me, for me to collect rocks from the water in. As my dad kept watch on my siblings who were playing in the shallow parts of the water, I decided to step out deeper, only because there were cooler rocks as you moved out more into the ocean. This was common knowledge!</p>\n\n<p>Nothing was really happening, except my bucket was getting heavier and was almost filled to the top. It was then that I decided I was going to head back to the shore and show my mum the collection of rocks i had. That was until something shiny caught my eye.</p>\n\n<p>It was further out into the sea and I wasn’t tall enough to comfortably stand in that level of water, but the rock had looked so pretty so I stepped further out, the handle of my bucket clutched tightly in my hand. Looking at the rock was like looking at diamonds, it shone so brightly, placing itself away from the other plain rocks.</p>\n\n<p>At first I tried to reach for it, but because I was standing on my tip toes just to stay above the water line, It was impossible for me to grab it. I tried to crouch down, leaving my face looking up at the sky, and it almost worked because i felt my fingertips brush against the rock. I just wasn’t close enough.</p>\n\n<p>So finally, I dunked my head underwater. Thank god I was wearing goggles. When I grabbed the rock, it felt like I had accomplished everything in my eight years of life. With the rock in hand, I stood up. I called out for my mum, holding the rock in the air to show her. When I went to move towards the shore, my feet were being held down. I looked down to see seaweed tangled around my ankles.</p>\n\n<p>I cried out, trying to yank my ankles away, but all it did was cause me to slip and fall into the water. I continued to struggle, using my hands to pry away the seaweed, but it didn’t do anything and water started to fill my lungs. I couldn’t move or cry for help. Through all this time, the rock stayed in my hand.</p>\n\n<p>Then I woke up, breathing heavily and body shaking. My parents had rushed into my room, being awoken by my loud cries. It felt like a nightmare; and that’s what my parents reassured me. I was shaking; it felt cold in the room, my ankles were weirdly sticky, and it smelt like sea water.</p>\n\n<p>That’s when my parents noticed something.</p>\n\n<p>“Sweetie, where did you get that <a href=\"https://twitter.com/gothfreys\" rel=\"nofollow\">rock?</a>”</p>\n</div>\n","author":"divinecola"}