{"rank":"10","title":"I'm sorry Mini Ladd","id":"8mfjch","url":"/r/nosleep/comments/8mfjch/im_sorry_mini_ladd/","time":"1527394675000","body":"<div class=\"md\"><p>I was staying up late at night watching some YouTube videos, I came across Mini Ladd’s videos and got to his <a href=\"/r/nosleep\" rel=\"nofollow\">r/nosleep</a> series. I was inspired and though to myself that I want to write a scary story and see if it would be any good for Mini Ladd to read on his channel. </p>\n\n<p>After a nights rest I go to my notes on my phone to type a story, but then I stop not knowing what to type about. Then I remembered how dark my room was last night and though of a story about a guy who stares at you while you sleep. I type every so often throughout the day and eventually it got dark and I went to bed after some video game binging. </p>\n\n<p>Something felt off when I was about to go to sleep, I opened my eyes and I swear I though I saw a silhouette of a person before me. I freaked out and grabbed my phone and shined it in my room and there was nobody, nothing in the light or anything. I though to myself that I was just getting paranoid and jumpy then went back to sleep. </p>\n\n<p>I wake up the next morning remembering how scary that was and typed more to my story. I though about objects that the person could wake up to and see on his bed that would be impossible to have before the character so I said in the story, “...he would wake up and see his knife on the bed facing towards him with no body in the room.” Sure enough I had a busy day then went to bed soon after.\nI wake up in the middle of the night from the sound of my phone going off from my friends in a group chat texting. I texted for a bit then put my phone back down to sleep. Just as I look away from my phone I saw something that almost scared the ever living crap out of me, my dull butterfly knife, unflipped and facing towards me on my bed. I was ready to jump up and run out of my room but I just sat there in fear on my bed afraid to move. I shined the flashlight on my phone and looked around, “this has to be a joke, I keep my training knives hidden.” Eventually I just turn the lights on in my room and stay up for a while before I got sleepy. </p>\n\n<p>A few days pass and I didn’t type in my notes for the scary story in a while because I was starting to get paranoid. Though nothing happens in the nights from then on, I kept thinking to myself if I was just being crazy at times. Soon enough I watch more YouTube and see Mini Ladd’s second video in the <a href=\"/r/nosleep\" rel=\"nofollow\">r/nosleep</a> series and once again I have inspiration to write again.\nI decided to delete my story about the spooky person and start a new story about a person who goes around banging on people’s doors, asking for help, then breaking in as soon as the home owners open the door. I was watching a bit of Criminal Minds that night so you can see where that idea was inspired from. I start typing away for a while in my room being oblivious to the time and some of the outside world, like the fact that I’m now alone in the house, and it became night time just like in my story. I hear a loud bang that startled me and a person outside yelling, “Is anybody home?! There’s a serial killer outside chasing me, can you please let me inside, please!?” I freaked out a bit but remained quiet, eventually I hear the person walk way from my house. Walking away I though? I peaked though a window and see a black van parked in my drive way and the man talking to the driver before he gets in and leaves. I grabbed my phone and called my father who was at the gas station and told him what happened and he told me to stay on the line as he was driving home. I didn’t tell him about my scary story because it felt dumb to tell a person about the fact or idea that writing a fake story could cause this, even I couldn’t believe it.</p>\n\n<p>After a few days I decided to, “grow a pair,” and confront my scary story in my notes and delete it and write a new one, this time making the impossible happen so I can prove myself that everything that I typed was just a coincidence. Subconsciously writing a horror to go with the theme, I write about a young scientist who experiments with a clear cup that has a battery and a note of warning from a stranger. Stupid, I know, I just had to convince myself that it wasn’t real. I get called to go shopping with my family and I leave my thoughts unfinished and go shopping with them. We get back a bit late as my family had to go out for an event while I put the stuff away. I finished and went upstairs to my room and what I saw broke me to tears, a plastic cup with a battery and a note inside of it. I go to the cup and grab the note and read it, “don’t do what you’re about to do, this will end horrible for you.” What I didn’t write in the notes for the story that tore up me even more is that the note would be from himself in the future, and sure enough, it looked perfectly in my sloppy handwriting. </p>\n\n<p>So I’m sorry Mini Ladd for not making a scary story for you to read because I’m too afraid to write even a simple scary story for you, I’m just too afraid to do any story at all.</p>\n</div>\n","author":"rynodragon2325"}