{"rank":"0","title":"Always Take an Amber Alert Seriously Part 1","id":"8mfn4b","url":"/r/nosleep/comments/8mfn4b/always_take_an_amber_alert_seriously_part_1/","time":"1527395969000","body":"<div class=\"md\"><p>I&#39;ve gotten an Amber Alert on my phone for a flash flood it said hide in a room and cover the cracks on the doors. I&#39;m guessing that&#39;s  because the water might flow in but I live in an apartment high up, plus I live in northern Louisiana heavy rain is common here and were use to it. I&#39;m gonna go get some energy drinks because I have a paper due tomorrow and I&#39;ve got a plan to finish the whole thing tonight. I&#39;m about to twist the door knob but the alert flashes again, but this time it says &quot;Go into a room with no windows, turn off the lights, and cover up the cracks on the door.&quot; I assume the window part is because they expect a lot of lightning and they don&#39;t want tree limbs to break windows and hurt people. I&#39;m pretty sure they said turn off the lights because they are expecting a power outage and they don&#39;t want peoples lights to burn out. So I open the door and prepare for the worst, as soon as I open the door a blast of wind and rain hits my face. I walk down the stairs and start walking towards the 711.</p>\n\n<p>Its raining harder than usual but nothing i&#39;m not use to since I&#39;ve lived here all my life. I have my hoodie on and I can feel the rain landing on my head, again harder than usual. As i&#39;m walking to the 711 I notice something off, no one is outside, its completely baron literally no one is out here. I think they took it seriously because of how bizarre the alert was but I need these energy drinks. To pass this course I need to make a good grade on this paper. That&#39;s the only reason i&#39;m out here in the rain and thunder walking to a 711 for energy drinks. I&#39;m at the 711 now I&#39;ve gotten my energy drinks, but the cashier was strangely quiet he just took my drinks, rung me up and urged me to &quot;Go home&quot; those were the only words that he said throughout the whole transaction.</p>\n\n<p>As the doors open the rain was more violent the thunder as well. The rain was to the point where it was almost opaque  it was coming down so fast. I look behind me to ask the cashier if he was worried about the storm, but when I turned around he wasn&#39;t there. I knew something was off, I started running home.  When I got to my door it was locked, I pulled out my keys and unlocked it but that was weird because, I don&#39;t remember locking it. I walk in but I feel a hand on my shoulder as frozen in fear I hear somebody whisper is my ear &quot;Didn&#39;t you hear them say to go into a room where you could hide from me.&quot; I feel a needle jab into my neck i fall asleep. I wake up completely numb, I see a man walk up to me, or at least i think its a man. They walk up to me in a black hoodie and a plague doctor mask they pull out a needle and say &quot;Shh sleep now your going to be here for a while.&quot;There voice is muffled due to the mask so i can&#39;t tell what gender they are. I see the needle go into my neck and I fall asleep.</p>\n</div>\n","author":"Stacul2"}