{"rank":"55","title":"On the bayou road","id":"8mfn6l","url":"/r/nosleep/comments/8mfn6l/on_the_bayou_road/","time":"1527395993000","body":"<div class=\"md\"><p>Growing up on the bayou, you come to accept certain truths. There are creatures in the swamp that you don’t want to meet. You never walk through the forest alone at night and you don’t swim in water with gators and snakes unless you have a death wish. The place is alive with all manner of natural wildlife, both documented in science books and others wholly unknown to mankind. Once you come to terms with those rules, life can be calm and beautiful. That’s not to say that a person can’t find themselves mired in unexpected situations. (Because they absolutely can). One night not long ago I found myself unintentionally breaking just about every local rule of the swamp. </p>\n\n<p>My car ran out of gas at 3 in the morning in the middle of the long bayou road. I was coming home from a party and should have found a hotel room nearby but I hate to pay for a room when my home is only forty five miles away. Not surprisingly, there was no cell signal to call for roadside assistance. Telecommunications providers do not put cell towers in the middle of nowhere. It’s a waste of money to offer phone service to the crawling swamp dwellers and they assume no woman would be unwise enough to drive through such a desolate place at night. I cursed my foolish decision to ignore the low fuel light; and accepted that I had a very long, creepy walk ahead of me. </p>\n\n<p>The nearest residence of any sort was at least a dozen miles away. I grabbed a flashlight from the glove compartment and changed out of my dress clothes. As a lady who comes prepared for most situations, I had a pair of comfortable walking shoes and a jogging suit in the back seat. With any luck, another damn fool would pass by the abandoned road and offer me a ride. Just to be extra careful, I grabbed a hunting knife I keep under the seat for protection. Some of the most dangerous creatures on the bayou are opportunists of the human variety. I didn’t want to run into one of them either. </p>\n\n<p>Once outside my stranded car, the nighttime sounds of the ‘southern jungle’ came alive. The birds and cicadas were competing to see which of them could make the most racket. It might have been soothing under different circumstances but I\njust wanted to get home. Cautiously I made my way beside the foggy road until my blinking hazard lights slowly faded from view. Various amphibians and reptiles crept and crawled in the nearby grass. There were no street lights or the familiar glow of industrial twilight to aid in my journey. The night animals of the swamp seemed to be curious over why I was walking among them. I hoped my flashlight was enough to discourage them from getting too close. I heard twigs snap on the ground in the woods but I tried to not let my imagination run away from me. Then the jarring plop of a frog into the murky bog or a hoot owl would startle me. I reminded myself that I was invading their territory. Hopefully they would let me pass, unmolested.</p>\n\n<p>The bullfrogs were chanting their eternal mating call when I heard the distinct sound of a large creature following behind me. It definitely wasn’t my imagination. Since there are brown bears in the area, I held the knife tightly in my fist. You can’t outrun or out-swim something like that so I prepared myself to fight back if necessary. It’s hard to make yourself intimidating to a seven foot tall, hungry carnivore or wolf when you are five foot two and weigh a hundred and twenty pounds. My flashlight served as an unintentional beacon to drawn attention to myself but I had to leave it on. I would’ve gladly walked in the dark but the frequent number of cottonmouths and copperheads slithering across the road tend to blend in with the pavement. </p>\n\n<p>I quickened my pace a bit without wanting to telegraph my internal fear. I don’t think I was successful though. Whatever it was, the unknown predator was definitely stalking me. I didn’t dare turn around to shine my flashlight at it. Part of me didn’t even want to know what it was. We were both pretending I was alone while I tried to remain calm. It was a game I was losing. The knife felt inadequate and my batteries were noticeably dimmer than when I’d started. I tried to focus on the sounds of my shoes on the asphalt but all I heard was the unwelcome shuffling behind me. </p>\n\n<p>I didn’t have any means of gauging my forward progress but I couldn’t have walked more than a few miles. It’s not like I was within shouting distance of civilization either. All that mattered at the moment was that a large creature was following me for unknown reasons. Matching each step and staying a discreet distance behind me, there was a certain intelligence behind it’s sly actions. It was the darkest point of the night where the moon cast almost no reflection. I was being followed by a very cunning adversary. </p>\n\n<p>At times I dared to stop abruptly in my tracks; just to see what it would do. I wondered if the unknown predator would maintain the same distance between us or immediately pounce since the secret was over. I knew I couldn’t outrun the thing. I wanted to turn the psychological tables. On those occasions I briefly caught my lurking ‘shadow’ off-guard. It stopped following as soon as it realized I had stopped moving but the short delay in reaction gave me a quick sound reference. It didn’t have the recognizable four-legged cadence of a bear or coyote; and the footfalls were too heavy for an ordinary wildcat. My aggressive bluster was probably Ill advised with the serious disadvantages I had but I wanted to get inside this thing’s head. To let it know that I was aware of its sinister presence close behind me. </p>\n\n<p>Barn owls screeched in the trees; as if to warn me of the danger I already knew about. I started getting angry at the prolonged waves of adrenalin surging through my frightened veins. I almost turned around to confront the unknown beast but it’s footfalls grew more insistent. I lost my nerve and quickened my pace. The heavy footsteps were right behind me now, no more than ten steps back. </p>\n\n<p>Slithering snakes and alligators be damned, I was about to turn off the flashlight and take off in an all-out sprint when I saw a welcomed sight. Pale headlights cut through the dense fog and shined on the road beside me. I let out a blood curdling scream and ran toward the car. I waved my arms erratically but it wasn’t necessary. They saw me right away and thankfully stopped. </p>\n\n<p>“Jesus lady! Get in. Quick! Didn’t you see that huge thing right behind you?”</p>\n\n<p>I started to tell the man that it had been stalking me for a couple miles when my ‘bayou savor’ continued. “That thing definitely wasn’t human! It was way too large and primal looking. It was naked and had hair or fur all over it. My lord! It must be a bigf...”</p>\n\n<p>The lady driver cut him off. “No! No! Don’t even say it, Jed. I saw the same thing you did but no one would ever believe it. Just keep that little conspiracy theory to yourself. We’ll be the laughing stock of the entire parish; as if we aren’t already for that matter! Excuse me Ma’am. Was that your stranded Altima that we passed back there on the shoulder? I’d advise you to wait until daylight before going to pick it up unless you want to run back into your big furry buddy. You’ll probably need a jump too. It looked like your battery was almost dead.”</p>\n\n<p>We all laughed at the obviously sound advice and understatement. I thanked them profusely for coming along when they did. They saved me from an uncertain fate at the hands of a large unknown creature stalking stranded motorists in the Louisiana bayou. As I stated at the beginning, there are certain truths you must accept here in the swamp. Above all, never take a late-night drive down the long bayou road on an empty fuel tank. There are worse things lurking here in the woods than gators and snakes. </p>\n</div>\n","author":"OpinionatedIMO"}