{"rank":"8","title":"A Night in the Badlands","id":"8mfpxm","url":"/r/nosleep/comments/8mfpxm/a_night_in_the_badlands/","time":"1527397026000","body":"<div class=\"md\"><p>To the average American, there isn&#39;t anything too frightening about the Badlands. It&#39;s a national park in southern South Dakota consisting of striped jagged peaks, buffalo, grasslands, and prairie dogs. There are numerous trails and places to climb. You can camp, rent a cabin, or even stay in a rundown hotel just outside the park&#39;s limits. It&#39;s a family place. It&#39;s assumed completely safe aside from the occasional rattle snake and idiot that pilgrimages to a spire he can&#39;t climb back down from.</p>\n\n<p>Things change after dark. </p>\n\n<p>If you stay within the confines of your accommodations or attend the nightly stargazing sessions, you won&#39;t encounter what I did. I&#39;m not talking about wildlife, crazy rednecks, or the miscellaneous fall from night climbing. There&#39;s something sinister about the park itself.</p>\n\n<p>My husband and I have a habit of finding ourselves places we really shouldn&#39;t be when we go on vacation. It&#39;s often accidental, but sometimes my husband gets a little too adventurous. I have a hard time telling him no. Last night was no different. </p>\n\n<p>He decided he wanted to take a night hike along one of the shorter trails. We were just going to look at the stars. We made our way to a bench a ways over and up from where we parked the car. The moon was bright, so it was easy to see where we were going. We didn&#39;t even need a flashlight. Unfortunately, the moon was VERY bright with an overcast sky. There weren&#39;t many stars to be seen. After an hour or so, we determined it was time to head back to the car. </p>\n\n<p>As we walked, the trail seemed longer. Things were starting to look different. I nervously asked my husband if we were going the right way. He was sure we were on the right track. It grew very dark very fast. Trees that I don&#39;t remember being there previously now lined both sides of the path. There were forks and curves that seemed to lead nowhere. </p>\n\n<p>This trail isn&#39;t long. It couldn&#39;t be more than a mile and it leads to a view that overlooks the park. It didn&#39;t hook up with other trails. All of these detours were completely new. Nothing looked or felt right.</p>\n\n<p>We pressed on, now with my husband&#39;s cellphone flashlight guiding our way. I began hearing things in the tall grass and trees. There was movement, but there weren&#39;t any of the normal noises. The birds and crickets had gone silent. There was a long cry from somewhere it the distance. A bison maybe? We kept walking. I desperately wanted to stop, but I was afraid of what would happen had we taken time to rest.</p>\n\n<p>We hiked for hours until the dawn finally broke. When we saw the sun, we also reached the car. It seemed we were mere FEET from our vehicle. It was a little too uncomfortable to be coincidental. We made our way back to the hotel and slept the whole day.</p>\n\n<p>I still have no idea what happened out there. It shouldn&#39;t have taken us all night to find our car. It shouldn&#39;t have been so quiet, and the trees shouldn&#39;t have been so thick. We won&#39;t be hiking here at night anymore. I suggest you don&#39;t either.</p>\n</div>\n","author":"SparknSprinkle"}