{"rank":"1","title":"What Does This Mean","id":"8mfte2","url":"/r/nosleep/comments/8mfte2/what_does_this_mean/","time":"1527398352000","body":"<div class=\"md\"><p>Super natural experiences have always seemed to follow me, kind of like a curse except that is exactly what it is. I&#39;ve finally mustered up enough courage to share the experience that really changed and shook me. </p>\n\n<p>This took place at my friend we will call Alex&#39;s house. For some background detail his family consists of heavy sleepers which is important to remember for this story of mine. They all snore and I sleep basically right next to the kitchen.</p>\n\n<p>This night had felt extra surreal, almost fake. It was a slightly windy, late August night. One could tell due to the occasional rustle of leaves. It was also way warmer than any other night that summer. </p>\n\n<p>I have what I&#39;d like to call insomnia, but it got way worse after this experience. Which makes waking up multiple times a night for no reason whatsoever a familiar friend. I can usually play on my phone for a bit and go back to sleep but this night specifically haunts me. </p>\n\n<p>I had woken up around 1 20 in the morning and heard footsteps in the kitchen which is odd considering the whole family was asleep, I could tell due to them snoring. So as a rational human being I get up and look around, prepared to fight anything in my path, I&#39;m not the tallest or fittest, but I do know how to carry my weight in a fight so I was prepared.</p>\n\n<p>Only to be sorely disappointed by there being nothing there at all. But I could hear the quick quiet pace of a middle aged man striding across the wood flooring. </p>\n\n<p>&quot;What the actual fuck?&quot; I whisper in disbelief of seeing nothing but hearing a man walk about.</p>\n\n<p>That is what I consider one of the biggest mistakes of all time in a situation like that. As soon as those words left my dry, parched mouth the world stopped. I felt a deep nauseous feeling. Kinda like getting on a rollercoaster only to get a sickly feeling in ones stomach. I also felt a dark presence and I felt penetrating eyes staring into my soul. I never want to feel that again.</p>\n\n<p>But as soon as everything had left everything came back. I heard thunderous footsteps, the sound of long nails being drug against a wall, monotonous knocks against the doors and windows. I ran back to my couch in hope of safety in this highly terrifying experience. </p>\n\n<p>Only to be met with those damn whispers that have never left since. Always following. Never leaving. They all said in a haunting tone &quot;Your time has come.&quot; </p>\n\n<p>&quot;Why?!?&quot; I yell in both fear and anger, &quot;What have I done to deserve this torment? This Hell?&quot; For the rest of the night I could feel cold breaths down my neck and blatant and extremely uncomfortable stares. Goosebumps skipped and raced across my arms. </p>\n\n<p>Still these whispers haunted me, but had gotten to a point where I couldn&#39;t understand any more because they were so loud, my head felt like it was going to explode. It never got quieter. The noises, the shrieks, the blood curdling screams they all stayed. </p>\n\n<p>I could feel the torment and the pain in their cries of despair, but who was I to save them. I couldn&#39;t even save myself. I started to feel light headed and as much as I didn&#39;t want to sleep, nor did I want to find out what would happen to me if I were to fall asleep. I told myself stay awake. But alas when I opened my eyes again it was bright. The birds chirping. The faint sound of mowers. </p>\n\n<p>I wish I could forget this night. But it plays over and over in my head like a movie on repeat that I just want to end. I just want the voices. The screaming. All to fade away. To pass on so I could forget this dark dreadfull night. But I must carry on I guess as my time hasnt come yet.</p>\n\n<p>But what does this mean? Am I already dead, or soon to be? Why wont these spirits leave me alone? I dont know but as I have been sharing this story the whispers are getting exponentially louder. Whether or not I meet my doom is left at the hands of God himself I guess. I must go now, farewell.</p>\n</div>\n","author":"EternallyWishing"}