{"rank":"657","title":"I wrote a letter to myself. I got a response. Part 3.","id":"8mg4sv","url":"/r/nosleep/comments/8mg4sv/i_wrote_a_letter_to_myself_i_got_a_response_part_3/","time":"1527403096000","body":"<div class=\"md\"><p><a href=\"https://redd.it/8lxrvb\">Part One</a></p>\n\n<p><a href=\"https://redd.it/8m7o9u\">Part Two</a></p>\n\n<p>&nbsp;</p>\n\n<p>I woke to ashes fluttering down onto my face like sullen snowflakes, covering my skin in a hundred gray kisses of burned down yesterday.  I coughed as I sat up, pulling in another spasmodic breath as I wiped at my eyes.  The ashes had caked there because I had apparently been crying in my unconsciousness.  My hands came away black and running as my eyes began to water again, and blinking through the smut and the tears, I could see the flakes falling down on me through a hole in the roof.  Or rather the ceiling, because Scott’s apartment wasn’t on the top floor.</p>\n\n<p>&nbsp;</p>\n\n<p>Yet looking around, it was Scott’s apartment, or a very close approximation of it.  It was far more run down and dirty, and some of the decorations were different, but the layout and the general appearance was similar.  My head was still drifting through a fog so thick I could scarcely tell I was even in a fog, but I was starting to remember myself and Scott, and parts of what had happened.  I looked up again and remembered that there should be at least three floors above this one, and at the edges of the hole in the ceiling I could see parts of those ruined rooms hiding in the shadows up there.  It seemed that the top part of the building had been destroyed somehow at some point in the past, and through the hole that was left behind I could see the ashes, and beyond that, the stars.</p>\n\n<p>&nbsp;</p>\n\n<p>I came back to myself again as I remembered Scott attacking me.  Well, not Scott, but someone that looked like him.  A lot.  Like some older, crazy twin brother.  He had dragged me into Scott’s bedroom, and I had seen that the floor and wall were covered in blood.  He dipped his finger in the blood and traced the outline of a rectangle inside the perimeter of a strange collage of colored paper pasted to the wall.  I had felt amazement push through my terror as I saw a crack appear in the wall where his finger had traced, and at his touch, it swung open as a door.</p>\n\n<p>&nbsp;</p>\n\n<p>I had known then what was coming next, however insane or impossible all of this was.  I fought harder to get away, but he was bigger and stronger, and when he slammed my head against the floor the second time, I couldn’t fight the darkness that rose up around me any longer.</p>\n\n<p>&nbsp;</p>\n\n<p>I felt the back of my head at the memory and gasped at the pain as my hand found a clotting wound in my sweaty tangle of hair.  I started looking around again, and I could see I was in the living room of this place that is like Scott’s apartment but not.  My brain had been screaming a thousand things that are wrong since I first woke up, but I could only process a few at a time.  Just as I realized that Not Scott was coming back from the bedroom, my hand found its way up to my throat and the dog collar there.</p>\n\n<p>&nbsp;</p>\n\n<p>“Hello, Christine.”  His grin was so like Scott’s that its familiarity made it all the more ghastly on this man.  His face was thin and his eyes were two bright pieces of glass in sunken pits, glittering with intelligence and ill will.  I could now see that it somehow was Scott, despite the longer hair and the harder, harsher lines of his face.  It just wasn’t <em>my</em> Scott.  I didn’t know how it was possible, but once the thought was fixed in my mind, I knew it was true.</p>\n\n<p>&nbsp;</p>\n\n<p>“Hello.  Where did you take me?”  I tried to sound confident, but it was a weak attempt given I was sitting hurt and confused in a dog collar in some bizarre place with some bizarre version of Scott.</p>\n\n<p>&nbsp;</p>\n\n<p>His smile widened.  “That’s a fair question.  This is my world.  I brought you from yours after hearing good things about you from Scott.  Well, the other Scott.”  He raised his hands in a placating gesture.  “Look, I know what you’re thinking.  I kidnapped you, knocked you out and brought you to this place.  Hell, I put a collar on you.  I guess this all looks really bad, huh?”</p>\n\n<p>&nbsp;</p>\n\n<p>He crouched down on his haunches next to me.  “I brought you here because I miss my old Christine.  See, we were together here too, but things didn’t work out well.  I’m not saying it wasn’t selfish to take you away, but it was with love in my heart.  And as for this,” he pointed to the dog collar, “I just wanted to make sure you didn’t run out if I wasn’t awake or paying attention when you came to.  My world is pretty different from yours, and it’s not safe out there a lot of the time.  I wouldn’t want you getting hurt on my account.”</p>\n\n<p>&nbsp;</p>\n\n<p>I stared at him, trying to keep any scorn out of my expression.  He was clearly insane, and I didn’t want to risk setting him off, especially when I really didn’t know what was going on or what this place was like.  And that was the key.  I needed as much information as possible and I needed to see how much latitude I could get before trying to escape.</p>\n\n<p>&nbsp;</p>\n\n<p>“So you’ll take the collar off now?”</p>\n\n<p>&nbsp;</p>\n\n<p>He chuckled and shook his head.  “I can already tell I’m going to like you better.”  Sighing wistfully he went on.  “No, not yet, honey.  It’ll take some time for you to acclimate, and until you do, I’m afraid you’ll be your own worst enemy.  For now, just rest and I’ll bring you some food.  Your chain goes far enough for you to reach the bathroom over there, just remember do not flush it during nighttime hours, okay?  That’s very important.  This building is fairly secure, but the neighborhood has gone to shit lately.  Lots of home invasions at night and they target buildings where they hear noise or see lights.  The blinds keep the light in pretty well, but the pipes in this old bitch kick up a fuss when you flush, so just save that for the morning and we should be shiny golden.”</p>\n\n<p>&nbsp;</p>\n\n<p>The next few days were a cycle of sleeping, eating, and trying to figure out the best way to escape and where exactly I would be escaping to.  The last part was primarily facilitated by Not Scott.  He spent hours each day talking to me, seemingly starved for conversation and human contact.  He had some kind of job, and depending on something he called “occurrence reports”, he would be gone working for periods of time most days.  But whenever he was there he was usually talking to me.  </p>\n\n<p>&nbsp;</p>\n\n<p>He would tell me stories about himself sometimes, but a lot of his time was spent asking me questions.  What was my childhood like, what had my life been like before he took me, what kinds of things did I like to do, like to eat, etc.  It was all so strange.  He had this aura of discord and violence around him so  palpable the air fairly vibrated with menace when he was in the room, but he was never rough or even rude to me aside from the obvious of holding me against my will.  </p>\n\n<p>&nbsp;</p>\n\n<p>It was made stranger because parts of him did remind me of my Scott.  The way his face would light up when he was telling a story, or the way that he would look at me sometimes when he didn’t know I was looking.  It somehow made it all worse instead of better, seeing those glimpses of something I loved being choked to death by whatever sickness had taken root in him.</p>\n\n<p>&nbsp;</p>\n\n<p>I tried to find out more about the world I was in from him, and he told me some, but not much.  He said that years ago, before he was born, things had started changing.  A lot of animals had started dying off for no discernable reason and all at once.  This had led to the partial collapse of a number of ecosystems around the world, which lead to disease and famine and death.  According to Not Scott, things stabilized some eventually, but they were never really right again.  Strange things would happen.  People would disappear or go on murder sprees.  Pods of dolphins started killing off large portions of the shark and whale populations in the Pacific.  Then in 1998, over 200,000 people across the globe committed suicide within ten minutes of each other for no apparent reason.  People called it the Awakening now, because that was when the world governments and media began admitting that there was an ongoing major problem and they didn’t know how to stop it.</p>\n\n<p>&nbsp;</p>\n\n<p>Not Scott told me with a laugh that it wasn’t like the world was ending, but sometimes it sure felt like it.  After the Awakening, a lot of fanatics started popping up.  Religious zealots, doomsday preppers, militant groups itching for a fight.  He said those groups caused disorder and could be dangerous to be around, but mostly they were just scared people looking for an answer.  And for the most part, civilization was still chugging along.  Governments existed, people went to work, and as time went on, strange became the new normal.</p>\n\n<p>&nbsp;</p>\n\n<p>Then people started going insane.  Not the normal, scared “I’m going to wear a bullet proof vest to the grocery store” insane, but more the “I’m going to eat the bus driver’s face” insane.  He said that actually happened to him when he was riding the metro one day.  People turning crazy didn’t happen a lot at first, but in the last five years it was building.  There were more random acts of extreme violence—a teacher chopping up her third-grade class, a little boy stabbing out his father’s eyes while he slept—but there were more subtle versions of it too.  </p>\n\n<p>&nbsp;</p>\n\n<p>People would develop strange obsessions or fetishes.  They would become paranoid or have wild mood swings for no apparent reason.  Not Scott said that most days at work there would be at least one or two people crying or laughing uncontrollably at random times throughout the day.</p>\n\n<p>&nbsp;</p>\n\n<p>He had tears in his eyes when he told me that last, and I felt my heart breaking a little at what he said next.</p>\n\n<p>&nbsp;</p>\n\n<p>“I know it’s happening to me.  It’s happened to me already.  I’ve done terrible things.  Not just what I’ve done to you and to your Scott…I’ve done much worse than that.  I…I used to not be like this.”  </p>\n\n<p>&nbsp;</p>\n\n<p>I reached forward and took his hand.  “I can’t imagine what you’ve been through.  And I’m not saying you can fix everything, but you can make it better.  Let me go back.  You come too.  If this world is what is making you do these bad things, maybe you’ll be better away from it.”</p>\n\n<p>&nbsp;</p>\n\n<p>Not Scott pulled his hand away, his face hardening.  “I should have expected this kind of cozening from you.  You’re not as different as I’d hoped.”  Standing up, he wiped his eyes with the palms of his hands as his stared off, his expression hurt and almost embarrassed.  “You aren’t leaving and there’s no real hope for me either beyond embracing this world as it is.  Letting it reshape me so I can survive it.”  He looked back down at me.  “You best get to accepting your reality too.  It’s a hard world and it’s going to get harder.”</p>\n\n<p>&nbsp;</p>\n\n<p>After that he talked to me a lot less, though some nights he would sit with me for awhile, saying very little but seeming to not want to be alone.  Other nights he would seem different, a dark look on his face more akin to when I first saw him upon waking.  Those nights I just tried to stay inconspicuous and small.</p>\n\n<p>&nbsp;</p>\n\n<p>He didn’t tell me much more about the world outside other than that there were worse problems now than just people going crazy.  But I could hear signs of the chaos outside.  Gunshots, screaming, and the orange glow of distant fires were a regular part of life.  I asked about what had happened to the building and he said a television helicopter had crashed into it a couple of years back, taking out most of the top three floors.  It had only put the small hole in Not Scott’s ceiling and caused minimal structural damage to the rest of the building, so he had stayed.  He grinned and said he’d negotiated the rent down and decided to look at it like a skylight.</p>\n\n<p>&nbsp;</p>\n\n<p>And the days moved on.</p>\n\n<p>&nbsp;</p>\n\n<p>I need to stress again that after he got me here, he never hurt me.  He was generally kind in fact.  He didn’t threaten me, he didn’t try to force himself on me or even come on to me sexually.  And the things we talked about, they seemed harmless.  Combine that with the fact that in a lot of ways Not Scott <em>was</em> Scott, and it made it easier to be taken in.</p>\n\n<p>&nbsp;</p>\n\n<p>Looking back on it now, I see that peppered into our conversations were questions that would prompt me to talk about my Scott, to talk about my world.  As I told him stories of my parents or my ninth birthday or my college major, I was giving him information and insight into a place he was desperate to learn more about.  He was smart about it.  Subtle.  But over time I was handing him everything he wanted.</p>\n\n<p>&nbsp;</p>\n\n<p>I had let myself forget I wasn’t dealing with my Scott, but just afflicted with some strange mental illness.  I was dealing with a stranger. </p>\n\n<p>&nbsp;</p>\n\n<p>I remembered that fact when he brought her in, screaming and crying, snot pouring from her nose as he dragged her by the arm across the living room and into the bedroom.  He tried to shut the door back when they entered, but in her flailing she kicked it and it swung back open as he brought the knife down across her stomach.  As blood welled out of the wound, she raised her head and her eyes met mine.  She couldn’t have been more than eight years old.  </p>\n\n<p>&nbsp;</p>\n\n<p>Not Scott followed her gaze and saw the door was open.  He looked at me, his face pale and stricken.  “I’m sorry you saw this, Christine.  I’m just doing what’s necessary to survive.  Tell him I left the key to your collar in my closet.”  With that, he slammed the door shut.  It muffled the girl’s last gurgling scream, but not nearly enough.</p>\n\n<p>&nbsp;</p>\n\n<p>I screamed at the door, begging him to stop, but I knew it was no use.  It was more just to make myself feel better and to vent my frustration.  For the hundredth time I strained at my collar and tugged at my chain, but he had secured both well.  I finally gave up, my throat hoarse and my body exhausted.</p>\n\n<p>&nbsp;</p>\n\n<p>Even amid my struggling and thrashing about, I had noticed that the bedroom had fallen silent.  As I lay there panting, I strained to hear any sound.  There was nothing for several minutes, then a series of small scuffling noises followed by the sound of something being drug.  Then silence again.  I debated yelling, but I knew it was too late for the girl, so I stayed quiet.  When the door suddenly burst open, I let out a scream.</p>\n\n<p>&nbsp;</p>\n\n<p>Scott was standing there, his face and clothes smeared with blood.  He was squinting and seemed unsteady on his feet, but when he saw me, his eyes widened.</p>\n\n<p>&nbsp;</p>\n\n<p>“Christine?”</p>\n\n<p>&nbsp;</p>\n\n<p><a href=\"https://redd.it/8mu4gd\">Part Four</a></p>\n</div>\n","author":"Verastahl"}