{"rank":"0","title":"bRIGHT sIde Verseds 1: 69-420","id":"8mgjwd","url":"/r/nosleep/comments/8mgjwd/bright_side_verseds_1_69420/","time":"1527410043000","body":"<div class=\"md\"><p>Mascara running down my bambi eyes. my girl left me after a seven year relationship.</p>\n\n<p>Don Peringyon disastrously poured down my gullet cause there is no remedy for her memory. Fucking black beauty she was, like a mongoloid i.m taking deeep sniffs to remind myself of her, to frget he absinthe. The fact that she left on a mystery train.\nWarning</p>\n\n<p>This story contains boring warnings but also the much needed ones, I don&#39;t wanna trigger you.\nI&#39;m crying, full tears wailing wall paint my portrait a wet little lolita like lesbian labia lusting lady,\nshe just texted me the worst news,</p>\n\n<p>&quot;Why don&#39;t you do a 720° turn counterclockwise and suck a 13.9 inch dick while inhaling approximately 193 liters of pure oxygen, causing you to pass out due to an excess of oxygen in the lungs. After that, you will proceed to fall down 1,290,920 flights of stairs, at the end of which is a 3 x 6 x 4 foot hole filled with solid steel spikes with a base of 12 centimeters, a length of 60.96 centimeters, and a side of 3860.1216 centimeters. </p>\n\n<p>Finally, when your body hits the spikes, a standard U.S. Army M18A1 Claymore mine will detect your flailing ragdollesque body and proceed to explode, projecting 700 1⁄8-inch steel balls at a velocity of 3,937 ft/s into a 60° fan-shaped pattern that is 6.5 feet high and 50 m wide at a range of 50 m. Proceed to engage in coitus with a multiple cacti of varying species, you unsuccessful abortion.&quot;</p>\n\n<p>She is sending me reddit copypastas to spit my souless spirit.</p>\n\n<p>She acts as if she is perfect. ive seen her cup her hand post fart and smell it of a d vinci like curiosity\ncause its safe in the city to love in a doorway\nto wrangle some screams fromunda the door\nLICK fromunda cheeze from under my ladylike nuts.\nLouis ck will nut on your face cause this is the nutshake</p>\n\n<p>girl want me to cut the off so I can be a &#39;True&quot; lesbian labia licking thespian\nI derail, i must get to the darn point here is a amber alert\nYOU will not be able to skip out on scag during this unfathomable dark and dreary tale I&#39;ve to tell to you.</p>\n\n<p>I recommend not reading alone, hold your girl tight and pour an extra stiff hot coco with the obligatory double shot of Irish cream.\nUnfolding events will seem unrealistic, cartoon like; this sitch is cause I, in sexy phenobarb bird brain, went to a rave a few fortnights ago and this dead head harlot thumped me will Ecstasy. She gave me a hot Cosby.</p>\n\n<p>The friggin ice water i&#39;m drinking now to replenish wasted spinal fluids, cause im dehydrated aint satisfying in the slightest, also made the ill will bambizzle of over doing the chips and cubes. Ovaries.</p>\n\n<p>While water is nicely filtered, the mohammid damned aqua tastes like Floridian tap: well i&#39;m a big girl and must remember the brightside: i aint in flint mishygin.\nim mr brightside just look at the brightside</p>\n\n<p>&quot;Coming out of my cage And I&#39;ve been doing just fine Gotta gotta be down Because I want it all It started out with a kiss How did it end up like this It was only a kiss, it was only a kiss Now I&#39;m falling asleep And she&#39;s calling a cab While he&#39;s having a smoke </p>\n\n<p>And she&#39;s taking a drag Now they&#39;re going to bed And my stomach is sick And it&#39;s all in my head But she&#39;s touching his chest Now, he takes off her dress Now, letting me go I just can&#39;t look its killing me And taking control Jealousy, </p>\n\n<p>turning saints into the sea Swimming through sick lullabies Choking on your alibis But it&#39;s just the price I pay Destiny is calling me Open up my eager eyes Cause I&#39;m Mr Brightside</p>\n\n<p>I&#39;m coming out of my cage And I&#39;ve been doing just fine Gotta gotta be down Because I want it all It…&quot;\n&quot;I know that you want me, you know that I want you The memories haunt me, I know that they haunt you too But it&#39;s alright, you&#39;ll be fine Baby, it&#39;s alright, you&#39;ll be fine As long as you&#39;re mine, take a look at the time It gets cold at night, when you&#39;re alone outside But it&#39;s fine, I&#39;ll be fine Pay me no mind, girl, pay me no mind Just look at the </p>\n\n<p>brightside (just look at the brightside) </p>\n\n<p>Just look at the club lights (rolling under the club lights) I gotta look at the </p>\n\n<p>brightside (look at the brightside)</p>\n\n<p>I guess she wasn&#39;t the one, right This isn&#39;t what love&#39;s like That&#39;s for sure Help me find a way to pass the time (to pass the time) Everybody telling me life&#39;s short, but I wanna die (I wanna die) Help me find a way to make you mine (make you mine) Everybody telling me not to, but I&#39;m gonna try Now I&#39;m getting high again, tonight I know that you want me, you know that I want you The memories haunt me, I know that they haunt you too But it&#39;s alright, you&#39;ll be fine Baby, it&#39;s alright, you&#39;ll be fine As long as you&#39;re mine, take a look at the time It gets cold at night, when you&#39;re alone outside But it&#39;s fine, I&#39;ll be fine Pay me no mind, girl, pay me no mind Just look at the brightside</p>\n\n<p>(just look at the brightside) Just look at the club lights (rolling under the club lights) I gotta look at the brightside </p>\n\n<p>(look at the brightside) I guess she wasn&#39;t the one, right This isn&#39;t what love&#39;s like That&#39;s for sure Help me find a way to pass the time (to pass the time) Everybody telling me life&#39;s short, but I wanna die (I wanna die) Help me find a way to make you mine (make you mine) Everybody telling me not to, but I&#39;m gonna try Now I&#39;m getting high again, tonight Just look at the brightside</p>\n\n<p>(just look at the brightside) </p>\n\n<p>Just look at the club lights (rolling under the club lights) Just look at the night life (just look at the night life) Watching the sun rise by my side We gotta look at the brightside (just look at the brightside) </p>\n\n<p>Rolling under the club lights (rolling under the club lights) I gotta look at the brightside</p>\n\n<p>(just look at the brightside)</p>\n\n<p>I guess she wasn&#39;t the one, right This isn&#39;t what love&#39;s like That&#39;s for sure&quot;\nSongwriters: Dylan James Mullen / George Astasio / Gustav Elijah Ahr / Jason Andrew Pebworth / Jonathan Christopher Shave / Mike Blackburn\nThe Brightside </p>\n\n<p>lyrics © Universal Music Publishing Group, Sony/ATV Music Publishing LLC, Warner/Chappell Music, Inc\nGin soaked pantaloons haunt me to my very core as my gals&#39;s ghost ghastly gallavants my gourgeous brooklyn bed side bay view. She&#39;s been ghpsting, ghosting like Phanom, dani, and it just is fair. Fart man, i mean Hartman needs to make a live action Ember movie in honor of Andrew Stair or whatever the fagz name was. The ember killer.</p>\n\n<p>slong side, long sybian silicone when in rome, hill though, purple didldo, her ex stacy we drank colt fort-fives in eager wait for the auditory bliss that was soon to softly fuck our ears.\nEating jumbo puff pastires in my scooby doo underoos, I start my morning routine: vinyl record spinning my ultra collectable Avril Lavigne Greatest hts. The clock strikes seven, the morning mood is set, the scene is me rushing to tracks where I work. I am a conductor in my nine to five; I do nights shifts at a dog shelter, specializing\nBig ass trains roll out of tunnels in a phallic way.</p>\n\n<p>I&#39;m sipping cognnac out an elmo glass to the tune of a million penetrated escorts whilst gorging, gargling viscous venom in a comically oversized big ol&#39; bad boy jerrys can o&#39; ice creme.\nAs I write this modern piece in the style of hemminway, typing on my typewriter with to 1911 , the front ends of my handguns, I know i am on the verge of the best no sleepstory. You are gonna get fucking spooked.</p>\n\n<p>Spooked so bad sucka, sorry it&#39;s taking me this long to get to the point but this story is worth the wait.</p>\n\n<p>wait</p>\n\n<p>wait</p>\n\n<p>wait</p>\n\n<p>kawait\nvietnam flahback\nher name was La Villa</p>\n\n<p>she brought me there chinky version of feel good serums but &#39;twas not\nwe dranj opium tea and now i must sleep or try atleast, shes smelling up my apartment</p>\n\n<p>somebody is not washing there behind</p>\n\n<p>words unkind but you get the ide</p>\n\n<p>FUCKING DONATE I NEED THE QUICK BUCKS</p>\n\n<p>alright thou can unlock the four more pieces of this story if you donate to my patreon</p>\n\n<p><a href=\"https://www.mastersny.org/page.cfm?p=856\" rel=\"nofollow\">https://www.mastersny.org/page.cfm?p=856</a></p>\n</div>\n","author":"reIytnedrud"}