{"rank":"12","title":"Old Montana State Prison visit","id":"8mgnfu","url":"/r/nosleep/comments/8mgnfu/old_montana_state_prison_visit/","time":"1527411768000","body":"<div class=\"md\"><p>One summer after I had completed my first semester of college I decided to head to the old Montana State prison with my mom, my grandparents and my siblings. Now before I go on, I need to say that this prison is one of the most haunted areas in Montana. I&#39;ve always enjoyed creepy stuff and had a fascination with the paranormal and things that can&#39;t be explained. So needless to say, I was looking forward to it.</p>\n\n<p>After paying admission I entered the courtyard; and immediately I felt weird. You know that feeling when you walk into a room or something and everyone stops what they are doing, stops talking and they all look at you? That awkward feeling? That&#39;s how I felt. Not to mention it was rather quiet. I mean this old prison is in Deer Lodge Montana, it&#39;s in the city and it&#39;s been turned into a museum so it&#39;s going to be quiet but the silence was just unsettling. I was actually walking with my brother and looked at me and goes &quot; you hear that?&quot; &quot; I responded with &quot; I don&#39;t hear anything&quot; and he goes &quot; I know.&quot; </p>\n\n<p>This prison has a long history of violence that I will let you Google at your own discretion. If you like reading about murders, suicides and even riots, you&#39;ll enjoy it. Anyway I walked about the prison with an awkward feeling, I honestly felt like I was intruding. I tried shaking off the feeling telling myself that I was letting the prison get to me. And me listening to Creepypasta narrations of YouTube on the drive up here didn&#39;t exactly help. As I walked through the cell blocks, I noticed something on the floor in the building that contained the mess hall. After closer inspection I realized it was a dried up blood splatter. I actually thought that was rather cool, perhaps it came from the riot that occurred in the 1950&#39;s or it was from one of the many violent attacks? I can&#39;t be sure and it may be a little odd but I was excited seeing an old blood splatter in a building such as this</p>\n\n<p>Next I walked to a certain cell block with my sister and entered cautiously. As me and my sister walked around, the feeling  had intensified and I kept looking over my shoulder. It honestly felt like someone was glaring at me, you know that feeling you get when someone gives you a glare full of malice and ill intent? That&#39;s the feeling I had. What happened next I would like to think has a logically explantation. A cell door swung open right in front of me and my sister. needless to say, we ran out of that cell blocks like bats out of hell. </p>\n\n<p>We hung out in the courtyard until we calmed down. From here I walked over to the gallows they used to hang people from. Now the gallows are locked behind a gate so you can&#39;t go up to there and mess with them ( why would you want to?) And I swear to God I started hearing noises. At first I thought they were just the far off voices of other visitors but soon realized that they were coming from the other side of the gate, where the gallows were. I couldn&#39;t make out what was being said but from the tone, it sounded like someone was speaking with ill intent. I backed up, goosebumps on my arms, hair standing up. I didn&#39;t need to be able to make out what was being said to know </p>\n\n<p>Finally, I walked into the male cell block and they had open cells where you could go and could actually go and sit on the beds. I walked into a random one and sat on the bed, creeped out. I was about to stand up and leave when the cell door slammed shut and didn&#39;t budge when I tried opening it. All of my bravado left, I mean I was already a little scared as is, I was in this cellblock by myself and now I was trapped in this cell. I couldn&#39;t get the door open so I start banging on the door, yelling for someone to help. I was beyond terrified at this point when I feel a burning sensation on my right arm. I didn&#39;t bother looking  at my arm to try and find out what was causing it, all I wanted to do was get the fuck out of the cell. After a few moments I was finally able to open the cell door and I ran as fast as I could.</p>\n\n<p>I was done after that. No way was I staying in the prison after that. That night when I was taking a shower I looked at my arms to see four long jagged cuts on my arm. I don&#39;t know what happened on that day but I don&#39;t see myself going back to the old State Prison. Getting trapped in an old cell once was enough. I will say this. Before this trip, I was skeptical if things such as ghosts and malevolent spirits actually existed. Now, let&#39;s just say I am no longer skeptical. I leave you with this. Something was there that day. So if you end up ever going to the Old Montana State Prison, prepare to encounter something not of this world</p>\n</div>\n","author":"Thelastemperor1996"}