{"rank":"82","title":"[Series] My father warned me about these woods. Part 2","id":"8mgxui","url":"/r/nosleep/comments/8mgxui/series_my_father_warned_me_about_these_woods_part/","time":"1527416692000","body":"<div class=\"md\"><p>Link to <a href=\"https://www.reddit.com/r/nosleep/comments/7x35uv/my_father_warned_me_about_these_woods/\">Part 1</a></p>\n\n<p>There was something wrong with Spencer, but I couldn&#39;t quite put my finger on it. Maybe it was his nerves, or maybe it was just the temperature. It was starting to get bitterly cold in the woods at night, and the lack of sleep was catching up to us. But we were determined to find answers.</p>\n\n<p>&quot;Spencer. Have some of my leftovers. You haven&#39;t been eating enough to keep up your strength.&quot; I leaned forward and offered a half-eaten pack of dried fruit I had saved from earlier. He took it. Sluggishly.</p>\n\n<p>&quot;Thanks,&quot; he said. He chewed quietly, staring into the smoldering campfire. We had been reluctant to let him come along. He had always been sort of a sickly kid, but we needed him. He was the only one who had actually seen it in person. The guy was brave. Probably braver than all of us.</p>\n\n<p>Lynn and I made eye contact over the fire. He didn&#39;t speak, but he didn&#39;t have to for me to know what he was thinking. He knew we were lost. I hadn&#39;t told the others yet, I knew causing a panic would do no one any good.</p>\n\n<p>This would be our fourth night in the woods, and it had been getting harder and harder to keep a flame, and there&#39;s nothing that can sap your strength faster than long, sleepless nights tending a fire. We took rotating shifts to keep watch, but none of us were ever able to get any restful sleep. Truth be told, I was beginning to cave too.</p>\n\n<p>That wasn&#39;t the only problem either. I was certain we were being followed. I couldn&#39;t tell by what, but there was no mistaking the bipedal gait that caused the crunch of dead leaves around our camp at night. It was never close, always just barely within earshot. None of the others seemed to notice, or maybe they did and were just too afraid to say anything. Sometimes speaking about something out loud was enough to make it real.</p>\n\n<p>&quot;I&#39;m going to hit the sack. Wake me up when it&#39;s my shift,&quot; Lynn said. He stood up, stretched, and resigned to his tent. Spencer and Kurt followed suit. I spent the next four hours keeping the fire alive, and pretending I didn&#39;t hear the footfalls in the distance.</p>\n\n<p>The next morning was unusually bright. The sun had come up almost an hour sooner than it was supposed to, and I was awakened by the sound of Lynn kicking dirt into the fire. After having a decent breakfast of some dry cereal, we packed up camp and set off again.</p>\n\n<p>We were supposed to be heading to an old hunting cabin that belonged to my family. My father had taken me there dozens of times as a kid, and even though I hadn&#39;t been there since his passing almost nine years ago, I still knew the way. Or, at least I thought I did. I still wasn&#39;t sure how we had gotten lost, I even had the location marked on my map, but the terrain around us was all wrong.</p>\n\n<p>In fact, it was almost impossible to get lost trying to find the cabin. The New River is ancient. It&#39;s one of the oldest rivers in the world, older even than the Nile river. To some, it&#39;s called Wood&#39;s River, named after a famous Colonel in the late 17th century who is credited with it&#39;s first recorded exploration. In the mid-18th century, it was used by Mary Draper Ingles during her 500-mile trek back home after her family&#39;s capture by Shawnee Indians in 1755. Throughout history, it has been used as a guide for Appalachian travelers who have lost their way. </p>\n\n<p>From our origin point, following the New River downstream for about two days time would land us right at the base of the cabin. Everyone knew we should have been there days ago, but I explained that we had to make detours because of unexpected terrain. It was a thin excuse, but combined with the occasional nod and marking fake points while referencing our map, it was enough to keep the thought of being lost at bay. Sometimes a little theatrics are all you need to maintain morale. My father taught me that one.</p>\n\n<p>Time passes by quickly when you&#39;re in the woods. That can be dangerous, because its all too easy to underestimate how much daylight is left, only to find yourself miles from where you&#39;re supposed to be. For those inexperienced with the wilderness, this is the quickest way to find yourself in trouble.</p>\n\n<p>&quot;I think we should go back.&quot; I turned around in stride to see Lynn walk up beside me. I looked back, Kurt and Spencer were a few dozen paces behind, out of earshot.</p>\n\n<p>&quot;I&#39;m starting to think so too. If we don&#39;t find the cabin by sundown we&#39;ll set up camp and head back in the morning.&quot; Luckily, we hadn&#39;t left home unprepared and still had about a week&#39;s worth of rations left. I wasn&#39;t even sure I knew the way back at this point, but my father had taught me that when in danger, keeping a cool head is one of the most important things you can do. Panic will eat you alive from the inside out, and it spreads like Tuberculosis.</p>\n\n<p>A few hours later, we found our way to a clearing on a small hill near a bend in the river. We set up camp, and with the remaining daylight left fetched some firewood. Kurt had brought along a collapsible fishing rod, and returned with a handful of river trout. I showed him how to fillet the fish, like my father had taught me. Everyone seemed to be in a considerably better mood after having a freshly caught trout in their bellies. Everyone except for Spencer.</p>\n\n<p>&quot;It just tastes funny,&quot; he said after Kurt asked if something was wrong. &quot;It doesnt taste like fish.&quot;</p>\n\n<p>We gave him a confused look. &quot;Well, what does it taste like?&quot; I thought it tasted amazing. It was the first meal with substance any of us had had in days.</p>\n\n<p>&quot;Ash,&quot; he said. &quot;It tastes like ash.&quot;</p>\n\n<p>&quot;Sorry, I must have burned yours. Do you want something else? I still have a little trail mix left from this morning,&quot; Kurt said. He started to reach into his bag to pull it out.</p>\n\n<p>&quot;It&#39;s not burnt. The meat tastes like ash. Like it&#39;s been rotten for a really long time.&quot;</p>\n\n<p>We all exchanged strange looks. I was starting to get worried about him. If he was getting sick, we were a long way from help.</p>\n\n<p>&quot;It&#39;s alright. I think I&#39;m just going to go to bed a little early. Maybe I just need some rest.&quot; He threw the rest of the fish into the fire and stepped off into his tent. The oily fish meat bubbled and spat as it was licked by the flames. The smell of freshly cooked trout wafted through the air. The rest of us stayed up for another hour, enjoying the first warm night we&#39;d had in days.</p>\n\n<p>I was awoken a few hours later by the sound of my tent&#39;s zipper hastily being drawn open. Lynn stabbed his head through. His face was pale.</p>\n\n<p>&quot;We have a problem. Spencer is gone.&quot;</p>\n\n<p>I shot up. &quot;<em>What</em>&quot;</p>\n\n<p>&quot;He&#39;s not in his tent. I just went to wake him up for his shift and he wasn&#39;t there. I searched the camp. He&#39;s not here.&quot;</p>\n\n<p>If we hadn&#39;t been in trouble before, we definitely were now. &quot;Go wake up Kurt. We need to find him.&quot;</p>\n\n<p>&quot;On it.&quot; He darted away for Kurt&#39;s tent.</p>\n\n<p>I threw on my boots and bolted outside. It was late, and the moonlight was surprisingly bright. Hopefully that would work to our advantage. Once Kurt had gotten up, we gathered in the center of the camp.</p>\n\n<p>&quot;You two stick together and do a sweep of the perimeter. Look for footprints or any sign of which way he might have gone. Don&#39;t go far, and don&#39;t split up.&quot; They nodded in agreement.</p>\n\n<p>&quot;And don&#39;t answer any calls for help. Not even from me. Not unless you have visual contact.&quot; I could see the blood drain from their faces. They knew we weren&#39;t alone now.</p>\n\n<p>&quot;I&#39;m going to the river. I won&#39;t go far,&quot; I said. &quot;I&#39;ll be back here by the time the moon is touching the mountan top. That&#39;s in 30 minutes from now. If you find him, don&#39;t go after me. Stay here.&quot; With that, I bolted downhill towards the river.</p>\n\n<p>Adrenaline is one hell of a drug. They say that people are capable of incredible feats of strength while under it&#39;s influence, but what they forget to mention is that it enhances your <em>senses</em> too. Millions of years of evolution have fine-tuned it to be the ultimate defense mechanism, activating only in times of great danger. To this day, I still believe the only reason I heard the call was because of the adrenaline pumping through my body.</p>\n\n<p>It was faint at first, almost drowned out by the roil of the river. But there was no mistaking it.</p>\n\n<p><em>Son, are you there? Help me, I&#39;m stuck</em></p>\n\n<p>There was no way. It was impossible.</p>\n\n<p><em>Son? Are you just going to leave me here alone?</em></p>\n\n<p>I knew that voice. I knew it better than anything, and it was coming from the other side of the river. I ran to the bank and looked across. There, just past a thin line of trees, was the cabin, and the door was swinging wide open.</p>\n\n<p>Adrenaline was still coursing through my body. I dove into the river. It was frigid, and I immediately gasped, sucking down a mouthful of water. I spat it back up, wheezing from the shock. I swam across the width of the river and pulled myself up the bank on the other side. Stumbling, I ran to the cabin and up the steps. </p>\n\n<p>The inside of the cabin was dark and empty. It wasn&#39;t like I remembered it. There was no fire burning in the hearth, no kettle of warm soup on the stove, no sound of my father chopping firewood just outside the door. There was nothing here. It was quiet, and the creak of the old dusty floorboards were the only noise that penetrated the silence as I stepped forward.</p>\n\n<p>I was just about to turn around and leave when I smelled it. An unmistakeable smell. A smell I knew well.</p>\n\n<p>I turned, and there, on the edge of the windowsill, was a half-smoked cigarrete. A thin trail of smoke wafting up from it. I stepped closer, and before I even picked it up, I knew. I knew because it had been my father&#39;s favorite.</p>\n\n<p>His signature Marlboro Red.</p>\n</div>\n","author":"LegendaryMouse"}