{"rank":"14","title":"there was a noise in the closet","id":"8mh0m9","url":"/r/nosleep/comments/8mh0m9/there_was_a_noise_in_the_closet/","time":"1527417945000","body":"<div class=\"md\"><p>Sussex, I should have just gone to Sussex. But no, I had to go to damp, rainy Scotland with its freezing wind, ancient buildings and not a soul in sight for at least 10 miles of anywhere; well except for Poppy, my gorgeous golden retriever.</p>\n\n<p>Sighing, I went back from looking out at the loch at the bottom of my near enough to 15-acre garden, at the rain falling into it and distorting any reflection once shown in the deep, blue water. I sat back down on the couch and went back to reading my book. A deafening crash shook the walls of the small, rented bungalow, my head snapped up as the echoes vibrated past my ears. Was it from outside? Impossible- the only sound outside was the drumming of the rain on the roof and the and the wind racing past the windows. It had to have come from inside the house.</p>\n\n<p>‘I have to inspect’ I told myself over and over in my head, but I couldn’t will my legs to move; they were lead planted in the floor, a part of the house itself. ‘Stop, you’re being stupid’ I finally stood up and painstakingly slowly turned around to face the direction of the sound. I walked around to the closet that hadn’t been opened in the weeks I’d been here, it had to have come from there.</p>\n\n<p>I looked hesitantly at the handle: large round and brass, it had the colour of burnt sienna initially but the more I stared at it the colours seemed to morph and deepen, darker and darker it turned until it seemed to represent the night itself - never-ending; I was pulled towards it as everything else closed in and all I could see was this handle. Noise.</p>\n\n<p>The crash sounded again, louder and more malicious this time, and coming from behind the door. I shook my head, now free of the trance as I reached for the handle and turned. The door opened slowly, it was heavier than I had thought and certainly louder, the door seemed to scream in response to being opened and I almost leapt back in fright.</p>\n\n<p>Behind the door was not a closet as I had imagined, but a stairwell. Dust blanketed everything in sight and cobwebs hung from the ceiling menacingly, waiting for me to walk straight into them and be blinded.</p>\n\n<p>Cautiously, I peered down the staircase, fully prepared to run from an awaiting attacker. I scolded myself for my paranoia and focussed on piercing my gaze through the curtains of cobwebs; though they proved not to be the issue more than the darkness that seemed to come much too soon. A candle! I suddenly remembered the box full of candle pillars in the drawer next to the next to the sink in the kitchen. I ran to the kitchen and pulled out a candle then, gaining some common sense, I took another as well. Before I went back, I snatched the matches up, deciding to take the box.</p>\n\n<p>There I stood on the first step down, the blackness already seeming to engulf me. I struck the match. A thousand tiny screams rang in my ears and my own almost joined hem before I stopped myself. I brought the match to the candle, discarded the match and began my descent towards the sound, using my spare candle as a machete to slice the cobwebs.</p>\n\n<p>I reached the bottom feeling that somehow the descent had aged me. Carefully, I looked around. Nothing.</p>\n\n<p>I peered further into the darkness as I waited to see a sign of what the noise could have been, but all I could see was the floor; the ceiling appeared to go on beyond the restraints of the house itself, never reaching an end, the walls seemed wet and alive in the dancing light of the candle, I didn’t dare reach out for it for fear my hand would be swallowed up and the rest of me follow it, I followed the walls along seeing nothing change as I walked, there was nothing but the moving mass on the wall and the sinister shadows cast by the candle light until I almost turned around but then I came upon them. Chains.</p>\n\n<p>Miles and miles of chains attached to the wall and leading off to somewhere I had a feeling I didn’t want to go. Why were they there? How long had the been there? What was on the other end of those chains? These questions burned in my mind.</p>\n\n<p>As I stood still I got a better view of my closest surroundings: from what I could tell, the place used to be some kind of lab though what kind of perverted work was being done here I couldn’t tell you. The chains were large and industrial looking, so much so that I struggled to believe they were all being lifted off the ground. I spotted scientific looking equipment further along the walls: a monitor that looked as though it could’ve been from a hospital, a large electronic microscope, a coat hanger with half a dozen white lab coats and surgeons’ masks and what looked to be a stainless-steel operating table covered with utensils such as scalpel knifes, clamps, scissors and pliers.</p>\n\n<p>That was when it happened, the chain closest to me moved. I could feel my heart threatening to leap out of my mouth as I clapped a hand over my face to stop the scream bellowing out.</p>\n\n<p>I became very aware of the burning light I held in my hand attracting whatever nightmares waited for me on the end of those god-awful chains. Somehow, I couldn’t bring myself to put it out. Fearing the dark more than whatever my light would bring to me.</p>\n\n<p>I promptly turned around prepared to walk back up the stairs and shut this part of the house out of my mind but, as I walked back the way I came from, I reached a dead end. I turned and tried once again to retrace my steps again and again to find the stairs, every time reaching yet another dead end. I was trapped in a labyrinth of my own mind. </p>\n\n<p>Oh God. That awful bang sounded again, shaking the walls around me, shaking my very existence as my vision blurred and my body began to sway from side to side, I let out a small cry as silent tears rolled down my face, I sunk to the floor and began to cradle myself, overwhelmed by the feeling of damning defeat.</p>\n\n<p>I looked up. Oh god I should’ve just stayed at home! The chain- the chain had gone slack. Whatever it was, wherever it was, it was coming for me. I listened in silence, too afraid to even breath, I heard the sickening sound of metal scraping across the rough concrete floor as I stood up and backed myself into the corner, waiting for the inevitable: I knew it was a matter of seconds before I came face to face with the owner of this particular shackle. The sound of the chain jumping over the concrete came closer as if it was laughing at me, taunting me with its presence. I gulped. The chains stopped, I heard sniffing, oh Christ it could smell me!</p>\n\n<p>Then I saw it. It used to be human, I could see it in the eyes, those were human eyes that had experienced joy, sadness, anger and pain, pain so unimaginable that I daren’t even think about it. I say used to because it had been so mutilated beyond repair that it couldn’t be classed as human: its ears had been cut off along with its nose leaving blank holes in its head where they had once been;  its hair looked as though it had been burned off and its skin so pale it had to have been bleached, giving a reptile look to it; it opened its mouth although it was more like a slice in its face, still bloody and scabbed; what was inside its mouth was worse… the teeth had been filed to daggers and they were stained brown from what looked like decades of neglect; its tongue had been sliced down the middle, producing two prongs like a snake. It hissed.</p>\n\n<p>It was tall, taller than any normal person should be- it was over 8 foot at least. Scanning up and down its naked body I saw more mutilation than one person should see in their entire life: ribs had obviously been removed, creating giant cavities between the few left and a stomach twice as long as the standard; the skin on the arm had been ripped away and the contents sealed with some kind of gel, showing the blood coursing through the thing and the muscles flexing, ready for a fight; the bones in its legs had been snapped and had never healed properly, both legs protruded outwards at a sickening angle. I didn’t see its back but I can only imagine the things done to it by the way the creature slanted to the left and hunched forward. It was so thin I could see its spins through its stomach, everywhere hollowed from years of famine and starvation. That thing will haunt me for the rest of my life. But the one thing I’ll never cease to remember about this creature for as long as I live, the one thing that wakes me up in the middle of the night screaming, was its nails: they were a shade of black id never encountered before, rotting and yet simultaneously pristine, they were thick and looked hard as steel, fully capable of cutting through bone, but it was their length that burned into my brain, they reached down to the floor and I realised the sound of metal scraping the concrete hadn’t just been the chain, it had been the nails scratching across the floor.</p>\n\n<p>As it approached me I was surrounded by the smell of rotting flesh and I gagged. Its walk was jagged and uneven, it moved at a slow pace but I’m almost sure that was merely for its own entertainment, I wouldn’t let it catch me off guard that way. In the space of two seconds it went from nearly 5 meters away to inches from my face, crouching to eye level with me. I froze. I couldn’t move, couldn’t speak, couldn’t breathe. It had me completely under it spell; I was a petrified rabbit caught in a hunter’s snare. It grinned at me and I pressed myself further into the wall- wanting it to engulf me know- it stared into my eyes, deep into my soul with so much hatred I wanted to scream but I couldn’t move my mouth, and what good would it do me anyway? Finally, it pulled its gaze away from my eyes and towards the candle, my eyes shot open as I darted to shield the delicate flame from its clutches. </p>\n\n<p>Everything went black.</p>\n</div>\n","author":"stuckaforkinasocket"}