{"rank":"795","title":"Self-portrait of the dead","id":"8mhskw","url":"/r/nosleep/comments/8mhskw/selfportrait_of_the_dead/","time":"1527428356000","body":"<div class=\"md\"><p>My mom hates her father. Grandfather Jack’s name might as well have been a swear word when I was growing up. Dad told me the story once, on the condition that I never tell mom I knew.</p>\n\n<p>Jack was married to my Grandmother Kathy for 22 years before he cheated on her. It wasn’t a midlife crisis or an intoxicated indiscretion either — he’d been going on fishing trips every other weekend for almost a year before Kathy figured out the fish was named Sally, and that she was half his age. Either dad doesn’t know the specifics or he wouldn’t tell me, but I guess Kathy decided suicide was a less sinful way out than murder or divorce. That was before I was even born, but mom hasn’t spoken a word to her father since. </p>\n\n<p>I still got to know him though. It took  8 years of his begging and pleading after I was born, but mom finally gave in and arranged for us to meet (using my father to deliver messages between them, as she ‘was afraid of what she’d say if they spoke’). I was pretty scared when dad told me we were going to drive an hour into the desert to visit grandpa Jack’s house, and mom only made it worse in the days leading up to the meeting. </p>\n\n<p>“He might be an axe-murderer by now for all I know,” Mom said. </p>\n\n<p>Dad said he’s a professor of art history. </p>\n\n<p>“Or maybe he’ll say nasty things about me. Whatever he tells you, I don’t want you to listen to him.” </p>\n\n<p>Dad made a joke about how I’ve already had a lot of practice not listening to my parents. Mom didn’t smile. </p>\n\n<p>“In fact, it would be better if you didn’t talk to him at all. Just let him see that you’re a happy, healthy, well-adjusted boy, and then go play by yourself until dad takes you home. Okay?” </p>\n\n<p>“You’re going to have a great time,” Dad told me on the way. “He’s got a whole art studio setup with everything you can imagine. Clay pots and sculptures, water and oil paints, brushes and tools of every size and shape — we can hang out all day if you want.” </p>\n\n<p>“Does Grandfather hate me?” I asked. </p>\n\n<p>“Of course not. He wouldn’t have kept sending letters all those years if he hated you. All he cares about is his seeing his grandson.”</p>\n\n<p>“Does he hate mom?” </p>\n\n<p>“Your mom is a saint. No-one could hate her.” </p>\n\n<p>“Did he hate Grandma?”</p>\n\n<p>Dad looked uncomfortable at that. “You’ll have to ask him yourself.” </p>\n\n<p>So I did. That was the first thing out of my mouth in fact. Grandpa Jack was a pudgy old man, straight bald with discolored blotches on his scalp, and a huge mustache that wiggled when he talked. He came rushing at me, arms wide for a hug, and I asked him if he hated my Grandmother. Froze him in his tracks. Dad stepped in front of me as if trying to protect me from being hit, but Grandfather Jack just squatted down to my height and looked me solemnly in the eye.  </p>\n\n<p>“I never loved any woman half as much as I did Kathy. Except your mother, of course. Just because two people love each other doesn’t mean they make each other happy though. I guess I just wasn’t strong enough to spend any more of my life being unhappy, and not brave enough to hurt your grandmother by telling her the truth.”</p>\n\n<p>He smelled like old spice, and that seemed like a pretty satisfactory explanation at 8. I let him show me his studio and we painted a big landscape together. He did all the hard stuff and the details, and he helped me transform every messy blotch I made into something beautiful without painting over my contribution. He asked if I was going to visit again, and I said I wanted to — as long as mom allowed it anyway. I’ve never seen a man go so red, so fast, his mustache bristling like a porcupine. </p>\n\n<p>“Your mother got no right to tell you anything. She can throw fits and slam doors all she wants, but you’re my family and the only thing left in this world I give a damn about. You tell her that, okay?” </p>\n\n<p>I didn’t get to visit as often as I liked, but at least every month or two dad would drive me out there. Mom was reluctant at first, but I convinced her that I wanted to be a painter and that she’d be crushing my budding dreams if Jack didn’t teach me how. I loved the landscapes, but Jack’s specialty was portraits and his passion for them soon rubbed off on me. </p>\n\n<p>“A good portrait only depicts the subject,” he told me once. “It’ll get the scruff on his chin and the wrinkles under his eyes and everything else that makes him who he is. But a great portrait —” here he took a long drink from his iced tea, liking to draw my attention out as long as it would go. “A great portrait is always a portrait of the artist. Doesn’t matter who he decided to paint, he put so much of himself into it that it’s going to tell you more about him than the person he’s painting.” </p>\n\n<p>Jack had a special gallery just for self-portraits. He did a new one every year, the passage of time immaculately mapped onto his many faces. Seeing all the paintings together like that, I couldn’t help but notice that every year his brow seemed a little heavier. His smile was a little sadder, his eyes a little more weary. I didn’t like seeing him change like that, and I told him so.   </p>\n\n<p>“Don’t you worry, I still know how to paint a happy picture. I’m just saving it for the year when your mother finally forgives me.” </p>\n\n<p>I told mom that too. She told me that he’d be better off figuring out how to decorate Hell. </p>\n\n<p>The self-portraits made me sad, but they didn’t start to frighten me until Grandfather showed me his latest work when I was 19 years old. </p>\n\n<p>“Where are your eyes?” I asked, staring at the blank pools of flesh dominating his latest portrait. The lines were more jagged than his previous work, making his sagging face seemed to be carved from marble. </p>\n\n<p>“Right behind my glasses, silly,” he said. </p>\n\n<p>“Why didn’t you paint them?” </p>\n\n<p>He studied the picture, seeming to notice for the first time. “Would you look at that,” he mumbled. “Doesn’t matter. You can tell it’s still me, can’t you?”</p>\n\n<p>More features were missing in the portrait next year. The whole face seemed to be sliding, almost as if the skin was a liquid that was dripping right off. He couldn’t figure out why I was making such a fuss over it. “Looks like me to me,” he grunted.  </p>\n\n<p>Shortly later Jack was diagnosed with Alzheimer&#39;s disease, and it was all down hill from there. He’d retired as a professor several years back, and painting wasn’t a hobby anymore — it was an obsession. Now that I wasn’t living on my own it was easier to visit him more often, but even in the span of a week he’d have finished three or four more self-portraits, each more disconcerting than the last. I don’t know why he even called them self-portraits — they weren’t even recognizable as human anymore. Just tormented flesh, grotesquely and unevenly contoured as though the underlying skeleton was replaced with a haphazard pile of trash. </p>\n\n<p>He’d get angry if I didn’t recognize him in his pictures. He said he was painting who he was, and if I didn’t see that, then I was the one who was blind. A few days later and he’d be excited to show me his next one, completely forgetting that the last one even existed at all. </p>\n\n<p>“When is your mom going to come see? I’ve been calling her all week.” </p>\n\n<p>He even forgot that she hates him too. Every time he’d ask, and every time I’d make a vague excuse and promise she’d be there next time. </p>\n\n<p>He was 86 when he had his stroke. He didn’t paint again after that, and within the year he was gone. Dad and I went to the funeral, but mom just locked herself in her room. Grandfather still left everything to her anyhow, saying in the will that “I may not be able to give her a home, but at least I can give her my house.” She didn’t want to even set foot in the place though, so a week or so later I went to start boxing up the stuff for her. </p>\n\n<p>That’s when I saw his final painting. I was dreading even going into his studio, and not just because I knew it was going to be the biggest job. I started stacking the abominable canvases face down so I wouldn’t have to look at them, but I couldn’t help but notice this one was different. </p>\n\n<p>It was so perfect that it could have been a photograph. The self-portrait showed Jack lying peacefully in his casket, hands crossed over his chest, eyes closed. It was strange that he’d been able to paint it so precisely though, considering the rest of his recent work littering the room. I sat there for awhile thinking how heartbreaking it was for him to predict his own death like that.</p>\n\n<p>I left the painting out while packing, thinking of hanging it in my apartment to honor him. There were plenty of less morbid pictures to choose from, but this one felt like it was really him who painted it, not the disease which had ravaged his mind. It made me think that his spirit was at rest somewhere, and that made me glad. I hung it in my bedroom that night, saying goodnight to him just as I’d done on the dozens of sleepovers where I’d lay my sleeping bag at the foot of his bed. </p>\n\n<p>I fell asleep quickly, exhausted from the manual work that day. I slept straight through the night, not even dreaming as far as I can remember. Then sitting up in the morning, the first thing I saw was Jack staring back at me from his portrait. The one that had shown closed eyes last night. Maybe it was like that yesterday and I didn’t notice, but that didn’t sit right with me at all. I remembered how Jack always used to get angry when I didn’t see the same thing as him in his pictures — maybe he was right and I really was just blind. I didn’t think too much of it until the next night when I woke up and the painting was screaming. </p>\n\n<p>No sound — I’m not that mad yet — but the mouth was open, twisted and frozen in unending agony. I just sat in bed, breathing hard, staring at the colorless torment in the weak light from my window. I kept lying back down and trying to convince myself it was a dream, unable to sit still for more than a few seconds before jolting upright again to stare at the painting. It took me almost half an hour to finally get out of bed and turn the lights on. I laughed out loud to see him sleeping peacefully in the casket with his eyes closed, but I still slept with the light on the rest of the night. In the morning, his eyes were unmistakably open once more. </p>\n\n<p>I didn’t blame Jack’s painting. I blamed myself for being blind like he always scolded me about. I called my mother and told her about my weird dream on her voice-mail. ‘Grandpa Jack is in pain’, I told her. I would have said more, but I felt stupid and hung up shortly after.  </p>\n\n<p>I didn’t actually hear the screaming until the second night, and by then it was already too late. </p>\n\n<p>Sometime in the early morning — I was out of bed and halfway across the room before I was even fully awake. The sound ripped me from my bed so fast that I didn’t even realize it was coming from the painting. There was enough light to see Grandfather’s features twisted in agony. </p>\n\n<p>My downstairs neighbor started pounding on the roof. That only seemed to make the screaming louder. The thrum of blood in my ears matched the beat, then raced passed. </p>\n\n<p>I tried to run, but my door handle wouldn’t turn. I didn’t struggle long — to stand by the door I had to be right next to the portrait and the sound was excruciating. </p>\n\n<p>Next I pulled the painting from the wall. Hanging beneath it was a second painting — one I’d never put there. One of the disfigured ones with its lump flesh all supported wrong from underneath. I saw this as a sign, although I was too freaked out to guess at what, so I hung the screaming painting back to cover up that abomination. </p>\n\n<p>Re-secured to the wall, I started to retreat toward the window. I never made it more than a step before a firm grip grasped my wrist and pulled me back. One of Grandfather’s hands no longer ended at the canvas. Cold pale skin, its nails digging into me, relentlessly dragging me back toward the picture as though through an open window. </p>\n\n<p>Now I was screaming too. Someone started hammering on my door. I tried to brace myself against the wall with my feet. The pale hand shook for its effort, but it was still stronger — inch by inch pulling me into his coffin. I almost wriggled free when his second hand shot out — this one catching me by the throat — to haul me forward at an alarming rate. </p>\n\n<p>I was so close I could smell him. Not the old spice cologne he always wore. My face pressed against the canvas, it smelled like rotten meat. Then I was through — I clenched my eyes shut, helpless as his cold arms wrapped around me. </p>\n\n<p>It was quiet on the other side. I couldn’t even hear my heart anymore. The pressure around me was gentle, like being encompassed by cool water or even a heavy fog. A moment later and the sensation was already retreating. I opened my eyes to find myself standing in my bedroom, facing the portrait on the wall. Hands folded across his lap, eyes closed, just like it ought to be. </p>\n\n<p>I spent the next half hour profusely apologizing to my neighbors. I’m lucky I didn’t get locked up. After that I called my mom, surprised to find her in tears. </p>\n\n<p>“Are you okay? Where are you?” I asked. </p>\n\n<p>“I’m okay. Dad’s okay. I visited him in the cemetery this morning. It’s stupid of me, right?” She paused to sniffle and blow her nose. “Do you think he knows?”  </p>\n\n<p>I told her I think he was pretty pleased about that, and that it made me happy too. I don’t know <a href=\"http://tobiaswade.com\">what would have happened to me if she hadn’t</a>.</p>\n</div>\n","author":"TobiasWade"}