{"rank":"251","title":"Trust me, it WILL destroy the world","id":"8mi2f2","url":"/r/nosleep/comments/8mi2f2/trust_me_it_will_destroy_the_world/","time":"1527431204000","body":"<div class=\"md\"><p>My employer is a very, very dangerous man.</p>\n\n<p>If he wasn&#39;t, perhaps I wouldn&#39;t be writing this, perhaps he&#39;d have been strangled, lying dead in the foyer of his 16,000 square foot mansion.</p>\n\n<p>Perhaps.</p>\n\n<p>But the reality is that I&#39;m writing this, cowering in a bush, desperately trying to get away from that creep.</p>\n\n<p>He ALWAYS wore a grey suit, and a red tie that was a bit too short and a bit too loose. He was also INSANELY paranoid.</p>\n\n<p>Have you heard of Qin Shi Huangdi? That man was the first emperor of China, and he was paranoid enough to sleep in a different room of his castle every night.</p>\n\n<p>He was also obsessed with finding a potion to grant him immortality.</p>\n\n<p>My employer and Qin Shi Huangdi are very alike. Both, powerful men, who want nothing more than to &quot;break&quot; their limitations and are paranoid enough to go to any extent to accomplish their goals.</p>\n\n<p>For the entire time that I knew him, I knew my employer by the name of Lee. He was too cunning to even provide us with a fake last name. Now I say US, because, remember, this is a 16,000 square foot mansion, so there were at least a few others involved in patrolling and &quot;bodyguarding&quot; the mansion.</p>\n\n<p>The mansion itself was a big, grey, Victorian sort of thing, located in basically the middle of nowhere. That&#39;s how Lee was able to change his address every day, without any neighbors noticing.</p>\n\n<p>Now I knew that was weird, but when you&#39;re paid 5 grand a day to essentially stand around and do nothing, you learn to keep your mouth shut.</p>\n\n<p>I imagine that if you&#39;re a cop, earning a measly salary, and you&#39;re paid double what you get in a year PER MONTH, you learn to keep your mouth shut.</p>\n\n<p>So you see, Lee had weaved an intricate web around himself. He&#39;d had himself COMPLETELY protected from all sides. There was nothing anyone could do to harm him.</p>\n\n<p>Nobody knew how he&#39;d made his fortune, but we had our suspicions. And with the number of shady dealers that entered and left the place, we had an inkling that he was a drug supplier.</p>\n\n<p>But if that was it, I wouldn&#39;t have really cared.</p>\n\n<p>After my first day, I saw the other guys looking at me, and then immediately looking away, hiding their faces. I still don&#39;t know whether they felt sorry for me, or if they knew that they were next.</p>\n\n<p>One by one, they all disappeared. And every time they did, there was another replacement.</p>\n\n<p>I don&#39;t know why he&#39;s kept me around for so long. There&#39;s been three complete rotations of staff since I joined. Everyone&#39;s disappeared. Everone except for me.</p>\n\n<p>Maybe he hates me, and that&#39;s why he&#39;s kept me around for so long: to watch me break down before he ends me. Maybe he likes me and sees a little of himself in me.</p>\n\n<p>Maybe.</p>\n\n<p>I didn&#39;t know what Lee was doing with them until yesterday. I was walking around, conducting my routine checks, when I stumbled upon him.</p>\n\n<p>I don&#39;t really know what his post is called, but the man reminded me of an opossum, a cunning little thing, but quite little and easily killed if you knew its tricks nonetheless.</p>\n\n<p>Now, the man used to watch Lee&#39;s &quot;experiments&quot;, and I suppose that&#39;s what drove him to insanity, and that&#39;s why I found him curled up in a ball murmuring to himself, and holding the tape that contained Lee&#39;s plans.</p>\n\n<p>I didn&#39;t hesitate to snatch up the tape and watch it.</p>\n\n<p>What I wouldn&#39;t give to go back and never do that again.</p>\n\n<p>You see, Lee had been training the other guards, breeding them for his &quot;ultimate test&quot;. The sicko decided that his new drug was &quot;the savior&quot; of mankind and wanted to test it out.</p>\n\n<p>Lee&#39;s methods were always the same, as I saw on the tape(it was a compilation of different guards). He&#39;d always tell the guards they were being let go, and then give them a &quot;final meal&quot;, where he&#39;d secretly sipped in the drug.</p>\n\n<p>I suppose it truly was their &quot;final meal&quot;, atleast as humans.</p>\n\n<p>The drug, called &quot;angel&quot;, would then go into effect, with each guard suddenly spawning black, crow-like wings, their limbs elongating, and their eyes closing to slits. Lee had been doing this for five years, and the only thing these &quot;angels&quot; ate was the drug itself.</p>\n\n<p>I now understand why that man lost his sanity. It&#39;s because yesterday, Lee finally reached his goal. He had over 50 &quot;angels&quot;, and he put them in a pen together.</p>\n\n<p>They fought savagely, like animals, ripping each other apart and devouring each other as though they hadn&#39;t had a meal in days. Finally, 10 &quot;winners&quot; turned back into humans and looked around, astonished at where they were.</p>\n\n<p>I heard Lee&#39;s voice cackling in the background, saying he&#39;d finally weed out the weak in Humanity.</p>\n\n<p>I&#39;m writing this because Lee doesn&#39;t just have connections with dealers. He has connections with everyone. </p>\n\n<p>In 2 days, &quot;angel&quot; goes global. Every major fast food company, frozen food company, drink company, etc., will have their food injected with &quot;angel&quot;.</p>\n\n<p>Every drug, antibiotic, and vaccine will have a small dosage of &quot;angel&quot; implanted in it.</p>\n\n<p>Lee knows the workers, the CEO&#39;s, and the politicians to make it happen. And he&#39;ll stop at NOTHING to make his paradise a reality.</p>\n\n<p>In two days, the world ends.</p>\n</div>\n","author":"LitLegend27"}