{"rank":"5","title":"Open Door","id":"8mih1h","url":"/r/nosleep/comments/8mih1h/open_door/","time":"1527435066000","body":"<div class=\"md\"><p>Moonless nights are common now, but that doesn’t make them any less dangerous. these nights aren’t the same as the ones before the Breach where simple cloud cover would obscure. These are true disappearances, a tangible cavity in the sky that would send shivers into any man foolish enough to look up.</p>\n\n<p>No one quiet knows what’s doing it, I met an old flesh peddler in the ruined highways of New York who claimed the Breach wasn’t just letting things through on Earth but the whole universe. Vast alien hands reaching out to grasp at whatever light shined through he said. Of course, some lights are harder to snuff out than others, though with each try it was becoming more likely that the moon would be gone forever.</p>\n\n<p>I don’t care much if it does go out for good anyway. There are things which prefer to hunt and roam on the pitch-black periods true enough, then again there are many threats at any other time. Plant-brides eager to wed again and again, Goat Nunneries who turn man to beast and mutants who’d lick the skin off people like a lollipop. It’s all bad is what I’m saying, a thousand ways to die and even more things worse than death.</p>\n\n<p>It all started with the Breach. Science experiment gone wrong. What happens when you smash the building blocks of the universe together time after time? The answer is things get damaged. Weaker. Bricks begin to crack, then perhaps something on the other side begins to notice, might even begin pulling those cracks open just a tiny bit wider. More fractures spread outward given time, and humanity is left living in a broken world with the company of interlopers from places best left alone soon enough.</p>\n\n<p>I was lucky enough to be a loner when things kicked off. I didn’t have any family or friends to lose like most folks. Some nights you’d hear people howling in such pain it’d make you wish it was the monsters shouting instead. I saw a woman shoot her two children with her last bullets rather than have them taken by the spiders. I gave the only kindness I could and cut her throat before she was used like an incubator. I was at no risk from the eight-legged freaks myself, they can tell bad stock from good. \nI wasn’t tainted by the fallout, nor did I have one of the bubbling plagues which left brains inflamed and bodies rotten bloated things. </p>\n\n<p>I was chosen to be an observer by the powers that be. My body and mind would be left alone by most of earth’s newfound predators and parasites, in return I would watch. A whisper would tell me where to walk, and after a day or a year I would arrival at some new site of horrible importance. I was a witness to the birth of the new Jotun in Alaska, the fall of the twice raised sheep messiah, I even saw the ocean turn into boiling blood once though that could have been a nightmare. Hard to tell the difference anymore.</p>\n\n<p>I don’t know for sure why it picked me. Maybe because where most people went mad I had stayed sane enough to appreciate just how bad things had got. Sorry this is getting so tangled up. I’m an observer not a story-teller. It doesn’t always like me sharing what I’ve been shown but I can’t let all this happen again. Even if my benefactor does punish me.</p>\n\n<p>It wants me to go somewhere else now, past the ruins of this world and somewhere new and fresh. I’m moving there now, each time the moon disappears I’m a bit further, a bit closer. I have a gut feeling that I’ll be there soon and I wanted to warn you. </p>\n\n<p>Don’t let anything in.</p>\n</div>\n","author":"Smooth_Establishment"}