{"rank":"76","title":"An Imaginary Friend 2: I had nightmares about my daughter's imaginary friends.","id":"8mijs6","url":"/r/nosleep/comments/8mijs6/an_imaginary_friend_2_i_had_nightmares_about_my/","time":"1527435751000","body":"<div class=\"md\"><p>I worked full-time at the tech company near my house. I didn&#39;t get enough time to spend time with my eight-year old daughter, Naomi, but somehow, when I got home from work, instead of saying &quot;Daddy&quot; and hugging me... Naomi&#39;s just in her room, talking to her imaginary friend, Dollface.</p>\n\n<p>She told me about Dollface: A young girl with black hair and a tuff of pink on her bangs. She had two ponytails, one pink and one black. She wore a pink and purple princess dress with pink slippers and white socks. The only thing that made me curious was when Naomi told me about her purple, buttoned eyes. They don&#39;t actually looked like button eyes from the Coraline movie, but they looked human, except the pupils were buttons now.</p>\n\n<p>I rubbed her head and chuckled, saying that it was fun to meet her, before walking out. My wife came home exactly five minutes after I came home and she usually ranted about her boss being a jerk. I loved my family. It was normal..</p>\n\n<p>However, one strange night, I was asleep on bed, I woke up at the sound of giggling that sounded like it&#39;s near, but when I woke up, there&#39;s no one there. I turned and saw my wife&#39;s bed empty and the bathroom light on from underneath the door. I thought it was her, but when I looked at the bedroom door... I saw her.</p>\n\n<p>Pink and black hair. Wearing a pink and purple princess dress. Buttoned eyes. It was Dollface. I was dreaming, yeah, and the description made my brain visualize and created an image that looked like Dollface, but I heard her talk in a similar voice. &quot;Five.&quot; I woke up from that dream after that.</p>\n\n<p>The next day, my daughter had a new imaginary friend. She told me his name was Nightcoat. He had a light-yellow coat and his hair was dark brown. He wore dark pants that matched the top part of his face. And that night, I woke up on an ocean of blood. I was on the boat, looking at the white eyes of Nightcoat. He had his hands closed and he stared directly at me before saying, &quot;Four.&quot; and I woke up. </p>\n\n<p>There&#39;s something wrong. I told my wife about the recent dreams I had and she suggested, &quot;Maybe you should call Dr. Stevens after work.&quot; I spat the coffee before grabbing my jacket and rushing to work. Work&#39;s getting worse, too. I began to yawn and sleep and my boss told me I should take a day-off. I couldn&#39;t say no, so I began to keep up and drink coffee. When I got home, Naomi told me about her other friend, Henry. He looked like a talking Jack-in-the-box with springy arms, green eyes, and a sharp grin. That night, I had a dream that I was at the circus, except no lions or kids around. Only Henry. He said while giggling, &quot;Three.&quot; and I woke up again.</p>\n\n<p>The next day, I decided to go to Dr. Stevens for some help. While telling these stories, he said, &quot;There must be a connection inbetween your daughter&#39;s fantasies and your reality. When they&#39;re counting down, that could mean that something will happen in the next two days. You need to talk to your daughter about this.&quot; &quot;Thank you, Dr. Stevens&quot;</p>\n\n<p>I went home once more and during dinner, I started to call for Naomi... And she told me about her imaginary friend, Mace. Blonde hair. two-colored (Red and Blue) face with a black stitch from the top of the bridge of his nose to the bottom of his chin. Wears a red and blue clown costume except the nose. Exactly the one from my dreams that night.</p>\n\n<p>The fifth day, I had enough. I sat on the couch next to Naomi, ignoring work and everything. &quot;Naomi, I had nightmares about your imaginary friends. They keep counting down and it drives me crazy about it. Can you tell your imaginary friends to stop what their pranks?&quot;</p>\n\n<p>Naomi smiled and speak in an echo. &quot;It&#39;s not a prank, Daddy; they were counting down the days when I go to The Orphanage.&quot; &quot;Excuse me?&quot; &quot;The Orphanage. A Heaven place for kids who died like me. Why did you wake up instead of asking? They told me that you keep on waking up after you meet them. I&#39;m always here, Daddy. But not real. Even Mommy&#39;s not real. My other Father, Chales, told me that I&#39;ll be like Dollface, Nightcoat, Henry, and Mace.&quot; She got off and walked to her bedroom. There was a blinding light before she looked at me, &quot;One. Good-Bye, Daddy.&quot;</p>\n\n<p>That day... That fifth day.... Was the day where my daughter and my wife had a car crash on their way to Naomi&#39;s school.</p>\n</div>\n","author":"G00s3bumps"}