{"rank":"8","title":"No escape","id":"8miml8","url":"/r/nosleep/comments/8miml8/no_escape/","time":"1527436488000","body":"<div class=\"md\"><p>“Creak, plup, creak...”</p>\n\n<p>I opened my eyes. I was blinded by the darkness. Feeling around me, i felt nothing but what felt like sand. dust or what i thought was dust fell into my eyes as i heard the continuous sound of “creak, plup, pulp”. </p>\n\n<p>Panic took over me as i didn’t know where i was. Fear paralyzed me. I lay there breaths ragged. I focused on where i was to try and calm myself. I forced myself to take deep breaths, covering my nose to stop the dust from entering. </p>\n\n<p>I am in a coffin, I’m in a coffin, a...c..of..fin. I started screaming and banging my hand against the top of the coffin. I screamed for what seemed like forever. I screamed until everything went silent. Tears ran down my cheeks. </p>\n\n<p>Every breath took everything out of me. I was running out of air. My time was almost up. I frantically searched for my phone in my pocket. Nothing. I closed my eyes trying to think rationally. I couldn’t. Anger filled my veins and i started screaming again. “Why me? Why me?” I screamed as i knew these were the last ever sounds i was going to make.  </p>\n\n<p>This is it. This is how it ends for me. No one will ever find me here. I am sure of it. I will just be another missing person’s case, without any answers. I dug my nails into a crack that i found. I could see a little bit of light as i pulled in the soil with my nails. </p>\n\n<p>I heard footsteps crunch the leaves in the distance. I started screaming for help using my last amount of air that i had. “HELP! HELP ME! I HAVE BEEN BURIED ALIVE! Help.. m..e </p>\n\n<p>I opened my eyes and i was once again blinded by the darkness. Barely having air to breath i felt my surroundings. I was still in the same place. I was suffocating now. Goodbye world. And with that, i took my last breath. </p>\n\n<p>“In here, in here”, i heard someone screaming!!</p>\n\n<p>“Are you sure?”</p>\n\n<p>“Hello? Is there anyone in there?”</p>\n\n<p>I looked back as my father, his eyes were disappointed looking down at me. </p>\n\n<p>“Son, you’re hearing voices again...?”</p>\n\n<p>I looked down at my feet. It sounded so real this time. But i didnt want my father to be disappointed so i shook my head and started to walk away. Telling him it was nothing. </p>\n\n<p>The screams had sounded so real, too real... i couldn’t sleep that night. The screams kept replaying in my head. I got out of bed, took a shovel with me and ran to the forest. </p>\n\n<p>I got to the same spot and started digging. Not long after my shovel hit a surface. I got down on my knees and dug my hands into the soil. There was a coffin... there was a coffin. Hesitantly i used the shovel to open the coffin. There was nothing but the bones of some small animals. </p>\n\n<p>“I lost it again... i am hearing voices once again...”</p>\n\n<p>Edit: hope you guys enjoyed. This was my first story in here ,sorry if its too short. </p>\n</div>\n","author":"feverless"}