{"rank":"0","title":"Dear Wife,","id":"8miv12","url":"/r/nosleep/comments/8miv12/dear_wife/","time":"1527438632000","body":"<div class=\"md\"><pre><code>                                                      11-31-2015\n                                               Hunter St, Lebanon\n</code></pre>\n\n<p>Dear Wife, \n I&#39;m sorry for what I did I didn&#39;t mean I to happen. I just got so angry at the time my mind just went blur.</p>\n\n<p>I love and miss u and the kids. I&#39;m Sorry, I&#39;m Sorry, I&#39;m Sorry, I&#39;m Sorry, I&#39;m Sorry. Tell me how I can make this accident up to.</p>\n\n<p>I want to see you and the kids even in the old fucked up place with your messed up brain. You abandoned the kids and now nobody wants us to see them up again.I&#39;m Sorry, I&#39;m Sorry, I&#39;m Sorry, I&#39;m Sorry, I&#39;m Sorry.</p>\n\n<p>I miss having you take care of me when I would be drunk, have a hangover, and when I was to be sick. I miss having you snug up to and when I can smell your hair.I&#39;m Sorry, I&#39;m Sorry, I&#39;m Sorry, I&#39;m Sorry, I&#39;m Sorry.</p>\n\n<p>I miss playing with the kids, like playing dresses with Rosina and Georgia, or playing ball with our son Samuel. I hate myself for not being there with them most of there life. I&#39;m Sorry, I&#39;m Sorry, I&#39;m Sorry, I&#39;m Sorry, I&#39;m Sorry.</p>\n\n<p>Please, Taylor, take me back let me back into the house with our kids. I&#39;ll stop drinking for good and we could happy normal family.</p>\n\n<p>I hate myself for what I did. please let me come bac</p>\n\n<p>Shit, I need to go the police are coming I can hear their sirens. I said all that I could say AnD I&#39;m not goiNGBCAKY TO jAil.</p>\n\n<p>Can you please tell them that I didn&#39;t kill you that I didn&#39;t throw that knife and that I love you.</p>\n\n<p>I don&#39;t care what they said about me having my fingerprints on it. You know why I had that knife was to pry it out of your head after you stabbed your self with it. They don&#39;t believe me. They don&#39;t believe me.  They don&#39;t believe me </p>\n\n<p>I called 911 after I came home that night from the bar. And there you were standing there with that shitty grin on your face, with bloodshot eyes. Covered in the blood of the kids. </p>\n\n<p>You stood there till you fell to the ground laughing and crying.</p>\n\n<p>You said, &quot; I couldn&#39;t live anymore and that I love you.&quot; \nThen you took the knife and stab your self with it in the head.</p>\n\n<p>I was partly drunk and I grab the knife from your head and threw it then I hug you for what seemed like forever. Till the police showed up I was taken to court and then I would be charging me with murder and abuse.</p>\n\n<p>I was supposed to be in jail for 121 years. After 14 years I escaped now I&#39;m being hunted like a fox in a fox chase.</p>\n\n<p>I never going back I&#39;m going o follow you in your footsteps and kill myself. You made me realized how much I miss you and love. I know this isn&#39;t what you want but its, what you get a life isn&#39;t fair.</p>\n\n<p>I can&#39;t live like this hiding and in fear, I&#39;m practically starving myself. I know I&#39;ll never see you guys again because you&#39;ll be in heaven and I&#39;ll be hell burning alive and be a wandering spirit forever.</p>\n\n<pre><code>                                                          Love,\n                                          Shit they dound me.\n</code></pre>\n</div>\n","author":"girl-her"}