{"rank":"35","title":"Our new family dog is starting to worry me--any similar experiences?","id":"8miw3y","url":"/r/nosleep/comments/8miw3y/our_new_family_dog_is_starting_to_worry_meany/","time":"1527438896000","body":"<div class=\"md\"><p>And to think I’m more of a cat person, anyway…</p>\n\n<p>Okay reddit, in all seriousness, please tell me that I’m not crazy. Or better yet, tell me that I am, because if my life in the last week has been real, then I think I am totally. Screwed. </p>\n\n<p>It all started when Jeffery graduated—that is, when Jefferey finished the 5th grade so that he could move onto the 6th.  He wanted a reward for all of his ‘hard work’ and had settled for several months on getting a dog. He pleaded. He pled. And as any responsible homeowner with a fondness for fur-free carpeting would do, I said no. Time and time again—no. I had a dog when I was a kid, and the experience wasn’t one I was looking to repeat. The thing sucked the life out of every room; literally, kind of, with its endless panting, but more so with its ruining of intelligent conversation. I swear. That freaking dog. I have numerous actual memories—bad memories—of adult relatives ignoring me at get-togethers so they could instead baby talk to an old black lab for minutes on end. Minutes!</p>\n\n<p>Anyway, my time with ‘Rosco’ (so creatively named) was cut short one summer when my family decided to rent a lake house. I think I went to play fetch with him on a dock and somehow he ended up drowning. I don’t remember the details. All I know is, after that, my sister began a policy of bitchiness that has lasted until this very day and my parents enrolled me in some kind of ridiculous therapy. As if I’d needed it. We never got another dog, and as far I was concerned, we were all the better for it.</p>\n\n<p>But wives have a kind of veto power that, somewhat like dogs, can suck the life out of every room if not eventually obliged. And so, I budged. And we got a dog. And it was little and loud and ugly (some bargain-bin Bichon Frise), and it left wiry hairs on top of all our furniture, and it did to the English language in our house the same thing it did to yesterday’s newspaper: pissed on it. But reddit, that’s not why I’m here. I mean, these are all bad things, shit things, but they’re not the weird things.</p>\n\n<p>I know this sounds crazy. But the night we got our dog, I woke up to a blanket that felt like wet fur. I’d just come to after the end of some dream—about what, I can’t remember—but I suddenly had the sensation of gripping something wet. When I moved my fingers, I felt what was unmistakably tufts of rough hair. Dog hair. My wife says what followed was a girlish scream; I say it was more of a reasonably surprised gasp. Whatever it was, the dog fur was no more. I’d shake it off as a nightmare, but for just one detail: my hands were still wet. </p>\n\n<p>And get this: next day, the kid and the dog play fetch in the yard. The kid throws the ball; the dog returns the ball. The kid throws the ball again; the dog returns the ball again. All is quiet on the Western, white-picketed front. Except one time, the dog takes a little longer coming back, and he’s got something hanging from his mouth that’s definitely not a ball. Its green alright, but too dark. And its stringy. I call out to the kid to see what he’s got, and what does he tell me? <em>Seaweed</em>. We live in fucking Arizona. The nearest body of water is two hours away.   </p>\n\n<p>Guys, I know—random occurrences and my own damn paranoia. You’re right. Maybe a few blades of grass just forgot what kind of species they were. Maybe a skydiver dropped his Korean salad on the way down. But I swear to you on the grave of my sanity: it gets weirder. </p>\n\n<p>The very next day, the dog disappeared. Just like that. Vanished. But hear me out: next morning, we get a call from the local pet shelter. The thing had walked itself to them. Like—they had seen it wait for a crosswalk sign across the road and then trot its stubby little legs right up to their front door. “Good day sirs, any rooms available?” I mean, what!? The thing had never even been to the shelter; we got it from a mill. The kid was of course willing to overlook any chance of demonic possession and took to hugging and kissing the thing with no abandon; the wife quickly followed suit. But when I tried to merely poke its now-dirtied hide it went all defensive and flashed me its teeth. And Jesus, when I tried to give the thing a bath later, it went full feral. Like, ancient wolf genes reactivated. In a Bichon Frise!</p>\n\n<p>I mean, I’m at a loss here, reddit. The thing even tried to run away again; we had to install an electric fence just to keep it from bolting at every moment. Not that it won’t still try, on occasion (and don’t tell Jeffery, but I do sometimes enjoy its efforts). If I didn’t know better, I’d say the thing was being…guided. Told to act, by some thing or some force. I don’t know. I swear I’m not superstitious. But tonight, after I’d made a late run to the store, I got the sense that the same force was watching me. Something suspicious about the shadows. Something primal about the feeling. I live in a low-crime neighborhood, but tonight the air felt thick with a kind of malice, now watching from a realm closer than natural law allows. Standing at my door, I only whispered his name. No living ears could hear it. But somehow he did. “Rosco”. And two eyes looked back at me. </p>\n\n<p>Oh god, reddit. What did I do? And what’s it going to do to me?</p>\n</div>\n","author":"eye_of_"}