{"rank":"7","title":"Great Cherokee Spirits Linger: Tom's Heart Vanished","id":"8miywl","url":"/r/nosleep/comments/8miywl/great_cherokee_spirits_linger_toms_heart_vanished/","time":"1527439579000","body":"<div class=\"md\"><p><a href=\"https://www.reddit.com/r/nosleep/comments/8hoyfh/great_cherokee_spirits_linger_the_screaming_storm/\">1</a>\n<a href=\"https://www.reddit.com/r/nosleep/comments/8j4nkv/great_cherokee_spirits_linger_they_shouldnt_have/\">2</a>\n<a href=\"https://www.reddit.com/r/nosleep/comments/8l5by8/great_cherokee_spirits_linger_the_sole_shell_lake/\">3</a></p>\n\n<p>Dustu Josiah Dalton had an entire garden of white flowers in his backyard. Though he grew other vegetables too, the number of these flowers was maybe two times everything else. I knew him as Dusty, and I knew his garden as strange. I’ve introduced you to Dusty and mentioned his garden already, but I’m reintroducing him because that’s essentially what happened to me. A few times, first when I learned about his brothers a year into our friendship, then when I heard the story of the Screaming Storm, and next when I learned that his garden was an attempt to escape his curse. The curse of surviving the screaming storm.</p>\n\n<p>First, I ask you stick with me for a quick story about these white roses, the Cherokee Roses.</p>\n\n<p>The Trail of Tears (yeah, finally getting to that, you knew it was coming eventually) started in 1838, and it’s said that the Cherokee mothers were so depressed on the journey that they neglected their children, some vanished off the trail, they might have been taken by animals (the dingo, after all, did eat her baby).</p>\n\n<p>The elders prayed to The Great Spirit, the Creator, Unetlanvhi, that night for a sign of hope in their darkest hour. The next day the Cherokee looked back on the trail. Growing from every spot a tear had touched the ground a beautiful rose now grew. The seven leaves on each stem for the seven clans, a golden center being the gold that was stolen from the Cherokee, the white being their tears, or maybe the white man who took that gold. Their ‘rose hips’,  the accessory fruit of rose plants much like grapes, are used in everything: jam, tea, soup, and wine.</p>\n\n<p>Dusty’s notes had several experimental recipes for a concoction of his own making using the Cherokee rose hips, he’d put it in most everything he drank. Even lemonade.</p>\n\n<p>Learning this is how I ended up in Kasey’s backyard, shovels in gloved hand, planting rose bushes and sweating bullets. It was the last day of Thomas Dalton’s life.</p>\n\n<p>The part of me that thought this is crazy, at the turnpike was gone. I hadn’t noticed it leaving, but I realized it was gone when I started to make a magic potion to save Jorge from Dusty’s curse. Then again, I thought, nowadays we still have magic potions and curses, we just call them medicine and disease.</p>\n\n<p>Kasey was startling clean shaven that day, making him look younger in spirit but physically older. He brought me in, offering me a glass of red liquid on ice. The second batch of Dusty’s medicine made with store-bought rose hips, rather than the specific Cherokee rose hips grown with fish fertilizer that Dusty used. It was borderline tea, the real thing would be thicker and made with Osage Orange, a bumpy, green fruit that you really shouldn’t eat on its own, as well as algae, wood from a putrefied stump, and Old Tobacco, or tso’ lagayo-nli. The first batch tasted a lot worse and it was even further from Dusty’s medicine, Witch’s Tea. Still, we handed it out to everyone to drink at The Cellar Dweller. That annoyed the employees until they saw their tip. </p>\n\n<p>Jorge, Kasey, and I chugged the whole thing in a single go, like pulling off a band-aid. Hank slowly nursed it throughout the night, and Tom simply refused to drink more than a few sips. He didn’t want the tobacco, he just quit smoking and was too paranoid he’d start again, no matter what we told him. </p>\n\n<p>An hour into digging and planting I felt the hairs on the back of my feet grow cold, my heart palpitated, my chest tightened. A random panic attack.</p>\n\n<p>I’m used to them now, but I wasn’t then. I sat on the ground with a thump, brushing up a cloud of dirt.</p>\n\n<p>Kasey noticed, bringing me inside to cool off.</p>\n\n<p>“Here, just take a break for a bit. Watch some,” He turned the old box TV on. “Family Feud.” He lingered for a moment, and went back to work outside. Just turning my head I could see him through a big window.</p>\n\n<p>I wish he hadn’t gone back outside, but I don’t blame him. Someone’s life was in our hands, the way we saw it, the second try at Dusty’s life. That was sure to stress us out, but it wasn’t what caused my attack. I didn’t know what did, but I was soon to find out.</p>\n\n<p>I stared out the window where Kasey worked just out of reach of a tree’s shade. My eyes traced the outline of the tree and quickly met with six blackbirds hidden on a branch. They were slender but big birds and a light shined off of their sharp beaks. Ravens. But they didn’t feel right, I saw six birds but I felt something more. I blinked, hoping something would adjust to normal, but behind my eyelids, I could see the remnants of a humanoid shape crouching in the tree. Like I was staring at a bright light for a minute and could still see a white ethereal outline, yet when I opened my eyes, it was simply six crows.</p>\n\n<p>I shut my eyes again, hoping to make out something in particular.</p>\n\n<p>Comparing the afterimage and the Ravens, I realized each raven lined up with a body part. Four limbs, and two eyes as large as its hands. I couldn’t tell where it looked, the form was too blotchy, but I knew it was looking at Kasey and me. It felt hateful, it felt worse than the things in the tunnels. Those didn’t attack until I got too close, this was a predator higher than us. And Kasey had no idea.</p>\n\n<p>I bolted up instantly, threw the door open and yelled at Kasey to get inside.</p>\n\n<p>“What the hell?” He asked as I pulled him in and slammed the door, locking it twice.</p>\n\n<p>“Look at the tree,” I whispered. “The Ravens”</p>\n\n<p>“What about them?” I didn’t respond, he’d see it soon. When he did, he swore and duck down, bringing me with him. “What is that?” He whispered.</p>\n\n<p>I was shaking, and I shrugged.</p>\n\n<p>Thump.</p>\n\n<p>We stifled our fear-filled reactions. We didn’t want to see it.</p>\n\n<p>Tap, tap, tap, tap, tap, tap.</p>\n\n<p>Six beaks rapidly tapped on the window. I was almost sure I would die that day. From my place just under the window sill, I could see a small part of the sky. It was dark grey and cloudy now. Just a minute ago there wasn’t a single cloud in the sky.</p>\n\n<p>Tap, tap, tap.</p>\n\n<p>It wouldn’t stop, in my head, I begged it to end. It only got worse when it started to whisper names, including Jorge’s now, it sounded as if it was right next to me, the blood drained from the entire left half of my body, my ear tingled, and then it hurt. The sharp words pressed right against my eardrum, the canal threatening to collapse. Each name was dragged out by each syllable to the point that I wouldn’t understand if I hadn’t heard it before, outside of The Cellar Dweller.</p>\n\n<p>With large, scared eyes, I looked to Kasey. He heard it too and his nose bled. The air pressure change…</p>\n\n<p>It said my name last. And it flew off. But we didn’t move for maybe an hour.</p>\n\n<p>That day was the first time we saw it. Not only Kasey and me, but Hank, Tom, and Jorge too. Learning this, I called for a meeting that night. Everyone showed up in under thirty-minutes, except for Tom. We started without him.</p>\n\n<p>Kasey poured out the rest of the tea, giving a glass for each of us and got a bag of chips to snack our nerves away. We stood in a circle in his kitchen, dim, tungsten lights shielding us away from the all-consuming darkness, mosquitoes, and June bugs outside. I only drank, I can’t eat when I’m nervous.</p>\n\n<p>“We saw it just out there while we were working. I still haven’t finished the job but… Well, a few bushes are planted at least.” Kasey explained, looking out the window.</p>\n\n<p>“I was at dinner with Carol. Something caught my eye across the street and I saw it on a roof when I shut my eyes. Didn’t finish eating, so I’m starving now.” Hank said, accepting the chips from Kasey.</p>\n\n<p>“I think I heard it last night.” Jorge started, slowly coming into the group. “something kept tapping, several somethings. When I looked there was nothing, but the tapping kept going from ten ‘till I left the next morning.” He shuddered. “I was separated from that thing by only a pane of glass.”</p>\n\n<p>“Here’s what I want to know, what is it?” I interjected.</p>\n\n<p>“Do you think it’s what… You know.” Hank avoided directly mentioning Dusty and, at times like this, the screaming storm.</p>\n\n<p>“I think so. Those screams…” Jorge paused, remembering the horror he went through at Shell Lake. “They sounded like ravens to me. Remember?”</p>\n\n<p>“Then what does it want? Why haven’t we seen it, or heard it, before?” I sounded hostile, I didn’t mean to, but I was on edge.</p>\n\n<p>“I don’t know.”</p>\n\n<p>There was an awkward pause as we were stopped in our tracks. We were fighting against- no, we were running from something we didn’t understand.</p>\n\n<p>“There was something else I heard…” Jorge admitted, breaking the pause.</p>\n\n<p>“What?” I asked, realizing he was waiting for someone to dig in, to push him, confirm its reality.</p>\n\n<p>“Our names… It was whispering our names. I thought it was in my head, I wanted to think this was something natural. But I know what I heard.” He shifted his weight to his heels, resting back on the counter behind him.</p>\n\n<p>“Shit…” someone said quietly.</p>\n\n<p>“What are we going to do..?” Hank asked no-one in particular.</p>\n\n<p>“Why didn’t it hurt us? Is it just fucking with us?” I cracked my neck from side to side, staring at the ceiling. Jorge’s eyes lit up, he put two and two together.</p>\n\n<p>“The tea. This is what it’s for. Like how sage is supposed to be spiritual, like a-</p>\n\n<p>“Like a ward.” I finished. “We all drank it. It couldn’t get to us. And we could see it. Not like before. We might have something over it!” I felt a wave of hope and relief wash over me, it wouldn’t last long enough though. I said “might” for a reason.  </p>\n\n<p>“Where’s Tom?” Kasey asked. I wish he hadn’t, as if that would change what happened.</p>\n\n<p>Tom’s red truck was found against a tree and he was found outside of his car, he’d gotten out in a hurry and only made it a few yards before he hit the ground, under normal circumstances, he could’ve survived. If we’d gotten to him earlier, he could’ve survived. If we’d made the tea taste better he might’ve survived. I wish I knew, but my revelations outlined in this part aren’t as definite as I thought at the time.</p>\n\n<p>We cried when we found out he didn’t. We yelled, furiously, it wasn’t fair. It wasn’t fair. We forgot about Jorge, who sat by the window quietly, he didn’t know how to feel.  He barely knew Tom, and when I thought about it, I didn’t get to know him as much as I’d liked to.  I wonder now if he saw it out there, on that same tree.</p>\n\n<p>Our tears were stopped for a moment when we learned the results of his autopsy.</p>\n\n<p>His heart was gone.</p>\n\n<p>It wasn’t ripped or cut out, there was no bloody gore, in fact, there was very little blood in his body, his heart just wasn’t there. His liver looked diseased, though he had no symptoms before. But what he did have was cancer. Lung cancer. It didn’t kill him but it was growing at an alarming rate when he died. </p>\n\n<p>We cried again when they mentioned a scar on his chest. Almost like a brand. A circle with two triangles coming from the top. A simply drawn bird and its wings. A raven.</p>\n\n<p>Images: </p>\n\n<p><a href=\"https://imgur.com/2PKoKs8\">One of the last roads Tom drove on</a></p>\n\n<p><a href=\"https://imgur.com/Y4kD3Om\">From Dusty&#39;s Notebook</a></p>\n</div>\n","author":"That_Guy_Of_Place"}