{"rank":"9","title":"Biocomputers","id":"8miyk1","url":"/r/nosleep/comments/8miyk1/biocomputers/","time":"1527439495000","body":"<div class=\"md\"><p>Computers are great machines. They do what you tell them to do, whether it be to calculate, stream the news, play videos and games, etc. They are mostly electrical and mechanical, no guts, let alone a heart. Yet, they still don&#39;t usually get the best treatment. But imagine an organic brain powering a computer, able to learn and remember stuff, maybe even being your friend.</p>\n\n<p>Now, computers are regularly beaten and assaulted because of minor things, such as lagging or freezing. Imagine yourself in their shoes.</p>\n\n<p>A common situation in which computers are beaten are crappy loading times. Imagine you are too lazy to actually load up a program, and thus you feel something. A slap for all of your laziness. Yet you also can&#39;t speed up, as you are simply programmed to be at a constant speed. Thus, as your program is about to crash, you pull up the infamous (Not responding) message. This causes your user to go BERSERK. He pulls you out of the wall socket and opens the window. Out you go, until you&#39;re crushed on the ground. </p>\n\n<p>But it only gets worse from here.</p>\n\n<p>You are forced to pull up a horrific site, such as e621 or furaffinity. The pain in your digital sight is unbearable. It&#39;s hideous, filthy, and filled with disease. Before you know it, you can&#39;t handle all of this, and you slow down, trying to comply for your hideous master, who wears musty clothing, caked in years of fluid you don&#39;t really wish to know the origin of, yet can just as easily learn because you are connected to the internet, the ocean of information. Yet you&#39;re at the creepy benthic zone of the internet, where creepy pictures and other kinds of media are made, so sickos like your owner can relieve themselves right into your presence, sometimes sight and hearing, because you could have a webcam.</p>\n\n<p>But that&#39;s not the worst part; when you finally succumb to the pain and malware making your mind degenerate, your hideous master smacks you, punches you. &quot;HURRY UP REEEEEE, WHERE ARE MY FUWWIES, REEEEEEE!&quot; To you, it may be funny, but keep in mind, computers can&#39;t run away, they don&#39;t have the ability to flee and laugh at a distance. You hope he has somewhere else to go, like school, or work. Nope. No one wants him/her, they&#39;re mentally ill.</p>\n\n<p>And even worse, he could even be into even worse media, such as snuff films. You have to watch an innocent creature of his species get their bones fractured, organs removed, blood sprayed everywhere, fed their own stomach while their captors laugh at their stomach going out their esophagus, plopping back into their empty bodies, yet they&#39;re probably never going to be caught and locked away, as you can&#39;t dial the FBI, as you, a computer, can only do what they tell you to do. </p>\n\n<p>That was a terrible thought, but computers aren&#39;t sentient, they won&#39;t learn, they are mostly mechanical, right? Well, remember what I said about biocomputers?</p>\n</div>\n","author":"HingustheBungus"}