{"rank":"3","title":"Monsters Are Real Part 4","id":"8mj98j","url":"/r/nosleep/comments/8mj98j/monsters_are_real_part_4/","time":"1527442051000","body":"<div class=\"md\"><p>Part 3:\n<a href=\"https://www.reddit.com/r/nosleep/comments/7pcaye/the_fairy_godmother_spoke/\">https://www.reddit.com/r/nosleep/comments/7pcaye/the_fairy_godmother_spoke/</a></p>\n\n<p>The voice was coming from behind the wall next to my bed. I wasn&#39;t scared, just intrigued. I rolled over and looked at the wall. Out of the corner of my eye, I saw it, set in the wall, just a few inches above the floor, was a vent. That had to be where the voice was coming from. My bed was close enough to the wall where I could hear the person talking to me from that vent.</p>\n\n<p> &quot;Who...Who are you?&quot; I asked quietly. There was a pause, then...&quot;My name is Aysha&quot; The voice sounded female, a girl about my age. &quot;What is your name?&quot; Aysha asked. Now I hesitated...But I told her &quot;I don&#39;t have a name, they only ever call me number seven, I&#39;m not sure why.&quot; </p>\n\n<p>No one had ever shown such an interest in me before, and certainly had never wanted to know my name and be my friend. I somehow knew I could trust Aysha. So I kept talking, and Aysha listened. </p>\n\n<p>&quot;I remember when I was in this room, inside the clear plastic bubble, there were other babies in the room. Maybe we all have numbers, like a series. I have never met any of the others, they don&#39;t let us talk to each other, and my tutors have to go away whenever they tell me too much.&quot; </p>\n\n<p>&quot;Aysha?&quot; I say this even quieter than I had been talking. &quot;I will be your friend.&quot; I was smiling, I felt happy for the first time in a long time. &quot;Thank you&quot; she whispered back. &quot;We can&#39;t let them find out, if they know we talk to each other, they will stop us somehow.&quot; </p>\n\n<p>I thought about this for a moment. &quot;OK. If they ask, I will just say I am talking to my Barbie.&quot; No response. Then...&quot;What&#39;s a Barbie?&quot; Aysha asks, after a minute. &quot;You don&#39;t know what a Barbie is? It&#39;s...a doll, but a grown up doll instead of a baby. She has pretty dresses and things. My favorite Barbie is Crystal Barbie, she has a sparkly dress, like the Fairy Godmother in Cinderella.&quot;</p>\n\n<p>There is another, longer pause. Finally, she says, I don&#39;t have any dolls. What is Cinderella, is that another story, like Puss in Boots?&quot;</p>\n\n<p>&quot;Yes, it is. Aysha, don&#39;t you have any toys, where you are?&quot; Pause. &quot;No.&quot; She doesn&#39;t elaborate. I think for a moment, then I slip out of my bed. I walk over to the doll house where there is another Barbie, one I don&#39;t play with anymore, since I got Crystal Barbie. </p>\n\n<p>I pick up the doll and walk back to my bed. Climbing over, I slip down on the other side, and get down on all fours where I can see into the vent.</p>\n\n<p>&quot;Aysha? Are you still there?&quot; Pause. &quot;Yes, I&#39;m here.&quot; </p>\n\n<p>&quot;I want to give you one of my dolls, because we are friends. You have to hide it though, so they don&#39;t find it. Is there a place you can hide it?&quot;</p>\n\n<p>&quot;Yes, I can hide it in the vent, I already have the cover off, so I can hide....stuff.&quot; </p>\n\n<p>I wonder for a moment why she pauses so much when she talks, but then I figure it&#39;s just a quirk. She asks, &quot;Can you take the cover off of your vent?&quot; I examine the vent cover for a moment. It has screws at each of the four corners; none of them are loose. &quot;No&quot; I tell her, disappointed.</p>\n\n<p>I hear a quiet sound from the vent, a quiet squeak, a muted thump, silence, and then a very quiet susserous, sliding sound. I bend down a little farther and peer into the vent, because it sounds like Aysha is IN the vent now, and crawling toward me.</p>\n\n<p>I jump back a little bit, startled, when something pokes through the slats of the vent, and falls to the carpet with a quiet thump.</p>\n\n<p>It&#39;s shiny. I pick it up. It&#39;s a solid metal tube, about the size of a pencil, and it&#39;s flattened on one end. I get back on all fours and look into the vent again. This time, the vent isn&#39;t empty. </p>\n\n<p>She is there, I can&#39;t make out any details in the dark, but I can see her dark outline, she is laying inside the vent, about a foot or so back. &quot;What is this? I ask, referring to the metal thing in my hand. &quot;A screwdriver, I pulled the handle of so it would fit through the slats. Use it to take of the vent cover, then we will be able to give each other....stuff.&quot;</p>\n\n<p>&quot;Oh, OK.&quot; She explains how to use the screwdriver to take off the vent screws. How clever, I think to myself. I&#39;m glad my new friend is so smart.</p>\n\n<p>After just a few minutes, I have the cover off. I kneel down and look into the vent. Aysha doesn&#39;t move. &quot;Aysha, come out where I can see you.&quot; Silence. &quot;Aysha, are you OK?&quot;</p>\n\n<p>More silence, then she whispers, &quot;I can&#39;t let you see me, if you see me, you won&#39;t want to be my friend anymore. I&#39;m ugly, I overheard them say so, they are scared of me. I don&#39;t know why.&quot;</p>\n\n<p>&quot;I won&#39;t think you are ugly or scary, I promise. Just come out. Here, take this Barbie. I extend my hand with the Barbie, into the vent. She is only about a foot away, so it brushes the top of her head. </p>\n\n<p>There isn&#39;t much light, but it looks like she is laying on her stomach inside the vent, with her hands curled under her and her head resting, face down on her hands, so I can&#39;t see her face or her hands. </p>\n\n<p>She lifts her head, and stretches out her hand to take the Barbie. It is not a normal hand. Yellowed, leathery looking skin, and long, thin fingers topped by talons. They are so long they curve under. They are thin, sharp, and blood red. </p>\n\n<p>They close around the Barbie, and around my wrist. I only have seconds to register all this information. I realize too late that I shouldn&#39;t have trusted this thing that calls itself Aysha.</p>\n\n<p>I next realize that she had her eyes closed the whole time, because now she opens them. Glowing red. No pupils, no irises, just blood red, ringed with yellow. It all registers in my mind, filling me with growing dread. </p>\n\n<p>Now I&#39;m afraid....too late. Her grip tightens on my wrist and as she begins to pull, I am immediately aware that she is a lot stronger than I am. Oops.</p>\n</div>\n","author":"I_am_number_7"}