{"rank":"38","title":"I Forgot I Made A Bond With A Djinn Years Ago.. pt. 1","id":"8mja8s","url":"/r/nosleep/comments/8mja8s/i_forgot_i_made_a_bond_with_a_djinn_years_ago_pt_1/","time":"1527442295000","body":"<div class=\"md\"><p>I can&#39;t even tell you when the time was that I first saw him. But I can tell you something else: everything you have ever thought to be physically attractive, is a lie. You have to meet a demon to be fully able to understand. </p>\n\n<p>See, demons are not what people tell you they are. They are the children of Lilith and Lucifer. Lucifer was an angel, and angels are breathtakingly beautiful on purpose. Lilith was the first ever female to roam the earth, perfect and gorgeous in every detail. Do you honestly think that an angel and the perfect woman would ever make ugly, troll-like creatures together? I know right? You can only imagine what a combo of those two looks like..well..I know one. Actually. </p>\n\n<p>It started with my own appearance. I wasn&#39;t pretty, I wasn&#39;t thin. I was now 27 years old and I had never even had a relationship. I had been involved in withcraft for a long time but I had never worked with demons before. I read something online abbout incubi and other demons whom you could summon as a substitute for a partner in your life. At the time I thought it was a great idea. So, I summoned one. </p>\n\n<p>His name was Dami. He was an Ifrit from Egypt. Beautifully adorned with all kinds of jewelry, all gold, a pitchblack skin and hair as white as the heavens. He smelled like nature. Like the trees. His body was muscular, he was tall, and the worst? He had the most beautiful smile. The kind of smile that you&#39;d see in guys adoring their girlfriends. </p>\n\n<p>And oh, how he adored me. I was his world. He looked at me and treated me like his queen. His demon queen. He fulfilled my satisfaction both sexually and romantically. All I had to do was summon him, and he&#39;d be there. We had a lot of fun over the years. </p>\n\n<p>However, I couldn&#39;t attach myself to him for some reason. I couldn&#39;t LOVE him. I just couldn&#39;t. There was something blocking that way. And I desperately wanted to love someone. I forgot about Dami and stopped summoning him. </p>\n\n<p>Strangely, four years later, I met Samuel. He worked at the bank down the road. We started dating and hit it off after a few months. I love him a lot and Samuel loves me. But I have a very unsettling feeling everytime I&#39;m with him. As if I&#39;m being watched..</p>\n\n<p>Yesterday (and this is the reason I come here to ask you guys) something strange happened. Sam woke up in the middle of the night covered in scratches. With my witchcraft background, I know a thing or two about psychic attacks and demonic attacks. This was definitely a demonic attack. </p>\n\n<p>The reason why I mentioned Dami before, is because he is the only demonic encounter I ever had in my life. So it must be him. But why is he attacking Sam? I haven&#39;t summoned Dami either.. or could it be something else?</p>\n</div>\n","author":"AnatolianPirate"}