{"rank":"3","title":"Our Cycle of Life","id":"8mjl6d","url":"/r/nosleep/comments/8mjl6d/our_cycle_of_life/","time":"1527444903000","body":"<div class=\"md\"><p>This is my third writing on the spirit world.  The three are:</p>\n\n<ul>\n<li>My Mind Control and Psychic Experiences</li>\n<li>Themes and Purposes</li>\n<li>Our Cycle of Life</li>\n</ul>\n\n<p>The writings presented here are a result of 16 years of working with a very powerful and accurate Psychic named Sue, who lived across the street.  She was psychic by the channeling method, meaning her spirit guide, or as some people call them, her “guardian angel” would take over Sue’s body and speak through her vocal chords.  She would keep Sue’s body functioning while placing Sue in a cocoon, so Sue could not know what was said by Mary, the spirit guide.  We were told not to touch Sue’s body while Mary occupied it, because it would harm the balance between Mary and Sue and might mean Sue would not be able to return to her body.  It was in this state that Mary could answer anyone’s questions or discuss problems they were having in their lives.  In addition, Sue had the ability to read people’s energy field.  I witnessed this many, many times in the 16 years.  I presented some of the more significant experiences in my first writing.  It was during my many sessions with Mary that the cycle of life was explained to me.  Some of the material presented here is a repeat of what I’ve presented before in my first two writings, I repeat them here for continuity and completeness of the story.</p>\n\n<p>We see God as a white light and we see sparklers leaving and returning to the white light. These are souls who wish to stay with God and to not experience the universe.  We do not normally see the white light in conscious life, but when in the “alpha” or meditative state or when we die. There have been times when people have died and then returned to life, such as during an operation or accident and after returning have mentioned seeing the white light.  Some of the sparklers do not return to the white light but spin off into space.  These are souls that chose to experience all of the universe.  One of our agreements with God is that once we make this choice, there is no quitting in mid-stream.  We must do it all, for as I’ve explained in my second writings, there are 44 themes and 44 purposes and it takes between 20 and 30 lives to complete one theme and purpose.  That’s a lot of lives.  When asked about this, Mary said that when you’ve completed all of this you have still only experienced a small part of God’s universe.  Wow!</p>\n\n<p>As a sparkle leaves the white light, it divides in two.  These two parts or souls, are the true soul mates of the universe.  They are the male and female part of the same soul and have the same basic personality and characteristics.  Soul mates are almost never down to Earth at the same time, but act as each other’s “spirit guide” while the other is on Earth.  The only time soul mates are down on Earth together is if they are here to do some special psychic work.  Soul mates do not deal well with each other when down here, because they are used to guiding each other.</p>\n\n<p>When on the other side we plan our next life.  We plan it like a tree, choosing parents that will program us into our theme and purpose.  All of the tree has the same theme and purpose.  All major events are planned, such as to murder or be murdered.  Many small events are random.  We plan seven exits into our life tree, so that if we decide to exit, we can.  These exits are not in our conscious mind, but are in our superconscious mind, i.e. that part of our brain that connects us with the spirit world.  The superconscious mind is accessible through the “alpha” or meditative state.  One of the exits is crib death.  If you experience a close call with death, that was probably one of your exits you decided not to take.  Death, when it occurs, is when we see the white light, a tunnel leading to the other side and our psychic family welcoming us or telling us to go back, it’s not our time to die, so we go back.</p>\n\n<p>The first thing that happens after going to the other side is we have a discussion with our spirit guide to review our previous life, that just ended.  We go over all the events and discuss where we chose good paths and where we chose poor paths.  Everyone goes to heaven even the worst, because they only choose to do bad things to experience them for themselves and to give others the experience of dealing with their bad actions.  There are no real sins and no punishment for them, because they are all part of the experience plan.  Suicide is the only action that results in a reaction, for it is a copout on our agreement with God, i.e., to experience all things good or bad.  Suicide is no way to avoid pain and suffering, because they are part of our plan. If we commit suicide, we are immediately returned to a situation worse than what we tried to escape.</p>\n\n<p>We spend about fifty Earth years on the other side or in heaven as some call it, hanging out with our psychic family, doing whatever we wish, and planning our next life.  Our psychic family generally is not common with any of the Earthbound families.  Sometimes one or two psychic family members will be with us to give us a grounding if we have had a particularly heavy load in the life we’ve planned.</p>\n\n<p>Many people wonder why our prayers are many times not answered, particularly when we are in deep pain or suffering.  That is because that pain, suffering or even death are part of our experience plan.  God will not interfere with our planned experience.  The same can be said about “Why do bad things happen to good people,” and the answer is, because they plan bad things to happen to experience them.  None of this makes sense to our conscious mind, when we don’t understand the big picture, but it all makes sense to our superconscious mind.</p>\n\n<p>We are almost all familiar with the Lord’s Prayer where it is said, “Thou shall be done on Earth as it is in Heaven.”  This will never happen, because if that were true there would be no reason for Earth to exist.  We would just stay in heaven.  Without the negativity of Earth, we wouldn’t be able to experience all aspects of God’s universe.  The Earth is one of the more intelligent places to evolve, but it is also one of the most negative.  Souls who elect to enter the Earth are in a hurry to evolve, experiencing things quickly. The Earth is more negative than it has to be, because of man’s ego and selfishness, which causes him to do more bad than is needed for evolvement.  It was also told to me that our understanding of God’s universe, puts us in preschool, not yet in kindergarten.</p>\n\n<p>This ends my discussion of our cycle of life, but I present a brief summary of six of my nineteen lives I’ve experienced with the theme of “tolerance” and the purpose of “builder.”  I experienced these past lives while in the “alpha” state.  While experiencing them you not only get the facts, but also the emotional feeling of the situation.</p>\n\n<p>Roman Slave</p>\n\n<p>About the time of Christ’s death on the cross, I was a Roman slave.  I had been captured in a battle and my job as a slave was to work in the Colosseum, cleaning up the dead bodies, body pieces, dead animals, blood and debris from the gladiator battles.  I was in my early twenties.  They would chain us up in the catacombs under the Colosseum at night and the rats would nibble on our ear lobes and fingertips while we slept.  Rat saliva contains an anesthesia that deadens the nerves, so you don’t feel the nibbling until they hit a major nerve ending.  I still cannot stand the sight of rats.  I just want to stomp them to death.  The guards would beat us at the slightest provocation.  I died at the age of 29 from shear exhaustion.</p>\n\n<p>Hungarian Hunter</p>\n\n<p>My next recall was in the 700’s AD.  I was a hunter of large game such as deer, bear, boar and wolves.  The village that I lived in was run much as tribal societies were, i.e. you didn’t work for yourself, you worked for the village.  Everyone in the village had a specialty, be it cook, pottery making, hide tanning, blacksmithing, etc.  It was a very rewarding life, but a very hard one.  Life expectancy was short and there were hard times when floods or droughts occurred.</p>\n\n<p>Spanish Nobleman</p>\n\n<p>About the time of Columbus, I was a Spanish nobleman in the court of the King.  It was a very exciting life, but also a very dangerous one because of the court intrigue.  You had to be on guard at all times because there was always someone who wanted you out of the way, so they could take your place.  I enjoyed the excitement of it all, including the court pomp and circumstance, but I had a particular problem.  All of the members of the court were married, but also had a lover.  Unfortunately, mine was the Queen, so although very rewarding, there was always fear of being caught and executed.  It’s interesting that previous life experiences can carry over into later lives, such as my hate of rats, and in this case my attraction to married women as a chance of an affair.  This feeling, although not strong, is something I’ve had to resist in my current life.</p>\n\n<p>German Soldier &amp; Farmer</p>\n\n<p>My next recall was as a German farmer in the early 1600s.  I was an old man and was standing outside my farmhouse, surveying my farm, the fields, the barn, the animals and the attractive countryside.  I had a very contented, warm feeling about my life.  It had been a good one.  I had a good wife and good children.  Earlier in my life as a young man, I was a soldier and fought many battles.  I loved battle even though these were times of great fear.  I found great excitement in hand to hand combat and loved to get the better of my opponent, even though it meant his death.  I’m ashamed to admit to this feeling of achievement, but I must tell the truth.</p>\n\n<p>Native American</p>\n\n<p>I was a Native American in North Carolina in the mid 1700’s.  I was in the forest with my dog and had been hunting.  I was about forty years old and was returning to camp with my kill.  I entered a clearing and saw our camp, but it was deserted.  Not a single sole was present.  I found this very disturbing, because it hadn’t happened before.  I decided to enter my teepee and wait for others.  While there I thought of my life.  The tribe was run by a council of elders.  Although I was well thought of by the elders, I was not one of the council.  As was the case with tribal societies, I hunted for the tribe not for myself.  I was also very amazed at how little we thought of our squaws.  They weren’t thought of as people, they were just there to serve the men.  My dog meant more to me than my squaw.  We weren’t mean to them, they just didn’t exist.  Obviously, nothing to be proud of by today’s standards, but again I tell it as it was.</p>\n\n<p>Civil War Soldier</p>\n\n<p>The next recall was my most detailed and exciting one.  I was a Cavalry enlisted man in General Lee’s army in Virginia.  I refer the reader to my first writings of this series called “My Psychic Experiences” where I give a detailed account of this life.  I summarize it here in case you can’t find the more detailed account.  I lived on a farm in Kentucky and we had slaves.  I joined the 3rd Confederate Cavalry on May 7, 1862 in Tennessee.  I served in the Virginia campaigns and was mustered out as a Sargent in North Carolina on May 31, 1865.  I returned to our farm in Kentucky, fought with my older sister about running the farm and left to work in a coal mine in West Virginia, where I died in a cave-in in 1879 at 35 years of age.  My name in this life was Samuel Clayton Stoner.</p>\n</div>\n","author":"mindcontrol3312"}