{"rank":"1615","title":"James Said There Were Giants There, I Wish That I Cared","id":"8mjoxg","url":"/r/nosleep/comments/8mjoxg/james_said_there_were_giants_there_i_wish_that_i/","time":"1527445821000","body":"<div class=\"md\"><p>There were giants that way. That was all James ever used to say. </p>\n\n<p>In the woods out back, down the path to the right, past the old sewer runoff, and into the clearing next to the skunk cabbage.</p>\n\n<p>There were giants.</p>\n\n<p>He would whisper it from his hospice bed. He was real good at that. James that was the type of kid that could tell a bedtime story so terrible, so shocking, that it made all the little hairs on your neck and arm prickle up like crazy. </p>\n\n<p>I am not so good like that, but I will try.</p>\n\n<p><em>They were three mean giants, and each was dirtier and nastier than the last one.</em></p>\n\n<p>The biggest one was the lady giant. </p>\n\n<p>James called her Big Red, on account of her long, matted red hair that was the shade of my bed sheets. She had a real crackly voice, and when James imitated Big Red, he coughed and gagged like he had some of her hair caught in the back of his throat. I always got a good giggle out of that. One time, James was so loud when he was doing the Big Red voice, Mom came into our room and turned the light on because she thought we were playing past bedtime. We laughed about that for a little while, but then she had to check on his medicine again.</p>\n\n<p>Big Red never wore any clothes. James said that was because there weren&#39;t any clothes in the  world that could fit her huge, gnarly belly. Her skin was gross too, like a saggy pint of old ice cream. James said that Red reeked so bad that he would know if she was coming from a mile away. She smelled like burning cabbage and old french fries, and when she talked; two long, lonely yellow teeth poked out of her mashing gums and pinched together. </p>\n\n<p>She was also, approximately, a gazillion feet tall.</p>\n\n<p>The next biggest giant was a man giant, and he could not wear any clothes either. The other ones called him Rippo, and he was a <em>trillion</em> feet tall. Rippo was the meanest giant, because once he got a hold of a boy he would hit him and hit him until the boy was forced to fall asleep for a little while. He had all of his yellow teeth left, and they were sharp like knives that could cut cut through your skin in a second. </p>\n\n<p>James showed me the marks.</p>\n\n<p>The last giant was maybe only a million feet tall, and the clothes he wore were real dirty and gray, and ripped all the over the place with weird patches. James called him Muscrat, on account of the fact his voice was always squeaky like a mouse. </p>\n\n<p>But Muscrat looked more like a cat. He was the best at slinking and sliding between the trees or making himself unseen. Muscrat reminded me of our housecat, Mellow, because both of them had really long nails. Every time those nails touched your skin, a thin red line would follow in it&#39;s path.</p>\n\n<p>James showed me those marks, too.</p>\n\n<p>I didn&#39;t believe him though, not really. One day when James was at the Doctor&#39;s office, Mom took me to the local library and found the biggest book on giants in the whole place. Mom was too sad to read it for me, but I got the idea from the pictures.</p>\n\n<p>There were never any real giants. Giants were make-believe; stupid stuff for kids and babies that lived only in stories and fairytales. Even still, the next day at school, I brought my giant book to class and told them all about the things I had learned. But when the teacher saw it, she just told me to read a more adult book and all the kids laughed at me.</p>\n\n<p>After a while, I got tired of James&#39; stories.</p>\n\n<p>Each night was a new chapter. Sometimes it was where they lived, or what they ate, or who they killed. I remember one night when he talked about how the giants used the bones of kids they ate as tools and decorations all around their old wood cabin. It was so scary and so detailed, but I still knew none of it was real.</p>\n\n<p>Soon enough, it was just downright stupid. How can you be scared of something you know is fake? Two library books had already told me the truth, and even my mom had caved and told me there was no such thing as giants. </p>\n\n<p>One night, I told James he was a baby and I did not want to hear his dumb baby stories anymore. </p>\n\n<p>Not long after that, he got a lot more sick. Mom promised it was not because of of our fight, but I did not believe her either. The doctors said the holes in his head were not healing right, and the little hospital in our house was not good enough. He needed to go to the city full-time. When he got there, we stayed with James each and every day and night, but the news was always bad.</p>\n\n<p>One day, Mom told me James wouldn&#39;t be able to talk anymore. I missed the stories after that.</p>\n\n<p>Another day, she said James could not smell. I wondered how he would smell the giants and know if they were coming.</p>\n\n<p>Then after that, James did not know we were in the room at all. </p>\n\n<p>On the last night, I cried in the hospital room and begged James to wake up. One more giant story was all I ever asked. He was so quiet and so still, and his chest moved up and down so smoothly it just seemed like he was sleeping. </p>\n\n<p>I told myself the doctors were idiots and he was fine all along. </p>\n\n<p>Maybe he was dreaming about the giants and could not wake up because he was fighting them in their kingdom one last time. But deep down I knew that was wrong. Deep down, I just prayed his eyes would open one more time.</p>\n\n<p>But nobody answered. The monitor beeped and beeped and beeped for a little while, and then it didn&#39;t. Mom took me home after that.</p>\n\n<hr/>\n\n<p>The next night, my mom had to take care of some things for James, and promised to not be gone for long. In turn, she made me promise that I would be a goood and brave boy. I told her that I would, but kept my fingers crossed behind my back the whole time.</p>\n\n<p>I was a crafty kid. </p>\n\n<p>Twenty minutes after she was gone out the front door, I was out the back door and into the woods. Down the path to the right, past the old sewer runoff, and into the clearing next to the skunk cabbage. </p>\n\n<p>I needed to see it for myself. Even to a six-year-old, there was something about that story that never felt right. James had never told anybody else where the giants were, or much about them at all. He said they would eat him if he ever did. But he trusted me with the truth, and it was up to me to find it out.</p>\n\n<p>It was dark. I never planned on it being that dark. There were no lights out there, but there was a full moon and clear sky behind it. I was lucky to have that, because without it I may not have been able to follow James&#39; instructions as clearly as I did.</p>\n\n<p>It was quiet. It was the type of quiet only the woods can provide, without the humming of electricity and car motors. It was so quiet that I could hear the sound of the campfire in the clearing from a long ways away.</p>\n\n<p>There were three people gathered around it. </p>\n\n<p>The woman had bright red hair. Her voice was loud and unmistakable as it crackled to her friends beside her. The man was massive, with a burly chest covered in hair that dipped down to his shoulders. The third was passive, hiding behind a tree just out of the light of the flames. They stood in front of an old cabin connected to a side street I had never seen before.</p>\n\n<p>I did not stay to find out more. </p>\n\n<p>James told me that if you took your shoes off and ran on the pine needles, the giants couldn&#39;t hear you. The dry ends of the leaves and brush cut my feet when I did it, but without shoes I was quieter than the forest itself. In minutes, I was at the already open back door and in the arms of my mother. </p>\n\n<p>I told her everything in a sobbing mess. About James&#39; stories every night before bed. About the giants, and everything I saw just seconds before. She panicked and called the police. It was not long before just about all of them were in our driveway and asking questions.</p>\n\n<p>An hour later, the officers swarmed an old cabin a mile from our property and three vagrants were arrested for trespassing, possession of narcotics, and as suspects in the murders of several missing children.</p>\n\n<p>None of it made much sense to me at the time.</p>\n\n<p>I told the policeman my story about James and the giants, and asked him whether he thought the three people were really monsters. He thought about that for a long time, and waited until my mom was out of the room before he could even reply.</p>\n\n<p><em>&quot;Sometimes, we put our pain into stories to make it easier to understand. But that doesn&#39;t mean the monsters are not real. The monsters are always real.&quot;</em></p>\n\n<p>After that, I started to see. Because those three never looked like giants to me. </p>\n</div>\n","author":"FirstBreath1"}