{"rank":"37","title":"Jane and John Doe","id":"8mjw5u","url":"/r/nosleep/comments/8mjw5u/jane_and_john_doe/","time":"1527447579000","body":"<div class=\"md\"><p>Everybody called them that so I assumed those were their names, its been years since I was a kid and they came to town but now seems like a good time to share this story.</p>\n\n<p>It was the winter of 1986 and as a rowdy child in a town with not much to do, I took it upon myself to investigate every strange occurrence as if the townsfolks life&#39;s depended on it. Whether it was the strange cat at the cemetery who&#39;s eyes changed with the weather, the gasoline smell coming from the city garden at night, or just the milk mans strange new moles (R.I.P Joel) I figured them all out in a matter of months. But this case was just too mature for my naïve little mind to understand at the time.</p>\n\n<p>It all began when this mysterious couple arrived. They checked in to the motel and provided zero means of identification, the owner of course didn&#39;t mind since cash upfront doesn&#39;t just happen every day. In fact this isn&#39;t a tourist town so they&#39;re appearance had everyone talking. My mom hated them and it didn&#39;t take me long to understand why, they seemed to be somehow connected to my father.</p>\n\n<p>On a grocery run with him we saw them and my dad immediately told me to head for the car while he grabs something quickly, did I listen? well of course! that&#39;s why I made sure to follow him at a safe distance. I witnessed them having what seemed like a serious altercation, which reached its boiling point when Jane touched my dad&#39;s arm while trying to calm him down. John was not having it so he grabbed Jane and stormed of.</p>\n\n<p>Later that night my dad left despite my mom insisting he&#39;d stay for dinner. He left in such a hurry he forgot his coat, as I snooped through his pockets like the investigator I believed I was I found a note, &#39;meet me at 7 tonight by the lake, love Sarah&#39;. A couple moments later I would go on to make the biggest mistake of my life, I asked my mom &quot;does dad know a Sarah?&quot;</p>\n\n<p>Maybe if I didn&#39;t ask that my mom wouldn&#39;t have inquired more, she wouldn&#39;t have taken the note I stupidly left in the coat and she definitely wouldn&#39;t have gone right off to find John.</p>\n\n<p>If I didn&#39;t tell her maybe they wouldn&#39;t have gotten divorced, and I wouldn&#39;t have moved away to live with my grandparents. If my mom didn&#39;t send me off to live with her sister and her cats &#39;for the time being&#39; I would&#39;ve known Sarah Peterson&#39;s body was found near the lake at approximately 6am a week later. I would&#39;ve known a few days after the news of this murder broke a gruff looking man came to town looking for Harry Peterson, who apparently owed him A LOT of money. Harry was nowhere to be found and is the prime suspect to this day. Maybe if I was just a little bit older I would have been privy to the fact Sarah and my father dated in college and she was even a guest at my parents wedding. As hard as my poor mother tried she could never be Sarah and that&#39;s just how it ends. </p>\n\n<p>32 years later my old senile dad came to live with me, since I couldn&#39;t just let him rot away at a home. Every night in his sleep he&#39;d mumble incomprehensible things but once in a while, if you&#39;d listen closely, you&#39;d hear him call for Sarah. </p>\n</div>\n","author":"whyshouldyouwakeup"}