{"rank":"40","title":"The room with the glass doors","id":"8mk00h","url":"/r/nosleep/comments/8mk00h/the_room_with_the_glass_doors/","time":"1527448507000","body":"<div class=\"md\"><p>I don&#39;t know if anyone will be able to see this or read this, but this is my last shot at being heard or found. I don&#39;t know what else to do.</p>\n\n<p>It all started around finals time in university. I had been cramming for days in my room but with 3 young siblings, it was hard to tune out their yelling. I eventually opted to take the hour long bus ride to the city library to try studying there.</p>\n\n<p>When I first arrived, there were groups of loud teenagers, likely skipping class; baked out of their mind, completely oblivious to the others around them. I spent a good few minutes wandering around trying to find a quiet spot where I could study in piece when I came across a glass room with a table and a few chairs. The door was unlocked and inside it was silent. Perfect, I thought.</p>\n\n<p>I put my books down and began to study. Periodically, I would look up for a bit and observe the people walking around. An older man with a cane browsing the erotica section, a young child with his exhausted looking mother chasing after him, two love-struck teens. It was quite amusing to people watch as none of them noticed I was there.</p>\n\n<p>It was about 8:30 pm and the library was ready to close, and the last buses about to depart from the nearby station so I packed my bags and started towards the door. But it was locked.</p>\n\n<p>I pushed and pulled but nothing happened.</p>\n\n<p>i was relieved when I saw a young woman walking by. She looked to be an employee as she was pushing a cart. I tapped on the glass windows of the room to get her attention. When that didn&#39;t work, I knocked. Then pounded. Nothing.</p>\n\n<p>Shortly after that, the lights went off and the library went cold. It was pretty scary, being locked inside the library past closing. I took out my cellphone to call my parents, who I knew would be annoyed about the predicament that I had gotten myself into, and the inconvenience it would leave them. The phone rang and rang, but they never picked up. Hell, it didn&#39;t even go to voicemail. I hung up and tried to send a text message, but the notification of &quot;not delivered&quot; came back.</p>\n\n<p>I tried for about an hour of contacting my various friends and family members, but no calls went through, all the texts failed.</p>\n\n<p>That was the first night i spent in the library.</p>\n\n<p>When morning came, I woke up in a daze. I saw people browsing the various shelves around me. Feeling relieved, I knocked on the glass and called out as the door was still locked. But no one so much as looked over. I tried to call the front desk but with no luck again, the call failed.</p>\n\n<p>I will spare you the rest. It has been 48 days of being locked in this glass room. I don&#39;t know how i haven&#39;t starved or died of dehydration yet. I&#39;ve watched some regulars walk past my window; the old man who comes weekly, the same teenagers who come often and express their love by making out against some shelves. But no one ever sees me. No one ever tries the door. It&#39;s like I&#39;m in another dimension. I don&#39;t know exactly how this happened, or how to get out.</p>\n\n<p>Like I said, I don&#39;t know if this will even be seen. Any attempts I&#39;ve made to post on my Facebook asking for help has seemed to get lost. I&#39;ve tried calling 911 but the call is never successful. </p>\n\n<p>I don&#39;t know how much longer I can stay like this. I have nothing but an English, psychology and physics textbook. </p>\n\n<p>Please, if someone, anyone out there sees this. Send help. </p>\n</div>\n","author":"Comishia"}