{"rank":"13","title":"The Creatures of the Woods: The Screaming Devil (Part 2)","id":"8mk3kx","url":"/r/nosleep/comments/8mk3kx/the_creatures_of_the_woods_the_screaming_devil/","time":"1527449401000","body":"<div class=\"md\"><p>For part one click <a href=\"https://www.reddit.com/r/nosleep/comments/8m7nt0/the_creatures_of_the_woods_the_screaming_devil/\">The Screaming Devil (Part 1)</a></p>\n\n<p>The following is a true story (you can choose to believe it or not). For the sake of keeping my own identity safe, I am going to use a pen name: Nikolai, or just Nik for short. I have a few other friends that will show up in these stories and to keep their identities safe, their names shall be changed as well. Some of the dialogue has been changed because I either have completely forgotten what everybody had said, or to protect myself. Now, with all that aside, why don&#39;t we jump on into this.</p>\n\n<p>About two weeks had past since our first terrifying encounter with a strange screaming creature deep in the woods. None of us had slept that night, nor did we leave the tent. I remember having the urge to go to the bathroom halfway through the night but I refused to go anywhere near the tent flap.</p>\n\n<p>When dawn did finally come the next day we looked through the mesh on the door, nearly having our young hearts broken. Strewn all over the forest floor was over twenty dollars worth in candy. We were all gloomy as we cleaned and packed up the campsite. All of us refused to speak about what had happened, though we were all clearly thinking about it. As I was picking up the scattered shards of a Hershey&#39;s wrapper, I noticed that a small trail led into the woods. I followed it and found that tucked underneath a log was my backpack, torn to shreds, and still containing a few untouched pieces of candy.</p>\n\n<p>When I brought the bag home I lied to my parents and told them that a gang of raccoons had arrived during the night and managed to rip apart my backpack. Surprisingly, they believed me right away. My mother said she had seen a small group of raccoons in the neighborhood not that long ago.</p>\n\n<p>I wasn&#39;t the only one that lied though. We all agreed to keep our encounter secret and tell no one. So, life went on. We got two weeks closer to graduating into the next grade, and I needed some way to relax from the stress. So, I set up a sleepover (&quot;bro-parties&quot; me and my friends called them) and had Anthony spend the night.</p>\n\n<p>We had done the usual stuff (play video games, watch movies, eat junk food, and so on), and never really gave a thought into doing anything else. Or at least, we didn&#39;t until I noticed one of my cats was staring out my window (which faces the woods) and began hissing loudly. Curios i reached up to pet him, thinking it would calm him down. Instead I simply frightened him and he went leaping into the air.</p>\n\n<p>After my cat darted out of the room Anthony turned to me and asked, &quot;What the hell does he see out there?&quot;</p>\n\n<p>I turned towards the window and shrugged my shoulders. &quot;Dunno. Maybe another cat?&quot; I scanned the wood line for any movement but nothing caught my eyes. Sighing I sat down and returned to my game (Forza Horizon 2 I believe, I&#39;m a nut for racing games).</p>\n\n<p>Anthony shifted beside me. &quot;Hey... um...&quot; He was quiet for a second before turning to me. &quot;Did you.. uh... Did you do any um, thinking about our camping trip?&quot;</p>\n\n<p>I was silent. I didn&#39;t want to respond, and I definitely didn&#39;t want to do any thinking about that awful screaming creature we encountered. &quot;No,&quot; I finally responded after several seconds had passed, &quot;I haven&#39;t thought about it at all.&quot; I knew it was a lie. Any time I wasn&#39;t thinking about school or video games, that... that THING was still in my mind as if had been glued and stapled directly to my brain.</p>\n\n<p>&quot;Well I have, and I tried to do a bit of research but the internet at my house got turned off. My dad was complaining that the price was to high and was going to....&quot; He shook his head. &quot;Look, is it okay if I use the WiFi here to look some stuff up?&quot;</p>\n\n<p>I shrugged my shoulders, so Anthony quickly pulled out his phone (something I was very envious of seeing as to how I was the only one in our group of friends without a phone) and began searching things. About three minutes into his search Anthony pulled out an earbud and handed it to me without a word. I took it and listened. The video on his scream was almost completely black, the only sign anything was playing was the noise coming through the earbuds.</p>\n\n<p>&quot;Okay, so I&#39;m outside and I&#39;m hearing what sounds like screaming,&quot; A voice came through on the earbud. The video was quiet for a moment, then, very faintly, there was a faint scream. &quot;There it is!&quot; The narrator said. &quot;I think its a fox mating call.&quot; The video was quiet again then another faint scream came through. At this point Anthony tapped the screen and fast forwarded the video about two-thirds of the way through.</p>\n\n<p>The screams instantly blasted in my ear, and though they sent chills up my spine, a single thought entered my head. &quot;That sounds nothing like what we heard,&quot; I said out loud.</p>\n\n<p>Anthony nodded, &quot;This sounds too...&quot; He sighed. &quot;Well, it didn&#39;t sound anything like what we heard.&quot;</p>\n\n<p>I looked at him in annoyance. &quot;I just said that.&quot;</p>\n\n<p>He returned the glare, &quot;Fine, if you&#39;re so smart, what do you think it sounded like.&quot;</p>\n\n<p>Now, I didn&#39;t have any words at the time to explain what I thought this creature sounded like, but the more I thought, the more I could describe it. The strange scream didn&#39;t sound like a single scream. Instead, it sounded as if several people were all screaming at once; thousands of voices all forced to share one common mouth.  Most of these voices that were overlapping were very deep and guttural. However there were also a few high pitched ones thrown in as well. Above all, this bizarre, multilayered voice expressed a joint emotion; pain and rage.</p>\n\n<p>I sighed, &quot;I don&#39;t know, but whatever it was certainly wasn&#39;t a fox or a person. It sounded like neither.&quot;</p>\n\n<p>&quot;But what did it look like?&quot; Anthony surprised me with the question.</p>\n\n<p>I remembered the tormented screams of pain and anger, but I had almost forgotten about the outline on our tent cast by our campfire. &quot;Uh... what do you mean?&quot; I asked. Anthony tapped something else into his phone for a moment then showed me. He had done a Google image search on &quot;The Rake.&quot; I stared in amazement. &quot;What is that?&quot;</p>\n\n<p>&quot;Its something called a &#39;Rake.&#39; Apparently it showed up on this site called Creepy Pasta.&quot; Anthony pulled his phone back to him. &quot;This picture was on a trail camera. It&#39;s apparently what people call a Rake. Long lanky arms, pale, and it walks on all fours.&quot;</p>\n\n<p>I nodded, listening to the description. I remembered that we did in fact encounter a creature with long arms that walked around on all fours. However, as I thought back to our encounter, I thought about the terrible wails that filled the forest. &quot;Does the Rake scream?&quot;</p>\n\n<p>Anthony looked at me. &quot;I dunno. Let me look.&quot; HE stuck both earbuds in and began searching around. It wasn&#39;t long before he took them out and turned to me. &quot;Okay, so there is supposedly videos of the rake screaming, but nothing sounds anything close to what we heard. At most, it sounded like a chimp.&quot;</p>\n\n<p>I laughed. For some reason the word chimp always made me laugh. It was something my dad always called me when I had done something goofy. I looked back at Anthony&#39;s phone and paused. &quot;Hey, pull up that photo again.&quot; Anthony did so and i stared at the photo intently. &quot;No, it cant be the Rake.&quot;</p>\n\n<p>&quot;Why not?&quot;</p>\n\n<p>I scanned the features of the photo. &quot;What we saw had no nose. It had no eyes. It was just a smooth flat face with a mouth.&quot;</p>\n\n<p>Anthony looked at his phone and after a moment he agreed. &quot;Did we find a new creature or something?&quot;</p>\n\n<p>I shrugged, &quot;Maybe.&quot; Just then, both my cats darted into my room. One of them dashed under the bed while the other one shoved himself behind the small crack behind my dresser. &quot;What&#39;s bitten you two?&quot; I asked in surprise.</p>\n\n<p>Anthony stood up, &quot;Dude, you have some weird cats.&quot; I agreed with him and decided to return to my game, wanting to forget about the creature we saw. But, it would not be so. &quot;Um... Nik?&quot; Anthony had walked over to the window and was staring outside.</p>\n\n<p>I sighed and put the controller down. &quot;What?&quot; I looked through the window, surprised with how dark it already was. The sun had dropped behind the hills and was casting a shadow over my house.</p>\n\n<p>Anthony seemed frozen in place, he pointed down at the ground. &quot;What is that?&quot;</p>\n\n<p>I stood up and walked towards the window in disinterest. I took a quick glance outside and sighed. &quot;I don&#39;t see anything.&quot;</p>\n\n<p>I was about to walk away but Anthony grabbed my shoulder. &quot;Look over there.&quot; He was pointing a little higher up, his eyes and finger facing the deep woods.</p>\n\n<p>&quot;What? I don&#39;t see anything. Just a bunch of trees and a garbage bag.&quot;</p>\n\n<p>Still, Anthony would not let me go. &quot;Look at the garbage bag again...&quot;</p>\n\n<p>I groaned. Sure, whatever Anthony was showing me was interesting, but so was my game. I looked at the garbage bag again. &quot;So what? It&#39;s only a...&quot; I trailed off. The garbage bag was moving, but not like it was being pushed by the wind. Only then did I realize that it wasn&#39;t a garbage bag. It looked like a person; a person that was walking around on all fours.  Anthony and I were both stunned. Without hesitation we rand downstairs and to the back patio. As I passed the living\\-room I recalled that my parents had gone out to dinner.</p>\n\n<p>Anthony stared around into the woods. &quot;Do you see it?&quot;</p>\n\n<p>I looked around. &quot;No, I have no clue where it is.&quot;</p>\n\n<p>He seemed frustrated. &quot;Come on! I saw it. You saw it. Where is it?&quot;</p>\n\n<p>&quot;I don&#39;t know. Its just gone.&quot; I sighed. &quot;We probably scared it off.&quot;</p>\n\n<p>Anthony looked into the woods. &quot;Do you want to look for it?&quot;</p>\n\n<p>&quot;Are you kidding me? There is no way in hell I&#39;m stepping off this patio.&quot;</p>\n\n<p>&quot;Well should we wait and see if it comes back?&quot;</p>\n\n<p>I stared at Anthony. I wanted nothing to do with this creature; I didn&#39;t want to see those lanky arms, that pale skin, that faceless head, those long, sharp, jagged teeth. I didn&#39;t want to hear that wail of pain, sorrow, hate and rage. But, I also didn&#39;t want to leave my friend behind. &quot;Fine, but the moment we see it, we split.&quot;</p>\n\n<p>&quot;Fine.&quot;</p>\n\n<p>So, we waited. And we waited. And we waited. It was well after sunset and the stars were in the sky. &quot;Well, it&#39;s not here. Why don&#39;t we go back inside?&quot;</p>\n\n<p>Anthony sighed. &quot;Okay. What should we...&quot; He trailed off and raised up a finger. &quot;Did you...?&quot;</p>\n\n<p>I gave him a look. &quot;Did I what?&quot;</p>\n\n<p>&quot;Shhh.&quot;</p>\n\n<p>&quot;What?&quot;</p>\n\n<p>&quot;Shhh!&quot;</p>\n\n<p>I rolled my eyes and remained quiet. After a few seconds I was about to say something again but then I heard it.</p>\n\n<p>&#39;Click\\-click. Click\\-click.&#39; My eyes widened and I mouthed words in curiosity. &#39;Click\\-click. Click\\-click.&#39; What was it? &#39;Click\\-click. Click\\-click.&#39; It sounded like it was coming from the woods. &#39;Click\\-click. Click\\-click.&#39; I nudged Anthony and whispered, &quot;What is that?&quot;</p>\n\n<p>He turned towards me, shivering slightly. &quot;It.. It..&quot; He took a breath. &quot;Do you remember what it sounded like when that thing walked by our tent?</p>\n\n<p>My mind went back to the event. &quot;Just weird breathing and the scream.&quot;</p>\n\n<p>&quot;But what about the tapping?&quot;</p>\n\n<p>&#39;Click-Click. Click-Click.&#39; I looked into the woods, recalling the strange tapping of claws on concrete. &quot;Yeah but...&quot; &#39;Click-Click. Click-Click.&#39; I stared into the woods. The tapping was getting faster and louder. &quot;Umm...&quot; &#39;Click-Click. Click-Click.&#39; &quot;Is it getting closer?&quot;</p>\n\n<p>&quot;Dude, don&#39;t say that.&quot; &#39;Click-Click. Click-Click.&#39;</p>\n\n<p>&quot;But it is! Listen.&quot; &#39;Click-Click. Click-Click. Click-Click. Click-Click.&#39;</p>\n\n<p>We stared at each other in horror. Part of me wanted to believe this wasn&#39;t real. I waned to wake up in my bed. I wanted to wake up and think that that past few weeks had all been a long dream. I wanted to forget that this creature even existed.</p>\n\n<p>&#39;Click-Click. Click-Click. Click-Click&#39; And then, just when I was sure whatever was making that noise was about to leap out at us... it stopped. It was so quiet that I could hear my own heartbeat ringing in my ears.</p>\n\n<p>&quot;Is... is it gone?&quot; Anthony asked me, barely even a whisper.</p>\n\n<p>&quot;Maybe. I think it...&quot; I trailed off. My eyes grazed across a foreign object sitting at the edge of the trees. I found myself frozen stiff, unable to even utter a whisper to tell Anthony what was there, but he clearly saw it too. Sitting at the edge of the trees was a pale figure. It had no face. No eyes. No nose. No ears. Just a halfway parted mouth, filled with jagged teeth.</p>\n\n<p>My mind was empty. I had no thoughts. Just fear. I stared at the creature, my heart beating thousands of times a second. I wanted to scream. I wanted to run, but i couldn&#39;t. My muscles seemed to have lost all connection with my brain as my eyes scanned this creature. &#39;Click-Click&#39; It took a step towards us, its long,skinny, lanky arms and legs slowly creeping towards us. &#39;Click-Click.&#39; It stopped again.</p>\n\n<p>Next, it did the very thing I hate. The very thing I had feared the most. Its jaws parted, growing further and further apart as if had come unhinged. Finally, it did it. It first started as a whimper. Nothing more than a faint gasp in the distance as if somebody had inhaled after having the head shoved underwater for several minutes, needing life giving oxygen. Then, a whisper. A faint trickle of sound, that slowly began to build up. It sounded as if a thousand voices were all building up, warming their vocal cords and getting ready to speak. Lastly, the scream. The howl of pain. Suffering. Hatred. Pure, raw, and awesome rage.</p>\n\n<p>I was snapped out of my frozen state and began running for the door. Anthony had done the same and was already pulling on the handle. as the door swung open I could hear steps pounding behind me. I refused to look back. We whipped inside and slammed the door behind us. Just as I began to turn the locks, something slammed the other side of the door. It bulged inwards at us with the ferocity of the smash. The creature screamed, banging against the door a few more times. Anthony and I didn&#39;t wait for it to hit it again. We ran to the stairs and up to my room.</p>\n\n<p>I slammed the door behind us. &quot;What the f**k!&quot; I screamed to myself.</p>\n\n<p>Anthony was pale. &quot;What is that thing?!&quot;</p>\n\n<p>I didn&#39;t respond, I only paced around my room, thoughts racing through my head hundreds of miles an hour. We both became silent, thinking to ourselves. After a while we began to calm down. &quot;I think we&#39;re fine.&quot; I told Anthony.</p>\n\n<p>He nodded. &quot;I don&#39;t ever want to see that thing again.&quot;</p>\n\n<p>I looked around my room. &quot;Where are the cats?&quot; Anthony pointed to the bed where a set of green eyes peeked out from underneath it.&quot;Okay, that&#39;s one, but where is the other one?&quot;</p>\n\n<p>&quot;Umm...&quot;</p>\n\n<p>I stared at Anthony. &quot;&#39;Umm&#39; what?&quot;</p>\n\n<p>&quot;I think I saw him in the living room.&quot;</p>\n\n<p>I growled to myself. I didn&#39;t want to go downstairs, but if this creature came into my house, I didn&#39;t want my cats to be harmed in the process. &quot;Can you come with me?&quot; Anthony gave me a look that told me everything. &quot;Fine. Just keep the door closed so the other cat doesn&#39;t get out.&quot;</p>\n\n<p>Anthony said nothing but did as I asked and closed the door behind me. I turned and stared down the long hallway, muttering to myself. &quot;Its fine. House is locked. It cant get inside.&quot; I crept down the stairway, ever so quietly. &quot;Echo.&quot; I called out to my cat. &quot;Echo?&quot; I expected Echo to do what he always did when he heard his own name. Normally, he would meow, yet, he was silent. &quot;Echo, where are you?&quot; I stepped at the bottom the the stairs and twisted around to face the living room. Then, I felt a slight breeze on my neck.</p>\n\n<p>I twisted around ever so slowly. When I turned around fully, a shiver was sent through my body. My front door was halfway cracked open. &#39;It was just the wind&#39; I already told myself. After all, the door handle was a bit screwy and the door would only remain shut when it was locked or propped shut. I went to close it when I heard purring from the living room. &quot;Thank god.&quot; I muttered and turned towards the living room, trying to find my cat through the darkness. &quot;Echo? Echo buddy, where are ya?&quot; The purring came from behind the couch that was propped in the center of the living room. I walked towards it. &quot;Dude, when I call you, at least respond like you usually do.&quot; I walked to the other side of the couch.</p>\n\n<p>I stopped dead in my tracks. Sure, my cat was there, purring, rolling around, and acting all cute. however something else was there too. The faceless and lanky figure that I was sure would haunt my nightmares was leaning over my cat and gently stroking him.I took a step backwards, my foot landing on what seemed to be the loudest and squeakiest board in the house. Its head darted up, its eyeless face staring right up at me. My cat didn&#39;t seem to notice, he was more worried about his cuddle session.</p>\n\n<p>Somewhat cautiously, the figure put a protective arm around my cat and stepped in front of him. I was stunned, unable to move. This creature was in my home. It was real, and it was moving towards me. The thing took very slow steps towards me. Its nails hit the hardwood floors making the &#39;Click-Click&#39; noise I was beginning to become familiar with. It crept even closer, its body coming into light cast from a nearby hallway. That&#39;s when I noticed it. On its left shoulder, a small pole stuck out. I suddenly realized that it was an arrow. An arrow was sticking halfway out of this things shoulder. The tip was lodged entirely inside its shoulder, and the edges seemed to be crusted by a blackish goo.</p>\n\n<p>The creature came closer to me, merely inches away. It made a huffing sound, as if it was debating something. Then, in a slow movement, it lifted up an arm and pointed a clawed finger at me. Its finger slowly began to press against my shoulder. I felt pain begin to radiate from the area where this creature was pressing its claw into me yet I remained still. Finally, I felt it. it wasn&#39;t much, only a light trickle, but it was warm. I glanced over at my shoulder where a small amount of blood began to well up through my t-shirt.</p>\n\n<p>The creature pulled his claw away. It then proceeded to gently pick up my cat and hand him to me. I took Echo gingerly and looked at the creature in curiosity as it began to head for the front door.</p>\n</div>\n","author":"Irat3Ch33tah666"}