{"rank":"0","title":"The Bathroom Man: A Short Horror Story","id":"8mk3on","url":"/r/nosleep/comments/8mk3on/the_bathroom_man_a_short_horror_story/","time":"1527449431000","body":"<div class=\"md\"><p>It was a stormy night. The thunder was very loud and it was a very gloomy day. This type of weather was very unusual for the city I was living in. I was in an apartment complex that had good rent deals. I was located on the 8th floor. The room number was 812. I was watching the last episode of the first season of 13 Reasons Why. It was getting very interesting until the TV turned off. I was angry at first. But then, I heard a noise within the bathroom. I was a bit nervous now. It was like a growl. I walked steadily into the bathroom to see nothing except a knocked over shampoo bottle and a slightly opened window. I didn’t think much of it and placed the bottle back on the marble shelf. </p>\n\n<p>Later, I was on my couch using Snapchat and talking to my friends. I was talking to my girlfriend until I heard the same noise again. This time it came from the bedroom. I stayed as quiet at possible in-order to not be noticed and be found by whatever made that noise. Eventually, I heard something crawl out of my room through the window next to my twin-sized bed. Once I didn’t hear anymore noises for the next 5 minutes, I took my personal belongings and raced out of the apartment room. After walking a bit in the corridor. I stopped running and walked a longs way. I was out of breath due to my poor stamina. The room next to me was 856. The walk to the elevator was long. This was because the elevator was next to 899 and not 801. The space between each room was longer than most apartment complexes.</p>\n\n<p>After 15 Seconds, I heard shuffling noises behind me and saw a figure that was tall and skinny. It was lanky. The figure had eyes piercing the long, dark corridor. It was very far away. It started  walking towards me. I started walking faster, trying get away from the figure. </p>\n\n<p>I was next to room 882 when the figure started running at me. I ran too. My stamina has never been the greatest, so I stopped running a few rooms ahead. I began to walk faster and faster after catching my breath. I finally made it to the elevator. I pressed the down button so I could leave the building. Then, something terrified me. The electronic screen on the frame of the elevator said “L”. That mean’t elevator was still rising up from the lobby. The figure was getting closer. It was only 15 feet away from me. I needed to distract the figure somehow. Luckily, something fell in another person’s room and the monster was lured away from my location.</p>\n\n<p>The elevator finally reached the 8th floor. I got inside and pressed the circular button that had a L on it. I realized the door of the elevator wasn’t working properly. It kept opening and closing but not closing all the way. I then heard the loudest footsteps anybody can ever hear. They were coming in my direction. I frantically pressed the emergency shut door button repeatedly. The figure was a good 1 foot away from the elevator door before it finally closed...........it still managed to get his hand in. The elevator started moving down and the monster got its hand out of the elevator.</p>\n\n<p>When I got to the lobby, I went to the front desk and reported the situation. They checked the camera footage and no one was there in the hallways and no audio files recorded “unusual” noises. They did call the police though. When they arrived, one of them asked me questions. \nI  remember one of the questions he asked me. He asked: “Do you take medication regularly?”. </p>\n\n<p>“Yes I do” I calmly responded</p>\n\n<p>Years later, I was arrested for murdering a man in an apartment complex. I was sentenced to 40 years in prison. I spend most of my days receiving therapy and treatment from physiologists.</p>\n</div>\n","author":"BigBlockStudios"}