{"rank":"2","title":"The Nightmares","id":"8mka1h","url":"/r/nosleep/comments/8mka1h/the_nightmares/","time":"1527450999000","body":"<div class=\"md\"><p>As I wake up from a nightmare and I thought why have I been having so many nightmares until now I didn’t know why. But in reality they were all about to come true.</p>\n\n<p>It all started only a few days after I started having nightmares. I was walking home from work thinking about this cute guy I work with named Sam. But than out of nowhere I heard a scream but from where I was nowhere near any houses or stores or really anything the closest place there was my work and only a couple of house in my neighborhood. </p>\n\n<p>So of course I call out “Hello are you okay” and no one responds. And I keep walking and I hear the blood curdling scream again I stop and walk toward the scream. But that was when it all started to happen all my nightmares I have been having started all to be true. As I walk toward the screams I stopped but I didn’t something else made me stop before I could go any further. And I had remembered this was really like the first nightmare I had. Where I was walking and hearing screams and went towards it but I don’t remember the rest.</p>\n\n<p>As I’m standing there not able to move something started to walk toward me but I couldn’t make out what it was. It looked like it didn’t have a face but had a smile the thing was tall but not too tall only maybe like 6’2 but was tall to me only who is 5’4. It walks toward me but stops right in front of me I can really see it now it has a great big smile on its face but it has no eyes or ears or nose only that great big smile that went from where one ear is supposed to be to where the other ear is supposed to be. It’s stares at me for awhile like I’m in some other world or dimension. But I know I’m not and thought I’m still asleep in my bed having another nightmare. But I wasn’t I know I wasn’t it looked at me like I’m some monster but I’m not at least I thought I wasn’t. I pulled out my phone and looked at myself and I saw it I was the monster I looked just like it. And that’s when I knew I was having another nightmare so I tried to wake myself but it wasn’t another nightmare It was reality. What ever that thing is I’m now one of them thinking to myself I hope it’s just another nightmare I just can’t wake up from. I fell asleep and woke up on the ground I fell asleep on but now I’m not a monster.</p>\n\n<p>I go to work at the end of the day I was walking home and thinking about Sam again. While walking home I see it again I see the monster but this time with some young children.I stood there and that thing killed them with in seconds I was about to scream and call for help but I couldn’t move again. I fell asleep and woke up went to work and did it all again.But walking home I saw more of the things with more young children. That keep happening until one day Sam was walking home and saw me frozen in place staring at the things. And that’s when he realized that he wasn’t going crazy I could see them too. He quickly picked me up and carried me far from there.</p>\n\n<p>I quickly regain consciousness and realized that he saved me. But why I asked “What happen why am I here” he quickly replied “Me and you can see that thing but only in different places I could see them in me car and the numbers got bigger” “You are the only one I know who can see them as well as me” I stood there for maybe a good few minutes thinking what has happen. I had said “Seen what” He knew in that moment I didn’t remember they had wiped my memory. But it only took me a few days to remember everything that has happen. But from that day on I haven’t got any nightmares.</p>\n</div>\n","author":"paigethefatpotato"}