{"rank":"0","title":"I didn't exist.","id":"8mkel7","url":"/r/nosleep/comments/8mkel7/i_didnt_exist/","time":"1527452123000","body":"<div class=\"md\"><p>I&#39;ve had a dream, a few days ago, about my ex girlfriend, that i treated like trash when i broke up with her, that tought me a lesson, that specific dream made a huge impact on my treat to girls, and basically on my life.</p>\n\n<p>All of the details about her, and my families, and our relation ship, are 100&#37; true</p>\n\n<p>Everything was Ok, i woke up to school, waited for my mom to make my nutella sandwich with coffee, and starting to walk to school, then i met my girlfriend at a specific spot we always wait each other on. My girlfriend loved me so much, she was just willing to do everything for me, and i didn&#39;t value it. When i was heading back home with my girlfriend, she asked, &quot;Would you mine helping me with my homework?&quot;, and since i was supposed to do those homework too, i said yes, we came to her place. We started doing homework, we were alone, her younger brothers was still in school, and her mom worked in two jobs so she wasn&#39;t home that much, and her parents are divorced while her father is a prisoner, he was a drug dealer, and killed a few people for unpaid deals. so basically it was just me and her.</p>\n\n<p>To be honest, being a 17 years old who always have girlfriends, and still a virgin, it&#39;s actually kind of humiliating, and i decided this is the time. </p>\n\n<p>After a while, i told my girlfriend, nicely, and with a attitude, would you like to take our relation ship one step further?</p>\n\n<p>Since i was a person of performing, and not only talking, i started to touch her, i knew she wasn&#39;t feeling good but still i knew she would do everything for me, and after i came home and went to shower, just when i sit in the bathroom, i got a nude from her, saying &quot;I love you&quot;.</p>\n\n<p>I didn&#39;t reply, i was busying jerking off and passing it to my friends.(Reminding, all this was a dream)</p>\n\n<p>The next day i came to school, hoping i would get a blowjob from my girlfriend, when we will head back to my place. But my girlfriend still yet arrived to the school, i texted her, called her mom, called her, did everything to reach her, but nothing. I thought about her all day, every day, for a week.</p>\n\n<p>When i suddenly, heard a voice coming downstairs from my dog, last time my dog made such a voices was when a thief broke into out house...</p>\n\n<p>I woke up, brushing my teeth... and then, no lights, nothing.</p>\n\n<p>When i searched for the electric room, where i could maybe fix it,  but when i opened the electric door, i got shot by a sleeping dart, waking up, almost paralyzed, shocked, cant even move, seeing my girlfriend hanging in her bathroom, completely naked.</p>\n\n<p>i was sitting on a chair, when i finally realized her father got away from prison by a guarantee. The room was empty with no living souls besides me, when i finally realized there is a note under my chair that says, count to 10. </p>\n\n<p>I was so scared, i couldn&#39;t even breath, and then...</p>\n\n<p>Her father came from no where, he hanged a rope looped on my neck,  and said, that&#39;s what happens to dick-heads...</p>\n\n<p>I was dead, seeing my view almost totally blurred, and of course, at the end, dead.</p>\n\n<p>How i remember every thing that happend in my dream?</p>\n\n<p>I don&#39;t really think i will ever forget that, i felt so many feelings at once, realizing i treated every girl like trash, i was hearting girls and using my looks to attract them, this dream was a traumatic case to me, but it did change perspective about life, and mainly people. </p>\n</div>\n","author":"Raliadnav"}