{"rank":"21","title":"The Soviet Luna Mission: Whatever became of the Cosmonauts?","id":"8mkh9x","url":"/r/nosleep/comments/8mkh9x/the_soviet_luna_mission_whatever_became_of_the/","time":"1527452772000","body":"<div class=\"md\"><p>Hey everyone, my name is Andrew. I’ve been working an internship with the National Archives and Records Administration in D.C. (USA) for a few weeks now. </p>\n\n<p>Normally I either scan older paper documents into the larger database, or I sort through already-scanned documents to figure out exactly where to sort them or if there was any error in previous scanning processes.</p>\n\n<p>This may seem like a boring job, but I’m a History major and this means that sorting through and reading all these documents are really fascinating (To me at least).</p>\n\n<p>So far I’ve just encountered old letters, drafts of military orders, meeting notes, and the like primarily regarding the US in both World Wars and certain periods of the Cold War primarily related to low-grade espionage. </p>\n\n<p>This series of documents I’ve recently come across is much different. They’re just, wrong. \nIt’s collected documents from some defectors from the Soviet Union in 1969, the group primarily consisting of scientists involved in their space program.\nI’ll post relevant/cohesive logs here, because some are just graphs and technical stuff that doesn’t really matter in the end.</p>\n\n<p><strong><em>Archive notice:</em></strong>\n<em>The events described in the collection of the following documents is to remain under the highest level of confidentiality. \nThis document shall be buried in dull archives and will not be necessarily locked away due to the nature of the events described as being exceptionally dangerous to risk any location being fixed. Previous events have mandated this due to the effect it has upon the reader, as well as unexplained phenomenon that influences readers to leak the documents contents.\nAny indication of these records being fully read by any person to the documents conclusion will be harshly dealt with, even if the entire document was not read to conclusion by the perpetrator. \nThe defectors who supplied these confidential documents from previously unknown project of the Soviet Space Program have been terminated due to irrational and dangerous behavior to themselves, others, and international security.</em> </p>\n\n<ul>\n<li>*** [Space reserved for brief overview of document]***</li>\n</ul>\n\n<p><em>Even a summary has been ruled as potentially dangerous and thus this template piece shall remain unused.</em> </p>\n\n<hr/>\n\n<p><strong>Date:</strong> May 28, 1961</p>\n\n<p><strong>Location:</strong> Director Offices annex to Cosmodrome 3, Kazakh SSR</p>\n\n<p><strong>Name:</strong> Vasilyev Christov Filippovich </p>\n\n<p><strong>Team/Group:</strong> Chief Foreman and Project Manager</p>\n\n<p><strong>Log Number:</strong> 1</p>\n\n<p>The American president has recently made a declaration to land American astronauts on the moon within a decade. </p>\n\n<p>This has sparked a desire in the Politburo to begin the Union’s own program to land on the moon, preferably before the Americans. Due to a wish to allow the Americans to work lacadasily on their rockets and training, it is mandated that all aspects of this new program be kept confidential on the threat of death. This shall be no issue, as all Comrades here have been thoroughly vetted for revisionist tendencies.</p>\n\n<p>I have been selected as the premier Foreman and Manager for the overall rocket project, and am immensely grateful that my labor and merits throughout the years in the Union have been rightfully rewarded with such an honor. </p>\n\n<p>This will serve as the initial log that documents the design, training, launch, and return of our brave Cosmonauts from their triumphant journey to and from the Moon. We shall show the workers of the world that it is only through the combined efforts of all persons within Soviet Socialism can they achieve the most, and that their liberal Capitalist oligarchy seeks to selfishly use the worker for the sake of enhancing the Capitalist’s prestige. </p>\n\n<p>The logs will not be only written by myself. </p>\n\n<p>The other departments, and their leaders, consisting of:</p>\n\n<ul>\n<li>Department of Worker Assessment; Alexandrova Tashka Dmitrievna</li>\n<li>Department of Psychology and Admissions; Alexandrova Tashka Dmitrievna</li>\n<li>Department of Engineering; Stepankov Matvey Petrovich</li>\n<li>Department of Communications; Afanasijovych Demydenko</li>\n<li>Department of Cosmos Satellites and Communications; Afanasijovych De</li>\n<li>Department of Logistics; Afanasijovych Demyden</li>\n<li>Department of Rocketry and Physics; ych Demydenko</li>\n<li>Red Army Specialist Detachment (No leader, collective responsibility)</li>\n</ul>\n\n<p>These departments will all contribute to the records as well, preferably with every update on the progress in their department. Only the Department Heads will record status logs, unless a lower-level member of said Department(s) obtain written permission from the Department Heads. Additionally, the Department Head is not required to read any status log written by lower-level members.</p>\n\n<p>Glory to the people, Glory to the Union, and Glory to the workers. </p>\n\n<hr/>\n\n<p><strong>Date:</strong> June 2, 1961</p>\n\n<p><strong>Location:</strong> Psychological Analysis annex to Cosmodrome 3, Kazakh SSR</p>\n\n<p><strong>Name:</strong> Alexandrova Tashka Dmitrievna</p>\n\n<p><strong>Team/Group:</strong> Head of Psychology and Admissions</p>\n\n<p><strong>Log Number:</strong> 3</p>\n\n<p>A list of candidates with potential to become Cosmonaut pilots for our landed Luna Programme has been completed. The criteria to be entered into the consideration-list for training and personal evaluation is thorough, and the most important points will be listed here for records:</p>\n\n<ol>\n<li>Involvement in the <strong>Young Pioneers</strong> organization with no record of misbehavior or early counter-revolutionary thought, public or private.</li>\n</ol>\n\n<ul>\n<li>* Exceptions were added during the selection phase for persons who displayed belief or potential for belief in counter-revolutionary ideas, but subsequently became a devoted and active member of the Party with no relapse into Capitalist Propaganda.</li>\n</ul>\n\n<ol>\n<li><p>Parents must hold a spotless record of activity, contribution, and participation in local Soviets; or, if strictly Proletariat or Agrarian, they must have never withheld their quotas, nor slaughtered livestock, nor sabotaged industrial equipment, nor stifle fellow workers’ assemblies or strikes. </p></li>\n<li><p>Near-perfect scores, marks, attendance, and ability at the University-level in the fields of one or more of the following:</p></li>\n</ol>\n\n<ul>\n<li>Physics.</li>\n<li>Engineering.</li>\n<li>Astronomy.</li>\n<li>Mathematics.</li>\n<li>Psychology.</li>\n<li>Chemistry.</li>\n</ul>\n\n<p>Devotion to the Motherland that is undying, and unquestioned. </p>\n\n<hr/>\n\n<p><strong>Date:</strong> June 6, 1961</p>\n\n<p><strong>Location:</strong> Library annex to Cosmodrome 3, Kazakh SSR</p>\n\n<p><strong>Name:</strong> Vasilyev Christov Filippovich</p>\n\n<p><strong>Team/Group:</strong> Chief Foreman and Project Manager</p>\n\n<p><strong>Log Number:</strong> 6</p>\n\n<p>The selection process of potential Cosmonauts is underway. </p>\n\n<p>The designs for our rocket that will take our Cosmonauts are swiftly being completed under the masterful work of the gather soviet of engineers, working diligently and after-hours </p>\n\n<p>I find it humorous for the general Directors of the project to still be bickering about it’s name. They cannot get a consensus to take the name <em>Proton</em> or <em>Soyuz</em>. I will track their progress so that we may all have a wonderful laugh after the Cosmonauts return, this heated-argument becoming a trifle among friends in comparison. </p>\n\n<p>The only department that is unwilling to share much of their logs is the Psychology and Admissions department. They have completed numerous logs, with the numbers increasing in the header each time I request one for log notes. As far as I know, I am the only one who has submitted logs and spoken openly about it. All other departments have declared themselves too busy with the Project to begin their logs, at least until later. </p>\n\n<p>The Crew Assessment and Psychological team have not made such declarations, and avoid the question entirely. I do not understand their need for secrecy, for they could give any number of explanations to why they must maintain utmost secrecy for their logs. So many easy ways to avert suspicion, yet they are almost goading me into a game of Cat-and-Mouse for they cannot help but hint at some nefarious purpose for their silence. \nI will look into the matter and further detail how it develops.  </p>\n\n<hr/>\n\n<p><strong>Date:</strong> June 7, 1961</p>\n\n<p><strong>Location:</strong> Director Offices annex to Cosmodrome 3, Kazakh SSR</p>\n\n<p><strong>Name:</strong> Stepankov Matvey Petrovich</p>\n\n<p><strong>Team/Group:</strong> Head of Engineering</p>\n\n<p><strong>Log Number:</strong> 7</p>\n\n<p>We are still awaiting a decision to be made on the name for the vessel. Comrade Filippovich could not keep a straight face in relaying the indecision of the Board of Directors. My crew have managed to contain themselves because we do not find it particularly humorous, but I suppose each person has their niche humor. </p>\n\n<p>We are on schedule to begin importing materials and supplies for crafting the vessel alongside the designs agreed upon. </p>\n\n<p>The crews work ethic is spectacular as we begin to organize ourselves and our tools, ready to begin the moment the materials arrive by train. There has even been an exceptional increase in the number of rail-yard workers, no doubt to ensure that the sheer magnitude of the resources to be unloaded does not slow down our efforts. </p>\n\n<p>The only issue we currently are having is a severe lack of vodka. If the state has yet to supply us with all the materials we need to get started, why not supply us with enough material to pass the time? Then again, I don’t suppose any quality of work will be completed if all of us work one-hour-shifts with eight-hours-nap-breaks and lunch-breaks for throwing up. </p>\n\n<p>I have been told to await questionnaires and interviews for the members of my crew from the Crew Assessment and Psychological team; no doubt to ensure we have the most competent and loyal crew. I am confident that every person shall be seen as a model comrade, and any spies will be uncovered and harshly punished. </p>\n\n<hr/>\n\n<p><strong>Date:</strong> February 13, 1962</p>\n\n<p><strong>Location:</strong> Psychological Analysis annex to Cosmodrome 3, Kazakh SSR</p>\n\n<p><strong>Name:</strong> Alexandrova Tashka Dmitrievna, </p>\n\n<p><strong>Team/Group:</strong> Head of Psychology and Crew Assessment</p>\n\n<p><strong>Log Number:</strong> 18</p>\n\n<p>After extensive efforts at scouring candidates who are shaped well for the our standards and subsequent personal interviews of said potential candidates, we have crafted a list of potential persons to begin the physical, mental, and overall fortitude training necessary to conduct this mission. Names will be withheld until the end of all the trials. Candidates include:</p>\n\n<ul>\n<li>Three Russians.</li>\n<li>Three Ukrainians.</li>\n<li>Three Poles.</li>\n<li>Three Czechs.</li>\n<li>Three Kazakhs.</li>\n<li>Three Hungarians.</li>\n</ul>\n\n<p>Efforts to promotion of non-Russian minorities has led our department to be mandated to selecting only one ethnicity from each group for the four person crew. The candidates have not been informed of these quotas, and will remain barred from knowledge of information on these logs as well as knowledge of the logs existence. The West shall see a unity of peoples.  </p>\n\n<hr/>\n\n<p><strong>Date:</strong> February 15, 1962</p>\n\n<p><strong>Location:</strong> Director Offices annex to Cosmodrome 3, Kazakh SSR</p>\n\n<p><strong>Name:</strong> Vasilyev Christov Filippovich</p>\n\n<p><strong>Team/Group:</strong> Chief Foreman and Project Manager</p>\n\n<p><strong>Log Number:</strong> 19</p>\n\n<p>I have been selected to undergo a psychiatric evaluation by our Crew Assessment and Psychological team. These have been told to be part of mandatory reevaluations of the current members of the crews as well as their leaders regardless of rank or seniority, and an effort to ensure loyalty, secrecy, and ultimate devotion.</p>\n\n<p>I am recording this log for posterity because I have asked various department heads outside of the Crew Assessment and Psychological team, and they have stated they have received no memorandums like mine for themselves nor their crew-members.</p>\n\n<p>Undoubtedly this is related to my previous critiques of the operations and clandestine nature of the Psychological team that seemed unnecessary and therefore raising questions of both ethics and adherence to non-liberal activity. </p>\n\n<p>I will continue to file my logs into the public record unlike the team that has called for my psychiatric evaluation so that it may be recorded that I have been open and honest patriot during the efforts to build-up this program. Furthermore, I hope that this record will serve as a method to bridge the divide between the rest of the teams and the Psychological team for the sake of united construction of this wonderous monument to the workers. </p>\n\n<hr/>\n\n<p><strong>Date:</strong> February 20, 1962</p>\n\n<p><strong>Location:</strong> Director Offices annex to Cosmodrome 3, Kazakh SSR</p>\n\n<p><strong>Name:</strong> Alexandrova Tashka Dmitrievna</p>\n\n<p><strong>Team/Group:</strong> Chief Foreman and Project Manager, titular head of Crew Assessment and Psychological Team until completed purges</p>\n\n<p><strong>Log Number:</strong> 21</p>\n\n<p>The former-comrade Vasilyev Christov Filippovich  has been relieved of his position due to his factionalist beliefs that threaten to disrupt the unity amongst true comrades who have poured endless amounts of their own willpower, blood, sweat, and strength into this magnificent project for the peoples of not only the Soviet Union but also for the workers of the world. His notes that sought to fabricate suspicion against the Crew Assessment and Psychological Team for the sake of allowing imperialist infiltrators in for sabotage, and this was given through his own written confession after the conduct of thorough interrogations. He remains under House Arrest with severe restriction on communication with anyone save for myself or those I sign temporary approval for.</p>\n\n<p>Due to the Crew Assessment and Psychological Team’s uncovering of this agent of capitalism before he could undo the people&#39;s work, I have been voted as the new Foreman and Manager for Project <em>Proton-1</em> through a consensus of both the current workforce and general body of Directors. This is a fantastic opportunity given to me to serve the people, the workers, and the Union and I am eternally grateful for it. We shall be conducting investigations of the broader staff. </p>\n\n<p>We shall root out these capitalist collaborates and subject them to the same interrogations and punishments that were and will be carried out on the former-comrade director. </p>\n\n<hr/>\n\n<p><strong>Date:</strong> June 2, 1962</p>\n\n<p><strong>Location:</strong> Psychological analysis annex to Cosmodrome 3, Kazakh SSR</p>\n\n<p><strong>Name:</strong> Larina Stesha Yakovna; Junior Doctor of Psychology</p>\n\n<p><strong>Team/Group:</strong> Worker Assessment</p>\n\n<p><strong>Log Number:</strong> 26</p>\n\n<p>With the promotion of the esteemed director of our department for her tireless efforts at preventing sabotage, I was promoted as Temporary-Director until Alexandrova Tashka Dmitrievna is finished with the important and exhausting task of rooting out all those on current staff who oppose the work and power of the peoples. I am eternally grateful for this opportunity to become more experienced with empowering leadership roles.</p>\n\n<p>The final selection of the Cosmonauts that will have the honor of manning the <em>Proton-1</em> vessel to Luna have finished, and I shall write the successful candidates down in the order of their both national origin and sister-republic location, then their names, and finally their gender:</p>\n\n<ul>\n<li>Russian SSR: Gusin Ustin Savelievich Male</li>\n<li>Ukrainian SSR: Dmytro Afanasijovych Sych Male</li>\n<li>Poland SSR: Szarlota Lubianska Female</li>\n<li>Hungarian SSR: Katona Kamilla Female</li>\n</ul>\n\n<p>Our intention was to select a diverse crew to exemplify the breaking down of national and ethnic barriers to show that all peoples may work and triumph together, but there was never consideration for also promoting the Marxist ideal of gender equality and the liberation of women. This is a welcome surprise and list of accomplished Cosmonauts that serve the empowerment of unity, stability, and the peoples. </p>\n\n<p>The failed candidates, who were still exceptionally talented, will be retained on the premises with a communication-blackout for outside Project contact for the sake of maintaining the secrecy of the Luna mission. They shall be added to the overall potential replacement index should any issue befall our current selection of Cosmonauts. They shall additionally receive commendation after mission success for their dedication, confidence, and skill despite their preliminary rejection.</p>\n\n<hr/>\n\n<p><strong>Date:</strong> January 6, 1963</p>\n\n<p><strong>Location:</strong> Staff residence annex to Cosmodrome 3, Kazakh SSR</p>\n\n<p><strong>Name:</strong> Stepankov Matvey Petrovich;</p>\n\n<p><strong>Team/Group:</strong> Head of Engineering</p>\n\n<p><strong>Log Number:</strong> 33</p>\n\n<p>I was severely mistaken about the integrity of the infiltrators I had first considered as fellow comrades and workers. Slightly over half of my departments original staff have been removed and subject to house arrest until after the completion and successful mission of Project * Proton-1*. The nefarious and clandestine abilities of these imperialist spies are great, but in the end even these skilled persons have been purged before they may harm the Project. </p>\n\n<p>I also thank the leadership for maintaining a vast list of potential replacements for all staff, including my own department of course. The original intention was to have available manpower should a comrade be injured, fall ill, or become burned out by the intense pressure of working for the benefit of all the Union.</p>\n\n<p>These replacements act differently than the former saboteur-staff. They are predominately silent and keep to themselves. They take rest and meal breaks with all of their fellow comrades, but they say little to nothing at all. I appreciate that this new staff seems to understand the importance of the task before them, their social sacrifice for repairing any sabotage by the spies, and dedication to labor without giving into unnecessary distractions. I cannot wait for this Project to be finished so that I may fully come to know these magnificent comrades, and celebrate our accomplishments together. </p>\n\n<p>Additionally, much more vodka has been supplied, that of which I am also grateful. </p>\n\n<hr/>\n\n<p><strong>Date:</strong> October 27, 1964</p>\n\n<p><strong>Location:</strong> Engineering annex to Cosmodrome 3, Kazakh SSR</p>\n\n<p><strong>Name:</strong> Alexandrova Tashka Dmitrievna, Doctor of Psychiatry</p>\n\n<p><strong>Team/Group:</strong> Chief Foreman and Project Manager, titular head of Crew Assessment and Psychological Team until completed purges</p>\n\n<p><strong>Log Number:</strong> 55</p>\n\n<p>I am pleased to record that the <em>Proton-1</em> shuttle, it’s landing pod, and return capsule have all finished construction in totality as well as having passed the rigorous tests performed on its rockets, computation, safety, redundancies, and all other systems. The shuttle has been completed far ahead of schedule and is a testament to the power and ingenuity of the unifying Marxist-Leninist ideology, as well as the immense efforts undertaken by the present staff. All staff involved with engineering the shuttle, its systems, as well as testing it shall receive distinguished commendation and awards for their selfless dedication.</p>\n\n<p>The training of the Cosmonauts will soon be completed; all that remains is rebriefing on the mission, education on its importance, and being shown the location of medical supplies and how to engage non-obvious redundant systems. Given the effort put forth by the engineering team, I have no doubt that the selected and talented Cosmonauts shall also complete their final conditioning ahead of schedule. </p>\n\n<p>Given these unexpected but welcomed developments, the launch of the <em>Proton-1</em> shuttle has been drastically pulled to a much earlier date, the previously intended date being July 17, 1969. Given the reported state and underdevelopment of the similar American-Liberal project, we shall accomplish our goal years before theirs. </p>\n\n<p>This is truly the beginning of a new and shining chapter of Soviet history, of the workers, and of the conquest of the cosmos by the combined efforts all peoples of the Union and the Zemlya.</p>\n\n<hr/>\n\n<p><strong>Date:</strong> May 19, 1967</p>\n\n<p><strong>Location:</strong> General Office annex to Cosmodrome 3, Kazakh SSR</p>\n\n<p><strong>Name:</strong> Alexandrova Tashka Dmitrievna, Doctor of Psychiatry</p>\n\n<p><strong>Team/Group:</strong> Chief Foreman and Project Manager, Head of Crew Assessment and Psychological Team until completed second purge</p>\n\n<p><strong>Log Number:</strong> 70</p>\n\n<p>Despite the setback caused by the sudden and severe illness of both Cosmonaut Szarlota Lubianska and Cosmonaut Gusin Ustin Savelievich, as well as the devastating passing of Cosmonaut Szarlota Lubianska due to unforeseen complications due to vile tuberculosis, we have still proceeded ahead of our original schedule. The backup Cosmonauts, restated here, have showed the same ability and talents as the comrades they replaced and thus completed training ahead of schedule:</p>\n\n<ul>\n<li>Kazakh SSR: Daniyarbek Akhmetev, Male</li>\n<li>Polish SSR: Władysław Bolda, Male</li>\n</ul>\n\n<p>The infection by tuberculosis that afflicted Cosmonaut Szarlota Lubianska was entirely. Upon return of the shuttle and the other Cosmonauts, the Cosmodrome 3 shall be renamed in her honor and the Politburo will discuss and selection additional monuments to this heroic Cosmonaut of unparalleled ability before being ruthlessly assassinated by cowardly imperialist agents. </p>\n\n<p>Due to the compromising nature of these previous developments and hard evidence of their perpetration, I shall enact another cycle of investigations, interrogations, and ultimately purge of these newer dissident infiltrators. The direct perpetrator will be summarily executed soon after capture, their fate sealed due to the severity of their crime against our Comrades and the Motherland. </p>\n\n<p>The launch of <em>Proton-1</em> is scheduled for tomorrow morning should weather remain clear. There will be an honor ceremony to see off these courageous Cosmonauts, as well as exceptional presence of both uniformed Red Army soldiers and covert agents of the NKVD.</p>\n\n<hr/>\n\n<p><strong>Date:</strong> May 20, 1967</p>\n\n<p><strong>Location:</strong> Observation annex to Cosmodrome 3, Kazakh SSR</p>\n\n<p><strong>Name:</strong> Alexandrova Tashka Dmitrievna, Doctor of Psychiatry</p>\n\n<p><strong>Team/Group:</strong> Chief Foreman and Project Manager, Titular Head of Crew Assessment and Psychological Team until completed second purge</p>\n\n<p><strong>Log Number:</strong> 72</p>\n\n<p>The <em>Proton-1</em> shuttle has successfully launched and has escaped the atmosphere of Earth</p>\n\n<p>The staff are all overjoyed with many crying with joy, popping open absurd amounts of champagne. Sometimes opulence is tolerated.</p>\n\n<p>While I do not like to deal with idealist rumors nor cooperation with our ideological mortal enemies, I have put much thought into what such a program would accomplish. I believe it may be used as an additional point that the world, it’s workers, and efforts can accomplish such greater things that subjecting all persons to competition can never hope to do. </p>\n\n<hr/>\n\n<p><strong>Date:</strong> May 23, 1967</p>\n\n<p><strong>Location:</strong> Rocketry monitoring annex to Cosmodrome 3, Kazakh SSR</p>\n\n<p><strong>Name:</strong> Alexandrova Tashka Dmitrievna, Doctor of Psychiatry</p>\n\n<p><strong>Team/Group:</strong> Chief Foreman and Project Manager, Titular Head of Crew Assessment and Psychological Team until completed second purge</p>\n\n<p><strong>Log Number:</strong> 74</p>\n\n<p>We have lost contact with the <em>Proton-1</em> vessel due to an unexpected, sudden, and devastating Solar Flare that was followed by a Coronal Mass Ejection. Despite a loss of contact due to communication equipment disruption, we still have the ability to track the vessel and it appears that this event and possible damaged guidance equipment has caused the vessel to divert from its planned route. </p>\n\n<p>Several calculations have been made, recalculated hundreds of times, and the projections have all been grim and alarming. Current calculations of the projected trajectory of <em>Proton-1</em> following this disruption and diversion have concluded that the most likely outcome is that <em>Proton-1</em>, and our brave Cosmonauts, shall pass around Luna and will be swung around by its gravity and their speed to a new course that will forcibly shoot the craft outside of the Solar System. Into the greatest unknown, the farthest beyond. </p>\n\n<p>This tragedy is only known certain members of the Communications Department, and the highest ranking authorities.</p>\n\n<p>There is no sabotage involved in this tragedy, I am sure of it. Every system, every algorithm, every redundant system, and almost every possible potential mishap gave the impression of a flawless craft, mission, crew, and systems. All was prepared for but the damned Sun. </p>\n\n<p>I take morbid peace with the knowledge that we placed more than necessary cyanide capsules in their medical supplies and informing them of that. We never thought they would need them whilst traversing the Cosmos, but rather if their return landing catastrophically failed due to the environment or their landing spot. I pray they take them soon, before the void claims them.</p>\n\n<hr/>\n\n<p><strong>Date:</strong> May 24, 1967</p>\n\n<p><strong>Location:</strong> General Office annex to Cosmodrome 3, Kazakh SSR</p>\n\n<p><strong>Name:</strong> Alexandrova Tashka Dmitrievna, Doctor of Psychiatry</p>\n\n<p><strong>Team/Group:</strong> Chief Foreman and Project Manager, Titular Head of Crew Assessment and Psychological Team</p>\n\n<p><strong>Log Number:</strong> 75</p>\n\n<p>After a period of mourning, I have returned to my duties and responsibilities with solemn vigour with the intention of honoring these now-lost Cosmonauts and preventing anyone outside the facility from being as devastated as us by these events.</p>\n\n<p>I am mandating debriefing for every single staff-member at this facility, those who frequently come-and-go, incoming railway and automobile delivery persons, and even to the dust in the lost Comrades’ forevermore empty bunks. This debriefing will include, but is not limited to and subject to alterations, the following measures:</p>\n\n<ul>\n<li><p>No celebrations or acknowledgements of any national or personal holidays (Including birthdays, successful workday celebration, and more) until an appropriate time of mourning and respect, with duration not yet determined, has passed after the recording of this log. </p></li>\n<li><p>No staff, including replacements and staff who do not have knowledge of this tragedy are prevented from leaving until adequate measures have been taken to ensure that they will not divulge this catastrophe to anyone after being allowed to return to their homes. </p></li>\n<li><ul>\n<li>This includes a ban on speaking in any capacity on this matter outside of this facility, even with staff members in any future setting or situation. </li>\n</ul></li>\n<li><p>Grief counseling shall be offered to all mourners who require additional support from their fellow comrades in coming to terms with these awful events. </p></li>\n<li><ul>\n<li>Such offerings shall be conducted by members of the Admissions and Psychological Team in their respective annex. This available for all staff, for any time so-long as it is scheduled with their reception office.</li>\n</ul></li>\n<li><p>Speaking to them about the incident is permitted, even after all staff are permitted to return home with the understanding that both situations are subject to confidential records of each session. </p></li>\n<li><p>Excessive drunkenness is prohibited during the mourning, and is no excuse for violation.</p></li>\n<li><ul>\n<li>One’s excessive drunkenness will up to the judgement of NKVD agents, Red Army guards, and fellow staff members; any report by staff members will remain anonymous to the accused. </li>\n</ul></li>\n<li><p>Religious services will be offered in the soon-to-be-constructed Orthodox chapel on the Launchpad, where a permanent vigil will be set up as well as a monument to the lost Cosmonauts courage and sacrifice. </p></li>\n<li><p>Logs henceforth submitted by any department or individual are subject to immediate review. </p></li>\n</ul>\n\n<hr/>\n\n<p><strong>Date:</strong> May 24, 1967</p>\n\n<p><strong>Location:</strong> Staff residence annex to Cosmodrome 3, Kazakh SSR</p>\n\n<p><strong>Name:</strong> Stepankov Matvey Petrovich;</p>\n\n<p><strong>Team/Group:</strong> Head of Engineering</p>\n\n<p><strong>Log Number:</strong> 76</p>\n\n<p>I cannot contain my grief for this tragedy. I feel wholly responsible for this outcome, for not taking all the necessary precautions I should have accounted for to ensure the full-safety of the brave Cosmonauts. </p>\n\n<p>I have been assured that there is no suspected sabotage that rendered any equipment nor system on the <em>Proton-1</em> more vulnerable to this Solar Flare. They also inform me that every aspect of the shuttle was in better than expected, and almost perfect, quality and ability. This has not softened the pain, and rather it has enhanced it. No outside sabotage, no noticeable system issues. I have no comfort in at least believing any sabotage was beyond my control. A lack of notable system, craft, or equipment issues only means that the possible many that existed were not noticed and therefore my unintended negligence must be to blame. </p>\n\n<p>Though I am a devout Socialist, and did everything in my ability to ensure the success of this mission, I have still failed and shamed my workers and comrades</p>\n\n<p><em>(Note: The following record was not a piece of the original recorded log, but it’s tone, timing, and references indicate it was written immediately after or during the log it is attached to. This is the first personal writing provided by the defectors.)</em></p>\n\n<p>I cannot decide how to achieve some measure of salvation through penance for this disaster. I may turn myself in to the KGB agents, but the process of receiving comfort from just punishment would be long and arduous without increasing any feeling of solace for my dreadful crimes against these Cosmonauts. I have also considered suicide as an honor-preserving option, punishing myself in the most powerful way for my transgressions. I believe it would show that I recognized my deadly blunders, and resolved to exact personal punishment rather than flee from this necessary rectification.</p>\n\n<p>That is what I shall do. I will take my own life to prove my understanding of my crimes, and show I am not afraid to undergo consequences by inflicted them upon myself due to my guilt. I was provided with a ceremonial handgun, a TT-30 that is reported as taking fascist lives in the conquest of Berlin, and I shall ensure it takes the life of one more monster. </p>\n\n<p>I shall do it soon as well, before the projected date of May 26 for when the Cosmonauts shall be hurdled into the cosmic abyss.</p>\n\n<hr/>\n\n<p><strong>Date:</strong> May 25, 1967</p>\n\n<p><strong>Location:</strong> General Office annex to Cosmodrome 3, Kazakh SSR</p>\n\n<p><strong>Name:</strong> Alexandrova Tashka Dmitrievna, Doctor of Psychiatry</p>\n\n<p><strong>Team/Group:</strong> Chief Foreman and Project Manager, Titular Head of Crew Assessment and Psychological Team</p>\n\n<p><strong>Log Number:</strong> 77</p>\n\n<p>Additional regulations have been adopted in the wake of the newer coping methods used by staff and directors. These regulations apply retroactively to any perpetrators who acted in defiance of these new regulations before they were adopted: </p>\n\n<ul>\n<li><p>Taking one’s own life will see reduced labor vouchers for the suicidal staffs’ family.</p></li>\n<li><p>Excessive alcohol consumption is permitted, provided one does it after 18:00, is in the presence of no more than two other staff members of similar inebriation as well as at least one sober staff member.</p></li>\n<li><ul>\n<li>Excessive alcohol consumption should also be confined to living spaces, recreational annexes, and personal offices.</li>\n</ul></li>\n<li><p>Grief counseling with the Admissions and Psychological Team is now mandatory and set at one every two days for all staff and directors.</p></li>\n<li><ul>\n<li>Meeting every day with the Admissions and Psychological Team will earn individuals increased rations as well as newly arrived recreational items and games. </li>\n</ul></li>\n</ul>\n\n<hr/>\n\n<p><strong>Date:</strong> June 2, 1967</p>\n\n<p><strong>Location:</strong> Rocketry monitoring annex to Cosmodrome 3, Kazakh SSR</p>\n\n<p><strong>Name:</strong> Fedir Afanasijovych Demydenko; junior assistant </p>\n\n<p><strong>Team/Group:</strong> Rocketry and Astronomy team</p>\n\n<p><strong>Log Number:</strong> 79</p>\n\n<p>I began receiving signals from what initially appeared to be an unknown object from beyond the inner orbits of the solar system one hour ago at 02:00. I had initially believed this was some reflective space debris or potential incoming meteor, due to it perfectly mimicking our departments cosmic detection broadcasts. </p>\n\n<p>At 03:00, the identity of this object became fully clear as it is travelling along the planned and intended return path, almost flawlessly, of our Luna shuttle. It is <em>Proton-1</em> returning home. </p>\n\n<p>I will alert my superiors. This anomaly should not have occured.</p>\n</div>\n","author":"EiplecOco"}