{"rank":"27","title":"The Thing in the Road","id":"8mkkxu","url":"/r/nosleep/comments/8mkkxu/the_thing_in_the_road/","time":"1527453663000","body":"<div class=\"md\"><p>This experience is real. Some of the dialogue is true and some was added because this experience happened a couple years ago. I don’t remember every sentence that was said. Other than that, this is legit.</p>\n\n<p>This experience happened with my former best friend. To protect his identity, I’ll call him Todd. We had an awesome friendship. We met in high school. We were both in band. It was an instant friendship. I took interest in him when I discovered he was into paranormal stuff as well. I was really intrigued when he told me he owned an Ouija board. Now that you have a little background, I’ll continue with this experience.</p>\n\n<p>This particular night started out pretty normal. Todd invited me to go stay with him at his house. We started out playing video games and eating loads of junk food. We ran out of video games to play, we found ourselves bored. I look at him, “Hey dude, what about the ouija board? We had a real experience last time. Maybe it’ll happen again?” He rolled his eyes and giggled, “I’m kinda tired of the board to be honest. How about we go for a ride and listen to some music?” I agreed considering I love car rides. I remember listening to throwback music such as Queen, Boston, AC/DC, and early 2000s music. We had the windows rolled down and we were singing as loud as we could.</p>\n\n<p>Everything was fun and normal at first. The music stopped when he turned down this old dirt road. Our phones didn’t have any signal, so YouTube couldn’t play. As I looked around, I didn’t see any houses or any sign of civilization. I look at him, “Dude, do you know where you’re going? I feel like we’re in the middle of nowhere.” Todd said, “I’ve been down this road so many times before. It’s fine, I promise.” He was my best friend, so I trusted him. At the same time, I couldn’t help but feel this eerie sensation. </p>\n\n<p>We had been on this road for a couple minutes. The atmosphere suddenly changed. I know he felt it too because when I looked at him, he was already looking at me. I could tell he was as scared as I was. I asked, “What are you feeling right now?” I said as I swallowed hard. “I feel a sense of dread.” He managed to say. Suddenly, he slammed on brakes. I looked at him and he was solid white. He pointed in front of the car. I looked to where he was pointing. As soon as I saw it, I froze. There’s was a black mass just sitting in the middle of the road. It had a human shape, but it was nothing but blackness. Keep in mind it was already dark on the road. Whatever this thing was, it was darker than the darkness outside. </p>\n\n<p>We were both frozen with fear. This thing stood up. I managed to say, “Dude we need to get the fuck out of here!” Somehow he managed to come back to reality and we floored it out of there. It seemed like we couldn’t get off that road fast enough. I was so scared I was in tears. We rode in silence for a few minutes. I asked him, “Have you seen anything like that before on this road?” He nodded his head no. “I’ve been down this road by myself so many times. I’ve never seen anything like that before. I don’t even know what that was or what to think. It’s safe to say I’m not getting any sleep tonight.” </p>\n\n<p>We never went down that road again. We never shared that experience with anybody else. We had been to local graveyard, haunted places, and used an ouija board. We never experienced anything like that before. I don’t know what might have happened if we didn’t leave when we did. And I don’t plan to find out. </p>\n</div>\n","author":"Lesbihonest_16"}