{"rank":"77","title":"A Love Letter for Artemis","id":"8mkqab","url":"/r/nosleep/comments/8mkqab/a_love_letter_for_artemis/","time":"1527454979000","body":"<div class=\"md\"><p>I met my first love at girl scout camp. </p>\n\n<p>I know it’s a cliche, but she wasn’t like other girls. In fact she wasn’t even like most other kids. </p>\n\n<p>Missy- that was her nickname, </p>\n\n<p>Most of the other girls didn’t really like her. Of course they tried, at least at first, but with her...moodiness, she was difficult to get along with. </p>\n\n<p>I was afraid of her initially- grungy clothes and scraped knees without bandaids. There was something intimidatingly harsh about her. Missy represented a world outside packed lunches and rides home from school in mom’s minivan. </p>\n\n<p>Then the fight happened. </p>\n\n<p>No one had seen what I had seen- a sharp tug at Missy’s short mess of hair, malicious whispers and snickers. </p>\n\n<p>They only saw the aftermath, or so they claimed- the other girl’s bleeding nose and smashed lip. Blood and tears and strawberry lip gloss smeared across her face, all clearly painting her as the innocent victim. </p>\n\n<p>I think my testimony was the only thing that allowed Missy to stay in scouts. </p>\n\n<p>The next week we left for camp. </p>\n\n<p>The first few days were the happiest days of my life. We climbed trees and played games and held hands when no one was looking. We went swimming in the river (even though we weren’t supposed to) and let our hair dry in the sun. Life felt like a cheesy romance film. </p>\n\n<p>One day, laying in a grassy clearing, Missy asked if the could tell me a secret. </p>\n\n<p>She looked at me, a serious expression on her face and something feral in her eyes.</p>\n\n<p>I said sure.</p>\n\n<p>Missy smiled slightly and looked up at the sky.</p>\n\n<p>“I want to fly.” she said. </p>\n\n<p>She turned back towards me.</p>\n\n<p>“I know it’s silly. But, more than anything in the whole world, I want to fly.” \nThough this desire seemed childish, something about her tone gave me the feeling that she had just imparted some sort of sacred knowledge upon me, that this simple fantasy was somehow a instrumental component of her very essence. I couldn’t say anything, and I could tell I didn’t need to.</p>\n\n<p>Missy broke the stillness, getting up to go fill her water bottle at the outdoor spigot. I lied back and looked up at the sky- it was so vast, in contrast the earth seemed small and confining. Listening to the cicadas droning and watching the clouds I began to doze off- </p>\n\n<p>A scream interrupted my daydreaming, cutting through the summer haze like a knife. </p>\n\n<p>I got up, dazed at first. Neglecting to put on my shoes, and ran to the spigot as fast as I could, brambles and thorns catching on my legs and my heart pounding hard in my chest. </p>\n\n<p>Missy held her water bottle in one white-knuckled hand and looked, terror-stricken, at the drain below it.</p>\n\n<p>Something was on it, but I couldn’t quite tell what. It was small and my eyes were unfocused. </p>\n\n<p>I stood for a second, trying to catch my breath, before crouching down to get a better look. </p>\n\n<p>“I...I think it’s dead.” she said before I could process what I was seeing. </p>\n\n<p>It was a bird, but it was hardly recognizable with its wings missing. Small clumps of bright red blood welled along the area where the skin had had been torn, and darker blood stained the ground beneath it. The bird didn’t move- it was dead, but the blood kept bubbling out. All I remember thinking was that it looked so small. </p>\n\n<p>We worked together to bury it, assuming that if our troop leader found out we’d be blamed. Neither of us wanted to touch it, so we eventually decided to pick it up together. </p>\n\n<p>“Well...I guess the bloods on both our hands now” I said nervously. </p>\n\n<p>Missy didn’t say anything. </p>\n\n<p>The next day another bird showed up. It was outside our cabin, it’s eyes were gone and it smelled rotten. I offered to help clean it up, but Missy said she could do it on her own.</p>\n\n<p>Eventually the birds stopped showing up, or at least I didn’t see them. I often noticed Missy waking up early and leaving the cabin. She’d have blood on her hands when she got back. </p>\n\n<p>When I asked her about it, she told be only that she’d been cursed, that this was her burden to bare. That was the last time we spoke. Her eyes looked different now. \nIt was the last day of camp, but Missy wasn’t there. The troop leader called the police to report her as missing, and told us to stay put.</p>\n\n<p>Of course I didn’t listen to her.</p>\n\n<p>The forest wasn’t especially difficult to navigate, especially after spending the last two weeks doing nothing but exploring it.</p>\n\n<p>I checked all the places I could imagine she would be- her favorite climbing trees, the river, the pond.</p>\n\n<p>I found her in the clearing. Or rather, above the clearing, hanging from a branch. At first it looked like she was floating. It must have happened recently, she looked so alive. A fly buzzed around her head. </p>\n\n<p>I’d like to be able to say I screamed, or cried, or even that my heart thumped just a little bit faster than usual.</p>\n\n<p>But in all honesty I don’t know what happened. </p>\n\n<p>The doctors said it was shock, though I’m not entirely sure if that’s how I would describe it. I was sad and scared and even slightly angry, but there was also a distinct sense of calm in my haze of emotions. </p>\n\n<p>Years later, I’m still not sure what happened. They said it was suicide, but I still have so many questions. And the bird wings I’ve been finding only make even more.</p>\n\n<p>All I know is I wish I could fly. </p>\n</div>\n","author":"AdelaideOfThePasture"}