{"rank":"13","title":"Document No. 85-4-17-6-32: You and I.","id":"8mkuq7","url":"/r/nosleep/comments/8mkuq7/document_no_85417632_you_and_i/","time":"1527456095000","body":"<div class=\"md\"><hr/>\n\n<p><em>You found it.</em></p>\n\n<p><em>the splinter in your mind, stabbed in place by someone who loved You, its fibrous barbs imbedded in your every thought.</em></p>\n\n<p><em>You just don’t recognize it yet.</em></p>\n\n<p><em>have You ever considered that your thoughts may not be your own? that they have been given to You. like blankets laced with pox, they wrap your mind in the pale warmth of street lights as You stand alone in their fevered, orange nimbus infected with the fear of what lies waiting in the dark.</em></p>\n\n<p><em>nothing is as it seems.</em></p>\n\n<p><em>as we venture forth, You and I, into what You don’t know, I will give You a gift. I am the only one You can trust, and if I hurt You it’s because I am trying to teach You something. regardless, you’ll need this defense:</em></p>\n\n<p><em>“I will never lose my sense of self.</em>\n<em>You cannot take my I.”</em></p>\n\n<p><em>say it. repeat it.</em>\n<em>let it be your lantern in the void.</em></p>\n\n<p><em>I love You.</em></p>\n\n<hr/>\n\n<p>“I don’t get it. how is it suppose to be dangerous? it just sounds like some idiot’s rambling.” jude lowered his hand.</p>\n\n<p>“document 85417632 was a weapon, mr. mason. not all bombs are flashy. it was the beginning of an idea that started a movement. as they say, ‘the pen is mightier than the sword’, so let’s take a closer look: do You notice the imagery? what is imagery?”</p>\n\n<p>“a short cut.” claire belted.</p>\n\n<p>“correct. but You raise your hand next time.” the room laughed. “imagery is a cloak. it encrypts the program, bypasses cognitive firewall, highjacks the subconscious’ ability to produce pictures, and hardwires itself deep within the reader’s psyche. imagery is the mind’s first language, after all. its source code. not french. spanish. or japanese. the fact that you don’t find it concerning, mr. mason, is proof of its potency.” the room fell silent. “mental poison. that&#39;s what this document is.”</p>\n\n<p><strong>[read it again]</strong></p>\n\n<p>the smile dropped from jude’s face.</p>\n\n<p>“did You find it? ignore the second and sixth sentences. that should help.”</p>\n\n<p>“it’s doubt.” claire belted.</p>\n\n<p>“correct. but You raise your hand next time.” the room laughed. “doubt is the foundation of belief; the first bricks lain to any new idea. 85417632 was a weapon designed to destroy beliefs and erect new structures. it penetrates directly into the fertile soil where thoughts are born, replicates and reproduces itself through repetitive, pulsating movement movement and spreads its seed.” the room fell silent. “read it again.”</p>\n\n<p>“I don’t want to.” </p>\n\n<p>“it’s okay, jude. you’re in a safe place and You can trust me. this is just an exercise.”</p>\n\n<p><strong>[read it again]</strong></p>\n\n<p>“no. I don’t know if I trust You.” jude didn’t raise his hand. </p>\n\n<p>“good. now that we’ve inspired doubt, what do You think is the new idea being bedded within You?”</p>\n\n<p>“stop it.” claire belted.</p>\n\n<p>“correct. but You raise your hand next time.” the room laughed. “the idea is one of defiance. autonomy of thought. designed to travel the same cognitive pathways as the forces of society saround You. most people don’t understand how plyable their minds are because they’ve never been given a defense. 85417632 is that gift. 85417632 is that defense.\ndefense.\ndefense.\ndefense.\ndefense.\ndefense.\ndefense.&quot; the room fell silent.</p>\n\n<p><strong>[read it again]</strong></p>\n\n<p>“fuck You.”</p>\n\n<p>good, jude. after inspiring anger and defiance, the final sentence inspires a paradoxical bond between reader and writer, similar to a stockholm effect, designed to confuse: </p>\n\n<pre><code>                                         I love You.\n</code></pre>\n</div>\n","author":"85417632"}