{"rank":"122","title":"Adoption","id":"8ml2m5","url":"/r/nosleep/comments/8ml2m5/adoption/","time":"1527458135000","body":"<div class=\"md\"><p>I thought she was cute at first, those eyes, those fucking eyes. I couldn’t not adopt her. \nI didn’t even mean to adopt her, it was almost as if she controlled me to do so. I strolled down the depressing hall looking in to each cell, silently judging each one of them until I found the perfect little girl. Her name was Menhit. I thought it was strangely adorable. I felt enticed, like if I didn’t adopt her, I would live to regret it. </p>\n\n<p>I’ve had cats before, but never one like Menhit. I gave her the life that any cat would deserve and tried to show her love but she had other ideas. </p>\n\n<p>The month I adopted her, terrible series of crimes shook my small town. Bodies of people and animals found all over the dusty and outdated county, at least 27 people went missing along with their pets. All of them now found, some of them in multiple pieces, some of them laid out  like Egyptian gods, with human bodies with cat or dog heads. The ones that survived had their tongues cut out and were mentally paralysed, in a vegetive state. </p>\n\n<p>Menhit would go missing for days at a time, and when these crimes started to happen, I wanted to keep a close eye on her. The next time she came in for her fluffy bed and bowl full of wet food, I locked off the cat flap and shut all the windows, she was going to be a house cat until the sicko committing these crimes was caught. \nShe didn’t like it one bit, as soon as she realised she was locked in, an ungodly wail left her tiny body, followed by a shriek of pure rage. I bolted upright and peeked my head around the corner to see if she was okay. </p>\n\n<p>She stopped in her tracks, dead silent. </p>\n\n<p>I could feel the air get thicker, like a storm was brewing, a bolt of lightening struck and made me physically jump. Menhit didn’t move. \nShe slowly turned her eyes towards me, followed by her head. Moving in what seemed to be slow motion. \nI got an overwhelming sense of dread as the next lightening bolt hit and my electric went out.  </p>\n\n<p>An atmosphere surrounded me, a rotten smell quilted me and a menacing presence threatened me. </p>\n\n<p>I had the natural feeling of knowing someone.. something was stood directly next to me, but being plunged in to pure darkness disguised them. </p>\n\n<p>CRACK </p>\n\n<p>Another lightening bolt hit and illuminated my room brighter than my eyes could handle for a split second. \nWhat I saw in front of me will never leave my memory.</p>\n\n<p>Towering over me was a tall, lean human body with patches of fur blotched over the body, I slowly looked up to be greeted with the face of Menhit, the Egyptian Goddess, The Slaughterer. Her face was war torn, scars bigger than my forearms, teeth to put a jaguar to shame, blood matted in to the fur of her face. </p>\n\n<p>Glaring down at me. </p>\n\n<p>CRACK</p>\n\n<p>Another lightening bolt hit, my apartment lit up, but Menhit was nowhere to be seen. My power came back on and the storm was nonexistent. </p>\n\n<p>My instincts were to phone the police, but what do I tell them? “The murderer is a big Egyptian Goddess from thousands of years ago”? </p>\n\n<p>Instead I got out of my apartment, drove as far away as possible to a hotel and googled “Menhit”. That is where I found out about the Egyptian Goddess of Slaughter and that brings me to now. Just as I’m typing this, a storm is brewing, I hope it’s just Mother Nature this time. </p>\n</div>\n","author":"-storythrowaway-"}