{"rank":"18","title":"There’s something in my childhood home that wants me. PART I","id":"8ml8r4","url":"/r/nosleep/comments/8ml8r4/theres_something_in_my_childhood_home_that_wants/","time":"1527459693000","body":"<div class=\"md\"><p>I lived in this house on the mountains.  It was a fairly big house; three sizable bedrooms, one big bathroom that could easily be another bedroom itself, kitchen with installed bar, dining and living room. A two car open garage and a patio that surrounded the house, big enough to fit another house of the same size in it. In the back there were two gazebos, side by side, forming a big double gazebo with wooden railings and a pretty huge entry arch. Our backyard was big enough that we had chickens, rabbits, iguanas, and dogs all loose at one point, like a mini farm. </p>\n\n<p>I lived in that house since I was born. </p>\n\n<p>My old bedroom (which my mom then exchanged with me because “it was bigger”) was the bedroom that could be seen directly from the front door down the hallway. When I was four, I used to see a tall, dark figure standing on the other side of the screen door at night, as if the main door was left open, staring at me while my little scared shitless, frozen four year old body stood in my doorway, too terrified to move even an inch, in fear the figure would charge at me. If it was contempt with staring, I had no reason to piss it off. </p>\n\n<p>My mom changed bedrooms with me because that bedroom at the end of the hallway was bigger, she said. But I always suspected she knew there was something there. I switched to her room which was the second biggest in the house. Next to my old room was my brother’s room, in front of his bedroom was my new room.  And while I was in my old room, I would always have nightmares that prevented me from sleeping, so I was always tired at school. I managed to keep my grades as a straight A student all the way to high school though. </p>\n\n<p>Once me and my mom switched rooms, I started sleeping better. But the things I saw only got more and more violent.  </p>\n\n<p>When I was seven, I woke up in the middle of the night to the sound of my wooden room door slamming shut. I sat terrified in my twin bed, staring at the closed door, afraid that if I dared take my eyes off it, something would be standing in my doorway, ready to take me away into the darkness. I took three rapid breaths, preparing myself and mustered enough courage to jump out of bed and run out of my room, slamming my door open and running into my mom’s room, crying. While I opened my door, a small toy vanity I had by the door smashed on the floor as if something had pushed it from behind in a tantrum. My mom brushed it off as a nightmare, and said I must have knocked it over while running away. </p>\n\n<p>“There’s no one in your bedroom, sweetie.”</p>\n\n<p>My mom’s soothing voice calmed me instantly, as she gently pushed my upper back into her bed, pulled the thick comforter over me, kissed my forehead and laid with me. I slept like a baby. </p>\n\n<p>Weird occurrences were always going on, my mom’s room seemed to be the center of it all, but they were passive enough for me to ignore for the next few years. A whisper here, a door creaking open while still closed there, the house was solid concrete so it didn’t creak itself. I’d hear my mom calling my name from her room only to find she still wasn’t home from doing groceries; stuff like that. </p>\n\n<p>When I turned about 15, my mom had been married to my stepdad for 5 years already. She had called witches and people who were into the occult who were close friends to check the house out. We cleansed the house a couple of times and everything seemed to be normal for a bit. But then something happened. </p>\n\n<p>I woke up to find myself covered completely with my blanket, as usual, since I made a habit out of sleeping completely covered. That way if there was something in the room, I wouldn’t notice it, and therefore, it would go away. At first, I felt my floor fan blow wind to my right, since it was sitting on the left side of my bed. </p>\n\n<p>Suddenly, the wind blew left. </p>\n\n<p><em>I stopped breathing.</em> </p>\n\n<p>If they didn’t see my breathing maybe they thought I was already dead and they would leave me alone. </p>\n\n<p>Wind blew right again. </p>\n\n<p>Then left. </p>\n\n<p>Right. </p>\n\n<p>Left. </p>\n\n<p>Stayed in the center. Suddenly I realized it wasn’t the wind. Something had been passing over me side to side, and now it was sitting on my stomach, putting pressure on my small body and making it harder for me to hold my breath. I let go and took a deep breath of air and instantly felt the two hands that were almost too big to hold my petite neck. One hand would have probably been enough to cover my neck and half my face. And it squeezed. I couldn’t breathe now and I panicked.  I threw my hands above me and down, as to trap whatever was on me with my blanket as I jumped and landed sitting on my knees on the bed. It was gone. The only sound in my room was my floor fan. My bed began to shake uncontrollably and I ran for my mom’s room, to which she opened the door before I could even knock. Her eyes were wide open, and she was completely flushed of color. </p>\n\n<p>“Did you feel that?!” I yelled. </p>\n\n<p>She instantly changed her expression and went back to her soothing, motherly half smile. </p>\n\n<p>“The earthquake? Yes honey. Want to sleep with us tonight? I’ll help you make the bed on the floor next to me.” </p>\n\n<p>So we did. That night I dreamt of my mom’s head popping from the side of her bed, staring down at me laying on the floor, with her curly, short, red hair falling on the side of her head downwards, and a grin that ran from ear to ear, showing the teeth that were farthest back. </p>\n\n<p>I went to school as always, tired. Laughed, smiled, joked around, worked hard. I hated high school, but at least my friends took my mind off all the shit going on back home. Then it’s time to go back. </p>\n\n<p>After school, I’d stay at my grandma’s house until my mom picked me up after work, then we headed home. My grandma lived in the street behind my house, on a lower terrain, so to get to my house you have to go up a hill, and to the right. I decided to go home before my mom picked me up. But she insisted I waited for her. My brother was at a friend’s house and her husband was working late that night. So I did. My common sense said that maybe going into that house alone wasn’t the best idea. </p>\n\n<p>My mom picked me up, as we went up the hill and to the right, there was complete silence. The kind of silence when someone wants to tell you something and can’t figure out how. So we got home in less than a minute, but it felt like an hour. Mom parked in the garage and I opened the house door, it was rather automatic of me, to just open the door like when I was younger and had kind of forgotten what was happening. I walked all the way down the hallway, until I was in front of her door, ready to make the U turn into my room. Then it hit me. My stomach dropped, my heart started beating like it was inside my throat, and tears ran down my face. It was like I hit a wall of pure evil. </p>\n\n<p>“Mom! There’s someone in the house!” I screamed. </p>\n\n<p>Mom immediately grabbed the pepper spray from her purse and pushed me to the side. </p>\n\n<p>“Where? Who did you see?” She was searching frantically with her eyes around the house, pointing her pepper spray with an extended arm in front of her, and shielding me with the other, holding me back. </p>\n\n<p>“I...I didn’t see anyone.” I stammered. </p>\n\n<p>“Then what is it?” She never out her pepper spray down. She took a knife out of the kitchen drawer, and handed me another one. </p>\n\n<p>“I felt it. In the room. Your room. It’s there, I know it. I can feel it mom. There’s someone there. Let’s just call the police please don’t go in there.” The last sentence came out with my voice breaking, holding my mom’s arm trying to hold her back was like trying to hold back a mamma bear charging at whoever is endangering her cubs. </p>\n\n<p>“You need to be brave princess.”</p>\n\n<p>I was 15 years old and she still called me princess. My mom always knew how to soothe me. She wiped the tears off my face and we searched the house together. There was no one. I always found it suspicious she checked in places where a person could not possibly fit. </p>\n\n<p>But I still felt it. It was <em>watching</em></p>\n</div>\n","author":"ylebron"}