{"rank":"4","title":"The Owl Witch (Part 1)","id":"8ml9t3","url":"/r/nosleep/comments/8ml9t3/the_owl_witch_part_1/","time":"1527459965000","body":"<div class=\"md\"><p>I was 17 when I first saw the witch, and I still remember the first and other encounters with her.</p>\n\n<p>It was June 17th, 2016. My friends told me about this witch that lived in this forest. They told me she took the form of an Owl, and that she would curse the ones who stumbled upon the forest. I told them that was a load of bullshit and that I didnt believe them, but then my friend Nathan told me that if it wasn&#39;t real, we should go to the forest at night. So I said that all four of us should go.</p>\n\n<p>That night, all of us went, it was me, Roberto, Nathan, and Jalyn. Because I was supposedly the luckiest of the group and that nothing would happen to me at all, even if there was a witch, I took the lead. </p>\n\n<p>Within the first hour, we really didnt see anything, we were looking around and everything was relavtively quiet. The second hour, Roberto wandered off, only for us to find him 30 minutes later hiding near a tree and he had a scratch on his shoulder, and he told us we should stick together, because he said he saw the owl, and the owl screeched at him, so he tried to run and hide, but the owl flew towards him and attacked him, but he threw a rock at it and flew off.</p>\n\n<p>The third hour, Nathan and I both felt uneasy, and I had said that we might be getting closer to it, because while everyone went ahead of me for 2 minutes, I saw the owl, and it stared at me and kept on following us. I kept no mind to it, but I kept on remembering that ti was followig us and I felt uneasier as time went by.</p>\n\n<p>The fourth and final hour, I built up enough courage and had finally told my friends that it was following us, and I had heard a loud screech. At that point, I knew we had to leave, but whike I was sitting there, frozen after I heard the screech, my friends had already taken off without me. When I did run, I was heading the wrong direction. I decided to look behind me, and I saw the owl chasing me as I was running.</p>\n\n<p>After a while, I stopped dead in my tracks and looked behind me once again.</p>\n\n<p>The owl had stood there, and when I had closed my eyes for a minute and opened them, I saw a young woman in its place. She had black hair, blue eyes, and looked about 20 years old. I originally thought I was hallucinating, but then she put her hand on my neck, and she told me that I was not welcome there, and that I better go home. I did what she said, and as I was about to leave, she had also told me that I was lucky enough that she couldnt put a curse on me.</p>\n\n<p>After that, I went back to the entrance of the woods, and my friends saw me. And they were scared that something had happened to me but I had told them I was fine, but I had not told them about the encounter with the witch. And as we were leaving in Nathan&#39;s truck, I turned my back to the woods and saw the owl, staring right back towards me. The only ones who had nothing truly bad happen to them that night was Nathan and Jalyn, they were even luckier than Roberto and I</p>\n</div>\n","author":"AverageFuqboi"}