{"rank":"34","title":"Flatland","id":"8mlixb","url":"/r/nosleep/comments/8mlixb/flatland/","time":"1527462331000","body":"<div class=\"md\"><p>“Even after moving from Maine to Arizona, I still loved exploring the outdoors; instead of exploring forests, I’ve just been exploring seas of shrubs, cacti, and sand. Though I tend to stick to trails, my curiosity took me a little off the beaten path this morning. On the way to church, I parked my car on the side of Route 93 to take a photo of a crimson sunrise. As I looked off the road, I glimpsed something lying in the sand just a few yards away.</p>\n\n<p>I squinted and approached what I soon realized was a tattered leather bag, partially sun-bleached. Curious, I gingerly unlatched the bag and pulled it open. I was greeted by a sheaf of papers; while some, toward the bottom, were yellow and frayed, the ones on top were crisp and white. Once again, my nosiness got the better of me as I peeled the first from the top and began reading.</p>\n\n<p><em>Please—I need you to read this. All of this. I might be able to save you, even if I can’t get out of here.</em></p>\n\n<p><em>I don’t know much—I just know that the desert changes. It doesn’t want people to leave once you’re here. That’s where I think other people failed. They trusted it too much—saw a river or little town or something and were stupid or desperate enough to go to it. Whoever wrote the fifth note even ran into a person here. That was the last thing they wrote.</em></p>\n\n<p><em>The plants have started singing to me. It’s a low hum now, but based on what these other notes say, it’ll only get louder and higher-pitched. I think they’ll start moving soon. That’s what happened to everyone else. I shouldn’t dwell on that, though. You’ll figure it out soon enough.</em></p>\n\n<p><em>There’s some spare paper in this satchel. I think I’ll tear it up and make some bread crumbs. Hopefully they stay on top of the sand and you can follow my path—use my progress as a foundation. Maybe you’ll make it out. One of us must, eventually.</em></p>\n\n<p><em>If you do, tell everyone we died trying. We all did.</em></p>\n\n<p><em>CLEMENT FOSTER</em></p>\n\n<p>While the note itself was written in pencil, Clement’s name was printed on.</p>\n\n<p>A terrible feeling throbbed throughout my head and throat—as if my brain was screaming and my neck was caving in on itself. What I perceived as an anxiety attack got even stronger as I tore my eyes from the paper only to realize that the land around me had completely changed. The road and my car have completely vanished, and save for a few desert florae, the land stretches uniform, flat, and infinite into the horizon.</p>\n\n<p>It’s currently 2:07, according to my phone’s clock. That means I’ve been walking for about five hours—ambling aimlessly in the merciless heat. Though I’m still getting reception—for now—I can’t see any signs of civilization. No clouds nor planes have passed above me for hours. I’ve been reading the other notes as I’ve walked, and I’d rather not share what they say. It’s not important to you, anyway, and it probably never will be. Probably.</p>\n\n<p>I never saw Clement’s “bread crumbs”; from what I can tell from the other notes, for whatever reason, this satchel is the only thing that the desert can’t wash away.</p>\n\n<p>I keep checking Google Maps, but I’ve been unable to track down my current location—or determine if I even have one. If it ever starts working, my phone may be my only way out. I didn’t even want to type this all out, to be honest—I should really be conserving battery right now.</p>\n\n<p>A blank sheet of paper has appeared at the very top of the sheaf. A paper with my name at the bottom in a plain typeface. I don’t want my last words to stay in this satchel. I don’t want to be swept away in a sea of shrubs, cacti, and sand—and I don’t want the others to die quietly either.</p>\n\n<p>I’m going to include below a list of everyone’s names from the notes as a last act of defiance. I won’t let us get erased without a fight. I won’t let us go like this.</p>\n\n<p>”</p>\n\n<p>The phone was in immaculate condition, despite lying half-buried in sand. Even more remarkably, when I picked it up, I realized it was still unlocked, a Word document open on the screen. I silently gestured to my supervisor and we both examined the phone for a good long time, reading the string of text on the screen. If this were a normal year, the message would’ve surprised us. However, this wasn’t a normal year.</p>\n\n<p>I returned to our patrol car without a word and pulled out an evidence bag. After sliding the phone inside, I plucked a sharpie from the glove compartment and scribbled on the bag’s label:</p>\n\n<p>“Route 93 Search Area</p>\n\n<p>Article No. 25</p>\n\n<p>Discovered May 27 @ 2:10pm</p>\n\n<p>5 feet from the road”</p>\n</div>\n","author":"okonkwos_gun"}