{"rank":"13","title":"The man in my eyes","id":"8mlox6","url":"/r/nosleep/comments/8mlox6/the_man_in_my_eyes/","time":"1527464003000","body":"<div class=\"md\"><p>You know when you are little and you look really close in the mirror at your eye colour? When you try to figure out whether your eyes are black or just really dark brown, or if they are green instead of hazel? Maybe you even got scared that you’d see someone, or something. Well when I was about 5 or so and could look into the mirror I would put my face as close to the glass as humanly possible, but it wasn’t until I was 8 that I started to see the man. I don’t know his name, and I have no clue to this day why he is there, or where he came from. He doesn’t harm me or anything but even to this day he has not failed to scare me. </p>\n\n<p>He is just a tall silhouette of a man, his feet always shoulder length apart, and his arms spaced out from his sides a bit. Although he is never be in the corner when I jerk my head around to see him, I was always afraid he would, out of nowhere be right behind me in the reflection and in real life. Honestly, I am so thankful he is never really there when I turn my head away from the mirror. He always stays in the corner and I like to think that my grandpa sent someone to look after me and that even when I’m not looking in the mirror the man is still protecting me in some way. He always stays in the corner… except when I was 11.</p>\n\n<p>I guess that from 8 to 10 I was just in a constant shock because it wasn’t until I was 11 that the depression hit, and it hit hard. During my depression the man in the corner would inch closer and closer each time I looked in the mirror, until one day I looked and he had moved a lot, he was right behind me. As I looked in the mirror I felt something behind me like I had never felt before, it was a scary but somewhat comforting presence, but I didn’t want the feeling to be there nor did I want the man to be that close to me. I jerked my head around fully expecting him to be behind me but instead I was met with an erie absence of life in my room, which I hated more than the feeling behind my back. I ran out of my room into the living room strangely full of people. It took me a long while, about a couple months after I turned 12 to look into a mirror again, don’t get me wrong I looked, but I was either far away from it where is was hard to see my eyes, or close to someone else like my mother.</p>\n\n<p>When I did finally look into the mirror, I made sure to look into my eyes, and there he was in his corner, like always. I could’ve sworn I heard a faint “I’m sorry” that day, I’m guessing it was from him, for getting too close. He always stands in the exact same position and never changes it. I’m going to go ahead and guess he is an embodiment of PTSD, because 8 years old is when my PTSD started.</p>\n\n<p>It started out as a nice winter day, it had snowed quite a lot so me and my grandpa were wearing our heavy fuzzy jackets, his of course having his “Best grandad in the world” written on the back in bright yellow letters. Mine was black, with the white fur lining the hood and cuffs of my sleeves, with nothing written on the back because at 8 I was not as extra as my grandpa. We were going out to get pretzels at our favorite spot, and as usual I was repeating the order I knew he was going to get because he hadn’t changed it for as long as he had been going there.</p>\n\n<p>“A mocha coffee with a pretzel, a chocolate donut, and extra cheese for your pretzel.” I said it with a smile on my face. As we were approaching the entrance on the Pretzel place my smile soon faded as he grabbed my wrist and started running, I was angry at him for hurting me but I was even angry at the man who had hurt him, the man who had killed him.</p>\n\n<p>You see my grandpa was a kind man and had never done anyone any harm, none of my family had ever once seen him get angry at anyone, and he never snapped at young children unless they were doing something highly dangerous.</p>\n\n<p>I loved my grandpa so much and I never expected that him of all people would be shot and killed right in front of me by a horrible drug addict, who had the audacity to come up to me and apologize for “Any harm he had caused”, I guess my mom was more angry at him for saying that then I was because she slapped the man.</p>\n\n<p>I remember putting my coat on that morning and smelling the hint of the day before, and watching the white fur bounce up and down as I walked along side my grandpa showing him how smart I was by reciting his order like I did every Saturday and Sunday. I remember walking so close to my grandpa that I could smell him, and see the yellow letters slightly cracking. I remember the snow slightly crunching under our feet and slowing down to step in the tracks he made.</p>\n\n<p>I remember that every other time we made it to the door but this time somebody had made it before we did, ruining my pure white fur, and soaking the yellow slightly cracked “Best grandad in the world” in dark red blood. I remember my grandpas grip tightening on my wrist only to release it, his hands getting colder than the air, and somehow colder than the feel of the gun I had gripped after the man had dropped it, colder than the blood trickling down my face onto my shirt, the blood on my hands from trying to stop the blood from covering the letters.</p>\n\n<p>I remember sitting in the coffee shop as my mom came to get me, watching them hall away my grandpa, watching them shovel away the infected snow that was covered in my grandpas blood, hosing down the wall to remove any possible chance of there being dna from him on it.</p>\n\n<p>I remember my mom walking in, tears welting in her eyes, she grabbed me pulling me into a tight hug, me wanting to cry but not being able to. I felt bad for not crying, I still haven’t to this day, not about that, and not about anything. He was cremated wearing that damn zip up jacket, and watching everyone at the service cry made me mad because half of them there were people who hadn’t talked to him in years, and some of our family showed up that cut ties with him because they were too stupid to cherish him.</p>\n\n<p>To this day I still have no idea why the man in my eyes isn’t my grandpa, or the guy that killed my grandpa, or anything else like my grandpa’s favorite animal or something, I don’t recognize the silhouette of this man at all. I always make sure that I look into my eyes so that I can see him, I mean he is always there so the least I could do is make it clear to him that I appreciate him. He keeps his distance now, and I would have to say that out of everyone I appreciate him the most. Like I said before, he still startles me, he started watching over me when I was 8, and I’m 17 now. If I lost the man in my eyes, it would be like losing my grandpa all over again.</p>\n</div>\n","author":"beasT64444"}