{"rank":"0","title":"Perfectly wrong","id":"8mlr5v","url":"/r/nosleep/comments/8mlr5v/perfectly_wrong/","time":"1527464619000","body":"<div class=\"md\"><p>As I write this I want to be extremely clear when I say this. I’m not perfect, therefore my writing won’t be perfect, and I don’t want it to be perfect. It’s okay to make mistakes.</p>\n\n<p>“Have you ever wanted to be perfect?” A stranger asked me 2 weeks before everything went conpletely wrong. My answer was no. I don’t want to be perfect. The woman who’d asked me that looked beautiful. I don&#39;t recall seeing a scratch, no blemishes, nothing. She wasn’t even wearing makeup. She had perfect skin. I was kinda freaked out. It was like everything about her was perfect. Her attitude was perfect up until she heard my answer. Her husband quickly calmed her. Which made me notice that it just wasn’t her that was perfect. Her whole family was perfect. The way she returned back to that perfect tone as she had before she said, “ Well, I guess that you’ll find out what not being perfect does to you for the next two weeks.” All I could say was, “ Get away way from me you crazy freaks” and I calmly walked away.</p>\n\n<p>Even though I tried to be unbothered about what she said, I was, terribly.</p>\n\n<p>When I returned home I acted as if it never happened. </p>\n\n<p>“Hi mom.” No reply. “Mom!!! I’m home. Where are you!?” No reply. I began to panic and look for her. I was not prepared for what I saw next. I saw my mom, on the floor, but not just on the floor. Whoever was the psycho who had done it cut my mother up and perfectly aligned her body like it had never been cut. I immediately burst into tears.</p>\n\n<p>Who would do this to her she was everyone’s best friend.</p>\n\n<p>The man who did the autopsy had said that her blood pressure was far above normal. This meaning who ever did that made my mom suffer.</p>\n\n<p>The next morning I received a text.</p>\n\n<p>Stranger: How was day 1? Do you look forward to the next 13?</p>\n\n<p>This really terrified me. Did she kill my mom. No, she wouldn’t. That would screw up her “perfect record” I suppose. I am going to find whoever killed my mother and I can and will return the favor. I’m not a killer but I’m not perfect and not being perfect will make you do some things. Even though you will immediately regret it, deep down it gives you pride that you had the guts.</p>\n\n<p>So, with that being said, I had the guts to reply.</p>\n\n<p>Me: Who are you? And why did you do this to my mother!?\nStranger: lol You don’t remember. Being perfect will help you with your short term memory loss dear.\nMe: You really think this is a joke? You’re not perfect.\nStranger: Honey, when you sign a contract selling your soul, your perfect. She deserved it.\nMe : you’re sick. \nStranger: Sign your life or that will be you in 13 days, bye bye.</p>\n</div>\n","author":"LifenowandDeath2come"}