{"rank":"663","title":"If you receive a friend request from a girl named SantaMaria, don't accept it.","id":"8mmhr3","url":"/r/nosleep/comments/8mmhr3/if_you_receive_a_friend_request_from_a_girl_named/","time":"1527471972000","body":"<div class=\"md\"><p>Hello everybody my name is Kevin and I am having a bit of trouble right now and quite frankly, i&#39;m terrified. I don&#39;t know exactly what I expect to get out of sharing this on nosleep. Answers maybe? Or maybe someone else has accepted the request and can relate what i&#39;m going through? Anyway i&#39;ll just get right to it.</p>\n\n<p>2 nights ago i was sitting at home bored playing on my phone when i noticed i had a new friend request on facebook.</p>\n\n<p>SantaMaria has sent you a friend request do you accept?</p>\n\n<p>With recently being single i have to admit as soon as i seen the request was from a female i got curious and clicked the profile. To my surprise she was smoking hot, tattooes but not to many, perfect body and a gorgeous smile. Lives in the same town as me and it says she single. Now I live in a small town and know pretty much everybody so i was a bit surprised when I seen she was form my town. I just figured she recently moved here or something so I shrugged my shoulders and accepted the request. Almost immediately my messenger beeped and it was from SantaMaria.</p>\n\n<p>SantaMaria is waving at you!</p>\n\n<p>My adrenaline pumped a little as excitement grew and i quickly waved back with a stupid smile on my face.</p>\n\n<p>After that nothing... I waited for another response for 5 minutes or so but still nothing. I felt kind of dumb sitting and staring at my phone, waiting for some girl i became friends with only moments ago on facebook to write me so i set my phone down and went up to grab a snack.</p>\n\n<p>Beep Beep Beep!</p>\n\n<p>3 times in a row my phone went off sounding i had 3 new messages. I quickly ran back to the grab my phone hoping it was from her. It was. Only the messages were very odd and robotic sounding.</p>\n\n<p>SantaMaria- Hello i&#39;m new to the area how are you?</p>\n\n<p>SantaMaria- I would like to meet new people i&#39;m new to the area how are you?</p>\n\n<p>SantaMaria- Hello I&#39;m new to the area how are you?</p>\n\n<p>&quot;Great a damn scammer... idiot&quot; I scowled myself for being so niave.</p>\n\n<p>Annoyed at myself i walked to the kitchen to continue my snack raid. It was my day off and i planned on binge watching horror movies and pigging out. I know, i could&#39;ve went out and tried to meet some girls out in the real world instead of stupid facebook but hey, i was feeling tired and lazy. After i grabbed my ice cream and mountain dew i plopped back down in the recliner and picked out the movie &quot;Insidious&quot;. It was dark out now probably around 10:00 pm and felt like the perfect mood to get myself all scared and prepare to sleep with all the lights on. I&#39;m a bit of a chicken but for some reason i love horror movies, always have. I was only a few minutes into the movie when i heard the beep from my messenger again.</p>\n\n<p>SantaMaria- Can i come over?</p>\n\n<p>&quot;What the fuck?&quot; I said out loud to myself.</p>\n\n<p>Me- Who is this?</p>\n\n<p>SantaMaria- My name is SantaMaria i&#39;m new to the area.</p>\n\n<p>Me- Ok... well sorry no i don&#39;t know you at all and have never spoken to you before lol.</p>\n\n<p>SantaMaria- I&#39;m new to the area and am looking for friends, we could watch a scary movie together.</p>\n\n<p>I felt my heart skip a little bit, this was an odd coincidence and of course i had to be watching a scary movie at the moment.</p>\n\n<p>Me- Sorry i don&#39;t like horror movies.</p>\n\n<p>That was obviously a lie.</p>\n\n<p>SantaMaria- Then why are you watching one now? Alone...</p>\n\n<p>After that last message my heart hammered through my chest and i frantically looked around my living room. This had to be one of my friends playing a prank on me, it had to.</p>\n\n<p>Me- Very funny, who is this?</p>\n\n<p>SantaMaria- My name is SantaMaria.</p>\n\n<p>Me- Is this you James?</p>\n\n<p>I was hopeful my brother would confess and i could breath normal again. I was scared shitless and felt like something was very wrong, Like a sense of dread.</p>\n\n<p>SantaMaria- My name is SantaMaria i&#39;m new to the area. I&#39;m coming over now.</p>\n\n<p>My heart was pounding harder than it ever had before, this didn&#39;t seem like a joke anyone i knew would pull on me. I looked in all of my rooms and out the windows just hoping to see someone, anyone outside that i knew laughing at the joke they pulled on me. Only no one was outside, i was alone out in the country with some crazy person online telling me they are coming over.</p>\n\n<p>Me- No, if you do i will call the police!</p>\n\n<p>I stared at my phone waiting for what felt like an hour for this mystery women to reply. I was so focused that once i looked up i didn&#39;t even notice my t.v. was turned off and i was sitting in a pitch black room.</p>\n\n<p>&quot;What the fuck... ok Kevin just calm down it&#39;s just the sleep mode.&quot; I tried to settle my nerves a little but it wasn&#39;t doing much good.</p>\n\n<p>BANG BANG BANG!</p>\n\n<p>Three loud knocks on my back door sent me flying through the air yelping like a little girl.</p>\n\n<p>&quot;HOLY SHIT FUCK!&quot; I hollered, giving it away i was obviously home.    </p>\n\n<p>SantaMaria- I&#39;m here let me in please</p>\n\n<p>I stared at my phone in horror not knowing what to do. What in the fuck did this person want? I quickly dialed 911 on my phone and waited for the operator to answer.</p>\n\n<p>&quot;911 whats your emergency?&quot; A womens voice answered.</p>\n\n<p>&quot;Hi my name is Kevin and someone is trying to break into my home, i need someone to get out here as quick as they can!&quot; \nI whispered into the phone as quickly and quietly as i could. </p>\n\n<p>&quot;Sir did you say someone is trying to break into your home? Where are they now?&quot; \nHer voice now sounded concerned.</p>\n\n<p>&quot;I don&#39;t know! I live on *** Perry lane ***** Michigan please fucking hurry!&quot;\nI pleaded.</p>\n\n<p>&quot;Sir an officer is being sent to your locati...&quot; The phone went dead.</p>\n\n<p>&quot;Hello... Hello!&quot; I was practically shouting.</p>\n\n<p>The line went dead and i was left in the pitch black house with an eerie silence.</p>\n\n<p>I quietly tip toed to the kitchen where my back door was so i could try and peek out the window to get a look at who was at my back door. The whole time i crept forward my brain was screaming at me to go hide. Yet my feet kept creeping forward. It was so quiet you could hear a pin drop. Once i got about 5 feet from the door i stopped to listen. At first i didn&#39;t hear anything but as I listened closer i could definitely hear someone breathing on the other side of the door.</p>\n\n<p>BANG BANG BANG!</p>\n\n<p>&quot;FUCKING SHIT!&quot; I once again jumped and shouted, giving my position away.</p>\n\n<p>&quot;Fucking idiot!&quot; I cursed myself for being so jumpy.</p>\n\n<p>Beep</p>\n\n<p>The phone sent me cursing again as it scared the shit out of me.</p>\n\n<p>SantaMaria- Open the door.</p>\n\n<p>Me- No! Police are on the way you&#39;d better leave!</p>\n\n<p>SantaMaria- I&#39;ll be back. </p>\n\n<p>The silence was interrupted by feet shuffling as someone started to walk away from the door. I was to afraid to go look out the back door window so i quietly snuck to the kitchen window to at least get somewhat of a description to give the police. I slightly pulled the curtain to the side and nearly jumped back taking my table out with me. </p>\n\n<p>&quot;HOLY FUCK!&quot; I hit my head hard as i crashed to the ground.</p>\n\n<p>There was a ladies face pressed against my window with her eyes bulging and bloodshot with a blank expression on her face. Thankfully the curtain snapped shut as i went flying back. Something was very wrong with this women... She gave off a horrible vibe and i have a feeling her intentions with me are absolutely horrifying. By the grace of god i seen red and blue lights flashing through my window as the police pulled in. I scrambled to my feet and ran as quick as i could to the front door yanking it open.</p>\n\n<p>&quot;Shes out back!&quot; I screamed pointing to the back of my house.</p>\n\n<p>The police signaled for me to get down and ran around out back. I sat expecting to hear gunshots or shouting or something but it was just as quiet as before. After a few minutes the police came back around and asked me what exactly i had seen. I told them everything right from the beginning and showed them the messages and everything. They wrote everything and down and advised i go stay with a friend or family member for the night. I felt so helpless and terrified that nothing was being done, couldn&#39;t be done... She somehow managed to move quickly enough through the woods that the police were unable to even catch a glimpse of her. </p>\n\n<p>I called my brother and headed over to his house for the night and of course had to give him the whole nights events as well. It took hours but i was finally able to sleep and he drove me home this morning. I&#39;m currently sitting here scared shitless because my brother works tonight and about 10 minutes ago my phone beeped again.</p>\n\n<p>SantaMaria- Hello can i come over?</p>\n</div>\n","author":"Stalked_by_u"}