{"rank":"10","title":"I was part of a team that hunted superbugs","id":"8mmwrh","url":"/r/nosleep/comments/8mmwrh/i_was_part_of_a_team_that_hunted_superbugs/","time":"1527476292000","body":"<div class=\"md\"><p>Our latest assignment came directly from the US Army. Our team, who had been assembled by the WHO had one goal: Hunt down and if need be destroy what was becoming the biggest threat to our modern healthcare system. I&#39;m talking about superbugs. Germs like MRSA and the dreaded Gram-negative bacteria, which are resistant to almost all known antibiotics.</p>\n\n<p>But if our latest case was any sign, the threat is only going to get worse before it gets better.</p>\n\n<p>It was a military hospital for wounded veterans returning from overseas. When we arrived on site, the facility had been completely shut down for the time being.</p>\n\n<p>This was the first clue this wasn’t going to be like the other sites we&#39;ve visited. Most of the time when a hospital or clinic requires isolating a potential pathogen, it&#39;s an entire ward that’s closed off. Not a whole facility.</p>\n\n<p>&quot;The administrator at the hospital couldn’t tell me over the phone. Only that they required our particular expertise for this.&quot; Our team leader was a microbiologist and bacterial specialist, Dr. Collins. He filled us in as best as he could. &quot;A wounded soldier became infected, and it appears to have spread all over the hospital.&quot; Dr. Collins continued. &quot;New patients are being diverted to other facilities until this is cleared up. Considering who contacted us I&#39;m sure you all can appreciate the need for our best on this one.&quot;</p>\n\n<p>The rest of our team consisted of three other researchers. They were Shelly, Daniel, and Sam. Usually, on these trips we would be paired together while we worked. </p>\n\n<p>We arrived at the hospital and we were greeted by the facility administrator, Michael. He was to be our liaison to the Army and was to provide us with access to the entire facility. We also met a man who went only to Sterling, whose exact profession was not given to us. According to Michael, Sterling was here for technical help if need be. I noticed he was holding on tight to a briefcase as we entered. </p>\n\n<p>And by the way he was dressed he <em>definitely</em> did not look like he worked in technical support. That was the second clue.</p>\n\n<p>The inside of the hospital had an eerie feel to it. I guess I was so used to the busy movement of personnel and patients along with the buzzing of countless electronic devices. The absolute silence spooked me a bit, with only our footfalls providing any background noise. We had a team meeting in one of the conference rooms. </p>\n\n<p>&quot;Ok everyone, you&#39;ve all been through this before. Yes, this is a bit different than what we&#39;re all used to but time is of the essence. We&#39;ll divide up as usual to cover all the necessary testing areas.&quot; Dr. Collins looked right at me as he spoke. &quot;Michelle, you&#39;ll be with Sam.&quot; </p>\n\n<p>Sam and I were to inspect and swab the sink drains and toilet bowls of assigned rooms. The other team of Dr. Collins and Daniel had similar duties. Shelly had to sit this one out. It was standard procedure, one to swab and one to collect the samples onto Petri dishes for further analysis later. The whole thing usually took a couple of hours. </p>\n\n<p>&quot;Never fails to get so damn hot in this suits,&quot; Sam said. He always complained in the three times we&#39;d been paired up together. Our layers of protective equipment never bothered me much, I always felt safe in them. I felt like I was in my own little world sometimes, and that seemed to help me focus.</p>\n\n<p>It was when Sam and I were swabbing our last room that I found something strange. Something I&#39;d never seen before today.</p>\n\n<p>I reached the tip of the swab into the sink drain and noticed when I tried to pull it up it was caught on something. As it finally emerged on the other end was a thick, green slime. It had a smell like bad body odor that penetrated my protective suit. The slime stretched thin but did not break even as I continued to pull the swab out.</p>\n\n<p>&quot;What the fuck is that?&quot;  Sam said from behind me.</p>\n\n<p>&quot;I--I don’t know.&quot; Whatever it was, it was as alien to me as could be. I moved my other hand to touch the slime but Sam interrupted me.</p>\n\n<p>&quot;What the hell are you doing? Don’t touch it!&quot;</p>\n\n<p>&quot;Get the Petri dish ready.&quot;</p>\n\n<p>&quot;What!? Why?&quot;</p>\n\n<p>&quot;We need a sample of whatever this is. It could be important.&quot; So we did, the slime held strong but we managed to do it. &quot;Let&#39;s get back.&quot;</p>\n\n<p>We reassembled later down in the conference room. It didn’t take long to notice that two of us were missing. </p>\n\n<p>&quot;Where&#39;s Dr. Collins?&quot; I said. We all looked at each other for a moment. &quot;Daniel was with him.&quot;</p>\n\n<p>&quot;What part of the hospital were they in?&quot; Shelly said.</p>\n\n<p>We checked the whiteboard we had used earlier to assign our teams. &quot;In the boiler room.&quot;</p>\n\n<p>We all went together, now joined by Michael and Sterling, who was still holding onto his briefcase. We had tried to reach them by cell phone but got no answer. Finally, we made it down to the area in the basement where they&#39;d been taking samples.</p>\n\n<p>And there was no sign of them anymore. But what we found was much more disturbing.</p>\n\n<p>Their Petri dishes were everywhere. And one of Dr. Collin&#39;s shoes by itself next to his smashed cell phone. The noxious smell from before was present and much more powerful now.</p>\n\n<p>As I looked closer I could see the area was covered in a familiar looking green slime. Sterling pulled out a phone and dialed.</p>\n\n<p>&quot;Sir, the organism has increased in size again…it&#39;s <a href=\"https://www.facebook.com/SANewmanNosleep/\">been feeding.&quot;</a></p>\n\n<p><a href=\"https://old.reddit.com/r/nosleep/comments/8mvr1t/i_was_part_of_a_team_that_hunted_superbugs_part_2/?ref=share&amp;ref_source=link\">Part 2</a></p>\n</div>\n","author":"SA_Newman"}