{"rank":"0","title":"My Suicidal Freind","id":"8mn542","url":"/r/nosleep/comments/8mn542/my_suicidal_freind/","time":"1527478685000","body":"<div class=\"md\"><p>It has been almost over 30 years since the original incident , And yet the pain and confusion still gets to me. My Friend Johnathan killed himself or herself in 1970 something. To tell you the story i need to start at the worst part of my life... High school. I was made fun of a lot. I was extremely overweight and my face was cluttered with acne. I cant blame them at that time it was hard to look at my face for too long to the point were i went to a skin doctor it was that bad. But being an outcast meant that the only Friends i had were outcasts.</p>\n\n<p>Marquis was the only African American member of our group, Daniel Was a huge nerd addicted to dungeons and dragons, Me and finally Johnny. Johnny was upbeat, nice, and radiated happiness. He seemed so giggly and smiley but he was an outcast because of his sexual orientation. He was gay, he would say he was a woman in a mans body and had a crush on marquis except he never said anything about it when he was alive. People would beat him up and spit on him because of this. It was a different time back then.</p>\n\n<p>I remember days were he would get beat up to the point of were i couldn&#39;t recognize him. His family was very religious so he was never safe from a punch. And yet so happy to be around us. Well mostly Marquis but he had fair shares of good times with us too. I&#39;ve met his father only once and that is the only time i ever want to see him. He was a war vet and not even five minuets at his house John was out cold on the ground after a hard punch with his father screaming over him &quot;I DIDN&#39;T SERVE IN VIETNAM TO BIRTH A NANCY BOY&quot;. I tried child services to no avail almost like they didn&#39;t believe me, hell in the 1970 any adults word was better than a child. But there was one beat up that caused the whole shit show of death, confusion, and pain.</p>\n\n<p>One day Cheerleader tryouts were going on. Now at are school there was a rule were you had to be female in order to tryout for cheerleader. But John knowing this rule grabbed a flyer and made his way to the school gym were the tryouts were going to be held. Before he could even touch the doorknob he was jumped by a group of homophobic kids who nearly killed him. i hated to see him like this with a black and blue eye and stab wounds near his stomach. I could&#39;ve cried but obviously my first instinct was to call the paramedics who saved his life. when he woke up from his 3 day coma he said he wanted them to kill him that day. Ever since that day he seemed different he always slumped, never happy, mostly crying and didn&#39;t even seem joyful near Marquis.</p>\n\n<p>Few days passed as news spread like wildfire. Johnathan L. Coitman killed himself on may 13 1976. My pure essence at the funeral was dark to see something like this happen to him. Police wouldn&#39;t share too much info only that they found him in his room dead with self inflicted stab wounds. Ever since that day our school became the only gay support school in our city. letting men tryout for cheerleaders, And putting the rainbow colored gay flag under the American flag, and they found out who jumped a few weeks after his death and gave them all 50 years in jail should a been life but i cant do anything about it. But there is one thing about the scene that has risen that police didn&#39;t say.</p>\n\n<p>John cut off his own penis because he wanted to be a woman so badly and there was a note written in shaky hand writing not normal to John. He was in so much anticipation and the fear that his DIY surgery would go wrong really got to him in his last minuets. The note next to him that said &quot;If i die please note it is not my intent i want to be a woman. I&#39;ve read the bible and i no i&#39;ve sinned but i pray for forgiveness and for the first time that i know of god made a mistake and if i do not live and someone reads this please tell Marquis i love him.</p>\n</div>\n","author":"Gerbiee"}