{"rank":"107","title":"My Daughter has Never Broken a Promise","id":"8mn950","url":"/r/nosleep/comments/8mn950/my_daughter_has_never_broken_a_promise/","time":"1527479961000","body":"<div class=\"md\"><p>I suppose this whole thing started off with my son, Adrian. Since he started school, kids would pick on him because of his vitiligo. He refused to wear anything with sleeves shorter than his elbow, and wore long pants all year round, just so he could cover what he could. However, no matter his attempts, he couldn&#39;t cover the large spot that covered the left half of his face. He tried everything from covering it with his long bangs, to stealing my makeup. Once he even tried to wear a mask to school when he was in first grade, but that didn&#39;t even get the chance to play out. My daughter, Cora, has been Adrian&#39;s &#39;bodyguard&#39; since they started school. They were twins, so most years, they&#39;d even be in the same class. Those were the better years. When Cora was around, no one dared to pick on Adrian. The only kid who made that mistake had to get stitches because of how hard Cora bit him. Yeah, she was suspended for a while, and grounded for longer, but she never let that down. She took pride in protecting her brother, and I could never bring her down for that. When Cora wasn&#39;t around though, the kids were brutal, and she&#39;d be just as brutal the next time she saw them.</p>\n\n<p>The one year they weren&#39;t in the same class, however, was a different story. Adrian came home every day with alligator tears rolling down his face and then cried himself to sleep every night. I housed a flurry of emotions. I was angry that I couldn&#39;t protect him from the bullies. I was heartbroken to see him like that. I was frustrated that the problem would persist, no matter how often I met with other parents, teachers, the principle, etc. Cora, on the other hand, seethed with pure rage. Long story short, we moved just before their fifth-grade year ended. </p>\n\n<p>The summer before their sixth-grade year, Cora moved in with her dad. She never explained why, she just wanted to. For a few years, kids at this school left Adrian alone and He actually had friends and even rung himself a girlfriend in his first year of high school. Cora got herself a girl a year earlier and went without expulsion or even suspension for the entirety of middle school. It was nice and calm for a while. Obviously though, if it stayed like that, I wouldn&#39;t be writing this would I?</p>\n\n<p>The end of their sophomore year, a girl decided that she was going to mock Adrian. Now, I can&#39;t explain the event in detail, because what I gathered was just tears and anger. Cora didn&#39;t hear about the event until the next day when the story spread across the school. Adrian stayed home that day. He didn&#39;t want to face the mocking that was sure to come. I didn&#39;t read the texts between the two until later, but I feel they&#39;re necessary now.</p>\n\n<p>Cora 11:51 - Who the hell was it?</p>\n\n<p>Adrian 11:51 - i don&#39;t know her name</p>\n\n<p>Cora 11:52 - Then describe her. I&#39;ll figure it out.</p>\n\n<p>Adrian 12:45 - cora please don&#39;t get involved. I&#39;m ok</p>\n\n<p>Cora 1:25 - That bitch will pay. I promise.</p>\n\n<p>I don&#39;t know why Adrian didn&#39;t bring the messages to me until after everything happened. Maybe he wanted the girl to learn her lesson. Maybe he thought Cora would be more merciful. Maybe he was afraid of his sister. All I knew, is that if he&#39;d brought this to me sooner, things would have been different. </p>\n\n<p>That weekend, Cora was interrogating Adrian. Asking specific things about the girl. Hair Color. Dark brown. Hight. Short. Glasses? No. I couldn&#39;t take it. I stopped them and told Cora to stay out of trouble. She promised me she would. And she did. By her definition anyways. She went home that Sunday night. I dropped her off at her dad&#39;s, and she gave me the biggest hug she&#39;s ever given me. She said she loved me, then walked into her house.</p>\n\n<p>The authorities said that Cora and the girl -I learned later her name was Janet- met up after school to &quot;settle&quot; things. According to her dad, Cora promised she&#39;d do it without laying a hand on her, which is the only reason he let her go. Cora always had a way with putting words. </p>\n\n<p>It&#39;s three months after Cora went missing, and I got a call from the local police station about an hour ago. They found Cora and Janet in an abandoned warehouse. Cora managed to get to a phone after attacking their abductor. Cora and Janet are being held for questioning, but when I was able to see Cora, she was a sobbing mess. I cried and held her. My baby girl. Just before she was taken for questioning, she looked up at me, tears running down her face, but a smile was making its way on her face.</p>\n\n<p>&quot;I promised didn&#39;t I?&quot;</p>\n</div>\n","author":"jinxx_why"}