{"rank":"0","title":"Why I never adopted another pet.","id":"8mn9g2","url":"/r/nosleep/comments/8mn9g2/why_i_never_adopted_another_pet/","time":"1527480058000","body":"<div class=\"md\"><p>In Texas, there aren’t many rumors. And I know this by living here my whole life, and the closest thing we have with myths is the Chupacabra since we neighbors with Mexico and, and I also guess Big Foot is you&#39;re either very paranoid or have a fear of the woods. But honestly, I slightly believe these rumors to be true despite how insane they can sound, It’s not because I saw them while I was camping or driving down a certain haunted road. It is because a meet something when it found me.</p>\n\n<p>It was 5 years ago when I was 13. My 21 year old brother was in the marines, and my 29 year old sister moved out year ago making me the only kid who hasn’t left the nest. Me and my parents lived in a trailer right by the woods, and while my mom and dad were gone, I played video games, and watched a fuck truck of you tube videos on my family computer. And although it was a good computer, it didn’t make me feel safe sitting at it, why? well, it was by the back door, so when I get lonely (especially at night), I start feeling a bit scared, and I occasionally look though the window to make sure nothing was there besides the dogs which always barked, except on this particular night.</p>\n\n<p>It was 9 o’clock, it was dark as dark can get, and instead of my two dogs (Lucky and Ladybird), barking or howling- they were whimpering, calling for some sort of help. I honestly hesitated to look and stand up despite the love I have for my two pooches, mainly because I felt someone was there staring at me, and the feeling was almost right. It was not someone, but something.</p>\n\n<p>At first, I didn’t see anything when I glanced at though the doors window. Mainly because both the house light and porch light was on and it seemed like nothing was there, but that was before I saw the black silhouette that block the grill by the stairs. I didn’t breathe, as I feel my pupils change in size from the fear I felt, I keep seeing more and more of this things features. The small dot it had for eyes, the wide mouth that seemed to make a smile, the crunched up figure it had made it seemed like road kill if it was alive. Its lips were shaking, and it seemed more and more animal then it did man as I started to notice it looked like it was floating. I remember not blinking and that&#39;s because of how dries my eyes started to feel.</p>\n\n<p>As soon as my eyes took a blink, millions of images and sounds ran though my head. Tires screeching, animals wailing, kids crying, blood on the road, wires with animal heads ripped off, cats being skinned, dogs being abused,  screams of agony and pain. I started to cry all in a matter of seconds, I couldn’t take the pain anymore, and I think it didn’t couldn’t take it either.</p>\n\n<p>I was found passed out on the floor by the computer by my parents when they came back, they took me to the hospital on the same night, they told me I looked liked a human scratching post from my legs to my belly. But while I came back on a wheelchair, I slowly noticed something. The dogs were gone. Lucky and Ladybird were nowhere to be seen. My mom and dad looked for them all day and night, with the help of my uncles, cousins, and my sister, they were no where to be found. We called the cops and put up posters, but we stopped around a month and a half in. but as soon as we stopped, we found them, on the road.</p>\n\n<p>I would type the description of what they look like in, but it would pain me to do so. The look of my dogs cadavers didn’t seem right though, they looked like they were beaten to death before they were on the road. Either way, I’ll never get another pet again to let them suffer though that, and I’ll pray for you pet owners, despite me not being a believer in God anymore.</p>\n</div>\n","author":"Benjim2000"}