{"rank":"6","title":"Beware the Night Sky","id":"8mn937","url":"/r/nosleep/comments/8mn937/beware_the_night_sky/","time":"1527479949000","body":"<div class=\"md\"><p>I grew up with a mother who was very big in Christianity in  a small SE town in Oklahoma.  My mother would force me not only to attend church, but all church events including bible study, revivals, church singings, etc.  There were a lot of times when we would stay late afterwards despite having school the next morning because my mother would chat with the preacher or other church members.</p>\n\n<p>One evening after bible study, my mother allowed me to ride with the other kids in the church van while they took people home.  My mother, as usual, stayed late to further discuss what I assume was what they went over that evening.  When I arrived back,  my mother appeared a bit out of sorts.  I asked if anything was wrong but she stated everything was fine and stayed quiet on the ride back home.  A few days later, she still acted as if something was bothering her but being a 12 year old kid, I went along about my business going to school and playing with my friends.</p>\n\n<p>A few days later she eventually told me about the last night of Bible Study.  The church was located just down the road by the local hospital.  The lights at the hospital illuminated the parking lot of the church pretty well being as close to it as it was.  That night she was outside she said that she saw something at the corner of her eye.  She looked and thought she saw an airplane.  She kept waiting for the lights to blink on the plane but it never did.  As the plane got closer to the light, she said that she saw the airplane, &quot; flap its wings.&quot;  Scared and shocked as she was, she looked to our preacher but he didn&#39;t notice anything or even bother mentioning it and kept speaking.  My mother didn&#39;t want to alarm the preacher and told herself she was imagining things.</p>\n\n<p>My mother would eventually pass 3 years later and she never spoke again of what she saw that night.  After her death when I finally returned to school, I met a new girl and we instantly bonded.  For sake of anonymity, I will call her Emma.  Emma and I became super close and after school, I would routinely go to her house.  My father had just started working for the local police force as a reserve cop and since he worked nights, I would go to Emma&#39;s house for sleepovers.</p>\n\n<p>One evening I was at Emma&#39;s during the summer and we were bored of staying in the house.  Life in a small town is pretty uneventful and unless you have a car, you&#39;re pretty much housebound.  We were only 15 years old at this time, tired of the local skating rink and movies so we decided that we would take our sleeping bags and sleep in the front yard.   I know, how much more country can you get right?  But it was a nice and cool night so we grabbed our sleeping bags and settled out front.  Her mother didn&#39;t mind since the street was pretty quiet and my dad was on patrol that night and this was a pretty safe town.  We just laid next to each other talking about girly things like boys and makeup and what we imagined our sophomore year was going to be like.  About 20 min or so into our conversation, we were both looking up at the sky enjoying the sounds of cicadas and crickets.  Emma had just started to ask if I wanted to go in to get some snacks when we both saw the most frightening thing of our lives.</p>\n\n<p>Right above us, flew this giant, dark thing.  It probably had a wingspan of about 10-15 feet.  It flew so close above us that it could&#39;ve grazed the top of the roof of her family&#39;s one story home.  It moved so fast and we never saw it flap it&#39;s wings, it just glided across the sky.  Emma and I started screaming as we both jumped up quickly, leaving our sleeping bags crumpled up in the yard.  We burst through the front door startling her mother.  We both tried in vain to tell her mother what we saw but her mother had been drinking tequila and kept assuring us that we were just imagining things and everything was fine.  Needless to say, we didn&#39;t go back outside that night.  In the morning, we tried again to explain to her mother what we saw but she just said that it was an airplane and that we were just scaring each other.  I know without a shadow of a doubt, that was no airplane.  For one, airplanes do not fly that low to the ground nor do they have wings with veins.</p>\n\n<p>Eventually Emma and her family moved out of state and thought we kept in touch, we never really talked much about it.  There would be the casual conversation of asking what each other thought it was, etc., but we could never fully rule out what it was.</p>\n\n<p>A few years later, I was probably around 24 years old and I was hanging out with my cousin Becca (not her actual name but again for anonymity) on her front porch.  She lived smack dab in the middle of town in a trailer park down by the local skating rink.  It was summer time and we stepped outside to have a cigarette.  It was probably around 11pm that night because I remember it being very quiet outside.  We were just joking around and laughing, you know shooting the breeze and such.</p>\n\n<p>I guess we were both looking at the sky and in the distance we saw a huge dark creature gliding across the sky.  I knew in the depths of my soul it was what I had seen previously with my best friend Emma and what my mom saw all those years ago.  Becca didn&#39;t scream, she just looked at me fast, eyes huge and asked &quot;did you just f*cking see that?!&quot; I nodded yes and we immediately went back in the house.  After we were safely inside and calmed down a little, I told her about me seeing it a few years earlier and how I think my mom saw the same thing a long time ago.  She told her husband and he tried to tell us it was probably a plane as well, just as Emma&#39;s mom had tried.  </p>\n\n<p>Despite it being in the distance, I can positively say that this creature was brown to a dark brown color.  Again, a wingspan of 10-15 feet and I failed to mention earlier but I will not that this thing never made any sort of noise.  No growls, etc.  And it it were a plane, we certainly did not hear any motors.</p>\n\n<p>I moved out of state in 2014 and I have never saw it again.  To my knowledge, my cousin nor anyone else has never seen it again either.  I would like to know what it was and if anyone reading this has saw anything similar, I would also like to hear your stories in the comments.  I would very much like to know what the hell it was.</p>\n</div>\n","author":"jill_electric"}