{"rank":"5","title":"The Story Behind The Black Mirror Part 1: The Black Mirror","id":"8mncmc","url":"/r/nosleep/comments/8mncmc/the_story_behind_the_black_mirror_part_1_the/","time":"1527481016000","body":"<div class=\"md\"><p>So I&#39;m writing this first chapter as just an explanation as to how this &quot;black mirror&quot;, as I&#39;ve taken to calling it, came into my life and also I wish to explain why I&#39;m putting in the effort to write this at all. I writing this in hopes that someone might have the same amount of interest in this mirror that I do or maybe someone even owns something like this because if one exists, why can&#39;t two? Anyways, I&#39;ll get to my explanation now.</p>\n\n<p>My name is Johnathan Holland and I&#39;m a self-made writer and as one could expect, being a writer, I spend a lot of time at home and recently, I&#39;ve been struggling with writer&#39;s block and because of that, I decided to take a break. I am a very active person though, so I was trying to think of something to do while on this break, other than doing the same thing everyone else does and relax like a normal human being with my cat, Princess. I decided, in the end, to clean out my basement, something I&#39;ve meaning to do for the last year now, due to the fact that, the thought of centuries worth of decaying relics in the home was bugging me immensely, but I never really had the time to do anything about it until now. </p>\n\n<p>So the next morning, I got dressed and prepared for hours of non-stop work as I started on my journey through piles of broken and worthless Christmas decorations, old photos, rotting furniture, rusted, broken tools my dad used to have, faded and torn clothing and Halloween costumes, and other prehistoric trinkets long forgotten by anyone of the living. One thing that stood out from the rest, which instantly caught my attention, was unlike anything I&#39;ve ever seen. After collecting another moist, gooey box that was ruined due to a minor leak in my basement that was unknown to me, I caught a glimpse of a shiny and black object.</p>\n\n<p>I placed the box to the side and wiped the disgustingly damp cardboard slug from my hands as I walked back to investigate the object of my interest. Once I was finally able to make my way to it, I found it was a large full body fame that like a mirror but the one thing that stood out about it was that the mirror was black. Now, the reason I call it a mirror at all is because famed inside it is a black gem-like material was despite its age, after I wiped off all the dust and it was clean, I saw that it was polished so finely that showed my reflection. I was shown in almost no detail and I was only a dark shadow even when I came close but I found this oddly poetic. A black mirror that shows you the darker side of yourself, the side you want to keep hidden away and want no one to see. This, set off a spark inside me and ideas started to flow in. I immediately grabbed the mirror and brought it to my office where I hung it up and began writing.</p>\n\n<p>As I wrote, I occasionally looked up to the mirror for motivation and every time I laughed as saw the shadow reflection look at me for his motivation. I also noticed as I turned to my desk, the particles of dust that fell from my hair and body that once laid dormant in my basement. After finishing the draft of my first chapter and the list of ideas I had for the story, I decided it was probably best if I finished cleaning the basement. So after some hours of cleaning, I finally finished throwing out all of the broken trash, replacing the broken or damaged boxes with new ones, and I arranged everything I wanted to keep or sell before going to clean myself up.</p>\n\n<p>Once I got out of the shower, I walked over to the black mirror and placed my hand on its beautiful crystal glass and just admired it. It was a gorgeous piece of clearly handcrafted artwork that was so incredibly unique that I&#39;ve never seen anything like it before. My shadow counterpart did as you may have imagined at first but as I finished staring at the framework of the mirror, I looked up and noticed the reflections head was tilted slightly. His cheekbones rose as I&#39;m pretty sure he smiled and the reflection faded into a solid black surface before the unthinkable occurred. As I looked into the currently unreflective mirror, a dark shadowy figure appeared but it was not me, it was a female and she was standing quite aways from the mirror so her whole body could be seen.</p>\n\n<p>The image became clearer and faded into color, letting me now know it was a woman with short cut blonde hair who was wearing a blue sundress. One thing that stood out to me was that the only reflection that was true was the room itself. She was standing in my office but none of the furniture was the same. My desk was replaced by a bed and my bookcase was replaced by a dresser that was moved to the right. I stared in confusion as the woman looked around the room and smiled as a man walked in.</p>\n\n<p>He was a well-built gentleman who looked like the working type with coal black hair, tan skin, and a shadowy beard. She said something that I could not hear as he walked over to her and the two began kissing which made me feel awkward but as I watched them, I noticed something that both confused me and made me curious. As crazy as this may sound, those were younger versions of my parents. When my parents were still alive, they used to own this house and their room was my office but they died a while ago after our house was robbed. I also remembered finding a dress in the basement that is almost identical to one she&#39;s wearing now but the dress was faded. I watched as my dad carried my mom to their bed but I turned away as I fully realized what they were preparing to do and I don&#39;t think I have to explain it and I don&#39;t care to.</p>\n\n<p>As I turned around to avoid watching them, I realized since they looked much younger than they did when they were alive that must&#39;ve meant this was in the past. This was the moment when I thought, does this mirror work like a camera, recording everything that happens in front of it? If so, why is the mirror showing this to me? Is it possible that this was the night I was created? So the mirror remembers me? No, that&#39;s impossible. It&#39;s a mirror, an inanimate object. It&#39;s just not possible for something like a mirror to remember a person. Needless to say, I was very confused on that day but looking back now, I was not prepared for everything I know now. Everything this stupid and physically impossible black mirror can do and everything I know it still has to hide.</p>\n\n<p>A few days passed before the next vision came to me through the mirror and within that time, I went downstairs and found the sundress along with some old photos of my parents and that was certainly them, right down to the amazingly blue eyes of my mother that my father enjoyed so much and that I remember so clearly. The next image came as I was working on my story but stopped as I saw the dark reflection on mirror quietly fading to black as it did yesterday. I finished the sentence I was writing before spinning around in my office chair and wheeling it over in front of the mirror. I saw as the dark silhouette of a person very close to the other side of the mirror came into view.</p>\n\n<p>The head seemed to bounce left and right which made me watch in curiosity as the image sharpened and color faded in. I quickly realized the head belonged to a roughly eight-year-old young boy with black hair, blue eyes, and pale skin who was making funny faces in the mirror. Given the nature of the last vision that was shown, I obviously assumed this young boy to be me. My assumption was proven right as my mother walked in and picked me up before saying something to me. I could barely hear so I moved closer to it, in a test to see if I could hear them (or us) better. &quot;Good, I&#39;m glad you like it,&quot; I heard my mother say as she looked at the mirror. I assumed she asked if I liked the mirror but I&#39;m not too sure, it was the best idea that I had but it doesn&#39;t make much sense because the mirror&#39;s been there since my birth.</p>\n\n<p>I continued listening and heard my mother say to me, &quot;Okay, Honey. Mommy and daddy are going to be going out tonight so grandma will be here to babysit you, is that alright?&quot; I saw as my younger-self nodded his head with a goofy smile and my mother smiled back as she walked out of the door with me by her side. The mirror faded to black but a new silhouette appeared. This one was of a woman with a child on her lap and once color came, I saw it was my grandmother holding me in her lap as she read me a book during the night. I then realized something was very different about this vision, the thing that surprised me was that this story was not in my mother&#39;s room, it was in my room.</p>\n\n<p>I thought curiously about the mirror&#39;s new power that it just showed to me. Does that mean that it can see stuff outside the house as well or is the house its limitation? If it can see outside the house, does that mean this mirror sees all or is it limited to seeing one thing happen at a time? Have I possibly stumbled upon the most powerful object in the universe? Is this even safe to have?</p>\n\n<p>My mind wandered as I watch my grandmother place me down on my bed as I drifted to sleep. She was about to walk out of my bedroom but headlights appeared through my curtains as someone pulled into the driveway. My room faded to black as the mirror returned to its normal state and I was left to wonder about the power and capable of the object hanging in my office. It took about ten days for the next vision to appear and I was not ready for what it told. The story began with my mother and father in their car driving somewhere and once they arrived, they got out of the car and it was clear, my father was drunk while my mother was not and luckily, she was the one driving.</p>\n\n<p>She helped her intoxicated husband to the door before unlocking it and walking inside. They made their way upstairs and they both prepared for bed, which I tried my best not to watch happen. The two laid in bed as they attempted to sleep but it was suddenly interrupted by a sound from downstairs. More than likely knowing my dad couldn&#39;t help, my mother got up to check to see what was going on. Within a matter of seconds, my brain processed what was about to happen and I almost screamed.</p>\n\n<p>My mother walked downstairs and turned on the light but she was immediately shot in the head by one of the three men who were all armed with guns. The three ran upstairs and found my father who they found before shooting him and killing him as they moved onto the rest of the house. They checked the bathroom, the closet, and the guest bedroom before having one room left, my room. The door swung open as they all ran in with their pistols raised. My younger-self cried as they saw my grandmother who was sitting next to me trying to calm me down and they shot her, barely missing her heart and hitting her in the arm. She fell to the ground as she grabbed her shoulder and the three intruders pointed their guns at her and were about to shoot her but stopped as they heard sirens. They looked at each other and ran to finish stealing as much as they could from my house before driving away as fast as they could. </p>\n\n<p>The police arrived because my grandmother called the cops as she saw the car pull up and noticed three mysterious men get out before attempting to enter our home. But despite that, they somehow got away with it all and still to this day, the police were unable to figure out who those three guys were that robbed my house and killed my parents. Seeing that all play out made me cry as I slammed my foot down and cursed as the mirror faded to black. I couldn&#39;t express the emotions as I was feeling, I hated that mirror so much for showing me that but I didn&#39;t want to get rid of it. The possibilities that it held was too much so I simply stormed out of the room.</p>\n\n<p>It&#39;s currently been two weeks since that happened, I&#39;ve somewhat recovered from that event and since then, quite a few visions have appeared with most of them being about me but some weren&#39;t. Some have been about people I don&#39;t even know but who all have interesting stories and because of that, I made a decision. I&#39;ve decided to write out any future stories that I see from this mirror that doesn&#39;t have to do with my past. Those stories I&#39;ll keep to myself, they are personal after all. I will be writing notes about each story that I see as I watch them happen which means no detail will be left out. I will also be writing updates before some stories on the mirror itself and any weird things that may happen with it or that I think may be linked to it. Any questions you may have, I&#39;ll give my best answers to while writing those updates. That&#39;s all I have for today though, I hope you all enjoy the stories that are to come, I&#39;ll be posting them as soon as I possibly can.</p>\n</div>\n","author":"TheShadowOfWriting"}