{"rank":"0","title":"This isn't the first time I've dealt with the unexplained, and it isn't the last....(Pt. 1)","id":"8mnke7","url":"/r/nosleep/comments/8mnke7/this_isnt_the_first_time_ive_dealt_with_the/","time":"1527483568000","body":"<div class=\"md\"><p>Im usually someone who wants to do things with others. But recently, I&#39;ve been rather reclusive lately. It&#39;s just kind of hard to be around anyone lately, and it&#39;s beginning to affect me alot. I literally went out a couple of days ago, and I felt something I haven&#39;t felt in a LONG time. What&#39;s worse is that I might know why I&#39;ve been like this, and it&#39;s disturbing for me to remember it.</p>\n\n<p>I always believed that there was something ELSE all around us, and that it was just out of sight. So naturally, most people just lived in the &quot;out of sight, out of mind&quot; aspect of life. Now, I&#39;m not saying that people are negligent, or that everyone doesn&#39;t believe that something else exists around us, but it&#39;s a little complicated for somebody to believe what happened to me a couple of years ago. I mean, shit, my own father doesn&#39;t think I&#39;m honest when I remind him of what I&#39;ve went through. But hopefully there are people who read this might have shared the expirences I had, or something similar in regards to the topic that I&#39;m about to share. And if you haven&#39;t picked up on it, I&#39;m talking about the &quot;paranormal&quot;, the &quot;afterlife&quot;, the &quot;spectral plane&quot;, the &quot;other side&quot;, whatever it&#39;s called. </p>\n\n<p>One particular event happened in 2013, and I was finishing my first year of high school in 2013. I had made a couple of friends already, and  before the school year ended, I went to a restaurant with two of them. I&#39;m not going to disclose any names, but the two friends were a boy and a girl who were in a relationship with each other. Anyway, when we made it to the restaurant, I felt a cold chill pass through me. Now, I was living in Phoenix, Arizona at the time, and the weather there in May isn&#39;t described as &quot;chilly&quot;. More like the type of weather that is described as &quot;one of the Seven Circles of Hell&quot;. So I was confused when a very chilled wind hit my body even though the sun was radiating all the scorching UV rays.</p>\n\n<p>Then, one of my friends stopped suddenly as if he got slapped by his girl, who was my other friend. (Look, I was a VERY experienced third wheel by this time, so I didn&#39;t care much.) He turned around to look at me, and his face was in complete shock. I asked what was wrong, and he answered my question with another question: &quot;Did you feel that? That...cold chill?&quot; When he asked that question, I made the same shocked expression. But I did NOT want to think about it anymore, so I told him that I did feel it too, and it was probably just his parents opening the door into the restaurant. He shook his head in agreement, wanting to believe me, but even I didn&#39;t believe myself, because the chill wasn&#39;t like when the air conditioning turns on. It was a chill that made my hairs stand up, and made me break into a cold sweat once it was gone. And my </p>\n\n<p>Now, I watched a LOT of paranormal TV shows, especially one called &quot;Ghost Adventures&quot;. (No, seriously, that was a real show on the Travel Channel, of all channels.) And one of the signs of a &quot;presence&quot; was an unexplained drop in temperature. Another sign was if there was a &quot;presence&quot;, the electromagnetic field it created would make your body react to it by causing your body to have goosebumps and for your bodyhair to stand up. Now imagine a 14 year old who watches paranormal shows experiencing something that happens on those shows first-hand. I was freaking the FUCK out on the inside. Not just because of what happened, but the fact that my FRIEND also experienced what I did. But it didn&#39;t stop there. </p>\n\n<p>Once I got dropped off by my friends&#39; parents and thanked them for having me, I was drained and full of food. So I decided to take a shower and go to bed early. As I was taking my shower, however, the bathroom doorknob began to jiggle. I lived with three other siblings at the time, and we all played pranks on each other, as siblings do. So when I heard the doorknob, I thought it was my stepbrother. (He definitely was a piece of shit back then.) So I yelled out his name and told him to cut it out as I got out of the shower. A few seconds wents by, and I decided he heard me and stopped. That&#39;s when things went fucking DEFCON 1. The doorknob began to jiggle again, then went into a hard shake, then it began to jerk violently, and I began to feel the same chill I felt at the resaurant. All of the sudden, the door started to shake as well, as if someone was shaking the doorknob so hard that the door was being affected. Everything was happening so fast, I didn&#39;t realize that the door wasn&#39;t just shaking. It was being banged on, as if someone was trying to break in. I was so scared that I put my hands to my ears and yelled &quot;STOP!&quot; at the top of my lungs. Then everything went quiet. </p>\n\n<p>I was too stunned to move, I was too stunned to speak because of how sudden everything stopped. It was almost like I snapped my fingers, and the world stood still. I was shaking as bad as the doorknob, and I could feel my heart about to burst inside my chest. Once I could control my breathing again, I slowly moved to the door, unlocked it, and swung it open. Nothing. Nothing but the stairs leading down to the living room, which was lit up by two lamps, and darkness coming from all the bedrooms around me. No noise coming from the living room TV, no noise from the sink in the kitchen, not even all the diffent kinds of music that can be heard from the different bedrooms. ABSOLUTELY. FUCKING. NOTHING. To my horror, I realized that everything was quiet because the rest of my family was at the movies, and they weren&#39;t home yet. I forgot that detail as I was about to shit myself a couple of seconds before. </p>\n\n<p>I didn&#39;t tell ANYONE about the bathroom incident, even though looking back, I really should&#39;ve said something. I just wanted to forget about it ever happening, but to my disdain, something wasn&#39;t done with me yet. Threeyears went by and soon it was senior year for me now, and I swore into the military after my winter break. Everything was actually going well. Until the weekend of my first schoolweek back came. And I learned that one of my family members commited suicide. This is where I experience my personal dive into depression.</p>\n\n<p>All I could think about for three months was, &quot;I didn&#39;t help. Why couldn&#39;t I have done something? Anything?&quot; But my great-grandfather put it to me this way: everyone has a choice to make in their lives that can change the course of their life forever. When that choice comes around, the person will have to decide whether they want to make it or not. And for my family member, the choice was made, and their life was the result. At first, it sounded weird to me. Then it came to me: my choice is to live this life that was given to me. I decide to be alive day, after day, after day. And I won&#39;t stop until I decide that it&#39;s time for me to die. That was what got me out of my depression. But whatever caused the bathroom incident didn&#39;t give two shits about my depression, because it came back again. </p>\n\n<p>It was three and-a-half months since my family member&#39;s death. I just got back from school, and my senior year was almost up. I had so much going on in my life that I essentially lived my life by naps. So, once I got home, I took a nap. I would still be depressed from time to time, but I was able to go out more, eat alot more, and feel alive again, but it still stung like a ripped off Band-Aid now and again. Taking naps helped me feel better at dealing with my depression. This nap I took wasn&#39;t like any of my other naps, though. Once I woke up, I felt.......worse. I felt like curling up into a ball, cry my eyes out, and then die. This wasn&#39;t how I usually felt at all after waking up from a nap. Unless..... these weren&#39;t my feelings at all. I sat up from my bed, and what my eyes fell on in that moment was something I struggle to describe in person to this very day. </p>\n\n<p>Imagine a woman that just tucked her child into bed, looking over her shoulder to look at her child before she closes the door so that she can go to bed too. Now try to picture that image, but the woman is a corpse. That is what I saw when I sat up in my bed. My throat was closed shut, my jaw was dropped to the floor, and my eyes were full moons trying to understand what the fuck I was looking at. What really freaked me out was the similar feeling I had when the bathroom door was attacked. The same cold chill, the hairs on my body standing up, the familiar goosebumps. This was what tried to get into the bathroom that night. And all I could do was sit in horror. </p>\n\n<p>She then turns around, takes three steps out of sight, and whatever I was feeling before was instantaneously gone. I sat there, stunned yet again on what just took place, and to this day, I haven&#39;t seen her since. But the feelings that I had with the bathroom incident, and when I saw the woman, always comes back. The cold chills, the severe depression, the goosebumps and the standing bodyhair, it all occurs now and then, but it has not stopped completely. I always sense those feelings now and again, and what makes this all the more real is that two of my three siblings have seen her too. The feelings I get, they get too. And it hasn&#39;t stopped for them either, because they text me now and then about how &quot;the feeling&quot; came back. And how it won&#39;t stop for them, either. You can believe me or not, but what I experienced.....was all too real to me.</p>\n</div>\n","author":"thtcrazyMF"}