{"rank":"27","title":"I Think This Town is Losing It","id":"8mnpdp","url":"/r/nosleep/comments/8mnpdp/i_think_this_town_is_losing_it/","time":"1527485127000","body":"<div class=\"md\"><p>I grew up here.  </p>\n\n<p>Now let&#39;s get two things straight: I&#39;m an alcoholic and I&#39;ve been doing this for long enough that the difference between sober and drunk is I&#39;m worse off sober. And I haven&#39;t been doing it for long enough that Wernicke-Korsakoff is kicking on my door just yet. The courts put me through a rehab, I&#39;m sober more than I&#39;m drunk since that, but this all happened while I was drinking and I still am.  </p>\n\n<p>And let&#39;s get another thing straight. I&#39;m not a stereotype, I may be drunk and a writer, but I&#39;m a lot of other things. For one, I&#39;m an expert on the occult. A practical expert, not the kind you find writing books. Hasn&#39;t done a damn thing for me but make me a bit of cash here and there and have me studying old grimoires, crunching numbers, and critiquing forums but it kind of is what it is. I&#39;m also damn good in the woods, a fine shot, and a decent boxer.  </p>\n\n<p>Used to be a dealer too. Not the homie who sold your friend a dime sack, not even the guy who sold him his sacks. I organized things, had a good head on my shoulders before all the booze. I was the guy no one really knew, who backed endeavors. Mid-level management, but I was effective and I ran my crew tight. We didn&#39;t run with anyone in particular, but we had our market and I moved the drugs. Sold a lot of other stuff too. Non-affiliated I could work as I pleased. I did clean business and made sure anyone who fucked me got theirs.  </p>\n\n<p>The other stuff I&#39;m not proud of... but hell, you know what someone will pay for a real Nazi flag or a pair of bootleg Levi&#39;s? Or maybe a mongoose? If it sold, I&#39;d find it and sell it as long as the margin was good enough. What I was real good about was not getting caught.   </p>\n\n<p>Working with me? It was a good deal for most guys, but I had requirements. You have a drug charge? Out. You have a DUI? Out. You beat on your old lady? Well, chances are you wouldn&#39;t try because if I knew &#39;em you&#39;d have already stopped or been beaten into paste and dropped off on the roads in the middle of nowhere enough times you&#39;d learned that ain&#39;t right. I was peculiar about my guys, even fickle at times, but no one caught charges before I left the game. Most of them are dead or in prison now, and those who aren&#39;t I&#39;m tight with. As equals, not as an employer.  </p>\n\n<p>These days? I&#39;m a freelance writer who&#39;s drunk most of the time and notorious for delivering good work late and disappearing... mostly to get drunk. I always wave it off though, jail time or mental problems or moving around a lot trying to find a new place. Usually half-true, I&#39;ve avoided jail time, although I can talk-the-talk. My conversion numbers usually speak for themselves and I work cheap. I don&#39;t need much, I&#39;ve been living out of two bags for years.  </p>\n\n<p>So, I lose residence in a sober living house. Not new, or unusual. I can keep straight for six, maybe eight months at a time, but you combine a relatively smart mind, physical addiction to alcohol, and depressive disorders together? You try it some time, it comes down to cut, kill myself, or a couple of shooters. The cutting is alright for a bit, but it&#39;s not sustainable. So I go for the shooters and then that turns into a bender.  </p>\n\n<p>Just like right now. The place I was in, I was the assistant manager. Manager was a fucking kid, I&#39;d detoxed off of heroin more often than him and I didn&#39;t even like the stuff. Bunch of talk about &quot;weed, LSD and hitchhiking&quot; and regretting it. Sounds like a good time to me and the guys didn&#39;t respect him. So, I ran the place. Was what it was. Met some nice people, got some tattoo, fucked off my life again when he caught me daydrinking. It was close enough to my mom&#39;s I ended up back here. She always wants to believe in me.  </p>\n\n<p>Our relationship isn&#39;t great, but it is what it is. She beat the shit out of me as a kid and verbally abused me. We get along now, I&#39;d been going to lunch with her weekly and borrowing money regularly.  </p>\n\n<p>Let&#39;s be clear, I&#39;m not a good guy. I&#39;m not a bad guy. I&#39;m a smart guy. I fix problems and I make things work for me. Not like I haven&#39;t been on the streets before. So don&#39;t judge too harshly.  </p>\n\n<p>I was still drinking when I ended up here. I&#39;d been holed up in a motel for three days. My conscience got the better of me after I falsified a drug test for someone and... well, I had enough cash to hole up for three days and drink vodka. Fuck it, let&#39;s do that. Manager was dumb enough I had a good knife and my gear after eight months in the place and... hell, I know this area. Good knife and some paracord could fix most things, except for booze and TV so I holed up and decided to figure it out.  </p>\n\n<p>Ended up back here. My mom is listed as my emergency contact most of the time and she got called and she offered me a spot on the couch. Mom&#39;s a drunk too, she&#39;s just a bit better at it and I was fine so long as I kept it on the down low. She swears she can see even a beer in me, I&#39;d contest that, I can drink two 24oz cans of 8&#37; and she won&#39;t notice a thing.  </p>\n\n<p>So I&#39;m back and I&#39;m trying to decide what to do. I go for a lot of walks to the local store which is a considerable distance away. I run out of money and I&#39;m not working. Trying to think up an excuse for my clients, gotta be consistent about these sorts of things. I&#39;m trying to kick the booze again, and it&#39;s not working. Lot of stolen change and stolen booze running around the house, but mom is scared I&#39;ll fuck off again and disappear for good.  </p>\n\n<p>So I turn into the town drunk in a hurry. I&#39;m usually loaded as hell or withdrawing(which is really hell) and running down to the liquor store.  </p>\n\n<p>Now I respect my mum. I do things quietly. So it&#39;s a lot of weird, sneaky, shit going on because I don&#39;t want her to think I&#39;m drinking again. But she works nights, and I&#39;m a deceptive bastard. I have a reputation for a reason in the right circles, although your ground level thugs won&#39;t know who I am.  </p>\n\n<p>I made a deal a long time ago. I put Mercury and Thoth all down my right forearm, with as many references as possible and I get away with shit. I was good before, I got better after. Maybe experience, maybe the deals. I&#39;m not sure, but I know my shit and I went through the whole &quot;physical evocation&quot; shit to make those deals before I put this ink on my skin.  </p>\n\n<p>So I steal some change and I snatch a bike from the backyard. I&#39;m riding down the street, and I notice a lot of roadkill. More than normal, and I&#39;m down this road a few times everyday. Mostly birds, but I stop because there&#39;s a fresh cat sitting there. Off the road. White and orange, pretty thing. If it&#39;s off the road it might be alive though, so I dump the bike real quick and take a look. I may not like people, but I&#39;m soft for animals.  </p>\n\n<p>I check the eyes first. Ants mean it&#39;s been dead and I&#39;m wasting my time. No ants. I check it&#39;s pulse afterwards, it&#39;s still warm but dead. I take a look at it for a little bit. I like to hunt, I like to eat things. I&#39;m not a coroner but I do know certain things, and I realize it&#39;s ribs are intact after a couple of seconds. If it was roadkill, the ribs would be pretty fucked up if it was dead and not crawling around mewing. Legs are intact. I poke at it&#39;s head, since there&#39;s a bit of blood coming out of the mouth.  </p>\n\n<p>Single depression, right behind the left ear. Feels about right for a hammer. The poor little bastard isn&#39;t even cold yet, so I take off, grab my beer, and drink one before going to the house next door and asking for a shovel. Can&#39;t be showing up all sweating and red-eyed, one will get me right. I sit down for a second, waiting for the chugged beer to hit, and think about it. Someone killed that cat. With a hammer or other direct concussive instrument.  </p>\n\n<p>Not a stick, like a kid would use. That&#39;d leave a long lateral blow with a heavy point of contact. Single point, behind the ear. Deliberate kill.  </p>\n\n<p>My apologies for anyone reading this in a Southern accent, I picked it up from my father and I know it sounds uneducated. I slip into it sometimes while drinking, a half Californian-half Southern accent. Sets people off, I prefer clipped English most of the time. I barely graduated high school, but I am a damn writer.  </p>\n\n<p>So I think about all the dead birds for a second. I&#39;ve shot a lot of them in my time on this planet, so I know how to check for pellet wounds. I make a damn fool out of myself, half-buzzed looking at &quot;roadkill&quot; for wounds. I notice the blackbirds are aggressive with me, trying to chase me off but fucking off when I chirp back at them. Learned that one as a kid, must be mating season.  </p>\n\n<p>Most of them show a broken neck and no other wounds. That&#39;s not right, it&#39;s hard to get your hands on a finch or blackbird or jay. A couple show pellet wounds. One has no apparent cause of death. Now keep in mind this is only a three quarters mile ride, I find and inspect sixteen birds and a rat along these lines.  </p>\n\n<p>Rat&#39;s been dead for awhile. Pellet in the neck. Looks like a .22 which... means it got shot in the road. Or rather the shoulder, since it&#39;s lying there. None of these have been hit by a car. I grew up here, I know this road is heavily trafficked, I&#39;ve moved opossum and raccoon and skunk off this road before just to keep them from being hit until they&#39;re flat. I&#39;m used to seeing one or two kills a month on this road, animals are pretty good about picking up it&#39;s a bad idea.  </p>\n\n<p>Now I&#39;m a drunk, but all of that looks weird to me added up together.  </p>\n\n<p>What also looks weird? The kids sitting on walls along this road. A lot of dropped back left hands, and I know that fucking pose. I may just look like a hipster, but you do that to hide a gun. I&#39;ve done it before.  </p>\n\n<p>I think this town is losing it&#39;s mind. I&#39;m going to check the park tomorrow for real answers, there&#39;s an old grove back there I learned a lot from.  </p>\n\n<p>In the mean time, I just hope they quit killing things.  </p>\n</div>\n","author":"JesterTheSun"}