{"rank":"3","title":"Eyes","id":"8mnrcn","url":"/r/nosleep/comments/8mnrcn/eyes/","time":"1527485765000","body":"<div class=\"md\"><p>I shared a few beers with the neighbors, as is tradition for Memorial day, no?  I awoke to an alarm at 1 am, threw on some ratty clothes, and started the charcoal chimney.  Brisket.  It takes about 12 hours to cook thoroughly.  I made sure to take some to my awesome neighbors, including some asparagus, potato salad, and rolls.  Neighbors.  They take care of me, and I take care of them.</p>\n\n<p>An argument occurred in the twilight of the evening.  Was that a star, or a planet... or a satellite?  Well... I know, for sure, the answer, but do I show my hand?  I explained geostationary orbit. I explained Tidally locked orbit.  The argument kept going. Trying to negate the argument, I explained that the &quot;star&quot; that they saw was &quot;East 392&quot;, a repeater satellite only in orbit for aerospace communications. They both accepted the explanation for the red star, and the conversation split from that to some other drunken ridiculousness... </p>\n\n<p>Fast forward a few hours. I have returned to my own home.  Memorial day weekend... beer, brisket, and camaraderie, right?</p>\n\n<p>I step out to smoke, and the &quot;star&quot; I hope to be there is, in fact there.  Venus.  It shines and twinkles in such a way... it makes me shiver. The red star shimmers in the new summer atmosphere.  It dawns on me that I need to relieve myself... badly.  I do so, still smoking my cigarette.  I finish, zip up, still smoking, still gazing at this planet, gorgeously glimmering in my sky.  A few puffs, I&#39;m almost done.  </p>\n\n<p>I hear what sounds like another male relieving himself... Brad, my neighbor.  I give it a few minutes, then walk up the path with my beer and pack of cigarettes in hand.  Noone.  The porch lights are off. There is noone outside.  OK.  I walk back down the path and light another cigarette. I hear nothing.  Not the sound of my own air conditioning unit, nor the neighbor&#39;s.  I hear no bugs, no frogs, no wildlife whatsoever.  Stern silence.  Out of morbid curiosity, I reach inside and grab a small LED flash light.</p>\n\n<p>A few weeks prior to this, I arrived from out of the country. It was a LONG day.  I arrived at my home airport very late at night, and was given a ride to my vehicle by a coworker.  Upon returning home, due to the amount of luggage I had, I backed into the driveway.  Just as I reached to turn off the lights, and did, I saw a figure standing in the woods in front of me....and then blackness, as I cut the lights.  I turned them back on, and nothing.</p>\n\n<p>&quot;It has been a hellishly long day.  It was nothing.&quot;</p>\n\n<p>I unpacked my bags and crashed.</p>\n\n<p>Welcome back to memorial day weekend.</p>\n\n<p>I step out to smoke.  The &quot;star&quot; I hope to be there is, in fact there. Venus.  It shines and twinkles in such a way... it makes me shiver. The red star shimmers in the new summer atmosphere.  It dawns on me that I need to relieve myself... badly.  I do so, still smoking my cigarette.  I finish, zip up, still smoking, still gazing at this planet, gorgeously glimmering in my sky.  A few puffs, I&#39;m almost done.  </p>\n\n<p>I hear what sounds like another male relieving himself... Brad, my neighbor.  I give it a few minutes, then walk up the path with my beer and pack of cigarettes in hand.  No one.  The porch lights are off. There is no one outside.  OK.  I walk back down the path and light another cigarette. I hear nothing.  Not the sound of my own air conditioning unit, nor the neighbor&#39;s.  I hear no bugs, no frogs, no wildlife whatsoever.  Stern silence.  Out of morbid curiosity, I reach inside and grab a small LED flash light.</p>\n\n<p>I shine the flashlight into the woods directly in front of my house, and I see the figure, for no more than a split second... The eyes glowed with hellish fire, but for a split second, then dissapeared.  I turned the flashlight off, then back on again (c&#39;mon, you&#39;d have done the same).  Nothing.  As soon as I entered my house, I had forgotten what I was doing. I questioned why I had a flashlight in my hand.  I needed a cigarette.  </p>\n\n<p>I shared a few beers with the neighbors, as is tradition for Memorial day, no?  I awoke to an alarm at 1 am, threw on some ratty clothes, and started the charcoal chimney.  Brisket.  It takes about 12 hours to cook thoroughly.  I made sure to take some to my awesome neighbors, including some asparagus, potato salad, and rolls.  Neighbors.  They take care of me, and I take care of them.</p>\n\n<p>An argument occurred in the twilight of the evening.  Was that a star, or a planet... or a satellite?  Well... I know, for sure, the answer, but do I show my hand?  I explained geostationary orbit. I explained Tidally locked orbit.  The argument kept going. Trying to negate the argument, I explained that the &quot;star&quot; that they saw was &quot;East 392&quot;, a repeater satellite only in orbit for aerospace communications. They both accepted the explanation for the red star, and the conversation split from that to some other drunken ridiculousness... </p>\n</div>\n","author":"shiv11fourty1"}