{"rank":"8","title":"The Circus Clown","id":"8mnslx","url":"/r/nosleep/comments/8mnslx/the_circus_clown/","time":"1527486163000","body":"<div class=\"md\"><p>&quot;Come on! Let&#39;s go!&quot; My little sister says as she tugs my arm. &quot;Okay, okay, Samantha. I don&#39;t walk at Sonic Speed y&#39;know.&quot; I say chuckling.</p>\n\n<p>She rolls her eyes at me as we finally enter the circus. &quot;Mikey, thank you so much for taking me here! I know mommy and daddy don&#39;t have a lot of money, and you probably used all of your savings to take me here so...&quot; She says fiddling with her fingers.</p>\n\n<p>I put my hand on her head smiling. &quot;You smiling and happy means that all my hard work was worth it.&quot; </p>\n\n<p>She beams as we take a seat on the very front row. She begins squealing and jumping around in her seat, excited as the show begins. We see some jugglers, an elephant painting, pretty much anything that you would ever see in a circus.</p>\n\n<p>When the clowns came out, that was when I covered my eyes. Clowns have always creeped me out. I don&#39;t know why. There is something about them. Their aura, this energy that they give off that makes me uneasy.</p>\n\n<p>After a few minutes of covering my eyes, I take a peek to see if the clowns are gone. They aren&#39;t. One of the clowns, the one in the center, turns their head and looks at me straight in the eye. </p>\n\n<p>I could feel a chill run up my spine and I quickly covered my eyes again.</p>\n\n<p>About an hour and a half later, the show is finally over. Me and Samantha walk out, as she rambles on and on about everything that happened, and how she was so happy.</p>\n\n<p>Passing some people in the crowd, in the corner of my eye I see someone. White face, red nose and lipstick.</p>\n\n<p>I turned to look, but there was nothing there. Just a bunch of people passing by. &quot;Hey.. are you okay, Mikey?&quot; Samantha asks, looking up at me with worried eyes.</p>\n\n<p>&quot;Yeah. I&#39;m fine.&quot; </p>\n\n<p>It must have been that clown that looked at me during the show. It probably made me paranoid. I just have to forget about it.</p>\n\n<p>We arrive home, and Samantha runs up to our parents telling them about the show. I walk upstairs and into my room. I sit on my bed and begin counting my money. </p>\n\n<p>I&#39;m only left with 40.34$. I need to start working really hard if I&#39;m going to be helping my parents pay for these bills. At this rate, I don&#39;t even think we&#39;ll be able to afford this house much longer.</p>\n\n<p>&quot;Ssh...&quot;</p>\n\n<p>&quot;It&#39;s okay..&quot;</p>\n\n<p>&quot;I can help...&quot;</p>\n\n<p>I look up. </p>\n\n<p>I look around my room, but I don&#39;t see anything.</p>\n\n<p>I should probably get some sleep. </p>\n\n<p>The next morning when I wake up. I take a shower and then I begin to make my bed. When I pick up one of my pillows, I find a stack of 100 dollar bills.</p>\n\n<p>&quot;What the... how did this get here?&quot; I say as I pick up the money.</p>\n\n<p>&quot;A hundred... two hundred... three hundred..&quot; I then begin counting the money in my head.</p>\n\n<p>This is over a thousand dollars...</p>\n\n<p>I run down stairs quickly with the money in my hand. I show it to my parents, and they become excited as they take the money out of my hand. Jumping around in excitement knowing that they will be able to pay their bills, I still stand their with confusion.</p>\n\n<p>&quot;But mom, dad... how did this get under my pillow?&quot;</p>\n\n<p>&quot;Mike, that doesn&#39;t matter. What matters is that we have enough money to pay off these bills!&quot; My mother says in excitement.</p>\n\n<p>I then saw something in the corner of my eye. Exactly what I saw yesterday, but this time I didn&#39;t turn to look at it. I just kept staring at it from the corner of my eye.</p>\n\n<p>It&#39;s face, it&#39;s definitely a clown. It was grinning. </p>\n\n<p>A month later, I&#39;m in my room. I&#39;m sitting on my bed, doing homework. But that&#39;s when I look up. I see a clown, the clown from the circus that looked at me. It Siting on my bed, just across from me.</p>\n\n<p>The clown grins devilishly. He then looks at me and says, &quot;Are you going to pay me back?&quot; </p>\n\n<p>I stay silent for a few second, then I begin shaking in fear. </p>\n\n<p>&quot;Pay you back.. for what?&quot; I say clenching onto my bed sheets.</p>\n\n<p>He grins once again.</p>\n\n<p>&quot;The one thousand and fifty dollars that I lent you. You didn&#39;t forget, did you? I left it under your pillow. And you never paid me back.&quot; The clown says, clenching onto the bed sheets as well. </p>\n\n<p>I look down at his hands grabbing onto the bed sheets, and then back up at him.</p>\n\n<p>&quot;...What do you want?&quot;</p>\n\n<p>&quot;Well...&quot; The clown stands up and faces the wall.</p>\n\n<p>&quot;I want...&quot;</p>\n\n<p>&quot;Samantha.&quot; The clown says with a voice sounding so deep. It is exactly as you would imagine Satan&#39;s voice sounding.</p>\n\n<p>&quot;Tell me Michael.&quot; The clown comes very close to my face. He looks into my eyes, and into my soul.</p>\n\n<p>&quot;Are you willing to pay up?&quot;</p>\n</div>\n","author":"carpdiems"}