{"rank":"558","title":"We were sent to investigate an obscure drilling rig in the desert","id":"8mnx0q","url":"/r/nosleep/comments/8mnx0q/we_were_sent_to_investigate_an_obscure_drilling/","time":"1527487635000","body":"<div class=\"md\"><p>To make my introduction incredibly simple… I used to work for the US government. I say ‘used to’ because I really don’t know what’s going to happen to me now. </p>\n\n<p>Now, I didn’t have a glitzy office job or anything. I was more of a field agent. Military, if you will. But not quite. I’m not going to go into the intricacies of which branch I specifically worked for and what I did, exactly. That’s irrelevant, and in all honesty, you probably wouldn’t really want to know. </p>\n\n<p>Well… I doubt if you’ll really want to know <em>this</em> either. But I feel as if it’s pertinent that this story gets out. We’re dealing with something that nobody here quite understands. And we’re the ones that are supposed to understand everything. </p>\n\n<p>You see, there’s a drilling rig located somewhere in the Kalahari Desert. You’re not supposed to know about it. In fact, it’s so deep in the middle of nowhere that nobody could feasibly stumble upon it. Hell, I barely knew shit about it when I was first called up for the mission. The only information that I really had regarding the place was that the FBI had started an investigation into it back in June 2013, after discovering that some kind of anomalous event had occurred within the vicinity. That&#39;s all I had going into this. </p>\n\n<p>Here was the rundown of what we were told beyond that:</p>\n\n<p>It was a hostage situation. A few workers had gone crazy and were holding the other employees there at gunpoint. They didn’t list any explicit reason for this, so the assumption was that they’d fallen victim to some kind of desert madness.</p>\n\n<p>Or at least… this is what <strong>we</strong> were told. </p>\n\n<p>Anyhow, our job was to go in there and defuse the situation. We were supposed to try our best to not kill anybody. The key word there was “try”. No guarantees here. Now, any old SWAT team probably could’ve handled a situation like this. I mean, we were essentially dealing with petroleum engineers, not a trained militia. However, this place was so confidential that any non-essential personnel were to be absolutely barred from any knowledge that it existed. I suppose that we barely made the cut regarding who was ‘essential’ or not.</p>\n\n<p>In retrospect, I should’ve asked more questions. Questions like why they were being so secretive about this place and why we needed 36 men go undertake what one small squadron would surely be capable of doing. </p>\n\n<p>Truth is… after a while you stop caring. But that all changed this time. This isn’t something that you can just write off. </p>\n\n<p>We flew out there in a fleet of 3 aircrafts, split into 12 people each. The only people that I’d recognized on mine were Klaus and Buchanan. We’d worked with each other before. Every other face was a stranger to me, but that didn’t really matter all too much. All that mattered was getting in, finishing the job and getting out as fast as possible. That’s all that ever mattered. </p>\n\n<p>The journey itself took quite a while, but that was expected. What I saw when we got there though… not so much. </p>\n\n<p>The rig itself and the surrounding buildings weren’t anything spectacular on the surface. The part that made no sense to anybody was the fact that it was located on the edge of a huge-ass cliff. Buchanan put it perfectly: </p>\n\n<p>“Kinda defeats the purpose of a rig, doesn’t it?”</p>\n\n<p>When we landed, it became apparent that the place actually extended down into the cliff via stairs, ladders, elevators and tunnels. The entrance was essentially a small, gated building that provided access to the first set of stairs.</p>\n\n<p>The plan was to go like this:</p>\n\n<p>Since the place was too tight for 36 people to enter at once, we were going to be split into 3 groups of 12.  If the first group ran into trouble, they’d send down the second. If that failed, then the last group would have to step in. So ideally, the 2nd and 3rd groups wouldn’t even be necessary. They were just there as a fail-safe of sorts. I was part of the 2nd.</p>\n\n<p>Now, I’ll be honest, I wasn’t really taking this whole thing too seriously at that point. I mean, we were dealing with some batshit workers who presumably only had access to basic weaponry. Besides, I was pretty sure that if the perpetrators got a bit too rowdy, the first group would just end up wasting them, possibly at the expense of a few innocents being injured. In other words, they weren’t going to need us. </p>\n\n<p>Evidently, some of the guys in my squadron felt the same way. Klaus even found a fridge with some beers in one of the surrounding cabins, and we finished them off while our supervisors weren’t looking. </p>\n\n<p>But after about two hours of dicking around, we were informed that we needed to head down. </p>\n\n<p>Most of us stood there in disbelief for a while. The supervisors were forced to bark at us a couple of times in order to stir a reaction. </p>\n\n<p>We eventually complied. I mean, we had to. However, the implications of the fact that <em>12 trained men armed to the teeth</em> couldn’t finish the job were undoubtedly weighing down on us. I mean, we were pretty much expendables going into an unknown situation. </p>\n\n<p>Suddenly, I was glad that we had those few beers to keep our nerves in check. </p>\n\n<p>As we got to the mouth of the entrance, one of our supervisors (I think his name was Richter), swung open the large, metal gate that was guarding the place. </p>\n\n<p>We all poured into the structure and found ourselves standing in what appeared to be a reception area. It was a small space, with a few desks and filing cabinets along with a singular, metal vault-like barrier. Richter walked up to it and entered a code into the panel beside it.</p>\n\n<p>It opened up and we were suddenly faced with blackness. We all flicked on our rifle lights and descended the steps. From what I could tell, there seemed to be lightbulbs above but I guess they weren’t working for whatever reason. The steps themselves branched off quite a bit, I’d estimate probably once every 50 meters. However, we never went anywhere but straight. Richter just told us to keep going down. </p>\n\n<p>After what might’ve been twenty minutes, we finally reached what appeared to be some kind of mixture between a lab and a control room. There were monitors and scientific instruments set up in a relatively haphazard manner across the large, rectangular space. However, there <em>were</em> lights here, so I let my breathing loosen a bit. I never really liked the dark too much. </p>\n\n<p>Richter told us be quiet as he moved towards a door near the back of the room, almost as if he were listening <em>intently</em> for something. However… there was nothing to be heard. It was sheer silence. </p>\n\n<p>I could tell that Richter’s expression had plummeted when he looked back at us. He motioned us over, towards the door and whispered: “Keep your guard up”. </p>\n\n<p>With an extreme sensation of reservation filling the air around us, we all just followed his orders. Ever so slowly, he started opening the door. Now, I should’ve expected what we were about to see. I should’ve been expecting <em>anything</em>. But I still couldn’t stop myself from gagging a little. I’d seen death before, but not like this. </p>\n\n<p>The entirety of the first team was lying there limp, chaotically dispersed across the white floors of the hallway. It was an absolute gory mess. It was <em>strange</em> as well. The bullet holes on their bodies seemed too large. Like they were the result of a 50. Cal sniper. But who’d be sniping in such close proximity? </p>\n\n<p>At this point, it was safe to assume that we weren’t simply dealing with rig employees. Our superiors had either lied to us or were out of the loop themselves. I was leaning towards the former. Wouldn’t be the first time that it’d happened. </p>\n\n<p>Richter held up his hand, signaling for us to halt. In all honesty, I couldn’t be too mad at him. He also looked terrified. </p>\n\n<p>After a moment of excruciating hesitation, he finally motioned for us to enter the hallway. I suppose that we still had a job to do, after all. </p>\n\n<p>We moved with absolute caution, making minimal noise and trying not to disrupt the bodies. Just like the staircase, the hallway branched off quite a bit, but we always just went straight. Eventually, we reached a larger, rusted metal door at the end. It was marked by large, red letters:</p>\n\n<p><strong>INSPECTION ZONE: MAXIMUM CLEARANCE NEEDED</strong></p>\n\n<p>There was another panel to the side of it, which also included what looked like a fingerprint scanner. We all looked at Richter, trying to anticipate what the hell our next move was going to be. </p>\n\n<p>After what felt like an eternity, he finally walked up to it, entered a password, and scanned his thumb. We started to brace for whatever was coming.</p>\n\n<p>However… I don’t think we could’ve ever been prepared for what was waiting for us on the other side. A deafening alarm accompanied by flashing red lights washed over us as the metal barrier began sliding open. It was a massacre that followed. </p>\n\n<p>A barrage of ammunition started decimating our group. But since I was near the back, I didn&#39;t get the full brunt of the assault. However, there was no way in hell that I was going to try returning fire. That would&#39;ve been futile. I got a brief glimpse of who was firing at us before turning around and bolting.</p>\n\n<p>I could only assume that they were some kind of infantry unit… from a place far more technologically advanced than here. They had on what appeared to be shiny grey exo-suits that followed their every moment with precision. Their weapons were also something else, barely yielding any recoil as they tore through their targets.</p>\n\n<p>Motivated by the sounds of carnage, I just ran the other way. I knew that going straight wasn’t an option, so I ducked into the first branched pathway that I came across. I started weaving my way around the maze of corridors, trying to get away from whatever the hell was going on. </p>\n\n<p>The gunshots have long since ceased, and at that point, my footsteps were the only audible sounds. I didn&#39;t know where I was, but at least I was still alive. I stopped and leaned against a wall, trying to catch my breath. I nearly had a heart attack when I felt a metal hand cover my mouth and pull me into a corner. </p>\n\n<p><em>It was one of those soldiers</em>. The guy came from nowhere. I instinctively put my hands up in a “please don’t kill me” position. After a few seconds, the soldier pressed a button and his helmet retracted into the suit, revealing his face. </p>\n\n<p>We just looked at each other for what felt like an eternity. His face was blank, with a hint of subtle surprise accentuating his expression. It felt weird at first but… he almost looked <em>familiar</em> somehow. After an indeterminate amount of silence, he chuckled. </p>\n\n<p>“Never thought I’d get this chance…”</p>\n\n<p>After I let the initial shock wear off, I try pestering him with questions, but the words all stumbled out in a incoherent mess. </p>\n\n<p>“It’s alright.” He stops me. “It’s a long story, but I’ll explain everything.” </p>\n\n<p>He looks around before continuing. “Hopefully we have enough time.” </p>\n\n<p>What he ends up telling me puts me into a state of absolute incredulity. </p>\n\n<p>As it turns out, the soldiers that just mowed us down had come here from the future. 2143, to be exact. Yes, we were dealing with time travel here. Look, I don’t want to believe it either, but it is what it is. They’d been sent back for the sole purpose of making sure nobody made it past the inspection zone. </p>\n\n<p><em>So what was beyond that point?</em></p>\n\n<p>“Something primal… something that was never meant to be disturbed.” The soldier tells me. “There’s a bunch of theories about how it got there, but all of them lead to the same conclusion. We cannot fuck with it.” </p>\n\n<p>He tells me that once we started digging into the Cliffside in an attempt to find out what was going on, we ruined the future for everybody. <em>We unleashed this thing</em>. </p>\n\n<p>The soldier sighs, before taking a seat. “But you weren’t the only ones that fucked up. We did too.” </p>\n\n<p>Apparently, during the chaotic aftermath of whatever we’d released to the world, the quest to perfect time travel was forced to be expedited. They needed to erase this event <em>immediately</em>. That meant cutting some corners. The first team - which consisted of around fifteen people, was supposed to be sent back to the winter of 2014 – the actual time during which we supposedly started constructing the rig. They wanted to end it before it started. However… the technology was simply not ready yet. </p>\n\n<p>Instead, they were accidentally dropped around June in 2013.</p>\n\n<p><em>Wait</em>. 2013 June. That’s when this whole thing started. <em>It wasn’t the winter of 2014</em>. </p>\n\n<p>I looked up at the solider, and he just nodded, as if he knew that I’d just connected the dots. </p>\n\n<p>“So you can see where we catastrophically messed everything up, right?” </p>\n\n<p>I needed to think about it some more. <em>It couldn’t be, right?</em> </p>\n\n<p>Apparently, when the first team of 15 were sent back, they triggered something. It might’ve been some sort of seismic event or unnatural spike in radiation that caught the attention of the US government. In addition to this, the pod that was supposed to contain their water and rations had been dropped nearly 400 miles away from where they were. In short, all of them died in the desert before they could even warn anybody about this. </p>\n\n<p>In their attempt to stop people from discovering the monstrosity located within the Cliffside, they were the ones that caused them to <em>look for it in the first place.</em> </p>\n\n<p>“Predestination.” I found myself whispering. The soldier simply nodded. “We created some kind of fucked up self-fulfilling prophecy. It doesn’t really make a lot of sense to me, but I’m irrelevant here. I didn’t help design that goddamned time machine.” </p>\n\n<p>“So what the hell did we release?” I ask him. “What’re you guys trying to protect?&quot;</p>\n\n<p>He chuckles again, although a sneer would probably be a more apt description of the sound he made. “We weren’t trying to protect that fucking thing down there. We were trying to protect humanity. We need that thing to remain dormant for <em>as long as possible.</em> There’s nothing we can do if it wakes up naturally, but we sure as hell can’t be the ones that cause it.” </p>\n\n<p>I still don’t quite understand what I’m hearing, but it doesn’t stop me from pressing him further.</p>\n\n<p>“So why are you guys here now? It’s 2018, did the machine fuck up again?” </p>\n\n<p>The solider nods. “We couldn’t risk another mission landing before the discovery, so we needed to make sure that we were sent back at some point afterwards. As it turns out, that ended up being a few days ago. We still couldn&#39;t control when exactly we landed, so this is what we got.”</p>\n\n<p>“So what the hell are you supposed to do now?” I asked him. </p>\n\n<p>He looks up at me, with an expression that I can only describe as sheer disconcertion on his face. </p>\n\n<p>“We kill everybody that comes here. That included the employees, and whoever’s sent here to investigate.” </p>\n\n<p>My heart drops a bit. I feel anger rising in my system for just a second, before ultimately realizing why this may be necessary. A hundred lives taken today is worth saving humanity in the long run. </p>\n\n<p>“You guys are close.” He says. “Close to drilling into the beast’s lair. We have no time to try and convince you to stop. There’s only 15 of us, after all. In our timeline, you guys initially disrupted this thing at the end of this year. You saw the sheer scale of this creature and decided not to provoke it any further. However, by that time it was too late. This thing reacts rather slowly, but the results are always apocalyptic in the end. It woke up 124 years later to find a massive hole that led to the outside world. And then it escaped.” </p>\n\n<p>He lets out an exasperated exhale before continuing. “We have no time. There’s no time.” </p>\n\n<p>I’m cautious as I ask the next question, not really knowing where it’ll lead me. “So why didn’t you kill me? Isn&#39;t that the job?” </p>\n\n<p>He looks at me again. This time, we hold each other’s gaze for what feels like an extended period of time. His eyes were so… <em>familiar</em>. I realized why that was the case later on, but it felt so strange at the time. </p>\n\n<p>Eventually, he reaches into his pocket and takes out a Polaroid picture, sliding it towards me. I pick it up, and flinch in surprise at what I’m seeing. </p>\n\n<p>It’s… <em>me</em>. Holding a baby. I don’t recall ever posing for this picture. Also, I’m about 28 now, but looked to be in my mid 30’s in the photo.</p>\n\n<p>I stare back at him, expecting some sort of an explanation. He just chuckles again. “Nobody in our family ever blamed you for what happened. The ancestors of everybody involved here always felt the greatest extent of shame, but we never did. We knew that you were just following orders. We knew that you never could’ve realized what you were actually doing.” </p>\n\n<p>As I take the time to process this weighty revelation, the soldier gets up. “Besides, if I kill you here, then I won’t exist in the future. It’s kind of a selfish reason that I’m doing this, I suppose. But hey, we gotta do what we’ve gotta do to survive.” </p>\n\n<p>“So what’d you want me to do now?” I ask him. The question nearly chokes me up. I can barely handle what I’m being told right now.  </p>\n\n<p>“Find a way out of here. There’s staircases everywhere. Each one of them lead up to the surface. Once you get there, you can and try and tell everybody about what I’ve told you here, but they won’t believe you. So just forget about this.&quot; </p>\n\n<p>I suppose that I must’ve looked horrified, because the Solider simply chuckled again. “Don’t worry about it. We have a plan, and I’m confident it’ll work. We just need to hold you guys off for a few more days.” </p>\n\n<p>He gives me a smile before activating his helmet again. He starts walking before turning back one last time. “I would’ve told you more, but I didn’t want to spoil everything for you. You should quit smoking, though.”</p>\n\n<p>After he left, I must’ve stood there for hours. I mean, <em>what the fuck just happened?</em> Eventually, I make my way back up the surface. I tell the other supervisors exactly what had transpired, but they just looked like as if I were completely fucking insane. A reasonable reaction, in retrospect. </p>\n\n<p>Not long after, they send the 3rd team down. I hear later that they didn’t make a dent on soldiers from the future. Good news, I guess. Later that day, I’m flown back to the states and questioned extensively. I just tell them the same thing that I told the supervisors. I even show them the picture that the soldier gave me. The higher-ups who question me simply write it all off as me being mad. </p>\n\n<p>I’m on paid leave for now. I’m not sure when they’ll decide to bring me back. In fact, I don’t even know if they’re considering bringing me back at all. </p>\n\n<p>Whatever. <em>I just need to forget about all of this.</em> I just want to believe that everything the soldier told me was bullshit. </p>\n\n<p><em>But why would it be?</em> Why would he go through the process of making it all up just to fuck with me? This all seems to lead to one conclusion. And it&#39;s not a good one. </p>\n\n<p>When the solider told me that he was confident in their plan to save humanity, there was something off about the way that he&#39;d said it. Something that told me he wasn&#39;t actually confident about it at all.</p>\n\n<p><em>We may be in real danger here</em>. </p>\n</div>\n","author":"Mr_Outlaw_"}