{"rank":"1","title":"His Name is Dream (pt. 1)","id":"8mnx25","url":"/r/nosleep/comments/8mnx25/his_name_is_dream_pt_1/","time":"1527487649000","body":"<div class=\"md\"><p>I’ve been wanting to tell this story for a long, long time. I don’t know why I haven’t told it before, it’s not like I haven’t had the chance. Maybe no one will believe me, and I’ll just look like another fool living with his head in the clouds. Except the clouds I’m in are heavy, dense and chaotic… I’ve spent many nights at a campfire surrounded by friends telling scary stories, or sharing life experiences that stuck with us. My scary stories define a part of who I am. They live with me inside my head, occupying a dark corner of my memory that I keep trying to push out. Yet… the darkness always finds a way back in when I least expect it. This is the story of what.. or who… I now call Dream.</p>\n\n<p>During Christmas one year, when I was eight or nine years old, my older brother Charlie and I both got rollerblades from Santa. My parents always liked to go overboard during the holidays, and would even go into debt just to get he and I the coolest things they could find us. For my family, money really could buy happiness. The big gift that year was new bikes because we loved riding around our neighborhood so much.  Night time came but Charlie and I still hadn’t quite settled, still giddy and energized from all the sweets we’d eaten through out the day. My mother loves to bake - she still does. Magic bars, lemon tarts, dump cake, coconut pie and so many other things. Wanting to try out the new skates, we both begged to have some time outside. Mom didn’t like the idea of having her kids out at night, so we strapped on our rollerblades and descended some stairs down to the basement. </p>\n\n<p>The floor downstairs was laid in very smooth cement squares with tiny gaps in between segments. Two black poles (not quite pillars) rose from the floor to and through the wood framing that supported the ceiling. I remember there being a beige door with a handle and a bolt to lock it. Next to the door was a very simple four panel window with generic wood trim. Usually the air down there was a musty basement-like smell, but I remember even my mothers baking seemed to permeate the air cancelling out the scent of exposed insulation and mold.</p>\n\n<p>We skated figure eights between those two black not-quite-pillar-poles in what seemed like a perfect rhythm. I loved the sound our skates made when we rolled over the seams of the concrete floor. It was like a car going over a bridge, I loved feeling the little rut with through skates. My brother and I never seemed to get in each others way, or risk colliding while we laughed and giggled in our skates. Occasionally, that simple window would come into my view. I wasn’t necessarily paying attention to the window, but I do remember how black the night was, almost as if the window were trying to suck the light out of the basement. I stopped for a breath. As a chubby little kid with mild asthma my parents hammered it into me that I shouldn’t over exert myself. Something in my head clicked while I took my break, and I looked to the window next to the beige door. It was then that I saw what has stuck with me for the last 22 years of my life.  </p>\n\n<p>I found an illuminated dead face staring at me through the window, it’s hands like claws silently scratching the glass. He (for some reason it’s always been male, even though I can’t tell you for sure) was a pale green color, with baggy eyes which glinted like cats eyes when they catch the light at night. He looked tired… angry…sad… his brow furrowed and his lips pursed into a grim frown. His hair was disheveled and ratty, covered in what looked like rust and dirt. A collar around his neck with a single bolt protruding from the front, dark black blood caked underneath his restraint. What teeth he had were rotting away, just like his old, tattered and ripped clothes. All of these things I perceived in a single instant, before he let out a scream that seemed to fill the air around him, turning it sour and metallic. I can’t describe the fear I felt in that moment. My heart stopped and my face contorted in panic, my lungs emptied leaving me breathless. My mouth salivated and my nostrils burned. I choked out a whimpering gasp… peeled my eyes away from him and back again…and he was gone…</p>\n\n<p>The moment passed and I regained control of my senses, my heart thumping in my chest a thousand thumps as I beelined up two flights of stairs, out of the basement and directly to my room to hide under blankets. I dare not turn the lights out, or look through the blinds of my window. I dare not move from this position in fear that I might see him again. I stayed there for what seemed like an hour, but was only a few minutes, and heard the approaching footsteps of my brother. When Charlie asked me what’d happened, I didn’t understand.  </p>\n\n<p>“You didn’t see it, did you?” I asked in a way that no eight year old should have to ask. Why would I be the only one to see this? Surely I’m not imagining things…</p>\n\n<p>“No, we were skating and the next thing I knew you were running up the stairs screaming like a little girl. Something scared you…” He said, his face expressing a mix of confusion and concern. </p>\n\n<p>I explained that I’d seen… A ghost. I explained how he was angry and sad, I explained the screaming, the dead and glowing yellow eyes. His face went from concerned and confused to angry and annoyed. We were having a perfectly fun time skating in the basement before I freaked out. My brother rolled his eyes and didn’t say another word as he left my bedroom. Great… Not only was I scared to pieces hiding under blankets doing my best to forget what just happened - now my brother thinks I’m crazy too. I hoped deep down that he wouldn’t tell Mom and Dad, knowing they’d ask questions I didn’t want to answer. Honestly, I don’t know that I would have the answers, it all happened so quickly. </p>\n\n<p>After a spell I regained my composure, mustering up the courage to stop hiding and be with my family. We watched the classic Christmas movies, my favorite being Charlie Brown. The cartoons, my parents and brother all snuggled on the couch made me feel secure. I’ve always loved the Christmas trees we decorated every year. The tinsel and ornaments sparkling in the Christmas lights always gave me comfort. We sat in the living room for a long while, the only light being provided by those blinking Christmas lights… I felt myself drifting off. Slowly sleep claimed me into dreams of candy canes, Santa and Rudolph the Red Nosed Reindeer.  </p>\n\n<p>In the middle of the night, everyone in my house heard my Charlies scream. I’d been left alone on the couch, tucked in by parents who didn’t want to disturb their beautiful sleeping child. His room was upstairs, and I bolted as fast as I could to see what was wrong. What I saw is something that, much like Dream, will stick with me forever. My parents were panicked, in tears, scrambling around my brother. I could tell something was terribly wrong. Charlies cries rang in my ears as I struggled to get around my parents to see. His bed was covered in fishing tackle, which became tangled in a crocheted blanket he slept with every night. I realized what I was looking at and stared on in horror. Charlie lay on his bed with multiple hooks sinking into his skin, protruding out like thorns on his arms and neck… but he wasn’t bleeding. For half an hour my parents worked on getting hooks out of him, acting cautiously to not cause him further harm.  </p>\n\n<p>Though I do not recall doing the deed, my parents both blamed me for it. Only the four of us lived in this house, and neither of them were the ones who emptied a box of fish hooks into Charlies bed on Christmas night. Was I the culprit? Was it because of what I saw in the window earlier that evening? I never found those answers. In the South, families tend to brush things under the rug. Problems, drama, those kind of things are hush hush. We never spoke of it again, and I’ve never brought it up. </p>\n</div>\n","author":"b00mb00mb00m"}