{"rank":"39","title":"The Perth Canyon Incident","id":"8mo0be","url":"/r/nosleep/comments/8mo0be/the_perth_canyon_incident/","time":"1527488786000","body":"<div class=\"md\"><p><a href=\"https://www.reddit.com/r/nosleep/comments/8eb21t/the_seal_island_incident/?st=jhpupsi5&amp;sh=886e5916\">The Seal Island Incident</a>\n<a href=\"https://www.reddit.com/r/nosleep/comments/8kr3yz/the_new_hebrides_incident/?st=jhpuqypx&amp;sh=3351c86d\">The New Hebrides Incident</a></p>\n\n<p>The morning we set off, I felt like the weather was taunting us. A clear, hot summers day was in full swing as we arrived at the docks at Fremantle, in stark contrast to the sick storm settling in my stomach. Callum obviously felt the same, judging from the way the corners of his eyes pinched and his lips pressed into a thin line. This airport pick-up had been very different from the one all these years ago in Cape Town; warmth and happiness replaced by uncertainty and distance.</p>\n\n<p>It was good to see him, but it was so damned hard. Gone was the cocky, brilliant man I grew up with as our careers evolved. He looked haggard and spent, a shell of the person he had been. </p>\n\n<p>This trip, I was running a skeleton crew. I pushed for it, because ostensibly we were just testing the equipment whilst I looked for something interesting I heard. Which was more of a criminally oversimplified statement than an outright lie. The horror we endured the last time we ran into one of these things certainly played a lot more of a part in that decision. If we were sailing straight into the teeth of the beast, so to speak, I didn’t want to be putting dozens of people at risk.</p>\n\n<p>We were heading some 100km from Fremantle, out to one of my favourite sites. As we set out, Callum and I sat down with my research partner, Lucy, and discussed what little we knew about the creatures. Lucy and her PhD student, Ryan, both believed there was a known explanation for everything that had happened and both tried to rebut our theories.</p>\n\n<p>It was pretty hard to rebut all the bodies, though. </p>\n\n<p>At some stage during our discussion, it became clear that we still knew absolutely nothing about what we were looking for. We didn’t even have a name for the creatures yet. Callum, who had spent so much time poring over history looking for any correlation, decided to call them Aspids.</p>\n\n<p>“The Aspidochelone,” he explained, “was a monstrous creature that was said to rise from the deepest ocean and destroy ships. In many legends, it employed a lure to attract prey and roared with the voice of a god. Of course, it was also supposed to be the size of a nation and carry an island on its’ back, but fishermen love a tall tale. I doubt these things have anything to do with the original myth, but we know they use lures and you could certainly say they have the voice of a god.”</p>\n\n<p>I couldn’t help but think it more appropriate to say they had the voice of a demon. ‘Aspid’ did seem fitting and had the added benefit of sounding vaguely scientific, though, so it stuck.</p>\n\n<p>This was to be a very different expedition. Callum had tried to get down and see our quarry up close and personal, but I had other ideas. Clearly, the Aspids used sound in a highly specialised way, and I hoped to use that in our favour. Armed with recordings of the Aspid coda, the best quality unidentified shriek Callum could clean up, and the imperfect recordings he took in the New Hebrides trench, we planned to constantly pump noise into the water in the hope of eliciting a response. </p>\n\n<p>Of course, our encounter and the dead fishing vessel weighed heavily on my mind. I was gambling on the original tragedy being a rare incident, a misidentification or an aggressive individual, and I was hoping that any response from an Aspid in the area would be a vocal one. Callum thought it was likely that the ill-fated fishing vessel got caught in a predation event, or perhaps fouled the creature in its’ miles of heavy-duty line and drew a reaction. </p>\n\n<p>That’s what we were telling ourselves, anyway. </p>\n\n<p>As the ship crossed into the sapphire blue of the deep water, Lucy found me standing by the railing. </p>\n\n<p>“There’s really something to this, isn’t there?” I must have frowned.</p>\n\n<p>“I don’t mean anything by it! It’s just that, well, it all sounds so weird. We’ve been conditioned to think that we know more than we do, I guess.” She nodded at the ocean.</p>\n\n<p>“We’re within sight of the coast and the water is already so deep that human beings can spend more time in space than we can down there. It’s not our world. But we’re so dominant over the rest of the planet that we kind of bundle the ocean up with everything else we control. Honestly, Dr Short has a bit of a reputation and I can see it in his eyes, but I know you. You’re still rational and if you back his story then I have to believe it, I think. I don’t know what’s down there, and I’m not sure I can fully accept a gigantic ship-killing monster, but I do believe that the official story isn’t the truth either.”</p>\n\n<p>It meant more than it maybe should have honestly. Lucy was a great scientist, but she was very much a traditional one. She steered well clear of things she thought were too far out there, and sea monsters were definitely one of those things. </p>\n\n<p>My research site was a place called Whale Alley. It was a small ravine that snaked up from the southern side of the main canyon, creating an upwelling as the deep current from the west forced its’ way up the narrower chute. As Callum had found in the Pacific, the Aspids were attracted to places where the deep water pushes into areas with shallower waters, and their prey could dive down into an ambush. I had to assume they preyed on other large sea creatures, too; it didn’t seem sustainable that they would feed solely on sperm whales, and Whale Alley was the perfect spot for big squid. It just seemed like the kind of place the creature would be hanging out if it was still around. </p>\n\n<p>We arrived on-site with a few hours of daylight left and a flurry of activity on the deck. Callum wanted to get everything happening at once, and after a bit I had to take him aside and tell him to cool it for a while. There was a hint of madness in his eyes, a drive that I wasn’t sure was healthy, and I didn’t want him creating angst between the already stretched crew. I did, however, get out the hydrophone receivers and prep the ROV, which would run indefinitely whilst operating on tether. </p>\n\n<p>All was quiet as night fell. Callum had sequestered himself in one of the labs in a huff, Ryan was having a few beers in the common area with the crew, and Lucy and I were hunkered down in the lab listening to Callum’s recordings. There were a lot of murky, far off somethings that were completely unrecognisable; they sounded strange but could have honestly been anything. The recordings from the sub in the Hebrides Trench, though, were downright terrifying.</p>\n\n<p>I had hoped I would never hear that awful shriek again, but there it was. High and loud, with a resonance that punched you in the chest. I was wracked with shivers, even through the distortion caused by water leaking into the damaged mics when the creature grabbed the submarine. Lucy’s eyes flew wide, too, as the cry resounded around the lab.</p>\n\n<p>“Holy shit….”</p>\n\n<p>It was more than I could muster. I had to settle my racing heart and fight back tears. </p>\n\n<p>This sound was shorter and sharper than the sonic stunner we’d previously encountered, but it was clearly related. Even Lucy was trembling, the call still carrying enough power trapped within a recording to shake her. I felt very small, the knowledge of the yawning ocean beneath the hull inducing a gnawing sense of thalassophobia. Lucy put her arm around me.</p>\n\n<p>“Was that the sound?” I shook my head, still struggling for words.</p>\n\n<p>“No. It was much, much worse. Take that, amplify it, and have it going in ten-minute bursts, and you’ll come close.” I shook the tears from my eyes. “These things are lethal, Luce. I should never have brought you out here.”</p>\n\n<p>Lucy shook me jokingly.</p>\n\n<p>“Are you insane? This changes everything. I was on the fence, here, but no animal I know of makes a sound like that. If we’re out here to get evidence of a new species, and a big one, then I wouldn’t miss it for the world! Hey, you were ambushed last time you came across one of these. We’re prepared this time, we’re not going to get ambushed again.”</p>\n\n<p>I felt a little better, then. We weren’t blundering blindly into a lethal situation, we knew what might be down there. At the same time I couldn’t help but wonder; were we actually prepared at all?</p>\n\n<hr/>\n\n<p>I didn’t sleep that night, still hopping with nervous energy and gripped by a sense of dread that seemed to seep through the hull from the abyss itself, coiling around my bones. Somewhere below us, cloaked in the shadows of the inky deep, I was sure death waited. I spent the night listening obsessively to the hydrophones and watching the feed from the ROV, which hovered 150m below us on a tether. </p>\n\n<p>My headphones were alive with the sounds of the ocean; the machine-gun staccato of hunting sperm whales, the distant, mournful song of a lonely humpback, and the endless buzzing produced by millions of smaller creatures. Despite everything, it was almost soothing, a familiar drone that helped me calm down and feel more comfortable.</p>\n\n<p>After a while, I noticed something else way off in the distance. It was a kind of creaking groan, almost like the call of a bowhead whale, but much deeper. In fact I almost passed it off as a bowhead, but my subconscious nagged at me. It wasn’t anything I recognised straight away and, more out of interest than anything, I clicked the record button. </p>\n\n<p>Slowly but surely, the sound got louder, and the threads of dread that had finally loosened their hold started to tighten again. Whatever was making this sound was big and it was getting closer. Soon I heard a response, a second call answering the first, similar but slightly different in tone. I was even more inclined to think they were bowheads then, until I realised that the other large animals had gone very quiet. The humpback stopped calling, and the sperm whales shut down their echolocation. Then this new sound abruptly stopped as well, and I was left with just the background noise.</p>\n\n<p>I listened through the night, but nothing else out of the ordinary happened. Just on sunrise I heard the sperm whales again, clearly confident enough to hunt once more, and I figured that whatever had been happening down there to hush them was over.  The normal sounds of the ocean returned to their usual persistent drone. Eventually I dozed off, despite the rapidly brightening sky.</p>\n\n<p>Lucy woke me up around 8am with a steaming mug of coffee. We discussed the strange events of the early hours, and she frowned at the sound I had recorded. It wasn’t anything conclusive, but we both agreed it was odd. For the moment, though, we had more pressing matters; Callum had started broadcasting. </p>\n\n<p>I considered marching out on deck and ripping shreds off him for leaping into it without consulting me, but I decided to be the bigger person. Callum was obsessive, and if I set him off he’d wall me out. It sounds selfish, but I needed him until such time as I could work on this stuff openly. Instead of blowing up I finished my coffee and headed back to my cabin for a shower and a change of clothes. By the time I returned Callum had joined Lucy in the audio lab. My anger had dissipated but I was in no mood to join their conversation, so I stuck on a pair of headphones and went back to listening to the world below. </p>\n\n<hr/>\n\n<p>Days crawled out on the Indian Ocean. Our calls reverberated through the water without as much as a whimper in reply, either unheard or ignored. Time became a crawling stream, the flat expanse of the ocean providing no respite from the tedium. Four days passed, then five, then six, each one less notable than the one before it. </p>\n\n<p>I had hoped, theoretically, to elicit a territorial response and record a unique sound, rather than one that could be passed off a looped recording of a sperm whale. The risk was that a territorial response would be an attack, although I did think there would be some sort of dominance process before it came to that, as with other large animals. Of course, that hinged on the animals being territorial, but I had felt sure that such a large predator would be hard wired to protect its’ space.</p>\n\n<p>As it turned out, I was right. I just wasn’t looking at it the right way. </p>\n\n<p>In the dead of the night I wandered the deck, unable to sleep. I was leaning on the railing, staring aimlessly into the black sea and lulled by the vibrations of the ships engines, when I suddenly jolted entirely off the rail as my brain finally caught up with my tactile senses. I looked up and down the deck, reaching out for the hull behind me tentatively, an almost comforting hum greeting my touch.</p>\n\n<p>Because it was the middle of the night and the sea was calm, we were running solely on the positioning thrusters. The engines were off.</p>\n\n<p>Something else was causing it, something powerful enough to send a steady vibration through thousands of tonnes of steel, and there was only one thing I could think of capable of doing that. </p>\n\n<p>Every previous response had been geared towards us, as outsiders. In the Pacific, Callum had twice startled the animal, clearly demonstrating to it that he was not one of its’ kind. Off Seal Island, the Aspid we encountered had attacked us straight off the bat, and I firmly believed that was a result of our sonar making us seem just enough like potential prey that it took a chance. Now, though, we were trying to fool any Aspids in the area into thinking they were responding to their own kind, yet we had gone into the whole experiment expecting the kind of response they’d given us in totally different situations. </p>\n\n<p>I guess we were in completely unknown territory, but I felt like I should have seen that flaw in the plan earlier. We had discovered an animal with very complex sonic abilities, but the fact that it was completely unknown despite being gigantic and capable of making sound so loud that it killed spoke to a subtler communication method. </p>\n\n<p>In the lab, I fiddled with the playback, experimenting with the frequencies until the call came through, as clear as day. An almost constant, throbbing croak, too low for our ears to hear without help. In a perverse way it sounded like an old refrigerator, but much deeper and louder. My skull rattled with each pulse and those creeping fingers of dread squeezed my heart once again. </p>\n\n<p>Something about it left me in no doubt as to what this particular sound meant. It was menacing, somehow laced with aggression even through untold cubic metres of water, a clear and obvious invitation to get the hell out of the area. </p>\n\n<p>After a few moments, I made the decision to turn our own broadcast off and see how the creature responded. We had clearly lured our quarry in, but I wasn’t sure how long it had been agitated and I was worried about what it might do next. Plus I thought that if it stopped when we stopped, it would demonstrate a relationship between our broadcast and the menacing, reverberant response. The sound alone wasn’t unique enough to qualify as conclusive proof, but it would back up anything else we got.</p>\n\n<p>Not ten seconds after I cut the noise-makers, the low throbbing stopped entirely. I waited five or six minutes before turning the broadcast back on and, within the span of a few expectant breaths, the aberrant sound was back. I immediately shut off our broadcast again, casting a frightened glance at the sonar screen, which was mercifully clear of any signatures.</p>\n\n<p>There was still a serious sense of unease, though. It might not have been in the water column underneath us, but the rapid response and the vibrating deck meant that the Aspid was much too close. </p>\n\n<p>I didn’t want to involve Cal yet, having seen his mental deterioration firsthand, but I decided to wake Lucy. Every fibre of my being wanted to heed that menacing warning and make a run for it, but I knew we had more to do. Lucy, for her part, was bleary eyed and grumpy at the nocturnal interruption, but I eventually coaxed her into the audio lab. Her sleepy eyes went wide as dinner plates when I played the response back, and she shivered.</p>\n\n<p>“Jesus Christ. Ellie, what on earth is it? I’ve never heard anything like that.”</p>\n\n<p>“It has to be what were here for. It must be. It’s a direct response to the Aspid sounds, it’s huge, and it’s closer than I want it to be.”</p>\n\n<p>“Let’s start broadcasting again. Just the coda, though,” she added hastily. “All those sounds coming from the same source must have been seriously off-putting, right? We don’t even know the function of those shrieks. We assumed that it was a reaction to the lights when Cal startled one, but maybe that shriek is an aggressive sound. Or maybe the fact that we are sitting here broadcasting a sound of fear generates aggression towards us, the same way playing the sounds of an injured lion can generate a defensive response from other lions. The coda is just a lure, the response might be very different.”</p>\n\n<p>She made a lot of sense, despite the moonlit flashes of slick, dark skin that invaded my mind and the sound of blood pounding in my ears as my heart rate spiked. I nodded, struggling to control my fear.</p>\n\n<p>At first, there was no response to this newly streamlined stimulus. The ocean was relatively quiet, as we had noticed it became whenever the Aspid calls were sounding out. There was nothing but the background clamour. We sat and we waited as the hours ticked by, registering relative silence on all frequencies, until a couple of hours before sunrise.</p>\n\n<p>This time there was no threat, no attack. Nothing took us by surprise. Instead, it almost seemed like a question boomed through the hushed sea. The call I had heard very early on in the expedition, the one I had mistaken for a bowhead whale, sang through our headphones and Lucy and I jolted back to full awareness together. It was much closer this time, almost probing in its’ intensity, and clearly didn’t come from any bowhead whale on earth. We both shared a look of pure trepidation, but as the call continued its strange beauty seemed to allay our fears. This was not an aggressive behaviour; it was the curiosity of an animal much more intelligent than the average fish, an animal that wanted to know who or what we were. </p>\n\n<p>The issue, of course, was that while we knew this was no bowhead, it was similar enough that it could be passed off as one, and thus ignored. I had no doubt it would even be written off as a hoax, tarnishing our reputations in the process. It was slightly maddening, to have such a clear audio call-back recording and to know that it wasn’t enough. We needed something more. </p>\n\n<p>I saw my chance maybe half an hour later. Way down in the water column, slowly rising off the bottom and somewhere off to our starboard side, a massive arch appeared on the sonar screen. This thing was gigantic, far larger than what we had encountered off South Africa, and my breath caught in my lungs at the sight of the impression it left on the sounder. Unlike the previous encounter all those years ago, this was rising lazily, as though totally unflustered by the vessel it surely knew was somewhere above it. It was a totally different approach to the one I had suffered through previously, and I couldn’t suppress the thrill of potential discovery as the scientist in me started to take charge again. </p>\n\n<p>The ROV had been in and out of the water, but at that point it was idling quietly on a long tether about 100m below the ship, just floating with one low-light camera running. We were only in a couple of kilometres of water, and the tether would easily allow the ROV to meet the creature as it rose from the deep. If I was very lucky, I might just be able to get a look at it.</p>\n\n<p>My plan was interrupted by Callum, who entered the lab just as I was starting to take the ROV down. With the sun maybe an hour away, he had woken early to start going over the nights’ recordings. He frowned when he saw that most of the sound had been turned off.</p>\n\n<p>“What’s going on? Why aren’t we broadcasting?” My eyes flicked to the sounder, caught up in piloting the ROV as silently as possible.</p>\n\n<p>“Long story. Short version, there’s an animal under the boat right now, it’s interested in the coda and we’re trying to get footage of it before it spooks.”</p>\n\n<p>I expected Cal to be interested, at the very least. What I didn’t expect was the look of sheer rage that contorted his face as he rounded on me.</p>\n\n<p>“So why…the fuck…aren’t we broadcasting?” His voice was a horrible snarl, enunciating his words deliberately and forcefully. I wanted to slap him, but I was busy trying to sneak up on a gargantuan beast from the bottom of the ocean, so I snarled back instead.</p>\n\n<p>“We are. How do you suppose it would be interested in the coda if we were not broadcasting a coda for it to be interested in?” My sarcasm, though, fell on deaf ears.</p>\n\n<p>“Who gives a shit about the coda, Ellie? We should be pumping this noise out as loud as we can! We need a reaction, not a mild passing interest!” </p>\n\n<p>I was getting really pissed off by this stage.</p>\n\n<p>“Well, Callum, the big scary leviathan currently moving up the water column certainly seems to be interested in the coda. All we got when we were spamming random sounds was something that sounded very much like a territorial threat, and I for one am not keen to provoke another aggressive act.” I fixed him with a glare. “I’m sure I don’t need to remind you who invited whom on their scientific expedition, doctor?”</p>\n\n<p>I’m not sure if it was the pointed jab at his fall from grace, or if he just snapped, but before I knew what was happening Callum had pushed Lucy out of the way, flicked on the idle hydrophones and started blasting his cacophony out around us once more. My heart sank, terror sitting leaden in its’ place.</p>\n\n<p>Right on cue, the Aspid below us stopped dead in the water column, going completely silent. Then the ship started to vibrate again, but much more violently, as unimaginable tonnes of angry animal started voicing its’ displeasure at the harsh concert now filling the water. Lucy pointed out the window into the brightening pre-dawn, her face a mask of horror.</p>\n\n<p>Outside, the sea was seething, like a cup of water sitting on a speaker. The sheer power of the vocalisations hit me, then, reverberating through my lungs. Even if this latest attack was too low for us to really hear, it was still tangible and dangerous. Callum seemed oblivious to the danger, staring intently at the sonar echo hanging motionless on the screen. </p>\n\n<p>“Come on, you bastard.”</p>\n\n<p>I took advantage of his fixation and shoved him, hard, sending him tumbling into the bulkhead and away from the computers. As he sprawled to floor, I shut off the recordings and ripped the terminal off the desk, ensuring that he couldn’t get them going again. He screamed something at me, but I wasn’t listening.</p>\n\n<p>Instead, I was straining to notice any change in the sub-sonic rumble, anything that might indicate the creature was backing off. What I picked up was something new, something that sent an icy jolt of fear down my spine.</p>\n\n<p>While the rumble seemed to have stopped, it had been replaced with a soft, high pitched whine, like an old-fashioned camera flash winding up. For the briefest of moments I was absolutely convinced that it was the beginning of a sonic attack like the one that had nearly killed me off Cape Town, but it never really increased and I quickly realised that was stupid. Organic sounds don’t need a warming up period. </p>\n\n<p>What I did notice, though, was that the arch on the sounder was rising again. That whining sound was a constant, and the creature seemed to be heading for the surface. Callum and Lucy were staring slack-jawed at the sonar screen, but I focused on the camera feed from the ROV. It had been positioned quite close to where the Aspid was, and I hoped to at least get a glimpse before I died. </p>\n\n<p>Within seconds I was looking at a dark wall of flesh that sent the ROV spinning, before the screen went dark as the tether was severed and the ROV was lost. It had been about 800m down when the animal roared past so I instinctively braced for impact, thinking the Aspid had just had enough and decided to go on the offensive. </p>\n\n<p>The impact came, but it wasn’t the fatal collision I was expecting. It still hit hard, knocking me to the floor and snapping my arm with sharp crack and hot flash of agony, but I had thought that a creature that size would break the back of the ship and send us all plummeting to the bottom. As it was, we would quickly discover that the damage to the rudder and the propeller shaft was considerable, and slow leaks had breached the hull in several places. Once again, an encounter with one of these creatures had left us bruised and battered on the open ocean.</p>\n\n<p>I believe we were incredibly lucky. Sometimes, the big bulls of several whale species will ram ships in an attempt to push them out of their space, but they hold back so as not to cripple themselves. I believe that was what happened off Perth; we eventually pissed off an Aspid just enough to make it want to give us a nudge out of its’ territory. </p>\n\n<p>I couldn’t get past the fact that I had encountered one of these creatures twice, and both times I had barely escaped with my life. Lying at home with my arm in a cast several days later, I decided that enough was enough. It was far too dangerous to get close to these animals by conventional means, and there was no guarantee I would be lucky a third time. </p>\n\n<p>Callum made a sheepish attempt to apologise, but I couldn’t bring myself to speak to him. He had almost gotten us all killed, so I told him he could have his obsession. I was done. I would have been happy to close the book on the Aspids there and then, to leave them as a dark and dangerous part of a world we have no place invading anyway. Sadly, the story wasn’t quite finished. </p>\n\n<p>Callum ensured that there would be one more tragic chapter before that could happen. </p>\n</div>\n","author":"CreepyAus"}