{"rank":"0","title":"Sincerely H ( pt 1)","id":"8mo378","url":"/r/nosleep/comments/8mo378/sincerely_h_pt_1/","time":"1527489788000","body":"<div class=\"md\"><p>When I created a finsta, I never imagined this would happen. All I wanted was to appreciate the beautiful man known as Tom Holland. Followers came flooding in seeing as Infinity War had just hit the theaters. Everyone raved about the edits, and eventually my likes were in the thousands. Comments were in the hundreds, “ This edit is amazing what app do you use”, “ omg @tomholland2013 look she&#39;s so talented”. One day, after posting one of my favorite edits, I got a notification that someone was trying to get in contact with me. That wasn&#39;t unusual, a lot of people tried contacting me, I figured it was another person asking me what editing app I use or something of that sort. Somehow though, this one felt different. As I opened the message, I saw that there was no profile picture, which was odd.\n“ Hey, you seem like a lovely person. Would you like to be friends?:<sup>)</sup> “  “Of course we can be friends, what&#39;s your name kind stranger?” “ Henry, wbu? “  “Victoria, but you can call me Tori ❤️”</p>\n\n<p>Everything seemed like it was going great. Nothing was odd about the conversation itself. Friendship was easy between Henry and I, although I didn&#39;t actually know that much about him. He kept things to himself, I&#39;d ask him things like “ what&#39;s your favorite food “ he&#39;d answer with “ idk.“ I learned to steer clear of personal questions, but he was never shy about asking about my life. We talked daily, and eventually he became my best friend. I still didn&#39;t know much, but he was starting to spill some details about himself. Out of the blue, he started asking about my car, asking if it was running correctly, if my window was fixed, etc. I found this a little odd, as I had never told him about the issues my car was having. I brushed it off, not taking the feeling in my stomach seriously. ( I should have ) I didn&#39;t tell my mother about him, knowing she would tell me it was flat out stupid to be talking to someone that never showed me what they looked like or how old they were. She never really understood the whole &#39;internet friend’ thing, her generation had been drilled with the stranger danger warning. After that day, I was a little more weary of Henry, and the things he said. Months passed and he would continue to say things like “ How&#39;s your dog, is his ear infection gone? “ I never told him about my dog having an ear infection. He&#39;d start asking me about things I&#39;d never told anyone. He asked about the cut on my inner thigh or how my mom&#39;s visit to the hospital the Saturday before was. </p>\n\n<p>One Monday night, mom came into the house with a package addressed to me. There was no return address but I shrugged it off and took it to my room to open up. Inside was an old doll, and some weird Polaroids. There was also a note, and it read: &#39;tori, I love you with all of my heart, I love you more than alcoholics love wine, more than fat kids love candy. My love for you will never die, sincerely yours, H.’ I dropped the note, and stared at my shaking hands for a good fifteen minutes. I hadn&#39;t heard my mom calling my name, and when I looked up, she was standing right in front of me. “Tori are you okay? You seemed completely lost.” I tried to smile reassuringly but I&#39;m sure it looked more like a grimace. “I&#39;m okay mom, the package is just a prank from some kids.” She nodded and headed out of my room. I decided it would be a good idea to check my phone, and there waiting for me, was ten messages, all from Henry. I freaked out and shut my phone off. I figured it would be a good idea to just head to bed. It was only 9:30pm but I didn&#39;t want to handle the shock I was in. I got myself ready and went to bed. I prayed that nothing bad would happen that night. </p>\n\n<p>In the morning, I woke up to my phone buzzing. My sleepy brain didn&#39;t register the fact that I had turned my phone off before going to sleep. I looked at the time and frowned. It was 2pm, I had slept through the entire school day. I texted mom asking why she hadn&#39;t gotten me up, and she said I had told her I didn&#39;t feel well in a really gruff voice. That text sent me shooting up out of bed. I know for a fact I never said that to her, 2pm was my first time waking up since going to sleep. My phone started buzzing again and I looked at it, confused. It was a call from a number I didn&#39;t recognize. I picked up anyway, thinking it could&#39;ve been a friend (I&#39;m not good with remembering numbers anyway). At first, I heard nothing from the other end, then, I heard panting. The panting stopped but only long enough for the person to speak words I will never forget. “ Tori, you look frightened. Why&#39;s that sweet thing ?” I screamed, dropping the phone as I scrambled to get out of my room. I ran to where I always hang my keys, only to find them missing. My car still sitting out front had it&#39;s windows smashed in and tires slashed. I didn&#39;t want to admit to myself, that it was Henry, but I knew deep down it was. I hurriedly grabbed my phone and dialed my mom&#39;s number from memory. There was no answer. I cursed and tried again, but to no avail. I figured alerting the police would be a good idea, and I quickly dialed 911. I explained the situation and they told me an officer would be at my house within ten minutes. I crept around the house, constantly looking in every nook and cranny, hoping that he wasn&#39;t there. I guess luck was sorta on my side that day, all I found was another package. Again, no return address. It was placed neatly on my dresser. I assumed my mother had put it there while I was asleep. That assumption was quickly debunked as I watched the mailman put the mail in our mailbox and leave. “ no no no” I whispered to myself. I reached for the package. As I came closer there was a pounding on the door. The police were here, I must&#39;ve taken a while to search the house. I quickly went to answer the door and let them in. But, I realized it wasn&#39;t the police outside my door. It was him, I could feel it in my stomach. I threw the package at him and slammed the door. Running as fast as I could upstairs and into the spare room. Frantically I looked around for a place to hide. The closet is the perfect place! “ There&#39;s a bunch of boxes and blankets I could hide under “ I said to myself as I opened the closet door. I climbed my way over the boxes and behind them covering myself with the blankets. </p>\n\n<p>Bang bang bang.  I jumped with every bang, he was pounding on the front door.</p>\n\n<p>The banging stopped… I hear his footsteps… he&#39;s inside my house… I&#39;m writing this in the closet… the police are on their way… I&#39;ll update you when I can… </p>\n</div>\n","author":"nobodycanknxw"}