{"rank":"3","title":"Phantom Boyfriend","id":"8mocpb","url":"/r/nosleep/comments/8mocpb/phantom_boyfriend/","time":"1527493147000","body":"<div class=\"md\"><p>So I recently moved in with my boyfriend of 3years Tochi. Though I promised myself I won&#39;t do that for personal reasons, but I couldn&#39;t bring myself to say no to him because he&#39;s such a sweet soul. </p>\n\n<p>Day 1</p>\n\n<p>Tochi comes to pick me up from my place, throws all my luggage into his car and drives over to his place. This is my first time moving in with a guy so am a little nervous. Yes he&#39;s my boyfriend and I&#39;ve known him for 3 years but this is all new to me. We get to his place and it&#39;s a five bedroom house with all the rooms upstairs and the living room, kitchen, basement and a guest toilet downstairs, (figured it was for visitors). He helps me carry my luggages upstairs and he turns in the direction of his bedroom. Am wondering why he&#39;s going that way so I ask him,</p>\n\n<p>&quot;Uh where are you going?&quot;</p>\n\n<p>&quot;To my bedroom why?&quot;</p>\n\n<p>&quot; I thought I&#39;ll be sleeping in there&quot;.</p>\n\n<p>I point towards the room opposite his, he looks at room and looks back at me and gives me a mischievous smile.</p>\n\n<p>&quot;Oh no babe, you won&#39;t be sleeping in there where&#39;s the fun in that? I want you in my bedroom where I can keep an eye on you&quot;. </p>\n\n<p>&quot; why do you need to keep an eye on me?&quot; </p>\n\n<p>&quot;So that I can keep you safe&quot;.</p>\n\n<p>I roll my eyes at this point, &quot;safe from what?&quot;</p>\n\n<p>&quot;You&#39;ll see&quot;.</p>\n\n<p>He winks at me and drags my bags into his bedroom. It was quite a big room with a chair close to the bed and the bed in the center of the room, his bathroom was on the far left of the room, With the closet a few feet from the bed. </p>\n\n<p>&quot;Should I help you unpack?&quot;</p>\n\n<p>&quot;Uh no, it&#39;s fine this won&#39;t take long&quot;.</p>\n\n<p>&quot;Alright, I&#39;ll be downstairs setting up the amazon fire stick if you need me&quot;. (at that time I had no idea what that was).</p>\n\n<p>&quot;Ok&quot;.</p>\n\n<p>I clearly hear him walking down the stairs and a few seconds after the tv downstairs comes on. So I focus on unpacking my stuff, I unzip my bag and start throwing things everywhere, skirts, tops, jeans and shoes wondering where to start from when suddenly the bedroom door slams behind me, it scares me so much that I jump on the bed and am just staring at it. When I regained myself I screamed at Tochi to stop fooling around, He obviously didn&#39;t hear me because I hear him shout from downstairs, </p>\n\n<p>&quot; Babe you just got here, please don&#39;t break my door&quot;.</p>\n\n<p>Am confused cos I obviously didn&#39;t touch the door and there was no wind from anywhere. I turn my attention back to what am doing and after a few minutes the faucet and the shower in his bathroom comes on. I walk to the bathroom and look around, and there&#39;s no one in there so I turn off the shower and faucet.</p>\n\n<p>Am finally settled in, it&#39;s 8pm and Tochi is out with friends, am sitting on the coach watching the movie A quiet place on the fire stick thingy when the kitchen tap comes on, I pause the movie and listen for a few seconds and realize it&#39;s coming from there, so I walk over to the kitchen and turn off the tap, walk back to the living room and continue the movie. After about five minutes I hear &quot;Babe&quot; clearly and very loudly from upstairs in Tochi&#39;s voice. I jump out of my seat and am looking upstairs, there&#39;s a balcony in front of Tochi&#39;s bedroom and it enables one to see the entire living room if you&#39;re standing upstairs, and if some one talks to you from there you can clearly hear them. So am looking towards that direction because that&#39;s where the voice came from, I pause the movie again and at this point am kind of scared, wondering if there&#39;s anyone in the house with me, still standing there I decided to call Tochi just to be sure he didn&#39;t come through the back door and sneak in without me knowing. (Which wouldn&#39;t have been possible because he would have to come into the kitchen, pass right behind me and then go up the stairs, but I called him anyway just to be sure).</p>\n\n<p>Tochi: &quot;hey babe&quot;</p>\n\n<p>Me: &quot; uh hi, where are you?&quot;</p>\n\n<p>Tochi: &quot;am out with the guys, miss me?&quot;</p>\n\n<p>Me: &quot;umm not really, I think someone is in the house with me&quot;.</p>\n\n<p>Tochi: &quot;what? What do you mean you think there&#39;s someone in the house with you?&quot;</p>\n\n<p>Me: &quot;I heard a voice say babe from upstairs and it sounded like your voice&quot;.</p>\n\n<p>Tochi: &quot; Leave the house, leave now go next door and I&#39;ll be right there.&quot;</p>\n\n<p>Me: &quot;Umm let me just check to be sure, maybe there&#39;s nothing to panic over&quot;.</p>\n\n<p>Tochi: &quot;No don&#39;t check, get out of the house right now do you hear me?&quot;.</p>\n\n<p>Me: &quot;ok&quot;.</p>\n\n<p>But I didn&#39;t leave, my pride wouldn&#39;t let me go next door because I didn&#39;t even know the neighbors. I stubbornly summoned up courage and walked up those stairs, I opened all the doors and checked all the rooms one after the other, they were all dark so I turned on all the lights and I didn&#39;t see anyone in there. I hated myself immediately for calling him cos he wouldn&#39;t let me hear the last of it if he came home and found out it was for nothing.</p>\n\n<p>10minutes later Tochi&#39;s car screeches to a halt on the driveway, I hear him slam the door and he rushes to the front door and opens it like there&#39;s a mob after him. He sees me sitting in the coach and he rushed over to me asking if I was ok.</p>\n\n<p>&quot;Yeah am fine, you look like people are chasing after you&quot;.</p>\n\n<p>&quot;No thanks to you, are you sure u&#39;re ok?&quot;</p>\n\n<p>&quot;Yes, I am, it&#39;s fine I checked and there was no one there&quot;.</p>\n\n<p>&quot;And what if there was? What would have happened to you?&quot;.</p>\n\n<p>&quot;Why didn&#39;t you leave? I asked you to go next door and wait for me there and you didn&#39;t, why are you so stubborn?&quot;</p>\n\n<p>I had nothing to say, i kept my eyes on the floor cos i felt like a kid who was getting told off by her dad. Then he looks at the tv and looks back at me and laughs.</p>\n\n<p>&quot;A quiet place? No wonder you&#39;re hearing things&quot;.</p>\n\n<p>&quot;I know what I heard&quot;, I muttered under my breath.</p>\n\n<p>&quot;Anyway fine or not am staying here with you now, can&#39;t go back out&quot;.</p>\n\n<p>Day 2</p>\n\n<p>It&#39;s  3am and I wake up for no reason, so am sitting in bed and am trying to adjust my eyes to the darkness, the room is being illuminated by the moon, though it&#39;s not so bright but it&#39;s bright enough to see the surrounding of the room and a few feet from me and that&#39;s when I see him, he&#39;s just sitting in the chair that&#39;s not too far from our bed, he&#39;s dark like really dark but the moon casts enough light so I can see him clearly and he has the features of Tochi, so am in bed wondering why he&#39;s up at 3 in the morning sitting in a chair and he&#39;s just there staring at me so I ask him,</p>\n\n<p>&quot;What are you doing? It&#39;s 3 in the morning come back to bed&quot;.</p>\n\n<p>He doesn&#39;t move, he just sits there stiff as a board staring at me. Am a little freaked out at this point I raise my voice a little and making it sound firmer I say,</p>\n\n<p>&quot;Tochi do you hear me? I said come back to bed&quot;.</p>\n\n<p>I didn&#39;t realize it at that point but my real bf was in bed with me and my voice must have been quite loud because then he stirred, turned around and said, </p>\n\n<p>&quot;Huh? Babe who you talking to?&quot;</p>\n\n<p>I immediately looked towards the chair and didn&#39;t see anything, I quickly scrambled out of bed and turned on the lights and the chair was empty. Tochi&#39;s still looking confused so he asked me what&#39;s wrong and I tell him it was nothing, I turn out the lights and go back to bed.</p>\n\n<p>I wake up at 9am and the bf is out obviously gone to work, so I lazy about downstairs for a little while and decide to go take a shower. Sometimes in the shower I like listening to music and because I can&#39;t come out to change the songs as I wish I put one of my favorite songs on repeat, drop my phone in the sink and enter the shower. The song has played like 2times then after the second time I waited for it to come up again, it normally comes up immediately but this time it was taking a while, I almost go out to check what was wrong when all of a sudden a different song comes up. Am confused because I was sure I put it on repeat, but I ignore it and listen to the song anyway. After that song was over I expected it to play back, but it takes a little while again and another song comes up. My phone has never done this before so I quickly rushed through my shower and stepped out of the bathroom, and I saw my phone face down on the floor, I was very sure I didn&#39;t leave it there I checked it for any cracks just incase it fell (which was impossible because if it had fallen I would have heard it). But it was placed on the floor like someone put it there. I turned around to grab my towel and that&#39;s when I saw it thanks to the steam from the shower,</p>\n\n<p>HANDPRINTS, all Ten of them on the glass of the shower door.</p>\n</div>\n","author":"Bloodstorm23"}