{"rank":"182","title":"Why Do We Dig The Graves?","id":"8mok6y","url":"/r/nosleep/comments/8mok6y/why_do_we_dig_the_graves/","time":"1527496027000","body":"<div class=\"md\"><p>My life changed the day I put a gun to my head. </p>\n\n<p>The years without my wife and son were unbearable. Time and hope seemed to pass by in tandem. With no family or friends, I grabbed two of my favorite possessions, a bottle of bourbon and my .45 caliber revolver. It was cold, rainy, and quiet— a good day to die. I took a final swig and placed the cold barrel against my sweating temple. With one final deep breath I wrapped my finger around the trigger and…</p>\n\n<p><em>KNOCK—KNOCK—KNOCK</em> </p>\n\n<p>I set the gun down, racking my brain as to who could be at the door. I never had visitors. Still, I feared this person could hear the gunshot, and I didn’t want anyone to be involved with my death if they didn’t need to be. I had already caused enough trauma for a lifetime. I got up from my bed and slowly stumbled to the front door. To my surprise, there was no one there. Instead a bouquet of thirteen black roses and a small brown parcel sat on my doorstep.</p>\n\n<p>As I looked upon the ink-colored flowers, images from my wife’s funeral played in my drunken mind.</p>\n\n<p>The memory of her memorial service is hazy, but a few details are engraved in my mind: the cold rain dampening my grey suit, the glaring stares of judgment from her family, the familiar sting of bourbon in the back of my throat, and the bouquet of black roses placed next to her casket. It was the first time I had ever seen black roses, and they stood out like a drop of dark paint on a white canvass. A card placed within the flowers asked one simple question written in red ink:</p>\n\n<p><em>Why do we dig the graves?</em></p>\n\n<p>To this day, I have no idea who wrote the ominousnote.</p>\n\n<p>Life as a single parent was difficult. My wife was the one who held our small family together. And then it was just my son and I… for a while. </p>\n\n<p>I would give anything to have my boy back. I should have been keeping an eye on him the day he went missing. As usual, I was too busy slipping out of consciousness, fumbling to take another drink before my heavy eyelids shut. The police never found him, and two years later they probably never will. He was 7 years old when he was abducted.</p>\n\n<p>I bent down and grabbed the items from my doorstep, brought them inside, and placed them on the table. After a few moments I tore open the rain-soaked parcel. Inside was a single spool of Super 8 film. Whoever sent me the package knew me well. Collecting Super 8 was my only hobby, although I rarely spoke of it.</p>\n\n<p>I flipped the spool over, on the back was a single strip of white tape. Written in red ink, were 2 words: </p>\n\n<p><em>Play Me</em> </p>\n\n<p>With the film in one hand and my bourbon in the other, I retreated to the basement. I proceed to dust off my old projector, hang a small sheet over a clothesline, and load the film. The image burst to life, a buzzing swarm of grey static followed by a theatrical countdown: </p>\n\n<p><em>3…2…1</em></p>\n\n<p>The black-and-white picture was shaky, displaying rapid flashes of clouds and sky. I inched closer to get a better view of the video. The scene came into focus: a boy in a large field, covered in dirt and grime. The camera zoomed closer, and his face came into frame. The bottle fell from my hand, and shattered on the floor. The boy… was my son, Benjamin, and he was digging into the earth with a large shovel. </p>\n\n<p>I gasped. I was sure it was him. Thoughts raced through my head. I felt dizzy. </p>\n\n<p>Where was he? What was he doing? Who sent me the film? </p>\n\n<p>I kept watching, and in an instant the basement exploded with sound, forcing me back in fright. </p>\n\n<p>A deep, grainy voice spoke: </p>\n\n<p>“Benjamin…” (My son stopped digging, cocked his head to the side, and stared at the camera.)</p>\n\n<p>“Benjamin…why do we dig the graves?</p>\n\n<p>“To bury the dead,” my son said in a monotone voice. </p>\n\n<p>“And why do we bury the dead?” the deep voice asked.  </p>\n\n<p>I noticed something familiar in the background— a building. But…I couldn’t quite remember where I had seen it.</p>\n\n<p>Benjamin responded, “We bury the dead… to feed the black roses.”</p>\n\n<p>It hit me. I knew the building. It was the abandoned warehouse I used to pass on the way to work, a monstrous eyesore in the middle of nowhere and untouched for half a century. I knew were to go, I knew where my son was.</p>\n\n<p>I jumped to my feet and paced around the basement. I had to act. I had to rescue him. As I reached down to turn off the projector, the voice spoke again: </p>\n\n<p>“Do not tell anyone. Come… alone.”</p>\n\n<p>The camera panned to the large hole Benjamin had been digging. </p>\n\n<p>I ran upstairs, nearly tripping on every stair. My mind continued to race as my nausea reached its peak. I sprinted to the bathroom and expelled the alcohol I had for breakfast. The factory…I had to go. I had to get my son back. </p>\n\n<p>I dressed as quickly as I could: grabbing my coat, forcing on my boots, and tucking the pistol in my waistband. </p>\n\n<p>I started my truck and hit the road. </p>\n\n<p>The drive was eerily quiet, as if the earth had stopped turning. Dark overcast flooded the world around me in a dreary atmosphere, void of light and warmth. Twenty minutes into my drive, I realized I had not seen another person, or even another vehicle. I was alone. </p>\n\n<p>This solitude continued throughout the entire trip. Eventually, the factory came into view. It’s dark, red brick cut through the horizon. I parked my truck and marched through the vast field of dirt towards the building—carefully avoiding the sporadic, rectangular, 6-foot deep cavities scattered across the grounds.</p>\n\n<p>Upon crossing the large, broken, iron-gated threshold, I crept towards the entrance of the abandoned factory. The massive front door creaked open. I inhaled deeply and stepped inside. It was enormous— concrete walls and steel beams ran up for miles. The floor was an endless sea of broken brick, metal, and dust. The skeleton of an old assembly line sat motionless in the center of the main room. I clicked on my flashlight and began my search, unsure of where to start. </p>\n\n<p>I walked the halls for what seemed like hours, frantically opening doors— only to find more dust and darkness. I was ready to give up. I decided I would head home, turn the film reel into the police, and drink this all away. I walked back to where I had entered the facility.  When I finally reached it, I stood in disbelief. </p>\n\n<p>The door was gone. It had been replaced by a solid concrete wall. I pushed against it with all my strength. </p>\n\n<p>How was this possible?</p>\n\n<p>An explosion of noise and flashing light filled the entire factory. I spun around and drew the revolver from my waistband. The assembly line sprung to life with the loud grinding of gears.</p>\n\n<p>I walked forward to investigate. Piles of twisted metal and glass traveled down the line and into the next room. An aroma filled the air, smelling of oil and gasoline.  I studied the contents, quickly discovering that they were automotive parts— horribly dented and broken. After a few moments the factory lights went out with a flash, and the assembly halted.  </p>\n\n<p>I walked into the next room to see where the belt line fed into. I pushed open the double doors and walked inside. I pointed my flashlight towards a massive, dark object in the middle of the room. As soon as I saw what it was, I vomited. </p>\n\n<p>It was a car, my wife’s car. </p>\n\n<p>The memory of the night she died flooded my mind. I was drinking, always drinking. The sound of wind and snow whistled loudly outside. Benjamin was upstairs in his room, bedridden from a flu that had been going around his school. My wife had just gotten home from work, disgusted at the state I had drunken myself into. She sighed as she looked me up and down, “Well since you clearly can’t drive, I guess <em>I’ll</em> go get some medicine for <em>our</em> son. She slammed the door as she left. </p>\n\n<p>That’s the last thing I remember from that evening. </p>\n\n<p>The next morning, I was filling out paperwork at the police station. She died in the hospital a few hours after the crash. I was at home, unconscious during her final moments of life. I didn’t deserve her, and I never got the chance to say goodbye. </p>\n\n<p>I slowly approached the mangled remains of the sedan, shining my light through the broken windows. I walked towards the driver’s side window and peered inside. As my light illumined the inside of the vehicle, I stumbled back in horror. My eyes had to be lying. It wasn&#39;t possible. A human body sat in the seat, it’s forehead rest against the steering wheeling. My back eventually met the cold, concrete wall. I slowly slumped to down and buried my face into my hands. The dizziness and confusion returned. </p>\n\n<p>My thoughts began to race as I questioned the reality of the situation— overwhelmed with the familiar feeling of  guilt. The guilt I have felt everyday since her accident, the guilt I try and drink away each day. I sat in the darkness, unsure of what to do or think. The room was spinning again, and the darkness washed over me as I turned off my light. I couldn’t stand to look at her car any longer. </p>\n\n<p>The silence of the room was broken by an unmistakable noise. A noise which I refused to believe was real.</p>\n\n<p>The opening of a car door.</p>\n\n<p>The hinges screeched loudly and echoed throughout the vacant factory floor. However, it’s the sound that followed which left me paralyzed with fear. Wet, crackling footsteps on the stone floor approaching me. I fumbled to pickup my my flashlight. The room illuminated and I gasped. </p>\n\n<p>“Noo….I… it can’t” </p>\n\n<p>It was all that I was able to stutter. It was her… or what was left of her. The tattered remains of my wife’s corpse stood before me, staring down with her one remaining eye and the empty socket that had once  held the other. She was wearing the same clothes as the night of the wreck— torn and bloodstained. </p>\n\n<p>I tried to speak again,\n“Helen, I’m… sorr..I’m so sorry…” Warm tears ran down my face, and the flashlight shook violently in my quivering hand. </p>\n\n<p>The body shuffled forward, dragging a crushed foot and leaving behind a trail of dark blood. It knelt down in front of me and placed a cold, skeletal hand against my cheek. The smell of rot was overwhelming. I closed my eyes tightly as I dry heaved from the putrid stench. I could feel its face a few inches from my own. My tears now an uncontrollable river. It pushed her cold, decaying face against mine as she whispered broken words into my ear. </p>\n\n<p><em>Why…do…we…dig…the…graves….</em></p>\n\n<p>I screamed at the top of my lungs as I fired the .45. The sound was deafening, echos bounced off of the walls. </p>\n\n<p>I slowly opened my eyes... and it was gone. All of it: the car, the corpse, everything. My heart was beating out of my chest as I tried to catch my breath. The smell of gasoline and rotten flesh still lingered in the air. Just as I began to calm myself, the factory lights flickered on, and the conveyer belt sprung to life once again.</p>\n\n<p>I whipped my light rapidly around the room. Feelings of confusion and anger pulsed through my body. I looked towards the conveyer belt, as new objects began to appear. I crept forward to get a better look. </p>\n\n<p>They were toys… Benjamin’s toys.</p>\n\n<p>I recognized them immediately. The Teddybear I bought him for his second birthday, his first bicycle, toy trucks, games, and action figures. They rode along the conveyer belt, evenly spaced a couple feet apart. The toys on the belt fed into the next room. My fear and confusion had subsided, and were replaced with burning rage. Who was doing this? Who was torturing me? </p>\n\n<p>My questions were answered as I kicked open the door of the next room. </p>\n\n<p>Standing in the middle of the floor was my son. It had been years since I had seen him. Behind him stood a figure, much taller and dressed in a dark, hooded cloak that covered its face. Both hands resting on Benjamin’s shoulders. </p>\n\n<p>“Let him go. Now!” I spat as I pulled back the hammer of the revolver. </p>\n\n<p>They both remained still and unwavering. </p>\n\n<p>“NOW!” I screamed as I fired a round into the ceiling. </p>\n\n<p>“Father.” Benjamin said. </p>\n\n<p>“Ben…I … please come with me. We have to get you home.” I cried. </p>\n\n<p>He spoke again. “Each day father, with every drink... you dig the grave a little deeper.”</p>\n\n<p>And before my eyes, his body withered away. In it’s wake, hundreds of black rose petals slowly fell to the ground— forming a large pile on the floor.</p>\n\n<p>The hooded figure remained. </p>\n\n<p>“What did you do!? Bring him back!” I screamed.</p>\n\n<p>Slowly the figure pulled back its hood and I looked in disbelief. A disfigured version of myself stood before me. Its contorted face grinned as it raised a bottle of amber liquid to its mouth and took a drink. A horrible, in-human laugh escaped its mouth and filled the room. </p>\n\n<p>Without hesitation, I fired a bullet straight into the monstrosity’s head. </p>\n\n<p>Bright lights and machine noises flooded my senses. I whipped my head around and studied the hospital room I had just woken up in. I tried to move, but my body wouldn’t respond. A doctor in a white coat walked in and sat next to my bedside. He smiled as he explained how lucky I was. Lucky that a neighbor walking their dog happened to hear the gunshot that day I had decided to try and end my own life in my bedroom, lucky that I had just awoken from a month-long coma the bullet had put me in. And lucky that although I had no family or friends, someone cared enough to send me flowers. </p>\n\n<p>I looked at the bedside table and gazed at a vase full of jet black roses. And for the first time in a decade, I didn’t feel like having a drink. </p>\n\n<p><a href=\"https://www.facebook.com/Rha3gar/\">JS</a></p>\n</div>\n","author":"Rha3gar"}