{"rank":"27","title":"The dogman - Final update","id":"8molkd","url":"/r/nosleep/comments/8molkd/the_dogman_final_update/","time":"1527496604000","body":"<div class=\"md\"><p><a href=\"https://www.reddit.com/r/nosleep/comments/8ls06e/the_dogman/\">Part One</a></p>\n\n<p><a href=\"https://www.reddit.com/r/nosleep/comments/8m1rhv/the_dogman_update/\">Part Two</a></p>\n\n<p>Part Three:</p>\n\n<p>I didn’t cry when the police came from the next town over, blue and red lights filling our drive way, moon belly filling the sky. I didn’t cry when an officer with worn out hands sat with me on the porch listening to the night sounds of cicadas, carefully asking me questions about my sister. I said it was the dogman and he didn&#39;t listen. I didn’t cry the next day when volunteers took to the forest in the early morning mist, sunlight like smoke through the trees swallowing their bodies as they walked deeper, calling her name. I didn’t cry when mom wouldn&#39;t get out of bed, wouldn&#39;t shower, wouldn&#39;t eat, wouldn’t call dad. Sometimes I’d join her, lying side by side staring up at the ceiling until the day faded, hum of the electric fan the only sound in the room. I didn’t cry when I dreamed about Jamie every night, climbing trees that stretched impossible into the sky, branches like hands. And I didn&#39;t cry when I had nightmares about Jamie, buried in the dirt with worms in her mouth, green eyes closed. </p>\n\n<p>I took to sleeping in Jamie’s bed. It smelled like her, sweet with sweat and that strawberry shampoo she loved. I’d leave the window open for the bugs and the stars, hoping that suddenly I’d hear her voice outside, saying it was all a mistake, she’d been lost so long and was worried mom would be mad, but could she please come home now. And every night I watched the door way, waiting. And every night he came. The dogman. I’d stare until the tears came, angry and afraid in the dark, where nobody could see them fall except for him and his white eyes. I wanted to ask why he took her and not me, why he wouldn&#39;t leave us alone, why he wouldn&#39;t give her back. But I was always too scared to speak so we’d stare at each other in silence, the slow roll of his breathing, gaze fixed on me lucid and pale, moon reflections in his eyes. </p>\n\n<p>Neighbours came in waves, with casseroles and kind words. </p>\n\n<p>“We’re praying for you darlin’, you and your sister,” they would say, regretful in our living room.  </p>\n\n<p>“She’ll be home soon, God will see to that,” they would promise, kissing my cheek. </p>\n\n<p>But they knew God couldn&#39;t reach us here, out in the swamp and the red dirt roads. God had turned away from the river trees, swaying like a preacher’s hands on a Sunday.  </p>\n\n<p>Amy was there every day without fail to check on mom, always bringing something new to feed me. Bill was there every day too. After he’d finished combing the cow fields and the woods with the other volunteers he’d knock on the front door, trailing mud and weeds in on his boots. I dreaded that sound, three steady knocks, like bruises on my skin. He’d go up to see mom a while and then leave, smiling at me and shaking his head when another day passed empty, without Jamie. </p>\n\n<p>A week came and went, seven days of an empty house that echoed strange like when we had first moved in. Seven days spent trying to reach my mom, who had finally drifted out to sea, except now I was standing left behind on the shore all alone. It was a Sunday evening, sky turning shy pink, birds flying home. Amy and Jake had just left. Amy had brought Jake with her, the first time I’d seen him since that night catching fire flies in the garden. He’d pulled me into a hug the second he saw me, not the slightest bit shy like most teenage boys, just warm and heavy from the sun, smelling like the bonfire he’d been helping his dad build. He said nothing. Didn’t need to. Mom was sleeping upstairs after a long conversation with Amy. I thought I’d heard heard her crying again but I was too tired to go and see. I was too tired of watching her sleep through the days, too tired of hearing her cry with her door closed when she thought I couldn&#39;t hear. </p>\n\n<p>I sat on the kitchen floor with my back against the cold metal of the fridge, curled up with my arms over my head and my knees pressed into my chest, too tired and sad to cry. I missed Jamie so much in that moment it felt like I was drowning in the kitchen, tables and chairs washing away on the tide, salt staining the faded wall paper, fish circling the ceiling fan as I sank to the bottom of the ocean. I missed the way she would eat all the marshmallows out of the Lucky Charms leaving me with only the bland cereal. I missed the way she would fight for the remote with me, pulling my hair and sinking her tiny nails into my hands. I missed the noise and the chaos she brought with her everywhere, everything funny to her, everything bright and brand new. She was so small and so brave and I pressed my hands over my eyes until I saw static, imaging her drowned in the creek, lost in the woods, buried in the ground. Taken by the dogman. </p>\n\n<p>I missed her like an ache in my back teeth. It was my fault, I realised. I should have told someone sooner about the dogman. I should have been there to protect her. I wanted to find her so badly it made my head hurt. Something hard pressed against my back and I twisted to move it. A fridge magnet shaped like a frog, pinning to the fridge a photo of me and Jamie at the beach last year. I stared at our faces, tiny on film, smiles slightly blurry. I grabbed the photo and ran, jumping the chain link fence that separated our back yard from the woods, my shoes forgotten. I ran through the trees, mud and grass and leaves against my bare feet. The evening air was hot and warm and I could feel it on my arms as I pushed through it, running beneath the sky as pink faded to purple and then grey as the sun began to sink lower. </p>\n\n<p>I found the clearing, breathing hard, dizzy with it. I stared up at the tree, covered with its photos and flowers. Once again I wondered who was lighting the candles, before I collapsed into the dirt, digging into it until it found its way under my nails. I screamed, an animal sound, sobs shaking my ribs until it felt like they would fall from my chest. The candles glowed steady, watching me as I held out the photograph of me and Jamie like an offering. I folded it in half so it showed only my sister, smiling over at me, now unseen like a ghost. I placed it carefully against a weathered statute of the Virgin Mary. She was a mother once too, and I hoped she would look after Jamie. I cried in the warmth of the candle light, in the same position I’d been in earlier with my arms over my head, hoping I could hold the cracks together long enough before I broke. </p>\n\n<p>I woke up cold, small against the base of the tree surrounded by the candle light. The moon hung half full in the sky, constellations flung across the swirling black. I wasn’t alone. The dogman stood, head tilted slightly to the left. Watching me. He tilted his head the other way when he noticed I was awake. Watching him. I stood, feet slipping over the piles of flowers and toys, pushing myself up on the rough bark of the tree. I wasn&#39;t scared anymore, I didn&#39;t care if he wanted to hurt me too. I bared my teeth. He shook his head. I drew a breath, confused. He stepped into the light. Some instinct inside me older than I was howled and told me to run. I stayed. In the light I could see he was more dog than man. His legs were as if a dog was standing on two feet, upright like a person, but still animal. Still unnatural. The fur that covered him from the ribcage down was thick and shone like the creek water in the dark. His chest was pale, undoubtedly human and littered with scars and strange black ink, symbols and pictures that seemed to shift and change as he moved. Human hands, nails long and dirt caked. But his head was the head of a black dog. Like an an Alsatian, ears high like a wolf. His eyes were pure white, pupilless and half lost in the black of his fur. The dogman smiled. </p>\n\n<p>I wanted to be brave like Jamie but I still took a step back, my body moving for me when faced with all those teeth. He shook his head again. We stared at each other in silence, soft wind blowing through the trees lifting its hands gentle through my hair, rippling his fur. Slowly, he sank to the ground and crouched, arranging himself so he was cross-legged with his hands on his legs. He tilted his head again, eyes calm, eyes almost human. With nothing else to do I crouched and mirrored him, crossing my bare legs with my hands resting on my knees. I looked at him and felt safe. He wasn&#39;t here to hurt me. Then the dogman stood, movements careful and slow, reassuring. He held out his hand and I took it. Together we walked through the trees, and into the dark.</p>\n\n<p>We walked, dream-like through the woods, stars a haze above us. The dogman never looked back, his hand warm and twice the size of my own. We walked until we cleared the forest and reached a house, blue paint peeling, chain link fence wrapping the property tight. Rot crept across the porch, empty save for a broken rocking chair that creaked in the wind. The grass in the back yard lay dead. Water hadn&#39;t touched this ground for a long time. Four small saplings grew in a row against the fence, the first growing tallest with a few buds and leaves. At the end of the row was a hole for a fifth. I knew whose house this was. The dogman smiled. </p>\n\n<p>I woke up in my own bed, dirt on my feet and babysbreath flowers knotted into the ends of my hair. I sat at the kitchen table, feet swinging off the ground I wasn&#39;t quite tall enough to reach. As I picked up the phone and dialled I looked out of the kitchen windows as the sun rose, a bright and living thing, for a minute turning everything gold. The first person I called was dad. I heard his voice over the phone for the first time in months and felt like coming home. The second person I called was the police. For the second time that week our drive way filled with blue and red lights in the early morning. But this time they weren&#39;t too late. </p>\n\n<p>The blue house with the peeling paint and the decaying porch belonged to Bill Lafayette. Officers kicked the door in to the sound of birdsong, caught him passed out on the couch, kids cartoons blaring on the TV. Jamie was in the back room, with the windows boarded up. An officer carried her out into the sunlight to me and mom, waiting in the back of a police car. She ran to us on legs shaky from a week of being chained to a wall. She brushed past mom and threw her arms around me. I picked her up and held her so tight, tight enough so the cracks that had been growing started to mend. She complained I was crushing her to death, but neither of us let go. </p>\n\n<p>Bill had taken Jamie from the living room floor where we slept that Sunday night, mom passed out drunk upstairs. He had kept her in the room for a week. The police interviewed her for the whole day, gathering enough evidence to get him a life sentence. Then they interviewed me. They asked me how I’d known where she was. I said I’d dreamt it. They left it at that. They sent Jamie to hospital, an hours drive away, to run tests and check she was okay. She told me and mom as we sat by her bed, IV drip and steady beep of the heart monitor background noise. Bill hadn&#39;t touched her, she said. He’d been so angry, but she didn&#39;t know why. He’d hit her, pulling at her hair again and again, screaming about how she was wrong, she was all wrong. The four trees in his backyard marked the bodies of Gracie Freeman, Becky Adams, Jenny Hays. And Abigail Holtman. All seven years old. All with long, blonde, hair. Bill had been planning on planting a fifth. </p>\n\n<p>Dad arrived the next day. He stumbled from the car, eyes bloodshot and hands shaking. He had been driving since I’d called him, through the night, stopping once to sleep and once to refuel. I imagined him on the highway in the dark, headlights a haloes around him, gripping the wheel. He held Jamie in one arm and mom in the other as they cried into his shoulders. He looked up at me from behind their blonde heads, and smiled, hair as dark as mine. Jake gave me a drawing he’d done, me with my legs in the river and my hair in a braid down my back. Written on the back in pencil was his phone number and two words. <em>Thank you</em>. Amy kissed me on the forehead and said she’d miss me but was glad we were leaving. I said the same. We packed up our entire lives into the back seats of the car and made the 35 hour drive back to Oregon. Back home.</p>\n\n<p>Me and Jamie stared out the back window of the car as we drove away, red dirt road beneath the wheels, white house growing small in the rearview mirror. We passed by the wheat fields, cows grazing in the Louisiana sunshine, brown with their sleepy eyes. A billboard flashed past, green paint letters letting us know <em>God Is Watching.</em> We passed the swamp, trees slow growing beneath moss in the shade. We passed the woods and there he stood at the tree line, head tilted to the side with his wide white eyes. Me and Jamie waved. The dogman smiled. </p>\n</div>\n","author":"Coney-IslandQueen"}