{"rank":"70","title":"I think I'm getting messages from my dead ex boyfriend.... I have screenshots","id":"8mom51","url":"/r/nosleep/comments/8mom51/i_think_im_getting_messages_from_my_dead_ex/","time":"1527496827000","body":"<div class=\"md\"><p>I honestly don&#39;t even know how to start this off.</p>\n\n<p>I&#39;ve read a couple stories on this reddit for a while and I have a feeling this story of mine needs to be uploaded.</p>\n\n<p>I guess I&#39;ll start from the beginning. I used to have a boyfriend, whom I began dating late last year in December. (to keep away his identity, let&#39;s call him Liam..) He really wasn&#39;t the best guy you could come across. He lived quite far away. Almost a whole country away. He didn&#39;t show the best care towards me, and I&#39;m the type of girl who loves to have care shown towards her and compliments, etc. He didn&#39;t give me a lot of time of his day. But when things were good, we worked well. Until I broke up with him a couple days before he passed.... we were fighting a lot as a couple. I decided to break it off, but we remained best as friends.His death occurred a few days later....and I was completely heartbroken. I couldn&#39;t believe something like this had to happen.. you can imagine how much I cried over the loss of him. Although he was no longer more than a friend to me, we were close.It was... quite gruesome. I&#39;ll explain best I can. Liam was locked inside of his apartment when a fire started from the next door neighbour. When firefighters found him, they explained the door was locked shut and the key hole was broken from the inside. They had to break down the door. He was 12 stories high in the apartment so the window was not an option. I honestly don&#39;t know which way would&#39;ve been worse to go.....Firefighters found him on the floor next to his bed, burnt to death from the fire that&#39;d slipped through to his apartment and around the rest of the 12th floor....</p>\n\n<p>I don&#39;t like talking about it. I&#39;m tearing up thinking about it, but it was how he went.Side note, he was 20. Currently writing this, I&#39;m 18.</p>\n\n<p>About a month or two later was when I started getting the messages. I found this so fucked up when they started. I thought one of my friends was playing a joke on me, using my dead ex boyfriend&#39;s number to message me. This is the first screenshot I have of the messages &#39;he&#39; was sending me. I didn&#39;t want to change the contact name to Liam just for this, so I blacked it out using a website online.</p>\n\n<p>2nd of February this year, 2018 <a href=\"http://prntscr.com/jnhp56\">http://prntscr.com/jnhp56</a></p>\n\n<p>Those were the only messages I got on that day. After the third &#39;hello&#39;, I ignored them. I got a little more than upset that night before bed, knowing someone was fucking with my head to do this.</p>\n\n<p>More messages came in throughout that month. Same simple &#39;hello?&#39; the entire time. This is just a singular screenshot of one full page of them.</p>\n\n<p>10th of February this year <a href=\"http://prntscr.com/jnhrly\">http://prntscr.com/jnhrly</a></p>\n\n<p>I was constantly getting these kinds of messages. Someone was definitely fucking with me. I decided to send the number of Liam&#39;s a very strict and angry/upsetting message back. This happened about a week later.</p>\n\n<p>18th of February this year <a href=\"http://prntscr.com/jnhtq7\">http://prntscr.com/jnhtq7</a></p>\n\n<p>I never deleted the number. I kept it in my phone.After my message to the number, whoever it was, stopped. They stopped for a couple of months. As I&#39;m writing this, it&#39;s nearly the end of May. The messages have started again and I just don&#39;t know what to do..... I can keep this updated, I know people keep series. But I got a couple of messages yesterday and they weren&#39;t just a &#39;hello?&#39; from Liam. There were more words but also random letters that made no sense. I&#39;m so confused and afraid. I know there had to be a logical explanation for this, someone has to be fucking with me. But I don&#39;t understand. This is the last message I got from the number.</p>\n\n<p>25th of May this year, 2018 <a href=\"http://prntscr.com/jni826\">http://prntscr.com/jni826</a></p>\n\n<p>I was just about to upload this and I now just got a text notification. I&#39;m not going to look. I think it&#39;s from a friend. But I can&#39;t NOT get scared by that sound now.</p>\n</div>\n","author":"tilly_crystal"}