{"rank":"1134","title":"I Sold My Heart To A Man On Craigslist","id":"8mp7se","url":"/r/nosleep/comments/8mp7se/i_sold_my_heart_to_a_man_on_craigslist/","time":"1527504915000","body":"<div class=\"md\"><p>It’s exactly as it sounds. </p>\n\n<p>I’ve had a few drinks, so I’m a little bit more calm now. I’ve had a long day, full of weird crap and an even weirder man, which you’ll be hearing about very soon. But I gotta preface this by saying that I’m never using Craigslist again. As if that matters. Just, please be careful about who you meet online. Please.</p>\n\n<p>I’d just broken up with my boyfriend of two years, after being sent a picture from one of my old sorority sisters of him in a bar with his tongue down some girl’s throat. “Is this Mike?” said the attached text message. The image was super blurry, but I could make out his features, and the tattoo of an eye on his exposed collar bone. It was him.</p>\n\n<p>Needless to say, Mike had all of his stuff moved out within a few hours. Giving him a piece of my mind felt good. But like most breakups, I ended up a crying mess on my best friend Rachel’s bed a night later. To cheer me up, we browsed Craigslist together.</p>\n\n<p>It was kind of an inside joke between the two of us to send the craziest posts we found on Craigslist to each other. I’m sure you know how the site operates. You can find pretty much anything for sale, or anyone. Perverts, dog-walkers, technicians, therapists. Browsing through it was a great way to waste a few hours. But I had never considered actually <em>using</em> the site for anything other than memes.</p>\n\n<p>“Look at this one,” Rachel said, pointing to a photo of a guy in a skull mask and a fedora. “He says he wants someone to move to South America with him and….oh…that’s explicit.”</p>\n\n<p>“Jesus,” I giggled. She clicked on the next page, and one particular post caught my eye.</p>\n\n<p><strong>Looking To Buy A Heart, mfw</strong></p>\n\n<p>“Huh…?” Rachel clicked on it, and the first thing we saw was this handsome Adonis-looking guy, with the brightest smile I ever saw and wind-swept brown hair that could rival even Mike’s. We were awe-struck by how good he looked, and almost forgot to scroll down to read his actual post.</p>\n\n<p><strong>Looking for the heart of a beautiful, down-to-earth girl. Must be pure of soul but not pure of body ;). Would love to steal one, but thought that asking would be more gentlemanly.</strong></p>\n\n<p><strong>Preferably would love someone with a great taste in music, an open mind and a dog-lover. Leave daddy issues at the door. A healthy lifestyle is important. I believe the body is a temple, so she should, too.</strong></p>\n\n<p><strong>Getting to know someone is important. I’d like to take a free-trial before making the sale ;). No Netflix? No problem: my movie collection has been praised for being the best this side of the Mississippi River. If you don’t like movies, we can do whatever you want. As long as it’s not too illegal.</strong></p>\n\n<p><strong>I’m in desperate need here. It’s been too long and it’s time I finally meet someone made for me. Maybe it’s you? ;)</strong></p>\n\n<p><strong>Serious inquiries only.</strong></p>\n\n<p>Rachel wrinkled her nose. “Ew.”</p>\n\n<p>“Let’s fuck with him,” I suggested. </p>\n\n<p>“Really?”</p>\n\n<p>“Yeah,” I affirmed. “Come on, it’s obviously a joke. No one actually talks like that.”</p>\n\n<p>Rachel smirked knowingly. “You’d be surprised. His confidence has to be through the roof with cheekbones like that.”</p>\n\n<p>“Well, even more reason to message him. If he’s genuinely like this, then this tool deserves to be messed with.”</p>\n\n<p>Rachel looked skeptical, but in my current state I didn’t want to be rational. I wanted to be as reckless as Mike was for once. I took the laptop from her and hit the “reply” button. His contact name was Liam Malcolm. Very model-esque. It sounded very fake. Nonetheless, I copy and pasted his email into one of my burner emails that I use for free streaming trials. </p>\n\n<p>“What should I say?” I asked. “I don’t know if I should be super cheesy or act like I’m totally serious.”</p>\n\n<p>“Imitation is the best form of flattery,” Rachel said. “Maybe sound as shallow as he does.”</p>\n\n<p>I nodded, and got to work. By no means do I think I’m God’s gift to the world, but I tried my best to sound as snooty and particular as possible. After about ten minutes of typing, editing, and raucous laughter, I came up with my reply:</p>\n\n<p><strong>Hello there. I am very interested in your offer. But first, a few things to discuss.</strong></p>\n\n<p><strong>What are the benefits of selling my heart? I have found that with these things, the rewards turn out to be more mediocre than mind-blowing. Are you sure you can afford it?</strong></p>\n\n<p><strong>I am a dog-lover, but I’m only willing to meet with you if you have a dog of your own. The number of them doesn’t matter, as long as one of them is of the teacup variety.</strong></p>\n\n<p><strong>It’s your lucky day, as I do enjoy to watch movies. However, the only genre I like is romantic comedy. If you don’t have The Hottie &amp; the Nottie on DVD then I’m afraid this may be a dealbreaker.</strong></p>\n\n<p><strong>My diet consists of lots of water and green things. Lettuce, bell peppers, avocados, anything green, I’ll eat it. I expect you to do the same.</strong></p>\n\n<p><strong>Lastly, my body is a temple, but I’m curious to know how you would worship it.</strong></p>\n\n<p>“Woah woah woah, too cheeky,” Rachel said. “Damn, I thought you weren’t ready to get back on the wagon.” </p>\n\n<p>“If you think I’m desperate enough to sleep with a boy who winks as much as he does then you don’t know me as well as you thought.” I said, shaking my head. “It’s all a joke. I’m sure he’s gonna reply to this with a dick pic anyway.”</p>\n\n<p>I sent it.</p>\n\n<p>I woke up the next morning with a hangover and a new email from Liam. Seeing his name made my heart begin to pound just a little faster. Common sense told me to leave him alone, but I was immensely curious. I got out of bed, careful not to wake Rachel, and went to the bathroom to splash some water on my face and read his reply.</p>\n\n<p><strong>Heya there.</strong></p>\n\n<p><strong>Not gonna lie, you seem to be very high maintenance, but that’s exactly what I’m looking for. I love to take care of people, so it looks like it’s your lucky day as well ;).</strong></p>\n\n<p><strong>I can also pay whatever you’re willing to shell out. We can discuss payment after a few drinks, if you want.</strong></p>\n\n<p><strong>Here’s my number.</strong></p>\n\n<p>My heart was beating even faster than before. But my brain smacked my heart in the face and reminded me that I had no idea who this guy really was. His name, his picture, all of it screamed “fake.” There was no way someone that good-looking could be real.</p>\n\n<p>And yet, I found myself inputting Liam’s number into my phone.</p>\n\n<p>After a few minutes sitting on the counter, staring at the digits at the top of my messenger app, I typed out a simple “Hey.” It was another few minutes before I gathered enough nerve to send it. Soon after, Rachel began to stir, and I slid my phone into the waistband of my pajama bottoms and went downstairs to make breakfast.</p>\n\n<p>Rachel came to eat after about an hour, her hair still a mess but with a clean face and brushed teeth. We talked a little about our plans for the Sunday until her eyes lit up and she asked me if Liam had replied to my email. For whatever reason, I didn’t want her to know that he had.</p>\n\n<p>“Nah,” I said. “Must’ve scared him off with the temple line.” </p>\n\n<p>She shook her head. “I’ve heard worst ones, to be honest.”</p>\n\n<p>And so, I texted him any time Rachel wasn’t in the room, hooked to his words. He spoke confidently, and was much more personable than his Craigslist ad made him out to be. He was soft, he was funny, he was charming. He’d even majored in Biochemistry at the same college that I went to. He replied to me almost immediately every time, which let me know he was interested in talking to me. It could’ve just been me feeling very, very lonely, but I didn’t want to stop messaging him, even when I got home later that night.</p>\n\n<p>We set up a coffee date for the very next day. Before I went to bed, I told him goodnight.</p>\n\n<p>“Goodnight, Amanda,” he sent, with his iconic wink face. I didn’t realize it then, that something was very, very wrong, because I was so starstruck. But I hope you caught it at least. </p>\n\n<p>We met at a coffee shop the next afternoon, a popular one with plenty of witnesses in case things went south. I was nervous, showing up about ten minutes before our scheduled meeting time. This was the first time he would see me. I don’t think I look <em>terrible,</em> but compared to Liam, I was leagues below him. And I still had my doubts on whether it was a catfish or not. Regardless, both of us were supposed to be wearing an alumni shirt from our alma mater, Virginia Tech. </p>\n\n<p>He walked in precisely at 4 pm, our meeting time, wearing a VT t-shirt and looking exactly like his Craigslist ad. Heck, even better. He was tall, wearing shorts that showed off his sculpted legs, and his windswept hair looked glossy and soft. He scanned the room, and his eyes landed on my shirt, then on me, settling on my face.</p>\n\n<p>He smiled, sitting down next to me.</p>\n\n<p>The next few hours were a blur. I felt at ease with him, like I would with Rachel, as we talked about any and everything. His voice was hypnotizingly deep, and his eyes were so very intense. I learned more things about him: he was an only child, worked from home as a free-lance artist, loved the rain and the color red. We’d soon developed a bond, and I was enjoying his company. We didn’t bother ordering anything.</p>\n\n<p>I was happy, for a while.</p>\n\n<p>It was during a very rare lull in the conversation that I noticed the sun was setting. Panic set in, and I checked my phone clock, confirming that we had, in fact, been sitting in the same spot for hours. I hadn’t eaten since that morning. I hadn’t used the bathroom since he’d gotten there. I tried to stand, and my legs wobbled, Liam reaching a hand out to steady me.</p>\n\n<p>“You okay?” he asked, concern in his voice. </p>\n\n<p>I nodded. “It’s getting pretty late. I should be on my way home…”</p>\n\n<p>“You’re having run, right?” He asked. “You could come back to my place, if you want.”</p>\n\n<p>The “yes” was on the cusp of my lips, but the aching pain in my legs had managed to keep my head semi-clear of the perpetual state of wonder he’d kept me in. I remember what I told Rachel the night before, about not being ready to get back on the wagon. And I knew that emotionally, I truly wasn’t. Liam didn’t deserve to be a one-night stand, nor did he deserve to be a rebound. </p>\n\n<p>“Sorry,” I said. “Maybe another time? I did have a lot of fun. I’d like to see you again.”</p>\n\n<p>There was a bit of hurt in his eyes at my apology, but they lit up again at the end of my sentence. “Let me walk you outside, then.”</p>\n\n<p>He gave me his arm, and let me lean on him as we walked to my car. There were less people milling around the outside of the shop than there’d been in the afternoon, but still quite a few. I felt safe enough. When we got to my Sedan, Liam leaned against the hood, flashing me with another smile.</p>\n\n<p>“So,” he said. “About our deal.”</p>\n\n<p>“Deal?” I asked. Then I remembered the ad. I grinned. “Go on.”</p>\n\n<p>“I was thinking, maybe…another date, in exchange for your heart?”</p>\n\n<p>“Just a date? I think I’m worth more than that.”</p>\n\n<p>He raised his brows suggestively. “I really like you. I’m sure we could work out <em>something.</em> Anything you want.”</p>\n\n<p>“Anything, huh? That’s quite an offer. I’ll have to think about it.”</p>\n\n<p>“You don’t have to decide now,” he said, standing up and facing me. I looked up into his eyes, which regarded me coolly. I remember thinking, I could stare up into them forever. “As long as I have your heart.”</p>\n\n<p>“The way things are going, you’re well on your way,” I murmured. He leaned in, and so did I, expecting a kiss. Instead he grabbed my hand, squeezing it.</p>\n\n<p>“Is that a yes?” He quietly insisted, his breath tickling my lips. My body was on fire, and the butterflies were flapping around inside me for all they were worth. But the sensation was different, different than the first time I kissed Mike or the first time I gave my first oral presentation in school. And I couldn’t put my finger on it. </p>\n\n<p>But, at that moment, I didn’t care. I thought it was just him keeping up the charm. And I didn’t want to ruin the joke. But looking back, I should’ve just left. Things could’ve been different.</p>\n\n<p>“Yes.”</p>\n\n<p>He grinned, showing off all his pearly whites, and giving my hand a tug. I felt a pinprick there, almost like an itch in my palm, and he let me go, the sensation going away.</p>\n\n<p>“Goodnight, Amanda,” he said, nodding. He walked away, our conversation ended on a rather abrupt note. I watched him turn the street corner and disappear past the shop, as the streetlights finally came on. It was a little weird, but I shrugged it off. After all, it was the first awkward moment we’d had.</p>\n\n<p>I drove home, trying to quell the butterflies inside, when Mike called me. I ignored it, and the subsequent calls he made to my phone. Instead of picking up, I called Rachel, and finally spilled the beans about Liam. She was surprised, but very impressed that Liam turned out not to be a wackjob. </p>\n\n<p>“You’re going to see him tomorrow, then?” she asked. “Oh my gosh, what if he has like, a giant house. What if he has horses?! I want to ride a horse!”</p>\n\n<p>“I didn’t know you were a middle school girl, Rae,” I teased. “But we haven’t made any plans yet. He wants to see me again, though.”</p>\n\n<p>“That’s so nice,” she said. “Who knew you could luck out on a wacko site like Craigslist. I’m grateful if I find a guy who even remembers my name.”</p>\n\n<p>That was when it clicked. My foot hit the brakes, the sound loud enough for Rachel to squeal and ask me what was wrong on the other end of the phone. I’d had a realization, one that should’ve come up earlier. Not once, in text, or in person, had I told Liam my name.</p>\n\n<p>I relayed this to Rachel, who brushed it off. “He probably looked you up on Facebook or something.”</p>\n\n<p>“How could he? He hasn’t seen me before today. I don’t…I never even told him about myself.” The epiphanies were piling up in my head. All he had was an email I didn’t even use often, one that in no way had my name or age or anything of the sort. “All he knows about me is from that joke email we sent, and that’s not even really <em>me,</em> Rae.”</p>\n\n<p>“Calm down. You gave him your number, right? He probably looked you up with that.”</p>\n\n<p>Sure, yeah. But it would’ve been much easier to just ask. “I…guess.”</p>\n\n<p>“Do you want to come over again?”</p>\n\n<p>“No, I’ve got work tomorrow. I’ll be fine. It’s probably nothing.”</p>\n\n<p>“Alrighty, then. Let me know if you need anything. Get home safe!”</p>\n\n<p>I hung up, staring down at my phone. I opened the messages app, scrolling up until I saw the goodnight message from before. “Goodnight, Amanda ;)” Suddenly, I just didn’t feel good. My stomach was in knots. And, sitting stationary on an empty road, I felt very creeped out. It was like I was being watched.</p>\n\n<p>Turns out I was.</p>\n\n<p>I looked up, noticing a light in my rearview mirror. I adjusted it until I could see another car’s headlights, a good distance behind me. They weren’t getting any closer. That car was stopped just like I was. But there were no houses nearby, no buildings, and no one standing outside the car. It was just sitting there, waiting for me.</p>\n\n<p>I put the pedal to the metal and peeled out of there. I took the long way home, driving through a few different neighborhoods. There was a chance that  that car was minding its own business, but my instincts were telling me otherwise. After I was sure I wasn’t being followed, I went home and ran inside, locking the front door and watching the street from my living room window for a few minutes. I didn’t see or hear anything unusual. But I was quaking like a chihuahua.</p>\n\n<p>I went to the kitchen, turning on all the lights and dialing Rachel’s number. Before I could finish putting in her number, I saw that she was calling me. I answered, saying “Speak of the devil” before her panicked voice made me pause. “What’s up?”</p>\n\n<p>“Mike…” she began, “Something happened…something bad…”</p>\n\n<p>“What happened?” I questioned, feeling even more anxious.</p>\n\n<p>“An accident…on the road. I just saw it online-”</p>\n\n<p>“What?” I demanded, getting a little hysterical. </p>\n\n<p>“He’s died, Manda. Side impact collision. The police put out a picture and his car is…I don’t know. I don’t know. It looks bad. There’s chunks of it missing. It was a hit and run, it looks bad. I’m so sorry-”</p>\n\n<p>“What?” I whispered.</p>\n\n<p>“Manda-“ I hung up, going online to unblock Mike’s Facebook and look at his feed. People were already posting messages of support to his family. I went to my news app next, seeing “FATAL HIT-AND-RUN ON BARKER RD” as a headline.</p>\n\n<p>I saw his picture, one I took of him on vacation. I saw his car, unrecognizable from a giant pile of scrap metal you’d see in a junk yard. It looked like he’d been hit by a freight truck. No one was surviving that.</p>\n\n<p>The guilt is indescribable. He called me what could’ve been minutes before his death. Sure I was deserved in ignoring him, but…I don’t know. We’d been together for two years. I was happy with him. I loved him. I still love him. It’s hard to move on from something like that. Any chance of reconciliation, or even closure, is gone now. Mike is gone.</p>\n\n<p>But you know what the kicker is? I cannot shake the feeling that it’s all my fault. It’s been a few hours since all of that happened. Rachel kept calling me, but I didn’t have the heart to pick up. Her last text was an offer to come over to my place, and at first, I didn’t want her to. Everything felt too wrong. Even going outside felt dangerous. But I got desperate and ended up accepting, but that was two hours ago. She should be here by now, and she’s not answering <em>my</em> calls now. My hand has been bleeding for some reason but the bandaids are in the kitchen and I refuse to leave this bathroom floor until she arrives.</p>\n\n<p>And Liam has been sending me so many messages, saying how he can’t wait to see me again. I can’t bear to respond. The guilt is too overwhelming. It feels like I don’t deserve to be happy with anyone else. I debated just telling him not to contact me again. It wasn’t like we could last, anyway. The wink emoticon he sends is getting pretty damn annoying. It’s almost like he knows something I don’t.</p>\n\n<p>Oh, thank God. Someone’s at the door. <a href=\"https://www.facebook.com/autheauthor/\">Rachel must be here.</a></p>\n</div>\n","author":"RJHoodie"}