{"rank":"17","title":"May 28th, 2018: NeonTempo Interview","id":"8mpkfa","url":"/r/NoSleepInterviews/comments/8mpkfa/may_28th_2018_neontempo_interview/","time":"1527509052000","body":"<div class=\"md\"><p><strong>Tell us a little about yourself.</strong></p>\n\n<p>I’m an aspiring writer from Sheffield, UK, currently residing in South London. I try to spend what little time I have between work and sleep creating the most engaging and original stories I can… with varying degrees of success.</p>\n\n<p><strong>When did you first become interested in horror?</strong></p>\n\n<p>Horror definitely played a part in my early life, as it does for any child with an overactive imagination and a tendency to jump at shadows. I remember having an internal debate with myself one night about whether to sleep with my door open or closed. A closed door shields you from monsters, but an open door saves valuable escape time if the creature can pass through solid objects. These Monster vs Ghost conundrums, and other sparks of nightmare fuel, eventually wound their way into my early short stories and poems. I also had very trusting parents who allowed me to watch films a little beyond my age rating, so I was introduced to classic horror from a relatively early age. Seeing those sorts of films taught me that horror isn’t just about jump scares and dark corners, and that it can be used to tell stories that no other genre can.</p>\n\n<p><strong>Was there a specific moment you knew you wanted to write in that genre?</strong></p>\n\n<p>Honestly I only started regularly writing horror after browsing <a href=\"/r/shortscarystories\">/r/shortscarystories</a>. I tend to write for whatever audience I find, and the Shortscarystories subreddit was exactly what I needed. My job is fairly busy and there’s a lot of overtime so I only really had a chance to write on the bus journey to and from work. Horror is one of those genres that can deliver a powerful hit in very few words. In fact, like a good joke, brevity is often the very soul of good horror. I enjoyed having somewhere where I could work on stories that packed a narrative punch while still being manageable for me as a time-poor writer. I suppose it was born out of necessity, but it’s grown into a genre I actively want to pursue writing for in future.</p>\n\n<p><strong>How did you discover NoSleep? What prompted you to begin writing for it?</strong></p>\n\n<p>Well originally I wrote exclusively on <a href=\"/r/shortscarystories\">/r/shortscarystories</a>; the 500-word limit suited me as my available writing time was strictly limited. In point of fact, Left/Right was going to be a shortscarystories post as well but, in the end, my plans for the narrative grew a little larger than 500 words would allow. I didn’t know much about NoSleep before I started posting the Left/Right Game, but it’s one of the few subreddits with a real sense of culture and genuine mythology. It’d already been running 7 years by the time I showed up and there was already this pantheon of names and stories that Nosleepers are really enthusiastic to recommend and discuss.qa</p>\n\n<p><strong>Other than writing, what are some of your hobbies? What other creative mediums do you enjoy?</strong></p>\n\n<p>Although I think “Buff” is perhaps too strong a word, but I do consider myself a movie enthusiast, and I make a pilgrimage to the infamous Peckhamplex in pursuit of my cinematic fix whenever I can.</p>\n\n<p>I’m an avid board gamer; me and my SO are cool enough to run a monthly board game night at our flat. I’ve also recently accomplished a long-held ambition of setting up a regular D&amp;D game which is the nerdiest thing I’ve done in a long time and which I am enjoying immensely.</p>\n\n<p><strong>Do you ever explore writing other genres besides horror? If so, what other styles of writing? Which do you prefer?</strong></p>\n\n<p>I certainly do! I have a lot of science fiction ideas which I would love to explore in future. I also tend to write a lot of 30 minute scripted sitcoms aimed at British TV. London has a few places where you can test those sorts of scripts out and I’ve received some warm reactions from them, but at the moment they’re more of a passion project than anything else.</p>\n\n<p><strong>Where do you find inspiration? Have real life experiences ever made their way into your work?</strong></p>\n\n<p>I always seem to draw from places without realising it, only noticing later how a story element clearly resembles something from my past. </p>\n\n<p>It’s fair to say <a href=\"https://redd.it/7asz8x\">The Left/Right Game</a> was inspired by a road trip I took in Morocco; a country with such varied terrain that, if you fell asleep in the car, you could wake up thinking you had entered an entirely different world.</p>\n\n<p>I also took inspiration from NPR Podcasts like <a href=\"https://www.thisamericanlife.org/about\">This American Life</a> and <a href=\"https://stownpodcast.org/\">S-Town</a>, which gave me an interest in the audio documentary format, as well as inspiration for the principle characters.</p>\n\n<p><strong>What is the most terrifying thing you have personally experienced?</strong></p>\n\n<p>I actually couldn’t think of an answer to this question, which is fortunate I suppose. I asked my SO and she reminded me of the quiet freak out I had when we first moved in together, after knowing each other for a long time but not dating for very long at all. I was lying in bed next to her when I realised the sheer momentousness of what I’d just undertaken, how we were going to be the person the other comes home to every day from that night forwards, possibly for a very long time indeed. About 5 unblinking minutes of heart palpitations and sweaty palms later, she saved the whole situation by turning around and letting me know that she was also freaking the fuck out. There are few things as low key terrifying as staring down the barrel of your future in the middle of the night, but there are also few things as perversely comforting as having someone else freak out next to you at the exact same time. I can say categorically however, that was the last night I felt anything close to worry about that particular step.</p>\n\n<p><strong>What are some of your biggest influences from media?</strong></p>\n\n<p>I love stories where it’s clear the creator has sat down and put a great amount of thought into their work; Movies like Nacho Vigalondo’s “<a href=\"https://en.wikipedia.org/wiki/Timecrimes\">Los Chronocrimines</a>”, Jerome Bixby’s “<a href=\"https://en.wikipedia.org/wiki/The_Man_from_Earth\">The Man from Earth</a>”, James Ward Byrkit’s “Coherence”, as well as Brandon Seifert’s comic book <a href=\"http://brandonseifert.info/witchdoctor.html\">Witchdoctor</a>. Those sorts of stories drive me to properly think about the characters and world that I’m writing.</p>\n\n<p>I also get a lot of inspiration from people who have the ideas I could never have thought of; Junji Ito comes up with things that I could never think of. The same thing’s true for Limmy of <a href=\"https://en.wikipedia.org/wiki/Limmy%27s_Show\">Limmy’s Show</a> fame, I couldn’t write a Limmy’s Show sketch if I tried.</p>\n\n<p>I could really go on forever in terms of my influences, and might build a recommendation list in future if there was any interest. But I think I’ll leave it there for the moment.</p>\n\n<p>Oh and a quick shout out to Nacho Vigalondo’s short film, <a href=\"https://www.youtube.com/watch?v=ziqvcJsKUoE\">7:35 De La Manana</a>. In terms of dark humour, pathos, inventiveness and originality alone, that is the short film idea I always wish I’d had.</p>\n\n<p><strong><a href=\"https://redd.it/7asz8x\">The Left/Right Game</a> quickly became one of the most iconic NoSleep stories of all time. All ten parts are in the top 60 most upvoted posts in the sub’s history, it has by far the most\ncumulative upvotes of any series, and the various parts have been viewed an estimated one million times. At what point did you realize just how popular your series had become? Were you\nsurprised by its success?</strong></p>\n\n<p>I was completely surprised by, and woefully unprepared for, the amazing response from the readers of NoSleep. It was awesome to have people reading my work and commenting on it with such\ninsight. I was most surprised by the number of private messages I got from people during the series’ run that held a lot of encouraging words.</p>\n\n<p>People are lovely.</p>\n\n<p><strong>The Left/Right Game was your first NoSleep contribution. NoSleep stories typically lose significant readership over multiple parts, particularly those longer than three installments. It&#39;s difficult to keep attention on a story if more than 48 hours go by with no update. Posts longer than 3,000 words can fail to attract those with limited reading time. The Left/Right Game broke the mold with all of these trends in a very significant way. Did you feel, as you were writing it, that you were charting your own path?</strong></p>\n\n<p>I had no idea about any of those things and, in a way, I’m quite glad that I didn&#39;t. I don&#39;t know if my awareness of those unwritten rules would have changed how I wrote the story, but it may have determined whether I chose to post it in the first place.</p>\n\n<p>So yeah, far from believing I was charting my own path, I honestly stumbled through the process fairly cluelessly.</p>\n\n<p>But I tried to make each instalment as interesting as possible, and the characters as engrossing as I could and, in the end, I’m just really happy people seemed to enjoy it.</p>\n\n<p><strong>Many plot points were quietly laid early in the narrative, only to be revisited much later. Did you know how this story would end before you began?</strong></p>\n\n<p>I knew the broad strokes of the plot going in, including how the story was going to end.</p>\n\n<p>Specific details about the incidents the convoy faced were refined as I went along, which actually presented some interesting challenges considering the finite resources they had on the road.\nIf I came up with a new twist on one of the later trials in the story, figuring out how Alice was going to make it through the situation with only the tools at her disposal required a modicum of on-the-spot problem solving.</p>\n\n<p>Chances are if you ever found yourself wondering “How is Alice going to get out of this?” I was likely thinking the very same thing while writing it.</p>\n\n<p><strong>What made you decide to set The Left/Right Game in Arizona? Were you familiar with the area you set the story in?</strong></p>\n\n<p>I have never been to Arizona I’m afraid. To be completely honest, I’ve never even been to Bristol.</p>\n\n<p>I chose Phoenix for the same reason Rob did. It’s built on an <a href=\"http://www.historyadventuring.com/2015/05/how-grid-system-of-phoenix-arizona-works.html\">incredibly impressive grid system</a> which affords the necessary run up required in The Left/Right Game.</p>\n\n<p>In fact, one website told me that the grid system in Phoenix is so exact that <a href=\"https://en.wikipedia.org/wiki/Phoenix_metropolitan_area#Street_numbering_systems\">every 8 numbered street equals exactly one mile</a>. So if you have to travel sixteen blocks, you know it’s going to be a 2-mile journey. That’s something I think Rob would have always appreciated.</p>\n\n<p>Once Bike Repair Guy arrived in Arizona in <a href=\"https://redd.it/7q3x6e\">Part 9</a>, I received a lot of PM’s recommending local spots and offering to show me around the city so I now have an awesome list of stuff to do when I finally visit for real.</p>\n\n<p><strong>Though the narrator is a young man, most of the story is told from the view of Alice Sharma. Which character do you most relate to, and why?</strong></p>\n\n<p>You know, I honestly think I relate to both of them, which I think plays to the heart of what I feel The Left/Right Game means to me. I think, in a way, it’s a story about following a dream.\nBike Repair Guy doesn’t have any particular ambitions, he’s content in his position, appreciates the world around him and, until he hears from Alice, he’s utterly happy to live in the comfort of a leafy North London suburb, in the safety of the real world.\nConversely, Alice is driven, ambitious to the point where she lets everything and everyone else fall away. She leaves her comfort zone, enduring a road of trials which can oftentimes treat those who travel it dispassionately and unfairly, all in order to reach a faraway, increasingly ill-defined point that may never even arrive. In the end, she can only accept that the journey itself, and the person she becomes as a result, is really the only thing close to a destination.</p>\n\n<p>I feel I relate a lot to both of those philosophies. I’m happy with everything I have, but I also want to achieve something more (whatever that may mean). It’s a cognitive dissonance that I think a lot of people harbour, and if it isn’t approached constructively it can lead to a life of utter discontent.</p>\n\n<p>Apologies if that was all a little bit trite.</p>\n\n<p><strong>There was much reader discussion about potential casting for a hypothetical Left/Right Game movie. Do you have your own actors in mind to play the characters?</strong></p>\n\n<p>I’m reluctant to give my own idea of what the characters look like; sometimes I try to avoid overly specific descriptions in order to keep things fairly nebulous and allow people&#39;s own conception of a character to remain as valid as possible. Instead, what I will do is list the casting choices that readers made which struck me as really interesting choices.</p>\n\n<p>Alice: <a href=\"https://www.imdb.com/name/nm7584343/\">Kiran Sonia Sawar</a></p>\n\n<p>When I saw this name come up, I immediately recognised her from the BBC show ‘<a href=\"https://www.bbc.co.uk/programmes/p03nnns9\">Murdered by My Father</a>’ where she definitely left an impression. There’s very little to this one other than the fact that she just feels like she could be a great Alice.</p>\n\n<p>Rob: <a href=\"https://www.imdb.com/name/nm0064769/\">Jim Beaver</a> </p>\n\n<p>In Supernatural, this guy played a character which I think resonates with Rob’s own personality. Gruff, by-the- numbers but soft at his core. He also feels like he can be suitably intimidating if he wants to be, which is helpful.</p>\n\n<p>Apollo: <a href=\"https://www.imdb.com/name/nm0430107/\">Michael B. Jordan</a> OR <a href=\"https://www.imdb.com/name/nm0170968/\">Chad Coleman</a></p>\n\n<p>I mean, everyone loves Michael B. Jordan. Another suggestion, Chad Coleman, in some scenes and photos that were linked to me, radiates the sort of easy kindness that I feel like Apollo needs.</p>\n\n<p>Bonnie: <a href=\"https://www.imdb.com/name/nm0000531/\">Frances McDormand</a> </p>\n\n<p>Much like Rob, I feel like Frances McDormand could play the meek and sinister aspects of the character, and also portray the fracturing sanity that lies between those two points.</p>\n\n<p>Bluejay: <a href=\"https://www.imdb.com/name/nm0000326/\">Kim Cattrall</a> </p>\n\n<p>This one struck me quite a bit. I don’t watch Sex &amp; The City, but simply by osmosis I’ve gained an impression of the character of Samantha. There’s an irreverence, rampant self-belief and dubious empathy which I think, if it were correctly utilised within the character of Bluejay, would gloriously play into her character.</p>\n\n<p>Shoutouts to: <a href=\"/u/El_Enemigo\">/u/El_Enemigo</a>, <a href=\"/u/romb-bane\">/u/romb-bane</a>, and <a href=\"/u/dacoster\">/u/dacoster</a> for recommendations. Sorry I couldn’t find the person who recommended Kim Cattrall’s Bluejay.</p>\n\n<p><strong>Have you heard reports of anyone actually trying the Left/Right Game themselves?</strong></p>\n\n<p>I haven’t actually… maybe they just never made it back :/</p>\n\n<p><strong>The narrator&#39;s fate is intentionally left open-ended in The Left/Right Game. Do you plan on ever returning to this world, and these characters?</strong></p>\n\n<p>I am definitely open to a sequel. I love the setting, and I honestly miss writing for the characters. But that&#39;s all the more reason why a sequel would need to be really well thought out and, importantly, add something of value to the world. The last thing I’d want to do is write a sequel just for the sake of it.</p>\n\n<p>I have had two or three vague concepts which could potentially fit the bill, but they would all need a great deal of fleshing out and, until such a time as I have an idea I’m fully proud of, The Left/Right Game will remain a standalone story.</p>\n\n<p><strong><a href=\"https://redd.it/6z6tfk\">A Day Off in Hell</a> presents a soul-crushing final view of the afterlife in just a few words. The Left/Right Game spans the length of a novel to share an ambiguous and subjective view of the next world. Do either of those views align with your personal beliefs? How do religion and theology influence your writing? What were you trying to communicate in these stories?</strong></p>\n\n<p>That’s a really interesting question.</p>\n\n<p>I wish I could say I believed in an afterlife. However, (though I’m not big on self-categorisation) I suppose I fall into that large net of Agnostic Atheists who never landed in a religion and simply have to say they don&#39;t know.</p>\n\n<p>I suppose, for that reason, I identify with the world of the Left/Right Game more than A Day Off in Hell. Left/Right featured a universe which was vast and incomprehensible, with its own moral rules, or perhaps no moral rules at all.</p>\n\n<p>I just feel like any true afterlife would be completely incomprehensible to us as we are now.</p>\n\n<p>Though I am quite fond of the afterlife espoused in Twilight Zone’s ‘<a href=\"https://en.wikipedia.org/wiki/I_of_Newton\">I of Newton</a>’ (featuring a young Ron Glass), where your soul gets packaged and sold to whoever’s willing to buy it.</p>\n\n<p><strong>The narrative scopes of The Left/Right Game compared with your work on <a href=\"/r/ShortScaryStories\">/r/ShortScaryStories</a>, embrace opposite extremes in terms of length. Which do you prefer? Was it easy to shift gears so dramatically?</strong></p>\n\n<p>I love them both for different reasons.</p>\n\n<p>Short stories are, by definition I suppose, all about brevity and simplicity for me. It is strange how horror is basically the photo negative of comedy. Even though they have the exact opposite intent, they both revolve strongly around subversion of expectation and there’s a certain laconic appeal to delivering that subversion in the most efficient way possible. I think that’s why we have one-liner comedians and also enjoy places like <a href=\"/r/twosentencehorror\">/r/twosentencehorror</a>.</p>\n\n<p>So beyond the more manageable writing time, there’s a technical challenge to short story writing which I really enjoy.</p>\n\n<p>Longer stories allow you to basically become a tour guide to a new world and, since I loved the setting of the Left/Right Game, that was an amazing job to have for three months. It’s also great to stay with characters and actually get to know them when you’re writing something for longer than 500 words.</p>\n\n<p>To answer the second part of this question; I don’t think it was too difficult to switch gears in terms of style. Writing is ostensibly still writing regardless of length. Series writing certainly led to more late nights, but I admittedly brought that on myself.\nWow, sorry this was a long answer.</p>\n\n<p><strong>What are your feelings toward NoSleep&#39;s immersion/believability rule?</strong></p>\n\n<p>I’m personally a fan of the immersion rules.</p>\n\n<p>Firstly, I kind of believe in the concept of Creative Limitation; that restrictions tend to foster creativity.</p>\n\n<p>Secondly, I think the need to treat each story as real has nurtured this great atmosphere of audience engagement on NoSleep. It’s really easy for commenters to feel like a part of the universe when they discuss a post, and I just think that’s really cool.</p>\n\n<p>I understand the issues people have with it but, at the end of the day, I wonder if NoSleep would be NoSleep without those particular rules.</p>\n\n<p><strong>How much time do you spend writing in an average day or week? Do you have any rituals that help you focus?</strong></p>\n\n<p>When I was writing The Left/Right Game I did about 3-4 hours of writing each day, and wrote from 9-4 on weekends. At the moment, I don’t have too much time but I’m hoping to take some time off work soon to focus solely on writing projects. In terms of rituals, I’m a big believer in “Whatever Works.” Usually, I try to go someplace public where my attempts at procrastination will be noticed. Places like the British Library, where work spaces are always at a premium, encourage me to keep working on the project at hand.</p>\n\n<p><strong>When crafting a piece of fiction, do you generally start with an outline or simply begin writing?</strong></p>\n\n<p>It’s definitely a mixture. I like to have an overview, and I usually don’t start a story until I have an ending which resonates with me. Once I have the outline however, I just get started on the writing. This is for two reasons: - SO many stories I have wanted to write have suffered from “Death by Over Planning”, and dwelling on what your story will be instead of starting it is a bit <a href=\"http://harrypotter.wikia.com/wiki/Mirror_of_Erised\">Mirror-Of-Erised</a>-esque - If I have every scene and line of dialogue planned, the writing process feels a little “Paint by Numbers” for my liking.</p>\n\n<p><strong>Have any of your stories ever involved research? If so, what was involved?</strong></p>\n\n<p>I don’t research as much as I should do for a lot of my work, which has led to some clear errors in my writing. I think that useful research is crucial to the verisimilitude of a story, but distinguishing what is useful and what is just procrastinatory world-building is a skill I’m still working on developing.</p>\n\n<p><strong>Are there any topics you feel are too controversial for you to address or that you prefer not to explore in your writing?</strong></p>\n\n<p>I don’t think there are any subjects too controversial to be addressed in fiction. I do, however, think it’s up to the artist to set their own standard of responsibility when confronting that sort of stuff. I also think that, at a base level, treating controversial subjects appropriately and judiciously is usually an indicator of good writing, so if you’re going to tackle those topics, you owe it to the story to ensure you approach them intelligently.</p>\n\n<p><strong>Do you have any favourite reader reactions to your writing?</strong></p>\n\n<p>The theories for The Left/Right Game were really amazing. It was great to see the analysis that was taking place in the comments. I must say however, I discovered an incredible fondness for “Cast Comments”, where commenters would outline the actors/actresses who they think should play the characters in the movie. It’s just so heartening to see people engage with the story, and search for who they see the characters as in real life. But I am genuinely grateful for every reader interaction I’ve received so far.</p>\n\n<p><strong>What story or project are you most proud of?</strong></p>\n\n<p>I’m of course very proud of The Left/Right Game, I was quite sad to leave the characters behind at the end of the story. I’m proud of my short stories, particularly the story <a href=\"https://redd.it/65hucy\">I Want My Wife Back</a>, and the poem <a href=\"https://redd.it/5yhh3h\">The Doctor, The Professor and The Turk</a>… I put a LOT of work into the scansion for that one.</p>\n\n<p><strong>What&#39;s the most valuable lesson you&#39;ve learned since you began posting to NoSleep?</strong></p>\n\n<p>For the love of all that is holy, good and true, have more material written up before you post Part 1 of a series. When I pressed submit on The Left/Right Part 1 back in November 2017, I thought I’d have a week or so to write the next instalment. It was only afterwards I noticed that most series posts are updated on an almost daily basis, and that the readers were accustomed to a similar schedule. A lot of coffee was consumed over the following three months, and I do not ordinarily drink coffee.</p>\n\n<p><strong>As a successful author on NoSleep, do you have any advice for new contributors?</strong></p>\n\n<p>I can never think of advice to give other writers, and I’m starting to think it’s because I shouldn’t say too much. If I had to give an opinion on what I think is best, I would say strive for originality. Think about what truly and deeply scares you and I can guarantee it will scare others. Finally, write in your own voice and be honest with yourself when you know a section of writing could be improved.</p>\n\n<p><strong>What are your short-term and long-term writing goals?</strong></p>\n\n<p>In the short term, I’m working on another series for NoSleep, which will likely be a much different type of story than The Left/Right Game but which I hope people will enjoy. I’m also working on a few projects that have come from The Left/Right Game which are incredibly exciting to pursue. In the most optimistic view of the future, I want to publish my existing work, and eventually write for every medium I can get my hands on; Books, Comics, Games, TV, Film etc. Most importantly however, I want to say thanks for all the support you have given me up to now in reading my various writings and I hope that you’ll appreciate my future work.</p>\n\n<hr/>\n\n<p><strong>Community Questions:</strong></p>\n\n<p><strong>Submitted anonymously: L/R Game has so much amazing imagery, both in regard to locations and characters; countrysides, scary dystopian villages, the hitchhiker, grotesque forest murder-babies, etc. Can you talk a little bit about where these came from? Any real-life places that inspired the places in L/R?</strong> </p>\n\n<p>Thanks for the kind words.</p>\n\n<p>I really wanted to make the Road into an eerie geographical patchwork, where every location was dialled just a few degrees off of reality. So yeah, I definitely used a few real world places for inspiration, exaggerating the inherent strangeness of these locations for dramatic effect.</p>\n\n<p>Jubilation</p>\n\n<p>The town of Jubilation was based on my visit to Celebration, Florida. Someone suggested this in the comments and that person was completely correct. I visited Disney World when I was younger and we stopped off in Celebration for my dad’s birthday. The place was so flawless and welcoming that my British sensibilities couldn’t help but find it a tiny bit sinister. That trip was also the first time I learned what a Homeowner’s Association was and I remember thinking, “Wow, there’s a lot of creepy material in that.”</p>\n\n<p>Wintery Bay</p>\n\n<p>Wintery Bay was loosely inspired by Whitley Bay in England. I’ve never been myself, but once when I was on holiday in Spain, my family got talking to a British couple in our hotel and the wife of the pair would occasionally say “... But it’s nice to be back in Whitley Bay.” When someone pointed out that we were in Spain, she’d look to her husband and excitedly exclaim “Did you hear that Ernie? We’re in Spain! Now!” Following this, her gruff Yorkshireman husband would call her ‘Daft’ and continue the conversation, only for her to mention their return to Whitley Bay once again.</p>\n\n<p>It was funny and charming at the time, I suppose because I was a child and didn’t understand the implications of what was happening. Now I’m older, that encounter remains charming, but there’s a sadness to it as well, which I think played into the essence of Bonnie and Clyde’s relationship.</p>\n\n<p>Others</p>\n\n<p>The following should be considered Non-Canon, but I always liked the idea that other concepts from across the horror genre are tied into the road.</p>\n\n<p>I like the idea that the <a href=\"https://en.wikipedia.org/wiki/Deep_One\">Deep Ones</a> of the Lovecraft Mythos reside at the bottom of the Endless Lake. After coming up with the idea for the cornfields, I kind of treated it like an unofficial Twilight Zone Easter Egg (Referencing the Twilight Zone episode <a href=\"https://en.wikipedia.org/wiki/It%27s_a_Good_Life_(The_Twilight_Zone\">It’s A Good Life</a>).</p>\n\n<p>There was another unofficial Twilight Zone reference that I snuck into the story in a slightly cryptic way, but that is all I’ll say about that.</p>\n\n<p><strong>Submitted anonymously: Will you turn this into a movie, please?</strong> </p>\n\n<p>I am certainly working to pursue any form of adaptation I can!</p>\n\n<p>I will say however that, if The Left/Right Game were brought to the screen, I don’t know if it would take the form of a feature film.</p>\n\n<p>Of course I’d certainly be open to the idea, and would jump at the chance to write the script. But I personally feel like the narrative lends itself to a small screen episodic format, split up by natural cliff hangers or simply into days of travel, allowing more time to slowly dial up the horror as well as organically build the relationships between all the characters.</p>\n\n<p>I just wouldn’t want any of the story elements to feel rushed, and 10 instalments is perhaps a little bit much to pack comfortably into a single film.</p>\n\n<p>But if any of you represent movie studios, ignore everything I just said.</p>\n\n<p><strong>From <a href=\"/u/Sasstronaut7\">/u/Sasstronaut7</a>: If Left/Right Game was ever made into a movie who would you choose to play the narrator?</strong></p>\n\n<p>Oh interesting! This is one casting I never really considered.</p>\n\n<p>However, the face that jumped to mind when I read this question was that of <a href=\"https://www.imdb.com/name/nm2288047/\">Daniel Rigby</a>, from BT Advert and <a href=\"https://en.wikipedia.org/wiki/The_Waldo_Moment\">Waldo Moment</a> fame. He can play serious when he wants to but can also play the endearing loser.</p>\n\n<p><strong>Submitted anonymously: How much organization and planning did it take to make L/R? There&#39;s so much layered things there (the character&#39;s nicknames, the cars they choose to bring, etc) if I were writing it I would have one of those crazy conspiracy-theory corkboards going.</strong> </p>\n\n<p>It surprisingly didn’t take much physical planning, which is kind of the reason I felt like I needed to write it. Once I had the idea, I kept musing on the story until I had the major narrative beats laid out in my head.</p>\n\n<p>That sort of thing never usually happens. I’ve been a crazy corkboard guy for much simpler stories, so I knew I had a tale which I needed to get on paper.</p>\n\n<p><strong>Submitted anonymously: Where did you come up with the concept?</strong> </p>\n\n<p>I started thinking about it when I took a road trip across Morocco in 2017. The country has a fascinating landscape which varies wildly from lush greenery to plains of almost Martian tundra. It’s very easy to feel like you’re passing between worlds on that journey, especially once you travel down to the Sahara and everything suddenly turns to sand. It also came from a musing that Interdimensional Travel fiction often seems so focussed on the destination, to the extent that the space in between is usually just a glowing portal or a short-lived wormhole. I wanted to write the story about the space in between, about the thin thread that leads between and beyond universes.</p>\n\n<p><strong>Submitted anonymously: What do you think is your most underrated story? Your most overrated?</strong> </p>\n\n<p>Ooh, this is quite a difficult question to answer.</p>\n\n<p>I thought the idea behind <a href=\"https://redd.it/67189m\">There’s Resentment Inside Some Of Us</a> was pretty fun and I hoped other people would similarly enjoy it. In the end I just don’t think I wrote it well enough to convey the central idea.</p>\n\n<p>It’s hard to say what stories I think are overrated, because I don’t post up any work that I’m not proud of. However, as a big fan of grounded, human horror, I was surprised that my <a href=\"https://redd.it/6z6tfk\">most upvoted</a> Short Scary Story was the most blatantly supernatural of all my ideas. Not that I’m complaining of course.</p>\n\n<p><strong>Submitted anonymously: 1. What are your favorite NoSleep stories?</strong> </p>\n\n<p>Now I’ve had a time to read a few, I have to say I’m a big fan of <a href=\"https://redd.it/3e2zje\">Borrasca</a>. The reveals in that story hit me hard and I also really liked the 5th installment which I feel rounds out the story well and has some really strong moments.</p>\n\n<p>I really need to take the time to read <a href=\"https://redd.it/7txais\">A Shattered Life</a> soon. The feedback I’ve seen for that story has been so overwhelmingly positive and I really want to know what it’s about before I stumble across any spoilers.</p>\n\n<p><strong>2. Will you be publishing The Left/Right Game as a book?</strong></p>\n\n<p>I would love to publish the Left/Right Game! It would be amazing to have my work in print.</p>\n\n<p>Recently a Chinese publishing company sent me a printed anthology containing one of my Reddit short stories and it’s taken pride of place on my shelf.</p>\n\n<p>A few things are preventing me from moving ahead with this at the moment; a lack of time, a lack of industry knowledge and the fact that I’m pursuing other avenues of adaptation for the story which I am very excited about and want to give my full attention to at the moment.</p>\n\n<p>When I finally get around to publishing, I want to give it all my time and focus.</p>\n\n<p><strong>3. I always pictured Rob from The Left/Right Game as <a href=\"https://en.wikipedia.org/wiki/Bobby_Singer\">Bobby Singer</a> from Supernatural. They have a lot of similarities beyond their names. Any connection there?</strong> </p>\n\n<p>In keeping with the radio-journalistic themes that underpin the Left/Right Game, Rob J. Guthard was mostly inspired by John B. Mclemore from <a href=\"https://stownpodcast.org/\">S-Town</a>.</p>\n\n<p>However, though I only have a passing knowledge of Supernatural, I totally agree there are some compelling similarities and I certainly feel that Rob Guthard and Bobby Singer would get along.</p>\n\n<p>To that end, if the CW are in the market for a madcap Supernatural spin off, I am available to pitch Singer &amp; Guthard: Mystery Detectives.</p>\n\n<p><strong>Submitted anonymously: What tips would you have for new writers?</strong> </p>\n\n<p>I don’t know if I’m in a position to give reliable advice to anyone else. If I had to say the advice that’s worked for me, I would say:</p>\n\n<p>1) Write for yourself. If you’re scared, heart warmed, laughing at what you write then it’s way more likely that others will react in the same way</p>\n\n<p>2) Strive to finish what you start.</p>\n\n<p>3) Write down your ideas. 5% of them will be amazing, but you need to have the other 95% first.</p>\n\n<p><strong>From <a href=\"/u/poppy_moonray\">/u/poppy_moonray</a>: TL/RG extensively mentions <a href=\"https://en.wikipedia.org/wiki/Aokigahara\">Aokigahara</a>, more commonly known as The Suicide Forest. Why did you choose that location specifically?</strong></p>\n\n<p>I wanted Rob to be well travelled, to have lived somewhere with a strong modern folklore, and to have seen his ‘spirit’ in a place where multiple nameless ghosts are meant to wander. I spent a lot of time combing through Japanese ghost stories looking for a place with the correct atmosphere, and somewhere that Hiroji would feel compelled to make a yearly pilgrimage to.</p>\n\n<p>After researching it, the <a href=\"https://en.wikipedia.org/wiki/Y%C5%ABrei\">Yurei</a> of Aokigahara just resonated with me.</p>\n\n<p>I think the nature of that place also says something about Hiroji, Rob and the rest of the Supernatural hobbyists; that they view such places, not as morose and sombre places, but as fonts of mystery and opportunity. Whether that viewpoint is existentially hopeful or woefully disrespectful is something Alice has to consider a few times across the journey.</p>\n\n<p><strong>If you had to live in the established universe of any of your stories, which would you choose and why?</strong></p>\n\n<p>Wow, this is a great question but it doesn’t bode too well for me, seeing as most of my published stories are set in the real world and belong to the horror genre.</p>\n\n<p>Published stories; The Left/Right Game. Because I think if Alice eventually ascends to some kind of astral godhood, that she’s sensible enough to sort a few things out on our planet. We’ve been living with mosquitos and hiccups for so long, I think we could use a ringer in the cosmic boardroom to stamp that stuff out once and for all.</p>\n\n<p>Unpublished stories; I wrote a short spy novel when I was 10 in which I starred as a genetically engineered super-agent who was unfailingly awesome in every way. I assume it would be fun to live in a world which was built upon my own juvenile narcissism.</p>\n\n<p><strong>What fruit do you empathize with most strongly? What fruit fills you with an unbridled fury?</strong></p>\n\n<p>I would say a Tomato. A tomato is a fruit but people say it displays wisdom to not include it in a fruit salad. The same logic seems to apply to people because I rarely get invited to parties.</p>\n\n<p>I have a lot of anger at Mango. It’s just so delicious, and everyone but me seems able to cut it into large, perfect slices but I always run into the invisible central core and by that point everything gets slippy so it just gets more difficult. Then I start to muse upon how I never sharpen my knives, which is a gateway to all the other things in my life I’m not attending to.</p>\n\n<p>Eventually I’m just left with a mismatched war crime of mango slices and a sense of utter inadequacy.</p>\n\n<p><strong>I really loved <a href=\"https://redd.it/65hucy\">I Want My Wife Back</a>. Was it difficult for you to smoothly infuse horror into such an emotion fraught story?</strong></p>\n\n<p>Thanks so much for reading it. I wouldn’t say it was difficult, but that’s only because the horror comes from the emotional aspects of that story.</p>\n\n<p>Working to make the story believably emotional and human was my main goal, and I think the end result was horrific because of that.</p>\n\n<p><strong>If you could have any one mythological creature as a sidekick, which would you choose and why?</strong></p>\n\n<p><a href=\"https://en.wikipedia.org/wiki/Owl_of_Athena\">The Owl of Athena</a> for the following reasons:</p>\n\n<p>1) My SO thinks owls are cute. I can only imagine she’d love to have one around the flat.</p>\n\n<p>2) Its great wisdom and ability to perceive truth would help me in my daily life and, I assume, could be used to play the stock market</p>\n\n<p>3) My dad is a Sheffield Wednesday supporter so I could name it Ozzy and make him proud</p>\n\n<p>Other than that, I’d go for <a href=\"https://en.wikipedia.org/wiki/Arachne\">Arachne</a>. I think she was treated very unfairly and deserves to be shown a night on the town. In return, I assume she could weave me a high quality throw.</p>\n\n<p><strong>Submitted anonymously: If you were able to spend the day with any figure in the horror community (author, director, actor, etc.), who would you choose and why?</strong> </p>\n\n<p>At the moment, I think it would have to be <a href=\"https://en.wikipedia.org/wiki/Jordan_Peele\">Jordan Peele</a>. I always dreamed that I’d somehow become the spiritual successor to <a href=\"https://en.wikipedia.org/wiki/Rod_Serling\">Rod Serling</a>, but it’s looking pretty likely that Mr Peele is going to take that mantle on, and it’s really well deserved.</p>\n\n<p>In <a href=\"https://en.wikipedia.org/wiki/Get_Out\">Get Out</a> he achieved all the things that I strive for in my work; Originality, simplicity of form, exploration of meaningful themes and characters who act in plausible and intelligent ways.</p>\n\n<p>It would be amazing to get a chance to learn from him.</p>\n\n<hr/>\n\n<p><em>Editor&#39;s note: We exceeded reddit&#39;s text post character limit, but felt it was important to post the entire interview intact to preserve the integrity of <a href=\"/u/NeonTempo\">/u/NeonTempo</a>&#39;s insightful and contemplative answers as they were sent to us. The remainder of the community questions will be posted in a stickied comment.</em> </p>\n</div>\n","author":"NSIMods"}