{"rank":"9","title":"An atypical extermination","id":"8mq80q","url":"/r/nosleep/comments/8mq80q/an_atypical_extermination/","time":"1527515821000","body":"<div class=\"md\"><p>I’ve been in the pest-control game for nearly twenty years now. You name it, I’ve seen it all. Cockroaches? I’ve killed more than anyone could count. Bedbugs? Nasty bastards, but it’s all in a day’s work. Rodents? So routine it verges on mundanity. I’ve seen every state of household as well. Sometimes we say that the cleanliness of a property doesn’t have a bearing on any infestations but that’s actually bullshit. It’s almost always the case that the heavily infested houses are total shitholes. I’ve seen the houses of the worst hoarders, piled high with all sorts of garbage. I’ve seen toilets continually used for months after the water has been shut off. For a time I even helped out in cases of crime scene clean-ups. Some of it would turn your stomach, the amount of maggots and flies that appear after bodies have been lying for a couple of weeks in the summer. </p>\n\n<p>Several months back I got an unusual call. There was a young guy who called me out for what he described as a “special case”. He claimed he didn’t want any phone records of the details. He said he’d asked other exterminators but they were no use. I’m not surprised to be honest though, I know my local competition and they are a right shower of useless cunts. Some of them don’t know permethrin from pyriproxyfen. I was intrigued by this guys call though. The mystery of it, maybe it would finally be something different, and get me out of my boring routine.</p>\n\n<p>I pitched up at his house nice and early the day after he called. I wasn’t sure what I was in for so I had my full armament of sprays, traps and equipment. It turns out he stays in a converted church. These types of properties are becoming more common as people reject religion these days and churches are lying empty. They can be a bit of a bastard as they are always ancient so loads of niches for all sorts of pests. The guy was pretty young looking to have such a fancy place all to himself. Must have had a bit of cash behind him. He told me the problem right away, that his attic conversion was infested with bats. “Bats, mate? I can’t help you. You see, they are legally protected and we can do fuck all to get rid of them.”</p>\n\n<p>“Yeah that’s what the other exterminators told me. But I heard through the grapevine you might be able to do something under the table, you know?” I’m paraphrasing here, he had a funny foreign accent and a weird manner of speaking but this is the gist of it. </p>\n\n<p>“I don’t know about that my man. But let’s get a look, maybe we can put up some sort of exclusion barrier and they will naturally move on.”</p>\n\n<p>He led me in and sure enough there were several bats just flying around his living room, bold as brass. He was saying they were doing his head in and he couldn’t even bring women back to his place because they always got scared off. I knew what he meant but I had to explain that bats are off limits. The fines you get for touching them are obscene, even prison time. I told him it was a fucking joke and obviously the laws were made by environmentalist psychos who didn’t have a fucking clue, but rules are rules and all that. He kept pressing me and eventually I relented. I said maybe I can tell him some pointers about what to get and what to do to maybe get rid of his problem, but he’d have to do it himself and any consequences would be his to face alone. I told him to give me his email and I’d send him some paperwork but I’d dress it all up so there would be no paper trail. I pocketed his business card then head on my way.</p>\n\n<p>I got on with my other jobs, nothing too eventful. Some wind-up merchant calls me saying he’s constantly being followed by thousands of bees buts it’s clearly a daft prank so I tell him to fuck himself. Later I’m drinking in the pub but none of my pals are about so I’m just sat with my own thoughts. I was hit by an uneasy feeling, things just started to fall into place in my mind. We’ve got a rich guy living alone in a creepy church house, the place is full of bats and he’s got a foreign accent. I look at his card and clock his name, it’s fucking Vladimir! And he looked young, aye, but what if he wasn’t really? What if he just looked it, and he was actually 400 years old? It was obvious, the cunt is a vampire! </p>\n\n<p>I got a few more drinks in me and realised what needed to be done. I got back home and picked up a few extra tools. I cut length off an old broom handle and sharpened it with a knife to make a nice stake and then grabbed a hammer and a bottle of some decent whisky to keep my spirits up. I then headed round to the old church house, parked down the street and started to survey the place. I was buzzing with adrenaline and booze. I knew I couldn’t do anything that night, because he was obviously nocturnal so he’d be up and about expecting me. So as the sun just crept up, I had another couple of measures and I sneaked round the back of his house and forced the window. It was perfect, he’d just be getting to his bed now.</p>\n\n<p>I looked around a bit more once inside. There was a study that I never saw before, and on the walls were loads of satanic images and creepy text. One had a laughing demon and said “The number of the beast”, another had a witch outside a creepy building a bit like this very house and it said “Black Sabbath”.  It confirmed this guy was seriously evil. I could hear his snores from the bedroom. He must have just drifted off, it was 5:45 a.m. I sneaked in close with the stake in hand. At least he just had a normal bed and not a mad coffin, plus he was wearing earplugs so he would never have heard me.  I gripped the stake tightly. I was shaking as I raised it high and plunged it into where I thought his heart would be.</p>\n\n<p>What followed was bedlam. The stake did fuck all, it never went in deep enough to do any damage, maybe it hit a rib. He woke up in a panic, which obviously panicked me as well. In a split-second decision I dinghy the stake and just start bashing his head with the hammer. A few good hits and he’s out, but in the commotion all his bat minions got disturbed and started flying about the place. They chase me out the front door, flapping around like mental. </p>\n\n<p>I made it home but by the time I’d slept off the booze and sobered up it was late in the evening. As I got a bit of a fry up down me and some tea a question dawned on me. Why the fuck would a vampire have wanted an exterminator to get rid of his own bat pals? Fuck.</p>\n</div>\n","author":"Legitimate_Shift"}