{"rank":"7","title":"Tell Me Something Good","id":"8mqdyb","url":"/r/nosleep/comments/8mqdyb/tell_me_something_good/","time":"1527517191000","body":"<div class=\"md\"><p>It comes in waves/- soaking me wet, leaving my flimsy blouse clinging to damp skin underneath, filling up my nostrils with rank smelling water that stings at the back of my head and leaves my lungs burning. I sputter, gag, and run my numb fingers through my hair and look up to the sky. Except there isn’t a sky. I crane my neck as far back as I can. There’s nothing up there. And I don’t mean nothing in the sense that it’s a clear day.</p>\n\n<p>No.No.</p>\n\n<p>Imagine if you were put in a lab, its walls painted white, bright piercing light emanating off each wall. The tiles on the floor are white. The scrubs on your hand- white, your nails painted white, your shoes white. You’re dressed in white, your food is white somehow, and you’re served water in a white paper cup. You sit there trying to shut it all out, convincing yourself that it is all just a nightmare. You close your eyes, digging the heels of your hands in your eye sockets until all you see is a pattern in self-induced obscurity. Or you <em>think</em> you’re seeing a pattern. You think you’re seeing colors. For all you know, you could be going crazy. You probably <em>are</em> going crazy.</p>\n\n<p>Look, my point here is that, that is what the sky looks like right now. I keep thinking I’m seeing a pattern here, a pattern there out of my periphery. But when I turn to look, there’s darkness, a pure black shroud engulfing everything I know, everything I care about, everything under the sun, even though there isn’t a sun here.</p>\n\n<p>Despite that, I can take a good look at my body. Is this even my body?</p>\n\n<p>Was I in a fight? There’s dried blood caked on my cuticles and my fingertips reek of blood. I plunge a finger into my mouth and immediately regret it. I taste copper and wince internally.</p>\n\n<p>My lips are chapped and the warm trickle down the middle of my lower lip is probably blood from a fresh cut. So I guess biting my nails or chewing at my lip is out of the question. Fuck compulsion.</p>\n\n<p>Someone’s knocking at the door. <em>What door?</em> I need to go through.</p>\n\n<p>This happens a lot these days. I wake up cold in bed, comforter kicked off the edge. Beads of sweat trickle down my forehead as I sit up and try to make sense of what I think I’m seeing in the darkness in the room in front of me.</p>\n\n<p>I can’t remember anything from before I fell asleep except  weirdly repetitive dream my brain conjures.</p>\n\n<p>There was a fight. My scalp hurts. Has someone been clawing at my hair?</p>\n\n<p>That’s funny.</p>\n\n<p>I think I was talking to <em>him</em>. I must have been.</p>\n\n<p>‘Hey.’</p>\n\n<p>Oh wait, he’s still here.</p>\n\n<p>‘Hey,&#39; I turn to him.</p>\n\n<p>‘You know you don’t have to do this, right?’</p>\n\n<p>‘Do what? I’m not sure I understand.’ He doesn’t get it. He never does.</p>\n\n<p>‘Of course you don’t. I uh- never mind,&#39; I mutter.</p>\n\n<p>Forget this. I shouldn’t have brought it up because now he’ll kill to know what I swallowed off the tip of my tongue.</p>\n\n<p>‘Excuse me?’</p>\n\n<p>‘Nothing,&#39; I say. Fuck me.</p>\n\n<p>‘No, no say it now. Come on,’ he insists. Alright. He asked for it.</p>\n\n<p>‘It’s just that I don’t understand why you’re still intent on keeping in contact with me,’ I hesitantly speak.</p>\n\n<p>‘Still? What do you mean still?’</p>\n\n<p>IS THIS MAN FOR REAL!?</p>\n\n<p>‘Oh you know, since high school and all,&#39; I say, ‘I didn’t think you’d be back.’</p>\n\n<p>‘Ofcourse I am back. Isn’t that a good thing?’ he asks me, confused.</p>\n\n<p>It is. Sure is.</p>\n\n<p>‘You don’t sound very affirmative, there.’</p>\n\n<p>Was I thinking aloud?</p>\n\n<p>‘I’m pretty sure I didn’t say anything out loud.’</p>\n\n<p>He laughs.</p>\n\n<p>OK this is honestly getting on my nerves. I need to be concise here. I need to.</p>\n\n<p>‘Look. I don’t understand this’, I tell him.</p>\n\n<p>‘This?’ He seems grim now. Good for him. Because I have to tell .</p>\n\n<p>I take in a breath rugged with an incoming sob.</p>\n\n<p>‘Yes, this. Any of this. I don’t want to keep doing this.’</p>\n\n<p>‘Doing what?’ he says. I don’t think I’ve seen him look more somber before. This is bugging me. It’s entirely his fault.</p>\n\n<p>Fuck it.</p>\n\n<p>‘Oh my god, are you really that naïve?’ I scream. Right in his face.</p>\n\n<p>‘Maybe’, he offers.</p>\n\n<p>He sounds so laid back, like he was anticipating this for longer than I can think of.</p>\n\n<p>‘Fucking stop it.’ I’m shouting now. But I don’t care.</p>\n\n<p>‘I don’t want to talk to you. I can’t do this, not anymore.&#39;</p>\n\n<p>&#39;My life, not to sound cliché or anything, but my life is a stagnating mess and I hate your bloody guts for articulating to me about how you feel about the places you’ve been, the blogs you’ve authored, the conventions you’ve attended or your cute next-door neighbor. Governing what decisions I make from day to day.&#39;</p>\n\n<p>&#39;Fuck off, you. Fuck outta here. This is not OK.&#39;</p>\n\n<p>You’d think he’d look crestfallen? But instead, I see a smile playing on his lips.</p>\n\n<p>What the fuck?</p>\n\n<p>‘Wow. So jealousy it is’, he says, and the dam breaks.</p>\n\n<p>‘What? Why on earth would <em>I</em> be jealous of <em>you</em>? Actually, you know what? Yes, I am fucking jealous. I’ve always been that way. You’re only just seeing it. Or maybe you’ve known this forever and its something you get off on.’</p>\n\n<p>Should I slow down? No. No, he needs to hear this.</p>\n\n<p>‘My inadequacy and my vain attempts to conceal my envy of your accomplishments, its where you get your kicks. I hate you- I fucking hate your fucking guts.’</p>\n\n<p>‘Twice this week I’ve sat on the floor of my bedroom, downing pill after pill and steadying the faint tremor in my hands. Convincing myself to just pull the fucking trigger and get it over with. Just put a bullet through my head because this is <em>never</em> what I wanted. And I&#39;m tired of living like this- pretending that I haven’t just lost it completely, pretending that everytime I pass a building, I’m not <em>this</em> close to elevate to the roof and fling myself off of it, everytime I lie in the tub I don’t get the urge to turn on my middle and gulp in a breath full of water. But I’m incompetent. This apartment isn’t the only stuffy place.&#39;</p>\n\n<p>&#39;I’m so tired. So tired of feeling unwelcome in my own brain. I can&#39;t do it.’</p>\n\n<p>I’m sobbing now. But don’t let that fool you, because right now, I totally want to gouge his eyes out.</p>\n\n<p>I hear muffled laughter; it doesn’t quite come through.</p>\n\n<p>I say, ‘you’re laughing, I see.’</p>\n\n<p>‘Should’ve anticipated that,’ he scoffs, ‘it really is very funny.’</p>\n\n<p>I can’t see through my tears.</p>\n\n<p>‘Yes. To you, yes,&#39; I whisper.</p>\n\n<p>He’s contained his laughter. That look is back on his face, the one that tells me he’s about to present what he calls a “calculated observation”.</p>\n\n<p>I don&#39;t think I’m ready for that. Not now.</p>\n\n<p>‘No- no. Look at it like this. We spend our whole life fearing the one thing in the infinite expanse that has irrefutable certainty to it.’</p>\n\n<p>Fuck’s sake.</p>\n\n<p>‘I don’t wanna he-‘</p>\n\n<p>‘Fearing it like its something vicious that chases only those with scraped knees and bruised palms, choosing its victims at random, when in reality nothing other than death units us. And by us I mean every creature you can think off- the mottled cow, monstrosities in parts of the ocean never traversed, the wildlife, your own pathetic self.’</p>\n\n<p>I’m seeing red.</p>\n\n<p>‘STOP IT!’ I fling whatever I can grab off the nightstand in the utter dark and fling it at his abominable face.</p>\n\n<p>‘I DON’T WANT TO HEAR THIS. Not another second. Just, leave me alone. Go aw-‘</p>\n\n<p>‘Count in the objects too. Not one thing that doesn’t have a built in ending to it. And yet even the most resilient falter in the moment when struck with realization that in the instant that’ll follow, they will be irreversibly kicked off the safest fucking haven they know into the vast unknown, where they are not sure of even their own being,’ he continues without wavering.</p>\n\n<p>What do I do?</p>\n\n<p>‘This is all a joke to you. Take your philosophical ass off my property. Leave me. Pleas-‘</p>\n\n<p>‘Now that I put it like that, I realize why you fear death. For a chill just ran down my spine as I inadvertently entertained the thought of how alone we really are in the end. For all we know, none of what matters to us, counts in the end.’</p>\n\n<p>Hair just stood at the end of my skin as I considered what he said, and repressed a bout of immense unfiltered abhor directed at him.</p>\n\n<p>‘GO AWAY’, I say.</p>\n\n<p>He looks so sad, like he just experienced mortality firsthand, only to come back as a restless ghost chasing eternity.</p>\n\n<p>‘I can’t’ WHY!</p>\n\n<p>‘Please,’ I beg.</p>\n\n<p>‘Listen t-‘ No.</p>\n\n<p>‘I can’t. Not any longer. Not a second longer,’ I tell him. I tell him because it’s the truth.</p>\n\n<p>‘Let me out then,’ he says.</p>\n\n<p>‘What.’</p>\n\n<p>‘Let me out’</p>\n\n<p>‘I don’t understand’</p>\n\n<p>‘You’re delusional,’ he says, ‘quite literally.’</p>\n\n<p>Enough.</p>\n\n<p>I tear the sheets of the bed and frantically search for the light switch. I scream at him to shut up. But he won’t. I collapse against the foot of my bed, cover my ears, and simulate breathing into a paper bag. There’s a pause. God, I hope he’s gone.</p>\n\n<p>I look up.</p>\n\n<p>‘Do it’, he says, pulling a poker face. Haven’t seen that before.</p>\n\n<p>‘Excuse me?’.</p>\n\n<p>He repeats himself. ‘Do it.’</p>\n\n<p>No. <em>No.</em></p>\n\n<p>‘What are you talking.’</p>\n\n<p>I feel numb. I am numb.</p>\n\n<p>He’s murmuring something. To himself? No.</p>\n\n<p>I am so cold.</p>\n\n<p>‘<em>Let me go.</em> Let me go let me go let me go let me go.’</p>\n\n<p><em>STOP</em>.</p>\n\n<p>‘Let me go let me go let me go let me go let me go let me go let me go le-’</p>\n\n<p>‘I SAID STOP THIS SHIT RIGHT NOW!’</p>\n\n<p>‘Let me go let me go let me go let me go let me go.’</p>\n\n<p>Is he crying?</p>\n\n<p>‘Please, please stop this. This has been going on for too long,’ I say.</p>\n\n<p>Somehow, I know what he’ll say next. I’m not sure I want to hear him.</p>\n\n<p>‘Do it.’ <em>Dead on.</em></p>\n\n<p>‘Do it?’ I feebly repeat his exact words.</p>\n\n<p>‘Yes, do it.’ He’s always been so sure of himself</p>\n\n<p>‘Top shelf, right case, towards the back. Put one through,’ he says with a smile. But I knew that already, didn’t I? He’s mirroring my fucking thoughts now.</p>\n\n<p>I feel weirdly at peace.</p>\n\n<p>I wipe at my tears, fetch the Glock. Its barrel feels cruelly cold against my throbbing temple.</p>\n\n<p>I try to concentrate at the light in his eyes.</p>\n\n<p>The gun looks funny in his hands. He’s clenching it like any moment now someone may barge in and shake it away from his hands and in the process actually blow his brains. But ain’t that just the point?</p>\n\n<p>‘Tell me something good,’ I say.</p>\n\n<p>‘Nonexistence will be better than this,’ he tells me.</p>\n\n<p>‘Oh, you cunt.’ We’re both laughing now but he weirdly looks right at the cusp of tears, as I stifle a sob myself.</p>\n\n<p>What did I ever do to deserve this? Its almost funny.</p>\n\n<p>‘I’ll miss you,’ I lie. But as always, we both know that.</p>\n\n<p>‘No you won’t. And neither will they.’</p>\n\n<p>‘Yes I won’t. They?’</p>\n\n<p>‘Yeah,’ he says. I can see the conversation is tiring him.</p>\n\n<p>&#39;Obligatory last words you know,’ I joke.</p>\n\n<p>‘Oh that’s needless,’ he crisply remarks.</p>\n\n<p>‘Why?’ I know already, its pointless asking. Just to hear it in his own words then, I guess.</p>\n\n<p>‘Because I’m coming with you.’</p>\n\n<p><em>I pull the fucking trigger.</em></p>\n</div>\n","author":"PeelsOnTidderRofEreh"}