{"rank":"2","title":"Is someone playing Disney Magic Kingdoms?","id":"8mqjrb","url":"/r/nosleep/comments/8mqjrb/is_someone_playing_disney_magic_kingdoms/","time":"1527518505000","body":"<div class=\"md\"><p>I started to play several months ago, I was really bored and this was the first game that showed up. If you haven&#39;t played (wich I understad) it&#39;s a tap-game where you are building Disneyland, kind of Zoo Tycoon (the game I was actually looking for). You have  Disney characters and you make them do tasks to complete missions, collect tokens, earn magic and gems... so you can have more characters, to collect new tokens...  Infinite fun! </p>\n\n<p>That&#39;s how bored I was.</p>\n\n<p>By now I&#39;ve got a pretty much everything, not every character nor every concession, but almost. My park is filled with stuff everywhere. If you have no place to put a ride you need you&#39;ll have to remove others (ypu can save them). </p>\n\n<p>The game begins with Mickey, he is alone in &quot;the Kingdom&quot; and he is looking for his friends and stuff. Merlin is also in the Kingdom but you can&#39;t use him yet. \nThe premise of the game is sort of Kingdom Heartish; Maleficent cursed the land and blah blah blah blah you are the hero. You have to uncurse the land. </p>\n\n<p>I remember my first welcoming was Sheriff Woody from Toy Story. He can pull his string to entertain the kids that come to the park (also it gives you a little amount of magic). </p>\n\n<p>By the time it all started to happen I had welcomed pretty much everybody, but I wasn&#39;t able to welcome characters that cost gems (and believe me, that is expensive). </p>\n\n<p>At the beginning of the game Mickey starts looking for Minnie but he ca&#39;t find her. Then this part of the story stops but I can&#39;t remember why, sorry. As you can see I didn&#39;t pay too much attention to what the characters say to you. </p>\n\n<p>Too days ago Hamm (the pig from Toy Story) just disappeared. He just vanished. I couldn&#39;t tap on him anymore in the book of characters (when a character is not available to welcome it&#39;s like &quot;in the shadows&quot;? I don&#39;t really know how to explain that). \nSo Hamm was gone or that&#39;s what I thought cause when I taped on Jessie&#39;s snack Roundup it said he was in there but there wasn&#39;t the name of the task he was doing or the time that was gonna take to do it (remember this games like Hay Day, takes minutes or hours to complet a chore). </p>\n\n<p>My first thought was the app was failing. Half of my screen glitched while playing this or other games. I restarted the game but upon returning again Hamm still appeared at the Roundup but without mission, task or anything. The symbols of how much magic or level stars were going to give me didn&#39;t showed either. I continued with the game thinking at some point it would be fixed with an update or something. \nIn the afternoon I started the game to collect the rewards. I saw Woody had the exclamation mark; When a character wants to say something, a mark is shown while his avatar moves to get your attention. I tapped on him. </p>\n\n<p><em>&quot;Hey, pal! I haven&#39;t seen Hamm for a while, where did he&#39;ll go?&quot;</em></p>\n\n<p>After that the  Woody&#39;s task command opened, but this time he didn&#39;t let me touch other options like &quot;pull the string&quot;. It also did not show the mission time or the rewards. Just: <em>&quot;Look around for Hamm&quot;</em>.</p>\n\n<p>&quot;Surely that&#39;s why he has disappeared and the mission is to find him!&quot;. But I still didn&#39;t understand why neither time nor rewards appeared. I sent Woody to. Right after I saw the exclamation mark on Jessie, but she was not moving. </p>\n\n<p><em>&quot;HAHA!&quot;</em></p>\n\n<p>I sent the other characters on their quests. \nTwo or three hours later I got a game notification: Woody has finished his quest!</p>\n\n<p>So I went back, collected my rewards and checked on Woody. He gave me no rewards btw.</p>\n\n<p><em>&quot;Hmmm... Not a single coin! Piiiiggy, piggy, piggy!&quot;</em></p>\n\n<p><strong>Quest Completed!</strong></p>\n\n<p>&lt; <strong>&quot;WHERE&#39;S THE JAM? PT. 1&quot;</strong> &gt; </p>\n\n<hr/>\n\n<p><strong>&quot;Pig nowhere to be seen!&quot;</strong></p>\n\n<p>Immediately, he wanted my attention again</p>\n\n<p><em>&quot;Pal! I couldn&#39;t find Hamm anywhere! I&#39;ll better look for him at Jessie&#39;s!&quot;</em></p>\n\n<p>Again, no time or rewards showing. <em>&quot;Send Woody to look for Hamm at Jessie&#39;s snack Roundup!&quot;</em></p>\n\n<p>At least I knew he&#39;ll be there. Then again Jessie, as if she was screaming, all written in capital letters.</p>\n\n<p><em>&quot;I LIKE BACON!&quot;</em></p>\n\n<p>This was getting really sinister. I taped on the Roundup but Hamm was no longer there. </p>\n\n<p>As if it wasn&#39;t enough the exclamation was showing on Mickey. </p>\n\n<p><em>&quot;Where&#39;s Minnie?&quot;</em></p>\n\n<p>After asking nothing else showed up. He went running to his own house and that was all. </p>\n\n<p>To top the cake Pete, that dog-guy who always wants to do bad to Mickey &amp; Co. was getting more agressive: he was chasing the kids around and he was going harder on Goofy. And when I mean harder I mean telling Goofy to FUCK OFF. </p>\n\n<p>Jessie decided to go Yodel by herself, I didn&#39;t make her do it. </p>\n\n<p>I went to sleep.</p>\n\n<p>Today I had zero game notifications. When I started the game Hamm was still missing but Woody was trying to catch my attention. He had finished his quest but the game didn&#39;t told me.</p>\n\n<p><em>&quot;I don&#39;t like bacon&quot;.</em></p>\n\n<p><strong>Quest Completed!</strong></p>\n\n<p>&lt; <strong>&quot;WHERE&#39;S THE JAM? PT. 2</strong> &gt;</p>\n\n<hr/>\n\n<p><strong>&quot;I... really... don&#39;t like... bacon...&quot;</strong></p>\n\n<p>I tried to send Woody to entertain the few kids that where in the park. <strong>&quot;Pull the string&quot;</strong>.</p>\n\n<p><em>&quot;I don&#39;t want to&quot;.</em></p>\n\n<p>Instead he pulled out his lasso and went practicing. I checked on Mickey, still inside his house. Goofy was standing between his house and Mickey&#39;s, covering his face with his hands. I couldn&#39;t hear him but I swear he was <em>sobbing</em>. </p>\n\n<p>I tried to make him play the tube. But he didn&#39;t want to. </p>\n</div>\n","author":"RYCBARftw"}