{"rank":"38","title":"Something strange is happening to me at the house I just moved into.","id":"8mqrwi","url":"/r/nosleep/comments/8mqrwi/something_strange_is_happening_to_me_at_the_house/","time":"1527520435000","body":"<div class=\"md\"><p>So I was recently promoted at my job. The downside of the promotion was the mandatory relocation, but for an extra $12,500 a year it’d be worth it. The house I moved into is located in a modest middle class suburban neighborhood about an hour from the closest major city.</p>\n\n<p>For the first few weeks, everything was great in my new home. I had completely moved in and was adjusting to my new position quickly. My new neighbors greeted me and made me feel welcome. Everything was great until the headache started.</p>\n\n<p>After about two weeks of living in my new home, I started getting headaches frequently. Most days the headache wasn’t significant enough to justify taking medication or seeing a doctor. However, the severity of the headaches continued to increase on a daily basis. A short stroll outside would usually relieve me of my headache within minutes. </p>\n\n<p>After days of headaches being a daily nuisance, the nightmares began.</p>\n\n<p>The first night it happened will forever scar my memory with a unnatural darkness I didn’t know existed in the world. </p>\n\n<p>I awoke with a start. A heavy rain pelted the glass of my windows. My throat was dry as if I hadn’t drank anything for days. I blindly made my way out of my room and towards the stairs. Other than the sounds of rain outside, silence was the only thing audible. </p>\n\n<p>As I used my hands to guide me to the stairs I heard a dripping sound from the ground floor. Puzzled, I continued to make my way down the stairs. When I went to step onto the last step my foot recoiled as I felt a thick cold liquid touch my feet. The best word to describe it is slimy. In confusion I made the mistake of turning on the stairway light.</p>\n\n<p>At first, nothing happened and the tar like liquid was still. Then suddenly objects began making ripples in the liquid moving towards the stairs. I started to step back as I noticed dozens or even hundreds of the objects broke the surface of the liquid and then I got a full view of the objects under the liquid.</p>\n\n<p>Heads of many people stared at me with a look of agonized terror fixed on their partially exposed faces. I began to scream as the faces closest to the stairs began to stretch their bodies out of the liquid and began to reach for me. I panicked and sprinted up the stairs, but before I could get off the stairs I tripped and slid down the stairs and down to the horrific abominations who were waiting for me at the bottom. </p>\n\n<p>I woke up with a sprained ankle and sore body when the sun light began shining through the front door. For a blissful moment I had no recollection of the nights horrific events before the memories flooded back to me. </p>\n\n<p>I was definitely scarred and in shock, but I was able to get up and get ready for work that day. My headache had returned when I was getting ready to leave and only moments after I left my house the pain in my head dissipated. I assumed that the nerves from the dream were what caused this particular headache, so I paid little attention and went on with my day. </p>\n\n<p>A few times a week similarly disturbing night terrors would taint my rest. I began to notice a pattern however. The headaches and nightmares only happened when I was in my house. I spent the night with my parents over the holidays and noticed I felt great the entire time. </p>\n\n<p>I called a home inspection company and asked them if they could look for something like mold or a gas leak. </p>\n\n<p>Later that day the inspection company told me that they had found something and I should come back home quickly. I told my boss I needed the rest of the day off and drove home.</p>\n\n<p>When I turned onto my street I saw dozens of emergency vehicles parked near my house. I parked on the curb and made my way up to the firemen who were standing outside waiting for me. </p>\n\n<p>“What is going on?” I asked.</p>\n\n<p>“Didn’t you hear? There was carbon monoxide leak in this guys house. Lucky for him he wasn’t home.” The fireman said clearly not knowing who he was talking to.</p>\n\n<p>“That is my house. Is it safe to go inside now? And why are the police here?” I asked.</p>\n\n<p>“Oh shit man, you’re lucky to be alive. The inspection company called the police after they found a running generator and a trapdoor in your attic.” The fireman told me . </p>\n\n<p>The realization of what that meant didn’t hit me immediately so I stared at the fireman dumbly. </p>\n\n<p>“What? A generator? I don’t understand” I told him.</p>\n\n<p>“Someone secretly put a generator in a hidden room in between the wall. We believe this was intentional and was going to be used to kill you with the fumes.” A police officer who had overheard our conversation said. </p>\n\n<p>I was speechless. Who could have wanted to kill me? How did they sneak a generator into my house? I did notice it though. I had heard a a faint humming noise in the back of my hallway, but I had just assumed it was an air conditioner or something like that. </p>\n\n<p>Then the officer pulled out an envelope and passed it to me.</p>\n\n<p>About 2 dozen pictures of the apparent hidden room were inside. I sorted through them and a feeling of dread overcame my body. </p>\n\n<p>There was some sort of exhaust pipe connected to the generator which had multiple hoses jutting out and spiraling into holes in the wall where I assumed it got spread into the rest of the house. </p>\n\n<p>Then I saw the trapdoor. A small door frame in the far corner of the cramped room was open and showed the inside of my bathroom from the pictures angle. </p>\n\n<p>Dozens of empty gasoline cans and trash of all sorts littered the floor. Someone had frequently snuck into my house, went through the hatch in my bathroom, and used that machine to poison me. </p>\n\n<p>Right now I am in the hospital room waiting for an examination for damages that may have been caused from upwards to a week and a half of exposure to dangerous levels of carbon monoxide. </p>\n\n<p>I still have so many unanswered questions but right now I need to talk to a doctor about my health after the ordeal. </p>\n\n<p>Oh, there he is now. I’m going to stop writing and finish this in a minute.</p>\n\n<p>The doctor came in and asked me a few general questions, and then gave me a couple pills to ease the pain. Hopefully those pills will work soon. </p>\n\n<p>Wait a second, another doctor is asking me questions now. Hold on a second.</p>\n\n<p>Oh shit. I told him about the first doctor and he seemed confused. He asked for his description and I told him what I remembered. All the first doctor wore was a white coat, blue jeans, and had no distinguishable features that I could remember. </p>\n\n<p>Now I’m confused. The second doctor is looking around frantically and confused. He tells me to wait here while he goes to talk to the nurse. </p>\n\n<p>I’m geting so drowsy. I’m going tostop righting this now. I just s tied. I just needto sle pikl m</p>\n\n<p>[- D](reddit.com<a href=\"/r/yumkimilstories\">/r/yumkimilstories</a>)</p>\n</div>\n","author":"Its_YumKimil"}