{"rank":"13","title":"Smiling Customers.","id":"8mqxp6","url":"/r/nosleep/comments/8mqxp6/smiling_customers/","time":"1527521771000","body":"<div class=\"md\"><p>My name is Veronica Laymond.</p>\n\n<p>I work at a convince store; it&#39;s the small quaint type you might pass on an out of town trip. Lights are always on and the cashiers greet you with a smile. Customers always feel at home in warmly lit isles while searching for their favorite cereal brands. </p>\n\n<p>Its been four days without anyone leaving. Oh but dear God they&#39;re still coming.</p>\n\n<p>There&#39;s only two of us left and I&#39;m not sure we can make it through another shift.</p>\n\n<p>I started this job a few months ago when I got my own place and moved out of my Aunt&#39;s big white country home. I hadn&#39;t wanted it to be a full time thing, the plan was to finish acting school and hit it big (Yeah, like millions of other girls with just as much talent. Maybe even more.). My first day at the job I was greeted by my manager. Nina was an older woman, short yet sturdy looking and  always gave off a no nonsense personality. I quickly learned by sharing some slightly funny college experiences and listening to her laugh so loud and genuinely that she wasn&#39;t as uptight as she looked. Still, she knew how to get work done, I always wondered how she ended up in this job considering the amount of leadership she had. But I never asked.</p>\n\n<p>Kathy was my age, her long blonde hair and flashy clothing made me look like a black and white picture. We bonded over watching Youtube videos in the back room during breaks. I don&#39;t think she was the kind of person I would have ever met through other circumstances.</p>\n\n<p>&quot;Slow day huh?&quot; Kathy was standing behind me. I had been playing with a paperclip and waiting for a customer to approach the register for who knows how long.</p>\n\n<p>&quot;Yeah. Do you want to switch? I can go do inventory.&quot; I knew she hated stocking the shelves, judging by the pile of boxed pasta still not on the shelves it wouldn&#39;t get done by anyone else either. </p>\n\n<p>&quot;I was thinking about leaving that till later. We could grab some sodas outside.&quot; She glanced at the empty store and unclipped her name tag.</p>\n\n<p>&quot;Y&#39;know that vending machine is never filled.&quot; I rolled my eyes and walked towards the sliding doors anyway.</p>\n\n<p>&quot;And who&#39;s fault is that?&quot; I had to keep myself from saying &quot;probably yours.&quot;</p>\n\n<p>&quot;I just want to check it out. Nothing better to do.&quot; She stared at the vending machine with only three bags of chex mix and sighed. Jason sat on the curb of the pavement and smoked a cigarette. Sometimes I forgot he worked here, he was always pretending to clean the restroom or just giving up and going home early. The dark circles under his eyes suggested he didn&#39;t exactly go home either, we never complained about him because he didn&#39;t really bother us.</p>\n\n<p>&quot;Morning.&quot; Jason mumbled and puffed out a large cloud of smoke; he never cared to fix his bad habit.</p>\n\n<p>&quot;Shouldn&#39;t you do that somewhere else?&quot; Hands on her hips, Kathy waved smoke away from her face.</p>\n\n<p>&quot;Nina ain&#39;t here. There&#39;s no point in going a mile away to have a cig anymore.&quot; When he mentioned Nina he instinctively straightened the collar of his uniform.</p>\n\n<p>&quot;You&#39;ve got to be kidding. She never missed a day of work since I&#39;ve been here.&quot; </p>\n\n<p>&quot;You&#39;re exaggerating.&quot; I told her but I honestly couldn&#39;t remember a day when Nina ever had.</p>\n\n<p>I happened to look up in the window of the store and see a guy standing at my register. Without saying anything to the other two, I went back inside. As I got closer I could see he had extremely greasy black hair and pale- almost greenish looking skin. This wasn&#39;t unusual for the slew of weirdos who would enter the store. But they all came at night.</p>\n\n<p>&quot;Sorry for the wait sir.&quot;</p>\n\n<p>I subconsciously wondered why he didn&#39;t just come over and got one of us. Surely he had seen us outside, but then again I hadn&#39;t even seen him come in. Instead of starting a conversation he just smiled widely at me the whole time I checked his items, with teeth as unclean as his hair. Something about this man repulsed me and as I fumbled to put his groceries in the bag I wished he would just go away.</p>\n\n<p>An alarm went off. Somewhere in the back room, it was used whenever someone tried to open the back exit without a key or passcode.</p>\n\n<p>&quot;Saved by the bell.&quot; I whispered and rushed to the back of the store.</p>\n\n<p>&quot;God damn lock. Security system never works until I have to-&quot; Jason was standing in front of the door and slamming the passcode lock.</p>\n\n<p>&quot;I triggered it when I came back in. Must have left my key somewhere, I didn&#39;t think it would actually work&quot; The alarms droning howl finally cut off.</p>\n\n<p>&quot;Ask Kathy for her key next time you idiot.&quot;</p>\n\n<p>Things like this rarely happened but when they did it was always Jason behind the wheel.</p>\n\n<p>&quot;She doesn&#39;t have her&#39;s either.&quot;</p>\n\n<p>I shoved my hand into my front pocket. But the familiar feeling of the key ring wasn&#39;t there. &quot;Just- what? Mines not here either..&quot;</p>\n\n<p>&quot;Great! Fantastic! It doesn&#39;t matter I&#39;m closing this hell hole for lunch anyway.&quot;</p>\n\n<p>Kathy and I ate lunch in the break room like usual. Jason didn&#39;t come back from locking up and we both assumed he had gone home or back to smoking.</p>\n\n<p>&quot;So tell me more about this guy.&quot; Kathy leaned back in her seat and raised her eyebrows. I had mentioned the man who came in because it was just too weird not too.</p>\n\n<p>&quot;I told you everything that happened.&quot;</p>\n\n<p>&quot;Yeah but, are you sure he wasn&#39;t the least bit attractive? Even in a lone trucker kind of way?&quot;</p>\n\n<p>&quot;Come on Kathy, I know you have a fantasy for meeting some hot rich guy at your job but trust me on this. He wasn&#39;t anybodies type.&quot; I cringed and finished up my sandwich.</p>\n\n<p>&quot;Pretty weird not having Nina here.&quot;</p>\n\n<p>It was weird how little I actually though about it. I should have known something would go wrong without her here. I should have known not to brush it off.</p>\n\n<p>&quot;Family emergency probably. Or maybe she&#39;s on a vacation and forgot to tell us?&quot; </p>\n\n<p>&quot;Unlikely, she would leave those little post it notes on the break room door.&quot;</p>\n\n<p>Nina always left instructions or motivational sayings taped up to work stations or around the building. Some where still hanging up, reminding us how little we had worked today.</p>\n\n<p>&quot;Remember to order more plastic bags! I believe in you!&quot; I tried my best impression of Nina until Kathy was snorting with laughter. We were cut off by a loud crash coming from somewhere outside.</p>\n\n<p>&quot;Shit. Why can&#39;t Jason avoid breaking something for at least an hour!&quot; </p>\n\n<p>Kathy was the first to get up. We found it right away, on aisle four. Dozens of bottles were spilled on the floor, different kind of sauces and juice slid together to form a pile of stickiness and broken glass.</p>\n\n<p>&quot;Jesus...How Did he even manage this?&quot;</p>\n\n<p>&quot;Kathy look.&quot; I pointed at a smashed bottle of soy sauce and then at a bottle of cheap beer.</p>\n\n<p>&quot;Yeah what? Its a mess I know, and we&#39;&#39;l probably have to-&quot;</p>\n\n<p>&quot;They&#39;re both from opposite sides of the store.&quot;</p>\n\n<p>Kathy paused and groaned. &quot;So he did all this on purpose. I am definitely getting this guy fired tomorrow.&quot;</p>\n\n<p>&quot;Hold on it doesn&#39;t mean he did it.&quot;</p>\n\n<p>&quot;Are you serious? Who else could have done it? Me? No, look Veronica I&#39;m just going to call Nina and say were all going home because Jason trashed the place.&quot;</p>\n\n<p>Instead of following her I kept staring at the mess on the floor. I couldn&#39;t believe we had been unsupervised for a day and this had happened. I was about to go get a mop when I saw movement out of the corner of my eye. Jason was standing in the corner holding one of the shopping baskets.</p>\n\n<p>&quot;Okay what the hell man!?&quot; I started running at him. &quot;I don&#39;t care how much you hate your job this is ridiculous.&quot; I stopped. He was staring straight at me. Smiling, that same terrible smile of the man I had helped earlier. But it was worse so much worse. I could see clearly now why it made me so uneasy. It was too wide for his mouth, something in his face must have been in a lot of pain or completely broken. I stumbled backwards and ran to the back of the store where Kathy had gone.</p>\n\n<p>&quot;Kathy we.. We need to get out of here. Jason is, its..&quot; She was staring at the phone in her hand with a worried look on her face.</p>\n\n<p>&quot;Oh so he showed up huh? I told you. I don&#39;t even care because I can&#39;t get service now.&quot; She must have seen the terrified look on my face. &quot;Hey? Are you okay?&quot;</p>\n\n<p>&quot;No something happening. Remember what I told you about that guy. I think its here and we have to leave, our keys- It doesn&#39;t matter we can break a window if we have to.&quot;</p>\n\n<p>&quot;Slow down! I&#39;m trying to listen.&quot; Her ear was pressed firmly to her phone. &quot;Shut up for a second I think I hear it.&quot;</p>\n\n<p>&quot;Hear what?&quot;</p>\n\n<p>I didn&#39;t even wait for a reply, we both strained to hear over the melodic music that always poured out of the speakers. Sure enough we both heard the sound of a phone ringing. It was Nina&#39;s ringtone.</p>\n\n<p>&quot;She here..?&quot; Kathy looked at me and slowly put her phone down.</p>\n\n<p>&quot;No. None of them are here. But something more worse is.&quot;</p>\n\n<p>I filled her in on what I knew. We both figured out that we wouldn&#39;t be able to open any doors or exits. Eventually we don&#39;t even try to leave the break room. Nina is definitely with them, Kathy is sure she saw her once. We never go out for too long because we are too scared of seeing them. Its been four days and so far all we&#39;ve learned is they are getting better at doing things. I saw one of them run once, and we both know they can open doors whenever they want. Its only a matter of time now, I don&#39;t want to end up like them. I don&#39;t know what they are but I know whatever they do to you, you never recover from.</p>\n</div>\n","author":"oxygennotrequired"}