{"rank":"30","title":"Soon.","id":"8mr1sk","url":"/r/nosleep/comments/8mr1sk/soon/","time":"1527522720000","body":"<div class=\"md\"><p>&quot;You don&#39;t look like you belong here, sir.&quot;</p>\n\n<p>This is what I said to the old man sitting on the sidewalk, by a placard saying &quot;We are all going to die SOON&quot; along with others in this stretch the town calls Doomsday Corner. </p>\n\n<p>This man was different. Among the men who carried bibles and crosses, wearing religious paraphernalia, screaming through megaphones, this man was quietly smoking a cigarette in a run down lab coat.</p>\n\n<p>&quot; I do belong here kid. I&#39;m here because I am crazy, like the rest of them. At least, I desperately wanna be. Even though we derived it differently , we do have the same conclusion. We are all going to die SOON.&quot; He said calmly.</p>\n\n<p>&quot;Why do you think so, sir?&quot; I asked as i dropped a pack of cigarettes in the make-shift donation bin he had beside his placard. The people who sent me to him were very specific: cigarettes only. &quot; I&#39;m not that bright of a bulb, so can you explain it like i&#39;m 5?&quot;</p>\n\n<p>Before he even finished the one perched on his lips, he grabbed another one from the new pack and lit it.</p>\n\n<p>&quot;Through the years, Man has been figuring it out bit by bit.</p>\n\n<p>Through Zoology, we&#39;ve figured out that different living creatures develop different ways to communicate.</p>\n\n<p>Through Anatomy, we&#39;ve figured out that different living creatures develop defense mechanisms for themselves when they sense danger.</p>\n\n<p>Through Neurology, we&#39;ve figured out that living creatures have signals in between their neurons , and those signals induce action. They are our thoughts and memories.</p>\n\n<p>Through technology, we&#39;ve figured out that different signals can be used in countless ways, and can be sent to distances beyond our imagination.</p>\n\n<p>Through Philosophy, we&#39;ve figured out that the difference between us and other living creatures, is that we are aware of ourself, and how time passes us by.</p>\n\n<p>Through Physics, we&#39;ve figured out that time is relative to distance or size. A second to you may be an eternity for the ant.&quot;</p>\n\n<p>I was intently listening to this man, looking for the crazy in his logic. But the more i listened, the more dumbfounded as it all sounded so... rational.</p>\n\n<p>That is, until i glanced back at his conclusion written clearly on his placard.</p>\n\n<p>&quot;I therefore conclude, from all the things that Man figured out, that the Earth is alive and sentient. And we humans have given it a fever. It took a while,  thousands of years from our perspective, but it has now sensed that it cannot fix us on its own. Judging from the two amply sized asteroids hurdling towards it, It has somehow asked for help somewhere. Asteroids big enough to cause mass extinction, but not big enough to throw the Earth out of orbit. The world is not ending, the Earth is alive and well. But we are all going to die SOON.&quot;</p>\n\n<p>Before he even finished the one perched on his lips, he grabbed another one from the new pack and lit it.</p>\n</div>\n","author":"TaponAccount111"}