{"rank":"0","title":"No One Knows","id":"8mr2os","url":"/r/nosleep/comments/8mr2os/no_one_knows/","time":"1527522925000","body":"<div class=\"md\"><p>Living with anxiety and depression is...difficult.</p>\n\n<p>Not in the sense of dealing with i, but that I don&#39;t deal with it.</p>\n\n<p>I act as normal as I can in front of my family. Like I&#39;m some well adjusted person who doesn&#39;t let the worries of the world bother my flow... well all I can say to them is &#39;fuck you&#39;...but of course I won&#39;t say it. I&#39;m the kind little brother after all. And they&#39;re family.</p>\n\n<p>In my house, I need to be the adult, even if I&#39;m the youngest of four siblings. I HAVE to be the adult!</p>\n\n<p>It&#39;s not a matter of &quot;they are all useless bums&quot; it&#39;s more of &quot;I have to be their support&quot;. The thing about my family that makes it &quot;unique&quot; is, without me, it&#39;s just one bad day away from my siblibgs killing each other like some wild animal. </p>\n\n<p>I&#39;m treated as kindly as a little brother can be treated, even if I&#39;m already 23 years old...or 24? I don&#39;t know. I stopped counting my age when I dropped out from college because of my chosen reason of &quot;our family is financially troubled&quot; and not because I was secretly hiding the fact that my depression made me unable to catch up with my studies. It&#39;s better that way rather than letting them know that I&#39;m in need of expensive antidepressants. I already need to take heart pills, I don&#39;t want another batch of money draining pills being the reason why we&#39;re hardly getting by.</p>\n\n<p>Whenever I have one of my episodes, I just lock myself in my room, so that they can&#39;t see the pathetic image of me curling my legs, trying to not let a single sound come out of me because my mentally is torturing like I&#39;m some sort animal. I can&#39;t even cut myself because they&#39;ll know so I just substitute it by beating myself in places where they won&#39;t seei the bruises.</p>\n\n<p>It helps that I&#39;m a quiet guy, they will think that all I do in my room reading on my phone like I usually do.</p>\n\n<p>Everyone in my house has their own problems, why should I add myself on that list?</p>\n\n<p>...Nobody knows about the many times that I just stayed awake watching youtube videos in order to avoid being left with my thoughts. </p>\n\n<p>How every time I hold on to a kitchen knife, the image of stabbing myself or cutting myself passes by. </p>\n\n<p>How some nights I&#39;m forced to vomit nothing because the stress literally makes my stomach ache. </p>\n\n<p>Nobody knows because I&#39;m VERY good at keeping it hidden.</p>\n\n<p>All I want is.</p>\n\n<p>I...I just want have quiet.</p>\n\n<p>The kind of quiet when my own brain isn&#39;t screaming at me for being a failure. </p>\n\n<p>The kind of quiet that makes looking in the mirror easy. </p>\n\n<p>The kind of quiet where I don&#39;t see that kid just staring at me from the crack of my closet.</p>\n\n<p>I talk to my friends about jokingly having depression, we laugh it off like we always do. They&#39;re good friends....They&#39;re good friends.</p>\n\n<p>No one knows that I have depression or anxiety. I don&#39;t take pills. I don&#39;t go to a therapist. I don&#39;t use an outlet to release that stress. NO. ONE. KNOWS. I. HAVE. IT.</p>\n\n<p>And I plan to keep it that way.</p>\n\n<p>But they will know. They. Will. Know.</p>\n\n<p>I already brought a rope in my room, all that&#39;s left is to learn how to tie a noose.</p>\n\n<p>Hopefully, that kid won&#39;t stop me like last time.</p>\n</div>\n","author":"Layzay_Mask"}