{"rank":"21","title":"My Mum's Stalker","id":"8mr3g4","url":"/r/nosleep/comments/8mr3g4/my_mums_stalker/","time":"1527523089000","body":"<div class=\"md\"><p>This is my first Reddit post, and due to all the strange happenings in my life, there won’t be a last. They just seem attracted to me, my family, and generally anyone involved with me. One of my earliest encounters with these peculiar happenings just had to be one of my scariest. Well, my Mums scariest. She has been through a lot, and I really think I don’t even know half of it. I was only informed about my own experience and my mothers at the age of fourteen, eight years after the original story by the victim herself. My Mum has given consent to me sharing this story and endorses that if you do have a stalker, immediately notify authorities for your own safety. We had to move house after this, for the well-being of my family. Privacy is of full importance and never let anyone violate it without your approval. </p>\n\n<p>It all began on a Saturday evening, 6:00 PM, in the childhood home that I would soon be saying goodbye to. My Dad was at work, to come home and 7:30 PM to be surprised with a birthday party. My Mum was collecting the catering since we were going to have friends and family over too. Mum, my elder brother and I had spent the hour before my Mum left decorating our home. We would be inviting almost why the whole family, whom I hadn’t seen in many months and I had also a promise I could go to bed late. I was terrible hyper, due to all of the excitement for my Dad to come home and be able to surprise him.</p>\n\n<p>My brother, in his early teens, was the only other person in the house apart from our big golden retriever, Will. Our Mum would only be gone for an hour, so he took the initiative to help me get ready as Will napped on my bed. Being a huge girly-girl back then, I wanted a dress. As he was helping me pull on my dress, I saw his Nokia flip-phone vibrating on my dresser. Just our Mum reminding us to not open the door to any strangers. I was all ready, and I and my brother went downstairs followed by Will to watch some TV and play some games together before my Mum came back and guests arrived. </p>\n\n<p>I don’t know how long had past when my brother, Will and I were playing, but he eventually went into the kitchen to cut up some apples as I cuddled with the dog. Will started twitching and eventually began barking at the door. I gave him a gesture to shush as I followed my brother into the kitchen just watched him cutting up the apples when we heard a knock on the door, causing Will to start freaking out. He was growling now. My brother&#39;s eyes snapped up, fearful. I remember asking whether it was Dad coming home early, yet he declined my theory stating we should just ignore it. We went back to playing princesses and eating apple slices from our plastic bowls, ignoring Will&#39;s barks and growls in the background. My brother told me that, when we proceeded to play he was making a lot of noise to block out the sound of someone knocking on the door, for example making more funny and loud noises and such so I wouldn&#39;t get curious (At the time, I had an ear infection so my hearing was rather flawed). However, I remember noticing that my brother was rather distant as his mood started to die down, tapping the buttons on his phone and suddenly stopping from making all the funny animal noises. I felt neglected and began to entertain myself and Will, yet still showing that he was welcome to carry on the barbie dinner party. He suddenly stood up abandoning his Nokia, scrambling towards the living-room window and tugging the curtains shut.</p>\n\n<p>This didn’t bother me however as he began playing with me again. His phone had stopped vibrating. He dismissed himself to bring our empty bowls to the kitchen. What happened next didn’t concern me. My brother gave a twitch and suddenly dropped our plastic bowls. I vividly remember pointing at him and laughing, saying “Silly, (blank)!”</p>\n\n<p>He dragged the kitchen curtains shut as Will pounced towards the window only to be pulled back, and no more than one minute later I heard sharp taps on the window behind the now-closed curtains. The window rattled and my laughter abruptly stopped, as my frantic brother began whipping all the curtains shut. He told me to come with him upstairs, the whole way Will was in front of us and jumped and sudden movements, yet the only thing we did was go around locking windows and closing curtains. Finishing his orders, I asked to go downstairs to play again and he \nobliged. Well, he just sat me in front of the TV as he answered a call.</p>\n\n<p>Will wouldn&#39;t calm down and I could sense something was wrong. My attention was taken away from the TV as I comprehended the fact that my brother was frantically conversing with my Mum, the knocking now coming from the front door again. I only remember my brother saying: “Should I explain this to Elliot (Me)? If I put her to bed she&#39;ll get upset... Why didn’t you tell me earlier? Mum, just get here quickly, please. I love you.”</p>\n\n<p>I asked “Explain what?” only to be brushed off.\nMy brother didn’t let his eyes away from me, as he tried to keep his cool to ensure me I was in complete safety. My Mum came home earlier than I expected to my happiness, however, minutes after her arrival a police car was in our driveway. My brother brought me up to my room, giving me a card and telling me to sign it with a little message to Dad then rushing downstairs to the grumbling of the policemen chatting with my Mum. Awhile later, my Mum came upstairs followed by my brother complementing my little doodles on the card and my choice of dress. I asked about the policemen, and she merely replied that the two were patrolling going around the neighborhood looking for a lost cat. My brother and I went back to preparing some of the snacks and he set up the catered food that my Mum brought home. We had my Dad’s party and I had a great time, completely oblivious to the false smiles of my Mum and brother including the uneasiness of Will. </p>\n\n<p>To clear everything up, the texts had been coming from my Mum, who was warning my brother to not answer the door and ignore any knocks. My brother had been told to close the front curtains too. Why? It was only 6:00 PM, during the summer after all. \nTurns out my Mum had been receiving texts from a co-worker, who had been stalking her for two months already. The co-worker had been complimenting how beautiful I was, and how adorable I looked in my dress. He said the violet brought out my pale and smooth skin. The knock came from the very co-worker, as he had been staring in through the windows at me and my brother. The first warning sign was when my brother was in the kitchen, and he saw the man staring through the window at him, his eyes like lanterns in the summer evening. There were two policemen that had arrived, yet they did a search and found nothing. I figure the barks of Will must&#39;ve scared him away. </p>\n\n<p>Mum never told me who knocked on our door until I was fourteen. I cried when she told me. He was texting my Mum as he was spying on us in the house, and he said that we were really clever to not open the door. My Mum couldn&#39;t block him because he was somewhat a source of information, so she could warn my brother whether he was trying to break in. The co-worker strangely disappeared two nights after the encounter, never to be seen again. He just quit his job, packed up and left. The texts have been deleted now, and we are now living all the way across the country. We moved two months after the incident, and my Mum hasn&#39;t kept any secrets since.\nWe just hope that he doesn&#39;t come back, he is still out there for all we know.</p>\n</div>\n","author":"elliotshalf"}