{"rank":"14","title":"My girlfriend is insane.","id":"8mrc92","url":"/r/nosleep/comments/8mrc92/my_girlfriend_is_insane/","time":"1527525030000","body":"<div class=\"md\"><p>I’ve been going out with my girlfriend for a couple months now. We’ve had a few... strange situations. Moments where she completely freaks out. Becomes something that’s her. Like a demon. The first time a “moment” happened was the second month of dating. We were lying in my bed, watching tv. Her head on my chest and the lights dimmed low. I forgot to turn my phone on vibrate and the text message I got loudly presented itself. My girlfriend, Lana, freaked out. He peaked her head up, grabbed my phone, and threw it at the tv. Luckily I had an otter box case, so there was no damage done to my phone, but the tv had a hole right in the middle of it. I asked her if she was okay, but she ignored me.</p>\n\n<p>The next “moment” was literally the day after. I was in the kitchen heating some cold pizza, when I heard creaking coming from the hallway. I assumed it was her, but my dog started barking. I looked at the hallway. The light was turned off, even though I had left it on. I again, shrugged it off because maybe my dog got startled. As I waited for the pizza to be ready, I was on my phone. I got a text, but this time my phone was on vibrate. Then, I hear a knife scrape against the hallway next to me, and all of a sudden, my girlfriend, standing in front of me grabbed and threw my phone at the microwave. </p>\n\n<p>No more “moments” until a few weeks ago. I was texting someone and I laughed.</p>\n\n<p>“What are you laughing at?” Lana asked dryly.</p>\n\n<p>“Heh. Nothing.”</p>\n\n<p>“So... You’re laughing at... Nothing?”</p>\n\n<p>“Heh. Heh” I didn’t respond until about a minute later “What? Eh? Oh. Well. Obviously I’m laughing at something.”</p>\n\n<p>Without warning, she got up and walked to the kitchen. I heard one of the drawers open but I wasn’t exactly sure which one. Worrying, I stepped into the hallway. It was long and dark, with rooms branching out, it made it seem like a creepy asylum. I heard a creak come from behind me, and my dog, Woochie, started barking. I instantly turned my back around and jumped from what seemed to me, a tall dark shadow standing. My rubbed my eyes and “it” was gone. I shrugged it off as a moment of insanity and walked to the kitchen. I heard a distinct dripping noise...</p>\n\n<p>Drip... Drip... Drip..</p>\n\n<p>“Lana? You okay?”</p>\n\n<p>“YOU DID THIS TO ME!” She began screaming. Woochie barking. Complete madness. I looked into the kitchen and I saw something that I can never unsee. Lana had a knife in her hand. There was blood trickling down from it. Woochie, the small dog he is, was barking at Lana, as she was cutting herself. </p>\n\n<p>“OH MY GOD! LANA, WHAT THE FUCK?!”</p>\n\n<p>I got a text. It was a lady friend. </p>\n\n<p>“R U up?” </p>\n\n<p>I’m sure she saw a glimpse of the message, because she began twitching. There was no blood coming from her wrist anymore. There was no blood on the knife either. No blood on the floor. It was gone. No stain. I felt breathing on the back of my neck. I blinked out of fear and Lana was gone. There was blood on the floor again. I didn’t move. No. I couldn’t move. I was shocked. Completely paralyzed. I lifted my phone and opened my camera. I put the camera to look behind me. No one was there. I sighed out of relief. “Phew...” My lady friend called me. Ring. Ring. Ring. Ring. Ring. I didn’t pick up out of fear. She called again. And again. Then it stopped. When I came to my senses, I called her. No answer. Called her again, no answer. I and ran to her house, worried that Lana would get to her. I began crossing the street when I was blinded. Very bright headlights came into sight. I couldn’t see anything then. I heard what sounded like honks coming from a trunk. </p>\n\n<p>BOOM</p>\n\n<p>I was hit by a truck. I woke up in a room. My arms and legs tied to a chair. Lana was standing in front of me. There was no harm done to me, but my lady friend, was impaled by a long arm, that was stuck out of Lana. I saw the shadow next to her, then it became her. Immersed with her. They became one. The darkness had taken her. The arm went deeper inside her already dead corpse. She walked away, but turned into some spider monster. I broke my arm restraints, but my legs are still tied. I’m typing this on my phone now.  This may be my last post, so please, spread the word around. Lana is a 19 year old. She wears vans and always has her pink sweater tied around her waist. If you know anyone that fits this description, contact authorities immediately. If I don’t make it, just tell my family I love them. And take care of my dog. Oh god. She’s coming. I have to go now.</p>\n</div>\n","author":"RedPandaGamerYT"}