{"rank":"25","title":"Trust Me, It WILL Destroy the World - Part 2","id":"8mrpxl","url":"/r/nosleep/comments/8mrpxl/trust_me_it_will_destroy_the_world_part_2/","time":"1527528011000","body":"<div class=\"md\"><p><a href=\"https://www.reddit.com/r/nosleep/comments/8mi2f2/trust_me_it_will_destroy_the_world/\">part 1</a></p>\n\n<p>I’m writing this in a (sleazy) motel and I’m not able to sleep due to all the cockroaches in this room. The paint on these walls is peeling off, I was greeted with a “classy” grunt at the counter, and the people that are staying here don’t look much better. </p>\n\n<p>But hey, beggars can’t be choosers, I guess. </p>\n\n<p>Before I launch into the rest of my tale, I just want to say thanks for all the support that you guys have given me so far! Trust me, it means so much when anyone else you try to tell this story would think you’re crazy!</p>\n\n<hr/>\n\n<p>The first thing I did after I posted this story in that bush was to run as fast as I could to my friend’s house.</p>\n\n<p>But I supposed I wasn’t fast enough.</p>\n\n<p>My friend, let’s call him John, being the hospitable person that he was, offered me a glass of water as we sat down. I was about to take a sip when he gulped it all down.</p>\n\n<p>And then his eyes started to close, getting smaller and smaller until they were just two black slits. His blonde hair elongated, falling to his shoulders, now white.</p>\n\n<p>His skin cracked, and what was beneath -- a pulsating black mass -- emerged. He opened his mouth to snarl at me, his teeth now large, pointy razors.</p>\n\n<p>He extended one of his elongated arms and sent it hurtling towards me to try to grab me. I dodged, and then quickly pulled out my .500 S&amp;W Magnum, which I keep near me at all times for situations like this, and blasted that thing in the face five times.</p>\n\n<p>It wasn’t even fazed.</p>\n\n<p>The bullets bounced off that thing like a kid off a trampoline.</p>\n\n<p>So I did the only thing left to do: RUN!</p>\n\n<p>I ran into John’s Master bedroom and barricaded myself in by pushing the bed up against the wall, jumped out the window, and shimmied down one of the pillars on John’s porch, ‘till I got to my car and drove away.</p>\n\n<p>The “angel” didn’t seem too bright, because by the time I’d pulled away, it didn’t seem to be chasing me.</p>\n\n<p>Now this encounter surprised me for two distinct reasons:</p>\n\n<ol>\n<li><p>Several bullets to the face from the strongest pistol in the world didn’t even faze these things, yet they were able to rip each other apart so easily!</p></li>\n<li><p>It seemed as though Lee had infected the water supply even though the “transformation” day was supposedly tomorrow.</p></li>\n</ol>\n\n<p>I think I now have the answer to these questions. After thinking a lot about it, it seems as though these “angels” have two weaknesses: Their own teeth, and Lee himself.</p>\n\n<p>The first weakness is quite obvious.</p>\n\n<p>It seems to me that Lee is able to Throttle how long each of these “angels” remain “angels” for as long as Lee wants them to be, so if I manage to damage his supply of “angel”(the drug), I can completely ruin his hopes of wide scale transformation!</p>\n\n<p>So I decided that that was the better choice, and that’s what I was going to do first.</p>\n\n<p>But before I did, I’d had to assemble a team.</p>\n\n<p>Now I won’t go into the nuanced of my team, or how I got them, but let’s just say that the Dark Web has a LOT of forums.</p>\n\n<p>Anyways, with my team’s help, I managed to infiltrate the Victorian mansion quite easily.</p>\n\n<p>The usually pristine white walls were now drenched in a viscus black sludge, and there wasn’t any sign that this place had ever been inhabited by humans in the first place at all.</p>\n\n<p>As I reached the door that held the supply of “angel” drugs, I realized that I was going to have to bust the door down in order to reach the supply of drugs I needed to destroy.</p>\n\n<p>Just as I pulled back in order to slam into the door, I felt a weight on top of me.</p>\n\n<p>So much for a team to help me. You really can’t ever trust anyone off the dark web, can you?</p>\n\n<p>Anyways, the only thing I could think to do was to punch the thing in the face repeatedly, which, surprisingly, worked well enough.</p>\n\n<p>The creature spit out one of its teeth, which was covered in its green blood. Luckily, I quickly snatched it up and was able to stab the creature through the heart.</p>\n\n<p>As it was dying, I saw its long, white hair slowly receding and turning back into John’s dirty blond hair, its slits slowly opening into his blue eyes, so I descended the stairs before I could see more.</p>\n\n<p>The room I was met with below was nothing like the mess above, with pristine white walls, a futuristic looking table, and a glass of water with ice still floating in it.</p>\n\n<p>By the time I realized that there was no way ice could still be in the water if Lee had abandoned the house, a 500 pound mechanized “angel” had pounced on top of me.</p>\n\n<p>Unfortunately, I had dropped my “dagger” (“angel” tooth) while the beast had tackled me. However, instead of eating me, it projected an image up on the ceiling. It was Lee.</p>\n\n<p>“How nice of you to drop by!”</p>\n\n<p>“I don’t care for the façade, you monster! Why are you doing this?” I practically snarled at the ceiling.</p>\n\n<p>“Haha! Cutting right to the chase, now are we?” he replied, almost amused, “ well, you know, I’ve been tracking you bodyguards for years, now. You see, I’d implanted chips into your necks as soon as you started working for me. I’ve been tracking your bodies all this time. And every single one of my bodyguards had been compatible with angel. All except for you. You see, “angel” is able to warp not just the minds of its users like a regular drug, but also their bodies. I don’t know how or why, but you were immune. That’s why I kept you around for so long.”</p>\n\n<p>“But why are you doing this? Is it some sort of pathetic god complex?”</p>\n\n<p>“Wait… what do you think I’m doing, you fool?”</p>\n\n<p>“Well, you clearly said on the tape that you were wiping out 80% of humanity to have only the strongest remain… ”</p>\n\n<p>At that, Lee doubled over, laughing uncontrollably.</p>\n\n<p>When he finally regained composure, he said “No you fool, I’m going to -- ”</p>\n\n<p>That’s when the transmission cut out. I heard a voice in my ear</p>\n\n<p>“Yo, we lost track of you there! Some sort of chip in your neck emitting another frequency that was interfering with ours. Don’t worry, we’ve deactivated it, and we’ve deactivated that “dog” on top of you for a short time. Now, quick, get out of there.”</p>\n\n<p>Huh. I guess I COULD trust those guys.\nAnd that brings me to where I am now. My “team” is still analyzing the “angel’s” tooth, which I managed to pick up on my way out, as well as my blood sample. </p>\n\n<p>Honestly, for the sake of you guys, and my own, I’m praying that they come up with SOMETHING, ANYTHING that can save humanity.</p>\n</div>\n","author":"LitLegend27"}