{"rank":"0","title":"I am in love with my stalker..","id":"8ms5db","url":"/r/nosleep/comments/8ms5db/i_am_in_love_with_my_stalker/","time":"1527531438000","body":"<div class=\"md\"><p>So a little back story,</p>\n\n<p>I am a 24 year old women, who has had a stalker for about 7 years. Normally a normal human being would probably high tail it, call the cops, and say goodbye Mr.CreepyGuy. Well, that isn&#39;t the case with me, no I am not saying I am not human, but I have another problem.</p>\n\n<p>See, as a women we all have our needs and most of us have low self confident. However my stalker has always made me feel like a worthy women (Crazy, right?) I mean if a man is stalking you then obviously he is madly in love with you for one reason or another.</p>\n\n<p>When I first met my stalker it was when I was still in high school ( A junior to be exact ) , and I wasn&#39;t the social of most butterflies. Honestly, my boyfriend at the time &quot;Aden&quot; had recently broken my heart for another girl &quot;Liz&quot; which had significantly impacted my way of thinking. Since &quot;Liz&quot; wasn&#39;t the most gorgeous of girls (Sadly I was hoping he would get with someone who was at least more pretty than me, but no he went with the other route.)</p>\n\n<p>Sorry to tell you of my sorrows, but hey it is important! So basically I ended up going to a party that shamefully I wasn&#39;t even invited to, but since it was a open house I was like screw it!</p>\n\n<p>So after just sitting alone looking like a complete loser, I was approached by some shady looking characters that honestly didn&#39;t recognize as the strobe lights occasionally making it dark in the room. They offered me a drink, and normally I do not take drinks from people especially men I don&#39;t know , but hell I was depressed from my break up I was hoping to get some action and sadly I think this was the only way how.</p>\n\n<p>After sipping some drinks with them, and becoming one with the music I ended bumping into this guy he spilled his drinks all over me and as a women or at the time (a victim) I screamed how he was trying to force himself on me. </p>\n\n<p>I know I know please don&#39;t judge me it was the drinks! So everyone stared at this guy, before I realized the lights had turn out and the actual lights turned on, a girl started screaming at the top of her lungs. This guy was nowhere near our age he looked like he could be in his early 30s. Even I was a bit startled, he looked at me obviously ticked off and ran out. </p>\n\n<p>I wondered what an older man would be doing at the party, but there was no time to think someone announced they had called the cops and everyone scrambled out of there. Sadly this didn&#39;t make me any more popular instead it did the opposite since I was supposedly the &quot;Party Crasher&quot;. </p>\n\n<p>Well, before I continue to tell you more I forgot to mention my predicament that I am facing. As I mentioned before the guy I had bumped into became my long time stalker... \n(I will reveal more, any advice is much appreciated.) </p>\n\n<p>Well, my beloved stalker has stopped stalking me to stalk another?! Which honestly... Makes me jealous...</p>\n\n<p>(I broke another phone, so I have to go buy a new one Ta Ta for now~)</p>\n</div>\n","author":"todayistommorrow"}