{"rank":"10","title":"Cold Hands","id":"8msb16","url":"/r/nosleep/comments/8msb16/cold_hands/","time":"1527532700000","body":"<div class=\"md\"><p>When I open my eyes you are sitting up in bed staring at me, you smile and reach out to touch my cheek. I kiss your fingers and say ‘hello poppet’.</p>\n\n<p>We were very busy yesterday and both of us were exhausted when we returned home. You didn’t even utter a sound when I undressed you, washed the muck off your face and pull a clean t-shirt over you head.</p>\n\n<p>Now both of us are awake and you are kneeling on the bed with your thin arms outstretched for another cuddle. I can not resist and I take you into my arms. I do not need an excuse to touch you again even though you are so young, barely formed, I want to touch every inch of you and my hands sweep across your back, then to your neck. My fingertips discover the folds behind your knees, the dimple at the base of your spine and the cleft in between your buttocks; I linger at every opportunity and savour all the diverse textures of your body. A thrill passes through me; I shiver with delight.</p>\n\n<p>‘Mummy why are your hands always cold?</p>\n\n<p>I smile and say nothing.</p>\n\n<p>I always marvel at how flawless you are, skin the colour of cream, almost translucent with only a splatter of freckles across your snub nose. Others maintain you are a reflection of me, I can not see it, I am so old and you are stunning. So stunning I am helpless when I stare too deep into your steel blue eyes. You reach up to stroke my hair. My fingertips caress the incline behind one of your ears where the skin is soft and dusted with golden frosting. If I had the choice I would stay here forever and breathe in the scent that somehow lingers in your pale hair, city smoke accentuated by the perfume of hamburger grease, tobacco, alcohol and human sweat; I try and raise myself upwards.</p>\n\n<p>You have other plans. You find the hollow in my neck, it tightens and I know what you want. Then you lie down on the bed and look up at me with expectant eyes, your mouth is slightly open and your tongue flickers like a baby bird ready to be fed. You are hungry and need something to eat.</p>\n\n<p>You do not have the strength to inflict the first bite, so I do it for you as I sink my teeth into my own wrist and make a small tear. A spurt of blood transforms you and you grab hold of my arm and haul it towards your lips. You have no mercy; you are hungry and desperately need what I give you. Other mothers’ give their children milk from their breasts, what I give is so much better, I give you my blood. We lie back, together, you suck at my wrist, I always instruct you not to drink too much and you always smile. I tell you how much I love you; you wipe your mouth with the back of your hand and call me mummy, I kiss you and hold you in my arms and stroke your hair. As you dress and wash your face I promise a tourist to feed on, something more exotic to expand your palate. You clap your hands with joy; I tie back your hair into a pony tail with a cream ribbon. You stand before me, perfect, an angel in pink and white.</p>\n\n<p>I look at you, my child.</p>\n\n<p>My perfect child.</p>\n</div>\n","author":"graciedot"}