{"rank":"6","title":"My daughter sees things just like I did. Part 1","id":"8mseh1","url":"/r/nosleep/comments/8mseh1/my_daughter_sees_things_just_like_i_did_part_1/","time":"1527533479000","body":"<div class=\"md\"><p>Now I&#39;m making this a series because in order for you to understand my reasons for being scared for my daughter we have to go back to what happened to me. I&#39;ve seen spirits since I was young. My mom tells me all the time as a baby I would look up reach my hands out and giggle.  But the earliest thing I remember is when I was 4. My mom didnt notice someone had broken a glass bottle in our yard and I had stepped on one of the shards splitting my toe open and causing me to have to get stitches. Just before I had stepped down though I remember hearing a voice yelling at me to move. It was to late though my 4 year old self was already stepping down right where the broken glass was. I stopped after I stepped down and looked around but no one was there. </p>\n\n<p>From that moment on I remeber seeing all kinds of spirits. We moved from place to place and my &quot;imaginary&quot; friends would change with each differnt town we lived in. Looking back on it now I realize they were spirits and every time I told them that I was moving they would get sad and disappear. I was unpopular as a kid and the few friends I had at school didnt want to be seen with me there. I was a lonely child, and considered weird, so my spirit friends kept me company until I moved.</p>\n\n<p>As hard as it was to leave my friends behind, I knew I would make more. We ended up in a city in iowa, having lived in Iowa my whole life it wasnt that far of a drive. So I kept in contact with my best friend and made new friends in my new home. I still saw spirits everywhere including a bowling alley with suits of armor. This was my next memorable experience with them. </p>\n\n<p>Walking into this place there were several floors. One was a resruraunt, the next a bumber car station and the next a bowling alley. I know there was a bar in there too but we didnt go to that floor. It was a cool old factory that had shut down and the people who bought it turned it into a fun area for families. We were waiting for the elevator and all pf a sudden I see a man in a white loose shirt and long brown pants walk by my mom and I. He walked into the suit of armor and it started moving slightly. I told my mom and it stopped when she looked over and she told me it was my imagination.</p>\n\n<p>I forgot some of my childhood due to traumatic events, but I remember meeting several spirits. But to the point of this story the reason for my concern for my daughter. My great grandmother passed away when I was about 10. My grandma left me 3 of her porcelain dolls that sat on my dresser in the corner, a lamp with kittens all over it, and a plaque with a beautiful white tiger. My mom and step dad came back with these things for me from the funeral. There wasnt enough room for me to go with my siblings both being in carseats and my grandparents going as well as my mom and step dad so they brought me back the things my grandma left me. </p>\n\n<p>I felt a bit uneasy around the dolls but I didnt think much of it. Until one night I was awake in my room my kitten lamp was on and I was reading old yeller, strangely I remember that detail, and out of the corner of my eye I see my dolls move. Slightly at first then more direct looking at me and moving their arms in my direction. I remember seeing a faint reddish glow where they were. Then I heard my great grandmas voice. I was scared and excited I missed her so I responded to her. This was our conversation:</p>\n\n<p>Grandma\n &quot;Elizabeth. I miss you baby.&quot;</p>\n\n<p>Me\n&quot;Grandma, your dead.&quot; </p>\n\n<p>Grandma\n&quot;I know bethy, I wanted to say goodbye.&quot;</p>\n\n<p>Me\n&quot; You dont have to go, grandma. You can stay and talk to me.&quot; This is where our conversation turned dark. Something in me hoped that this was my grandma but I knew at this point it wasn&#39;t.</p>\n\n<p>Grandmas voice got distorted a little then came back to normal. She talked to me about heaven. She told me it was beautiful, it wasnt golden gates and fluffy white clouds, but she was reunited with family, her mom and dad and grandparents. It was like when she was alive she said. Suddenly. Felt a sharp pain in my left shoulder, right under the shoulder blade. It was strange and my grandmas voice distorted again. This time it didnt change back, it deepened becames raspy like a mans and l little ragged. I screamed for my mom. She told me I had had a nightmare but I knew better than that I had met a demon. And he tried to steal my soul by impersonating my great greandma. Even when I had tried to block them I still saw spirits even when I didnt &quot;believe&quot; in them after having been adopted and converted to being a Jehovah&#39;s witness. I finally accepted that I had a gift I couldnt ignore after I turned 18. And i&#39;ve learned how to block things so I keep my sanity. My left shoulder hurts every time I feel a harmful spirit around. That demon left a scar in my soul, and to this day I trust my instincts. But now my daughter has started seeing spirits too. Yesterday was the first time I&#39;ve been truly afraid of this because I cant figure out who grandpa four is.</p>\n</div>\n","author":"mamabeth51"}