{"rank":"45","title":"Hell in Earth","id":"8msjzi","url":"/r/nosleep/comments/8msjzi/hell_in_earth/","time":"1527534682000","body":"<div class=\"md\"><p>I used to love exploring old mines as a kid with my dad, I mean I really did. We used to explore the old style abandoned ones, with timber lining the walls and everything, and by everything, I’m talking about old mining equipment, abandoned carts, headlamps, and tools, even a few old ladders and chutes the old miners used to help move the minerals they were looking for. I didn&#39;t mind the darkness of the mines, rather, I embraced it, felt at home in it. I didn’t care about the possibility of finding a large bloodthirsty monster, or even the giant cobwebs and tarantulas. It just didn&#39;t faze me. The promise of adventure, into somewhere where few people were brave enough to explore? That was enough for me to forget every single fear I had. At least inside the mines though. Outside of them, I was still afraid of even the tiniest of bugs. </p>\n\n<p>But still, everything about the mines was great back then. And it was all thanks to my dad, the real-life equivalent for me of Indiana Jones. Talc and silver mines were no problem, and new adventures seemed to come twice at least every month. It was our thing, at least until he contracted something from being inside the depths for too long. Apparently, my dad had done too much time in the mines, and had caught a little souvenir in his lungs. We found out about this a year ago, and despite his doctor’s constant warnings, he still ventured down into the mines, without a care in the world. With his strength and endurance from his youth corroding away, leaving him with only the will to dive deeper into the depths, he wrote two letters to me, one containing his will, and the other, containing his suicide note. </p>\n\n<p>Except he didn&#39;t call it that. He called it his going home letter, which was the title of it written on the envelope he sent it to me in. In it, he detailed how he saw no outcome in his future where he did not overcome the blackened remnant of an organ as he called it. My mom called me minutes after I had gotten the letter, obviously trying not to sob into the phone as she told me about how she hadn&#39;t seen my dad in 3 days. She obviously had gotten a copy of the letter, as the defeated and dead tone in her voice said it all. When I said I hadn&#39;t seen him at all, she responded to me with a simple “Oh…” like she had nothing more to say, and promptly hung up. </p>\n\n<p>How could she say anything more? How do you just respond to the clear confirmation that the man you’ve loved for 25 years is now dead? You can’t. That&#39;s how, because no amount of sobbing, screaming, or typing can completely express in the truest sense how much pain she felt in herself at that moment. Because after that, after being complete for so long, a void, her husband; MY father once filled, there can be nothing- and I mean nothing, to fill its place. </p>\n\n<p>My strength left me in that moment, it truly did. It felt as if a piece of me, of who I was, was ripped out of me, and what replaced it was only a sense of denial, that somewhere out there, my dad could actually still be alive! </p>\n\n<p>In the moment that the denial took hold, I felt something completely alien to me.</p>\n\n<p>A sense of hope. Of completely misplaced, synthetic, and dangerous hope. But it was enough to fuel me, to make me do what I did. I took another look at the letter, before completely dissecting it in my head, and one line in particular stuck out and blared alarms in my head. </p>\n\n<p>“Going Home”</p>\n\n<p>I knew exactly what it meant, because for him, &quot;home&quot; could have meant where my mother was, or where the nearest mine was. The nearest mine to his house, from where he had delivered the letter, was the Horton mine, some shitty old run down one we almost never explored because of the sitting water inside of it, which to him meant that there was a bit of a safety issue. I knew that it one of the many he would have liked to explore more, but I had to take the chance that it was the one he went to.</p>\n\n<p>I packed up my hiking gear and a flashlight into my truck, and hauled ass over to the nearest place where I could park near the entrance. Sure enough, there was an old Silverado there too, the exact one that my dad had kept since they first rolled off the production line. I could feel the color drain from my face as I saw the characters on the license plate, and the strength in my legs begin feel limitless as I ran for the mine entrance. </p>\n\n<p>Without a single care in the world, I threw myself into the cave without a second thought, turning on my flashlight only minutes into the already pitch black cavern. I didn&#39;t keep track of where I was going, nor what warning signs of instability I had already flown by. Creaking timbers, with standing water and mineral deposits, along with scattered feces of various animals passed by me with each step, alerting me that this mine was more than just unsafe, it was downright a fucking deathtrap.</p>\n\n<p>I eventually caught sight of a boot trail in the dirt there, and saw where it led… down deeper, into another level of the mine where it seemed that no amount my light would reveal the bottom. I was hesitant to jump in, until I heard a wheezing noise from down below, in that unending dark pit of rubble. </p>\n\n<p>I did the unfathomable.</p>\n\n<p>I jumped, feet first into the abyss, hoping that the drop would not be so high as I suspected to be. It didn&#39;t matter though, I was so hopped up on fear and adrenaline that the concepts of rational thought and common sense had ceased to exist. </p>\n\n<p>With a crash on the unforgiving, sharp ruble I thought to be the floor, I reached the bottom, and tried to stand up, with “tried” being the keyword there. In the fall, it seemed that I had sprained my ankle so much so that walking on it brought me unbearable pain, for even the copious amounts of adrenaline I had in my system could not dull the pain at all. </p>\n\n<p>Only then, did the reality of my situation set in. I, was at the bottom of an abandoned mine, with no one knowing I was down here, along with a broken ankle, and with my only exit being an opening in what was now the ceiling of the cavern I was in. The adrenaline faded quickly after that, and the energy that drove me to go on, simply vanished.</p>\n\n<p>My heart ached from being worked far past its limits, and as did every other muscle in my body. I collapsed into a ball of limp flesh on the floor, with only enough energy left to keep breathing. The pain in my ankle surged again with each attempt at moving and kept me subdued on the ground in agony.</p>\n\n<p>Then I felt it, the rush of warm air from within the depths. I turned on the flashlight I took with me, trying my best to separate myself from the darkness trying to envelop me. I pointed the light first at the floor which revealed two things to me, hope and despair in the form of a lone boot and a set of minecart tracks. </p>\n\n<p>I knew whos boot was on the ground, torn nearly to shreds and covered in a mucusy liquid. And I died inside when realization set in on me. When I realized that I had no chance of ever finding what I came for. When I realized that my dad was never coming back home, in a coffin, nor on his own.  When I realized that whatever tore him to shreds would surely tear me to shreds in the same cave. I felt my stomach sink as thoughts of feeling abandoned in a dark that surely no one would ever find me in. Damned. I was damned rot, and be consumed by the lurking in the fucking cave.</p>\n\n<p>But then I looked back at the mine cart tracks. And I realized one thing.</p>\n\n<p>Tracks mean carts nearby</p>\n\n<p>Carts mean an exit for miners to dump minerals</p>\n\n<p>An exit meant a way out.</p>\n\n<p>Another rush of hot air blew through the cave, strong enough to blow back my hair and push the boot about a foot away. </p>\n\n<p>And from within the absence of light, came 6 pinpricks of yellow lights from high above in the cave. My hand trembled as I held up the light revealing an unholy sight. A one I have no way of comparing to anything else on God&#39;s earth. As I angled the light to best see it&#39;s facial features the light revealed to me what I only would recognize as 4 sharp, jagged, ant-like mandibles surrounding it&#39;s fleshy, torn and heavily scarred maw. Its teeth were jagged and misshapen, and could visibly not allow the beast’s own jaws to fully close.</p>\n\n<p>The eyes, though, those damn eyes!  As I raised up my light even higher I saw the beast’s eyes light up like that of a dog’s or cat&#39;s at night, with pure malice contained within them. They weren&#39;t even placed near each other as in nature, there was no symmetry in the placing of the eyes on its face! All of them it seemed was just haphazardly strewn about on it, With 2 of them resting at the top left of its face, one below the maw, another left at the top right corner of its face, and 2 placed on one of its mandibles. </p>\n\n<p>I took my opportunity to run as soon as I had a chance to take in the sight of the unholy abomination before me, with a renewed sense of fear and energy pulsing through my body. With only survival on my mind and my flashlight the only thing saving me from spraining my ankle, even more, I sped up as much as I could and turned back to see, Satan himself gaining on me. I saw the damn thing behind me, scuttling towards me on millipede-like legs that served only to drag it through the cave, not even lift it’s body up. </p>\n\n<p>I ran for at least 5 minutes straight, huffing and puffing while running on adrenaline fumes, while considering just laying down and waiting for my end. My muscles felt like they were on fire, and my body felt as if it were crying for me to stop, as if the work I was putting in was just too much strain for it. But then, I saw a light. I saw the true light at the end of the of the tunnel. I forced myself to run as fast as I could with satan breathing down my neck, hoping that I could just make it far enough to jump out of the cave into the sunlight.</p>\n\n<p>As I neared the cave’s end, I braced to throw myself out into the midday light, not willing to run any further. If sunlight was what would get this thing off my tail, then I would be thanking God for the rest of my life. If the sun didn&#39;t stop the devil himself, then so be it.</p>\n\n<p>As I chucked myself out of the cave like a cannonball, I braced to roll myself a bit further way just to increase my chance of survival by just a little bit. I hit the ground with enough force to knock the wind out of myself, and rolled only a few feet more away from the cave’s opening. I rolled over to see the opening of the cave, and smiled.</p>\n\n<p>I saw the abomination screech to a halt when it saw the border of shadow and sunlight, and I heard it’s shriek when I realized that the damn piece of shit was terrified of the sun. To my satisfaction, I smiled harder. I grinned like a madman as I stood up while satan scuttled backward into hell in earth, and limped to my truck.</p>\n\n<p>I rested in my truck for a while, at least until someone called the paramedics on me for cooking in my truck while asleep, in summer desert heat. While I slept, two paramedics took me out of my truck and drove me to the nearest hospital. As the doctors wheeled me through the halls, I heard comments about how I was extremely dehydrated, and how I had a few cut wounds that would need extensive treatment. It seems that I didn&#39;t notice that the thing had knicked the back of my legs while I ran from it.</p>\n\n<p>Thankfully, the doctors did their best, and now as I write on my laptop that my mother bought for me, I still smile, seeing as I’m being released in a few hours. </p>\n\n<p>And I smile for another thing though still. That I have plans to go back to the mines. And that I’m gonna get my revenge, and take something that the beast took from me.</p>\n\n<p>A life.</p>\n</div>\n","author":"nosleepreader935"}