{"rank":"97","title":"Home Coming","id":"8mst36","url":"/r/nosleep/comments/8mst36/home_coming/","time":"1527536784000","body":"<div class=\"md\"><p>After 15 years, I’m going back to my childhood home. The funeral is Monday morning. As the oldest I have to go through the attic, Dad’s belongings, in its entirety before then. Mom couldn’t bear to have his mementos around right now. Plus, he wanted to be buried with his war memorabilia and it was up to me to find it. As I load the car, the dread creeps in. The summer I left for college was the last time I stayed in that house.   </p>\n\n<p>Adjusting the mirror, I recognize those bloodshot rear-view mirror eyes as mine. Bruised from lack of sleep, more bags then a luggage claim. The nightmares are back. Where I’m 17 again, sleeping in the garage…that thing...is there with me.    </p>\n\n<p>As the landscapes fly by, my mind is thrown, hurtled, back in time.   </p>\n\n<p>&quot;I&#39;m so proud of you!&quot; Moms lithe hands wrapped around my neck. She pulled me close. “I knew you could do it! My smart boy!&quot; She kissed my forehead.   </p>\n\n<p>&quot;Martha!&quot; Barked Dad. &quot;Let&#39;em be! You’re gon spoil&#39;em!&quot; She pulled away, plastering a tight smile, back to cutting potatoes for supper. “Well done, boy.&quot; Dad’s meaty paw landed on my shoulder and gave a firm squeeze. We were looking over my college acceptance letter.   </p>\n\n<p>Silverware clashed together in polite tings as we ate. The humid June breeze wafting through the little yellow window above the kitchen sink.  </p>\n\n<p>&quot;Well, boy, since you&#39;re goin&#39; &#39;way&quot; He pointed a knife passively in my direction. &quot;Your mama n&#39; I have decided she gon&#39; use your room for her craftin&#39; n the like.&quot; He popped a steamed potato in his mouth, chewed for a moment then continued. &quot;You won&#39; be needin&#39; it much longer I reckon. So...&quot; He swallowed &quot;...I&#39;m gon&#39; set you up in the garage. A&#39;boy your age needs space anyhow.&quot; He sniffed and continued to fork potatoes into his maw. I looked down, leaving the comfort of a room I inhabited for 17 years struck a chord, I didn&#39;t know if I could.   </p>\n\n<p>&quot;You a&#39;right with that, boy?&quot; My head snapped to meet my Dad. His eyes predatory, coldblooded, like a crocodile. The air went out of the room. </p>\n\n<p>&quot;Y-yeah, pa, of course. Thank you, sir.&quot; Under the table my fingernails dug into my palms. I held my breath, pulling the corners of my mouth up dutifully. A lopsided smile.  </p>\n\n<p>&quot;That&#39;s right, you shore are.&quot; Appeased, his attention turned to the roast. My mom and sister, Violet, relaxed in my peripherals. Around his fork, the red juices oozed from a new wound. I lost my appetite. The rest of dinner was quiet; Save for a low shuffling from the attic above. Raccoons most likely.   </p>\n\n<p>July was a balmy blur. I was fully moved into the garage, my old room turned into a craft extravaganza. My parents hosted their annual Fourth of July BBQ. The house swarmed, packed to the brim with bodies, relatives, for a week. Everyone was there. Except, mom’s sister, Aunt Janice. This wasn’t unusual. She was a transient, a junkie. </p>\n\n<p>No one had seen her since the Christmas party. She got, for lack of better words, fucked up and started coming onto dad. Kissing him. Dad was upset but Mom...God, Mom was livid. I had never seen her so angry, in that instant, I thought she was capable of anything. I watched, in abstract horror, as mom threw a wine glass that exploded near Aunt Janice’s head. Jolting her from a drunken stupor and inciting a fist fight between them. After being separated, Aunt Janice left. She stumbled out of the door, into the darkness, shouting obscenities.    </p>\n\n<p>“No. But I’m glad she didn’t show up. It’s always drama with her anyways. But I’ll catch you later! Bye!” Violets disembodied voice floated through the house. The click of the phone followed. The festivities died down, the house was ours again. Perched on the couch reading I felt her eyes on me.   </p>\n\n<p>“What?” I didn’t look up. </p>\n\n<p>“I can’t just hang out?” She laughed. “With my favorite brother who would do anything for his favorite sister? Because he’s best person in the world?” She sat down next to me.  </p>\n\n<p>“Can’t play favorites if it’s just us.” I put the book aside. “Laying it on thick, huh? Flattery will get you…everywhere. Come on, what do you want?” An eyebrow raised in suspicion.    </p>\n\n<p>“Can you rent a movie, pretty please?” she gave a wide smile and batted her eyes.    </p>\n\n<p>I groaned. “Blockbuster is down the street. It’ll take 15 minutes. Do it yourself.”      </p>\n\n<p>“No shit, but… I can’t. You need to. Since you’re older.”  She folded her arms with a mock pout. </p>\n\n<p>I rolled my eyes playfully “Fine. One of those weirdass scary movies you’re obsessed with?”  </p>\n\n<p>“You can watch with me!” She beamed.  </p>\n\n<p>“Ha! Fuck that! What sort of masochistic asshole wants to be on the verge of pissing their pants for an hour and a half?” She elbowed me hard as we laughed. I hated horror movies, I didn&#39;t have the stomach for them, or being scared in any capacity. But it’s the insidious fear that was worse. The fear that slowly builds, after the movie.   </p>\n\n<p>After getting Violet her prize, I went to the garage. Later I was startled awake by the sharp thud of a knock. I rolled my eyes intensely. If they could go any further back in my head, I would have swallowed them.   </p>\n\n<p>“Really Vi! Grow up!” I hissed. The knocking became, heavy, desperate as it had gotten my attention. Thud! Thud! Thud!  I threw the blankets off. The knocking grew violent as I grabbed the door knob. &quot;Vi I swear to god! if you wake dad I’m going to kic-&quot; The threat died in my throat as I swung open the door. The dark void of the kitchen greeted me. Startled, I stumbled back to bed. Laying wide eyed as the knocking continued well into the early hours. I told myself it was the raccoons, behind the attic door, just out of sight.   </p>\n\n<p>What transpired the last week of August cemented my need to flee. I had spent the better part of the day packing. Exhausted, I climbed into bed and waited for sleep to overtake me.   </p>\n\n<p>Crack! The sound sent me into a panic. I thought the door was being kicked in, again. My arms flew to cover my face instinctively, waiting for the onslaught. Brow damp with anticipation, heart pitching itself against my ribs. But the blows didn’t come. I peeked out from under my hands. The garage door intact, room empty. I laid back down, pulse still hammering in my throat.  </p>\n\n<p>I sat bolt right when I heard a loud, wet, slap. Something like meat hitting concrete. My eyes darted to the attic, door ajar, then the floor. Splayed out, writhing in agony, a burlap sack with humanoid features. Loose Skin slopping to either side. Limbs a twisted, tangled mess. Hands clamped over my mouth, I stifled a scream.  </p>\n\n<p>When its eyes locked on mine it shambled, in quick jerky movements, to the bed. Face to face, a putrid odor filled my nostrils, tears pricked my eyes. A veil of stringy hair, revealed a broken jaw. Hanging limply against its chest. Bile rose up my throat, like marching fire ants, stinging painfully. I swallowed hard. But the overflow seeped between my fingers and dribbled down my chin. A thick blackness was growing at the edges of my vision. Staring into its hollow, glassy, eyes produced a pang faint recognition. It gurgled futility, something like a plea. But I couldn’t make out the words as the darkness swallowed me. </p>\n\n<p>When the world came swimming back I was drenched in sweat, dried bile crusted on my chin and shirt. I sat up quickly, ignoring the wave of dizziness, and scanned the room for the creature. I jumped when Dad stepped off the last rung of the attic ladder. His heavy boot connecting with a thump. </p>\n\n<p>“What’re you still doing in bed, boy?” He eyed me suspiciously.  </p>\n\n<p>“D-Dad, there was something in here last night, I swear. It came out of the attic” My words seemed far away, disjointed. </p>\n\n<p>“Ain’t nothing in that attic, ya hear, nothing. ‘Cept coons. Damn things chewing up wires. Get the hell up, boy, you got chores to do.” He scratched the underside of his beard. </p>\n\n<p>I avoided his eyes. “Must have been a bad dream.” I murmured sheepishly. My voice dropped to a whisper “Scared me…” </p>\n\n<p>“Must’ve been, huh. You should only be scared of God and your Pa. Now get.” </p>\n\n<p>I Fumbled out of bed. He grabbed a hold of my upper arm. </p>\n\n<p>“You been in my whiskey?” Eyes drifting to my stained shirt. </p>\n\n<p>“No sir.” </p>\n\n<p>“Best not’ve been.” He pushed me away. </p>\n\n<p>I dropped something under the bed that night. While on hands and knees to retrieve it I spied a long, stringy, hair. I got what I could carry and left. </p>\n\n<p>I haven’t step foot in their house since, till now. </p>\n\n<p>The house looks exactly as it did, give or take the filter of nostalgia. The house is empty. Violet picked mom up earlier to catch the early bird special at her favorite diner. In the house, a tomb of my childhood, I make my way through the kitchen, and stand at the door to the garage. My palms began to sweat as I enter. Taking a moment to gather my bearings. I climb the ladder. Dad never let us in the attic, it was no place for kids he&#39;d say. I push through the door and grope the dark wall for the light switch. To my surprise, the attic is in pristine condition. Odd, I thought.  There was no sign, past or present of raccoons. I began to go through boxes, knicknacks, and pictures. There was one from the Christmas party, before the fight, Mom and Aunt Janice smiling wearing matching sparkly blouses.  </p>\n\n<p>The sun was sinking below the horizon. The small attic window bathed the room in soft light. One last box, I peer inside. Must be Halloween decorations, there&#39;s a wig sitting on top. I took a fist full of the black mass and pulled it to eye level. My blood ran cold, a withered skull was attached. Something in the box caught the sun and glittered. </p>\n</div>\n","author":"UltaViolence"}