{"rank":"31","title":"My Mother's Birds","id":"8msxl5","url":"/r/nosleep/comments/8msxl5/my_mothers_birds/","time":"1527537826000","body":"<div class=\"md\"><p>Ever since I was a little girl, my mother was fascinated with bird&#39;s and bird watching. Of course this seems like a normal habit for many people, especially avid gardeners like my mother is. Some of my fondest memories of my early years come from going to plant nurseries with my mother, and picking out plants that would attract certain birds. I specifically remember buying several foxglove plants to attract hummingbirds, and aster for robins. We would then head home, a car full of plants and a distinct and earthy smell, and plant the flowers for our feathered friends.</p>\n\n<p>At first my mother&#39;s obsession with birds seemed completely normal. She would get up early on her days off, with a cup of steaming coffee and a camera to capture the magnificent creatures enjoying the plants she hand selected for them. As I got older however, the obsession got worse. I came home from school one day, to find her putting up oddly realistic birds on our windowsills and tables. She told me that these decorations came from a garden store, and I saw no reason not to believe what my mother told me. We had an upstairs family room that slowly evolved into the bird room. Pictures and paintings of birds, and more of the bird figurines. Almost daily, a new bird appeared. I wondered where on earth she found the birds, because they all were species I had distinctly remembered seeing in our backyard, or my mother saying she bought plants specifically for. I brushed this off pretty quickly. I figured mother had sought out these birds specifically, and just really loved certain species. The worrying thing was how much time my mother said she spent shopping for these birds, and how much time she took to carefully arrange these birds in her bird room. Except for work, she never left the room, even taking her meals and sleeping in there. </p>\n\n<p>One night I came home about an hour early from some plans that I had made with friends, and saw something that I knew I was not supposed to see. My mother was sitting happily at the kitchen table, hands and shirt covered with odd splatters of blood. Then I looked at was on the table, and there were roughly half a dozen dead birds laying on my kitchen table. &quot;Hi, honey&quot;, her sickly sweet voice greeted me, &quot;I&#39;m sorry you had to see me like this. Dinner is in the fridge if you&#39;re hungry.&quot; There were bloody birds all over my kitchen table, my mother was cutting one open, probably to stuff and preserve it. What the hell had gotten into her?I was panicked . I knew something was off. My mother was somehow hunting and picking off the birds in her garden one by one, and collecting them for herself.  I thought my mother was going insane, and I start running for the door. The next thing I know, I feel something go through my stomach. My mother stabbed me in the chest. I remember blood on my hands and on the floor, then mother bringing me to the living room and laying me on the couch. The last thing I heard was &quot;You&#39;ll make the perfect addition to my collection&quot;. She started sticking her fingers into my open wound.I blacked out. What seemed like years later, I woke up in a hospital, my dad at my bedside. I didn&#39;t even think to ask where my mother was. The window was open, it was a beautiful day, and I saw a hummingbird zoom past the window. All I could think about was my mother, and how I never wanted to see another bird in my life. </p>\n</div>\n","author":"vibe_ramon"}