{"rank":"168","title":"I Found Her Notebook","id":"8mszf0","url":"/r/nosleep/comments/8mszf0/i_found_her_notebook/","time":"1527538226000","body":"<div class=\"md\"><p>I have something I need to share.  </p>\n\n<p>I wish I didn’t.  I wish I had never found this damn thing.  But I <em>did</em>, and now it’s in my head, and now I can’t sleep.  I close my eyes and my mind goes right to this woman and the shit I’ve read.  I’m tired, I have a headache, and I’m fucking sick to my stomach.</p>\n\n<p>I found a notebook yesterday.  Notebook might not be the right word.  I was out on a hike and took a detour through the woods on this path I know.  I’ve done it before with no issues.  And I didn’t have any issues this time either, I just... happened to spot this damn notebook.</p>\n\n<p>Again, notebook might not be the right word.  It’s shaped like your average notebook, and it’s bound with a spiral, but the cover pages are made of metal, kind of.  Some type of metal.  They’re as lightweight as a piece of paper, and as thin, but they are strong and sturdy, with a reflective surface.  That’s how I spotted it.  The reflection of the sun almost blinded me as it hit the cover of the notebook, peeking out from under a layer of leaves.</p>\n\n<p>Of course I went over to investigate.  Because I’m a fucking idiot.  I should have ignored it and kept on down the path.  I should have minded my own fucking business.  </p>\n\n<p>As I picked it up, something felt off.  Just really strange and not quite right.  It took me a minute but I finally realized it was the sound.  Or lack of sound.  The leaves made no noise as they slid off the cover.  The notebook made no noise as it came in contact with my hand.  I tapped it with my finger.  <em>Nothing.</em>  Its like this thing is a black hole and it eats sound.  I know that sounds ridiculous, but I don’t know how else to describe it.</p>\n\n<p>There’s no lock on it.  Nothing to keep anyone from opening it up and reading what’s inside, which I find completely baffling now, given its contents.  </p>\n\n<p>Totally enthralled by this thing, I decided I was done hiking for the day and the notebook and I turned around and headed back home.  Where I plopped down on the couch and proceeded to read it.  </p>\n\n<p>Had I known what was in it, I would have left it in the fucking woods.  I never would have touched it.</p>\n\n<p>But I did.  And now I’ve read the damn thing.  And I can’t keep this to myself.  Someone else has to know this woman’s story, this woman in the notebook.  I can’t be the only one.  I don’t want that shit on me.</p>\n\n<p>So I’m going to share it here.  </p>\n\n<p>And then I’m going to fucking burn this goddamn thing.</p>\n\n<p>————————————————————</p>\n\n<p>Today is a good day.  </p>\n\n<p>Today they have given me you, this journal.  And a pen!  I feel free.</p>\n\n<p>I know why.  I think I know why.  They want me to record how I’m feeling.  They’re always tilting their heads at me as if questioning.  They don’t say it, but I just know they’re thinking, “Are you okay?”</p>\n\n<p>And I guess I am.  At least today.  Today I am <em>writing.</em></p>\n\n<p>I don’t know how long I’ve been here, but it’s long enough that the anger and fear I initially felt are long behind me.  I’m not scared anymore, just lonely.  And homesick.  I miss my mother’s cooking and the sound of my daddy’s voice.  I miss the way the sunlight would hit the wheat on the farm every morning when I’d wake up.  The smell of the grass.</p>\n\n<p>I went to bed one night and woke up here.  That’s all I know.  I remember nothing of how I got here.  </p>\n\n<p>My room is a big metal box, with four cold walls.  No windows.  No clocks.  </p>\n\n<p>I sleep on a mattress in one corner, and I eat at a little metal table in the other.  They slide my food in on a tray through the crack between the floor and the door.  </p>\n\n<p>The door hardly ever opens, and when it does, that usually means something unpleasant is about to happen.  Nothing terribly scary - they’ve never hurt me.  But they have <em>examined</em> me.  Like a doctor.  They seem to be testing me.  But they never hurt me.  The opposite really. They’re almost kind.  </p>\n\n<p>I think they care about me.  </p>\n\n<p>I think.  It’s hard to know without being able to see their eyes or their faces.  But I’m pretty sure.  I’m pretty sure they care.</p>\n\n<p>Last meal was different though.  Before I slept through what felt like the night, which I  guess means it was dinner.  They slid my plate under the door with a pouch of water, like usual, but this time there were two pills with it.  I didn’t question it.  They care about me, I must need them.  So I took the pills.  And I feel no different.</p>\n\n<p>But they must have been proud of me for trusting them and taking them so easily, because when I woke up, they had slid you under the door!  My new friend.  </p>\n\n<p>It’s so nice to have something to do.  </p>\n\n<hr/>\n\n<p>I’m not the fastest typist and my stomach is really bothering me.  That’s her first entry and that’s where I’ll stop for now.  </p>\n\n<p>I’ve got to go lie down.</p>\n</div>\n","author":"Sorryhiker"}