{"rank":"4","title":"The voice in the headphones","id":"8mszk8","url":"/r/nosleep/comments/8mszk8/the_voice_in_the_headphones/","time":"1527538259000","body":"<div class=\"md\"><p>So, a new tech phase in recent years has seen the new integration of wireless devices such as bluetooth headphones. As a tech lover myself, I have bought many pairs of headphones both wireless and wired; searching for the best ones. I do not have the largest budget, so tend to go for the less expensive range, keeping prices under £30. Every pair I have used so far has been a decent pair, up until this new pair.</p>\n\n<p>My new pair of headphones arrived only a week ago. The first few days they were actually the best pair of headphones i had ever tried. They were brilliant. That all changed one night; I had left my headphones turned on and they were still connected to my Laptop. They had been put aside and I had not touched the laptop for a good half an hour when I hear this robotic voice say something like &quot;GG n***** gang gang&quot;. Initially I thought that it was just an ad or a video that had started playing as I was not totally focused, but when I saw that there was no windows or applications running on my laptop, that was when i began to feel a tingling sensation down my spine. I just brushed the incident aside and thought maybe it was a glitch or something.</p>\n\n<p>A couple of days went past with no sign of anything, they were the same normal pair of headphones. Then sitting at a different computer with the earphones connected and on my head this time, I heard the voice as clear as day say in the same robotic tone, the same message; &quot;GG n***** gang gang&quot;. At this point i was freaked out, so i immediately download an antivirus software thinking it was maybe a virus. When all of a sudden, while the software is downloading, I hear another message say; &quot;make him say something&quot;. That was it, I almost shit my pants and shut down the computer and turned my headphones off.</p>\n\n<p>A few days has passed, nothing suspicious has happened as of yet, I have not heard anything creepy. I have not touched the headphones or the computers since. It may be worth mentioning that there has been a man and a woman standing across the street standing together at the same time every day for the past 2 weeks, I do not think they have anything to do with it although it would fulfil my theory that I am being watched. Truth be told I may never know but you might.</p>\n\n<p>I do not know what to do next. What if i am being watched? What if i can&#39;t get away? And most importantly, what the fuck is going on? Hopefully i will be able to tell the rest of the tale as the future reveals itself. Until then it is goodbye. Stay safe out there, the world and the internet is a creepy place. No body else can save us but ourselves, that is the lesson we have to learn the hard way.</p>\n</div>\n","author":"YoungDumbAndWoke"}