{"rank":"13","title":"The Soviet Luna Mission: Whatever became of the Cosmonauts? [Part Two]","id":"8mt4q3","url":"/r/nosleep/comments/8mt4q3/the_soviet_luna_mission_whatever_became_of_the/","time":"1527539437000","body":"<div class=\"md\"><p>Link to Part One: <a href=\"https://www.reddit.com/r/nosleep/comments/8mkh9x/the_soviet_luna_mission_whatever_became_of_the/\">https://www.reddit.com/r/nosleep/comments/8mkh9x/the_soviet_luna_mission_whatever_became_of_the/</a></p>\n\n<hr/>\n\n<p><strong>Date:</strong> June 7, 1967</p>\n\n<p><strong>Location:</strong> Rocketry monitoring annex to Cosmodrome 3, Kazakh SSR</p>\n\n<p><strong>Name:</strong> Fedir Afanasijovych Demydenko; </p>\n\n<p><strong>Team/Group:</strong> Head of Rocketry and Astronomy team</p>\n\n<p><strong>Log Number:</strong> 79</p>\n\n<p>Confirmation has been made that the <em>Proton-1</em> vessel has entered into Earth’s atmosphere with no visible indications of additional potential catastrophes that would prevent in-tact and safe landing for both the Cosmonauts and the craft itself. The leadership is unsure of what to do at the moment, and most believe this to be an error of the system.</p>\n\n<p>Communication with the Cosmonauts of <em>Proton-1</em> have failed to improve in any degree since the incoherent interference was first recorded by Fedir Afanasijovych Demydenko. There is concern regarding the return journey of <em>Proton-1</em> because it follows it’s launch coordinates perfectly. It is as if time is moving backwards, returning our Cosmonauts to us before it snatched them away. This is another instance of evidence that the craft returning is a glitch, and yet the signal is an exact match for the one used by <em>Proton-1.</em></p>\n\n<p>They should have run out of fuel by now. They should have run out of fuel before they left for the void. They probably didn’t even have enough fuel to return. I fear this may be their vegengence. </p>\n\n<hr/>\n\n<p><strong>Date:</strong> June 9th, 1967\n**\nLocation:** General Office annex to Cosmodrome 3, Kazakh SSR</p>\n\n<p><strong>Name:</strong> Alexandrova Tashka Dmitrievna, Doctor of Psychiatry</p>\n\n<p><strong>Team/Group:</strong> Chief Foreman and Project Manager, Titular Head of Crew Assessment and Psychological Team</p>\n\n<p><strong>Log Number:</strong> 80</p>\n\n<p>The alleged <em>Proton-1</em> craft has broken the Earth’s atmosphere, but it seems to not be landing in the Pacific ocean as planned. This alleged <em>Proton-1</em> vessel appears to mirror the launch trajectory of the initial <em>Proton-1</em> craft. This is an absurd series of events, and further shows this is an anomaly rather than the actual <em>Proton-1.</em> </p>\n\n<p>I would initially believe this to be a capitalist trick, but this vessel does not register on even the nation Soviet’s missile-warning radar. This has never happened, as it gives false positives rather than simply fail to register anything at all. There must be an explanation for all of this, I’m sure of it.</p>\n\n<p>As I write this log, I am overcome with a paralyzing sense of dread. I hope it does not mean what I think it does. \nGlory to the Soviets, glory to the workers, and glory to our cosmonauts.</p>\n\n<p><em>(Note: The following addition to the documents is the fifth record of personal writing, and was not recorded nor known to anyone except for the author until these documents were released to our department. Analysis has guessed this is a personal journal log written by Alexandrova Tashka Dmitrievna shortly after her submission of the 80th log.)</em></p>\n\n<p>I cannot shake this feeling of dread. The unnaturalness of this series of events is almost completely unsettling. I have dismissed rumors that the returning craft is Proton-1, despite the fact that I don’t believe those lies I told. It’s dimensions are exactly the same, save for one compartment on the craft. It’s bounced-off radar signature is exactly the same as the Proton-1 craft. It isn’t being picked up by Missile-defense systems. It’s projected to land perfectly on the launchpad as if Proton-1 never left.</p>\n\n<p>I pray it is not the Cosmonauts. We didn’t give them enough fuel to return, there wasn’t time. </p>\n\n<hr/>\n\n<p><strong>Date:</strong> 22nd of June, 1967</p>\n\n<p><strong>Author:</strong> Alexandrova Tashka Dmitrievna, Doctor of Psychiatry</p>\n\n<p><strong>Rank:</strong> Chief Foreman and Project Manager</p>\n\n<p><strong>Log Number:</strong> Unknown</p>\n\n<p>The craft has landed upon the launch pad. It is <em>Proton-1</em>. All crew and personnel have strict orders to never approach the landed craft. It is currently surrounded by our facilities NKVD Fifteenth Directorate division. They have thus far not been able to conclude anything beyond the following details:</p>\n\n<ul>\n<li><p>The craft is indeed <em>Proton-1.</em> </p></li>\n<li><p>The craft is without power entirely, and it’s engines have shut off.</p></li>\n<li><p>There has been no sign of movement of any kind, not even a tilt of the craft.</p></li>\n<li><p>The compartment that was declared mission before landing was apparently not brought on by anything that was considered a possible danger to <em>Proton-1</em> on the Earth or in the void.</p></li>\n<li><ul>\n<li>It appears as though this missing section of Proton-1 is from the entirety of the communication relay and satellites, as if they simply vanished. There is no sign of damage. The missing section merely looks “off” in a way, as if there is something wrong that cannot be perceived. This damage was most-likely done by the sudden Coronal Mass Ejection that sparked the initial communication issue. </li>\n</ul></li>\n<li><p>Other than that mission section the craft is in pristine condition, as when it was first upon the launch pad. This is noted as an impressive feat of Soviet engineering, commendations being awarded to the passed Stepankov Matvey Petrovich. </p></li>\n</ul>\n\n<p>I find myself unable to turn away from the missing section as if transfixed by it. I don’t know what the issue is, I only know that there is an issue. And it may be our fault.</p>\n\n<p>The facility will be holding a candlelight vigil for the fallen Cosmonauts, as we dedicate the various department buildings to them in their honor. </p>\n\n<p>We still await orders from the Kremlin for how to proceed. I sometimes hope they give no orders at all. We have assigned squads of the general Red Army guard’s to strengthen the perimeter set up by the NKVD. </p>\n\n<p>Clandestine squad-leader of lower-ranked operatives in the NKVD’s Fifteenth Directorate division. </p>\n\n<hr/>\n\n<p><strong>Date:</strong> 8th of April, 1967</p>\n\n<p><strong>Author:</strong> KGB Officer Koryavin Androniki Dmitrievich.</p>\n\n<p><strong>Rank:</strong> Chief officer of the NKVD Fifteenth Directorate division deployed to Cosmodrome 3.</p>\n\n<p><strong>Log number:</strong> <em>Unknown</em></p>\n\n<p>Our orders directly from the Kremlin offices, bypassing the high-ranking staff of Cosmodrome 3, are to tighten the perimeter around the craft and to also take pictures of the anomaly that is the missing Communications section.</p>\n\n<p>We are ordered to not divulge any of this information to Cosmodrome 3, and will now report directly and solely to the Kremlin offices. </p>\n\n<p>My comrades are unsettled by this turn of events, tacitly resisting the order to press forward. I do not blame them, but they must overcome their fears. I will meet out punishment for any further dissention.</p>\n\n<hr/>\n\n<p><strong>Date:</strong> 12th of April, 1967</p>\n\n<p><strong>Author:</strong> Alexandrova Tashka Dmitrievna, Doctor of Psychiatry</p>\n\n<p><strong>Rank:</strong> Chief Foreman and Project Manager</p>\n\n<p><strong>Log number:</strong> <em>Unknown</em></p>\n\n<p>The NKVD Fifth Directorate division has inexplicably tightened their circle around <em>Proton-1</em> on the launchpad. I have attempt to send official documents to question their decision. They simply act as if this is the natural course of events, and as if this was their initial perimeter. I’m worried that the dullness of guarding <em>Proton-1</em> without any orders has made most of the officers delirious. </p>\n\n<p>I intend to launch a formal complaint to the Kremlin about this disobedience, not for the sake of getting any NKVD officer in trouble, but rather to get any answers at all. These unfolding events appear to be reaching some conclusion, and I would at least feel better in knowing all the factors surrounding the conclusion. I wonder if they know <em>Proton-1</em> didn’t have enough fuel to return to us. </p>\n\n<p>I hope that our brave Cosmonauts are at peace, and are not resting inside that craft. I would be too ashamed to look at them as they are buried with full honors due to their selfless service and sacrifice for the Workers. I hope they don’t ask about the fuel.</p>\n\n<hr/>\n\n<p><strong>Date:</strong> 15th of April, 1967</p>\n\n<p><strong>Author:</strong> KGB Officer Koryavin Androniki Dmitrievich.</p>\n\n<p><strong>Rank:</strong> Chief officer of the NKVD Fifteenth Directorate division deployed to Cosmodrome 3.</p>\n\n<p><strong>Log number:</strong> <em>Unknown</em></p>\n\n<p>There was nothing that could prepare us for what was inside that craft. No order from the Kremlin, no aspect of our training, and nothing outside of our imaginations could have ever conjured the interior of that craft. </p>\n\n<p>After receiving permission to open the craft on the 14th of April, we unsealed it’s doors earlier today. The seal was to prevent anything detrimental to human existence from entering the craft. I wish there was some measure to prevent us from entering the craft as well.</p>\n\n<p>The interior was immaculate. There were no signs of rations, and not even signs of the Cosmonauts having stayed in <em>Proton-1</em> at all. The only signs of life were three unused Cosmonaut suits, and Cosmonaut Władysław Bolda sitting peacefully upside down towards the bottom of the capsule. Immediately, the majority of my crew exited the craft to vomit, dry-heave, or simply stare off in disbelief. </p>\n\n<p>I alone approached Cosmonaut Władysław and it was as if the interior grew colder and more….empty...the closer I came to him. The feeling of Nothing and emptiness threatened to cause me to join my crew outside, until Cosmonaut Władysław Bolda open his….no, it’s...eyes and gently took my hand. It’s eyes were like a night sky full of stars, his face so serene, and yet a perverse feeling of horror and existential dread washed over me. This was unnatural, HE was unnatural. </p>\n\n<p>As he spoke to me, kindly and in a voice that I am certain was not his own, my eyes were awash with images and my body soaked with emotion. </p>\n\n<p>Three friends leaving. One lonely scribe. One renewal of faith.  One perfect, infinitely benevolent, and immaculate Being which was full of evil and malice; It’s self-loathing extrapolated to all existence. A chance meeting. Impossible geometries. Unperceivable letters that hurt to see, describing intent.</p>\n\n<p>His final words were: “The Void embraced us, the Void cherished us, and the Void sent us home. The Void now comes, for It wants more.”</p>\n\n<p>He promptly passed away, turning to dust that filled his Cosmonaut suit. I must relay these events to the Kremlin, and yet spare my men of any details. No one must witness that which gave me eyes like a night sky full of stars. I must keep the Void at bay. </p>\n\n<hr/>\n\n<p><strong><em>After-Action Report from deployed NKVD forces from outside Cosmodrome 3</em></strong></p>\n\n<p><strong>Date:</strong> 20th of April, 1967</p>\n\n<p><strong>Author:</strong> <em>Unknown.</em></p>\n\n<p>The entire facility has been purged of all staff, faculty, and documents except for the official project logs. The entire compound is scheduled for annihilation by air, three hours from now. The Proton-1 craft, now labelled as Proton-0, has been moved and stored into a secure location known only to the highest members of the Politburo. </p>\n\n<p>The inhabitants were extremely hostile upon our initial entry. Our casualties consists of:</p>\n\n<ul>\n<li>Eighteen dead.</li>\n<li>Thirteen injured, but able to recover.</li>\n<li>Twenty irreversibly handicap/disabled. </li>\n<li>Twelve executed in accordance with the order to purge the staff and those like them.</li>\n</ul>\n\n<p>They screamed and sung praises on first-contact, immediately dragging down NKVD comrades upon deployment. Post-battle analysis has concluded that there are far more staff bodies than there were ever actual members of the facility. At least two times as many. IDs are unreadable. Hostiles carried nothing or engineering tools, had eyes like a night sky full of stars, and possessed extensive self-harm manifested by sickening physical scarring. </p>\n\n<p>The last to be executed was a lucid man, their torn nametag reading: “ Fed-”, He appeared kind and cooperative, asking for a moment to speak his last words. As the only NKVD officer around, I humored him. He said:</p>\n\n<p>“That Void comes for us, to ingest Her kin. The Void wishes to cease being the Void.” I was immediately saddled by a nauseating headache, and a flash of images I cannot describe. Before puking, aimed to execute “Fed-”. He turned to dust before my bullet pierced his uniform. </p>\n\n<p>The Kremlin did not inform us of the circumstances. </p>\n\n<p><em>[Addendum to the initial report states that the author, Unknown, was executed shortly after the encounter with “Fed-” because of how he acted similarly to the now-dead faculty. All copies of these records are ordered to be destroyed, with the original copy being buried in a capsule in Siberia. Any monument dedicated to faculty, and/or any medal or commendation earned by faculty, have been purged from record.]</em></p>\n\n<hr/>\n\n<p>*<em>CIA Report on acquisition of Soviet Documents:\n*</em>\nOn July 21st 1969, an unnamed woman with credentials referring to her status as a high-level operative in the Soviet government interview with our late-Chief Negotiator Ted Wilson. She requested to remain anonymous, and upon granting her that privilege, she turned over the large collection of Soviet documents regarding their Space Program over to us. She stated that the information contained within was of the Highest Importance, subsequently saying “The Void cometh to consume.” At this utterance she disintegrated into dust, the only remnants of her being her clothing and one glass-eye of which the pupil was painted like a night sky full of stars. </p>\n\n<p>Shortly thereafter, late-Chief Negotiator Ted Wilson and most of his crew were mysteriously killed in their respective offices.</p>\n\n<p><em>[See top of document for filing instructions]</em></p>\n\n<hr/>\n\n<p>I don’t know what to make of any of this. I can’t believe that deliberately false documents would be kept, nor would anyone go into this detail and put forth this much effort for a series of documents they tried to ensure no-one ever read. They seem to be real and authentic, but these documents are so absurd that it makes them hard to believe.</p>\n\n<p>These documents have given me a terrible feeling of dread, which I still feel. There must be a resolution. There have to be more in these archives, I will search for them, and I will update you all with whatever accounts I find that are similar to this unsettling record, which I pray is fictional. I recall seeing a document relating to these events which seemed to be a collection of POW journal entries from Imperial Germany. I’ll find them.</p>\n\n<p>Can these be actual documents, about true events? Like, the Void is either nonsense or a metaphor right? I want to know what “Consume” means. And I hope they don’t find out I’ve been revealing these documents.</p>\n</div>\n","author":"EiplecOco"}