{"rank":"42","title":"I was disfigured in Afghanistan. But not by the war.","id":"8mtbf0","url":"/r/nosleep/comments/8mtbf0/i_was_disfigured_in_afghanistan_but_not_by_the_war/","time":"1527541002000","body":"<div class=\"md\"><p>Trigger warning: war, PTSD, death</p>\n\n<p>I was deployed to Afghanistan for my second tour on my wife’s birthday. This fact was all I could think about lying awake every every night in that unfortunate country. I cannot describe the existential frustrations that come from the days of sadness, senseless destruction, brutal heat and fatigue in that godforsaken war. This combined with the catastrophic reality of the dreaded IED (improvised explosive device). And of course, the creatures. Swarms of insects, camel spiders, sand flies, snakes, and scorpions. You’d find them in your clothes, your boots, or on your floor and they’d scatter in the night when you turned on a flashlight. But at least I was safe from those fucking IEDs in our camp.</p>\n\n<p>My troop lived in a small, burnt-out schoolhouse in a small village southeast of the capital of Kabul. The province we occupied was ravaged from months of insurgent fighting. Most villagers fled, but a few remained behind and stayed mostly indoors to avoid roaming groups of Taliban patrolling the area, looking for food or “donations” to “charity.” Those that refused to help - or worse - were identified as cooperating with Afghan National or American forces were beaten or even killed. Even the young people stayed at home. Although we encountered the almost daily harassment of small arms fire, the peppering of bullets hitting the walls of the schoolhouse, the nights were eerily calm. Local insurgents had imposed a strict curfew on everyone in the area, even themselves, from six in the evening until morning prayers.</p>\n\n<p>The Taliban terrorized the locals, and the presence of foreign troops only aggravated the fighting. Assassinations and kidnappings became daily news, in addition to an increasing number of victims being caught between the fighting between Afghan National Security Forces and insurgents. To counter the expansion of government presence, anti-government elements used targeted killings to intimidate local influential elders. This deliberate targeting of civilians led to an increase in suicide attacks, IED attacks, and assassinations. It was the last type that took the life of a highly-esteemed member of the High Peace Council one fateful day, gunned down inside his own home. The attack ripped apart his body, but his face was left perfectly, peacefully even, intact.</p>\n\n<p>The killing caused an uproar. Being a distinguished leader in the village, it was of the utmost importance to the residents that his body be prepared for a proper religious burial, a challenging task as there was no longer anybody left at the health clinics or mosques. The local coroner, a religious man, had fled to Kabul months previous to the attack. In a brave effort of goodwill, my troop decided to make the dangerous trek to Kabul to send for the coroner. The journey would take at least ten hours by combat vehicle, and the men decided it would be best to sneak out after nightfall during curfew. There was just one thing: somebody had to stay behind to guard the corpse. Being terrified of a possible IED attack along the way, and not particularly bothered by the sight of a dead body (I was comfortable with death at this point) I volunteered to stay behind. Besides, I had a flask of low-grade, locally-made contraband liquor to keep me company. </p>\n\n<p>There is a strong superstition of witchcraft among the local tribe the deceased man had belonged to. To be fair, it isn’t locally referred to as witchcraft, but this is the best cultural translation I can offer. There is an ancient belief that local witches rifle graves and funeral pyres in search of bones, and cut pieces of flesh from unburned corpses to use for blasting their neighbors’ lives. And that some of these old sorceresses, the moment they smell death anywhere about, hastily mutilate the corpse before mourners even arrive. It is said that these witches even have the power of changing their shape: they turn into spiders or mice or snakes, or even flies- disguises they can use for stealing flesh. Most of us would recognize this as symptoms of normal decomposition, but this superstition held strong in this particular region. For this reason I was tasked by the locals to watch attentively the whole night. I promised to fix my eyes on the corpse without even a sideways glance. I respected the locals and wanted to grant them what little peace I could. The guilt I felt being involved in this war constantly overwhelmed me. Here was an opportunity for penance. </p>\n\n<p>The man’s widow, one of the only women left in the village, led me into the man’s room, where she showed me the corpse lying on a slab and wrapped in an off-white linen shroud. After a fit of weeping, she called in a man as a witness. Together, as if taking inventory, they examined the features of the man’s face to record that it was undamaged. Then they left me alone in the room with nothing but a large lamp for the evening. All alone with the corpse, I fortified my eyes for the vigil by rubbing them hard and kept up my spirits by talking to myself between pulls on my flask. Twilight turned into night, and night grew deeper and deeper, blacker and blacker, more quiet and then silent, until my usual bedtime had passed and midnight approached. I had only been a little uncomfortable at first, but after some time passed I began to feel thoroughly frightened. Perhaps my mind was playing tricks on me, as it often did these days. </p>\n\n<p>At one point in the evening, a small desert mouse squeezed in through a hole in the door, stopped near me and fixed its gaze intently on mine. The boldness of this stupid little mouse was disconcerting, but I quickly shooed it away. Sometime after this, a sudden and deep sleep took over me and dragged me down into a bottomless dark gulf of sleep. This was the deepest sleep I had experienced since enlisting in the war. Usually my mind was so frantic I could barely sleep. I don’t even know how to describe it to you, I had clearly been running on a deficit up until this point and my body finally just crashed. I didn’t dream at all. I felt nothing at all. If someone had walked into the room right then they couldn’t have readily discerned which of us two was the corpse; the body on the slab or my body passed out on the floor. It was almost as though I had actually died and my corpse had been left without a guardian. </p>\n\n<p>Many hours passed like this and I finally woke up to the sun rising and the sound of morning prayers. Quickly remembering my post, I rushed to the body in a bit of a panic. I pulled back the shroud and examined the corpse’s face closely. To my huge relief I found it untouched. No bugs or creatures had gotten to it the night before in my stupor. A short time later the man’s widow came into the room, still weeping, with the witness behind her. She threw herself onto the man and after kissing him tenderly, brought my lamp close to his face to make sure all was well. Delighted with my loyal services, she turned to me to express her gratitude. Before she could gesture,  a terror take over her face. The woman screamed and turned away from me. In my confusion I put my hand to my face. It felt like wet, ground meat. Somehow, in my deep sleep, I hadn’t noticed sand flies eating at my face, completely disfiguring me. Today, it looks like I’ve suffered third-degree burns caused by enemy gunfire or an explosion. I never tell anyone the horrible truth of my wound, which haunts me to this day.</p>\n</div>\n","author":"BastaniUsername"}