{"rank":"1255","title":"I work at a hotel. Last night, everyone on floor 4 disappeared.","id":"8mtdzk","url":"/r/nosleep/comments/8mtdzk/i_work_at_a_hotel_last_night_everyone_on_floor_4/","time":"1527541602000","body":"<div class=\"md\"><p>I work the night shift at the Southfield Inn. Other than handling late check-ins, I’m supposed to keep an eye on the security footage. I’ve seen my fair share of “strange” occurrences – drunk kids trying to break into the pool area at 2 am, a sweet little old lady having sex with her husband in the elevator.</p>\n\n<p>But nothing like last night.</p>\n\n<p>At around 3:30 am, while microwaving dinner, I checked the security cams. To my surprise, there were two people – a man and a woman – getting on the elevator. The man was wearing a tattered leather jacket and black gloves. The woman had blonde hair and pink lipstick. She looked like she had been crying for hours, mascara and red ringing her eyes.</p>\n\n<p>He pressed the button for floor 4.</p>\n\n<p>I switched the camera to 4. The elevator doors slid open, and they stepped out into the hall. Blondie still looked miserable, and Leather Jacket had his arm looped around her hips as if he owned her.</p>\n\n<p>He gestured to one of the doors to his left.</p>\n\n<p>And that&#39;s when I realized –</p>\n\n<p>Every single door was open.</p>\n\n<p>Now, we have self-closing doors, so someone must have propped the doors open – or been holding them that way. The lights were off in each room, and the dark doorways stretched down the hallway, seeming to never end.</p>\n\n<p>Blondie and Leather Jacket walked down the hallway. He was saying something to her, and she was slowly nodding, but I couldn’t tell what.</p>\n\n<p>Now, I knew some of those rooms were occupied. So why weren&#39;t they <em>doing</em> anything? Why weren&#39;t they fluttering around in confusion, asking who the hell opened their door at 3:30 am?</p>\n\n<p>But I didn&#39;t have much time to wonder.</p>\n\n<p>Because the lights flickered, and then went out.</p>\n\n<p>The screen was black.</p>\n\n<p>My heart was pounding, now, so loudly that I could hear it in the silence of the room. I shook the mouse with sweaty fingers, as if that could somehow prod the lights back on.</p>\n\n<p>Finally, they flicked back on.</p>\n\n<p>All the doors were closed, now.</p>\n\n<p>But now Leather Jacket was carrying something. A small bag. It must’ve been filled with something heavy, because he leaned to one side as he continued down the hallway.</p>\n\n<p>They got back in the elevator. Blondie was sobbing, now, her head in her hands. He turned to her, and began talking. I turned on the microphone, and listened:</p>\n\n<p>“… done now. All we gotta do is take care of the girl at the front desk, and destroy the security footage.”</p>\n\n<p>The blood drained from my head.</p>\n\n<p>And then I bolted up. I ran out of the hotel, into the darkness. In front of me stood Route 52, still as a country path; the neon lights of the town below shimmered, like twinkling little stars.</p>\n\n<p>I ran towards the town. At the 24-Hour-Diner, I called the police.</p>\n\n<p>---</p>\n\n<p>When they got there, Blondie and Leather Jacket were gone, as was the security footage.</p>\n\n<p>And every single person who occupied floor 4 was missing. The loud family on their way to Disney world. The Don Juan and his two lady friends. The old lady with the dog, and the Metallica guy with the loud headphones.</p>\n\n<p>All vanished.</p>\n\n<p>They did find one thing, though.</p>\n\n<p>A Southfield napkin. Written in pink lipstick were the words:</p>\n\n<p>&quot;HELP ME&quot;</p>\n\n<p>And below it, an <a href=\"https://www.facebook.com/scaryblair\">address.</a></p>\n</div>\n","author":"BlairDaniels"}