{"rank":"0","title":"The worst Tuesday night ever","id":"8mtfan","url":"/r/nosleep/comments/8mtfan/the_worst_tuesday_night_ever/","time":"1527541916000","body":"<div class=\"md\"><p>First of all I’d like to thank all of you.  I’m glad you’ve all been enjoying my entries and made the Nighter Life Blog so popular!  When I first started this blog, I just knew there were others like me out there, I just didn’t realize there were so many of you!  Now I know I’m not alone out there in the Nighter scene and the 2015 Meet-n-Greet was a huge success.  Sure Chuck E. Cheese may not seem as fun at 3AM to other people, but you’re still in their parking lot and you can ogle the cool attractions inside.  Besides, warming their pizza on our car engines made it taste much better.</p>\n\n<p>Sadly, fellow Nighters, I have to tell you about the absolute worst Tuesday night I’ve ever experienced.  This may be a bit of a long story, so grab yourself some coffee, a snack, strip to your underwear and prepare your eyes for the horrors I’m about to tell you.  Yeah, it was really that bad.  Just because I’m a Nighter doesn’t mean I can’t have a bad “day”, as I’m sure you have experienced as well.</p>\n\n<p>This all started when I was startled out of bed at 5PM by my neighbors in my apartment building getting home.  Come one!  It’s 5PM!  People are trying to sleep, am I right?!  I don’t care if you’ve been up for hours, I have not.  Walking around echoing halls while laughing and having a conversation is completely unacceptable this early and it instantly put me in a bad mood.  I tossed and turned for almost an hour, but couldn’t get back to sleep, because I could hear people cooking and honking in traffic outside.</p>\n\n<p>“Fuck it!” I figured and threw the covers off of me.  I wasn’t going to be able to sleep, so I get into the kitchen to make myself up some coffee.  Well, fuck my life because I was out.  Being as groggy as I was this early I didn’t feel I would be safe to drive to get some more.  After all, I don’t normally get up quite this early, especially after not being able to sleep.  Instead I decided to make some tea.  Only problem is, I only had iced tea bags, so the flavor was…well…it tasted okay, I guess, but it was just sort of <em>meh</em>.</p>\n\n<p>Since this was my Saturday  I didn’t have to work.  I clicked on the TV and saw all the early news broadcasts.  I hate early news broadcasts, though.  They’re too long and never get to the point.  That’s why I like the late broadcasts shown around 6AM.</p>\n\n<p>Time was fast approaching to get out of the house and have some fun!  Being a fisherman myself, I grabbed my fishing poles and head out for some mid-early fishing!  Catfish and carp are active during this time, as well as massive walleye, and the moon was full.  Thanks to that cancer causing fireball in the sky from earlier, the temperature was lovely.  Hell there wasn’t even a chilling breeze.  I managed to get some beer  before the day walker catered/Nighter biased store closed.</p>\n\n<p>As I said, the weather was perfect.  My beer was chilled and my line was in the water.  The best part of this was no one else was on the lake.  I know…you’re wondering why this was the worst Tuesday night…I’m getting to that.</p>\n\n<p>Well, just so happens the lake wasn’t empty for very long.  A bunch of teenagers showed up to party on the shore a little way down.  These weren’t Nighters, these were just kids on summer break looking to get shit faced.  Well, their bonfire was so bright, my retinas are actually damaged!  On top of that, my skin turned red from glow.  Sure I put on enough sun block to sit under a full moon, but the bonfire was so out of control, my defenses failed.</p>\n\n<p>Being done with their rude interruptions, I decided to pack up my things and move down the shore to a more secluded spot.  While I was looking for a new spot, thanks to my damaged eyes from the light, I fell into a deep pothole and twisted my leg.  Did the teenagers help?  No, they mocked my screaming and turned up their music!  I swear they were implying I was complaining about their music choice, when in reality I needed help.  So, for two hours I drug myself through the mud, dirt, and grass towards the road.  When I finally reached it, a Nighter squirrel, for lack of a better name for it, must have believed I was an invader in their territory and repeatedly bit my face.  Lying on the ground, beaten and bitten, the squirrel decided to pee in my eye socket as one last insult.</p>\n\n<p>“How can this get any worse?!” I thought to myself.  Turns out…when you’re on the ground in a dark area and a car is traveling at approximately sixty miles an hour, you’re hard to see.  The car ran over my left out stretched hand with both the front and rear passenger side tires!  Screaming once again, both blood and squirrel piss running down my face, I was suddenly illuminated by  bright light.</p>\n\n<p>“Oh, thank you god!” I thought and shouted out loud, believing I was to be saved.  No.  If you remember from KickleMcGickle’s post about a month ago, there have been many sightings of strange objects in the sky at night here.  I can testify now these sightings are all absolutely true!  Before my very pee stained eyes an alien vessel descended down upon me and used some kind of light beam to get me on board.</p>\n\n<p>Now, I don’t remember what happened between floating up to the ship and suddenly being inside, but when I woke up, I was completely naked.  I don’t mean to brag, but given what I bring to the party, I’ve never been too worried about being naked in front of anyone…or anything.  These things must have been wearing space suits, because I couldn’t really make out any features except what people must think are their large eyes and small nose and mouth.  There’s no way this was their skin.</p>\n\n<p>I couldn’t understand what they were saying, but one of them helped me off the table and motioned for me to follow.  It’s not like I had a choice or anything, though.  So, with my dork on full display, I walked down a few hallways, seeing many other people and animals in strange rooms.  We finally got to a room which had several strange shapes, I assume their language, and what looked like two aliens screwing.</p>\n\n<p>“Well, at least it shouldn’t be too bad!” is what I thought entering in.  There were aroma therapy candles, a large bed with what seemed to be silk sheets, and Barry Manilow music playing.  Look, I know what you’re thinking, but the sexy lighting, smell of the candles, and Barry Manilow singing gave me an instant, very impressive boner.  This seemed to make the alien happy, because it jumped back a bit and started clapping.</p>\n\n<p>Again, I know you’re wondering how this still turned into the worst Tuesday ever.  I’m getting to that.</p>\n\n<p>Thinking I was about to get some hot human on human or human on alien sex action, I walked to the bed and sat down with one leg up, letting my huge dong be on full display.  The alien left and I heard the door lock.  At this point I didn’t know what to think.  A tone sounded, followed by alien chatter, and a hole opened on the wall too high for me to use as a glory hole.</p>\n\n<p>Guess what?  It wasn’t a glory hole anyway.  From the hole the same god damn squirrel which bit my face and pissed in my eye came flying through and landed on the table in the middle of the room.  “What the fuck?” I asked out loud.  The alien chatter came through, but I didn’t understand.  After being yelled at a few times,somehow I was administered several shocks around my butt and genitals.  As I got closer to the squirrel the voice began demanding something again.</p>\n\n<p>“I’m not fucking a squirrel!” I screamed.  Once again I was shocked, more violently than before, and the squirrel seemed to be hypnotized and presented itself to me.  At this point I was balling my eyes out and the voice was screaming while I got shocked.</p>\n\n<p>For six hours I was forced to have sex with that squirrel.  I was only allowed fifteen seconds to drink a sports drink between screwing sessions, which lasted a minimum of twenty minutes a piece.  The hard and more erotic I made it seem while I had sex with the squirrel, the less I was shouted at, so that’s what I did.  Collapsing on the bed after six hours of sweaty squirrel sex, I passed out.</p>\n\n<p>When I awoke, it was Thursday!  I woke up in my own bed at 7PM.  I had marks on my face and pink eye from the piss.  I cried all day yesterday and today, even as I type this to you all.  The worst part of all of this is I had a knock on my door extremely early today, around 1PM.  I was served legal papers for a DNA test in regards to paternity!  The issuer wishes to remain anonymous until I provide the sample, but I have a feeling it’s that fucking squirrel!  Bitch already had my nuts and now it wants everything else!</p>\n\n<p>So…there you have it…my absolute worst Tuesday night of my life…and this comes on the tail of getting locked inside a full porta-potty in the middle of a mosh pit with it getting tossed around at a Limp Bizkit concert!</p>\n\n<p>---------</p>\n\n<p><sup>Used with permission from</sup> <a href=\"https://sunrie.wordpress.com/2015/05/29/the-worst-tuesday-night-nighter-life-blog/\" rel=\"nofollow\"><sup>sunrie.wordpress.com</sup></a></p>\n</div>\n","author":"croidhubh"}