{"rank":"0","title":"the creepy ghost in my house","id":"8mtp63","url":"/r/nosleep/comments/8mtp63/the_creepy_ghost_in_my_house/","time":"1527544206000","body":"<div class=\"md\"><p>when i was younger i lived in a apartment called west Dixie Towers. i remembered when me and my mom first walked into our room #517 it was cold...just plain cold. no AC was on or nothing just COLD!! we were walking around looking at the rooms and when me and my mom walked into the bathroom we saw voodoo equipment&#39;s. we saw a cup that had black stuff that smelled so weird, my mom threw it back were she found it and told me not to touch it or else! since i was about 8 my curiosity took over my mind. when i was walking out, there was this room it was soooo dark and in front of it was another room i was too scared to open it so.. i called my mom and told my mom to open it. when she opened it i saw the bathroom? why was i so scared to open the bathroom? hmm i shaked it off and kept walking. when we left i felt like someone was watching me. i turned around and saw nothing.</p>\n\n<p>...</p>\n\n<p>when we moved in strange stuff began to happen. i saw shadows and heard things that was hard to explain. one day i woke up early to watch anime on sfl. i walked out the room with my red blanket rubbing my eyes. when i reached the end of the hallway a tall man appeared walking past me so fast. my heart stopped. i turned to my right i saw nothing. the silence i was experiencing was driving me insane. i ignored it and i opened my TV and i was watching my favorite show.  a couple mins later a heard a noise. it was my sister&#39;s barbie phone that hasn&#39;t worked for a whole month. when i went into the kitchen i didn&#39;t see nothing so i ran and i slammed the door. as soon as i slammed the door shut a chain saw started to go off. coincidence i think not. </p>\n\n<p>...</p>\n\n<p>every night i saw a tall shadowy figure in the corner of my room. i was to scared to move, i usually covered my head and i left a little hole for me to breathe. this figure would move, knock stuff around and say words that i couldn&#39;t understand. earlier that month i was diagnosed with schizophrenia which i didn&#39;t fully understand but it made sense why i was hearing all these voices. one night... probably the worst night of my life...it was about 2:06 Am and i was staring at my opened closet and door. the problem was i couldn&#39;t move. my whole body was paralyzed and i was crying. a few seconds later here comes the shadowy figure but this time he was right in front on my bed. like usual he stood there speaking languages i couldn&#39;t understand. only the lord knew how scared i was. the shadow came closer like it was sitting on top of my chest. i was staring at the blackness of its face screaming inside. this lasted about 4-5 minutes till i finally moved. again the silence in the room was killing me so i got up closed the closet door and my door opened the light and TV and fell soundly asleep.</p>\n\n<p>...</p>\n\n<p>the day i left the apartment i was about 12. i spent 3 years in the apartment..which was scary. i was walking outside putting my stuff in the car and i looked up at my balcony cause i felt like someone was watching me and i saw that same shadowy figure that was in the corner of my room waving at me. and there i stand speechless at what i saw.</p>\n\n<p>...</p>\n\n<p>i won&#39;t ever forget what went down in apt #517</p>\n</div>\n","author":"chaica123"}