{"rank":"10","title":"Window","id":"8mtulh","url":"/r/nosleep/comments/8mtulh/window/","time":"1527545479000","body":"<div class=\"md\"><p>Have you ever had something happen, that&#39;s completely changed your view of reality? Yeah, probably not. You&#39;ve probably been drifting along your entire life, completely unaware of what goes on outside of your very small plane of existence. No offense, of course.</p>\n\n<p>Well, unlike you, my life just changed for ever. Now, I&#39;ve never been a believer in the paranormal; I&#39;ve never believed in monsters, and I sure as hell don&#39;t believe in ghosts. Now though, I can tell you that I still don&#39;t. I don&#39;t know what that thing was last night, but it definitely wasn&#39;t a ghost, and I don&#39;t think it was paranormal. No, it was something <em>different</em>.</p>\n\n<p>Anyway, on with my story. Last night, I was trying to go to sleep, and as always, thanks to my infernal insomnia, I couldn&#39;t. I tossed and turned, I removed covers, and five minutes later, I piled them back on. I even got up and drank a glass of warm milk, but that did nothing. I stared out of my window for a solid five minutes, watching the trees. I got out of bed and opened it, but sadly, no breeze was blowing. I closed it not long after.</p>\n\n<p>I couldn&#39;t find my cat, so I walked down my stairs, opened my door, and walked out. He was one of those inside-outside cats, always running in and out. Okay, this is completely off topic, but his name is Clovis, after that one French guy. First king of the Franks or something, I don&#39;t really know. I just liked the name.</p>\n\n<p>This is where it starts to get weird. As I was walking, I got this feeling. It wasn&#39;t the feeling of being watched, but it was close. It was more the feeling of being, I don&#39;t know, noticed? Have you ever felt that? It was weird as hell. It was almost comforting, really. It felt vaugely like a mother&#39;s watchful gaze, the kind that she&#39;d give you back when you were young and playing near a road. Cautious, but loving.</p>\n\n<p>Actually, it didn&#39;t feel like that at all. It felt like it wanted me to feel that way. It felt like the illusion of love. The closest thing I can use to describe it is an angler fish. They use their light to make you feel safe, and then murders you, with no remorse. Yeah, it was like that.</p>\n\n<p>Thankfully, I didn&#39;t pay it much attention at the time. I&#39;ve never been very observant. Not long after, l spotted my cat. He was always really easy to find. Clumsy, you know? I&#39;d be searching for him, and he&#39;d fall out of a tree right by me. He was also easy to spot because of his color scheme; he was orange and white, so he stuck out like a thumb that was leaking pus. Or one that has herpes, I can&#39;t really remember that simile.</p>\n\n<p>Back on topic, I picked up my cat, and headed to my house. He really hadn&#39;t gone that far, so I had returned before long. I opened the door, and as soon as I did, he scratched me and jumped out of my hands. He never was very friendly, but I loved him nonetheless.</p>\n\n<p>I knew I wasn&#39;t going to get any sleep that night, so I grabbed a Soda and sat down on my couch. I turned on the tv, and took a healthy drink. They say that stuff isn&#39;t good for you, but oh well. I&#39;m gonna die someday, right? </p>\n\n<p>As I was sitting there, I got that feeling again. I sat there, experiencing it for a good while, wondering what was causing it. I was zapped back into reality by a banging from upstairs. I assumed it was just my cat, until I saw him walk in from my kitchen, meowing. I started to get a little creeped out.</p>\n\n<p>Now, I&#39;ll admit I did the stupid thing. I should&#39;ve ran outside and called the police, but instead, I grabbed my cat and ran upstairs. Now, I know what you&#39;re thinking. &quot;You stupid bastard! You&#39;re supposed to run AWAY from the danger, not towards it!&quot; Well, all I have to say to that is,  &quot;Uh yeah. You&#39;re completely right.&quot;</p>\n\n<p>Ignoring my obvious stupidity, and moving on with my story, I got upstairs, and saw nothing. Everything was exactly as I left it; my bed looked exactly the same, and my window was still open.</p>\n\n<p>I&#39;ll admit it took me longer than it should&#39;ve to notice what was wrong. <em>My window was open.</em> The first thing to go through my head was, &quot;Well, I&#39;m fucking dead.&quot; I&#39;m fairly certain I even said that out loud. </p>\n\n<p>It was at this point, that I finally did the smart thing, albeit much too late. I booked it down the stairs. I didn&#39;t make it too far, probably the second step from the top, when I felt whatever it was tear through me. It was sharp, and it stabbed straight through my back.</p>\n\n<p>I know, I&#39;m leaving a very important question unanswered. If I&#39;m dead, then how am I writing this? Well, if you really want to know, I&#39;m right outside your window. All you have to do is open up and ask.</p>\n</div>\n","author":"CigoNoka"}