{"rank":"48","title":"The Reason For An Ear Ache","id":"8mturz","url":"/r/nosleep/comments/8mturz/the_reason_for_an_ear_ache/","time":"1527545530000","body":"<div class=\"md\"><p>I get a lot of ear aches. I used to swim and would get swimmer&#39;s ear. I make more wax than most people and that can hurt. If I don&#39;t have a couple of ear aches per year, it&#39;s weird.</p>\n\n<p>So when I got an ear ache in both ears, it sucked, it hurt, but I just called the doctor and made a same-day appointment, no big deal.</p>\n\n<p>He looked in my ears and said he couldn&#39;t see anything because of the wax. So he sent in the nurse, and she spent fifteen minutes per ear trying to clean it out with warm water from a spray bottle. It did not come out - just a few bits and pieces of wax here and there.</p>\n\n<p>We set an appointment two weeks out for an ENT, and I headed home and picked up some ear cleaning stuff.</p>\n\n<p>Two or three times a day, I squirted the recommended 8-10 drops in each ear, letting it buzz and fizz for half an hour. I&#39;d lay on one side, do that ear, and then switch.</p>\n\n<p>Unable to hear clearly, I would occasionally have my left ear &#39;pop&#39; and be able to hear from it. But my right ear remained entirely muffled. And I began to hear... things. And even feel things.</p>\n\n<p>It sounded like little legs. If you&#39;ve had issues with wax and ear aches, you&#39;d know hearing something &#39;moving around&#39;, even feeling it, isn&#39;t uncommon. It&#39;s just an illusion, and it&#39;s just the natural stuff in your ear. So even if it was giving me a little trouble sleeping at night, I knew it wasn&#39;t a big deal.</p>\n\n<p>Two weeks passed, and my ears weren&#39;t clear. It was time to see the ENT. I headed out for the appointment, and was excited for them to scoop out the wax so I could finally hear.</p>\n\n<p>I knew something was wrong when they checked my right ear. I felt a sharp pain, heard and felt something scurrying around, and the doctor&#39;s expression was... not good. But he just took a deep breath and checked my other ear. All he did for my other ear was quickly scoop out the wax, and suddenly I could hear properly.</p>\n\n<p>But the other ear he called an ambulance for.</p>\n\n<p>They took me to the hospital where I had emergency surgery, silently panicking until they applied general anesthesia. I had no idea what was going on, and I was absolutely terrified.</p>\n\n<p>When I woke up, my ear was bandaged over. it was blessedly silent, and I couldn&#39;t feel anything moving.</p>\n\n<p>I was told the story by a nurse. The ENT, when looking, couldn&#39;t tell what kind of bug it was and didn&#39;t want to risk scaring me more. But it was an earwig, they had discovered as they pulled it out. It had actually bit into my ear drum proper, as well as the skin. The wax had prevented it from escaping, and ultimately it had decided my ear was a good home, even if it was half-starved. A good enough home to lay eggs in, even.</p>\n\n<p>As they were pulling it out, some of the eggs broke and hatched, creating even more problems. What should have taken one, maybe two, hours took six, and it was a miracle I didn&#39;t wake up during.</p>\n\n<p>But the nurse admitted something else to me, one of the reasons I have a follow-up appointment in another two week.</p>\n\n<p>They may not have gotten all of the eggs or babies out.</p>\n</div>\n","author":"Kunabee"}