{"rank":"29","title":"Case #7- The Village of Lost Souls- Part 7","id":"8mtxu5","url":"/r/nosleep/comments/8mtxu5/case_7_the_village_of_lost_souls_part_7/","time":"1527546271000","body":"<div class=\"md\"><p><a href=\"https://www.reddit.com/r/nosleep/comments/8m6dnm/case_7_the_village_of_lost_souls_part_6/\">Part 6 can be read here.</a></p>\n\n<p>We tried for three days to convince Mark to hear us out. He stopped taking our calls on the third day, so we went to his house. We couldn’t respect his wishes to stay away, not with his life at stake. When he didn’t answer the door after we knocked, Moxxy took a tool kit from her bag and went to work on the lock. I kept watch for any nosy neighbors or approaching pedestrians.</p>\n\n<p>“Got it.” Moxxy put her tools away and opened the door. We went inside, relocking it behind us. “Hey, Mark? Emily and I are here. The door was open so we let ourselves in. Don’t shoot us or anything, please.”</p>\n\n<p>There was no response. I scanned the house’s energy and found there was a lot more darkness than there used to be and I fear for Mark’s well-being. We checked his bedroom and my fears were confirmed.</p>\n\n<p>Mark lay fully clothed on his mattress, staring at the ceiling, blinking slowly. He’d lost a noticeable amount of weight over the last three days and his skin was paler than it used to be. His aura matched that of his mother’s days before her death. That didn’t make sense; it took weeks of sickness for William and Jane Neil to get to that point. Without Larson to reign it in, was our foe being faster or more aggressive in its attack? If that was the case, Mark didn’t have much time before he succumbed too.</p>\n\n<p>“I’m going to check the house. You stay with him, okay?” Moxxy left the room. I heard her footsteps echoing through the house as she went from room to room. It seemed wrong somehow. The house was too empty.</p>\n\n<p>“Emily?” Mark’s voice was weaker and slower than it usually was. He looked at me like he wasn’t sure I was really there. “I’m sorry for yelling at you.”</p>\n\n<p>“It’s okay. You had a good reason too.”</p>\n\n<p>“I see Dad every night now. Mom too. Mom never leaves though. No one came to take her body. I meant to call someone but…” Mark’s face screwed up in concentration. “I can’t remember.”</p>\n\n<p>Mark’s words sparked something in my brain and all the clues we’d collected since arriving started to come together into a theory. A mad, impossible theory.</p>\n\n<p>Moxxy returned to the room, looking shocked. “Em, the basement.”</p>\n\n<p>I followed her to the basement, where we saw what can only be described as a nest. Clothes, garbage bags, shredded cardboard boxes, and all manner of clutter was piled up in the center of the room. And from the side of the pile, a foot stuck out. I went to the pile and removed things, one by one. When I was finished, the face of Mark’s mother was exposed. Her eyes were open and fixed on mine. They were dead no longer. I knew what I was going to see when I peeled her upper lip back.</p>\n\n<p>“Holy fuck! I knew it!” Moxxy was in awe behind me. “It’s vampires! They’re real! They’re really real! Wait til I tell Jacob, he’s gonna shit!”</p>\n\n<p>“So Larson’s binding spell wasn’t for a demon or a spirit. It was to control vampires. That’s why the victims wasted away so slow. Vampires were feeding on their blood, a little bit at a time. Mark’s gotten worse way faster because he has two of them feeding on him at the same. Maybe even more than two.”</p>\n\n<p>“How many do you think there are?”</p>\n\n<p>I thought for a moment. “William and Jane for sure. It’s probably safe to assume Tony Gillespie. And at least one more, the one sleeping under Kingston Mortuary. The original. I think it’s Wren.”</p>\n\n<p>“I remember reading that before vampires became all Hollywood, people used to believe that certain people were predisposed to becoming vampires. That must be the darkness Kingston was talking about, the one inside Wren.”</p>\n\n<p>A cold feeling spread through my stomach. “The first settlement. They found everyone in a mass grave. What if it wasn’t a grave? What if it was a nest?”</p>\n\n<p>“That would explain why Reverend Kingston burned them all. Hey, Larson was killed too. Do you think he’s one of them now?”</p>\n\n<p>I shook my head. “The police report said he was ripped to pieces. I think he’s too far gone.”</p>\n\n<p>“So… what do we do now?”</p>\n\n<p>It was obvious we had to destroy them, but what wasn’t clear was how. The original vampire stories had been so twisted and perverted through literature and film that it was impossible to know what was myth and what was reality. “You’re the vampire lover. You tell me.”</p>\n\n<p>“Well, I’ve read about a lot of different methods people used to kill vampires. Dismemberment was popular. They’d cut off the head and the limbs and tie everything in a sack and burn it or throw it in a river. Some people staked them through the heart, cut off their heads, and stuffed their mouth with garlic. And then sometimes people just flipped them over so they’re facing down in their coffins. I’m not sure what’s going to work and what isn’t.”</p>\n\n<p>“Can we just burn her?” I gestured to the thing that used to be Jane.</p>\n\n<p>“We could, but it’s risky. I’ve read about vampires coming back from that. I mean, look at Kingston Mortuary. It burned down but there’s still a vampire under it. I think we’re going to have to get our hands dirty, no matter what we do.”</p>\n\n<p>“Fuck. I was afraid of that.”</p>\n\n<p>“I’m going to go look in the garage for things we can use. You better go talk to Mark.”</p>\n\n<p>I returned to Mark’s room and explained what was going on. He listened in silence and by the time I was finished, tears were streaming down his face. “So that’s why I’ve been seeing Mom and Dad every night? Why I can’t hear their ghosts talking? They’re killing me.”</p>\n\n<p>“I’m going to save you, Mark. I couldn’t save your mother but I can save you.”</p>\n\n<p>“Mom’s still in the house. What are you going to do to her?”</p>\n\n<p>“We can’t just leave her. You understand that, don’t you?” My voice cracked and I tried to keep myself together. It was important not to break down, at least until I wasn’t around him anymore. “Moxxy and I will figure something out. You shouldn’t be there for it.”</p>\n\n<p>He nodded slowly. “I understand.”</p>\n\n<p>I helped him out to his car. Once our work in the basement was finished, we’d drive him to the hospital. Moxxy returned from the garage with a host of items: a tarp, an axe, a hunting knife, a garden stake, dish gloves, and a roll of garbage bags. Once everything was set up, we rolled the vampire (I refused to think of it as Jane) onto the tarp. Moxxy did the heavy lifting, so to speak, severing the head and chopping the limbs into manageable pieces while I sorted the body parts by bag. There was surprisingly little blood. It was like the vampire’s body was dried up inside.</p>\n\n<p>When she finished with the limbs, Moxxy took the hunting knife and opened up the torso from the belly. She used that incision to get at the heart, bypassing the rib cage altogether. Once she’d cut the heart out, she drove the garden stake into it. “You know, after that whole mess with the jellyfish and that Elder thing, it’s almost nice to be able to deal with a problem through good old-fashioned manual labor.”</p>\n\n<p>“I’m sure we’ll look back on how nice it was when we’re sitting in a jail cell.”</p>\n\n<p>“Don’t be so sure. I’ve got a plan for that.”</p>\n\n<p>We packed away the garbage bags full of incriminating evidence in the trunk of Mark’s car and drove him to the hospital. Once he was admitted for an overnight stay, we stopped by a nearby river. Moxxy weighted the bags down with stones and we threw them in, minus one of the feet. That we took to Larson’s house and buried in his backyard. The police would investigate Jane’s disappearance eventually and it wouldn’t hurt to have Larson take the fall (especially since the whole thing was his fault to begin with). Hopefully Mark’s hospital stay would be enough of an alibi for him.</p>\n\n<p>“Sun’s going down,” Moxxy said. “We should probably call it a night. How do you want to get the rest of them?”</p>\n\n<p>“I’ll see if Donnie can get us an exhumation order or something for William and Tony. In the meantime, we should pay a visit to the Gillespies tomorrow, see if their son has been visiting them. Wren’s going to be the difficult one to get to. She’s buried under the mortuary.”</p>\n\n<p>“We’ll figure it out. We always do!”</p>\n\n<p>I wished I shared her optimism.</p>\n\n<p>(Case #7 will <a href=\"https://www.reddit.com/r/JacobMielke/\">continue in an update.</a> Updates are posted every Monday, Wednesday, and Friday. Mielke Investigations is an <a href=\"https://www.facebook.com/jacobmielkeswriterprofile/\">ongoing account.</a> )</p>\n</div>\n","author":"JacobMielke"}