{"rank":"5","title":"Her Imaginary Creep","id":"8mu3jm","url":"/r/nosleep/comments/8mu3jm/her_imaginary_creep/","time":"1527547639000","body":"<div class=\"md\"><p>&quot;Laura, come get your lunch!&quot; I called to my daughter, who was currently playing upstairs with her toys before school. </p>\n\n<p>I heard her feet thump down the stairs with joy after grabbing her bookbag. &quot;Coming dad!&quot; She said with glee before running to the kitchen. </p>\n\n<p>Waiting patiently, I held a paper bag out for her to grab, which she did the moment she seen me. &quot;Hey, be careful out there alright? I don&#39;t want you to get picked up when no one is there to help,&quot; I said gently to her.</p>\n\n<p>Laura sighed and nodded, but she knew what I was talking about. I gave her a hug filled with care before taking her to the front of the house.  There, Laura waited in excitement as she rocked back and forth while waiting for the bus to come.</p>\n\n<p>&quot;When you get back, we&#39;ll watch some sports together,&quot; I said to her as the bus pulled up with a screech. &quot;Then you&#39;ll tell me about your day.&quot;</p>\n\n<p>Laura nodded and gave me a quick hug. &quot;Alright, but don&#39;t start a game until I get home,&quot; she said and ran to the bus to start her third grade year. </p>\n\n<p>I let out a deep breath, watching her leave. The day seemed to go by fast as my boss let me out of work early to meet my daughter. My job was a cashier at a nearby fast food place. I didn&#39;t make a lot, but it put food on the table so I didn&#39;t mind. </p>\n\n<p>Returning home, I picked up my phone and called Laura&#39;s mother, who was on vacation with some people from her work. &quot;Hey Marcus, I wasn&#39;t expecting you to call this early,&quot; my wife said to me from the other line. </p>\n\n<p>&quot;Yeah, well I didn&#39;t expect it either. David let me off early so I thought I would talk to you on the phone while I had the chance,&quot; I replied as I began making myself something to eat. </p>\n\n<p>&quot;I&#39;m sorry sweetie I have to go, but I promise you I&#39;ll talk later,&quot; my wife said before abruptly hanging the phone up. I didn&#39;t want to disturb her, so I didn&#39;t bother trying to call back. Though a part of me was worried for her. </p>\n\n<p>I began waiting for Laura to get home as I finished making popcorn for the two of us. Laura soon came home, but instead of yelling at me to quickly turn the T.V. on for the game, she ran to her room. </p>\n\n<p>The door to her room was shut tight when I arrived, worried she was upset. &quot;Laura, is something wrong?&quot; I asked and knocked on the door. </p>\n\n<p>For a few minutes there was no reply from her as it seemed like she was trying to keep someone quiet and was shushing them. Slowly, she entually opened the door as she looked up at me with a wide smile. &quot;Hi daddy.&quot;</p>\n\n<p>&quot;Hey sweetie,&quot; I replied to her as I glanced in her room, looking for a friend that might&#39;ve came home with her. However, no one was there. &quot;Is someone in your room I don&#39;t know about?&quot;</p>\n\n<p>Laura took a minute to reply. I wouldn&#39;t mind having someone over, but I was scared that it was someone I didn&#39;t know. &quot;Yes...&quot; She replied quietly. &quot;But she hid away. We&#39;re playing hide and seek.&quot;</p>\n\n<p>&quot;Can you tell me her name?&quot; I asked softly to her. I was starting to believe she was faking it slightly, but a part of me was still worried. </p>\n\n<p>&quot;Her name is Stella Bella,&quot; Laura said with a smile. &quot;She said you can&#39;t see her though. She doesn&#39;t like to be seen.&quot; </p>\n\n<p>I let out a sigh of relief. Despite the outlandish names in the world, I doubted there was someone with that sort of name. &quot;How about you draw Stella Bella for me? She would mind that right?&quot; I asked her softly. </p>\n\n<p>&quot;Let me ask her first after our game. Stella Bella is starting to get angry at you.&quot; The tone in my daughter&#39;s voice was frightening and sent chills in my body. Slowly, Laura closed the door and shut me out as I stood in mostly shock at her words. </p>\n\n<p>Her voice and tone was stuck in my head as I headed downstairs to start dinner. Over the many years that I&#39;ve spent time with her, never have I heard Laura speak like that. </p>\n\n<p>I began shaking the thoughts out. I began remembering what it was like when I had an imaginary friend and how much time I spent with it, though that was when I was in kindergarten. The way she acted must&#39;ve been because she wanted sometime to play around before dinner started.</p>\n\n<p>After awhile I called Laura&#39;s name and she stumbled down the stairs to get her dinner. She was silent the whole time, occasionally smiling at me widely. </p>\n\n<p>I found this strange, so I began to start a conversation. &quot;So, how did school go sweetie?&quot;</p>\n\n<p>&quot;Good, my teachers are nice,&quot; my daughter replied with a light shrug. &quot;Oh, and Stella Bella let me draw her.&quot;</p>\n\n<p>I instantly noticed Laura&#39;s bored face turned into a wide smile as she took out a sheet of lined paper. On it was a drawing of a girl with pink curly hair that was in, what looked like to be, a ponytail. Her skin was a peach color and she had a tall skinny body. Her outfit was a pink long top with a white skirt. Her shoes that looked white. </p>\n\n<p>&quot;Stella Bella wants to play tonight,&quot; Laura said in the same terrifying tone as before. I didn&#39;t know what to say as I sat there staring at the drawing. </p>\n\n<p>Eventually it was late and I took Laura to bed. &quot;Sleep tight sweetie,&quot; I said softly, despite her words circling his head. </p>\n\n<p>I laid in silence as I thought about what she said. Suddenly I heard a crash in Laura&#39;s bedroom before I quickly sat up. I began making my way towards her room as fast as possible. </p>\n\n<p>However, when I arrived she was gone and the window was open. I spent the next couple weeks explaining to the police how I did not do it. But they did not believe me. Though, I found a note saying I shouldn&#39;t trust strangers. </p>\n</div>\n","author":"CreepypastaTravelers"}