{"rank":"144","title":"I wrote a letter to myself. I got a response. Part 4.","id":"8mu4gd","url":"/r/nosleep/comments/8mu4gd/i_wrote_a_letter_to_myself_i_got_a_response_part_4/","time":"1527547868000","body":"<div class=\"md\"><p><a href=\"https://redd.it/8lxrvb\">Part One</a></p>\n\n<p><a href=\"https://redd.it/8m7o9u\">Part Two</a></p>\n\n<p><a href=\"https://redd.it/8mg4sv\">Part Three</a></p>\n\n<p>&nbsp;</p>\n\n<p>&nbsp;</p>\n\n<p>I woke to hands around my throat, choking off my air as I swam out of the black currents of sleep and opened my eyes to see a face eerily similar to mine staring down at me.  The other Scott was straddling me, bearing down hard as I started trying to flail and get free.  His arms prevented me from getting a good hit in on his head, so I tried punching him in the sides.  He grunted at each impact, but was unmoved.</p>\n\n<p>&nbsp;</p>\n\n<p>I tried to make eye contact, mouth something to him, but he wouldn’t meet my eyes--seemed to be avoiding them, in fact.  He just stared at his hands around my throat, lips skinned back from his teeth in some kind of snarl or grimace below eyes that looked almost sorrowful.  This somehow scared me worse.</p>\n\n<p>&nbsp;</p>\n\n<p>I started fighting back harder, trying to buck him off while slamming an elbow into his arm, hoping to break his grip.  But he was too strong, and I could already feel myself slipping back into the icier waters of unconsciousness.  As I faded out, I had time to worry if my shoes were still on and to hear him say he was sorry.  When I woke next, I was facedown on the floor, the left side of my head wet with some kind of viscous liquid.  I wiped at my left eye and then opened them both experimentally. </p>\n\n<p>&nbsp;</p>\n\n<p>I was in a version of my bedroom, but I could tell it wasn’t mine.  I looked around slowly, my throat aching with every breath as I sat up.  The room was empty and the door was shut, and I had to fight the urge to rush out and search for Christine.  I needed to be smart.  Take my time and take everything in.</p>\n\n<p>&nbsp;</p>\n\n<p>With revulsion I noticed my hand was wet with blood from where I had wiped my head.  My entire side was soaked in fact, as was the floor.  I felt a lurch of fear in my stomach that he had killed Christine before he came back across to get me, but I tried to hold it at bay as I studied the rest of the room.  Nothing that noteworthy other than that he had five mirrors hanging in different spots in the room, all of which were dark.  I looked to the corner of the ceiling above the bed and breathed a sigh of relief when I saw no mirror there.</p>\n\n<p>&nbsp;</p>\n\n<p>Turning to the wall, I saw that he had stripped away the paper he used to make the doorway on this side.  I guessed he had replicated it on the other side so it would stay open while he destroyed this side, but aside from the paper I still had no real idea how it was done.  Given the fresh blood, it seemed likely that was a part of it.  Again I had a thrill of fear for Christine, and this time I couldn’t resist it.</p>\n\n<p>&nbsp;</p>\n\n<p>Standing up stiffly, I went to the door and yanked it open.  A woman screamed, and as I looked across the dimly lit living room, I saw it was Christine.  She looked terrified, and she was chained to the wall by some kind of collar, but she was alive.</p>\n\n<p>&nbsp;</p>\n\n<p>“Christine?”</p>\n\n<p>&nbsp;</p>\n\n<p>She blinked, her mouth slowly closing as she took me in.  After a moment she started to stand, her face shifting between fear and hopefulness.  “Scott?  Is that really you?”</p>\n\n<p>&nbsp;</p>\n\n<p>I wanted to run to her, but I could tell she was freaked out, so I approached slowly.  “It’s me, baby.  Did he hurt you?  Are you okay?”</p>\n\n<p>&nbsp;</p>\n\n<p>Her face crumpled as she ran to me, almost knocking me over with the force of her embrace.  “Thank God.  Oh God oh God oh God.”  I stayed quiet and hugged her back, and after a minute she pulled back, her expression serious and more composed.  “Is he gone?”</p>\n\n<p>&nbsp;</p>\n\n<p>I nodded.  “I think so.  He jumped me when I was asleep and drug me here.  I was unconscious, but I didn’t see any sign of him when I woke up.  He didn’t come back out of the room did he?”  She shook her head.  “Then he must be over in our world.  The fucker wanted to take my life and now he has.”  I caught myself and smiled sadly at her.  “But it’ll be okay.  We’ll figure things out.”  I reached out to stroke her hair, but she pulled back.</p>\n\n<p>&nbsp;</p>\n\n<p>“I…I’m sorry, Scott.  I’m so happy to see you, but it…he looks so much like you and I’ve been stuck here for two weeks with him.  It’s going to take me a bit to readjust, that’s all.”  She took a couple of steps back, her hands holding her elbows as she smiled apologetically at me.  “But I’m okay.  I’ll be okay.  What about you?”</p>\n\n<p>&nbsp;</p>\n\n<p>Trying to hide the pain and guilt I felt at her words, I turned away to take in the living room.  “I’m fine.  He choked me out, but I’m okay other than a sore throat.”  I glanced back at her.  “I…I’m so sorry for this.  I know this is all insane and out of our control, but it’s still a version of me that’s doing it.”  I wanted to ask about the details of how he may have mistreated her, but I didn’t want to make it any harder on her than it already had been, and we could talk about it later when she was ready.  So instead I added lamely, “I know he’s crazy, and I hope you know I’m not anything like him.”</p>\n\n<p>&nbsp;</p>\n\n<p>Christine reached out and touched my arm.  “Hey.  I know that.  You’re not him and I know you’re not like him.  And honestly, I almost felt sorry for him at times.  I haven’t seen it, but from what I can tell and what he said about it, this place is really fucked up.  Dangerous fucked up.  He said people were going crazy here, and I think that was part of his problem too.”  She pulled her arm back, her voice trembling slightly.  “Do you know how to get us back?”</p>\n\n<p>&nbsp;</p>\n\n<p>I shook my head as I turned away again, ashamed to look at her any longer.  “I’ve been trying to figure it out ever since you were taken, but I don’t know yet.  I communicated with him through that stationary my aunt gave me.  He did the same with some an uncle of his on this side had given him.  That paper, the two combined together, is how he makes the doorways.  But no matter what I do, nothing seems to work.”</p>\n\n<p>&nbsp;</p>\n\n<p>Out of the corner of my eye I saw Christine’s face fall with despair.  I pointed into the bedroom and went on.  “There’s blood in there.  A lot of it.  And there was blood in my bedroom when you were taken too.  I was afraid it was yours, but it wasn’t was it?”  She hesitated and then shook her head.  “Okay, that’s what I was thinking.  The blood has to be part of it then.  Did you see how he did it?”</p>\n\n<p>&nbsp;</p>\n\n<p>Again that strange pause and then she gave a quick nod.  “I saw him draw the shape of a door in blood.  Inside the paper outline like you talked about.  Is the paper still there?”  She looked past me into the bedroom.  “Did he take it when he left?”</p>\n\n<p>&nbsp;</p>\n\n<p>Finally I had some good news.  “He did, but I have more.  When I realized I might not figure out how to get across to you on my own, I started hoping he would come back for me.  I took to sleeping with my shoes on every night, and I kept the strips of paper I had saved tucked into the bottoms of them.  If we can figure out how to create the doorway, I have the paper to do it.”</p>\n\n<p>&nbsp;</p>\n\n<p>Her expression brightened for the first time and she grabbed my hand, pulling me into the bedroom.  “Try it!  Maybe it will work.”</p>\n\n<p>&nbsp;</p>\n\n<p>I took the strips of paper from my shoes and for the next few minutes we pasted them carefully in an alternating pattern of cream and blue.  As far as I could tell, it was close to exactly how he had them arranged when he took Christine.  Then, dipping a pencil eraser in the thickening blood on the floor, I traced the outline as she directed.  It did nothing.</p>\n\n<p>&nbsp;</p>\n\n<p>After a couple of minutes of waiting, I tried again.  No change.  Suddenly Christine pushed past me, her fingers dripping with blood.  She frantically traced and retraced the outline over and over, but to no avail.  Screaming, she punched the wall and fell back in a heap on the floor.  I realized that her hand wasn’t covered in the blood from the floor, but was bleeding itself.</p>\n\n<p>&nbsp;</p>\n\n<p>“What happened?  How did you hand get hurt?”  I started to reach out to her, but her dark look stopped me.</p>\n\n<p>&nbsp;</p>\n\n<p>“I bit it.  Just now.  I thought maybe it needed fresher blood or something other than a fucking eraser wiping it on the wall.  I don’t know.  Not Scott is the one that did this bullshit, not Not Christine.”  She sighed deeply and seemed to regain control.  “I’m sorry.  I know this isn’t your fault.  But we need to get out of here.”  Her bloody hand touched her collar.  “Fuck, this thing is still on.  He said the key is in his closet.  I can’t reach it.”</p>\n\n<p>&nbsp;</p>\n\n<p>I swallowed and nodded, jumping up to check the closet.  Inside I found a small assortment of clothes and a couple of pairs of shoes, but the rest of the closet was devoted to books.  They were stacked on a shelf at the top and in neat piles along the closet’s walls.  Most of them looked to be fantasy or science fiction, many by authors I had never heard of, a few by authors who had never written those particular books in my world.  On top of the closest book stack was a key.</p>\n\n<p>&nbsp;</p>\n\n<p>After Christine was free, we searched the apartment over for any clues of how to reopen the door.   Thirty minutes later we were back in the living room, Christine staring at the floor forlornly while I tried to figure out something comforting to say.</p>\n\n<p>&nbsp;</p>\n\n<p>“Look, it’ll work out.  We’ll figure it out.  But it may take some time.”  Her expression didn’t change and I went on.  “I need to go out and get us some supplies.  Figure out if this place is even anything like what he said.  Maybe it’s not half bad and he’s just a crazy liar.”  I knew the unspoken subtext of what I was saying was that hopefully it would be nice because we might be stuck here, but I couldn’t quite bear to say it.  Instead the idea of being marooned in this place just hung between us like some kind of noxious cloud, slowly killing the little hope we had left.  As I was thinking this, I realized Christine was on her feet.</p>\n\n<p>&nbsp;</p>\n\n<p>“You’re right.  Let’s go and see what this place is even like.”  </p>\n\n<p>&nbsp;</p>\n\n<p>I thought about protesting, asking that she stay at the apartment in case the outside world was dangerous, but I could tell she was determined to go and it would be good if there were two of us.  Between us we managed to find a pair of long kitchen knives and a flashlight along with a light jacket with pockets I could store the items in while we traveled.  Then we were off.</p>\n\n<p>&nbsp;</p>\n\n<p>Stepping out of the apartment, the ill-repair of the hallway matched the hole in the ceiling of the apartment.  The only thing in sight that looked cleaned or well-maintained was the elevator, the brass of which carried a mirror-like sheen.  I stopped and looked at the reflection there, but saw nothing.  At her questioning look, I explained my encounter in the hallway to Christine.  She said “Not Scott”, as she called him, had told her some about the mirrors but not a lot.  She asked how I’d been able to see him back in the reflection on the elevator, and I realized I didn’t know.</p>\n\n<p>&nbsp;</p>\n\n<p>But by then we were pushing out of the downstairs outside door.  When we stepped out, the first thing that struck me was how quiet the city was.  How still.  It was still early, but in our world there would already be people out and cars bustling along the narrow lanes of the street that ran in front of the apartment building.  There would be sounds of nature mixed in as well, even if it was just the occasional bird song or dog bark.</p>\n\n<p>&nbsp;</p>\n\n<p>Here there were a handful of cars driving down the street, and the people driving them seemed to either be staring straight ahead as though their gazes were welded to the road in front of them or constantly looking in every direction, seemingly terrified of some surprise attack.  It was hard to say which was the better idea.</p>\n\n<p>&nbsp;</p>\n\n<p>We turned to the left and made our way down to what would be a corner grocery store in our world.  Along the way we passed only a couple of people, and they were both walking determinedly on the far sidewalk.  They shot us wary glances but that was all, and my \nattempt at waving hello to the second person was ignored.</p>\n\n<p>&nbsp;</p>\n\n<p>At the end of the block we found that Patterson’s Grocery Store was now Patterson’s Package Shop, but when we entered we found that aside from a large volume of alcohol the place still sold various food and drinks.  Sticking close to each other, we selected a small variety of items and headed toward the front.  Money didn’t seem to be an issue for the moment, as Not Scott had left a small stack of bills and a debit card with the PIN taped to it sitting on the kitchen counter.  The bills were red and reminded me of Monopoly money, but when I handed the cashier a hundred dollar bill, he took it without complaint and gave me a handful of strange change in return, including another RFK nickel.</p>\n\n<p>&nbsp;</p>\n\n<p>On the way out we were almost run over by a large teenage boy barreling into the store past us.  As he cleared the threshold, he started yelling about how he needed “fresh ciggies for my mam.  Get them up for her, you cozening fucker.”  I propelled Christine out onto the sidewalk, but not before I heard the cashier scream back that the boy’s mother had been dead for three years.</p>\n\n<p>&nbsp;</p>\n\n<p>We exchanged a look, and I debated suggesting we just head back to the apartment, but Christine was already opening a bottle of water and cutting across the street.  There was starting to be more traffic now, but the flow of people was still anemic.  I made the comment that this is what the world would be like after some plague in a movie where half the people had been wiped out.  </p>\n\n<p>&nbsp;</p>\n\n<p>Christine had shot me a glance, her face hard.  “I don’t know that it’s that far from the truth.”  She pointed ahead to Bristow Park, which was actually called the same thing here as well.  “Let’s go in there and see if there are any people out.”</p>\n\n<p>&nbsp;</p>\n\n<p>Our version of Bristow Park was always bustling with people in the morning.  On the weekends it would be families and casual games of football or frisbee, but even the weekdays saw a steady stream of joggers, dog walkers, and miscellaneous others.  At first, we thought this version of the park was largely empty, but then Christine heard singing.</p>\n\n<p>&nbsp;</p>\n\n<p>The outer paths of the park follow cultivated hedges and trees, curving and winding along the park perimeter with inlets into the more central areas every hundred yards or so.  Even when you start down one of those inner paths, it takes more than a few steps before the large open spaces at the center of the park are revealed.  </p>\n\n<p>&nbsp;</p>\n\n<p>As we were walking along the outer path, Christine suddenly cut onto one of the inner paths, murmuring that she heard music.  I followed, but at first I heard nothing.  It was only as we were stepping onto the dying grass of the central field that I heard the faint singing or chanting that was coming from the throng of people clustered around the enormous bonfire in the distance.</p>\n\n<p>&nbsp;</p>\n\n<p>Christine was walking towards the group quickly and after a few more paces I grabbed her arm and stopped her.  She turned to me, her eyes fierce and her voice low and trembling when she spoke.  “What are they doing?  Do you see that?”</p>\n\n<p>&nbsp;</p>\n\n<p>I had been more focused on Christine as we had drawn nearer, but as I looked again, I saw exactly what they were doing.</p>\n\n<p>&nbsp;</p>\n\n<p>The bonfire was not really a bonfire.  It was a twenty-foot metal frame in the shape of an X, the lower half squatter and much thicker than the top.  Inside the frame, wood had been carefully inserted throughout and set ablaze.  That was all very strange, but I only noted it in a perfunctory way as I watched the man catching fire.</p>\n\n<p>&nbsp;</p>\n\n<p>The man had been stripped naked and chained at each wrist, the lengthy metal bindings trailing off into the crowd on each side of the burning X.  The man was in the middle between the burning effigy’s legs, the top of the white-hot metal only inches from his head.  The air around him shimmered with the heat, his skin blackening and peeling off as he was jerked back and forth from one side of the X to the other at the whims of the crowds pulling the chains.</p>\n\n<p>&nbsp;</p>\n\n<p>We were still fifty yards away, but when a breeze shifted direction I could smell the pungently sweet smell of his flesh cooking even as I heard him scream.  I was about to start pulling Christine away when I stopped, my skin growing cold.</p>\n\n<p>&nbsp;</p>\n\n<p>The man wasn’t screaming.  He was laughing.</p>\n\n<p>&nbsp;</p>\n\n<p>I tugged weakly at Christine and she glanced at me, her eyes wet and wide.  We began to back away slowly, and I was terrified at any moment we would be noticed.  But the crowd was transfixed, and even when the man stopped laughing and slumped forward, they kept him aloft and dancing like some kind of macabre tug-of-war.  </p>\n\n<p>&nbsp;</p>\n\n<p>We edged our way back to the perimeter of the field.  In my last look before we headed back to the path and out of the park, I saw the cooked meat of the man begin to pull apart as the mob ripped him in two.  I swear I could hear the wet gasping of his skin as it ruptured, the greasy crackle of his weaker bones as they flexed and snapped, but it seemed impossible at such a distance.  Real or imagined, I had to stop and vomit on the path, Christine patting my back and telling me to please hurry.</p>\n\n<p>&nbsp;</p>\n\n<p>We exited the park and wasted no time returning to the apartment.  I could feel Christine’s terror and knew my own matched it, but I felt no closer to an answer than I had before.  We didn’t talk about what we had seen, but Christine did take my hand and sit silently with me for awhile.  I could tell we were both starting to slip into shock or some despondent form of madness.  We had to do something.  Getting up, I started searching the apartment again for anything we might have missed.</p>\n\n<p>&nbsp;</p>\n\n<p>That’s when I found <a href=\"https://redd.it/8m7o9u\">a cream-colored envelope</a> on the bedroom desk.  I opened it and read it, then read it again, my heart pounding.  When I gave it to Christine, she studied it for a long time before looking up at me.  She was about to speak, but I couldn’t hold it in any longer and blurted out:</p>\n\n<p>&nbsp;</p>\n\n<p>“Did he rape you?”</p>\n\n<p>&nbsp;</p>\n\n<hr/>\n\n<p>&nbsp;</p>\n\n<p>Scott’s face was worried, hurt and scared all at the same time as he asked, and I could feel myself loving him and hating him for asking the question.  I knew he was concerned for my well-being, that he loved me.  And I knew that he felt guilty because of who had taken me.  But there was still something so selfish in him asking.  So childish in <em>him</em> needing to be comforted if <em>I</em> had been raped, or even better, him hoping I could reassure him that whatever brutalities I had endured at Not Scott’s hands weren’t as bad as all that so he could start pretending this wasn’t his fault.</p>\n\n<p>&nbsp;</p>\n\n<p>Because it was his fault.  I saw that now.  Not necessarily because it was an alternate version of him, but because he had talked to Not Scott, responded to him, <em>told him about me</em>.  I was trying not to be angry with him, but I was so hurt and scared and we had to get out of this place.</p>\n\n<p>&nbsp;</p>\n\n<p>I had already been toying with the idea of lying to Scott after reading Not Scott’s letter.  I had no idea why Not Scott had lied about raping me, whether it was due to his insanity, natural cruelty, or just to make Scott hate him more.  It didn’t matter.  If it could drive Scott’s guilt and his anger long enough to force him to do what had to be done, it was a blessing.  And if Scott’s sad face and worried tone made it easier to tell the lie, so be it.  I could ask for forgiveness when we weren’t in Hell anymore.</p>\n\n<p>&nbsp;</p>\n\n<p>“Yes.  He did.  He started the second day, and it got worse as the days went on.  More…extreme.”  I was going to try and fake tears, but I found there was no need.  After everything, after what we had just witnessed, tears were going to come easily for some time.</p>\n\n<p>&nbsp;</p>\n\n<p>I saw Scott’s face darken as his fists balled at his sides.  That’s the response I was hoping for.  I waited a moment for him to stew and then I went on.  “And I lied before.  I do know a bit more about how to make the door work.  Not Scott killed a little girl.  He used her blood to open the door.”  Some of that was guesswork on my part, but I had seen enough to make it an educated guess.</p>\n\n<p>&nbsp;</p>\n\n<p>Scott’s eyes widened some, but he still looked hard and determined.  “Then that’s what we’ll do.  I’ll find someone and take blood from them.”  I winced and he stopped.  “What is it?  What’s wrong?”</p>\n\n<p>&nbsp;</p>\n\n<p>I licked my lips.  <em>Ask for forgiveness when you aren’t in Hell.</em>  “Scott…I mean, Not Scott told me that it had to be from a child and the blood only worked as they were dying.  I didn’t want to tell you because it’s so horrible, but I don’t think there’s any other way to get us home.”  </p>\n\n<p>&nbsp;</p>\n\n<p>This too was a lie, of course, as Not Scott had never told me any such thing.  But it made sense.  The leftover blood of the girl hadn’t worked and neither had my own fresh blood.  So we needed to replicate what Not Scott had done as closely as possible as soon as possible.  I didn’t…We didn’t have time for Scott to moralize, try to think up humane alternatives, let the edge his emotions were giving him now grow dull with time and equivocation.  No.  We…</p>\n\n<p>&nbsp;</p>\n\n<p>“We have to get out of here.  I have to make this right and get you out of here.  If I have to do something horrible to do that, that’ll be on me.”  His eyes were glimmering, but his voice didn’t falter.  “I’ll go find someone right now so we can be done with it.”</p>\n\n<p>&nbsp;</p>\n\n<p>I reached out and squeezed his hand.  “I’ll help.”</p>\n\n<p>&nbsp;</p>\n</div>\n","author":"Verastahl"}