{"rank":"221","title":"Teddy Bears and Plastic Cups","id":"8mu61t","url":"/r/nosleep/comments/8mu61t/teddy_bears_and_plastic_cups/","time":"1527548273000","body":"<div class=\"md\"><p>The house was full of other people&#39;s junk when we moved in.  We knew that.  That was part of the deal, and was one of many reasons the place was so cheap.  My wife and I spent the better part of the weekend boxing up the crap and putting it in the garage.  We sorted it into things for Good Will and <em>trash</em>.</p>\n\n<p>I was in the kitchen making dinner when my wife shouted from the living room, &quot;Honey, there&#39;s a little girl playing in the garden. Get rid of <em>it</em>.&quot;</p>\n\n<p>I leaned over the sink and looked out.  So there was.  A girl, no older than seven or eight, sat on the lawn, playing tea party with her dolls and teddy bears.  I sighed.  It&#39;s not that I don&#39;t like children, I&#39;m just not particularly fond of them either.  I don&#39;t know how to talk to them, they intimidate me.\nI left the house and walked towards her, trying not to appear threatening.  I knelt down beside her and said, &quot;Sweetie, you have to leave.&quot;</p>\n\n<p>She looked up at me, her large brown eyes seeming lost and scared.  It was then I noticed that her dress was dirty and threadbare in places.</p>\n\n<p>She ignored me and went back to playing.  I stood up, put my hands on my hips and sighed.  I peered around, as if looking for witnesses.</p>\n\n<p>&quot;Go!&quot; I shouted.</p>\n\n<p>She lurched back startled, ran from the property and down the road.  Instantly, I felt pangs of guilt curdle in my stomach.</p>\n\n<p>&quot;Wait!&quot; I hollered after her, but it was too late, she was gone.</p>\n\n<p>Her toys sat on the overgrown grass, waiting for their next instructions.  The pretend tea started to get cold.  </p>\n\n<p>I returned minutes later with a plastic box and gathered up her playthings.  The teddy bears had seen better days.  The plastic cups and plates scratched from years of use.  It was obvious this little girl didn&#39;t have much, and what she did have had been left here.</p>\n\n<p>I placed the box in front of the garage, in the hope her mother or father would come back and collect it.</p>\n\n<p>It rained heavily that night, and I hoped the girl found her way home safely.</p>\n\n<hr/>\n\n<p>The week had been long and tiring.  We had spent most of the time cleaning out the house and bickering.  We were both career people, and hadn&#39;t spent a lot of time together over the last few years.  The close proximity and manual labour had made us both cranky.</p>\n\n<p>A thump against the living room window made me jump.  My wife stood up like a shot and ran out of the living room.  The front door banged against the wall.   I saw a startled boy stand at the end of the garden.  Through the walls I heard my wife&#39;s muffled voice berate the child.</p>\n\n<p>&quot;Don&#39;t you dare play soccer outside my house!  You almost broke our windows!&quot;</p>\n\n<p>I winced for the boy as he took the brunt of all my wife&#39;s frustrations from the week.  She kicked the ball will full force, it rose quickly into the air, being immediately obscured by the bright sun.  In that moment, I was impressed, I hadn&#39;t known she had such a good right foot.  The boy turned and ran.  I never found out if he found his ball.</p>\n\n<p>On Thursday, I decided to give her some space and began placing the wooden posts that would become our fence.  The space did us good, and when I finished the fence on Saturday, we weren&#39;t arguing anymore.</p>\n\n<p>Monday came and my wife went back to work.  I had another week of vacation, and decided to spend the time painting.  I was halfway through the kitchen when I took a break for lunch.  Through the window I saw her again.  She sat on the lawn, playing tea party with her dolls and teddy bears.  An empty plastic box sat next to her.  I was very glad my wife was at work.</p>\n\n<p>I gently walked out of the house, being careful not to slam the door.</p>\n\n<p>The girl poured imaginary tea into plastic cups. Her face appeared emaciated.  I approached with caution.</p>\n\n<p>&quot;Hey, little girl, what are you doing out here? Shouldn&#39;t you be at school?&quot; I asked calmly.</p>\n\n<p>She picked up a cup and poured the imaginary drink into the doll&#39;s face, then smiled and replaced the cup.</p>\n\n<p>I crouched next to her, &quot;Honey, you need to go home.&quot;</p>\n\n<p>She ignored me and picked up the cup next to the other doll and placed it in front of it.</p>\n\n<p>I peered at the newly erected fence and the gate to see it was locked.</p>\n\n<p>&quot;How did you get in here?&quot; I asked.</p>\n\n<p>She turned to look at me, &quot;My mother let me in.  We used to live here, not long ago.&quot;</p>\n\n<p>&quot;Okay, but you don&#39;t anymore.  Let me take you back to your parents.&quot;</p>\n\n<p>She nodded and picked up the corners of the blanket, forming a makeshift bag, before slinging it over her shoulder.  She stood up and offered her grubby hand.  I reluctantly took it in mine.  I unbolted the gate and followed as we left my front garden into the street.  We walked for what seemed like miles, as the houses became less and less frequent, until there were none at all and only corn fields.</p>\n\n<p>We crossed a road and she led me to a church.</p>\n\n<p>&quot;Is your father the priest here?&quot; I asked.</p>\n\n<p>She stayed silent and walked me into the graveyard.  We passed the old stones, the ground lumpy underfoot from years of movement.  We arrived at the end of the churchyard that was almost empty.  She let go of my hand and clambered into a clumsy, shallow hole in the ground, where a dirt ridden pillow and blanket lay.  Next to it were two fresh gravestones, for a Mr and Mrs Wentworth.</p>\n\n<p>&quot;Are those your parents?&quot; I asked, nervously.</p>\n\n<p>She nodded, lying in the fetal position, gripping the makeshift bag in front of her, and she closed her eyes.</p>\n\n<p>&quot;Thank you for walking me home.  Would you like to come to my next tea party?&quot;</p>\n\n<p>A tear rolled down my cheek, &quot;I&#39;d love to.&quot;</p>\n\n<p>She smiled before falling asleep.  I turned around, not wanting her to see the tears continuing to flow.  I took out my phone and punched in a number.  I brought it to my ear and heard the dial tone.  A woman answered.</p>\n\n<p>&quot;What&#39;s your emergency?&quot; she said, sounding bored.</p>\n\n<p>I looked back, expecting to see the girl sleeping in the shallow hole. Instead, I saw a small gravestone that read <em>&quot;Alice Wentworth&quot;</em></p>\n\n<p>The blanket was now open, the teddy bears and dolls, the plastic plates and cups, all sat on top of mature grass.</p>\n\n<p>&quot;Hello?&quot; the woman said.</p>\n\n<p>&quot;Sorry, I must have been mistaken.&quot;</p>\n\n<p><a href=\"https://www.facebook.com/theedwincrowe/\">xx</a></p>\n</div>\n","author":"ecrowe"}