{"rank":"16","title":"I Woke Up This Morning Without My Left Foot","id":"8mu7bw","url":"/r/nosleep/comments/8mu7bw/i_woke_up_this_morning_without_my_left_foot/","time":"1527548597000","body":"<div class=\"md\"><p>Please somebody help me. I don’t know what’s going on. Nobody seems to notice anything’s wrong. As of right now all I have left is part of my torso, one eye, and three fingers on my right hand.</p>\n\n<p>This all started this morning. Throughout the night I had this weird sensation in my left foot. It almost felt like a spring was being compressed inside of it. It kept me up all night but when I would look at it in the dim light I couldn’t see anything wrong. I figured that I had just rolled it weird or something the previous day. A little bit before I was supposed to get up I felt all the pent up pressure suddenly release, it was a great feeling. I figured my muscles had finally relaxed after being so tense all night long.</p>\n\n<p>Wanting an early start to my day I got up and immediately fell right over when I tried to walk. Confused I looked down at my feet and that’s when I felt my heart drop. My left foot was gone. Not like it had been severed and I was bleeding, it was just gone. I had a stump there now perfectly healed like I never had a foot in the first place. Panicking I called in sick to work and hobbled over to grab my car keys and drive to the nearest hospital. </p>\n\n<p>During the drive is when I felt the sensation again, this time in my right pinky. I could feel a pressure building and building across the entire drive, only further increasing my anxiety. I pulled into the emergency drop off and quickly did my best to drag myself to the hospital. That’s when I felt the sensation in my pinky release, terrified I looked down to find only four fingers on my right hand now. Not even a stump, it was like my hand just ended after my ring finger. </p>\n\n<p>I immediately started screaming for help. I didn’t know what was going on but I knew things weren’t right. The medical staff quickly came to my aid and put me on a stretcher hooking me up to an IV and asking me what was going on. I did my best to explain myself in my panicked state but I’m sure what came out was more or less a complete incomprehensible mess. It was around this time that again the sensation came back. This time stronger than ever and in thigh of my right leg. I started yelling at them that I was about to lose my right leg and that I needed them to hold onto it or do something. Only a few minutes after the sensation began I felt the release and watched in terror as the sheet that once housed my left fell flat to the bed. My entire leg was gone now. What happened next I’m still trying to comprehend. </p>\n\n<p>The doctors didn’t react at all to my leg disappearing. In fact they seemed to almost be calmed by the fact. They quickly put me in a room and I heard one of them ask a nurse to get my medical records. When she returned the doctor asked me a bunch of preliminary questions, my name, age, where I was born. That’s when I felt the pressure begin again, this time in my left hand. I tried answering the questions panicking more and more and wondering why the doctor wasn’t alarmed by my disappearing body parts. I could feel tears welling up behind my eyes to the point where I couldn’t take it anymore. I started screaming at the doctor and thrashing my arms around.</p>\n\n<p>“Why the fuck aren’t you alarmed by my leg disappearing before your eyes!!” I yelled as I grabbed the blanket and tried to throw it off myself.</p>\n\n<p>That’s when I felt the popping release in my left hand and saw the blanket only life a few inches before falling back into my lap. My left hand was gone. There was absolutely no way that the doctor could have pretended to not notice my hand disappear, I almost felt a strange sense of relief knowing that he couldn’t deny this any further. </p>\n\n<p>“Hmm…” the doctor said. “Ma’am, are you aware that you were born with several missing body parts.”</p>\n\n<p>The news tore through me. What the hell did he mean I was born with several missing body parts. I was a perfectly healthy baby with all my limbs intact. I never had any major health issues until whatever started happening this morning. </p>\n\n<p>“My… my hand just disappeared right in front of you, how could you not have seen that.” I pleaded with him, hot tears falling down my face.</p>\n\n<p>“Ma’am, all that seems to be happening right now is that you seem to be suffering from some kind of psychotic break. You came in here screaming about your foot and finger missing, and then your leg disappearing while we were attending to you. Upon inspection though, according to all our medical records you never had these limbs to begin with. I’m going to have to keep you underwatch for the next 24 hours while we can try and formulate a diagnosis.” The doctor said as he began to leave. </p>\n\n<p>I couldn’t believe what I was hearing, what the hell was going on. I was trapped here, I couldn’t leave even if I wanted to. I began to cry, and then I felt the sensation again. This time though it was in my mouth. I didn’t know what was about to happen. I tried to scream out but before the words could leave my mouth I felt the release and my jaw lock up. I held a hand to my mouth and found my worst fears come true. The lower half of my face was completely smooth now, no mouth or anything. In fact it wasn’t even like skin was covering it up. I couldn’t move my jaw at all. I had nothing down there anymore except pale flesh. </p>\n\n<p>I broke down. I couldn’t even begin to comprehend what was happening to myself. Why me, was I doomed to live like this. Or would I just eventually disappear. The tension returned in my right index finger but I didn’t panic. What could I do anymore. Nobody seemed to care. Nobody even seemed to notice anything wrong. </p>\n\n<p>The next few hours I laid there tension rising and then popping all over my body. First my left forearm went. Then half of my right hip, and my left eye. After that came both my ears, you never realize how quiet things can be until you lose your hearing. I haven’t seen a doctor or nurse in hours. I think they forgot about me, or they’re just ignoring me. They aren’t responding to the call button, and I can’t make any noise for them to hear me. \nMy whole view shifted once I felt my neck pop and my head reattach itself directly to my chest. \nI felt my body slowly collapse onto itself as the left half of my torso went. I don’t even know how I’m alive at this point. About an hour ago I lost my nose, I don’t think I can breathe, hell I’m not sure I even have lungs or a heart. </p>\n\n<p>Nothing makes any sense anymore. I’m terrified. Please if anyone has any idea as to what might be going on I’ll take it. Honestly I’m not sure what I’m more scared of. To loose my right eye and be trapped in my body forever, or to lose my head all together. Will I even be aware of it when it happens. Please somebody, anybody, help me. I can feel the tension rising in my right hand. </p>\n</div>\n","author":"Yuebeo"}