{"rank":"3","title":"The Monster in His Closet","id":"8mu7ny","url":"/r/nosleep/comments/8mu7ny/the_monster_in_his_closet/","time":"1527548685000","body":"<div class=\"md\"><p>I had long been worried about my son Caleb.</p>\n\n<p>His father had died of illness when I was eight months pregnant, and so I raised him alone. </p>\n\n<p>Caleb was always very twitchy around his schoolmates -- his teacher told me during the semi-annual parent-teacher conference that one of the other six-year-olds took a step too close and he’d jumped like he had been electrocuted. Even I’d been swatted at least once by a wildly flailing limb.</p>\n\n<p>But I accepted this as a quirk of his. </p>\n\n<p>I only began to get truly worried when, on his ninth birthday, I found him curled up in the closet, rocking back and forth. </p>\n\n<p>“What’s wrong, C?” I asked, my voice low from years of dealing with an anxious child. </p>\n\n<p>He shook his head at me. </p>\n\n<p>You have to understand, I was very close with my son -- he never held things back from me, especially when he was having one of his panic attacks. </p>\n\n<p>“Sweetheart, are you okay?”</p>\n\n<p>This time he nodded and slowly began to uncoil. </p>\n\n<p>“There’s a monster in the closet, Mommy,” he whispered. </p>\n\n<p>I’d been expecting many an answer, but this hadn’t been one of them. </p>\n\n<p>I kneeled in front of him, but he flinched away, tugging the sleeve of his sweat-shirt in a nervous gesture. </p>\n\n<p>“There’s a monster in the closet,” he repeated, as if attempting to impart something I hadn’t quite absorbed previously. </p>\n\n<p>I smiled as reassuringly as I could and stood up. “No, sweetheart. Don’t be afraid. I’ll always be here with you. Always.”</p>\n\n<p>He stared me down with his big blue eyes as I backed away from him. It was better to let him grow and mature, and let him bridge his obstacles himself. </p>\n\n<p>When I walked into his room after school the next afternoon, I saw him kneeling amidst a veritable puddle of scarlet, sobbing as he cradled glass shards to his chest.</p>\n\n<p>Even as the visceral shock glanced through me, I could recognize the torn up bits of the photo I kept on the top shelf. In one scrap, I caught a glint of his father’s blonde hair. In another, a bright brown eye, glimmering with post-college happiness.</p>\n\n<p>“Caleb,” I said too quietly. “Caleb, I--”</p>\n\n<p>“He made me do it, Mommy,” Caleb said, hiccupping as he struggled to push the words out. “The monster in the closet, he made me --”</p>\n\n<p>“There. Is. No. Monster!” I yelled, and suddenly I was furious, suddenly I wanted to rip everything apart, but more than anything I wanted this little boy to go back to the way he was. I yanked him up by a delicate arm, and watched the remnants of my husband’s glossy face settle around him like snowflakes.</p>\n\n<p>He stopped for months after that, withdrew into himself more than ever. He’d only talk to me, touch me, look at me. The one or two friends he’d ever had slipped from his grasp and he was more alone than ever. I wasn’t worried. They all said kids like him were this way. </p>\n\n<p>But… this night, I flicked on my bedside lamp for a 3 am snack and saw him standing there, his jaw clenched. His eyes were hard and wide. I saw my own chocolate ones reflected in their depths.  </p>\n\n<p>He rolled up his sleeves, revealing the years of bruises and rope-burns I’d put there, the uneven stipples of black and blue, crimson marring delicate skin. </p>\n\n<p>“There <em>was</em> a monster in the closet, Mommy. But this whole time… it was trying to protect me from you.” </p>\n</div>\n","author":"GlobalStrategy"}