{"rank":"13","title":"Mysterious goat sounds in Eastern Tennessee","id":"8muh5w","url":"/r/nosleep/comments/8muh5w/mysterious_goat_sounds_in_eastern_tennessee/","time":"1527551060000","body":"<div class=\"md\"><p>I&#39;m not 100% certain this belongs here, but it&#39;s the only place I could think to post it, and perhaps someone can provide an answer.</p>\n\n<p>I&#39;m currently on a cross country trip from East to West (home is CA). I&#39;m now in TN staying with someone in the Great Smokies National Park. I&#39;ve been here almost two weeks. The house is situated on a small hill that overlooks a barn and a paddock where the owner keeps horses. The rest of the property is forested for the most part. Beyond the paddock is a tree line that blocks visibility of the road roughly 200m away. Across the road there is forested bluff and beyond that is a ridge line (Foothills PKWY for anyone familiar with the area), which is also heavily forested. The house is quite remote, there are no immediate neighbors and from what I can tell no house across the street, just an old dirt road that is very overgrown and has unlikely been used in a long time, and may even belong to my host. </p>\n\n<p>For the past 3 days I have been hearing a redundant goat noise, and by redundant its pretty constant (every 10-30 seconds I&#39;d guess) and sounds nearly exactly the same every time. It usually sounds like one goat, but occasionally there sounds like there could be two. From what I can tell it sounds like it&#39;s coming from the forested bluff across the street, though some times it sounds like it coming from forested area on the right and left side of the property. Initially I thought nothing of it. Perhaps someone bought a goat or maybe I just didn&#39;t notice it prior. I became hyperaware of it yesterday. It started around 6pm yesterday and was fairly constant until I fell asleep around 2am. I&#39;m no goat expert, but wouldn&#39;t think goats would be up that late making a ruckus. </p>\n\n<p>I was up late partially because I was a bit creeped out by this goat sound continuing late into the night. I also thought I heard voices coming from the distance, but it could have been my mind getting the best of me. When I awoke there was no goat sound to be heard. I&#39;ve been at the house most the day so far, and currently house sitting so I&#39;m here alone. It was quiet all day until again at 6pm it started again. I wasn&#39;t going to investigate in the dark last night, because  I&#39;m a wimp and it didn&#39;t logically make sense to me to go look for some random goat (if it&#39;s indeed a goat) in the pitch dark. I chose to wait till today to go check it out once it started. </p>\n\n<p>My first attempt to investigate I got about a third the way down the driveway and it noise stopped. I stood around and waited to see if it would start again, but it didn&#39;t. Once I got back to the house it started again. I let it be for some time until the annoyance got the better of me and I decided to have another go. This time I walked down to the road, though it stopped once I set foot on the driveway. As I approached the road I heard, but could not see, a tree falling from across the road (could be entirely random, just weird). I stood on my side of the road and waited, nothing. I crossed the street, looked around a little bit, didn&#39;t see or hear anything, no goat sounds, no movement, nothing. I was down there maybe 5 minutes. I made my way back to the house and it wasn&#39;t until I was back in the house that it began again. It&#39;s been going on nonstop since. It&#39;s a mixture of creepy, annoying, and weird. The rational part of me says it&#39;s just a goat being a f****ng weirdo and the irrational part of me says it&#39;s something sinister/paranormal trying to lure me into the dark. It&#39;s probably just a goat.</p>\n\n<p>It could all be coincidence that when I go to look it stops. However, it seems strange to me. I&#39;ve been around goats several times in my life and have stayed places with goats as well. Never have I heard goats doing this, especially not sounding the same every time, but again I&#39;m no expert. If anyone has any ideas or what this might be (if it&#39;s not just a goat(s) acting like a lunatic) or experienced something similar I&#39;m very curious. Thanks for reading. </p>\n</div>\n","author":"_MyFeetSmell_"}