{"rank":"13","title":"Codes","id":"8mumsk","url":"/r/nosleep/comments/8mumsk/codes/","time":"1527552549000","body":"<div class=\"md\"><p>I received another request, this time from Neil. We collaborated, his voice, my style, as usual. When it came time to post, though, I told him I was apprehensive. I wasn’t worried for myself, but for him and some of the people mentioned in the story. He told me not to worry and that he knows what he’s doing. I don’t know if his confidence is warranted or if his foolhardiness is nudging him again…but who am I to judge? I wish him the best.</p>\n\n<p>Below is Neil’s story.</p>\n\n<p>-----------------------------------</p>\n\n<p>I have a little side business, just something that turns my hobby into cold, hard cash. I’ve got a real part-time job, but the stream trickling from this one isn’t too shabby, and it’s a lucrative way to flex my creative muscle.</p>\n\n<p>It’s simple: you send me a name, number, date, phrase, or anything you find worthy and I’ll create a unique design based off of it. Only you know what it stands for (and me, of course).</p>\n\n<p>It incorporates all the letters and/or numbers and, as per your request, I can make them immediately identifiable, vaguely indicative, or heavily coded. By coded, I usually mean something ridiculous and fun, depending on my imagination and any particular theme the client had in mind. There’s no logic to the method and no two designs are coded the same way.</p>\n\n<p>Most of my clients love it when I tell them how their custom-made design is coded. It’s like the have a pretty little secret no one else knows. I’ve done requests for anniversaries, birthdays, graduations, baby showers, and more.</p>\n\n<p>I usually receive requests via email. Today, though, I’m sitting in the library, waiting for a client who insisted we meet in person. It’s not an odd request, some people just aren’t computer literate.</p>\n\n<p>He also requested I book private study room number two, one of the older rooms with a classic chalkboard and no fancy technology. I’ve been sitting inside for five minutes, playing on my phone, when the door squeaks open and a middle-aged guy peeks in.</p>\n\n<p>“Neil?”</p>\n\n<p>I put my phone down. “Yea…you must be Joel?”</p>\n\n<p>The man nods. He looks weary but alert as he peeks back out, his eyes steadily skimming the interior of the library. He then enters the room and closes the door, setting a chair in front of it before nervously inspecting his surroundings. I try to ignore his paranoid mannerisms as I pull out my sketchpad.</p>\n\n<p>“All right. So, what would you like to immortalize?” I ask jokingly.</p>\n\n<p>“Before we begin, please turn off your mobile and any electronics you have.”</p>\n\n<p>I sigh. Great, one of these wackos. I show him my phone and turn it off in front of him.</p>\n\n<p>“I don’t have other electronics on me,” I assure him. “Can we get started now?”</p>\n\n<p>His nods as he sits down across from me and pulls out a folded envelope from inside his jacket. “It’s written in here. I don’t know what it is.”</p>\n\n<p>“Okayyy…” I reply as I reach out for the envelope.</p>\n\n<p>Joel doesn’t hand it over just yet. “Make sure it’s difficult to decipher.”</p>\n\n<p>“Sure thing,” I say, my hand patiently awaiting the envelope.</p>\n\n<p>Joel still doesn’t relinquish it. “You can read your designs, correct?”</p>\n\n<p>I pull my hand back. “Yes. Look, if that’s a problem for you and you don’t want to do this, it’s cool…”</p>\n\n<p>I make to stand up, but Joel taps his hand on the table. “No, no, that’s good. Stay. I want you to draw it here.”</p>\n\n<p>I give him an exasperated sigh. “Look, pal, I’ve got a class in an hour and these take me three hours minimum, much longer if you want it ‘difficult to decipher’. I’ll have it ready for you tomorrow.”</p>\n\n<p>The man shakes his head. “No, I need it done now, immediately. I’ll pay you ten times your fee for the rush order.”</p>\n\n<p>It’s hard to say no to money. I reach out for the envelope again.</p>\n\n<p>“It won’t be my best work, though,” I warn him.</p>\n\n<p>The man nods and slides the envelope to me. “Don’t show me what’s written on it. Don’t take photos. Don’t say it out loud. Keep everything discrete.”</p>\n\n<p>“No problem, pal. Just let me concentrate.”</p>\n\n<p>I take the envelope and tear it open, only to find it empty. I give Joel a quizzical frown, but he nods encouragingly. I scrutinize the inside of the envelope and notice a short, thin ribbon of paper right along the bottom crease. I take it out. There’s an eight-digit number typed on it. I shrug, I’ve done numbers before.</p>\n\n<p>I sketch out a general outline, coding the numbers the best way I can while trying to keep the design pleasing to look at. After forty-five minutes and three hasty drafts, I carefully create my final design, sign it, and slide it over to Joel, who’d been observing me silently from across the table the entire time.</p>\n\n<p>“You can read this, correct?” he asks as he inspects my work.</p>\n\n<p>“Yes,” I assure him.</p>\n\n<p>Joel unceremoniously tucks my design in his jacket. “Please take your three drafts, fold them in half twice, place them in the envelope with the strip of paper, and give it to me.”</p>\n\n<p>I roll my eyes as I tear the three drafts out of my sketchpad and follow his directions. Joel hastily stuffs the envelope in his jacket before he throws a stack of money across the table. As I reach out for it, he grabs my hand.</p>\n\n<p>I flinch and pull back in offense. “Hey! Wh-” I look up and see his eyes boring into mine with such gravity I abruptly stop talking.</p>\n\n<p>“If anyone asks about the design, tell them it’s for my grandmother’s birthday,” he says firmly. “Gertrude, March 23, 1907.”</p>\n\n<p>Wow, this guy is more paranoid than I thought. “Look, pal, the design is yours. It doesn’t even exist in my portfolio. No one is going to ask me anything, okay?”</p>\n\n<p>He pulls out a small strip of paper and slides it to me. It has two words written on it in neat, tiny print.</p>\n\n<p><em>spike seven</em></p>\n\n<p>I shoot him a baffled expression as he whispers, “Only if someone gives you this phrase do you tell them what the design really says.” He folds the strip and pops it in his mouth, swallowing it. “For everyone else, it’s Gertrude’s birthday, March 23, 1907. Can you remember that?”</p>\n\n<p>“Yes. Ancient Granny Gertrude, March 23, 1907. Got it.”</p>\n\n<p>“Promise me, you’ll never tell anyone without the phrase.” He tightens his grip on my hand. “Promise me.”</p>\n\n<p>“Ow, what’s with the drama, pal?!” I exclaim, trying to shake him off. “I promise, okay?”</p>\n\n<p>With that, he lets go of my hand, thanks me, and exits the study room, leaving me a little bewildered, a little irritated, and a little richer.</p>\n\n<p>…</p>\n\n<p>It’s finals season and I’m cramming like usual down at the library. All of the cubicles are taken, so I’m sharing a four-seater table with a three other students. After a few hours, they leave and others take their place. I don’t pay them any attention, since I’m a little preoccupied with using my retention tricks to try and get my brain to memorize its own anatomy less than a day before my exam.</p>\n\n<p>“Are you Neil?”</p>\n\n<p>I turn towards the person to my left. He isn’t a student. He doesn’t look like a professor either. He’s giving off a shady door-to-door salesman vibe.</p>\n\n<p>“One of many,” I reply. “Who are you?”</p>\n\n<p>“We’re friends of Joel’s,” he says, gesturing to the two other non-student, non-professor men occupying my table. “We believe you knew him?”</p>\n\n<p>It’s been a few months since I met Joel, but that kind of weirdness is hard to forget. He was an edgy fellow and, if these are his friends, I can see why.</p>\n\n<p>I put on an expression of deep thought. “I do some art stuff on the side, he may have been a client.”</p>\n\n<p>The man pulls out a paper from his shirt pocket and unfolds it, revealing Joel’s design. “Art like this?”</p>\n\n<p>“Right, yea,” I reply.</p>\n\n<p>“Joel gave us this. It’s really something. You’ve got talent.”</p>\n\n<p>“Thanks. If you want your own, it’ll have to wait until after finals. I’m swamped.” I pull out one of my business cards and hand it to him. “You can email me and we can go from there.”</p>\n\n<p>I turn back to my anatomy book, hoping they’d take the hint, but they remain sitting. The man to my left slides Joel’s design over the page I’m reading and I look up at him in exasperation.</p>\n\n<p>“What does this say?” the man asks.</p>\n\n<p>“Look, pal, I’m trying to study here. I’ve got a final tomorrow,” I huff.</p>\n\n<p>“Your website says you know what each of your designs says.”</p>\n\n<p>“Right, and I tell the clients how to read them. So, ask Joel if you want to know,” I reply dismissively.</p>\n\n<p>“Joel has unfortunately passed away,” the man informs me.</p>\n\n<p>I look up at him in surprise. “Oh, I’m sorry. My condolences.”</p>\n\n<p>“Accepted. It’s the reason we’re coming to you. We believe he left something important here for us. It would mean a lot if you interpreted it.”</p>\n\n<p>I feel an uncertainty coat my mind as Joel’s paranoia suddenly becomes understandable. What was the code word? Spike seven? These guys didn’t say it, so they get the birthday instead. I rifle through my mind, looking for the trick I used to remember the name and date Joel gave me.</p>\n\n<p>“I don’t know how important a birthdate is, but it’s his grandmother’s birthday,” I reply, buying myself time.</p>\n\n<p>“What is it?”</p>\n\n<p>I sigh, irritated. “I’ve been cramming a billion anatomy terms over the past few hours, I’d be lucky if I remember my own name.”</p>\n\n<p>“The design is right here, just read it for us,” The man says, a smirk dancing on his lips. “You don’t need your memory for that, do you?”</p>\n\n<p>I grumpily snatch the design and pretend to study it. “Gertrude.” I confidently announce, mentally sighing in relief that I remembered. The name is enough to draw out the rest of Joel’s lie. “March 23, 1907. There, are you happy?”</p>\n\n<p>The man smiles as he takes the paper from me. “Thank you, Neil. Good luck on your exams.”</p>\n\n<p>The three men leave, and I shake away the discomfort as I return to my book.</p>\n\n<p>…</p>\n\n<p>Finals are over and summer is making everything humid and sticky. Thankfully, my part-time job is indoors where I sort and file documents tediously until my shift is up. It’s noon and I shuffle along with the herd of white collars to the nearby coffee shop and grab myself some lunch.</p>\n\n<p>On the way back to the office, carrying my iced tea and scarfing down a tuna melt, I feel a firm hold on my elbow. I jump and pull back, dropping the rest of my sandwich as I grab the offending hand and try to pry it off. It’s unrelenting, and it belongs to a rather formidable man in a nice suit. His other hand shifts his jacket to the side, discreetly revealing a gun.</p>\n\n<p>“Neil, come quietly with me, let’s not make a scene,” the man calmly orders.</p>\n\n<p>I look up at him in confusion. “Who are you?”</p>\n\n<p>“Come with me and we’ll tell you.”</p>\n\n<p>He pulls on my arm and I plant my feet firmly on the ground, looking around at the horde of pedestrians passing around us like we’re a boulder in the middle of a stream. They’re all preoccupied with either getting lunch, getting back to work, or getting as intimate as possible with their phones.</p>\n\n<p>“Neil, let’s not make a scene,” the man repeats, inconspicuously flaunting his gun again. “We just want to talk.”</p>\n\n<p>Not wanting to know what he means by “scene”, I hesitantly let him lead me down an alley towards an ominous corner. There, parked in the shade, is a limousine with deeply tinted windows.</p>\n\n<p>The formidable man opens the door and gestures inside, so I cautiously slide in. He slides in right after, sandwiching me between himself and another muscular, suited man to my left. I nervously clutch my iced tea in both hands as I look at the dignified, middle-aged lady sitting across from me.</p>\n\n<p>“Hello, Neil,” she says, smiling pleasantly. “We’re sorry to interrupt your lunch break. This shouldn’t take more than a few seconds.” She pulls out Joel’s cursed design. “If you could decipher this, we’d be much obliged.”</p>\n\n<p>I’m starting to rue the day I met Joel. I don’t want to drag this conversation on any longer than it needs to be.</p>\n\n<p>I pretend to scrutinize the paper before saying, “It’s a birthda-“</p>\n\n<p>“The truth, please.”</p>\n\n<p>I’m taken aback by her accusation, despite it being warranted. “That’s what the client told me,” I reply honestly. “His grandmother’s birthday. Gertrude. March 23, 1907.”</p>\n\n<p>“I don’t doubt Joel told you to say that, but I want to know what’s really hidden here,” the lady says.</p>\n\n<p>I try to hide my nervous gulp. She seems a lot more informed than the shady door-to-door salesmen.</p>\n\n<p>“Look, lady, all I know is that it’s his grandmother’s birthday. If he had something hidden in the date, he didn’t tell me.”</p>\n\n<p>“Neil,” she says with insincere concern, “Joel did you a disservice, getting you involved in his schemes. He wasn’t a good man. He intercepted something that was meant for us. An eight-digit number.” A satisfied smile crawls over her lips. “I can see you know what I’m talking about.”</p>\n\n<p>I curse my candid expressions. “No, I’m just surprised he wasn’t a good man. He was a bit high-strung, but he didn’t seem bad.”</p>\n\n<p>“People aren’t always what they seem, but I knew Joel. And I know he told you to keep the number a secret and I know he told you not to give it to anyone unless they had a code word,” she says, startling me. “I do respect the fact that you’re honoring your client’s wishes, but you should understand that Joel wasn’t of sound mind. The number is very important and we need to know it.”</p>\n\n<p>“I’m sorry, but I can’t help you. I don’t know anything about that. Maybe he gave the number to some other person,” I suggest.</p>\n\n<p>I shrink back slightly as the lady reaches over, plucks my iced tea out of my hands, and places it in one of the many cup holders adorning the limousine’s interior. She then attempts to hand me the paper, but I keep my fists clenched against my legs. She isn’t discouraged and places the design on my lap.</p>\n\n<p>“Neil, forget whatever boogeyman stories Joel told you about us. We’re the good guys.” She reaches into her bag, pulls out a fat envelope, and shows me the contents. “Consider this our appreciation for your assistance.”</p>\n\n<p>It is really hard to say no to money, especially that kind of money, but I hold my ground for the sake of my integrity.</p>\n\n<p>“Look, lady, Joel was a client. He wanted his granny’s birthdate. We exchanged a few words. I gave him the design. He paid me. That’s it.”</p>\n\n<p>“Neil, let’s not make things harder for the both of us,” the lady says as she nods towards the formidable man, who calmly brandishes his gun.</p>\n\n<p>I know Joel was adamant that I don’t reveal the number to anyone without the secret phrase, but he failed to mention it could cost me my life. I’m definitely not willing to die over a promise I made to a deceased, paranoid client who may or may not have been a good guy.</p>\n\n<p>“Fine! Okay…” I say as I snatch the paper off my lap.</p>\n\n<p>The lady smiles and leans back expectantly as I scrutinize my artwork. It takes me a while, but I manage to make out all eight numbers and their order. I feel my mind nudging me, reminding me that promises should not be broken. I nudge it back, reminding it that my life is on the line. My foolhardiness nudges both of us as it suggests I make up a number. So, I do.</p>\n\n<p>To my dismay, the lady immediately makes a call and relays the phony number to the recipient on the other end. I try to keep an earnest expression on my face as I roll the paper up and place it in one of the empty cup holders.</p>\n\n<p>The lady hangs up, pursing her lips the way my mother does when she finds out I’ve gone and done something exceptionally stupid. She picks up the paper, unrolls it, and presents it to me again.</p>\n\n<p>“Neil, I’m afraid that number is incorrect. I’ll give you the benefit of the doubt that you may have misread your work. Try again. We can’t afford another mistake.”</p>\n\n<p>“That’s the number he gave me,” I insist, backing up my lie as I look into her eyes with, what I hoped was, sincerity.</p>\n\n<p>I literally jump out of my seat when the man to my left speaks up. “Let me talk to him alone,” he says, his deep voice measured and foreboding.</p>\n\n<p>The lady barely deliberates his offer before smiling. “Don’t make a mess, Bruno,” she blithely warns as she hands him the paper and begins sliding towards the exit.</p>\n\n<p>Okay, I’m officially ready to accept my cowardice and spill the secret. “N-”</p>\n\n<p>My surrender is interrupted by one of my grunts as Bruno punches me in the stomach. I curl into myself, gasping, as the formidable man and the lady exit the limousine. The formidable man then slams the door shut and stands in front of it, giving Bruno and me inescapable privacy.</p>\n\n<p>I immediately scoot away from Bruno, fully prepared to save him the effort once I stop wheezing and find my voice. Before I can emit a peep, though, Bruno places his hand over my mouth and brings a finger to his in a silent “shh”. This is the exact opposite of what I thought they wanted, but I nod shakily and Bruno retracts his hand.</p>\n\n<p>He shifts in his seat to face me, removes his jacket, and rolls up his sleeves, revealing sinewy arms that could crush me like an autumn leaf. He reaches into his pocket and I involuntarily recoil. Instead of a weapon, though, he draws out a pen. I watch, perplexed, as he writes something on his arm while speaking to me.</p>\n\n<p>“This is your last chance to tell us the number before things get ugly,” he threatens as he tilts his arm towards me to show me what he wrote.</p>\n\n<p><em>limo bugged. don’t talk. spike 7</em></p>\n\n<p>My eyes grow wide as my mouth hangs agape. He points to the “<em>spike 7</em>”, a questioning look in his eyes. I nod in recognition and he begins writing something else.</p>\n\n<p><em>say: I told you what I know</em></p>\n\n<p>“I…I told you what I know,” I nervously comply.</p>\n\n<p>I jump and release an embarrassing squawk as he pounds his fist against the side of the limousine. He then hands me the pen, points to his right arm, and mimes a writing gesture, all while rattling off a mélange of terrifying threats to no one in particular.</p>\n\n<p>I have no idea why we’re doing things the archaic way, but I’m not about to question Bruno’s methods. He did give me the secret phrase, that’s what Joel wanted, so I scrawl the eight-digit number on his giant forearm.</p>\n\n<p>Bruno nods and takes the pen from me, writing hastily as he growls yet another threat, “With one twist, I can have your hand reduced to splinters.”</p>\n\n<p><em>pain beg cry</em></p>\n\n<p>I oblige, putting on the best damn show of my life as I beg him to spare me, cry out in pain, and litter my performance with disgraceful mewling as I try to procure tears. While I’m striving for my Oscar nomination, he’s busy writing a different eight-digit number on his arm. He then precedes it with one word.</p>\n\n<p><em>say</em></p>\n\n<p>I continue my act as I pretend to break and tearfully divulge the new number. He nods, rolls down his sleeves, and dons his jacket before he reaches over to me and folds my arms in a manner appropriate to how you’d support an injured hand. I nod and cradle my limb, the show isn’t over yet.</p>\n\n<p>He knocks on the window to inform everyone the interrogation is over, but it’s obvious the lady was listening in on everything as she’s already on her phone and has a triumphant smile on her face. After she hangs up, she slides back inside the limousine, but the formidable man remains standing outside the open door.</p>\n\n<p>“I’m sorry we had to go through these extremes, Neil,” she says, “but I’m glad you came through for us in the end. We’re the good guys here, we hope there are no hard feelings.”</p>\n\n<p>She tosses the fat envelope to Bruno, who proceeds to shove it into the pocket of my pants before he pushes me towards the door.</p>\n\n<p>“Don’t forget your iced tea, Neil,” the lady says with a complacent smile.</p>\n\n<p>“Keep it,” I mutter as I jump out of the limousine and hurriedly scamper away, cradling my uninjured arm and not looking back.</p>\n\n<p>I think I&#39;ve had enough of my side business.</p>\n\n<p>-------------------------------------------------------------</p>\n\n<p>Other requests:</p>\n\n<ol>\n<li><a href=\"https://www.reddit.com/r/nosleep/comments/8eok60/trust/\">Samantha </a> 2. <a href=\"https://www.reddit.com/r/nosleep/comments/8i0sm2/gullibility/\">Tina </a> 3. <a href=\"https://www.reddit.com/r/nosleep/comments/8lcn54/assumptions/\">Dora</a></li>\n</ol>\n</div>\n","author":"starkframes"}