{"rank":"11","title":"High School Reunion","id":"8muvt4","url":"/r/nosleep/comments/8muvt4/high_school_reunion/","time":"1527554867000","body":"<div class=\"md\"><p>As I was sitting at my desk one night, I got a Facebook message from a guy named Luis. It was an invite to my ten year high school reunion. What caught me off guard was that Luis was hosting the event. He was into football and a bit of a “player”, but I really didn’t take him for an event planner. In fact, I remember him copying my homework and cheating off of my math tests because he was such a slacker. The invite reminded me of how much of a loser I was, so I was surprised that he even wanted me to come.</p>\n\n<p>I always promised myself that I wouldn’t go; I didn’t want to go back to that town full of inconsiderate jerks. Luis was a nice guy and asked me on a date once (shortly after graduation), but he was one of the only nice people from my graduating class. I’m sure he was only nice to me because I helped him pass math, but losers can’t really complain when someone is actually nice to them. Anyway, I logged out of my account and decided to go to bed.</p>\n\n<p>I mean, he didn’t actually think I’d show up, right? I chuckled to myself as I quickly jumped under the covers and turned out my light. I put my sleep mask on and began my journey to dreamland, and that’s when I heard my phone vibrate. Slightly aggravated, I lifted my mask and stared at my phone. It was another message from Luis that read: </p>\n\n<p>“Thanks for responding to the invite! Can’t wait to see you there, Janey”. </p>\n\n<p>The ability to sleep quickly escaped my body, and I clicked on the reunion page in a panic. There was no way that I clicked “yes” to attend the event. From what I could remember, I didn’t respond to the invite at all. I saw that 10 other people had also confirmed their attendance, so I took a deep breath and decided that I would go. There wasn’t a way to change my response anyway. How bad could it be?</p>\n\n<p>In the two weeks leading up to the event, I got my hair highlighted and a fresh mani/pedi. I also picked out a dark green halter style dress that was knee length. It came with a black belt that sat around my waist, and some open toed black heels that gave me a little extra height. I was determined to show up looking flawless; a big change from my old high school clothes which consisted of hoodies and sweat pants. Everyone there was going to wish that they never threw food at me in the lunch room, knocked my books out of my hands, and called me ugly. I felt that it was going to be great, and I would get my revenge on all of those jerks by looking better than ever!</p>\n\n<p>The night of the event showed up and I was a ball of nerves. I put my dress on, styled my hair into loose curls, and slipped on my fancy heels. As I stared into the mirror, I felt a sense of dread. These people hated me in school, so why would I even attend? I’m not pretty enough, smart enough, funny enough...</p>\n\n<p>I was lost in my own thoughts when suddenly my phone vibrated. It was another Facebook message from Luis. </p>\n\n<p>“Hope to see you all tonight! Be ready for dancing, games, and a little bit of booze”!</p>\n\n<p>It was like he knew I wasn’t going to show up, so sending that friendly reminder helped me get my ass in the car and go. I flew all the way out here from Nevada, so there was no point in backing out now. I turned on my music playlist and had my own little concert on the way to the event. I figured that I might as well hype myself up because I’m sure it was going to be an “eventful” night. As I pulled up to my old high school, I began feeling queasy. It took me 10 minutes before I could even get out of the car. The parking lot was packed and I saw people walking up. Some were in fancy clothes, and others wore exactly what they did in high school. It was kind of strange but i knew that I needed to get out of the car. I had to face the people that made my life hell and make them see that it didn’t destroy me.</p>\n\n<p>I grabbed my handbag out of my passenger seat and got out of my car. I counted each step until I reached the front entrance. There was a table with goodie bags for everyone to take. It included those silly glasses with our graduation year, a small bag of popcorn, 1 free ticket for the photo booth, and a note thanking everyone for attending. We had to sign a sheet to show our attendance, so I quickly scribbled my name and then headed toward the gym. It was a short walk from the entrance to the gym, so I entered ready to show everyone what I was made of.</p>\n\n<p>The reunion wasn’t what I expected at all. There were only ten people inside the gym which was strange compared to all the cars outside of the building. I figured that maybe I was in the wrong place and these people just needed a break from the entertainment, so I started walking into the hallway and that’s when I ran into Luis.</p>\n\n<p>“Janey, you aren’t leaving already, are you?”, he said with a mischievous grin. It was the same grin he had in high school when flirting with whatever girl was next to him. I won’t lie, my heart fluttered in my chest.</p>\n\n<p>“No, I’m just looking for the party”. I let out a nervous laugh and smiled. </p>\n\n<p>“This is the party, baby girl. How about I get you a drink and we catch up”.</p>\n\n<p>“Sounds good”.</p>\n\n<p>We started talking and I forgot about the reason why I showed up. I wanted to prove to everyone that I was beautiful and successful; two things that they thought I would never be. It almost didn’t matter anymore. I felt completely calm and at ease with Luis, so we had a few drinks, danced to a couple songs, and then took a photo together in the photo booth. It was a wonderful night, but with every drink I had, I started noticing strange things about the people in the room. </p>\n\n<p>Luis started slurring his speech, stumbling while we were walking, and it looked like he was melting. I began looking around the room and everyone had something wrong with them. A girl named Heather lost all of her hair and curves; she became bone-thin with pale skin. Patrick’s head kept sliding off and he had to reapply it with his hands, Giselle had a bullet hole in her forehead, and the others that I didn’t know well were either missing body parts or melting like Luis. At that point, I felt like I had too much to drink so I told Luis that I was heading home.</p>\n\n<p>“Are you sure, baby girl?”, he asked with a devilish grin.</p>\n\n<p>His lips were sliding off his face, so it confirmed that I needed to head home. I texted Uber for a ride back to my hotel. It was absolutely necessary at that point because I was wasted; I would worry about the rental car later. Luis insisted that we all take a picture together before I left, so all eleven of us stood next to each other and smiled. There was a big flash and I wasn’t even sure who took the picture, but I said my goodbyes and walked back to the front exit to leave. Before I could go, Luis grabbed my hand and kissed me. It was the type of kiss where you felt fireworks and I almost asked him to leave with me. He whispered, “Good night, baby”, in my ear and then walked back into the gym. I stood there for a second before leaving just to really feel the moment and think about what just happened.</p>\n\n<p>As I was heading for the door with my goodie bag in hand, I spotted a girl named Destiny. She was in charge of working the desk, so I waved before placing my hand on the door.</p>\n\n<p>“Janey? Is that you?”</p>\n\n<p>I turned around surprised that she remembered me. “Yes, hi!”</p>\n\n<p>“Oh wow, you look great!”</p>\n\n<p>“So do you, Destiny! Sorry that I didn’t see you in there”.</p>\n\n<p>“No worries. It’s super crowded in there anyway”.</p>\n\n<p>“Haha, really? I only saw ten other people in the gym”.</p>\n\n<p>Destiny look confused for a second before she spoke. “I’m not sure what you mean? Everyone is in the cafeteria”.</p>\n\n<p>“Oops, I saw Luis in the gym so I thought it was there. He’s the one that put everything together, right?”</p>\n\n<p>I could see Destiny’s voice change from confusion to sadness. “Janey, Luis died in a car accident seven years ago. Didn’t you hear about it?”</p>\n\n<p>“No...how could you say something so cruel?! I have a picture of Luis and I right here!” </p>\n\n<p>I slammed the picture down on the table so fiercely that a few goodie bags fell to the ground. I didn’t care because I felt like Destiny was playing a cruel joke on me. How could someone be so mean 10 years later. Destiny looked up at me horrified after staring at the picture, so I grabbed it and threw it into my handbag. I was done with this reunion and I never wanted to come back. No wonder why Luis and the others had their own party in the gym. The other people from our graduating class were still immature and hateful.</p>\n\n<p>I walked outside and waited for my Uber driver to pick me up. The Uber driver didn’t say a word the whole time and I was relieved. I needed time to cool down from the altercation with Destiny. The drive was very peaceful, and before I knew it we arrived at my hotel. When I reached my hotel room, I walked inside and changed into my comfortable pajamas. I grabbed a water bottle and my laptop, got under the covers, and logged into Facebook. A comment was posted on my page from the reunion page.</p>\n\n<p>“Janey, we hope you’re up in Heaven with your sweet angel! Love, the class of 2009!”</p>\n\n<p>I reread the message at least ten times before I could move. I walked over to my handbag and pulled out the picture of Luis and I. In the picture. Luis and I were standing together. He had his hands wrapped around my pregnant belly and we looked so happy. My fingers felt like jello as the picture dropped to the floor. Everything felt completely unreal. Did I really go to the reunion? Is Luis really dead? Why did I look pregnant in the picture when I’m not pregnant?</p>\n\n<p>All of these thoughts kept running through my head. I walked back to my bed and searched for Luis on Facebook. His profile was a memorial page that stated he had passed away in a car accident while he was under the influence. I then searched for Heather and found out that she passed away from cancer. Patrick’s obituary said he was decapitated in a motorcycle accident, and Giselle was shot in the head by a drug dealer who had problems with her boyfriend. I didn’t even have to look up the others at that point because a memorial picture was posted on Destiny’s reunion page. It had everyone’s senior picture that passed away—including mine. </p>\n\n<p>After thirty minutes of panic and denial, I decided that it was time to look myself up. Sure enough, I found my obituary and it said I had died during childbirth along with my baby. The father of my child was Luis. He had passed away only a few months after we did because he spiraled out of control from losing us.</p>\n\n<p>After staring at my phone for hours with tears streaming down my face, I laid down in my bed and put my sleep mask on. It was time to go to sleep; I had an early flight back to Nevada. </p>\n</div>\n","author":"Felonaintillegal"}