{"rank":"20","title":"The old rope swing (Part 3)","id":"8muvy2","url":"/r/nosleep/comments/8muvy2/the_old_rope_swing_part_3/","time":"1527554904000","body":"<div class=\"md\"><p>[<a href=\"https://redd.it/8kwn9e\">Part one</a>]. [<a href=\"https://redd.it/8lxllx\">Part Two</a>].</p>\n\n<p>What do you do when you have the sneaking suspicion that your old imaginary friend might be real? What do you do when your family disappears <em>because</em> your imaginary friend might be real?</p>\n\n<p>What do you do when it is 1:15 in the morning and you find yourself searching for your family in vain in a dark forbidding woods?</p>\n\n<p>I’ll tell you what you do: you drink.</p>\n\n<p>Sure, prayer was an option, and yes, pragmatic planning might have got me further, but at that moment? I grabbed a flashlight from my sister&#39;s garage and had more than a swig of whiskey.</p>\n\n<p>It did not calm my nerves.</p>\n\n<p>I knew where I was going, but I had not remembered it being so far away. The trees ahead of me twisted upward from the ground in wicked curves. The growth was not just old but was also half burnt from forest fires and lightning strikes. The tree&#39;s charred sides crawled upward like blackened scales. I know that this is silly, but more than once I thought the branches were reaching out to me, their ends like elongated fingers on an ancient skeleton. I wished for more whiskey.</p>\n\n<p>I don’t know how much of what I was presented with that I believed in. My happy childhood memories were false, and my niece was <a href=\"https://revfitz.com/forget-man/\">drawing similar morbid drawings as I had</a>. I didn’t even remember our town’s history. Yet, as I walked through the twisted wooden spires of trees things slowly came back to me. As I walked by a tree with low hanging branches I recalled that our town used to persecute witches and heretics. The accused had no trials, and they were hung upside down by their feet from trees. If the blood pressure did not get them, then the sun or dehydration would. I even recalled a school project where I made a paper tree for a presentation. How could I forget that? The answer was in the name of my imaginary friend. The Forget Man.</p>\n\n<p>I trekked on. The old rope swing, <em>if</em> that is what it ever was, was only a mile further. Why would we play this far out?</p>\n\n<p>Memories, well, they don’t come “flooding back to you”, they leak in slowly and sometimes without context. There was a song we sang growing up, one that I had not thought of until then. It was grisly, like all nursery rhymes. <em>♫ A neck is unfit for a working-class rope…</em> I remember singing it at recess, I remember humming it in the woods.</p>\n\n<p>I remembered playing by the tree. There was no rope swing, but there was rope…</p>\n\n<p>More than once I stopped in my tracks, I reconsidered what I was doing. Would it have been better to call the cops? But what would I tell them? Would it have been better if I came armed? But to shoot <em>what</em>? The woods were silent save for my heavy footfall. Only the sound of snapping twigs followed me. I swallowed my nerves down and continued forward. <em>♫The gallows are too good for a witch with no hope</em>. My flashlight cut the night like a knife, revealing rocks that were too jagged, and branches that looked <em>agonized</em>.</p>\n\n<p>There was no clearing that I came to, no revelation behind a hill. There was no rope swing, but there was a rope. The old tree was just there, a rope slung over a branch.</p>\n\n<p>My sister on one end of it.</p>\n\n<p>I ran to her. Her hands were bound behind her, her feet tied to one end of the rope. She was not hanging, at least, not yet. An overwhelming sense of déjà vu overcame me as I looked at her under the light of my flashlight. <em>♫Tie them by their dirty feet where they won’t get soap</em>. Memories of us as children played out this exact scene. Me: singing the song. Her: tied up and trying not to cry. She would be brave until the last line of the song. She would be brave until I mentioned <em>Him</em>.</p>\n\n<p>Her eyes squinted at the brightness of the light. I called out to her as I came nearer. She looked dazed. <em>What was the last line of the song?</em> my mind inappropriately interjected as I looked around for Kaylee. “Are you okay?” I asked, “What happened?”</p>\n\n<p>Her eyes fluttered and her mouth moved sluggishly. Her words were slurred but desperate. “You… you drugged me…” she said.</p>\n\n<p>I set the flashlight down and rolled her on her side. The knots were complicated and undisciplined. “I didn’t drug you,” I said unable to hold the bitterness from my tongue. She had kicked me out of the family, kicked me out of Kaylee’s life and <em>still</em> I came looking for her. I was not happy about the accusation. &quot;What happened, where&#39;s Kaylee?&quot;</p>\n\n<p>She did not respond. Her eyes closed and her neck went limp. Her breathing shallow. Whatever she was dosed with was strong. I went to work on the knots. I caught myself humming. Humming that <em>damned</em> tune. <em>What was the last line</em>?</p>\n\n<p>The knots were childish. It was probably Kaylee’s work. But how would she drag her mother out, especially out this far? She wasn’t near strong enough, she would need help.</p>\n\n<p>Help from <em>Him</em>.</p>\n\n<p>The snap of twigs rang out in the air, behind me. I turned quickly and gripped the flashlight tight. The lone figure of a little girl shone in the light. It was Kaylee. I ran to her and clutched her tight to my chest. It was no small relief to see that the child was alive. Yet, even then the tune marched on in my head, unabated by my horrors or experience. I held her in front of me as I knelt on one knee. “Are you okay?” I asked, “What are you doing out here?”</p>\n\n<p>She laughed. She laughed as if this were a fun game and as if I had asked a silly question. “I’m waiting,” she said. Then skipped over to the other side of the tree. Humming that damned tune.</p>\n\n<p>“Waiting for what?” I asked with hesitation.</p>\n\n<p>Kaylee kept humming the tune. <em>What was that last line?</em> She reached down then handed me the end of the rope.</p>\n\n<p>“For an Adult,” <a href=\"https://revfitz.com/category/nosleep/\">She said.</a></p>\n</div>\n","author":"revfitz"}