{"rank":"0","title":"Every time I take a nap I experience sleep paralysis","id":"8muw4f","url":"/r/nosleep/comments/8muw4f/every_time_i_take_a_nap_i_experience_sleep/","time":"1527554950000","body":"<div class=\"md\"><p>I can no longer take a nap without experiencing sleep paralysis. If you are unaware of what &quot;sleep paralysis&quot; is, it is, according to the National Health Service of the United Kingdom, &quot;a temporary inability to move or speak while falling asleep or upon waking.&quot; This occurs because our bodies are paralysed during &#39;REM sleep&#39; to prevent the acting out of dreams. Sleep paralysis can occur when falling asleep or waking up during this phase. So pretty much dreams are projected onto the real world, and one is paralysed and cannot do anything to get out of the situation. This can make for some pretty awesome to pretty torturous experiences. </p>\n\n<p>This all started in college, I became a regular &#39;napper&#39;. Then randomly I started having these experiences and they were terrifying and would occur every single time I took a nap. I would go to take a nap and within the first ten minutes I would wake up paralysed and get attacked by something, sometimes a person, a creature, a demon. Then I would eventually wake up from that and fall back asleep and be fine. This then started happening every single time I took a nap. I eventually got better at making myself aware that I was dreaming and could manage to wake myself up if I knew I was dreaming. Sometimes though it seems impossible to tell, and you can start to panic and make the situation worse. Oh, and if I don&#39;t take a nap then I will guarantee have one that night when I go to sleep. </p>\n\n<p>They weren&#39;t all bad though. One pleasant experience I can recall my body began to float, and I remained paralysed, but was floating around the apartment. It was a nice sensation. Though these pleasant  experiences are few. </p>\n\n<p>Now, I have discovered something about these dreams that I have during my sleep paralysis, they foreshadow what is to come. I just cannot always understand what until after the fact. </p>\n\n<p>Oh and let me make clear, the pain I am inflicted during these sessions feels completely real to me. It can become an existing Hell. I sometimes wonder if it actually is, and this is the devil trying to influence me. It becomes nearly impossible sometimes to convince yourself it&#39;s a dream while it&#39;s happening. </p>\n\n<p>Well my latest experience was one of my worst, and I have no idea what it means. I fell asleep on the sofa in my living room. I suddenly found myself paralysed only being able to move my eyes. I could hear water running in the background, and then suddenly these six all black figures entered the room and crowded around the sofa staring at me. Then all of a sudden they turned into water, and that was when I noticed the room was filling up with water, fast. I started to panic in my head, I was sure I was going to die. I started to slowly realize this was a dream, but not fast enough to compete with the water which was now nearly engulfing my face. As I started to take water up my nose, I used all the strength I could manage and moved my right arm up, this apparently woke me up, my eyes opened and I was dry on the sofa able to move. </p>\n\n<p>Any ideas on the meaning? I&#39;m not going on any trips near water or having anything to do with water in the near future. </p>\n\n<p>Any questions feel free to ask, I&#39;m sure I inadequately, explained a lot and happy to clarify.</p>\n</div>\n","author":"Chairman_Meows"}