{"rank":"0","title":"Summoned A Demon and he asked me for my heart","id":"8muy69","url":"/r/nosleep/comments/8muy69/summoned_a_demon_and_he_asked_me_for_my_heart/","time":"1527555497000","body":"<div class=\"md\"><p>Let me start from the beginning.</p>\n\n<p>I was in high school, my teachers were disappointed in me, my parents were disappointed in me and my friends were too. It was until a point where all my friends abandoned me and my parents didn’t seem to care anymore. Then I remember  i got told that you could summon a demon if you went to your bathroom room and removed all the lights and put a candle and performed a kind of ritual to summon him. Before I thought it was a load of bullshit, but now it is my only hope. So i followed the instructions and, at first, nothing happened and then I heard.</p>\n\n<p>“What do you want, earthling?”, his voice boomed across the room.</p>\n\n<p>“I want to have a girlfriend, my friends and a lot of money!” I said</p>\n\n<p>“Very well, I shall fulfill your wish, but there is a cost if you do not mind” he said</p>\n\n<p>“I am prepared for anything in exchange for what I just mentioned!”I said, full with confidence</p>\n\n<p>“I want your heart.” He said</p>\n\n<p>Me, thinking it was a joke, accepted the offer.</p>\n\n<p>The next morning, I wake up in a fancy bed with a shout “Baby breakfast is ready!” </p>\n\n<p>I don’t understand what is happening until I remember, the demon, he has fulfilled my wishes!</p>\n\n<p>I live a happy life with my girlfriend apparently named Clara.</p>\n\n<p>Until a few years later</p>\n\n<p>The demon reappears in front of me and my girlfriend, and he says,</p>\n\n<p>“Earthling, I now ask for what you promised to give me”</p>\n\n<p>“I dont understand..” I stammer “What do you mean?”</p>\n\n<p>“Didn’t we have a deal?” He says</p>\n\n<p>“What deal????” My girlfriend responds.</p>\n\n<p>Adam wanted a girlfriend, his friends back and a lot of money and he told me he would give his heart for it.</p>\n\n<p>“It isn’t fair! I thought the heart part was a joke!” I said </p>\n\n<p>“Too late earthling” and his hand goes through my chest and takes the heart and replaces it with an artificial heart</p>\n\n<p>I am knocked out and don’t remember anything.</p>\n\n<p>I wake up in that same fancy bed but I feel like something is very wrong, like I am missing a part of me.</p>\n\n<p>I summon back the demon</p>\n\n<p>“Why do you summon me again?” </p>\n\n<p>“Why am I feeling like something is very wrong?!”</p>\n\n<p>“Hahaha, since I have your heart, you will not feel any emotion and have no personality.”</p>\n\n<p>“THEN HOW AM I STILL ALIVE IF I DONT HAVE MY HEART!”</p>\n\n<p>“I replaced it by an artificial heart, designed to keep you alive”</p>\n\n<p>“WHY KEEP ME ALIVE, WHAT DO YOU WANT FROM ME!”</p>\n\n<p>“I want to watch you suffer.” </p>\n\n<p>And with that, he vanishes out of thin air.</p>\n\n<p>I try the ritual again and again, it does not work..</p>\n\n<p>I feel very empty.</p>\n\n<p>I look at the mirror.</p>\n\n<p>The demon is laughing, at me.</p>\n\n<p>I find a note, I read it.</p>\n\n<p>Hello, Adam,</p>\n\n<p>I have been watching you, you are really a special human,  and so, I have decided to give you a chance to get your beautiful heart back, there is a portal somewhere in your world leading to mine, if you magically find the portal by luck, then enter it and you will be in my world, but be careful, if you die in my world, you won’t go to heaven like you are supposed to but, to hell.</p>\n\n<p>Sincerely,</p>\n\n<p>Savitar</p>\n\n<p>Edit: Part 2 releasing tomorrow morning or today afternoon</p>\n</div>\n","author":"MaladamA"}