{"rank":"10","title":"I've been terrified of sleepwalkers for years now.","id":"8mv02v","url":"/r/nosleep/comments/8mv02v/ive_been_terrified_of_sleepwalkers_for_years_now/","time":"1527555998000","body":"<div class=\"md\"><p>For the past 5 years I&#39;ve been terrified of sleepwalkers. </p>\n\n<p>I always used to think people sleep walking was funny, I used to sleepwalk a lot and heard the stories from my mother and we always had a laugh at what I got up to. This was until my younger sister Kerri started sleepwalking too.</p>\n\n<p>According to my mum most people in our house at some point when they were younger had a phase of sleepwalking and now it was Kerri&#39;s time. At first she would just walk to the living room and sit and watch TV with my mum until our mum told her to go to bed.</p>\n\n<p>After a week on and off sleepwalking she no longer went into the living room to watch TV, she now started standing at her bedroom door with it wide open. At first I found it creepy as her room was at the end of the lobby and had to walk up there to use the toilet, but the more it happened the funnier it became to me. </p>\n\n<p>The first weekend we stayed at our dads house since she started sleepwalking, we only stayed there one weekend a month so she had changed her actions while sleepwalking a fair bit since she started. </p>\n\n<p>The events that happened this weekend will haunt me forever and make it a weekend i&#39;ll never forget.</p>\n\n<p>At my dads house I didn&#39;t have a TV in my room so often I fell asleep watching TV in the living room and just go upstairs if I wake up during the night. Well the first night was no different my dad and Kerri both went to bed around 10 so I was left by myself just like every other weekend. I sat watching TV for a good hour or two before I decided to go get something to eat, I got my food then made my way back to the living room where I noticed Kerri was standing at the top of the stairs staring down at me whilst taping her foot.</p>\n\n<p>&quot;Jesus Christ you scared the life out of me.&quot; </p>\n\n<p>No response. This was the weirdest thing she has done sleepwalking yet. I went to the living room and started eating still freaked out about what happened. Around 10 minutes later I looked out the glass in the living room door to see if she was still there and too my shock I see her take one step down the stairs, I can only see her feet through the banister. She takes another step down.</p>\n\n<p>&quot;Go to bed, Kerri&quot; I quietly shouted to her. </p>\n\n<p>To my surprise she moved back up stairs and went to bed. The floor boards in my dads are very creaky so I listened to her walk all the way back to her room just to be sure. </p>\n\n<p>In the morning I told my dad and Kerri about it, they both found it a lot funnier than I did.</p>\n\n<p>&quot;I bet you were scared.&quot; Kerri said while laughing.</p>\n\n<p>I nervously just laughed and said &quot;Na it was funny.&quot;</p>\n\n<p>I thought nothing more off it and went about my day. The Saturday night started off similar as the previous, everyone else was in there beds early and I sat watching TV, I sat for an hour before I heard a door upstairs creek open. Nothing unusual I knew it was Kerri as her rooms door was the only one that squeaked when opening or closing.</p>\n\n<p>I heard the floor creaking as she walked down towards the stairs then, nothing. I muted the TV to listen if she was still moving, all I heard was faint tapping noise. At this point I was kind off freaked out but thought nothing off it as it could of just been her letting our cat out her room.</p>\n\n<p>A couple of minuted passed then I seen what I had seen the previous night all of a sudden she took one step down the stairs. Then another step. And another, until all the way to her knees were showing. Again I muted the TV.</p>\n\n<p>&quot;Kerri?&quot; I nervously shouted.</p>\n\n<p>Silence. </p>\n\n<p>I continued looking until I noticed her knees bending, she slowly bent down and began looking at me. </p>\n\n<p>She was staring at me with a blank face and wide eyes. I was really freaked out by this point but a small part of me thought she was paying a prank on me by doing what I said freaked me out the night before, around the time this happened I was in my first year of High School and was very big for my size, around 6&quot;2 and 180 pounds and thought I was untouchable. So instead of being scared I thought I&#39;d get the last laugh and go confront her about it. </p>\n\n<p>This was a massive mistake on my behalf.</p>\n\n<p>I stormed out the living room and confronted her.</p>\n\n<p>&quot;You think you&#39;re funny don&#39;t you?&quot; No reply was given.</p>\n\n<p>I started waving my hand about her face trying to make her flinch and give her terrible prank away. To my surprise she didn&#39;t so much as bat an eye. At this point I was getting freaked but thought fuck it and went to the toilet. I was in the toilet for 1-2 minutes but when I exited Kerri was still bent on the stairs looking blankly to where i was sitting in the living room. I was actually getting really scared at this point but I tried to not let it show and went to get some food from the kitchen.</p>\n\n<p>I got some food and left the kitchen and saw Kerri, she was no longer bent over on the stairs. She was at the bottom of them staring directly at me.</p>\n\n<p>I visible jumped back backwards a bit from the fright but that but that fright was nothing compared to what followed in the next 30 seconds. </p>\n\n<p>After seeing me jump back Kerri gasped and started running up the stairs away from me, I in my bad judgment followed her upstairs to make sure she is goes back to bed.</p>\n\n<p>I slowly walked up the stairs looking through to banisters as I walked up to try and see her. But to my surprise, nothing.</p>\n\n<p>No creaky floor, no squeaky door. All the other doors were shut, she wasn&#39;t there. She just disappeared.</p>\n\n<p>I sat up the rest of the night not leaving the living room for anything, I finally fell asleep around 5 am from sheer exhaustion. </p>\n\n<p>I never told Kerri about this time. Nor did I ever stay in the living room late at night ever again.</p>\n</div>\n","author":"ChiefBeef1888"}