{"rank":"2","title":"Waiting","id":"8mv1qx","url":"/r/nosleep/comments/8mv1qx/waiting/","time":"1527556451000","body":"<div class=\"md\"><p>I was walking in the woods one day. It was in the middle of January, and the wind was blowing. Snow was biting at my face and my feet were numb. While walking home from school, I got lost. My family lives on the side of a road that passes near the woods. My brother made a path I could follow through the woods, but since the snow covered it, I got lost. I was walking blindly and there were tears frozen on my face, they stung too. I remember falling to my knees, praying to God, until I saw a figure in front of me. </p>\n\n<p>It was a feminine figure; I could see her hair blowing behind her head.  </p>\n\n<p>She was wearing a dress, and she wasn’t wearing any shoes.  </p>\n\n<p>I got up slowly and walked towards her. </p>\n\n<p>The first weird thing I noticed was that she wasn’t covered in snow. Not a flake of snow was stuck on her. Her feet, God, her feet should&#39;ve been cold, but she didn’t show any sign of pain. </p>\n\n<p>&quot;Hello? Who are you?&quot; I asked. </p>\n\n<p>She stared at me still. It looked as if she was crying too. </p>\n\n<p>&quot;I think I&#39;m lost. I&#39;m scared and cold.&quot; She said. Her teeth were chattering, but she wasn’t shivering. </p>\n\n<p>&quot;Me too,&quot; I said, &quot;what&#39;s your name?&quot; The wind was blowing so hard that I had to shout the last few words. </p>\n\n<p>&quot;I&#39;m Mia.&quot; She muttered. </p>\n\n<p>&quot;I&#39;m Oscar.&quot; I said, &quot;Where do you live? Do you live near here?&quot; I asked. The wind had died down a little, but it was still fierce. Still bitter cold. </p>\n\n<p>She looked frightened at my question. She stepped back a few paces and then fell. I walked towards her to help her up, but she scooted back on all fours. She put her arm over her face and started to cry again. </p>\n\n<p>&quot;Don&#39;t worry, I&#39;m not going to hurt you.&quot; I said. My heart stopped for a few seconds when I realized that she hadn&#39;t left prints in the snow. </p>\n\n<p>&quot;The other boy did though, he hit me hard. I don&#39;t want you doing the same thing.&quot; She said, still crying. </p>\n\n<p>&quot;Okay, but will you come with me? I&#39;m lost and cold too.&quot; I asked. </p>\n\n<p>She nodded slowly. I slowly reached my hand out and offered to help her up. At first, she hesitated, then she grasped my hand. Her hands were burning with cold. Almost as cold as my hands were. The wind had stopped, and the sun was out. Finally! </p>\n\n<p>&quot;So, where do you live?&quot; I asked. </p>\n\n<p>&quot;I live near the woods, like on the side of a road.&quot; She said. Her teeth were still chattering. </p>\n\n<p>&quot;No way! So, do I!&quot; I said. </p>\n\n<p>&quot;Really?&quot; She asked. </p>\n\n<p>&quot;Yeah.&quot; I said, &quot;You see, I lost my way going home. I&#39;m not even sure if I&#39;ll find my way back.&quot; The fear crept back into my gut as I said those words. Would I ever get back home? Would I ever get to see my brother and family again? That I didn’t know. At least, not then. </p>\n\n<p>&quot;What do you say we head north?&quot; I said, &quot;Maybe there is a shelter where you can get yourself some warmer clothing.&quot; </p>\n\n<p>She didn’t act cold at all though. I was still cold though. </p>\n\n<p>I had some American eagle jeans on, along with a jean jacket, a snow hat, some gloves, and a plaid, button up shirt. My hair was down to my shoulders and it blew in the wind, which had started again. My eyes were storm gray and I had braces. I have a perfectly normal name too. Oscar Davidson. </p>\n\n<p>&quot;Sure, we can head north.&quot; She said. </p>\n\n<p>So that’s what we did, we headed North. It turned out that I had a compass in my jacket. We traveled a few miles and I was starting to lose feeling in my legs. The sun was going down quickly. Mia had her arm clutched around my elbow. I&#39;d say it was around 6 p.m. before I saw a shelter. </p>\n\n<p>While I was walking with her, I felt a feeling I had never felt before. A warm feeling, inside my heart. It made all the fear disappear and all the pain go away. It was this sense of happiness, this sense of love when I was with her. I felt like I had known her forever. </p>\n\n<p>&quot;There! There! It&#39;s a house, you see it?&quot; I shouted. </p>\n\n<p>&quot;Oscar,&quot; She said, &quot;don’t go there.&quot; </p>\n\n<p>&quot;Why not?&quot; I asked. </p>\n\n<p>&quot;You will not like what you see.&quot; She said, warningly.  </p>\n\n<p>&quot;I&#39;m still going to check it out, to see if there&#39;s clothing for you.&quot; I said. </p>\n\n<p>&quot;I don’t need clothing Oscar. I&#39;m-&quot; But I didn’t hear the last thing she said. I was already off towards the house. When I got closer, I realized that it was my house. I ran towards it with all my might. A spark of hope in my chest. Under all the excitement though, there was a dark feeling. A sense of foreboding. By the time I got there, my chest was burning, and I was gasping for air. I looked at my house and it was abandoned. Moss and snow had covered most of it and the wood rotted on one side. It was a 2-story house with a porch in the back. The back porch had collapsed. Snow covered most of it. I screamed in anger and rage and went back towards Mia. </p>\n\n<p>&quot;What is this?&quot; I yelled at her. </p>\n\n<p>“I tri-&quot; She started. </p>\n\n<p>&quot;You what? Yeah, that’s what I thought. Where&#39;s my family? Where&#39;s my brother?&quot; I yelled. </p>\n\n<p>&quot;They&#39;re dead...&quot; She said. </p>\n\n<p>I stared at her in shock. </p>\n\n<p>&quot;And so are you Oscar.&quot; </p>\n\n<p>I stood there for a moment. Not ready to believe the horrible truth. I looked behind myself, ready to see footsteps, but I didn’t see any. I sank to my knees and dug my fingers into the snow. It was cold, but when I lifted my fingers up, there were no indentations.  </p>\n\n<p>&quot;Are you dead?&quot; I asked, trying to act calm. Trying not to lose myself. </p>\n\n<p>&quot;Yes I am.&quot; She said, sadly. </p>\n\n<p>&quot;Did you know at first?&quot; I asked. </p>\n\n<p>&quot;No,&quot; She said, &quot;not until we started walking, but I didn’t want to tell you because I didn’t want to scare you.&quot; </p>\n\n<p>&quot;I&#39;m sorry for yelling at you.&quot; I said, hanging my head down, crying, &quot;What do you say we go somewhere else, and, um, stay with each other. Since we&#39;re dead, you know.&quot; I asked desperately. </p>\n\n<p>&quot;You have to stay in these woods until you are saved.&quot; She said, choking up. </p>\n\n<p>&quot;What do you mean saved?&quot; I asked. It was starting to get dark. </p>\n\n<p>&quot;Someone has to save you. You saved me, you made me believe in you and you made me believe there was hope. I never thought I&#39;d say this, but, I love you.&quot; She said, shyly. </p>\n\n<p>&quot;You saved me too Mia. I love you too.&quot; I said.  </p>\n\n<p>She looked at the ground and I could see tears shimmering into the snow. </p>\n\n<p>&quot;I don’t want to leave you Oscar.&quot; She said, choking on tears. </p>\n\n<p>&quot;What?&quot; I asked. I walked closer to her. </p>\n\n<p>&quot;When two ghosts are saved at the same time,&quot; She started, &quot;one must go and the other has to stay on Earth until they are saved.&quot; She said, and then she burst into tears. </p>\n\n<p>I hugged her close to me and kissed her on top of the head. I noticed a huge gash on the side of her head. </p>\n\n<p>“I can stay here.&quot; I said. </p>\n\n<p>&quot;No!&quot; She said, “I want to be with you. I love you.&quot; She exclaimed. </p>\n\n<p>&quot;You have to go Mia,&quot; I said,” I can stay here and wait, it alright.&quot; I said soothingly. </p>\n\n<p>&quot;Please, you go, I-&quot; She started. </p>\n\n<p>&quot;No Mia,&quot; I said, &quot;you have to go. </p>\n\n<p>I never realized how beautiful she was until I looked at her fully. Her hair was dark red; her eyes were an ocean of green and her skin was pale.  </p>\n\n<p>She was so gorgeous. So beautiful.  </p>\n\n<p>&quot;I want to see you again,&quot; She said, &quot;we had an adventure while it lasted. Almost like a short relationship, that lasted an eternity.&quot; Then, she laughed. She laughed! </p>\n\n<p>&quot;I want to see you again too, I, um, see you.&quot; I said nervously. </p>\n\n<p>I didn’t want her to leave then. I feared being stuck on Earth. </p>\n\n<p>&quot;I don’t know how long it will be.&quot; She said. </p>\n\n<p>&quot;Well,&quot; I said, &quot;there&#39;s a tree right here. I&#39;ll be waiting here.&quot; I said. </p>\n\n<p>She stood right in front of me, her face close to mine, and she kissed me. Full on the lips. It was electric. Almost heart stopping. After she pulled away, she pulled out a white rose, with a single red petal. </p>\n\n<p>&quot;This is for you.&quot; She said, &quot;I will love you forever.&quot; She said. </p>\n\n<p>&quot;I love you too Mia, more than you&#39;ll ever know.&quot; I said. More tears had frozen on my face. </p>\n\n<p>With that, she stepped back and vanished. It was as if the wind had blown here away. I can&#39;t help but think if she was my only true love. Was she? I guess I&#39;ll have to wait and see. I&#39;m sitting against the tree now, writing this. The snow has started up again; it&#39;s so beautiful, just like Mia. Big flakes are falling to the ground. </p>\n\n<p>&quot;Click...click...click...&quot; </p>\n\n<p>Thankfully, I have a few journals to write in. For now, I think I&#39;ll sit here and watch all the snow come down. The weather is still cold, still bitter cold, but hopefully it will be better soon. </p>\n\n<p>All that matters are that I see here again. </p>\n\n<p>I can&#39;t wait till then.  </p>\n</div>\n","author":"Dan100903"}