{"rank":"0","title":"Hanging Hallucinations","id":"8mv27j","url":"/r/nosleep/comments/8mv27j/hanging_hallucinations/","time":"1527556572000","body":"<div class=\"md\"><p>“No your not coming” Steven said. “Why not? I love the woods their creepy!” “Because I’m taking my girlfriend. I need alone time” “Fine” I said just over a whisper. He walked out the door. Steven could be a bitch but not like this. He always made me question if he really was my friend and not a guy that’s using me for snacks I buy for him at the gas station. I looked out my window and watched him throw his car into reverse with his girlfriend Linda at shotgun. God damn her. </p>\n\n<p>A woman who has had 12 boyfriends goes out with my best friend and changes him. Than a idea popped into my mind I still wish I could just erase. Maybe I could follow him to see what their up too! Looking back on it, that’s a creepy move. They were still rounding a corner. I put my shoes on, and stepped into my Mercedes. I jammed my key in the keyhole and put it into reverse the same way Steven did, mocking him. I drove forward and waited for him to catch up. He didn’t see me so I was okay to go. Steven went first and my car drove behind his as if their were a magnet. </p>\n\n<p>I than started to realize I was acting like a creep and decided to get behind a few other cars. When they got to the hiking trail I was surprised Steven hadn’t even seen me. I was still in my car when they began to walk. I got out like a creeper and followed. As soon as I took my second step into the woods I saw something that will forever be burned into my mind. A long way ahead of me I noticed a rope on a branch. I looked closer in confusing to see a neck tied onto it. I froze. How did Steven and Linda not see this? That was a man. </p>\n\n<p>I don’t remember anything after that but my vision becoming blurry. When I woke up I was in my bed with my covers tucked over my body. At first I passed it off as a bad dream because I just woke up. I went into my kitchen and made coffee. Thoughts came into my mind. ‘If it was a dream why did it feel so real?’ ‘It can’t be real because I would have woke up in the woods again instead of my bed’, ‘But that could have been Steven noticing my passed out self and took me back home’. ‘But wouldn’t he be here?’. I stopped thinking about that because I knew I couldn’t answer those myself. As soon as I made coffee I went into the living room and watched TV. While commercials were on a noticed on the left corner of my eye 2 dark figures. </p>\n\n<p>At first I thought it was just my paintings I had bought. But when I came into the kitchen to make breakfast I saw it. 2 of the same men with ropes around their necks hanging from my ceiling. I screamed in terror. How the hell is that possible? I continued screaming until I heard the noice of police sirens in the distance. Someone had called the police. I heard banging on my door with people yelling that it was the police and at the same time, hearing the static voices from walkie talkie’s. I opened the door. I saw 6 police men at my doorway. </p>\n\n<p>One gave me a weird look probably because of my condition at the moment. I told them to come inside. They all marched in. “What’s the problem here? Someone called us!” I heard someone say. “I screamed when I found 2 hanging bodies coming out of my ceiling. They all paused and slowly looked at me. A cop shook his head in disbelief while he said “What?”. “Come on I’ll show you” I said as calm as possible. </p>\n\n<p>I slowly went into the kitchen and pointed where the bodies were. “Ok where is it buddy?” Someone said. What? I was literally pointing straight at it. You can’t miss it! “I’m pointing at it right now. 2 hanging bodies with the same person.” I said in desperation. The cops all gave each other worried glances. “Give is a call if you need us again. Ok?”. I nodded. They all quickly moved stepped out. I took another look at where the bodies were again. They were gone. </p>\n\n<p>I stared in confusing. They were right there! At this point I knew I was crazy. If the cops didn’t see what I was looking at than what was happening. Me being crazy was the only option. I didn’t know how to react to all of this. I walked over to my bedroom and took a nap. </p>\n\n<p>I woke up forgetting about yesterday. My normal routine for when I wake up was texting Steven but I don’t think he would wanna talk to me anymore about what just happened. I later found out I got off lucky the cops didn’t put me in a ward. I probably deserve to be there though. If I was seeing something I only could, than it’s not just a hallucination. </p>\n\n<p>That thought hit me. Maybe it was a hallucination. After all the body I found in the woods could have been real but it put shock to me, causing me to see it again. That put a smile on my face. I thought maybe a walk in the park couldn’t be bad. So that’s exactly what I would do. </p>\n\n<p>When I was done getting ready for the day I got into my car and drove. I got onto a road with a few trees here and there with a couple of restaurants. Than something caught my attention. As I was driving I noticed something, it was 4 ropes. When I was driving by it, it came more into view. 4 of the same person was hanging by their necks. “WHAT THE FUCK!” I yelled. I continued looking at it in horror, not knowing I was still driving. The last thing I remember after that was hitting something that flipped my car. </p>\n\n<p>I woke up in a hospital bed with my parents sitting in a chair to my left. They gasped when they saw I was up. They went over to me and wrapped their arms around my body. I cracked a smile. “Your finally awake!” My mom said in joy. “How long have I been asleep?” I asked. </p>\n\n<p>“2 weeks”. Wow. Was the accident really that bad? I was to scared to ask how many bones I had broken. For the rest of the time we talked avoiding the subject of my accident. It took about 3 weeks to finally get out of the hospital and when I finally was out, I was on a wheelchair. I went home that day, and texted Steven first thing. </p>\n\n<p>Me: “Hey man. Can we talk we haven’t in a while”. \nIt took him a minute to answer </p>\n\n<p>Steven: “The hell do you want”</p>\n\n<p>Me: “Just wanna talk”</p>\n\n<p>Steven: “Well your not getting a ‘talk’. \nMe: “Why?”</p>\n\n<p>He didn’t respond to that. ‘That was really fast’, I thought to myself. I walked into my room to read and escape from reality when I saw it again. 6 of the same damn person hanging from my ceiling</p>\n</div>\n","author":"Robert_Walter68"}