{"rank":"25","title":"Camping Will Never Be The Same","id":"8mv4bb","url":"/r/nosleep/comments/8mv4bb/camping_will_never_be_the_same/","time":"1527557123000","body":"<div class=\"md\"><p>I&#39;ll never forget the time that my friend and I decided to take an impulsive camping trip during the winter of 2006.</p>\n\n<p>Had my parents not been out of town that weekend, they never would have let me go, especially not with the friend I was going with.</p>\n\n<p>They had never liked Travis. Out of all the friends I ever had, Travis was the one they hated the most. They would always say that he was a bad influence, and they weren&#39;t entirely wrong either. Thankfully, I was a smart kid, and I always saw through Travis&#39;s bullshit. </p>\n\n<p>As for his parents, they never really cared what he did or where he went. This blew my mind. How awesome it would have been if my parents didnt care what I did. After the camping trip, I&#39;m kinda glad that they did. </p>\n\n<p>Travis insisted that I be the one who brings the food, and he brought the gear. His basement was full of all kinds of shit that his parents hoarded over the years, and so finding camping gear wasn&#39;t much of an issue. </p>\n\n<p>We bundled up and hiked through the woods right behind our school. This would have been around nine at night. We walked for about an hour until we found a neat little clearing of trees to set up. We pitched the tent, and after about twenty minutes of trying, we finally managed to get a small fire going. Keep in mind that this was in the middle of December in Northern Canada, and so the entire landscape was smothered in a blanket of undisturbed snow. </p>\n\n<p>We stayed up for a while, roasting hot dogs and marshmallows. We talked about people we went to school with, and local rumors. One of Travis&#39;s things was to tell stories. He loved it. Most of the time these stories were far fetched and hard to believe, but the one he told me was about something I thought about a lot. Recently, a kid in our school had vanished on his way home from school. There were a few people who said that they saw him wandering next to the woods behind the school, which were conveniently the same woods we were camping in. I had forgotten about it up until Travis had to remind me. It made me uneasy being in a place where a kid disappeared. </p>\n\n<p>He told me that the police think the Elkman got him, something that had the body of a man and an elk for a head. I immediately dismissed his ridiculous story, and we both laughed a little bit. As the night continued, we told jokes, gossiped, and laughed with the thought of that missing kid lingering in our minds. Eventually, we both decided we were too tired and we should probably get to sleep. I bundled up, climbed into the tent with Travis, and then we both drifted off to sleep.</p>\n\n<p>I awoke maybe an hour later, to find Travis sitting up in the tent with his flashlight on, a look of terror on his face. it was the first time I had seen Travis genuinely scared. </p>\n\n<p>I asked him what was wrong. He told me he heard what sounded like a kid laughing next to the tent. I rolled my eyes and told him to piss up a rope, but then I heard it too. It was a giggle, maybe about twenty feet from the tent. </p>\n\n<p>I sat up in fear. Travis and I looked at each other and listened. We started to hear bushes rustling next to us, and that was it.</p>\n\n<p>We piled out of the tent and bolted through the woods towards home as fast as we could, leaving the camp behind. As we ran, I thought I heard a third pair of footsteps thumping behind us, but I didnt dare look back. We eventually made it out of the woods within twenty minutes, but kept on going until we reached Travis&#39;s house. Terrified, we spent the rest of the night cowering in his bedroom with the light on. </p>\n\n<p>The next morning, we told Travis&#39;s parents what happened, and his Dad came with us out to the campsite. What we found in the camp was enough to make me want to cry.</p>\n\n<p>In the snow, around the entire site, were pairs of bare human footprints, resembling that of a childs. Travis&#39;s father tried to rationalize it, but we all knew that nobody lived out there, not for quite a distance. We also found snow in the tent, and our bags all emptied out onto the floor, which meant whoever chased us out of the woods that night had gone back and rummaged through our stuff. There was nothing missing, luckily, but it was still creepy.</p>\n\n<p>We packed up the camp and left as quickly as we could. </p>\n\n<p>I&#39;m now graduated and living my life as an adult. Travis and I are still good friends, and he is doing well. While we are still friends, we dont talk about that night. The very thought that someone was lingering out in the middle of nowhere, listening and watching. It haunts me to this day.</p>\n\n<p>The missing kid was never found.</p>\n</div>\n","author":"Moondex98"}