{"rank":"10","title":"The Benevolent Wood","id":"8mv6le","url":"/r/nosleep/comments/8mv6le/the_benevolent_wood/","time":"1527557740000","body":"<div class=\"md\"><p>The forests in my area are our town&#39;s pride. They&#39;re lush and friendly, the trees always seem to be murmuring friendly secrets I wished I could share with them. They were deep and twisting, protecting their wilderness yet no one ever got lost. If someone did get turned around, they described  feeling the oddest sensation as they wandered back towards civilization. </p>\n\n<p>&quot;Like I was being led. Or guided. It felt like I was following someone who was only too happy to show me the way out, because they were going the same way and were delighted by the company. But there was no one there.&quot; one man said across a beer to me one night. &quot;I can&#39;t even say that I was finding my own way outta there. It was like something had me by the hand&quot; </p>\n\n<p>Others would describe it as a light touch on the small of their back or their shoulder. All of them swore they didn&#39;t really find their own way once they realized they were lost, the woods were just charmingly easy to find your way out of. </p>\n\n<p>For all intents and purposes, our town seemed to have a benevolent wood. Children played there with no fear of getting lost, lovers kept midnight trysts without worry of being intruded upon or getting lost in the pitch black forest. Hikers would go off trail to inspect every inch of the forest and its flora. Everyone came back out safe and tranquil.</p>\n\n<p>Even I always loved to wander it for hours, I knew all the trees and most of them had names when I was a kid. The trails were so ingrained in my mind, I believed I could shut my eyes and walk them on muscle memory alone. So far, I hadn&#39;t lost my way and experienced this drifting sensation, or a touch on the small of my back.</p>\n\n<p>One day a couple years ago, it was a breezy fall day, I packed a lunch and headed to the woods for the first time in far too long. It&#39;s always like seeing an old friend to sit down and enjoy a sandwich by the clear stream that runs through the forest, all the way to the park. An old wooded sign welcomed near a rest station welcomed you to the forest. I stopped to fill up my water and looked around at the trees surrounding the area. Some of the leaves were changing, but not all. I poked around happily revisiting old spots and checking out the old and new graffiti on some of the rocks. The dirt trail led to stone and back to more dirt as the stream came around. I felt contented, welcomed by the woods and though I hadn&#39;t visited them in months I felt as if I hadn&#39;t left. </p>\n\n<p>I still can&#39;t say why I lingered there wandering for so long. Nostalgia? Maybe. I hadn&#39;t felt inclined to stay in the woods more than an hour or two in a few years. Walking back across the stream, I felt like I was forgetting something. That feeling you get when you know you&#39;re about to leave your house without something important but you don&#39;t know what yet. Ridiculous, I had everything with me. Trying to shake off the persisting feeling, I walked towards the trees that led back to the rest area. As I turned, a flash of yellow caught my eyes and I found a cluster of wildflowers peering out at me from behind a large and industrious cluster of fern. Their familiarity drew me over to them. That&#39;s when I recognized a familiar path I had explored as a kid. I&#39;d never gotten to the end of it, it seemed to go on forever and I always got tired and turned around. I stared at the overgrown bush it was now and wondered if it could still be followed.</p>\n\n<p>What time was it? Was it getting late? Bah, what of it. I started picking my way through the path. I couldn&#39;t have got more than a few yards in when an icy tingle shivered down my spine.  The flowers were bright and cheerful, the greens vibrant. But they felt less friendly. Telling myself that was a ridiculous thought I made myself slowly keep moving forward. After a few more minutes down the path I began to feel relaxed again. At home. </p>\n\n<p>I stumbled on a rock that was shaped oddly like a bullfrog and stuck it in my pocket. There were so many flowers all around, smiling gently. I followed them until I felt relaxed and at ease then looked around to observe my surrounding, appreciating the solitude. It was peaceful here, not a sound. The plants had overgrown this particular trail and some were nearly as tall as me. Minutes passed like breaths until I&#39;d been down my forgotten trail for over an hour and I reveled in how it didn&#39;t look like my trek of dreams anymore in the least, it could have been a different forest entirely. It had a new, wilder beauty to it, a beauty that seemed to exist for and sustain itself.</p>\n\n<p>Smiling and glancing around with an emotion I can only describe as glowing, I stood there for a few minutes to appreciate the quietness of my surroundings. The hushed whispers of flowers waving to each other, the trees almost still, resting for a moment, breathing softly. When I noticed I was about to start losing the light, I turned around and headed back down the way I came, almost mechanically. I got about ten minutes away from where I&#39;d been standing before noticing that it wasn&#39;t the way I came from. I was seeing trees and flowers I didn&#39;t recognize. Confused, I looked all around me. I had been walking straight, and then I turned right around. I couldn&#39;t NOT be going the right way. I felt my stomach drop as I tried to process how this could be happening. I must have gotten turned around. </p>\n\n<p>I faced the direction I&#39;d been going, hesitated for a moment before deciding to turn and walk across the forest floor to where I&#39;d been standing. From there I looked all around once more and found the trail of flowers I&#39;d been following. That&#39;s the way I would go. I moved along it and as I did, a sour twisting feeling wrenched through my gut. I was going the wrong way, this wasn&#39;t the path I should be on. Anxiety filled me as I thought I about getting lost in my beloved wood, I looked sadly at the familiar flowers. I had to turn around, this wasn&#39;t the right way. Every step I took was a fight and I could feel something&#39;s touch hovering behind me ready to snatch at my shoulders and shake me. Breathing shakily, I turned around. Made my way to where I&#39;d been standing, and stood alone in the silence I had been so appreciating. The silence. I gazed around slowly, my chest tightening. Hadn&#39;t it been a while since I&#39;d seen any animals out here? Birds and squirrels had been near the stream. I needed to find my way back now, I needed to figure out which way was the right way. Refusing to let panic set in, I went over to the nearest climbable tree and started climbing. Maybe I&#39;d have a better handle on my location. I grabbed a branch and rolled my eyes in disgust when my hand landed in a lump of sap, but pulled myself up. And up. The higher I climbed, the more my thoughts drifted. Climbing trees was a favorite pasttime of mine as a kid. All the better to listen to them whisper their confidences back and forth. </p>\n\n<p>Somewhere far off, I heard wood cracking as I grabbed a branch and missed. &quot;If a tree falls in the forest,&quot; I said to myself, feeling my foot make contact with the air, &quot;But no one&#39;s around to hear it,&quot; I heard another split.\n My heart skipped as I realized I was falling. &quot;Does it still make a sound?&quot;</p>\n\n<p>All the air and my soul left my body when I thudded to the forest floor on my back. Once the green haze above me focused a bit, the branches swam and squirmed above me. The trees weren&#39;t whispering anymore, and I wasn&#39;t made anxious by the eerie silence. They were hissing and spitting, their branches writhing furiously in the air. My chest was tight with pressure, restricting my lungs and holding air just out of my reach. I jerked my head from side to side, trying to fight through it and take a breath, I needed air and I needed it right that moment. The wind picked up and something like a seal snapped inside, I sucked in a huge lungful of air and opened my mouth to scream. Nothing came out. I was breathing but I wasn&#39;t making any noise. I was silent. I tried to move, get up and run but my body disobeyed. Above me the trees distorted sinisterly, I could feel that meant I was being approached. They weren&#39;t invisible, but I couldn&#39;t quite make them out either. It looked like someone used a clone tool over the trees, and those pixelated figures swarmed around me. Whipping through the trees and air, forcing the branches to sway and shriek. The way the trees rocked and bucked sent my fears running wild, I could see and feel them circle me faster and faster until they were all blurred together, me trapped in the center. The dead leaves on the ground were thrown into the air, dust kicked up into little tornados. </p>\n\n<p>Figures whipped around me, no more than four feet away from me now, disturbing the air around them. I wished desperately that I had just taken the path I was on. The &#39;wrong&#39; one, gone anywhere, anywhere besides staying right here. Paralyzed, all I could do was breathe rapidly and watch them come closer, closer, as the sour feeling that had invaded my stomach also assaulted my nose. They were watching me, wanting me to move and at the same time keeping me there on my back. </p>\n\n<p>I felt like this couldn&#39;t be my forest, where WAS I? As they got closer and closer my joints ached with anticipation, with fear, what would they do to me? At the last second they swept up into the air, pairing antagonizingly with the aggressive movements of the trees. I felt a second release, or snap, and was yanked to my feet jarringly. I didn&#39;t need a second invitation, I took one look at the &#39;wrong&#39; path and ran down it. Right flew over wood and stones. Just a minute in, my chest started burning and I became short of breath. I needed to stop but I couldn&#39;t, I wouldn&#39;t let myself. My absolute terror would have propelled me to the ends of the Earth until I- I burst between some trees and almost careened into the wooden welcome sign. </p>\n\n<p>Just like that, all fear receded. I felt as safe as I had by the stream. I felt like I&#39;d just woken up from a very deep sleep, the wooden sign and the rest area didn&#39;t seem real until I heard myself let out a nervous giggle. I heard myself. The relief set fully in and I dropped down and sat on the grass. The woods felt just as charming and welcoming as before, but it seemed different. There was something hovering just behind that, waiting. Able to stand, I went to my car and got in, relishing the sound of it starting, the feeling of backing up and pulling away. I haven&#39;t been back since. </p>\n</div>\n","author":"Caidot"}