{"rank":"1","title":"I dont know what to do anymore","id":"8mv84n","url":"/r/nosleep/comments/8mv84n/i_dont_know_what_to_do_anymore/","time":"1527558130000","body":"<div class=\"md\"><p>other parts: <a href=\"https://www.reddit.com/r/nosleep/comments/8j1l3a/i_dont_know_what_to_do_anymore/\" rel=\"nofollow\">part 1</a></p>\n\n<p>Now, i know what you may be thinking. Who in their right mind would willingly share their home with a ghost? And, for a while, i thought the same thing. Up until my ninth birthday the following year, i always argued with my mom to somehow get rid of him. Although i did watch many ghost documentaries with Winnie, i had no idea what sage actually did, I had no idea what a priest could do to get rid of a ghost, i just begged my mom to get rid of him, until she finally snapped.</p>\n\n<p>&quot;This wasn&#39;t our house,&quot; she told me, &quot;It was his first. we have to share.&quot;</p>\n\n<p>up until just recently, what she had told me was true. That he would never hurt me, i mean. He never laid a finger on me or any of my sisters, but he never held back on giving anyone a little fright. He would often scare my friends so much, that they refused to come over my house. He would make things fly off of desks, turn on the tv in another room, and scratch at the walls.</p>\n\n<p>Again i repeat, until now, he never hurt us. He never even laid a finger on us. Something, though, changed after my sixteenth birthday.</p>\n\n<p>When i turned sixteen, as my sister did, (i truly am a carbon copy of her) i fell into my own group of bad friends. Where i live, there is an abandoned asylum only two towns over. Of course, we weren&#39;t allowed to go there, but since an older friend in that group had a car, we&#39;d go anyway. The last time our group went together, we had found a ouija board. And yes, as cliche as this may seem, this is exactly where my story takes a turn for the worst.</p>\n\n<p>we assumed it had been left behind by a group of teenagers like us, who were there illegally as we were, trying to contact the tortured souls of those who had resided in the asylum. So, as dumb teenagers do, we stole it. The planchette was cracked, and it looked like a cheap one you could get at your local Hot Topic or Spencers, but we decided it was fit enough for use. Even thinking about it makes my stomach turn.</p>\n\n<p>In my friend group, there were only four of us, (and ill changing their names for privacy as i did my sister); Jasmine, James, and Rick. Jasmine and James never believed me about the ghost that haunted my home, as he had never appeared to make himself known when they were around. Rick, though, did believe me. He had witnessed the ghost once himself, when he dog sat my dogs while we were away. He told me that he heard scratching on the wall, which was typical for the ghost in my home to do, so i told him. He still comes over, but he never feels comfortable sitting alone in my room after that.</p>\n\n<p>Jasmine turned to me on that day, planchette in left hand with the ouija board tucked under her arm, and she said, &quot;Lets see if the ghost you&#39;re telling us about is real.&quot;</p>\n\n<p>i had felt super uneasy about what she wanted to do the whole car ride back to my house; i had watched documentaries and movies about groups of kids like we were, doing what we were doing, and how they would be haunted for the rest of their lives. I had tried to stop them, but truth be told, i am the biggest pushover that has ever walked this planet. Jasmine manipulated me to no end, and i allowed her to walk into my home, into the bathroom, with the ouija board, without any question.</p>\n\n<p>She decided on doing it in the bath tub, since i had told her how he had died. My bath tub has big glass dividers that are translucent. If you apply pressure, or put something against them, you can see through them. We pushed both dividers to the same side of the track, so Rick could see us (he refused to go along with what we were doing, and i wish i had followed him).</p>\n\n<p>Jasmine, James and i all put our fingers on the planchette. We began with a prayer of some sort, or a song, because Jasmine had read that you should always start with something welcoming. We sat for a moment in silence, when Jasmine asked the question, &quot;Is anyone here with us?&quot;</p>\n\n<p>There was nothing. Nothing happened, nothing moved. There were no lights flickering, no one was launched across my tiny bathroom. James laughed. &quot;I knew she was lying,&quot; he said, looking straight at me. Jasmine shook her head, &quot;Let&#39;s give it another minute. Maybe it needs a moment to heat up, like your shitty car does.&quot;</p>\n\n<p>I didnt want to give it another minute. I wanted it to stop. I took my hands off the planchette, but jasmine forced my fingers back on. &quot;We need you to stay.&quot;</p>\n\n<p>I stayed. Another minute passed, and nothing happened. I began to feel relieved, when the planchette began to move.</p>\n\n<p><em>L I A R</em></p>\n\n<p>&quot;James,&quot; Jasmine groaned. James chuckled beside her. &quot;Stop fucking around.&quot;</p>\n\n<p>He just shrugged it off. But then, the planchette moved again.</p>\n\n<p>This time, his hands weren&#39;t on it. Only mine and Jasmines were. And i can swear to you right now that I was not moving it.</p>\n\n<p><em>B E G O N E</em></p>\n\n<p>&quot;It&#39;s telling us to leave,&quot; Rick said, getting up, &quot;I think we should listen. Go on and say goodbye.&quot;</p>\n\n<p>&quot;No,&quot; Jasmine said, looking at the board, &quot;Who are you?&quot;</p>\n\n<p>It began to spell something else.</p>\n\n<p><em>G O</em></p>\n\n<p><em>G O</em></p>\n\n<p><em>G O</em></p>\n\n<p>&quot;I really don&#39;t feel good about this,&quot; I said.</p>\n\n<p>&quot;Where do you want us to go?&quot; Jasmine ignored my statement.</p>\n\n<p><em>N O W</em></p>\n\n<p>&quot;I&#39;m scared,&quot; I said. &quot;Please, lets stop this.&quot;</p>\n\n<p>&quot;Don&#39;t you want this ghost to leave your house?&quot; Jasmine said. I stayed silent. The planchette began to move again. It began to spell my name.</p>\n\n<p>I felt tears threaten to leave my eyes. Seeing my name being spelled had my scared so badly that my hands began to shake again. I removed them from the planchette.</p>\n\n<p><em>S T A Y.</em></p>\n\n<p>&quot;I don&#39;t want to stay,&quot; I said. I began to get up, and I reached for Ricks hand, who was trying to help me out of the bath tub, when one of the dividers slammed shut. I felt a heavy force on my shoulders, almost as if ten pound weights were just placed there. The weight forced me to sit back down. Then, it began burning. Rick tried to pry the divider open, but he couldn&#39;t. It was almost as if it were cemented shut.</p>\n\n<p>&quot;It hurts,&quot; I cried, &quot;Please, can we say goodbye now?&quot;</p>\n\n<p>&quot;First, he wants us to go, now he wants you to stay. Make up your mind, old man.&quot; Jasmine antagonized.</p>\n\n<p><em>N O</em></p>\n\n<p>Jasmine began to laugh. &quot;Did he really just say no?&quot; The planchette continued to move.</p>\n\n<p><em>T H I M</em></p>\n\n<p>&quot;i&#39;m sick of this game, it&#39;s getting boring.&quot; Jasmine said. She got up with ease. Once she rose, the weights on my shoulders were gone as well. The burning sensation i felt, though, left me with red marks on my shoulders for a few days. She took the ouija board and opened the divider that Rick somehow could not force open.</p>\n\n<p>&quot;I&#39;m leaving.&quot;</p>\n\n<p>&quot;We need to say goodbye,&quot; I said. Jasmine looked back at me for a moment.</p>\n\n<p>&quot;That&#39;s a myth,&quot; she said, &quot;You really believe everything that you read?&quot;</p>\n</div>\n","author":"nopesara"}