{"rank":"6","title":"Re: There's Something in the Woods","id":"8mvi90","url":"/r/nosleep/comments/8mvi90/re_theres_something_in_the_woods/","time":"1527560676000","body":"<div class=\"md\"><p>I honestly didn&#39;t think I&#39;d be alive to write this when I posted the original. Obviously, because you are reading this, I was wrong. I am very much alive. A lot of you asked for an update on the whole situation, so here it is.</p>\n\n<p>Almost as soon as I uploaded the last post, I decided that I would get some sleep to clear my mind so I could decide what to do. I actually hadn&#39;t slept in the house yet, so I was lying down somewhere I had never laid down before. It only took a few minutes to notice the stench.</p>\n\n<p>It was awful, like it was burning my nose. I couldn&#39;t recognize where it was coming from at first. I sniffed around my room and found the stench was coming from an air vent. That led to the attic. So, I grabbed a flashlight and a crowbar. I had a crowbar to open moving crates, and in case there was another one of those things, I didn&#39;t want to take any chances.</p>\n\n<p>I made my way to a little closet at the end if the hall. As soon as I entered the closet, the stench hit me like a wall. All I could do was out my shirt over my face and push through. I opened the hatch that led to the attic, and the little ladder dropped down onto the floor. I crawled up the ladder, desperately trying not to pass out from the awful smell.</p>\n\n<p>The attic is a tiny wooden box. There&#39;s beams at the top for support, but otherwise just a box. Or at least that&#39;s what it would have looked like without all the blood. The walls were smeared with it. There was a dog bed stuffed into the corner of the room, and a black blade in the center of the room that was also covered in blood.</p>\n\n<p>It was only when I saw the yellow goop that I came to a realisation. This was it&#39;s nest. That thing I saw has been living here for god knows how long. It must have followed me out into the Woods, and I just locked it out of its home. Which means I had been living with it in the house for nearly a day before the hike. My head was spinning, I didn&#39;t know what to do.</p>\n\n<p>I decided to get a little sleep before I did anything big. I checked on the thing. It was wandering around my backyard, moaning and stretching. I couldn&#39;t see it very well, but I knew it was there. I barely got any sleep that night. I closed the curtains, but I could still hear the sounds of it from outside. </p>\n\n<p>As soon as I woke up I called the friend that I bought the house from. He acted friendly towards me, until I brought up the thing. He asked me to describe what I had seen, and I did. I gave him the name of my Reddit account for my full story, but he just went all quiet and hung up. Nothing has come of that yet, but I might try and call him back later.</p>\n\n<p>As for my food situation, I was all out. I was planning on going grocery shopping the day after my hike, but we all know how that turned out. I knew I had to leave the house sooner than later. I remembered that someone recommended &quot;Salt and a gun,&quot; and I decided if I was going to leave the house the least I could do was arm myself.</p>\n\n<p>I searched around my boxes for a fun, but came up empty handed. In the last box, I found this gun that killed spiders. I put it to the side until I realised, this thing shot salt. If the creature was anything like a slug, the salt was going to kill it almost immediately. I grabbed the gun and prepared myself to go outside.</p>\n\n<p>I unlocked the front door, opened it and then relocked it. I exited the door, keeping an eye on the thing as I did. I could see straight to the back door from the front of my house. It saw me leaving, but it just sat there. Staring directly at me with its slit-like eyes. I was confused. Shouldn&#39;t it be running at me?</p>\n\n<p>I slammed the door and ran for my car. I got in and licked the door safely. To my surprise, it didn&#39;t even try to approach the car. I thought I had won, at least this battle. I went out to the grocery store and bought my food, and lots of it. I knew I needed to kill this thing, because I couldn&#39;t live in constant fear like this for long. I also knew that I needed salt so I could refill my gun.</p>\n\n<p>I drove home without incident, and I pulled back into my driveway. I ran to the front door, gun in hand. I quickly unlocked it and burst open the door. The first thing I see is broken glass all over the floor. Near the back door. The stench hit me as well. I staggered for a bit, and then I put the pieces together. The thing was in my house. It was in MY HOUSE. I licked the door and ran back to my car.</p>\n\n<p>And that&#39;s where we are now. That all happened on Thursday and Friday, so that means I&#39;ve been living out of my car for 3 days. I have the exact opposite problem I had before. This thing is in my house, and I&#39;m locked out. I think I&#39;ll call my friend back. That&#39;s honestly the only thing I can think to do right now, and I&#39;m really not interested in confronting it alone. Thank you for the support on the last post, I&#39;ll keep you updated.</p>\n\n<p>LINK TO ORIGINAL POST: <a href=\"https://www.reddit.com/r/nosleep/comments/8lxzte/theres_something_in_the_woods/?utm_source=reddit-android\">https://www.reddit.com/r/nosleep/comments/8lxzte/theres_something_in_the_woods/?utm_source=reddit-android</a></p>\n</div>\n","author":"NoSleeper124"}