{"rank":"6","title":"We're Made of Wax Matt, What Are You Made of?","id":"8mvnnp","url":"/r/nosleep/comments/8mvnnp/were_made_of_wax_matt_what_are_you_made_of/","time":"1527561963000","body":"<div class=\"md\"><p>I love my toys.</p>\n\n<p>Each and every one holds a very special place in my home and heart. From Slugger and Stephen to Slick and Sylvie, they all have a particular point and purpose.</p>\n\n<p>Plus, I think they saved my life last night.</p>\n\n<p>Mom used to say &#39;good soldiers were ready for war at a moment&#39;s notice,&#39; so my toys needed to be too. When we played, she said I was their General, and the General should know all his soldiers&#39; skills.</p>\n\n<p>I don&#39;t have a lot of friends. </p>\n\n<p>Cindy is my sister, and she said it was because of my condition. Even still, when I was thirty-one, Mom asked me to move from her home and into my own place. </p>\n\n<p>She said I was ready, and that it would be safe. We found a little apartment on the other side of town. My job is at a local grocery store and sometimes she helps me pay my bills. </p>\n\n<p>At nighttime, I get scared and have a lot of trouble sleeping if there are strange sounds. Last night was a lot like that.</p>\n\n<p>The toys were tired. When it was light out, we spent the whole day outside; roaming the green grass and the setting sun of the apartment complex. There were monsters there. Little red ones with four legs that covered almost every inch of the ground. Most of the time, they hid in their small hills that dotted the field like spots on our old Shepherd, Sookie, before she died. My soldiers breached the bay of those mini mountains with full numbers, and they won every single battle.  </p>\n\n<p>But once it got dark, it was time to go inside. That was always the worst part of playtime; everything after. </p>\n\n<p>Mom said some people just had lonely souls, and that was why I hated going to bed so much. Sometimes, I watched television with the toys by my side. Other times I would call my brother or sister and asked if they could see what was on the TV, too. But they did not always answer. Cindy said it was because she couldn&#39;t hear the phone. Chris never said much at all. </p>\n\n<p>Before bed last night, I set up my toys exactly the way I was told.</p>\n\n<p>Stephen was a crusty old sailor who knew a thing or two about keeping watch, so he went on the dresser; the one by the front door. He was bigger than the other toys, maybe almost a foot tall, and he had a big camera perched on the top of his little yellow hat. If the monsters ever moved in front of him, he would send out signals to every house in my whole family. Sometimes when my lonely soul acted up after midnight, <em>I</em> would move in front of Stephen to see if they saw. They always said they did. </p>\n\n<p>Mom said that Slick&#39;s job was to watch the windows. He was a cowboy, and rode on a cold and true horse (Chris called him a <em>colt</em>) named Copper. Slick wore one of those old jean vests over a checkered shirt, with a wide-brimmed hat that dipped just high enough to hide his eyes. He went on the kitchen table, so that his camera could catch any monsters coming in that way.</p>\n\n<p>Then there was Sylvie. She was not my favorite toy. </p>\n\n<p>Sylvie was christened after Cindy&#39;s friend with the same name, and it fit her perfectly. She was a little action figure, with long strawberry blonde hair and wide outspread arms that were perfect for holding a sensor. </p>\n\n<p>Anytime my bedroom door opened after midnight, Sylvie screamed like a crazy lady. She could scream so loud that she could wake up the Devil, just like the real one.</p>\n\n<p>The last toy was Slugger. I was never supposed to use Slugger, and that automatically made him my favorite. He was from Louisville.</p>\n\n<p><em>Only in case of emergencies,</em> Mom would say. <em>If the monsters got past Sylvie and Stephen and Slick, it was the General&#39;s job to take Slugger and sit behind the door.</em></p>\n\n<p>Then, swing away.</p>\n\n<p>So last night, when a monster tried to get me, I knew exactly what to do. </p>\n\n<p>At eleven, I stopped trying to call Chris and tried to go to sleep. The rain ringing against my window was really scary at first. But there was a radio by my nightlight that played <em>soothing sounds from the sea.</em> That helps me sleep, sometimes. </p>\n\n<p>But at three in the morning, Stephen woke me up. He was a lot better at that. Instead of screaming like a banshee, Stephen sent a soft little jingle to my phone with a video of what he saw.</p>\n\n<p>In a second, we both saw the front door handle jiggle. It jiggled and jiggled for a moment and then it opened all the way up.</p>\n\n<p>The shape that stood there seemed like a man, but he looked more like a monster. He had tight leather clothes, and wore a pulled-over black mask with holes cut for his mouth and face. </p>\n\n<p>When the monster-man saw Stephen, he froze. It was not like he was hiding, out front and center with his sailor hat and friendly wave. The man-monster leaned forward into Stephen&#39;s camera, until his face was really big and wide and his blue eyes shined real bright.</p>\n\n<p>Then the sound cut and we could not see anything at all. I reached for Slugger. </p>\n\n<p>Soon after, Slick saw the man too, and he sent out a signal to sound the troops. But in a few quick seconds, Slick met the same fate; a swift slap to his side-eyed face sent him reeling underneath the sink.</p>\n\n<p>Chris used to say, <em>Toys are made of wax, Matt, but one day you will find out what you are made out of.</em></p>\n\n<p>I found out that night.</p>\n\n<p>The monster-man took a little bit. He seemed to know someone was home, because I heard him circle every room in my little apartment before he came to the bedroom. He stopped, and paused, exhaling a small sigh before Sylvie started to scream and then, it was time.</p>\n\n<p>I swung Slugger hard and swift.</p>\n\n<p>It all happened fast. After the first swing, the monster was already on the floor. But Slugger wanted to swing again some more. Soon his face wasn&#39;t a face, and his head wasn&#39;t a head. If he was not already, he would be better off dead.</p>\n\n<p>Sylvie screamed the whole time. But I hope my Mom knows... my toys never committed a crime. </p>\n</div>\n","author":"FirstBreath1"}