{"rank":"2","title":"I was part of a team that hunted superbugs [Part 2]","id":"8mvr1t","url":"/r/nosleep/comments/8mvr1t/i_was_part_of_a_team_that_hunted_superbugs_part_2/","time":"1527562818000","body":"<div class=\"md\"><p><a href=\"https://old.reddit.com/r/nosleep/comments/8mmwrh/i_was_part_of_a_team_that_hunted_superbugs/?ref=share&amp;ref_source=link\">Part 1</a></p>\n\n<p>I didn’t know what else to do. </p>\n\n<p>We collected everything we found and headed back upstairs to the conference room. We sat around, each with a look of growing confusion and fear. Sterling notified us that our protective suits were no longer necessary. None of us questioned him about it. With Dr. Collins and Daniel missing there was no clear direction on how to proceed.</p>\n\n<p>&quot;Anybody want to fill in the rest of us on what the hell is going on here?&quot;  Sam said, his voice now high with panic.</p>\n\n<p>Shelly spoke up, eyeballing Sterling. &quot;You said back there <em>it&#39;s been feeding.</em> What the hell were you talking about? And what was that green shit everywhere!?&quot;</p>\n\n<p>I took the opportunity to interrupt her. &quot;That slime…Sam and I found it when we were swabbing the last room on our unit. It was similar to what was all over down in the boiler room.&quot; It was then Sterling spoke up.</p>\n\n<p>&quot;It&#39;s not slime you found. I believe it&#39;s called biofilm.&quot;</p>\n\n<p>&quot;That would make sense. Except that biofilm is usually made by microorganisms, like bacteria.&quot; I said.</p>\n\n<p>&quot;Ok, but what we found was in huge amounts and was thick like honey. Trillions of organisms would be required to produce that quantity&quot; Sam said.</p>\n\n<p>&quot;Or one really big one.&quot; We collectively turned to look at Sterling. My jaw had hit the floor when we heard something wet smack into the conference table behind us. The room darkened a bit from above us.</p>\n\n<p>I turned to see green. And took in the awful smell as I looked up. On the ceiling. It had found us.</p>\n\n<p>It was a huge mass of different colored pulsating organs beneath a translucent skin. It sprouted dozens of small tentacle-like appendages that gripped to the walls and held it in place. The green biofilm dripped off of its skin like drool out of the mouth of a hungry animal. </p>\n\n<p>&quot;Everyone, move very slowly towards the door…&quot;</p>\n\n<p>Before I could say another word all I saw was Michael being ripped out of his seat and dragged up by a longer tentacle that had emerged out of the mass. It struck him with frightening speed, and we watched in collective horror as he was absorbed inside of it. We could almost still him beneath it, being enveloped by the collective of organs. &quot;We have to help…&quot;</p>\n\n<p>Shelly grabbed my arm and shook me hard. &quot;There&#39;s nothing we can do. Let&#39;s go!&quot; </p>\n\n<p>We all ran trying to dodge more tentacles trying to grab us. I barely missed being swept up by one as I watched Sam trip over Michael&#39;s fallen chair. He tried to get up but his right leg was engulfed by a tentacle and it ripped him up off the floor like a rag doll. I looked back in time to see him disappear inside of it.</p>\n\n<p>Shelly pushed me forward out the door. If she hadn&#39;t been there I might not have wanted to leave Sam or Michael behind.</p>\n\n<p>We followed Sterling, not knowing where he was leading us. We finally made it to another unit. It was the hospital lab, but the doors were sealed electronically. Sterling entered a series of numbers and forced one of the doors open. We tried to catch our breath as Sterling reentered the code and sealed the three of us in.</p>\n\n<p>&quot;Don’t worry…we&#39;re safe here for now. It can&#39;t get us in here. This area is sealed off from the rest of the hospital.&quot;</p>\n\n<p>&quot;Safe!?&quot; I threw the words out between heavy breaths. &quot;How are we fucking safe!? And what the fuck was that thing?&quot;</p>\n\n<p>Sterling reached into his jacket pocket and pulled out a large pistol. He chambered a round and then turned to me again. &quot;We are safe.&quot;</p>\n\n<p>I don’t know if it was the sight of the gun or his ultra-calm demeanor at the moment. But I backed off a bit.</p>\n\n<p>&quot;Look, I don’t know who you are or who you work for. I just want to get out of here alive. But to do that we need to know what we&#39;re dealing with. So why don’t you level with us?&quot;</p>\n\n<p>He stayed silent as he seemed to think over his response.</p>\n\n<p>&quot;Ok, you want to know what&#39;s trying to kill us?&quot;</p>\n\n<p>He paused before opening his briefcase. He took out a manila folder, which he held up as he spoke and told us his story.</p>\n\n<p>He was part of a secret project to manipulate certain genes in species of predatory bacteria. The hope was to use them against species that had become resistant to modern antibiotics. The goal was to enhance their aggressiveness and already intact killer instinct. </p>\n\n<p>&quot;The fuck---&quot; I cut Shelly off.</p>\n\n<p>&quot;No, it&#39;s not as crazy as you think. I&#39;ve read about it in science and medical journals, but nothing about human testing yet. So how did it end up here?&quot; Sterling continued.</p>\n\n<p>&quot;The military wanted a better solution to a growing crisis. Too many soldiers wounded and then returning home to face painful, long surgeries and rehab. Too many suffering from infections that for many were untreatable even with powerful antibiotics. This was the next step…the perfect biological weapon against this foe.&quot;</p>\n\n<p>&quot;That doesn’t explain how it ended up he---&quot;</p>\n\n<p>&quot;We tested it here. An army ranger recently returned with a severe leg injury. Had to have an amputation, and we infected him without his knowledge with a deadly strain of Staph bacteria. Within three hours of application 90% of the Staph had been eliminated. It worked beautifully.&quot; Sterling now had his gun pointed at us. </p>\n\n<p>&quot;You bastards.&quot; I was getting more angry with every word he spoke.</p>\n\n<p>&quot;What happened to the soldier?&quot; Shelly asked. </p>\n\n<p>&quot;Something happened that we did not expect. The enhanced bacteria were supposed to be killed off by the soldier&#39;s immune system when finished, but one managed to survive. That one began to feed on the surrounding cells and tissues at an accelerated rate.&quot;</p>\n\n<p>&quot;Meaning what?&quot;</p>\n\n<p>&quot;It ate the soldier <a href=\"https://www.facebook.com/SANewmanNosleep/\">alive.&quot;</a></p>\n</div>\n","author":"SA_Newman"}