{"rank":"10","title":"There's Something Wrong With My Niece","id":"8mvzo0","url":"/r/nosleep/comments/8mvzo0/theres_something_wrong_with_my_niece/","time":"1527565034000","body":"<div class=\"md\"><p>There&#39;s something wrong with my niece.  </p>\n\n<p>Not a birth defect, but something.  </p>\n\n<p>The doctors say she shows signs of autism - except, autism doesn&#39;t typically develop right away. Usually, babies show a normal progression of development for the first few months, then start showing signs of autism. They usually initially respond to people, they make eye contact, they may even say their first words, and then their social development either delays, stops altogether, or seems to go backwards. That&#39;s why throughout history there has been myths of changeling babies-one day the baby seems fine, then suddenly the baby seems different. That&#39;s also one of the things that fuels the &quot;vaccines cause autism&quot; myth, because people can&#39;t understand how development can change so quickly, so they need something to blame; something to use as a scapegoat for &quot;taking away&quot; their baby, something to explain why their healthy baby is suddenly no longer a &quot;normal&quot; baby. Even though with the right education for parents on how to raise a child with autism, that child will still live a healthy, happy, normal life, albeit with some challenges.  </p>\n\n<p>But my niece isn&#39;t a normal baby. Not because of the possible autism diagnosis, but because...there&#39;s something...off.  </p>\n\n<p>Her entire life, as short as it&#39;s been so far, has been anything but normal.  </p>\n\n<p>Her mother claimed it was immaculate conception. She claimed it was a miracle, that she was the chosen one, and swore on her life that it was a virgin birth. We all knew she was a cheating whore and full of shit, but for some reason, my brother stayed with her. Maybe he was a hopeless romantic blinded by love, willing to believe any lies she told, or even just willing to pretend to believe it to raise that baby as his own...or maybe it was the massive, copious amounts of drugs that they did together, where his brain was too fried to see how terrible of a person his wife was from the start. Maybe a bit of both.  </p>\n\n<p>While the pregnancy was no miracle, the fact that the baby survived the pregnancy certainly was.  </p>\n\n<p>A baby surviving the amount of drugs that her pregnant mother did, especially with having no physical defects, is a miracle. We didn&#39;t think that the baby would even be born. And child protective services and the police can&#39;t do anything about a pregnant mother who smokes, drinks, and does every drug she could get her hands on, except take the baby out of her custody after the baby is born.  </p>\n\n<p>Her mother became increasingly more psychotic throughout the pregnancy, likely due to all the drugs. She started out ranting about how she was the chosen one, but as time went on, the more things escalated. She began to say that there was something wrong with her baby, but wouldn&#39;t say what, just that she &quot;needed to stop it.&quot;  </p>\n\n<p>She disappeared for a few days, which wasn&#39;t irregular for her or for any junkie like her, so no one thought much of it. She was found in what was essentially a crackhouse, lying on the floor of the bathroom in a puddle of her own blood, with a handful of opioids, a bottle of whiskey, and an unfolded coat hanger by her side. She had attempted to give herself an abortion, and had ended up killing herself in the process.  </p>\n\n<p>The baby survived. Paramedics were able to rescue the baby, though they were unable to revive the mother. She was far along enough in her pregnancy for the baby to survive out of the womb, and paramedics got there just in time to extract her and let her take her first breath on her own. It was a miracle. She was named Amira.  </p>\n\n<p>Obviously, after all this trauma during pregnancy, along with being premature, there&#39;s going to be some medical problems with her. But that&#39;s not what&#39;s wrong with her. There&#39;s something about her. Something wrong.  </p>\n\n<p>Even though the baby was not biologically his, my brother stepped up to care for her. He claimed he would get clean for her, that his life now had purpose, that he would do anything for her, because even if she wasn&#39;t biologically his child, she was still his child. After all, he was the one there throughout the pregnancy. He was the one who would be her father.  </p>\n\n<p>Of course, that only lasted a few weeks, before he died from an overdose. No one was surprised. When you&#39;re already an addict and then go through something that traumatic, of course that&#39;s going to trigger something. The police found him on the floor next to Amira&#39;s crib. Although they expected her to be crying from hunger, or from the strangers, or the noise, she remained silent, just staring off into space as if she could see things that others can&#39;t.  </p>\n\n<p>Amira&#39;s biological father was tracked down (and nobody was surprised that it wasn&#39;t a virgin birth), and he was given custody. He was an unsavory type of guy as well as you can imagine, a part-time drug dealer still living with his parents, but CPS thought that at least his parents would care for Amira. And they did. For a few weeks, Amira&#39;s biological grandparents took care of that baby as if it were their own, even though her biological father was the deadbeat you would expect him to be. One day, her biological grandfather hadn&#39;t reported to work for a few days, so police were sent to the house to check things out. There was a murder-suicide, where the deadbeat dad had stabbed both his parents over 40 times each, then hung himself from the banister by the staircase. Police assumed Amira would have been killed as well, especially since the house was silent. But they found her, lying still in her crib with her piercing blue eyes, staring up at the ceiling and not moving aside from the steady movement of her chest as she breathed. Once again, they were surprised she wasn&#39;t crying, especially since it had to have been a few days since she ate, or perhaps longer if there was any neglect-she hadn&#39;t even soiled her diaper in that time, so they assume she had been starved for a while.  </p>\n\n<p>All these incidents were unfortunate, but not completely out of the ordinary. Amira surviving them was a miracle, but unsavory type people meeting unfortunate ends is not entirely unheard of, so nobody thought much of it. Aside from, of course, empathy for Amira, the child who has had so short of a life so far, and yet had more trauma surrounding her than most of us ever will.  </p>\n\n<p>I didn&#39;t find this strange enough or noteworthy enough to post here until the pattern continued.  </p>\n\n<p>She was taken in by a foster family. They were killed in a car crash that appeared to be intentional - no skid marks on the road, the car was driven directly into a building, no traffic nearby to be swerving from. The foster mother, foster father, and one other foster child were killed-But Amira survived. Police said it was a miracle. They said had it not been for the baby carrier, she would have met the same fate, but the way it cradled her protected her.  </p>\n\n<p>She was taken in by another foster family. The rest of the family died in a house fire while she and her new foster mother were at an appointment with a pediatrician. The new foster mother committed suicide days later.  </p>\n\n<p>My parents, overwhelmed with guilt for not intervening earlier, decided to adopt her. They felt that if my brother treated her as his child, they ought to treat her as his child, and that she should be part of our family instead of having to jump through foster homes her whole life. On some level, I think they thought it was their last possible chance to connect with my brother. I think they also thought it was their second chance at raising my brother, but this time they&#39;d do something different to make sure she didn&#39;t meet the same fate.  </p>\n\n<p>They died a few days ago from carbon monoxide poisoning. They left the car running in the garage, and just sat there. Amira was left safely inside the house. Police say there was no foul play, and that it was obviously intentional. They said the pain of losing my brother had to have gotten to them and sent them over the edge. I knew them, though, and they were never the type of people to do such a thing, especially when they were so committed to helping Amira.  </p>\n\n<p>I was the one named in the will for being the next guardian of Amira. And how could I refuse? She&#39;s family, sort of. And even if she isn&#39;t, she&#39;s still just a child. An innocent infant who has been caught in the middle of tragedy after tragedy, and needs somebody who will care for her. I know that logically, she isn&#39;t responsible for all these things. How could she be when she&#39;s just an infant. She can&#39;t walk, talk, or even crawl yet, let alone be capable of murder and coverups.  </p>\n\n<p>It&#39;s been a few days, and I&#39;ve never heard her cry, or even make a noise. The doctors say that&#39;s the autism. She never moves, and always stares off into the distance. The doctors say there&#39;s a chance she has paralysis though they can&#39;t find any physical reason for it, but more likely, she simply doesn&#39;t move because she doesn&#39;t want to. She&#39;s quite possibly the easiest baby to take care of ever, and the type that parents could only dream of.  </p>\n\n<p>But sometimes, when I walk into her line of sight, I feel a sharp cold like stepping out into the dead of winter, and this pressure building up inside of me like I&#39;ll explode, or more likely vomit or pass out if I don&#39;t do something, though I&#39;m not sure what it is I&#39;m supposed to do. And at night, I could swear I hear someone whispering through the baby monitor.  </p>\n</div>\n","author":"var0x"}