{"rank":"4","title":"There's something wrong with my VR headset","id":"8mw30d","url":"/r/nosleep/comments/8mw30d/theres_something_wrong_with_my_vr_headset/","time":"1527565926000","body":"<div class=\"md\"><p>I remembered rushing home to try out the VR set that I had purchased at the estate sale, excitement coursing through me. I worked as an antiques dealer in the city, and had received notice about the sale a few days ago. I had received a folder of information about the seller and, after looking at a list of the items, the VR headset stood out to me. I paid a cutthroat rate for the cutting edge tech, and was very happy with myself as I raced home to the small apartment I shared with my girlfriend of five years, Vanessa. </p>\n\n<p>Usually I only sold furniture and vases, that sort of thing, but I had discovered there was a certain type of customer that craved technology, new and old. Some of the biggest sales I had made were from clients purchasing old betamax players and record players, very niche and very expensive items today. There&#39;s always a market of buyers looking into nostalgic technology like that, and I knew that if I couldn&#39;t find a way to make a profit on something so new like the headset, that I could simply just enjoy it myself, as one of my biggest hobbies was video gaming. </p>\n\n<p>I got home and realized Vanessa hadn&#39;t got back from her job yet. She had recently completed her veterinary studies at the local university, and had just gotten her career dream job of working at a clinic here in the city. I let myself in the door and was greeted by our large male cat, Tom, whose black silky fur shined in the dim lights of the apartment. Tom gave me a customary meow in greeting and nearly tripped me as I came in the apartment. I probably should&#39;ve made sure he had food and water, but decided against it as I was so excited to try out the headset. I set my bag down on the kitchen table and heard my cell phone chirp loudly from my backpocket. </p>\n\n<p>&quot;Hey babe, I&#39;m gonna be home in just a little while. Got tied up at the clinic with Mr. Boudreaux&#39;s dog again.&quot;</p>\n\n<p>&quot;No prob, guess what! I got a VR headset from the estate sale I was telling you about. I&#39;m gonna give it a try.&quot;</p>\n\n<p>&quot;Wait for me :( I wanna try it out too&quot; was her reply, but I didn&#39;t wait for her. See, Vanessa and I had actually met at a gaming store five years ago. We had bumped into each other and began talking, me teasing her about buying the new city building sim game. She looked at my own purchase, Roaring Mountain IV, and laughed, saying that she couldn&#39;t stand horror games. We talked so much that we were the only people left in the store, and the clerks had to force us out as they were closing. Looking back on those days, I wished that I had valued the time we had together more.</p>\n\n<p>I took the black wrapping paper off the box and opened its contents, the barely used headset sat deep in the confines of the box, the only paperwork inside sat ontop. &quot;Thank you for your purchase! Enjoy the complimentary software included!&quot; were the only words on the folded white sheet of paper. I took the headset out of the box, noting that there were long scratches on the sides of the headset, which must&#39;ve been why the price was so good on the unit. Even if I couldn&#39;t sell this in the store, this was still a steal at the price I got it for. </p>\n\n<p>I took the unit out and plugged it into the computer in our bedroom, and sat down at the computer chair while the drivers installed. After a few moments of impatiently waiting, the installation was done and I clicked the executable file, playme.exe, on the install folder. My computer whirred loudly and the internal fans of the computer cut on, and my computer screen cut away as the headset software loaded up. Out of curiosity, I alt tabbed and closed the program, and tried to load up a few of the dozen or so other VR compatible games that I had downloaded on my computer. I remember frowning, as each and everyone of them crashed, telling me the headset wasn&#39;t compatible with the games. Determined not to be disappointed, fearing that I had bought a VR headset that wasn&#39;t going to work with any other games, I clicked on the program and put the headset on my head.</p>\n\n<p>I was in what looked like an underground room, a basement of some sort. There were no windows and the room was illuminated by a single light bulb dangling from the ceiling, its  yellow light doing little to illuminate the vast room I was in. I looked around, trying to find a door of some sort, but couldn&#39;t find one. The only object that looked interactable was a single, floor length mirror set into the center of the concrete wall across from me. I was impressed with the graphics of the game, as everything seemed nearly photorealistically detailed. I tried to press ESC on my keyboard to bring up the menu of the game so I could check the graphics settings and see what was under the hood, but nothing happened. The only audio in game was the sounds of my loud footsteps reverberating against the walls of the concrete room.</p>\n\n<p>I approached the mirror from an angle, and was surprised to find a figured standing in it when I looked at the mirror straight on. The figure in the mirror was a young red headed man wearing blue jeans and a dark shirt. I couldn&#39;t look down to see my body in the game, so I couldn&#39;t tell if this was supposed to be a reflection of my character in the mirror or something else. Since this seemed to be the thing the game wanted me to do, I approached the mirror to get a better look at the man. He didn&#39;t move, which threw me off, since if he was supposed to be a reflection of my in game character, he should&#39;ve been matching my movements in the reflection. He wasn&#39;t moving at all, just staring back at me through the mirror. But he had a horrible smile, stretched beyond the bounds of normal human mirth and laughter, and I felt the twinges of fear in my chest as the game began to get good. The man&#39;s grin never left his face as I got close to the mirror.</p>\n\n<p>I turned my head, breaking the staredown, to the right to see if I had missed any details in the environment. Finding none, I turned back to the mirror and saw the man walking away from me. Except the environment in the mirrored reflection was different, instead of him being in same concrete room I was in, he was walking down a hallway in a home now. Just before he turned the corner of the hallway, he turned his head so I could see his inhuman grin once again, and he disappeared beyond sight. Years of playing video games had taught me that he wanted me to follow him, so I did. I walked into the mirror and found myself transported into a different location.  I was in the same hallway, except now I could hear the faint crackle of static from somewhere else in the environment. This was clearly someone&#39;s home, as the walls were framed with pictures of the red headed man and a woman. One picture had them on a beach, the other in a park, and the rest had similar settings. I turned to look behind me at the mirror I had come from, but it was cracked in a multitude of spiderwebs. I walked over to the mirror and tried to enter it, but I could no longer interact and pass through it like I had before.  </p>\n\n<p>Still thinking this was the charm of this game, which was quickly becoming a horror game of sorts, I turned around and explored the hallway. I passed more pictures of the red headed man and the woman, and attempted to enter a few of the doors but was unable to, triggering a loud audio cue of a door knob rattling. I moved down the hallway, my footsteps pattering loudly on the wooden floor, and the sound of the static began to get louder. I turned the corner, expecting to see the red headed man again, but I discovered I was in a living room, with a large television and sectional couch set in the center of the room. I didn&#39;t see another mirror, signalling the end of this level, but discovered the source of the static noise. A computer monitor, set on a simple black desk on the right side of the room, emitted the static noise I had been hearing, and the black and white snowscreen of the monitor painted the room with its white glow. On the desk was a VR headset, and upon further inspection seemed to be the same model and make of the one I had purchased and was currently using, with a note next to it with the words &quot;Play me&quot; scrawled in sloppy cursive writing. </p>\n\n<p>Not seeing any other alternative, I clicked on the headset, interacting with it, and my character lurched down into the computer chair and put the headset on. The realistic graphics and blur of the motion made my stomache somewhat queasy, which wasn&#39;t an uncommon effect of playing some VR games for me. The screen went black momentarily, and when the game came back on, I found myself once again at the beginning of the level, in the same hallway. I turned around, and saw that the mirror was still broken, which meant I had some other objective to complete here. I looked at the pictures on the walls as I walked down the hallway, and stopped to inspect one when I noticed the images had changed. There was a thin woman wearing medical scrubs, accompanied by a shorter man with blond hair...the images were blurry, which I attributed to the limitations of the VR headset, but I could&#39;ve sworn that the pictures were of me and Vanessa. I turned around, and knew that I was right. I recognized us in the center of one the photos, we were smiling at the camera, our clothes sweaty and dirty. We had taken this one on a backpacking trip to the Grand Canyon a few years ago on our anniversary. I remembered thinking then that something was wrong, but I rationalized it, thinking the game must&#39;ve intelligently scanned some of the images I had saved from that trip onto my harddrive to further immerse me in the world.</p>\n\n<p>I walked back down the hallway, turned the corner, and saw that I wasn&#39;t alone in the living room. There was a man, who had my proportions and features, sitting in the computer desk. I could see some blond hair poking out through the VR headset, and knew that this was a virtual representation of the real me, from the real world. Again, thinking this was just the game, I was impressed at the technical wizardry of the game and endeavored to check out any other games the devs had worked on when I was finished. This time there wasn&#39;t any static playing on the computer monitor. The screen was completely black. I approached the sitting figure and moved to interact with him, as I had done so previously. I clicked on the headset, and watched as I sat down occupying the same space as the sitting virtual version of me. </p>\n\n<p>Suddenly my VR screen went black, and I wondered if the game had crashed. I suddenly jumped as the red headed man filled the screen, the only sound I heard was his long, deep breaths. Now that I was closer I could get a better look at him. The red headed man stopped smiling that cold, joyless smile of his, and I wished he hadn&#39;t. He opened his mouth wide, wider than possible, and I could see the white flash of rows of wickedly sharp teeth from within his mouth. I heard the audible pop of his jaw dislocating itself as his mouth contorted and opened further, until it had reached impossible proportions. The red headed man&#39;s mouth was now an impossibly stretched maw, a chasm of sharp teeth, and he took a step closer towards me, his jaw closing in on my screen. It was at that point that I had had enough and had decided that the game was too realistic and too scary, but none of the prompts on my keyboard responded. As the red headed man got closer to me, I began to panic, and attempted to remove the headset, but found that it was shut impossibly tight on my head. I had to dig my nails painfully into the side of my head to remove it finally, leaving several trails of blood in the process. When I took the headset off the game had crashed and I found myself looking at the familiar sight of my computer desktop. </p>\n\n<p>Completely disturbed at the nature of the headset and the game, I rushed back to my messenger bag on the kitchen table. I emptied the contents of it on the table, an act that startled Tom and sent him running, desperately trying to find the folder that contained all of the information on the estate. I searched through all of the papers in my bag and couldn&#39;t find them, and remembered that I had left them in a folder at the office in my antique store. I rushed out to my car, barely remembering Vanessa, and arrived shortly at the store. I turned off the security system, and walked into my office where I found the estate folder sitting on my desk. I opened the folder and was consumed with horror as I recognized the picture clipped to the top left of the papers. It was a red headed man, smiling up at me with pearly white teeth. I glanced at his personal information and saw that a phone number was listed under his contact information. I frantically dialed the number and was met with a cold electronic voice that told me the line had been disconnected. Numb from shock, I grabbed the folder and headed out to my car, and made the trip back to my apartment.  </p>\n\n<p>When I arrived at my apartment building I knew something was wrong. Several New Orleans Police Officers had the entrance to the building roped off with crime scene tape, and several onlookers were standing behind the barriers, talking excitedly about what was going on. I approached one of the officers at the front entrance, and he told me that the building was closed off except to through traffic due to an ongoing investigation. He wouldn&#39;t tell me what had happened, except that a neighbor had called about screams coming from one of the apartments, but let me pass when I told him I lived in the building. When the elevator doors opened up onto my floor, I felt a chill go down my spine, as more police officers were outside my apartment, speaking in hushed tones. They let me through after I told them I lived there. I demanded answers, and got none in return, but their pale faces clued me in on what I was about to see. I saw Vanessa&#39;s black purse, a gift from me, sitting on the kitchen table and readied myself for what I was about to see in the bedroom. A large detective, busy taking photographs, obscured most of the view of the bedroom, but I could see the VR headset on my computer desk where I had left it. The entire room was splattered with blood, the walls and bed were covered, and blood dripped down from the ceiling. I smelled the coppery fluid, and felt the bile rising in the back of my throat. I quickly rushed to the hallway bathroom and threw up the contents of my stomach all over the inside of the bowl. </p>\n\n<p>Vanessa is gone and the VR headset is in the possession of the police, who tell me that it&#39;s evidence in the investigation. There have been no leads in her murder, and the police have told me they&#39;re baffled by the case. They can&#39;t figured out what happened to her or where her body went. It&#39;s been two weeks since her death, and I woke up in the middle of the night to the sound of static coming from my computer monitor, which was covered in that familiar black and white snowscreen. I&#39;m writing this now to tell all of you about what happened to me, in the hopes that maybe you&#39;ve experienced something similiar and can tell me what&#39;s going on. I&#39;m going to try to look into the red headed man&#39;s death, and see if I can figure out what happened to him. In the meantime, if you happen upon a deal of a lifetime like I had, think of my story and consider passing it up. Sometimes things that seem <a href=\"https://youtu.be/_IeL2OoZMWU\" rel=\"nofollow\">too good to be true</a> really are.</p>\n</div>\n","author":"MidnightVigil"}