{"rank":"7","title":"Resident","id":"8mw53g","url":"/r/nosleep/comments/8mw53g/resident/","time":"1527566518000","body":"<div class=\"md\"><p>When my wife and I were five months engaged, we bought a house. It was to be a starter home, but 18 years later, we&#39;re still here.  I guess it has a bit to do with my fortune, or lack of it. Still, we&#39;ve always loved this quirky yellow bungalow.  </p>\n\n<p>We started fixing her up and we spent our honeymoon night there with flowers and candles. Our goal had been to get everything ready by the wedding and we did. Tahiti or Vegas wouldn&#39;t have made things any better or us any more content. We were so happy there, and in love, and we are to this day.</p>\n\n<p>As we started painting and knocking out walls in the  midst of wedding plans, we were amused by the scattered mail that would come. I lived in an apartment across town with two apartment mates and Katie lived at home with her folks, so neither of us had changed addresses. That little bit of mail we would get before moving in always seemed to be addressed to &quot;Resident&quot; not &quot;Occupant&quot; or &quot;Homeowner.&quot; Katie started it when she said, &quot;Resident gets more mail than I ever did.&quot;  Whenever I&#39;d eat the last slice of pizza in the fridge or there&#39;d be a bump at night, we&#39;d grin and assign the cause to our newly named friend.</p>\n\n<p>As Jenna and Ed were born, Resident took stronger hold. In nighttime prayers, we&#39;d ask God to Bless Resident to the giggles and squeals of the kids. When a cold or flu came around, we&#39;d say that Resident will keep watch over you while mommy runs to the store and daddy makes dinner.  </p>\n\n<p>Resident was part of our family fixtures. It became like the love you have for a stuffed animal that you know is not real and yet a little bit of you says, &quot;Hell yes it is and I love it and it loves me and I&#39;m a grown person and I&#39;ll keep it to myself, but I know!&quot;  </p>\n\n<p>Did you ever use that phrase at work, something to the effect that we&#39;d better involve more than one person because, &quot;What if they were hit by a bus?&quot;? We&#39;ll, just my luck. I was hit by a city bus. A semi driver fell asleep, veered at the bus and the bus driver hit me along with two other pedestrians at the bus stop.  </p>\n\n<p>I thought the settlement was fair, but over the years my pain has increased. I like pain meds too much, so I stopped taking them, but I can&#39;t sit or even drive for more than a few minutes at a time without a pain level of five out of ten. I call in sick a lot.  I limp a bit. My performance has suffered at IT and accounting jobs. I feel like the pain has held me back. </p>\n\n<p>Maybe that&#39;s why the neighborhood got crumby around us and me not able to afford a move.  I worry that the kids aren&#39;t safe on their way to school.  I worry that an intruder could push right by my cripple ass.  I wanted to get a gun but Katie absolutely is against that.</p>\n\n<p>Last year was Jenna&#39;s homecoming and her first date. I had seen the boy she was going with in the neighborhood. Tall and lean, he hung out by the drugstore and I know that the boys over there were older and hoods-in-the-making.</p>\n\n<p>Maybe, I thought, it&#39;s just a dad doesn&#39;t want to see his baby girl date, but there was something about this kid I couldn&#39;t stand. He had a way of looking at you, his eyes and his grin, that were...evil.  I did nothing. Why? Mostly because I did not want to disturb Katie, or ruin Jenna&#39;s date - - or, truth be told - - because I felt like a weakling and doubted my tired, 135 pound frame could even take down a 15-year-old punk if I needed to with all the pain and entropy in my legs and back.  </p>\n\n<p>When he came to the door, I let him in and the little bastard walked in front of me, mock limping. Katie and Jenna were getting ready in the back bedroom and Ed was at basketball practice.  &quot;Isn&#39;t this where you tell me what I can and can&#39;t do to your daughter?&quot; His laugh was sour and a bit menacing. I needed to make a move, but I was frozen.</p>\n\n<p>Next thing, this lean kid was rising to the ceiling, gasping for breath. Two front teeth flew out of his mouth as he choked on blood and gasped for air at the same time.  I couldn&#39;t understand how teeth flew out of his body, far across the room.  I began pulling him down, toward the floor. In that moment, I was rooting for the kid since all I had wanted to do was shake him or threaten him.  When I won the tug of war and pulled him to the floor, he tried standing up.  The back of his head banged, or was banged, into the wall with stunning force.  Katie and Jenna came running in response to the noise and just in time to see a bloody streak slamming out the door as fast as he could in his condition, running down the middle of the street.</p>\n\n<p>&quot;What did you do, daddy?&quot; Jenna asked. It was not an accusation, just a stunned questioned. &quot;Nothing. Honest.&quot; We all knew, or suspected, and we never said Resident&#39;s name, but we knew. Like I said, just like you know that stuffed animal is a tiny bit real, we knew the power in Resident, whether we created it or whether it had been around a long time before folks like you and me.  </p>\n\n<p>The beat-down seemed Draconian and I began to feel like it was over the top, even for that useless thug. I expected the cops to come pounding at my door, or more likely, his boys from the drugstore corner.  </p>\n\n<p>The police did show up, not to arrest me or to ask questions about the battery, but to notify us that the boy, whose name I leaned was Eldon Franks, had been arrested in connection with a murder of a young girl, whose body had been found burned and abused.\nHer parents were in anguish, naturally.  &quot;Lucky you stopped him from taking your daughter out.&quot; The detective said, in an almost admiring way. I felt like a fraud, but said nothing. </p>\n\n<p>The next day, alone for a moment in my busy house, I took out a note card, a stamp, and an envelope and addressed my note to Resident. &quot;You are a welcome part of this family. You saved us where I failed. Thank you from the bottom of my heart.&quot;  I addressed the envelope simply to Resident. I didn&#39;t want the note coming back and Katie or the kids seeing it, so I put no address.  I had tears in my eyes of gratitude, of love, and of shame for not being a better protector.</p>\n\n<p>A few days later I received a brochure in the mail. It was a glossy tri-fold of a gym, physical therapy center, and martial arts studio all in one, opening near my work.  It could have been that they got my name from the accident and law suit, but the return address told me different. On a small label in the space for the sender&#39;s address was my own home. The name above it was &quot;Ms. Resident.&quot;</p>\n\n<p>I know there is a lot of gore about evil and spirits in books and films, and I expect some of it comes from real life, but Ms. Resident is the opposite of evil. This spirit is Family. She has saved my daughter, protected our household, and motivated this soggy old man not to give us so easily.   </p>\n</div>\n","author":"zerotimesten"}