{"rank":"1","title":"The Candy Factory","id":"8mw75n","url":"/r/nosleep/comments/8mw75n/the_candy_factory/","time":"1527567106000","body":"<div class=\"md\"><p>Let me fill in to my current situation, as I an currently in quite a pickle and need some advice.</p>\n\n<p>I enjoy frequenting my local candy factory, as they have exclusive candies that cannot really be found anywhere else, not even candy based stores and the like. Usually, I take my candy to go, but today, I felt different. Everything seemed much more pleasant today. The sky was a clear, beautiful blue. There were no howling dogs, no loud, peace disrupting helicopters on the sky, and what I&#39;m especially thankful for, no police sirens. Ever since I was a young little boy, I had a fear of police sirens. No idea why. They just have a terrifying presence, if that makes sense. </p>\n\n<p>Anyways, I decided that today I would stop and enjoy the candies from the source that brings me such a joy that no other thing really does. The walls of the factory today looked different today, perhaps it is because I was going slower, or maybe they were recently repainted, but the creamy texture that they presented was irresistible. I stopped and admired every now and then, as I walked to the production area. I noticed today on the TV&#39;s that they have playing in the lobbies that police are searching for a person who had been kidnapping children and presumably killing them. It chilled me to the bone that people could do such a thing. I tried to ignore it and continued my journey as I wanted today to be as happy as it could be.</p>\n\n<p>Finally, I arrived at my destination. If I really want to get the best of your advice, I have to be honest. I steal the candy. I know, a terrible crime against humanity, but I am not the most wealthy person and so I must do what I consider survival. Anyway, I looked around to make sure no one was around and edged closer to the beauts. They were each individually enclosed; accompanied by a looking glass that shined my eyes into the room. It was this glass that made me realize I&#39;m not the only one who thinks these treats are something precious. Still no idea why they aren&#39;t available to the public.</p>\n\n<p>Eventually after admiring them I walked and locked the door. Typically, I only snag one candy as they are quite big and pack a punch. It doesn&#39;t sound like much, but you must consider that I eat very little, some days not even nothing, if that helps put my level of poverty into perspective. Today I felt especially hungry and a little choosy and I took my time with choosing my confection. I perused my selection, being careful not to choose one that was bruised or had marks. Then, I found a great one. Not too big, not too small, perfect size and beautiful color that only added to its edibility. I picked it up and left my mark.</p>\n\n<p>It crunched, as they usually do, but this one made quite a mess. I forgot to mention, these candles are somewhat like truffles, as they have a nice syrup inside and small pieces of what I presume are fruit. I was actually a little sad about it, because it ruined the perfect white walls. When I looked at the stained sides I realized that they had flowers on them. How whimsical! One of my favorite parts is seeing the syrup they contain flow like a waterfall. I was watching this with a massive grin when I heard something that chilled me to the bone.</p>\n\n<p>It was an awful screech, coming from behind me, albeit a little bit muffled, but still very frightening. I quickly turned and saw what it was. One of the workers. They stared for a few seconds that felt like decades and then ran off. I stood idly, very dumbfounded. What a strange thing to react to! After collecting myself, I walked out the door and saw large men heading towards my area. Despite not eating much, I&#39;m pretty athletic and a quick runner. I easily out paced them and jumped into a storage area and barricaded the door. I&#39;m still in here. It&#39;s been about 10 minutes, and I can hear the awful helicopters circling overhead and head sirens a few minutes ago. I am horrified, but also very surprised. I understand stealing is a bad thing, but is all this really necessary?</p>\n\n<p>What should I do?</p>\n</div>\n","author":"bryanji7"}