{"rank":"1","title":"My First Time Spelunking","id":"8mw9lw","url":"/r/nosleep/comments/8mw9lw/my_first_time_spelunking/","time":"1527567824000","body":"<div class=\"md\"><p>I’ve been a reader here for quite a while, but this is the first time I’ve felt like I had something worth sharing. What happened to me was beyond bizarre and I’m still a little rattled but maybe the act of getting it all out will help.</p>\n\n<p>It happened a few weeks ago when I decided to try spelunking for the first time. Now I’m a pretty experienced camper but cave diving itself was brand new to me. The park closest to me though was known for having a good “beginner-level” cave so I decided I’d head to that one. And when I say beginner, I mean you don’t need any real equipment or even experience. Climb into the caves, crawl around a little, don’t be a jackass, and you’ll be just fine.</p>\n\n<p>With it being quite cold still for May I figured I’d have the place mostly to myself and I was right. When I got to the park bright and early to fill out my information, the rangers told me I was the only one there. After being given a few tips for exploring I set out.</p>\n\n<p>I hiked a short distance until the trail brought me right to the cave’s entrance. It was basically just a hole in the ground with metal rungs hammered like a ladder into the rock face. You could see down maybe a couple of feet but after that it was basically total blackness. I could not have been more excited. After checking that all my stuff was secured tightly (I didn’t have much, I was only planning on being there a few hours) and then turning on my headlamp, I began the climb down into the cave.</p>\n\n<p>The cold is one of the first things you notice. As chilly as it was outside it was almost frigid in the cave, and it was that wet sort of cold that really seeps into you. The deeper I descended the colder it got.</p>\n\n<p>Once I’d gotten to the bottom and looked around though I had already forgotten about the temperature. It was amazing down there! A whole subterranean world untouched and untroubled by the concerns of the surface, full of dark rock and glinting corners and strange cave fauna. And so quiet. To a degree I’m used to the quiet. I love the outdoors and as I’ve mentioned I’m an avid camper, but in the forest there’s always some background noise. Whether it’s the wind through the trees, or insects humming, the woods are almost never totally quiet. The cave, however, was silent. It was like a blanket over my ears, lifting only when I moved.</p>\n\n<p>The next few hours were fascinating for me, exploring the cave and peering at every crevice in detail, but I’ll skip ahead to the part where things got strange. The cave was wormed through with a lot of little fissures and holes, most of which were way too small to fit a person. Some of them though, looked large enough and eventually my curiosity got the better of me. I decided to try to squeeze through one to find out what was on the other side. With a vision of Indiana Jones playing in my mind, I squeezed myself foot first into what was basically a crawlspace and began to slide through it.</p>\n\n<p>It was easy going at first but after about fifteen feet it started to get more cramped. Another ten feet in and it was really tight. Five more and I realized I was completely and totally stuck. I had wedged myself into the fissure by pinning my shoulders and now I didn’t have the leverage to pull myself back out. Very Indiana Jones.</p>\n\n<p>To be honest though, I wasn’t very panicked. I had given the rangers my full itinerary and if I wasn’t back at the lodge in about an hour they’d come looking for me right in this cave and eventually I’d hear them calling. The cave wasn’t huge either, and apart from the tunnel I found myself in currently, it was all very linear.</p>\n\n<p>So, I settled in to wait and basically twiddle my thumbs. My headlamp had plenty of juice left in it and luckily my neck still had some mobility so that I could look back up the path I’d come, as well as a teeny tiny bit at the path ahead through a small space between my feet.</p>\n\n<p>The rescue came even sooner than I expected.</p>\n\n<p>“Hello,”-I heard in the distance-“hello, Matthew, can you hear me?”</p>\n\n<p>I grinned with relief and yelled back, “I’m here! I’m over here.”</p>\n\n<p>I heard the sound of hurrying feet. When they stopped, there was a small chuckle.</p>\n\n<p>“Oh, my lord,” the voice said, amused, “how on earth did you even… Not to worry though, young man, I’ll get you out of there soon enough. My name is Rick and I’m a ranger at the lodge. When you didn’t come back like you were supposed to we sent someone out right away.”</p>\n\n<p>Rick’s voice was pleasant and calm, reminding me a little of my grandfather’s.</p>\n\n<p>“Anyway,” Rick continued, “it’s a pretty simple matter to get you out of here. Basically, I’m just gonna’ be pulling you out gradually but to do that I’ve got to widen out the space in places, so we don’t get you stuck again. Shouldn’t take more than an hour so and then you’ll be having a nice cool drink with us back at the cabin. You okay until then, buddy?”</p>\n\n<p>“Yeah, definitely!” I replied. “Thank you so much for coming for me.”</p>\n\n<p>“Ain’t a problem, young man. This is my job after all, I’m happy to do it. Just settle in, make yourself as comfortable as you can, and I’ll get started over here.”</p>\n\n<p>I saw his lights flicker in the corner of my vision as he began. There was the occasional sound of tools banging away at rocks and other times what sounded like scraping. One thing puzzled me though; the light I saw was coming from between my feet, from underneath me.</p>\n\n<p>“Hey, Rick,” I called out, “you’re starting from below me?”</p>\n\n<p>“Yes indeed. There’s two entrances to this cave system. The first is fairly straightforward, and we didn’t think there was much chance you would have gotten stuck going through there, so I took a bet on maybe you having come through the second path; it’s a little more difficult down here. Now it looks like you’re actually stuck between the two levels but they’re connected in places, so I can get you out through here as well. We’ll basically pull you down here first to get out.”</p>\n\n<p>I didn’t remember there being a second entrance marked on any of the maps, but I nodded and replied, “Got it.”</p>\n\n<p>“But don’t worry about that,” said Rick, “why don’t we chat about something else. What brings you to our fine establishment today?”</p>\n\n<p>“Well, I’m a student at the university and I’m actually done my semester a little early. All my friends and my girlfriend are still going at it for a couple more days though, so I figured I’d come up here and try my hand at cave diving.” I laughed, “Maybe not the best first time eh?”</p>\n\n<p>“No, it wasn’t.” His voice sounded different for a second. Flat, almost, and deeper. It went back to normal when he spoke again though, leaving me only mildly puzzled. “And your girlfriend didn’t mind you taking off without her?”</p>\n\n<p>“Nah,” I replied. “To be honest, I think she was a little happy I wasn’t there to pester her while she was studying for her exams.”</p>\n\n<p>He gave a laugh that had that same flat quality to it again. “Probably for the best. If she’d come with you she’d probably be lying here with a broken neck and her insides painted on her outsides.”</p>\n\n<p>I felt a chill pass over me and I immediately felt my temper flare. “What the hell did you just say?”</p>\n\n<p>He laughed again. “I’m just making a joke, young man, calm down. Just pulling your leg a little to ease the tension.”</p>\n\n<p>The chill I had didn’t go away though. I was still angry and no longer in the mood to talk.</p>\n\n<p>It was silent then for a while except for the sound of scraping coming from below me, a rough noise like grinding gears.</p>\n\n<p>“We could bring her down here too.” His voice was flat again, and had a gravel edge to it now, not unlike the sounds of his tools.</p>\n\n<p>I ignored him. I was furious but being wedged into a hole there wasn’t very much I could do to rectify the situation. I wondered idly if anyone had ever punched their rescuer in the face after being saved.</p>\n\n<p>“Of course,” he continued, over the sound of grinding that was slowly working its way up towards me, “we’d have to scoop her eyes out when she gets here.”</p>\n\n<p>What sort of sick nonsense was this twisted ranger going on about?</p>\n\n<p>“There are things here she should not see. The yellow lady for one. Do you know about her? Her skin is yellow and her eyes are yellow but her smile is black and she wears a crown of rotted mushrooms upon her rotted brow.”</p>\n\n<p>I looked down between my feet but I still couldn’t see what was beneath them except for the occasional glint of light. My anger was now tinged with disquiet.</p>\n\n<p>“We would probably have to cut off her ears too. Oh yes, certainly, certainly. Do you know of the god Pan and his pipes? He doesn’t live here in the stinking dark but there is one like him who plays a different set of pipes. The noise they make is that of children burning. They say though, that if you present him with your bloody ears he’ll play you a different sort of melody, one that you’ll hear, ears or not.”</p>\n\n<p>I was squirming now. Something was very wrong here. The scraping was coming closer steadily, and it began to sound in my mind like clawing. Rick’s voice was getting closer too; he was in the tunnel with me.</p>\n\n<p>“And Matthew? She won’t want to touch very much down here.” His voice was iron and stone now and dripped with sinister rust. “We should probably cut off each off her fingers and toes, Matthew. They won’t go to waste though. I use the toe bones to make my tools, they’re quite sturdy you know. And the finger bones go straight into my mouth where they slot right in. And hey, presto chango, I’ve got more teeth. Won’t that be nice.”</p>\n\n<p>Terror. That’s all I felt now. Whatever was down there was no ranger and definitely wasn’t something I wanted to meet. I sucked in my stomach as far as it would go, dug one shoulder into the side of the rock and used every possible muscle I had at my disposal to try to inch my body up. I didn’t move at all.</p>\n\n<p>From below me came a slow, grating roll of laughter. There was no mirth to it, and it echoed around me in the tunnel. “Don’t leave yet, Matthew. I haven’t even gotten to why you probably won’t want your nose down here either.”</p>\n\n<p>I buried my shoulder into the rock once more, so deep it may have drawn blood. I tensed every muscle with as much strength as I could muster and tried to move again. I felt myself lift! I had gained an inch or two. It was just enough though to provide me with a bit more leverage to continue moving myself. I tensed again and gave another push. Another couple of inches slid by me.</p>\n\n<p>I was moving. Slowly, painfully slowly, but I was moving. Bit by bit I scooted myself back up the tunnel not daring to pause for even a second. I could still hear the scraping from below me.</p>\n\n<p>I tore probably half of the skin off of my back and arms in my rush. About ten feet from the entrance the tunnel widened significantly and I was able to propel myself up the last stretch at quite a speed. I landed hard on the floor of the cavern behind me and scrambled to my feet.</p>\n\n<p>For just a second, I stood still to listen. I couldn’t hear anything. The hole I’d crawled out of was as still as a tomb. And then I heard the laughter again, quiet and grinding, in the darkness where dark things lived. I sprinted for the exit and didn’t stop running until I arrived at the ranger’s cabin breathless and looking like I’d fallen off a cliff Homer Simpson style, bumping into every rock along the way.</p>\n\n<p>The staff looked at me in amazement and made sure I was okay. They told me that they’d just been about to send someone looking. And they told me, of course, that there was no one working there named Rick. </p>\n</div>\n","author":"blue_raptor55"}