{"rank":"3","title":"I found a strange letter from my friend","id":"8mw9hg","url":"/r/nosleep/comments/8mw9hg/i_found_a_strange_letter_from_my_friend/","time":"1527567790000","body":"<div class=\"md\"><p>Hey. I don’t normally post on here. I usually just observe. However when I found this letter from my friend I knew that I couldn’t not post it somewhere because there’s a lot off about it.  so here it is, </p>\n\n<p>“ Hello there. I’m sure you’re wondering what this is and why you’re reading it. Well you see in class I couldn’t help but notice you. I’ve never seen you before. \nWere you new? </p>\n\n<p>Anyways I noticed you didn’t have anyone to talk to in all the classes that we had together. You sat alone at lunch. I feel bad for you. I didn’t say anything because I had my own group of friends who are very judgmental. </p>\n\n<p>Days went by and I felt worse and worse, I don’t exactly know why though. Yes of course I felt bad for you but that wasn’t quite all I was feeling. I think.... I think I liked you. It’s quick to say something like that I know. Your curly brown hair and pale green eyes called to me. They were saying my name into an endless void of silence. Maybe that’s why I first went up to you. </p>\n\n<p>I could’ve sworn you felt my presence and turned around to greet me with a smile. It caught me off guard. Who knew someone so quiet was so energetic. You greeted me with your usual “Hi there friend” Friend? Maybe I’m just overreacting but that made me feel warm. I immediately invited you to my table, much to my friends dismay. Though after a couple days you fit right in. </p>\n\n<p>We met up every night after school in the graveyard. We laid next to the stones and told tales of our lives. The sixth night we hung out was the night we first kissed. It made my insides curl into a smile. I felt like there were fireworks. I felt from your face that you did too. Honey your eyes shine like emeralds under that moonlight. I would pay a lot for eyes like those. As the nights went by we got closer. </p>\n\n<p>You even invited me into your house once. It was cold and dark and no one else was home. You insisted I not turn on the lights and we watched movies on your phone. It didn’t smell too good but who was I to judge, my house didn’t smell too great either.  I never invited you there though, my parents wouldn’t like you. </p>\n\n<p>A month in I asked you to be my girlfriend. I don’t know why you hesitated. You said yes though. We were the talk of the school. Every time we walked by the hallway went into whispers. I don’t care what they were saying. All I cared about was you. The little pieces of your hair that came off onto my sweater made me smile. I thought about keeping them but I felt that that would be creepy.</p>\n\n<p>As the months went by we never fell out of love. In fact, we only fell more into it. You dyed your hair. I wish you wouldn’t have done that. I liked the brown better than the green. I didn’t say anything though. It made you happy so who I was to say anything. My friends tried to flirt with you. I taught them all lessons on why you shouldn’t mess with my girlfriend. I told them not to tell you and they haven’t yet. I don’t think they will. </p>\n\n<p>You never made friends that were out of our group. I felt that was strange. At the parties when you did come you only stuck by me. I thought it was cute. When you got drunk you would tell me how you wanted to keep me forever. Isn’t that sweet. </p>\n\n<p>Your hugs were so tight how could someone not love them. Your body was always cold as ice so I always need to warm you up. I will warm you up till you’re all gone. Have you ever heard of the saying “ You’re so cute I could just eat you up” that how I feel about you. </p>\n\n<p>You like to tell me stories about how when you were little you had dream where you could fly. I wish I could fly and I believe that one day I will. I hope you’ll fly with me. </p>\n\n<p>For Christmas we got the best gifts for each other. You gave me the tools that I wanted and I gave you the ropes you wanted. You like rock climbing. We went rock climbing all the time after that. You seemed to float up the rocks. It’s cute how fast you climb. One time you almost fell but you caught yourself. You seemed embarrassed. I thought it was cute. You didn’t seem the same after that. Did I react wrong? I didn’t mean to. </p>\n\n<p>You never came to the graveyard anymore. That’s when I first made my plan to get you back. I wasn’t gonna let you go.  You started talking to the other guys in the group. they don’t care about you. I do. I love you. I want to be with you. The other guys are starting to catch on. They try to talk to me. I don’t want their friendship. I want your love. Why won’t you love me? </p>\n\n<p>You asked to come to my house. I don’t want you coming. I suggest that we should go to yours but you disagreed. I let you in. No one is home. I made sure of it before I let you in. I think we’re okay. You apologized and you told me you were planning my birthday present. You said it would change me. I’m happy that you still care for me. I told you that I don’t want to lose you. That seemed to make you happy. I’m glad that made you happy. </p>\n\n<p>I got to hold you again. I missed warming you up. You feel colder. We talked for a long time and you told me that your dreams weren’t dreams. I asked if you could teach me how to fly and you said yes. We planned to fly next week. I can’t wait until then. </p>\n\n<p>I have to make sure I always have you. That’s why I always dream about the ways I can keep you with me. I think you acted on it first though. I’m glad that you wanted to keep me with you too. </p>\n\n<p>The days trudged by until the day we would fly together. We went to the top of the highest cliff and you showed me how you could fly. I watched as the wind blew through your hair. </p>\n\n<p>Then it was my turn. You told me to jump and tied me up to make sure I would rely on only your help. You told me that you would catch me and help me fly. As my head smashed into the pavement I knew that I loved you too hard. I loved you so hard that it killed me. I was supposed to be the one killing you.” </p>\n\n<p>What do you guys think? I really don’t know what how to feel about this. I always knew something was off about their relationship but this is just a lot to process. I don’t know when he wrote this or if she did to trick me but I don’t want to jump to any conclusions. Any thoughts? </p>\n</div>\n","author":"Quinnithy27"}