{"rank":"2","title":"My Nightmare Encounter- Craigslist Story From Hell","id":"8mwb7g","url":"/r/nosleep/comments/8mwb7g/my_nightmare_encounter_craigslist_story_from_hell/","time":"1527568290000","body":"<div class=\"md\"><p>May 28, 2018</p>\n\n<p>My nightmare encounter- Craigslist story from hell</p>\n\n<p>It had been a year since my mother passed away. My ex-boyfriend of many years decided he didn’t want to deal with my mother’s illness or future passing. He conveniently stopped all communication with me, and found someone else. He cut me loose no closure. It seems-- I was alone. No one had my back. No one was there to support me. I didn’t know how I was going to move on with my life. My mother was my best friend. And fucking cancer took her from me.</p>\n\n<p>After over a year had gone by, I decided to search the internet for places I can discuss what I was going through, with someone. Anyone. Writing was my release, and when shit hit the fan, I always found comfort in typing the blues away. A chatroom, or platform where I could vent, was all I had in mind.</p>\n\n<p>I decided to go on Craigslist as one of the options. I know it’s shady. But there is a section where you can just post things specifically. However, I soon realized that there is always someone posting inappropriately all the time even if it’s unwanted or in the wrong section. Don’t ask me how, but someone aged “40” replied to my post, and then just kept writing and writing me until the wee hours of the morning. This went on for six months. He had told me his experiences, things we had in common, interests, work, life. And in those six months, he asked me several times to meet him for coffee nearby. What were the chances that he was so close to where I lived? I gently always turned him down. I had no interest in actually meeting with someone. None.</p>\n\n<p>One night, our conversation took a turn. He just wanted to see pictures of me. He sent some of himself. Cleancut, office kind of guy, and not my type at all-- but friendly pictures. I did the same. I didn’t want to but I felt I had to send something. His reaction just was over the top. He showered me with endless compliments, and now was insisting on seeing me no matter what. I thought it would be harmless. After all, what could go wrong meeting at a local Tim Hortons for coffee full of people?</p>\n\n<p>I dressed myself, forced myself to look a little better than usual, but I didn’t go all out. I wasn’t thrilled about this meetup. I had never done this in my life. My previous boyfriend was from school, and I stuck with him all these years. I never did the blind dating, or online relationship before. I heard some horror stories. But overall, I just was not prepared, and so let down by men, that I just thought this would go no-where.</p>\n\n<p>I finally met Paul. He was like in his pictures, except he was full of scars on his face. Strange scars he quickly justified as having issues with acne when he was younger. I had issues, and these did not look anything like acne scarring. It was as though he had been beaten and healed badly. I did not concern myself with this. I listened to him for six hours at the coffee shop. It was open all night. I was glad not to be doing so much talking. However, some instances came off as a little fake and as though he was <em>acting.</em></p>\n\n<p>I brushed this off. He began to tear up when he spoke about his grandparents passing away. The acting became worse. I felt bad thinking that it wasn’t real. I refrained from comforting him. I usually would. But something made me not do it.</p>\n\n<p>We parted ways, and he was giddy and wanted to see me again. I went home and thought about it and said to myself, <em>eh… he is not your type</em>. He lied about being 40, he said he was 48 and hoped I didn’t mind. That should already have been red flag number one.</p>\n\n<p>We continued to see each other once a week, it was getting closer to the Holidays and I love Christmas even though it’s a sad time for me. I briefly thought <em>maybe this Christmas, I won’t be alone if Paul is in the picture.</em> And so, already by date number three, he had bagged me. How he manipulated me was unreal. Why I was giving this guy a chance, I don’t know. I felt that at his age, and knowing about what happened with my mother, he was sincere and mature. I didn’t see a future with him though. But he had me on the couch after dinner, and said to me “would you see yourself marrying me?” I did not want to offend him, and said yes. However, all I could think of… was <em>wtf was he talking about? It’s just date number three</em>… he began seducing me soon after he said that, and I was toast.</p>\n\n<p>I recall thinking that although that was red flag number two, this new adventure was exciting and I easily forgot what had just happened prior to the sex. He was odd at times though. I felt like he would talk down to me. I was fully educated and had several degrees. He had none. But maybe this was his way to feel like the man. I don’t know. His mentions of past relationships, seemed to be awful everytime. He said women abused him and verbally as well. It made me aware of how I spoke around him. Not that I am abusive, or controlling. I am quite passive actually, however he made me extra aware around him as though I had to walk on eggshells. That was another red flag.</p>\n\n<p>The more time passed, the more he grew on me. We emailed dozens of times a day and night in-between every single day. He was attentive and always asked how I was doing. He asked me to be his girlfriend by date number four and I said yes. What else was I going to say? It felt weird that he had to ask me, but also… I felt it might be something suggested later on. But this was not the kind of experience I had had in the past. Maybe older men were just this way. They wanted to commit.</p>\n\n<p>His conversations began to change. He wanted me to do more crazy things in bed with him. He asked if I minded bringing some shower curtains, baby oil and whatever other toys I wished.</p>\n\n<p>I went out, and bought everything I could think of and gathered an actual carry-on and filled it with all these things. I got ready as per usual on the Friday night. And headed over to his place. By the way, he kept his apartment pristine. Everything was neat, modern and organized. I thought those were good traits. He had a room for his daughter, a room where he kept his geeky collectibles, his bedroom was in good taste and overall, it was immaculate really. He lived a little secluded in front of a big park in a duplex owned by an older Italian couple. I didn’t meet them, but since it was Christmas time, they had brought Paul a huge amount of leftovers all made from scratch. I thought, <em>how typical it was of us Italians to be generous this way.</em> I am Italian Canadian by the way.</p>\n\n<p>That night he surprised me with dinner. He did some things in the kitchen I disapproved of but I did not bring them up. Having cooked for so many years and working in restaurants, I know protocol for cooking chicken. And he did not seem to follow basic rules when it came to handling chicken. He also mentioned reheating entire meals out of sheer laziness rather than taking just the one portion and heating that alone. I did mention to him that you cannot reheat the same dish over and over again, especially with red sauce, cream and meat involved. He didn’t care and sort of snapped at me about it, that he would still do it and it was fine. That was another red flag… I lost count. But my mind put it aside and ignored it. He also brought up being divorced and the reason he ended it despite a baby involved. He said she was too much of a morning person and he was not. And that her taste in music was not his. I did mention those were not reasons to get a divorce and he changed facial expressions, and subject quickly. He had me puzzled when I least expected it. But always found a way to distract me from what had just occurred.</p>\n\n<p>That evening, we were supposed to venture into what was for me the unknown with all he asked me to bring. I opened my carry-on and showed him everything I brought including stilettos. He did not seem impressed. He began acting strange. I began to feel strange as well. I felt, light headed. I thought a migraine was coming on so I excused myself to take a pill and drink water. I began to wobble and soon collapsed. I came to and felt that I had no clothes on. I could feel the pain of me having fallen hard. I could not speak or move much. What was going on? I soon realized, it could not be my medication, it was something else. I had been drugged! I could see Paul hovering over me, feel the wood beneath my naked legs, and he was dragging me. His face was serious, and his eyes… his eyes were pitch dark and inhuman. Wtf was going on? And what was going to happen to me?! I felt myself being dragged into his collector room. Wait a minute this was a different room. Not the same. Where were all his Star Trek action figures?</p>\n\n<p>He plopped me on a couch and I heard ripping noises. That was duct tape. Panic instilled inside me and I could not move, my eyes were in part covered with my long hair and I could just hear everything he was doing except make out his words. They sounded like they do in tv shows when people are drunk or stoned and they have heavily distorted voices.</p>\n\n<p>I felt my ankles being taped up and then my wrists. I wonder how long I would be dosed for. I tried moving my legs to kick him but nothing worked. I managed to keep my eyes open and I was aware. What was it he gave me? Was it in the food, my water? He taped my mouth and grinned down at me while wiping the hair away from my eyes.</p>\n\n<p>The fucker! What kind of fucker asshole was this? He left this mystery room, shut the lights, and closed the door. I was now naked, unable to move, gagged taped down somewhere. And didn’t know what was going to happen to me or who the hell this guy was anymore. Thankfully I could think pretty clearly, just my body wasn’t working.</p>\n\n<p>I tried hard for what seemed at least thirty minutes to move. Nothing. He returned. He was holding, the clear plastic shower curtain in one hand, and a toolbox in the other. I really began to panic now and moans were actually coming out of my throat. He must have seen the panic and it seemed to feed him. This was not some innocent random hurting man on Craigslist seeking a friendly shoulder. This was a fucking psycho killer! Or god knows what the fuck else!</p>\n\n<p>I started forcing with all my might to get my legs to move. I felt piss coming out of me and the heat of it. I felt the warmth of it. That had to be good right? I remembered reading somewhere where hostage cases defecated themselves and made themselves dirty so their kidnappers would be repulsed and leave them alone. This calmed me down and I tried hard now, to defecate myself. Yes I tried shitting myself even if I could not feel a thing down there.</p>\n\n<p>He approached me with the plastic shower curtain as he was unfolding it, sniffed towards me and started swearing like hell. He was pissed and was throwing down the curtain to come take a look at me. He said and now I heard him clearly, “You fucking cunt you pissed yourself and my couch you fucking bitch!!!” and I saw his hand raising and coming down on me, but the blow was numbed out. He had blood on his hand so I realized he broke something or sliced me open somehow. Thankfully that pain was not kicking in yet. When you are in a situation like this, which counts as life and death, you block irrelevant pain out.</p>\n\n<p>I tried harder to see if I could shit myself literally. At this point, that was going to be my way out if anything. I needed to feel my legs and arms. I needed that shit to come out of me the drugs and whatever the hell I had inside my bowls. To repulse this fucker, and to get the drugs out of me. I didn’t care about his couch. Fuck him. I also had to find a way to make noise and alert his landlords just below me.</p>\n\n<p>They were Italian, and this ass was not. I could communicate with them in Italian somehow, and keep this bastard in the dark a little fraction of a second. To buy me some time at some point, in my escape. Because after all the shit I had gone through, this fucker was not going to be the end of me. I was not going to go down via some creepy fuck off of Craigslist!</p>\n\n<p>He rushed out of the room I heard rummaging and he was talking to himself, and he had left that door open. I felt tingling in my toes and knew I was beginning to feel some parts of me and the drugs were wearing off. He could not know this. I had to shit myself. I focused with all my might, and I felt uncomfortable squishyness in my rear end, and the odor alerted me that it had worked. This, was disgusting. This… humiliation better save my ass, literally.</p>\n\n<p>He came storming back in with paper towels and all sorts of cleaning products, and then he dropped it all on the floor and rushed straight back overhead me and beat me hard. He called me every name in the book, and knew I had shit myself. He stormed out again. This time, I felt, everything. I could not let on that I could feel though. I just lay there, in agony. I felt my nose was broken, my ribs must have been broken, I felt searing pain so something was clearly open flesh and bleeding down in my mid-section.</p>\n\n<p>I heard the front door slamming and his footsteps rushing downstairs. I also heard the start of an engine and I immediately threw myself off the couch and rolled on the floor with a thud. I was facing the floorboards, and put my ear down to listen if anyone was downstairs. I heard what sounded like a tv, and some faint chatter. I tried moving but could not flip myself upwards to my side. I had to do something so I slammed by toes downwards on the floor- hard. I did it over and over. I heard the tv go silent downstairs, and movement so I continued slamming my feet down and knew my toes were broken by now. I just kept doing it. I found the will to shift my weight and turn to my side facing the door. I slithered myself to the door and kept banging my heels downward hard. I felt my body making streaking noises which were a combination of sweat, feces, piss and blood. I could not care less. I needed someone to come find me even if it meant in this state.</p>\n\n<p>I heard the door downstairs being jiggled with a key and the downstairs door opening. The stairway before entering his apartment echoed. I heard a male voice in broken English call out. “Helloooh?”</p>\n\n<p>I was trying to shout through that fucking duct tape, and banging with my heels and whatever body part I could including my head. Again, “Helloohhh?” I banged more. I heard the door close and it was quiet again.</p>\n\n<p>I was now crying. My only fucking hope just left and didn’t even come and check upstairs! I continued banging downstairs. I didn’t care. Then I heard the door opening again. This time the steps were hurried upstairs. This man was young. He said “Fuck me!!” and he rushed over to me and whipped his cell phone out. He banged hard downstairs and dialed 911. What a sight I must have been. But as he crouched down to me, about to take the tape off my mouth, when Paul… the fucker, he was standing behind him and hit him on the head with a crow bar!</p>\n\n<p>I was crying and left starring into the eyes of my rescue angel, bleeding on the floor, next to me. The only thought I had in my head was, “it’s over I am dead. Fucking Craigslist. Please God protect everyone else from ever finding that fucking website and make it come crashing the hell down.” I blacked out while screaming the loudest I ever could through that duct tape.</p>\n\n<p>-------------------------------------------------------</p>\n\n<p>I woke up hearing beeping sounds, electronic ones. The room was so bright. It was hard to open my eyes. Someone was standing over me. I heard, “she’s awake!” and shuffling of footsteps. A female voice asked me my name, what day it was, where I lived. I answered in a robotic monotone voice I didn’t recognize as my own. I barely got anything out. Why was speaking so hard?</p>\n\n<p>Suddenly everything became clear. I saw a doctor, several nurses perhaps surrounding the end of what was a hospital bed. Did not look familiar to me. I knew the hospitals well, and I could not place where I was.</p>\n\n<p>I heard a voice saying loud and slowly…</p>\n\n<p>“You are cleared of danger. You are safe. You are at the hospital. It’s been two days since you were admitted.” I nodded to show them I understood. I felt I could not speak much yet. My throat was dry. I felt pain everywhere. I winced with every waking moment now.</p>\n\n<p>A police officer approached me. He gave me his badge number and said some technical information that escaped me as soon as he said it. I jerked my head up at the mention of Paul. His real name wasn’t Paul. He was a known sociopath called Gary Winston with previous string of assaults and jail-time. ID theft, impersonation, and so many other online crimes. He was a known predator. He was known to have kidnapped and almost murdered many women over the years. It seems he never succeeded at killing them. There was always something missing, or not enough evidence, and he would get off. No one could put him away for good. He was sloppy. Officer Frontenac  proceeded to tell me that everything I did, was incredible. He said that my strategy of defense could save future victims, and I was very lucky that Joe, the landlord’s son, found me when he did. His last thudding attempts downstairs, alerted his father to also call police. They arrived shortly after Gary knocked Joe out. He protested his arrest and said Joe had attacked us both and Joe was responsible. Fortunately both of Joe’s parents alerted police that it was the other way around. I guess I will never know why this happened. I also question <em>why me</em>. After all I went through, I also had to have gone through a kidnapping, assault, and almost getting killed. Almost made me appreciate my cheating coward of an ex-boyfriend in comparison.</p>\n\n<p>I asked what happened to Joe. And I heard another voice. The angel came forward and I lay there starring in awe.</p>\n\n<p>“YOU! You came to save me! I though he killed you! I thought you were dead!”</p>\n\n<p>“No. He knocked me out. I have a few stitches that’s all. I am good.” Joe offered me a wide warm smile.</p>\n\n<p>The officer continued and said that “Paul” or Gary as his name was, had been arrested. I could file for a restraining order. I was safe for now. Joe reached out and grabbed my hand. I began sobbing and smiling at him. He knew I was grateful. All I know for sure is that, <em>Gary, or Paul whoever the fuck you are, you better never show yourself to me ever again. I will tear YOU apart and make YOU shit yourself over and over if you tried. God help you. And God help you if you tried this with anyone else ever again.I hope to never see you ever again.</em></p>\n\n<p>_________________________________________________________________</p>\n\n<p>Update: After I got better, I decided to move. One night around 4am,  I heard ringing at my doorbell. I ignored it but thought it was really weird. That morning, when I went to open my door, I found the shower curtain at my doorstep. The fucker knows where I live and he is out... I also got a bunch of emails like I had subscribed to porn sites, particularly chubby girl ones. This can only be HIM. I have installed a bunch of security cameras everywhere. I have the back of my front door full of makeshift weapons. I even acquired mace. Listen when I tell you that Craigslist is a fucked up place. Stay away. Don`&#39;t even consider it to browse or post things for sale. STAY AWAY from it. My life is messed up because of one really bad decision. And then ignoring all the red flags that came afterward. I should have listened to my gut.</p>\n</div>\n","author":"creepybee99"}